{
  "lFy17krUJEzFRX2UYsYvUQ": {
    "date": "10/30/2015",
    "text": "Have you had their cakes? No? Then what have you been doing for breakfast? Their seasonal counter desserts are to die for. Have their passion fruit meringue in the summer or their pumpkin chocolate cake in the winter - you won't regret it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8mF6pzJsMJiZaunWfjKkhg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Pumpkin spice cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8mF6pzJsMJiZaunWfjKkhg/o.jpg"
      },
      {
        "img_id": "4rpbdGwOcb7Fu2siCduM0g",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Vanilla financier",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4rpbdGwOcb7Fu2siCduM0g/o.jpg"
      }
    ],
    "user_id": "HBQ-PMxjmTw2rF6swl5i4A"
  },
  "pMrLqpxrQHoGtI7dMHhX9w": {
    "date": "12/6/2015",
    "text": "We had a deliciously crafted vegetarian Sunday lunch. On Sundays, you get to choose three salads and a main for £17. We had a delicious roasted aubergine with lemon yoghurt, harissa oil, flaked almonds and rose petals, char-grilled broccoli with chilli and garlic, chantenay carrots with parsley yoghurt, pickled radish and wasabi oil, sweet potato wedges with roasted red onion, tahini and za'atar, lightly pickled cauliflower, kale, raisins, red onion, cavolo nero and apple. For the mains, we had butternut squash, chickpeas, parsley, manouri and maple filo parcel and a roasted butternut squash quiche with nutmeg, membrillo and Stilton cheese. The breads were delicious too, with sourdough, Italian white and focaccia with extra virgin olive oil.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_FjI1HPo8FUM7lkAqApK2w",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_FjI1HPo8FUM7lkAqApK2w/o.jpg"
      }
    ],
    "user_id": "sEeJqAppGT_P1nrmRQdIMA"
  },
  "A-VMeoa1AO5DG2KGP68cRg": {
    "date": "9/13/2015",
    "text": "A recent addition to  the thriving Liverpool Street food scene. I would recommend siting at the bar because you can chat to the bar staff as well as seeing drinks being made.The food was very good. From the cold counter we had roasted aubergine, walnut yogurt and pomegranate which you cannot go wrong with. Also ordered was a grilled tuna, soy honey, spring onion and ginger dish. Thi was incredibly fresh and tasty too. Some good meatiness to have next to the veg dish.From the kitchen  we ordered hake, tomato harissa, shrimps and kohirabi. This was nice though the sauce wasn't my favourite. Another fish dish of mackerel (prob my favourite fish to eat) came with miso caramel, papaya, pulled carrot and peanut. This was good too but the portion left a lot to be desired.For dessert we shared a carrot cake, which came with some custard. This was insanely good. For someone without a sweet tooth this was a perfect end.All in all the wines and cold counter dishes and dessert made this is a good experience that would make me come back for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "wnjVmP9x5cVMC3enbVqkCg": {
    "date": "3/6/2016",
    "text": "Had a nice lunch here after visiting Spitalfields market. We were a little disappointed about the temperature of the food, as it was the lunch \"buffet style\" service, and the salmon was fairly cold. The food itself was very good, though, and it was nice to eat at a restaurant inspired by the Jerusalem cookbook!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TMIsH18weTsQaUngFjcWug"
  },
  "buc1NZcreBHiQktP2ow7wQ": {
    "date": "6/28/2015",
    "text": "I am a huge fan of Ottolenghi's so I hot footed to the new restaurant in Spitalfields a few weeks after it opened for lunch with my girlfriends (I admit this review was sitting in my drafts for a while!). This new edition to the Ottolenghi family is far more spacious than the other restaurants with ample eat in space. It's the same light and airy atmosphere that you get in other stores. but you are no sharing long benches with strangers this time - you can get your own table. Hurrah.The deal is the same. Piles of salads awaits you. I think there are other options to but I never bother to look at those as the salads are beautiful. I didn't have a dessert here but I imagine they are as good as they are in other branches.   The greeting from maitre de was slightly frosty at first, but I think she slightly stressed out by a recent incident. She then did her best to be make it up to us and friendliness resumed.  Food here is always very good - but you have to know what you are expecting - aka Middle Eastern inspired salads - aka these are cold. Drinks are also mighty fine - there are even boozy cocktail options. I will always be a happy chappy if you take me here. Hint hint hint readers.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOH02K684lzDHKtNanaigg"
  },
  "vWoPIUXk0SuacIJCFpH0uw": {
    "date": "1/7/2016",
    "text": "First time and yes it is all true. This place is cozy like a cocoon, bright and spacious, with floor to ceiling windows, and really good food. We went on a weekend morning to grab lunch. People were still having breakfast and by seeing what they had, I am thinking of going back to try it. They even had toaster plugged in the ceiling, being dropped on their tables to individually grill their own toasts. Beautiful. When you get inside this restaurant, you get to see the food you get. It is exposed right in your face at the entrance for you to see. I did not really know what was going on so I though you could eat from a salad bar, or while seating. Not really, it is to go or to stay. We sat and ordered delicious plates. Especially the eggplants. I was surprised to see rather big plates coming. For a healthy chic restaurant, I was more expecting to see small tapas style plates but no. Staff is very friendly, and made you feel right at home. It very looks like the best place to get breakfast in town, seriously. With all the nice lights, staff and food, there is no way you could be disappointed while there. Will go back if in the area, and meanwhile, will try the other locations out west of the city.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eqTSNQ1fPtfq1vAgFdZJGg"
  },
  "iPg7eeSSys-MtUTm7yDhLA": {
    "date": "6/25/2015",
    "text": "Where food meets art and adds a splash of happy and healthy. (Until dessert time.)I sat at the bar - the lunch rush had booked the place full, but the staff were cheery and willing to let me hang out, look around, and \"get hungry.\" The wait was short, worthwhile, and scenic.Easy to incubate an appetite, for the menu is on display in large dishes on a banquet-style buffet table. Literally, food artistry. The many salads to choose from were colorful and varied and, to my liking, plenty of light, healthful options. The final decision was arduous to come to.Following a meal, there are just as many desserts as entrees (if not more) to choose from. So you absolutely are obligated to save room. For they are epic.Chat with the bar staff (I lingered past the lunch rush) for they are charming and entertaining human beings. All the staff were friendly, helpful, and enjoying the atmosphere and food scene just as much as this charmed consumer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tmROxMAlBB7islvNyoCp1A"
  },
  "Sg6MXcADUfeQj3bZCJkwUQ": {
    "date": "7/14/2015",
    "text": "A couple of weeks ago my mother paid me a visit and such visits always mean that I get to pick a restaurant. I had heard good stories about Ottolenghi and I have extensively browsed through the recipes that are published on the Ottolenghi website. I was delighted to see the salad bar when I entered the restaurant. I am no vegetarian, but have for years preferred to plan the dishes I eat around vegetables. I feel that vegetables are truly made the hero of each dish in this restaurant. Moreover the flavour combinations you are presented with are really interesting and not predictable in the slightest. A minor point of critique is that the proteins you can order to go with the salad are also served cold and I didn't expect this. The salmon and the beef my mother and I tried were still delicious though. Good, inspirational food? Check.Vegetables? Check.Nice, clean and light ambiance? Check.Friendly staff? Check.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBCWMtzPMt00xIE5ntRSQA"
  },
  "QqBLDvR38uZ7b72Bfn7e2A": {
    "date": "8/23/2015",
    "text": "My favourite restaurant in London. I have eaten at all the Ottolenghi's but this may be my fave. I love the line-caught tuna paired with one of the most amazing salads. I would be happy eating every meal, every day at this wonderful establishment. I can't wait to return!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T4htRsVXjOi3D3xDi8NIHA"
  },
  "WBx2e70VmcYchndRqxDp-g": {
    "date": "11/6/2016",
    "text": "This place is a solid 5 for 5 on food. The Pumpkin dish just rocked. The wine we had was amazing too. Great selection there. However, while the server was nice, was quite busy and did not attend to us until after our meal. I had to refill our water and wine glasses the entire time, and our finished plates sat in front of us for a long period of time after completion. Definitely would go back, just wished we had better service when you're paying over 50£ a person.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VlTzdmiWJQcNoDdoeWZO3g"
  },
  "3NpGq-tfIkQ-XswgWFHujg": {
    "date": "7/5/2015",
    "text": "I'm a big ottolenghi fan and was a big underwhelmed by some of the main dishes but perhaps I was hoping for too much. Quite expensive for what it is and not as many veggie options as you might think. Some delicious dessert though",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3v29bKfC3dkPZrRfGu1wQ"
  },
  "A3A03OEw_6hxHNEi2_NGIw": {
    "date": "6/29/2015",
    "text": "Love cooking the recipes so it was a must visit and did not disappoint. Hot and cold tapas style plates. Salads are amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gf-z_toDWbuSVnT98fpS-g"
  },
  "pgOjyfoo04VkvJSTMnk_CQ": {
    "date": "10/14/2016",
    "text": "Good fresh food, really can't go wrong, but you can read all about that in other reviews. I would like to highlight something that was missing in the reviews when I searched for the word \"vegan.\" While this is not a strictly vegan restaurant they can accommodate for this. I let them know that I was looking for vegan options and they were able to adjust some of their dishes for me, and they were all delicious. And on their own they were some of the best vegan dishes I have had anywhere. So, if you are vegan, feel free to come here. If you are extra worried (since the menu changes) call ahead and confirm. Excellent service. Recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Ho2TB2DGPm2TNsS9NRhwg"
  },
  "XdLYqvZ5d_F5IGWMQhyjtg": {
    "date": "5/19/2016",
    "text": "We came here for dinner instead of the Islington location by accident & were able to get seats at the bar.  A lager and an IPA, sea bream, pan roasted cauliflower, wontons, and 2 types of cake (one dairy-free for my friend and one flourless almond and orange cake with chocolate ganache) -- all delicious.  Total came out to 32 GBP with an added optional 12.5% gratuity (same as Nopi).  Happy to pay it, you get what you pay for, and a nice way to round out a trip to the UK.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kd9V3zxmCSttpbSlR7z4gw"
  },
  "gU-fWFS8thlSQqWBrn1QQQ": {
    "date": "1/10/2016",
    "text": "Being a bit harsh even though the food was really good because the service was unimpressive. We have been to ottolenghis other restaurants and had fantastic experiences but here it's incredibly slow and the waiter Daniel wasn't really welcoming and attentive. Would hesitate returning because the experience went from a potential \"wow!\" to \"meh, good food but don't want to deal with people's attitudes\"",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dMBzfEZVid6__5D4D5IgBw"
  },
  "fa6sBD4HPXIVa5Xcm1tw-Q": {
    "date": "6/9/2016",
    "text": "Food excellent, and they were accommodating to my \"other cultural needs.\" Try the desserts, seriously.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NzoxEgkB7NmfzbUTpxHZqA"
  },
  "6a83KxtWxNH7o81BbwwZnQ": {
    "date": "5/28/2015",
    "text": "Perfect food, tapas style portions though. Coriander Margarita was awesome. Brilliant olive oil, perfect company!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M5cP1EfkuSBqtec8rgZzUA",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Dinner Time",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M5cP1EfkuSBqtec8rgZzUA/o.jpg"
      }
    ],
    "user_id": "1kheIHrNq_3OphGJhWQKkw"
  },
  "tNhEkqxXQ9sEyaF2qxPaNQ": {
    "date": "9/19/2015",
    "text": "Another fabulous Ottolenghi restaurant hidden on a quiet street near Liverpool street station. I have been to some of the other Ottolenghi restaurants but this one had a very different vibe. Instead of the typical Ottolenghi choice of a selection of salads in a big bowl, this one has all the salads listed tapas style. Making them easy to share with a group. There were also options of hot tapas rather than the usual cold premade salads. We went with the aubergine (always a hit at an Ottolenghi place) the green beans, the scallops, the seared tuna, the lamb, and the labneh. The scallops and the ahi tuna were both amazing, and the sauce that came with the tuna was divine. I found myself pouring it over the remainder of the green bean dish, as I felt it needed a bit more flavor. We made sure not to order too many dishes.. so that we had room for some of their decadent desserts. I went with the maple, apple cake which was delicious and moist and sent me into a sugar coma quickly after.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kgiN2z5AIvcMK5PIwFLrsA"
  },
  "1MWHAZLs2x2buyr0GYZOWg": {
    "date": "3/23/2017",
    "text": "I'd heard great things about this restaurant from YouTube videos. We visited the Spitafields location which was nice. The ambience looked nice but we were placed at a makeshift table near the door because we did not have a reservation. There were empty tables and space at the main bar that could have easily accommodated us. The seating area was uncomfortable, every time patrons walked in or a Deliveroo driver came in we felt the chills of the evening.We downsized our order because the seating situation was just too uncomfortable. However the two dishes we had were excellent and packed with flavor. Note that this is more of a tapas styled restaurant so you'll need to consider that when ordering. The prices were steep but the food was delicious. Had our seating arrangement worked out I would have rated it higher.Also loved the hand soap in the bathroom. Random.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gWJXXXX8IaL0vqyqHQvBUQ"
  },
  "fawNqYzSXydOPoyMzMBq2A": {
    "date": "11/24/2016",
    "text": "I came here on a Tues night after being out in the cold on a walking tour for a few hours. The warm ambiance and candles were quite welcoming. My husband and I are vegan and saw they had options so we went for it. The restaurant and staff are really lovely and accommodating to modify dishes to be made vegan. Service was a tad slow but the restaurant was full so I understand. Food quality and flavor was really good and the artisanal bread was really fresh. We truly enjoyed the food and thought it was more French and noticed nothing making it Mediterranean. The only downside was the lack of protein for vegans. No bean or nut options in dishes. Nonetheless we were happy to find something nearby - we'd come back but not too hungry.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y6Y77MtWRIp2EqU75T1tHA"
  },
  "IwOpwIjuTgNOOQhDzj3wBQ": {
    "date": "4/7/2017",
    "text": "Excellent and inventive cuisine.  We have three of his cookbooks and this spot lived up to the reputation.  Kibbeh was delicious as were the eggplant and Brussels sprouts with apple salads.   Get the apple cake with maple frosting made with olive oil...amazing!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-BmgLlR_ldZhdUjnou_jg"
  },
  "qY36AkuQ7iaz4ltBdK5zAg": {
    "date": "6/15/2016",
    "text": "I didn't know Yotam Ottolenghi from my elbow, but a smart friend introduced me to his food, and I'm sure glad she did. We snagged a reservation to this Ottolenghi location relatively easily, and then we were off for our dinner the next evening. I liked how the restaurant was located on a teeny street. You sorta get that secret feeling even though judging from how packed the place was, Ottolenghi is no secret.Internationally-influenced Middle Eastern tapas are the name of the game here. You get to choose from two lists: \"From the Counter\" and \"From the Kitchen.\" Basically \"Cold and Already Prepared\" and \"Hot and Will Need to be Cooked in the Kitchen.\" Prices are in the £10-15 range.Our server recommended 5 plates for 2 people, and she was right on. Well, she didn't include dessert, so 5+2. I am not sure if I had a favorite dish (can it be a five-way tie?). I was really impressed with the veggies at Ottolenghi. I could be a vegetarian if I lived here, no doubt. Lamb rump, pan fried sea bream, pan roasted cauliflower, roasted aubergine, and broccolini were all delightful and crazy flavorful.For dessert, I opted for the carrot cake. The portion size was reasonable, though taste-wise I think I've made carrot cakes before that were better. There are more desserts available than what's listed on the menu though; check at the front counter.Service was very polite though got a little less attentive in that lull after mains and before dessert. The bathrooms are downstairs and consist of a bunch of stalls for men and women to use.I was reading about Chef Ottolenghi on Wikipedia, sounds like an interesting guy. Grew up in Israel, has a masters in comparative literature, and loves Pilates. Dubbed \"the man who sexed up vegetables.\" True that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "De8koO26NgVx9GkII-bgwg"
  },
  "j5n0gh-sT8SHnLL0ATQkzQ": {
    "date": "6/13/2018",
    "text": "Gorgeous food and very friendly service. They have a wonderful array of creative vegetarian dishes--lots of bright flavours enhanced with good olive oil and fresh herbs. The food is healthy and veggie-centric without seeming low-fat or meager, and the variety of dishes makes it feel like a feast. This is definitely a place where sharing is the way to go. Their hot fish and meat dishes are also wonderful. The presentation of the food is attractive without being overly fussy. This is just good, homemade food that tastes like it was cooked with a lot of care. The restaurant also has many homemade desserts (mostly cakes) that are delicious. And they offer interesting non-alcoholic cocktails, which is always a plus if you want something fun to drink but don't feel like boozing. This was a great dining experience overall. (In addition, the waitress was witty and efficient, and the space is very clean and modern. Nice!)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "V0NyT2fKIs7pwFDSGqyCKQ"
  },
  "0PROEZLKlHR8sAiYC76b9w": {
    "date": "7/27/2016",
    "text": "Another fabulous birthday meal at Ottolenghi! The food here gets better every time I visit. This new branch has a fabulous ambience and the staff are rather sexy ;)I had the stunning baked egg dish along with the beetroot one. Both were gorgeous and portioned like tapas, but the accompanying bread and olive/nut combo really made it all a perfect meal :D",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 8
    },
    "photos": [],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "-OA3rExMxlvPKFDnQsBmRA": {
    "date": "9/1/2017",
    "text": "Another completely fantastic dining experience by Ottolenghi! Great combinations, wonderfully developed flavored, small plates (as recommended by our waiter Harry, 5 between two people was perfect), special wines, welcoming hostess, cozy atmosphere, very nice service. More relaxed than Nopi but every bit as special. Roasted aubergine with Aleppo pepper was amazing. Hake was perfectly cooked. Tempura courgette flowers were delicate, nicely stuffed and so tasty. Wonderful wine list, interesting cocktails, nice tables, perfectly paced service, good noise level for conversations..... What more could you want?Oh dessert- Who knew they had such a wonderful bakery? Actually, the world will soon know when SWEET (the new book) is released next week. Ottolenghi gets it right by every measure.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DjdEcBseT7iT4cd7kaRNcQ"
  },
  "zip35-EeR8WcvTKQbUvf0Q": {
    "date": "8/15/2016",
    "text": "Just had dinner here- lovely atmosphere, genuinely pleasant restaurant. Food was delicious and wine quaffable. It is, however, expensive. The dishes are in fact tapas sized and as such make it an expensive place for dinner. £9.50 for what was a third of a leek with some cheese and bits and bobs is steep. The same again for broccoli and edamame beans with chilli is extortion. I was just expecting main sized portions- would have chosen a cheaper restaurant had I realised. Puddings were on the large size however and reasonably priced. Bottle of prosecco was £36. ouch. and they forgot the tap water- a bug bear of mine.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0tXZ3N0WZYzFsj6Ep2adGw"
  },
  "EwQjxzGrJnCxqwuHCmvtDA": {
    "date": "3/4/2017",
    "text": "Great fancy restaurant. They have 2 different menus, one that are room temperature foods like salads and the other are food they make in the kitchen i.e. hot food. It's sort of like tapas sized portions so I got one salad and one hot food and it was just the right amount of food for the night. It was very fancy and delicious, I'd come back here to show off some of the more arty foods of London to anyone visiting!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hJaZck6Gj2UYCxCyoui2NA"
  },
  "4RoY0mcNVrx-OwvmX1hfCQ": {
    "date": "4/11/2016",
    "text": "My mum has been a massive fan of Ottolenghi for the past few years and is religiously collecting all of his cookbooks. (Mainly because I get them for her, but she really does love them!)So when I knew my parents were going to come and visit me in London, I was a bit of a nobrainer: I was going to invite her out to eat at the restaurant of her favourite chef ever.Having already experienced Nopi a few months back, I kind of knew what to expect. Excellent and relatively simple food without having to break the bank. Ottolenghi in Spitalfields offered a similar experience.I booked our table for 1pm a few weeks back - and I would recommend reserving if possible, it gets packed quickly.The venue is relatively simple and straightforward, and the service is fantastic.The lunch menu is a series of fresh cold dishes that you can pick a selection of for about £15 per person (£21 if you go for a cooked option).The mix of flavours, the quality of the ingredients and the size of the portion make it an excellent value for money experience. Note: if you are just passing by, it is possible to pick-up your lunch for a take-away as most of the lunch food is served cold. I would definitely recommend indulging in the deserts, completely worth ending a great meal on a sweet note.All-in-all: I really admire Ottolenghi for opening this easy-going and accessible venue where you can eat delicious food without having to re-mortgage your house. Both Nopi and this place are now on my top recommendations for places to eat in London - if you can get a reservation that is :)",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "vcSC9l4Bn0MVSVw9qQuFaw"
  },
  "OpJ7m1h1wBxWS3d461ayow": {
    "date": "10/7/2015",
    "text": "Great service and fantastic first impression with food display as you walk in the front door. Had brunch off the al la carte menu and was a little disappointed. I had French toast which was yum but too much of the one flavour. My mum had the polenta and sweet corn pancakes that were more like corn fritters, very tasty but felt dressing on side salad was too salty. Next time will try the dessert and coffee which looks amazing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4V8FgCAym6HiFauovmUjDg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Dessert cabinet",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4V8FgCAym6HiFauovmUjDg/o.jpg"
      },
      {
        "img_id": "xxgC-x2EH1XttyYfoCxUUg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. French toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xxgC-x2EH1XttyYfoCxUUg/o.jpg"
      },
      {
        "img_id": "uFgI8GcdLcBDNCmWsqah9g",
        "caption": "Photo of Ottolenghi - London, United Kingdom. French Toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uFgI8GcdLcBDNCmWsqah9g/o.jpg"
      }
    ],
    "user_id": "yYLM95gl0mlNF53GBTApFA"
  },
  "LerosAWm6nb_K1muw1K-fA": {
    "date": "2/8/2016",
    "text": "Ottolenghi is a well known name whether its via the cookbooks or the restaurants.  so when i found out i was having a weekend in london and saturday morning called for a brunch date before parting from my boyfriend for the day i was super excited to see a Ottolenghi restaurant nearby our hotel.  now this wasn't my first brunch choice but after my other choice offered my the early 8:45am table time i decided the much later time at 9:30am at Ottolenghi was the way to go.the restaurant is on atillery lane about a 2 minute walk from liverpool street station.  it's all clean lines, and white space which makes the whole place feel airy and fresh.  there's a white bar along the front of the restaurant and a massive table with all their cakes and salads spread out right across from the entrance.  they had two long centre tables with toasters plugged in for people that ordered the bread board to make their own toast. (i find this an odd thing as if i want toast i'll save myself the money and just buy a loaf of bread from the market and toast it at home...restaurant toast on its own is way pricey).the breakfast/brunch menu isn't huge but has a good list of about 10 items to choose from.  all of them sounded delicious and even on the healthier side which is a bonus.  i went with the braised eggs, spinach, and leek and the boyfriend had the ham hock and butter bean stew with a fried egg.  we sipped on flat whites while waiting for our food which were strong but also really good.food arrived in good time and i was super pleased with what was put in front of me.  a wooden board with two pieces of fresh foccacia and a little skillet pan with two braised (similar to baked) eggs on top of a pile of sauteed leeks and spinach topped with preserved lemon oil and feta cheese.  it was a seriously moreish dish with super fresh eggs and runny yolks to mop up with the bread.  we also shared a side of avocado that although quite tasty was well over priced...since we had time, we had breakfast dessert and shared a pain au chocolat and an almond croissant.   now i debated between 4 or 5 stars but then remembered the almond croissant and decided the extra start belonged to this croissant.  it was huge, freshly baked, and chock full of almond with buttery layers.  i'm sad that i'll need to visit london again in order to taste it!  the pain au chocolat was also really tasty but the winner of the meal was the almond croissant.so Ottolenghi lived up to expectations and more.  for a two course breakfast in london i thought the price was ok, £20 each which isn't that experience when i think about what we had to eat and how fresh the ingredients were.  i'll happily re-visit one of his restaurants next time i make it to london.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Z_xbO-Iaxbx-ZRPhLJK-Ew"
  },
  "V9D2xValth-28t6ojiIYew": {
    "date": "7/16/2016",
    "text": "Came in for breakfast. I made a reservation on OpenTable, but the place was empty when I showed up. The service was so-so considering the accolades of the restaurant. The coffee was very good, and the Shakshuka was excellent as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXhscxwFTd-ayLTdPx_2yA"
  },
  "mQv2VgjWBdXY7b_ydRqyDA": {
    "date": "1/11/2016",
    "text": "The place is very expensive but I guess everyone knows. Once you get over the price, the food is absolutely worth it! I have never tasted anything that delicious. The flavours are from another world, so rich and full of aroma. The place is set up with a long table though the center of the room which can be a little awkward as it's not the place to mingle. Vegetarians have a great choice here and can choose from various cold and warm meze like dishes. Food absolutely amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TmAyrqkHPd81ItIgoCQ4RA",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TmAyrqkHPd81ItIgoCQ4RA/o.jpg"
      },
      {
        "img_id": "Q57NefDzKyuu1aYMQwbHSw",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q57NefDzKyuu1aYMQwbHSw/o.jpg"
      },
      {
        "img_id": "VcVMlNIH6TAqlZ5XBcSZig",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VcVMlNIH6TAqlZ5XBcSZig/o.jpg"
      }
    ],
    "user_id": "QA9LBKDFveVd_jSPpDWQng"
  },
  "6mxCfL0n__DkpZ7lYczELg": {
    "date": "10/24/2017",
    "text": "Excellent Food Selection. The Orange wines were unique and refreshing.  I typically do not order dessert however after the excellent meal I felt it would be worth it and it was.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O95UQVShks341fkQ0CTznQ"
  },
  "--uSadDo1fx0rar_POtJIA": {
    "date": "2/29/2016",
    "text": "Incredible brunch was had here this past weekend. We were able to book a table for 6 people and from arriving we knew we were in for something unique as there was a toaster on the table! We got a bread board to share so we could try the homemade spreads - their chocolate spread was out of this world (step aside, Nutella!) We all ordered differently off the brunch menu for mains and not one of us had any complaints - I had the ham hock stew and not only was the portion enormous but it was just delicious. Lovely waitress too who really looked after us. And save room for cake - the cake counter is packed! I had a peanut butter s'more and it was Devine!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MwXk1HuRzc1zQvveEYOiFg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Ham hock stew with egg - glorious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MwXk1HuRzc1zQvveEYOiFg/o.jpg"
      }
    ],
    "user_id": "5s111UbIqEkbc3wclj8wQg"
  },
  "PBIeskoSvoc49X1cXG6glw": {
    "date": "10/26/2016",
    "text": "Good food but definitely only for the experimental. May be too creative for some. Service was good but with mandatory tip it could have been more exceptional. Cozy atmosphere though may be too cozy for those seeking a little intimacy with so many tables packed in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fSGC2s01_B_uoEexGWV4jg"
  },
  "mbkhmoup0oKBQnx6Z0ookA": {
    "date": "12/20/2016",
    "text": "The BBQ pork neck and Short rib were quite fantastic. It is tapas style, so between two of us, 4 dishes was fine. Got the cheesecake as well and it had hints of lemon in it, topped with meringue. Flavors was very good here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bO816gGFAgX_ghDoAngxHQ"
  },
  "VoQsdkEbbfbyHdtGlRvKqg": {
    "date": "6/26/2015",
    "text": "Pricey, but tasty. I chose the 2 salads with main course option. I expected the salads to be cold. But I wasn't really aware of main course being cold. After all it said grilled salmon. Though it was cold, I must admit the salmon was delicious. Apart from that, I guess everything was amazing. They had a wide variety of desserts, which I didn't have time to try out. Probably some other time. Maybe I'll skip the main course then.I really think main course should be hot else, it should be mentioned somewhere in the menu. That was my only disappointment. Brilliant ambiance. Beautiful layout of salads, displayed to tempt you. And there are some sandwiches too.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3srPnKmmrWcdX-ZRrXEuRw"
  },
  "543czUPQB6DNA1oLNDzA9A": {
    "date": "6/25/2016",
    "text": "Visited for brunch.  Tasty Shakshuka (Moroccan egg and tomato dish), with pretty reasonable portions. Tasted very fresh.  Great simple decor (quirky item was a toaster plugged in at a couple of the tables!) and very attentive service.  A good place for a quiet brunch on the weekend when the aarea is quiet and Spitalfields Market isn't yet bustling!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-011DC3U_yyX_oTvC03Vw"
  },
  "qz_cNYp8R4T-pkrRiWigew": {
    "date": "8/15/2018",
    "text": "This Ottolenghi is the best in my opinion because it's beautiful and they have a lot of seating.Sat at the bar and ate breakfast. Don't forget to get a baked good before you head out!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmxuIIpYDy0AI_Mch4VqjQ"
  },
  "jjTvZZtCgMsR2-PyYTobxw": {
    "date": "10/24/2018",
    "text": "I was super excited to try this place out as I have a few of Ottolenghi's cookbooks and have heard great things. Ultimately, while the service was impeccable, the food was good but had some issues and left me feeling underwhelmed.The restaurant is located in a charming neighbourhood and the interior is beautifully modern yet romantic. All of the dishes on the menu are small and intended to share. Our server was incredibly gracious. When we had questions about a certain category of wines on the menu, he brought out several small samples so we could understand the differences and try them out.As for the food - the aubergine was roasted to perfection and had a wonderful texture. The butternut squash was cooked to still have a bit of a bite, which was surprising but worked well with the tahini and sweet red onions. For the \"main\" mezzes, we got the lamb and beef kofta, quail, and cornish hake. All 3 dishes were tasty, but nothing to write home about. The last dish that we got was the burnt leeks, which was frankly unappetizing and difficult to eat because of the stringiness of the leeks. The biggest problem overall was that many our dishes lacked seasoning and were quite bland. Plus, texturally everything was quite... soft, so it felt like there wasn't much variation in what we were eating.By far the best plate of the night was the dessert which we picked out from the bakery window. The chocolate and sesame tart was rich and delectable - I would absolutely eat that again any time.Perhaps my expectations going in to Ottolenghi were too high, but given the hype and influence (and price point!) of this restaurant, I guess I was hoping for something spectacular or more imaginative.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ClMw6SvbhpzfPewRqI1Ytg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Grilled aubergines and butternut squash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ClMw6SvbhpzfPewRqI1Ytg/o.jpg"
      },
      {
        "img_id": "sTNjfNouFxiU5QqsOcJzHg",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Grilled quail, Cornish hake, Burnt leeks, Lamb & beef kofta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sTNjfNouFxiU5QqsOcJzHg/o.jpg"
      }
    ],
    "user_id": "PDrLbWafHL6Djd8xTfH1Jw"
  },
  "-URu6lm7vm9hZG8MsMhPFQ": {
    "date": "8/6/2018",
    "text": "Vegetarians beware.  I was super excited to try this restaurant based on my love of his amazing cookbook.  The veggie choices were several cold salads, deep fried zucchini, burrata cheese and falafel and hummus (which were shamefully salty, cold in the middle and generally uninspired.... I mean come on, this should have been the best bloody dish on the table, it went uneaten after the initial bite)They have an amazing cookbook sitting there on the shelf for sale, but are unable to translate any of the authors inspiration into any of the veggie dishes. I was underwhelmed and even a little insulted by the mediocrity of both selection and quality of the dishes. The meat eaters in the group were all happy and their food looked pretty good. We did not finish two of the three desserts. Dry tart and stodgy cheesecake.  Yikes....Brutally mediocre and with my initial expectations that translates to brutally bad. I will never recommend this place to my veggie friends visiting London. Go somewhere that cares.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPltHv-t9RRocOv4MR9RJQ"
  },
  "NR8k9o3Da2wvjlQM6RGwFg": {
    "date": "11/11/2018",
    "text": "I was inspired by the story of a Jew and an Arab working together to show the beauty of middle eastern cuisine. Coming from NYC I prebooked our dinner in advance to make sure that we will have a chance to dine here during our short stay in London. The place is beautiful, and the service is great as well. That deserves some stars. However, the description of food, the prices, and the flavour all failed. I grew up with middle eastern food, and I lived in Israel. Most importantly my shelves at home are lined with various spices. Unfortunately, somwhere along the line someone failed to translate the beautiful aromatic flavours of middle eastern food into the concept of this restaurant. Here in NYC, we are proud of the growing Israeli cuisine. Each restaurant has their own twist, but for the most part they all use spices appropriately. Long story short, this restaurant would not survive in NYC or Israel if the dishes were prepared the same way. My kofta did not have cumin. Everyone prepares it slightly different, but cumin is a must. All of the food was extremely bland and over salted. All of the food was too salty for everyone at our table. Everything was bland with no middle eastern flavour whatsoever. While the desserts looked great in the window, they were also bland and lacked flavour. The only thing that was good was the hazelnut meringue. I see that people go to this place, and I'm not judge of local flavour as we found food in London to be overall bland and over salted. Perhaps that's what the locals like. I'm not judging their tastes, and I see why they would go here because it's in line with the taste pallet. Nevertheless, this is not middle eastern food not modern nor traditional. Just a shame and waist of money.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ohbi--dbIuxpMXISS0HLsQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Essentially dry cornbread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ohbi--dbIuxpMXISS0HLsQ/o.jpg"
      },
      {
        "img_id": "rRITDLk40IGt8jINYqU-Nw",
        "caption": "Photo of Ottolenghi - London, United Kingdom. This was okay",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rRITDLk40IGt8jINYqU-Nw/o.jpg"
      },
      {
        "img_id": "YfcfklUhvhtjknEnp6ecOA",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Cheesecake just okay",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YfcfklUhvhtjknEnp6ecOA/o.jpg"
      }
    ],
    "user_id": "dTeudRt-2Acd3A7WrqlDqg"
  },
  "eoqFK1-VT8OGCbI4uwLoWA": {
    "date": "11/9/2017",
    "text": "Living 30 seconds from Ottolenghi means that I am in a state of constant temptation due to the scent of spiced apple bakers' confectionery emanating from the delicatessen side of this mini-franchise. I had the highest hope for this duet of sit-down restaurant meets grab-and-go counter, named after the Israeli-chef owner's namesake. The airy, modernistic interior is uncluttered, leaving you to concentrate firmly on the Med/Middle Eastern food. From the outside, particularly at night, it has a romantic yet sexy feel due to the dim lighting. Probably an upshot of it's heavy dependence on natural lighting by way of a middle room glass ceiling and and sleek glass walls.  I think our mistake was coming at 10pm for dinner - they had run out of the Cabrito goat shawarma which was what I was angling for. The wait staff appeared either tired or bored depending on the particular server and took ages to bring out wine, finally bringing the wrong one. I found the menu interesting but not especially inspiring. The duck confit with crushed artichoke and figs, which we both opted for, was lovely in flavour but the portions are rather small and the duck has been taken off the bone and put into almost a terrine-style cube. Just a slightly different image from the one I had in my head - of bone-on crispy and succulent skin. The artichoke and fig was absolutely impeccable allowing some forgiveness in the confusion. The portion of olives, which was at least 5 pounds, reaped around 12 olives without any oil or bread. Disappointing value for money. I had been promised, by goers before, that there would be toppling towers of colorful salads and vegetarian delights. Looking at the brunch menu and the lunch menu, we seem to have been deprived of this at dinner. I am intrigued by the Butter bean mash with padron peppers and jalepeno sauce, the roasted pumpkin with farro, date molasses and feta, and the butternut squash quiche with membrillo and stilton.I don't give up so easily, Ottelenghi. Expect an updated review soon.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bAU2rnnxsO8mv4WU4qHLhQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Duck confit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bAU2rnnxsO8mv4WU4qHLhQ/o.jpg"
      },
      {
        "img_id": "X1OrppmeYjEw3S7x6emswg",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X1OrppmeYjEw3S7x6emswg/o.jpg"
      }
    ],
    "user_id": "zAZpV6TnwXB-bXyhEVBccg"
  },
  "lOL0j1ACtNgIz9F670jCdQ": {
    "date": "9/28/2017",
    "text": "Gluten-friendly afternoon dessert. Delicious.Menu: I had the orange polenta cake. It didn't contain chocolate which I was very happy about! The cake was moist and not too sweet. I need to find this recipe. I will come back for more desserts and to try their lunch or dinner options.Venue:There is an assortment of desserts and fresh items on display. The restaurant has window seating which is great for people watching. Very cozy and very modern decor. Close to the tube and close to Spitalfield market. Service:The staff was friendly and very helpful. They didn't shun me for bringing in my own tea on a cold rainy summer day. I'm pretty sure I was wet and shivering.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jt_ya7IBG1rrF8Lzt31rKg",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jt_ya7IBG1rrF8Lzt31rKg/o.jpg"
      },
      {
        "img_id": "LebmvPLP5nV-Jaq8Kb5yOw",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LebmvPLP5nV-Jaq8Kb5yOw/o.jpg"
      }
    ],
    "user_id": "Ogq2UuBTmEDLoR0sZIiQnA"
  },
  "97dQoGwVp7uceFwTJEL5eA": {
    "date": "1/8/2018",
    "text": "On my visit to Ottolenghi, I sampled every type of salad they were serving! All were very good, but the ones that I found particularly memorable were the roasted aubergine, tandoori cauliflower, and butter bean mash. If the food weren't so expensive, I would try to eat healthily here everyday. It's definitely a struggle to turn a blind eye toward their pastry section though!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0OdppmGUGSa4JyeYHJtiFQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Ottolenghi Pastry Corner (2/2)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0OdppmGUGSa4JyeYHJtiFQ/o.jpg"
      },
      {
        "img_id": "pVm1yCFT7VYBJF3Apc8ryw",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Ottolenghi Pastry Corner (1/2)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pVm1yCFT7VYBJF3Apc8ryw/o.jpg"
      },
      {
        "img_id": "NW8cJiMIjvr34ezW3e7ijw",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Ottolenghi Salad Bar (5/5)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NW8cJiMIjvr34ezW3e7ijw/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "Sgi22BxAhlP5OvD7WpdAEw": {
    "date": "6/13/2018",
    "text": "Disgraceful.made a reservation on Open Table for 1015. It was a bit late, but this is a restaurant with a great reputation. When my group walked in the door at 1016 I was warned to move quickly because the kitchen was closing in 15 minutes? I asked why they took a reservation at 1015 then? No good response, no apology, no here is a free thing cause we messed up.Then of course had a rushed meal where the apps came out before the wine and the mains were out before the apps were finished. Of course the kitchen was out of several items. There were some good dishes (falafel for instance), but overall it was lacking especially the starters. Interesting one of the servers confirmed the current starters were not particularly good. I would have given it 3 stars on the food quality. Additionally when I went down to the bathroom they were in a total state of dis-repair. My desert was fantastic though. Overall for a restaurant with a great reputation this was a disgraceful performance that suggests they have expanded too fast",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_f_U4YegzXZ8eABMBn9nLA"
  },
  "92babi8hnYwyCQtEFyOS2Q": {
    "date": "4/14/2018",
    "text": "A really nice, chilled out place for brunch in East London that has a pretty diverse menu. Order toast and you get toaster plugged in from the ceiling. Staff are friendly and attentive, and service is pretty quick even when it's busy. They do a lovely hot chocolate. I had the shakshuka - egg yolks cooked to perfection and mildly spiced. Their focaccia bread is toasted the way I like it - sprinkled with olive oil and put on a grill. They accidentally dropped one of my bread slices on the way to the table but immediately apologised and replaced with a whole plateful of bread - always appreciated! I've had the French toast here before but didn't like it as much, but that more reflects my own personal taste. Perfect brunch place for friends or taking your parents!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aN9iezPLhsybP8W0e52m1A",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aN9iezPLhsybP8W0e52m1A/o.jpg"
      }
    ],
    "user_id": "uqPU8-MNh6E0JpjC3zEIqQ"
  },
  "7EFCmdw2cNdxFpnxkiCKOw": {
    "date": "7/24/2018",
    "text": "Very nice place to lunch! To highly recommend! Fresh menus, nice big place. The service is perfect as well as the dishes",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8cQs2U8-sJAgv3ojNA9xA"
  },
  "HH9JTO5Bbo3LVYnXaq0kTw": {
    "date": "6/27/2018",
    "text": "There are several Ottolenghi restaurants, but I have been told all are good, but I'll just remind my vegetarian friends that his cook books are plant based, and although there are meat dishes, his reputation has been made on how he handles plants.  Reservations are not always easy, but if you are offered a place at the bar, we had a fine supper there with friendly helpful staff.  We were advised to order a cold and a hot dish each, and we did.  And although there are deserts on a menu just walk over to the pastry bar and let your salivary glands do the choosing for you.  We will try to visit his other restaurants next time in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NdZVuuN0f74bicgzqFwo3A"
  },
  "kt2rttMoTxTvQ1_mndN8fQ": {
    "date": "11/29/2017",
    "text": "What a wonderful resturant.   I was a little worried that it might be to organic and vegetarian but it ended up being well prepared well portioned, great flavor and texture combinations of good food.My husband and I enjoy eating most meals tapas style. We were so pleased with everything we ordered.We had dinner one night and breakfast a few mornings later.The beans with lemon tahini sauce was so fresh tasting,  the shaved kohlrabi with browned shrimp, and Greek olive oil was fantastic.There is also a bakery at this location and it's hard not to make an excuse to buy something to snack on.The atmosphere was relaxing and surprisingly quiet. The wait staff was pleasant and efficient.It takes a little walk to get there from the Liverpool station (but it's the better station to arrive at) but it is more than worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5uD78o1GLt7S6WbjTrikew",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5uD78o1GLt7S6WbjTrikew/o.jpg"
      },
      {
        "img_id": "H8zesQ2znZ6gIQWUG17MsQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/H8zesQ2znZ6gIQWUG17MsQ/o.jpg"
      },
      {
        "img_id": "AwMB1lTIy5dtfO88lP1K7g",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AwMB1lTIy5dtfO88lP1K7g/o.jpg"
      }
    ],
    "user_id": "2LiI5RuIezDqL5ZFds_0iA"
  },
  "nxqF2DsAzSNiz3tm6hD6oQ": {
    "date": "11/6/2017",
    "text": "My wife and I came for dinner. We got there early and sat at the bar for a round of drinks. I had the Sumac martini which was Ketel one vodka, sumac, velvet falernum, lime, pomegranate juice. It was delicious. For dinner we had the Roasted sweet potato with figs and rosary goats cheese, the confit duck leg with crushed jerusalem artichokes and figs, the seared line-caught yellow fin tuna with soy, ginger and spring, onion sauce and the prawn falafel with tahini, zhoug, amba and velvet tomato.  The food was fantastic. The tuna just melted in your mouth and tasted so good. My wife said the duck was the best she ever had. We also had two really great desserts. My only problem was the service which forgot to order my addition drink that I requested.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FM3hremwwIZCDmqlkUm-fg"
  },
  "808naG5zJM_FqMr7Zl4HRw": {
    "date": "2/15/2018",
    "text": "The menu sounded so edgy in matter of combinations of tastes but the reality was different... no edges just things you could have done in your own kitchen during a normal weekday. The portions wasn't big until the desert came on the table... it was huge. Honest food that was overrated and overpriced.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcavgkTg6dDTywulHKDRTQ"
  },
  "y99MDhm_NagOoLjyhjyrBw": {
    "date": "2/22/2017",
    "text": "After hearing so many friends rave about Ottolenghi's recipes, I was expecting to be blown away by this place. The ambiance was nice (white linens, dim lighting and candles), and some of the dishes were standouts, but I found the menu to be a little bit hit or miss. Most dishes were definitely a bit on the pricey side, and the meal came out to about £50-60 per person (we did order 3 drinks for a party of 4). I didn't find the service to be that great either - it was fine at the beginning but then it seemed like they forgot about us and it took an hour for the dessert + check to come and we were ready to be done with the meal.TL;DR: I'd probably give this - 3.5 stars. I think there are better places to eat in London at similar or cheaper price points. The best dishes for me: burrata with rhubarb and dates, and crushed carrot with labneh, and pork belly. We ended up getting doubles of the burrata and pork belly because we liked it so much.This is a nice place for 2, 4, or 6 people, but I think 4 is the optimal size so that you can share various dishes and be able to try enough things. They recommend 2 dishes per person, I think we ended up with about 10 dishes for our party of 4 because we repeated 2 of our favourite things. Some of the dishes only come with 3 pieces (like the pork belly) -- I wish they would accommodate it for 4 people and add an extra piece of meat and charge a little more -- some restaurants do this and it makes it much easier than trying to cut 3 pieces of pork belly into 4. Here are the dishes that I liked in the order that I liked them (best to worst):Burrata, rhubarb, dates and nigella seed caramel (£11.50) - We all loved this one, we ordered a second one because one wasn't enough. The burrata was super fresh, the shredded (and maybe pickled) rhubarb and the dates were a nice sweet contrast to the savory, and there were a lot of different textures and flavors all in one dish. I'd highly recommend this!Crushed carrot and rose harissa with labneh, pistachio mint and pea shoots (£9.50) - I wasn't that excited about this dishes -- I like carrots but don't love them, but this was fantastic. Really unique way to prepare and serve carrots, and the rose harissa and pistachio mint were so interesting in flavor. The pistachio added a nice texture. I'd highly recommend this also!Pork Belly, Kimchi, Pink Grapefruit, Salted Black Bean (£12.50) - We ended up getting two of these because we didn't realize there were only 3 pieces of pork belly, not 4, and we had all eaten it. It's hard to share / cut the pieces of pork belly, so just plan accordingly for you party. The pork belly was great though and the skin was super crispy like a chicharron. The kimchi was great too but I preferred the pork belly alone so that I could really taste the pork belly. Great dish, and would recommend this!Roasted aubergine with tahini and miso yoghurt, almonds, chili and herbs (£9.50) - This was good too, but not super unique - I've had eggplant before, and I liked it with the yoghurt and almonds. It was good, but it if I came back, I don't think I'd repeat it.Pan Fried Octopus with edamame, sprouts and white soy (£12.50) - Proportionally, there wasn't much octopus in the dish. Every time I thought I'd be eating a piece of octopus, I was sadly eating a piece of edamame. Good, but not one of my favourite dishes.Spiced Pumpkin with Goat's Milk Labneh, Picked Grapes & Jalapeno (£11.00) - There were not very many pieces of the pumpkin - almost just 1-1.5 cubes per person? Nothing super special.Yellow Fin Tuna with Soy, Ginger and Spring onion sauce (£11.50) - There were only 3 pieces of thinly sliced tuna which makes this pretty pricey per piece of tuna. Nothing special here - I've had plenty of raw tuna in my life, and this was a disappointment.We got a lemon & mascarpone tart for dessert but didn't really care for this. It was too sweet and too sour all at the same time - maybe it could have used some meringue to balance it out, and the crust seemed a bit burnt. I would pass on their desserts.All in all, some dishes were hit or miss - some interesting flavour and texture combinations, but the entire meal didn't really make me jump up and down for excitement. I'd come back here again to eat if someone really wanted to come, but don't think I'd make it a regular place in my restaurants of choice or in my recommendations. There are better options out there for the money.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "qSL92WoLdXaVtE_4CvLZ9w",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qSL92WoLdXaVtE_4CvLZ9w/o.jpg"
      },
      {
        "img_id": "-fv7x7SCmjM2Y-fuQd-IYQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Yellow Fin Tuna with Soy, Ginger and Spring onion sauce (11.50)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-fv7x7SCmjM2Y-fuQd-IYQ/o.jpg"
      },
      {
        "img_id": "A8HgbpEfBkB2o9vNky-9DQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A8HgbpEfBkB2o9vNky-9DQ/o.jpg"
      }
    ],
    "user_id": "cSNER_qF_bb1t7kN0kZ44Q"
  },
  "fGwSod76mvHtOMk-trbZBA": {
    "date": "2/5/2017",
    "text": "Absolutely incredible food. I had such a pleasant experience and everything I tried was wonderful. We started with cocktails and olives and then moved our way to dinner. To my knowledge the menu changes often but we had the mixed greens, the roasted carrots and beans, the seared tuna (my favorite), a quinoa dish, the mackerel, and the hake. Everything was so flavorful and so delicious. I was very pleased. You must get dessert because they were all incredible.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zRh0ZakFdBSjjvMmNi4Aqg",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zRh0ZakFdBSjjvMmNi4Aqg/o.jpg"
      },
      {
        "img_id": "39EFHmgNwSyoH19p5dtR3g",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/39EFHmgNwSyoH19p5dtR3g/o.jpg"
      },
      {
        "img_id": "gggmRet4OERH8I-6YicdbA",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gggmRet4OERH8I-6YicdbA/o.jpg"
      }
    ],
    "user_id": "P-dMBjuh3y6m6gXQ65Uz_A"
  },
  "uGe65JhrGlaMYGr1xHxzIA": {
    "date": "7/14/2017",
    "text": "We came across Ottolenghi during a visit to Spitalfields.  It's one of many Ottolenghi restaurants in London, owned by Yotam Ottolenghi and Sami Tamimi (both from Jerusalem).  The restaurant serves middle eastern food with a western twist.  The hostess was very attentive and the overall service was great.  We had the kofta and various mains and salads from the counter.  We were pleasantly surprised at how good everything tasted.  Having all desserts on display made it very difficult to choose.  Our 5 year old decided to choose for us so we ended up eating way more than we should've.  From a mini-victoria sandwich, to cookies etc., was thoroughly enjoyed.  We look forward to visiting the other Ottolenghi restaurants.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GucrAmbslAf51cjdaVf5aA",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GucrAmbslAf51cjdaVf5aA/o.jpg"
      },
      {
        "img_id": "nPumlMj10DmrNHfSwdJIKg",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nPumlMj10DmrNHfSwdJIKg/o.jpg"
      },
      {
        "img_id": "YSnnteZxcSXdKK6BYimlEQ",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YSnnteZxcSXdKK6BYimlEQ/o.jpg"
      }
    ],
    "user_id": "pik2TK2Ad2p9VUZObFYs8A"
  },
  "QXsMUIwLiUDw5sy6N0Pjuw": {
    "date": "6/9/2017",
    "text": "Five stars, all around. From the front of house staff to the servers, five stars. It's a little hard to find, in a small warren of streets in Whitechapel. I had the bacon quiche with cauliflower salad and courgettes, which was wonderful. My friends got everything from the beef filet (cold), the cod cakes, and the kibbeh. Everyone joined the clean plate club that day!!! Although pricey, I finally felt I'd gotten what I paid for.  15/10 would eat again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WMKHohEja45ls6uxdIABRg"
  },
  "cYI1hh4elmLRil46BMwAKQ": {
    "date": "10/9/2016",
    "text": "Ottolenghi has been on my list for ages now. Any chef who chooses to highlight veggies as the star of a meal automatically makes my list, so heading over here for lunch was a no-brainer. We walked up to the location near Spitalfields, arriving at about 12:10 on a Saturday without a reservation. They took our names down and said to come back in 20 Minutes and we would have seats at the bar. We came back in time, and were immediately seated. I ordered a cappuccino and my cousin ordered an americano, which we both enjoyed. Then I chose a selection of 4 salads, and she had salmon with three salads. I had a sweet potato salad with spicy sauce and cheese, roasted cauliflower with grapes and hazelnuts, grilled broccoli with chillies, and a butter bean (I think) mash with okra. Everything was delicious. A bit spicy, very balanced, subtle flavours, and beautiful colours. At first when I saw my plate I thought it was going to be too small, but I could barely finish it in the end. My cousin also enjoyed her food, and we really liked sitting at the bar. The service was good, ambiance great, and I loved the gender neutral bathrooms. A bit expensive in my opinion (15 pounds for a plate of 4 salads), but perfect for an indulgent, veggie-focused lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1rSkVDIQLzgvKZK7heAStw",
        "caption": "Photo of Ottolenghi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1rSkVDIQLzgvKZK7heAStw/o.jpg"
      },
      {
        "img_id": "W128P8-HfBMvxgmN9v7yZA",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Fig financiers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W128P8-HfBMvxgmN9v7yZA/o.jpg"
      },
      {
        "img_id": "SxhXOCGT6opO27drfLJz-Q",
        "caption": "Photo of Ottolenghi - London, United Kingdom. Dessert table!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SxhXOCGT6opO27drfLJz-Q/o.jpg"
      }
    ],
    "user_id": "ZvDi03ESZiIqRKWVujLyUw"
  },
  "z1jpp8BlokbdJ-SWLzaJhQ": {
    "date": "2/1/2018",
    "text": "Amazing service and delicious food. I had a South African dish for breakfast and my friend and grandmother had smoked salmon and other treats.  Beautiful space with excellent customer service, the hostess even helped us o out our coats on as we were leaving. My first restaurant visit in London and it was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSMF0YYkNA-0gCMTJC4w1w"
  }
}