{
  "ulxXuAOKlTuzVt7Enhtypg": {
    "date": "4/20/2012",
    "text": "The food is good (but not amazing) and portion is larger than it looks. I always underestimate the portion and end up with more food than I can manage. The fare is pretty standard; nothing you can't find elsewhere, but it is the signature Penne Giardinera that I return to Carluccio's for. I also do not find Carluccio's value-for-money. You can get similar quality food from your local Italian for half the price. The restaurant is also a little crammed. Most of the time I feel like I am eavesdropping on my neighbours' intimate conversations!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1Sh_ZX3rjVMjVqnU0XFXMw": {
    "date": "11/19/2008",
    "text": "Went here recently with my mother for lunch. The food was good but not great and they seemed to have taken my favourite salad off the menu the Panzanella, so boo, hiss to that. But what sticks in my mind was the waiter tried to short change me and then took ages to come back or ignored my signals which made me think it might be deliberate, though perhaps I am just being overly suspicious.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kU04okyszMp1tzKJVXNJgA": {
    "date": "12/5/2009",
    "text": "My brother, who was living in London at the time, took us here.  We had a really great meal and I would go back.  Had no idea this was a chain and you wouldn't know it by eating here.  Very crowded (so reservations are probably helpful, although I don't think we had them) and fairly energetic (loud), but in a good way.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kZwX0_1UZuVN5oOht7E_5g"
  },
  "uwqWUZ3nfPzC9Fg9X0mRcg": {
    "date": "10/5/2009",
    "text": "Didn't realize this was a chain and wouldn't have known it from our excellent dinner experience.  Menu is thoughtful, like it's written by someone who cares about ingredients (spinach balls on riggotoni, creamy rissoto with mixed funghi, etc). The meat/cheese/olive/bread deli counter at the door reinforces the focus on the food.  The food quality lived up to it (sweet, pungent tomatoes on the salad  in October, for example!). The service was personal and caring in terms of recommendations for wine (short but very nice selection), size of plates to combine for dinner, etc. Our waiter was so thoughtful and caring, he could have been the owner's brother. Crowded yes - we made a reservation about an hour before coming, and it saved us - but worth the trouble for a solidly good experience. Also I like the big windows, personally, they bring in the light.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3cwmVMeEXbo5HedmVIzpQ"
  },
  "byMZR9pYJKvTmwUZwawZug": {
    "date": "11/19/2008",
    "text": "I went for a meal here without booking - two people on a Friday night. We were seated quickly even though the place was packed and were eating within ten minutes. The service is excellent - it always seems to be with this chain - and menu is delicious. It is overpriced for what it is as it is very basic food, but it tastes good and it is not stuffy or pretentious - unusaul for SoKe! They do a particularly nice glass of Pinot as well as a good range of beers. I would recommend the ravioli and also the chocolate dessert - it's delicious!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "srT7E3zkJ6iLGCEowrJRWQ": {
    "date": "8/28/2014",
    "text": "We ate here on a very busy bank holiday Monday. There were queues out the door and down the street.  It was poring rain outside and we were very happy we had made a reservation.The atmosphere in here is loud and lively and it was full of big groups, many with children.  The food is fine.  It's not the best Italian food I've ever eaten but it is edible.  The service was a bit slow , probably because they were so busy.  The rest of the group I was with thought it was excellent so maybe I am just a bit fussy.  I will probably eat here again at some point but it wouldn't be my first choice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IqBqV2IUsupilRyofrNcGA"
  },
  "pVH3Cd-CExUkNpclcqljQQ": {
    "date": "8/14/2015",
    "text": "We wanted Italian and we got it! Thanks to the other reviews here on Yelp we decided to give it a try. It was loud but not too loud. The place has a charm all its own with the desserts in the window and the deli counter of meats. Having said all that it's the food that's the draw! We had the liver pate which was smooth as butter and so very tasty. Betty had the Milanese de polo with a substitution of pasta for the roasted potatoes. I had the carbonara and with both had side salads. The breaded chicken was pounded thin and yet was still juicy and the coating was delicious. My carbonara was cooked perfectly and had a great taste that was only accentuated by the taste of the bacon. The salads were better than expected for a side salad. I believe we will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5JOldD8m5L3kXtkizFZ4PA"
  },
  "LHVdZPi0jXqwz7yQLL1I7Q": {
    "date": "7/17/2015",
    "text": "Fantastic service, delicious food, and a large menu to choose from! I will definitely be returning",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GA9xycCivI1V3VogBDqMAA"
  },
  "oPfUHi6PYTup4ksre_NktA": {
    "date": "5/26/2015",
    "text": "We stumbled on this place on a mid-day walking tour break. It was packed but they seated us pretty quickly. We had some salads and pasta and they were both pretty good. I had a spinach ball and pence pasta main with a salad for an appetizer. My friends had the carbonara, rigatoni, and mushroom pasta. Everyone enjoyed it. Just giving it a 3 because I can't do a 3.5 and I wouldn't rank it a 4. The bread here was also great by the way. If you want a nice quick tasty lunch it's a good place to stop. Prices were very reasonable as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geSn0Ksfa6n4Uerpkkh66A"
  },
  "yUMY4MBouA6FNqc4XssVeg": {
    "date": "3/26/2015",
    "text": "Pretty good place, with a lot going for it. A) in front of South Ken tube station B) Good easy internet connectivity. A bright noisy modern Italian bistro, it has a good glass wine selection, salads, pasta, and more. Fresh, tasty food at decent prices.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gw1n69Q32uuSb-_HM8jbyA"
  },
  "MpCnZENc7XT9PSdlfnCohg": {
    "date": "2/16/2015",
    "text": "This place is a delicious Italian joint that has a very friendly yet chic atmosphere.  I had a mushroom soup of the day along with a goat cheese salad that was delicious. Upon walking in, you have to pass through the cabinets and rows of desserts and pastries that make your mouth water.  I think that this place is pretty authentic compared to many of the other Italian restaurants I have tried.  It is incredibly family friendly, as well as perfectly suitable for big groups.  I would definitely want to return again with friends for brunch or lunch.  This is also a great place to come and have a drink or cappuccino and do some reading or work on the computer.  There is a lot of table space and a very laid back atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TV-4Wx6yDG6IniESsayeOQ"
  },
  "p6Ug4irer7zU_qlaQJhGqQ": {
    "date": "6/21/2014",
    "text": "We ate on a busy sat lunchtime . Table of 5. Great service, tasty pasta and seafood dishes. Great buzz. Liked that 100% of the top went to the staff. High recommended for a quick but good Italian meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0yPUMyznnqDAuqiTdYOLQ"
  },
  "wUZAfZiOVfRxHAE8ixnU-A": {
    "date": "4/16/2013",
    "text": "Tasty affordable Italian pasta & soup!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hxJCAqlPnIYQwHAYPw150Q"
  },
  "cZlebrRGGIBOnQeJSXhSjg": {
    "date": "11/26/2012",
    "text": "My boyfriend and I got the sharing plate of 3 different kinds of pasta of our choice, which I'd recommend for anyone who likes to try a variety - about £20 and big portions.  The ravioli and tortelloni were lovely.  The frutti de mare linguine was less exciting.  The service was a little slow but they were very busy, although we were fortunate enough to get a seat straightaway.  It's a nice busy but laidback atmosphere - not stuffy formal dining.  Reasonably priced good food for South Kensington.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "f8JIDyRkzWPIW91_6Vco7A"
  },
  "VQYFU29QO4wt9hfuf61QMA": {
    "date": "7/18/2009",
    "text": "So many chains in London, and I read about this one being a good one (are there good chains?!?).  Came here for lunch.  The service was so-so.  Nice waiter but slow service.  Had a Parma panini (long cured ham, taleggio cheese, and tomato).  I didn't care for the ham, and the sandwich seemed slightly out-of-proportion (i.e. big bread/little meat?).There are better restaurants in London to go for food, but I would give this chain another try (most likely only for breakfast or lunch).  Perhaps it would get a higher rating.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jw4OHr6HibJeEIMfAxc1_Q"
  },
  "SbH2dRGnEizjdDKS2T3I-w": {
    "date": "9/23/2010",
    "text": "This place makes tasty pasta, and is pretty affordable. If you're looking for a casual dinner or leisurely lunch, this is a good place to go. This is maybe not a super-gastronomic restaurant but the good is good and solid. It's one of many restaurants in this chain.I can't deny it... my favorite part about the restaurant is:Gluten-free notes: They have a gluten-free menu! Just ask. They bring you a lovely laminated yellow card that tells you what is or can be made gluten-free. They can serve you gluten-free (corn-based) pasta dishes with many of their sauces. And mine was quite good, actually!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "u_ViV3wf7R3vIPmMw_BdTA": {
    "date": "4/13/2011",
    "text": "This place is wonderful! And pretty cheap! They have nightly specials and really fresh pastas, gnocchi, etc. It's super casual and affordable, which is hard to find in this neighborhood. They have a huge menu and a lot of offerings (yes, even lots of Gluten-free).Apparently it's a chain, reminds me of everything Bertucci's (in New England) wishes it could be.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b0fp-eS8_MKTg4tcZsCNqQ"
  },
  "ZhDcQ2UR0HIAI2NU3U6gaQ": {
    "date": "12/15/2008",
    "text": "If there is one Spaghetti Vongole I can choose from it must be Carluccios! Being not a fan of chains, I have to admit, Carluccios is the place I visit over and over again. There is a good thing about chains; you can get all over London the same recipe of Spaghetti Vongole. If you are a cautious seafood eater, this is the place to start trying mussels. They are always fresh!No surprise that Carluccios is always full any time of day. I feel around South Kensington tube station, there are not a lot of good restaurants. This is for sure one reason why we always end up at this place again. They have big windows, so you might feel a little bit exposed. They have their own deli selection at the counter, which makes me always walk out with an olive bread, some dried tomatoes or marinated olives.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B1rW1DSmMIKAzfOWqDjrnQ",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B1rW1DSmMIKAzfOWqDjrnQ/o.jpg"
      }
    ],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "XXDa1Wz5HaaTkFRsdu7T1A": {
    "date": "1/6/2010",
    "text": "Carluccios is a chain of restaurants bearing the name of one of the London godfathers of Italian cooking - Antonio Carluccio. You can buy several of his books at the store.This is actually 3 shops in one. There's a restaurant serving rustic Italian dishes. The draw is that the ingredients are all top notch but it's not fine dining.There's also a nice tea shop with an array of cakes to tempt the stomach as you walk past.The last string to this place's bow is the Italian deli. There is a nice selection of dried goods like top class pasta and dried wild mushrooms but the main draw for me is the fresh deli counter with the cheeses and cured meats.It's a chain but it's not McDonalds!",
    "rating": 4.0,
    "rated": {
      "useful": 14,
      "funny": 6,
      "cool": 12
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "JOK-SZmequSTeq2NYr6RJw": {
    "date": "5/30/2011",
    "text": "Always wanted to try Carluccios and took the opportunity when in London last weekend. The menu was.....OK, I'm sure it could've been a little more varied though. I had the pasta con funghi, which was lovely. Others had the lasagne, which didn't really look that great but they tell me it was good. The staff were friendly and attentive and the atmosphere was good. Maybe a bitty expensive, but I'd go again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ea6wAkeOPyZ7BD-0rPejQ"
  },
  "kjf3Fo0t86EBT-0nR_OUuA": {
    "date": "5/20/2013",
    "text": "This is a review of their food counter section only. I walked in to get a few cakes to take to a friend. Their food counter is always inviting and it's tempting to get carried away. Picked up a selection of cakes and the waitress was very helpful and friendly. Cakes generally good - lemon tart and a gooey chocolate brownie were the highllghts!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXI1syYdLWyzUIAWvQ0sLw"
  },
  "Ev0JA2IwH7hqzb75271YRg": {
    "date": "3/10/2008",
    "text": "Be prepared to queue when you want to eat, or drink, at this vibrantly buzzing branch of the eponymous Italian caffè chain. Although it's a good, decently-sized site, it's popular to the point of being oversubscribed. The queue was good-humoured though and moved at a reasonable pace. Another small downside - before I get on to the good stuff - is the volume of the noise; the chatter levels here (due to the layout and popularity) are so high on the decibel scale that it won't be to everyone's taste or tolerance. The menu, as in all their caffès, has something for (almost) everyone and the staff seem very tolerant to eclectic combinations. I was in a veggie mood and opted for a starter-size of the vegetarian antipasti: delicious as ever, and I supplemented it with a side of their perfectly cooked fresh spinach. Accompanied by some of their walnut bread, it didn't disappoint but I was sorry to see that the smoked mackerel paté (sgombro) no longer appears on the menu. My companions were very happy with their parma ham, risotto milanese and arancini (rice balls); I sampled the mozzarella one - and found it much more flavoursome than I remembered. We shared a light dessert of chocolate meringue with blackberry sauce - a great taste success! The service was efficient and smiling (although not Italian).",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "8Vx87cQQwoYpCmOMtc27Qg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Vx87cQQwoYpCmOMtc27Qg/o.jpg"
      }
    ],
    "user_id": null
  },
  "OYR0WgpndrJRumX8d8HoXQ": {
    "date": "9/22/2014",
    "text": "If you're staying in S. Kensington or using the S. Kensington tube station you can get a really superb breakfast at this place.  Their \"uova y fungi\"==scrambled eggs with fresh sautéed mushrooms on a wonderful piece of buttered, grilled Italian bread--is fabulous, as is the larger breakfast that includes a tomato, some pancetta, etc.  They soft scramble the eggs--yummy!  Decent prices, bright setting, very friendly service.  We ate their three times in the week we spent in London.  I'm sure the lunches and dinners are equally as good but for a real breakfast this is hard to beat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-ZBKL6BIhRYnm3KuZFL5g"
  },
  "bguF7t2uO-w1wM1bdxeHRg": {
    "date": "5/4/2009",
    "text": "Carluccio's concept of deli cum restaurant is wearing a bit thin for me. While it was snazzy and cool when introduced a few years ago, the persistent high prices and diffident service is proving more and more of an irritation, especially in these troubled economic times. Also, the tendency to cram as many people together is annoying for the prices charged. Basically, the food is expensive and has gone downhill over the years, and to make it worse, the wines are also sadly overpriced. It was a fun place to hang out a few years ago but these days there are many better (and cheaper) places than this tourist pit. I rate the place as extremely overpriced for what it delivers.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rt-_fc9ScucMdiVWcsRdGw"
  },
  "G9OWbCT639PduwhNbi1A_w": {
    "date": "12/14/2011",
    "text": "This branch of Carluccio's is an excellent 'refuelling' stop while on the tourist path or doing a spot of shopping in the area. A very busy deli-cafe, service is always at the Carluccio's-usual-snails-pace but no complaints about the food or hot drinks, at all. You always know what you are going to get  which is no bad thing. It's a shame that the tables aren't laid out a little better (not much space to get between the tables-for-2) but it's the perfect place to grab a Cioccolata and divine almond croissant while resting weary feet, as long as you can cope with the noisy buzz of such a busy deli-cafe.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gelLF-WONLGcRlIU5F0BYg": {
    "date": "6/24/2017",
    "text": "Visited this location in south Kensington, after attending mass at Westminister Cathedral. We were on our way back to Barnes to see the Oxford vs Cambridge rowing race and stopped off at the So Kensington tube station.Lucky find. This is a chain Italian restaurant, and the food was excellent and not pricey. The soup, linguine with a basil was amazing. Go it's worth it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kmp_pM9F19DohsqPboK_Dg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kmp_pM9F19DohsqPboK_Dg/o.jpg"
      },
      {
        "img_id": "4LZgB3t-h7H5mY419qXy2w",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4LZgB3t-h7H5mY419qXy2w/o.jpg"
      },
      {
        "img_id": "V7bftYgQq1t22IgXxxzViw",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V7bftYgQq1t22IgXxxzViw/o.jpg"
      }
    ],
    "user_id": "XwaM3J0igbwbFy8zpGB15w"
  },
  "0-KhL1rdMpNj0PgffN1Jgg": {
    "date": "3/17/2018",
    "text": "I remember the original Carluccio run restaurant in Covent Garden, fine cuisine popular with media folk on expenses accounts. I have always been fond of the affordable spin-offs for a quick lunch of pasta.This particular branch just doesn't do it for me. It's a big, draft, noisy open plan space with little character. It's almost always busy, probably because it is just such a convenient meeting place immediately opposite South Ken tube station.The last visit was the most disappointing so far ... I know plenty of French bakeries in the area but friends were on a tight schedule and we settled for a breakfast meeting at Carluccio's ... big mistakeWhile the cakes for afternoon tea are lovely despite obviously being mass produced, the morning pastries were disgusting. Not even heated on site as in most supermarkets nowadays - staff agreed and we weren't charged but there were literally no alternative options available.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "X986C1QbGDeOTJ9cE2FMyg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X986C1QbGDeOTJ9cE2FMyg/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "De64dpBT4AX4L15awCDbiA": {
    "date": "1/26/2018",
    "text": "AVOID THIS PLACE IF YOU ARE HUNGRY.Tips for my people: 巨慢，种族歧视。We came here for a Friday lunch break due to the fact that the Honest Burger in South Kensington had a minor technical issue so they suddenly closed their kitchen. This is not the first time I've been to Carluccio's, as someone who's based in South Kensington, I've known this place for years and had only been once, once and never again - probably due to the very indifferent food.This time, I'm sitting here, writing a review, because I'm super bored after waiting for my food for an hour.This place is very noisy, if you don't like noisy food place, please avoid Carluccio's..Once the food arrived (if it arrives...), I'll update this review to give you an idea of how long you will have to wait for the food...Update 1:Still waiting for the food, it's 14.50 now. This place isn't even busy. All my mates are starving.Luckily - there's a Pret A Manger next door... if in 5 minutes, food still don't arrive, I'll just run next door to get myself a sandwich...Update 2:Food portion is too tiny...Update 3:When tried to get the bill, they ignored us for at least 5 times.Update 4: Racist waitress...don't want to say more on it. I went with 5 whites to this place, very unpleasant experience...",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xq5ivQMOy2EleM0dtWlZtw"
  },
  "Lv9hG1Oui3D5rWcptPj8-Q": {
    "date": "10/18/2017",
    "text": "Lousy service & indifferent food.  I wouldn't normally risk a chain, but went here after a concert at Royal Albert Hall, arriving towards 10pm,  It was fairly empty but they let us in without demur, we had starters (so-so)  mains (not very good) then refused (yes, refused)  to do sweets \"the kitchen is closed, chef gone home\"   They didn't warn us, no indication that closing was imminent, very grumpy about the whole thing, wouldn't even give us an ice cream.  The food was rather below average (I lived in Italy and know real Italian food when I see it: this wasn't it)  but the service & attitude were utterly dismal. Never again.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcnVSiFsmAuId5fpE_oOMw"
  },
  "pfNF8KU-Wq_MpYvh8vsS7Q": {
    "date": "5/12/2016",
    "text": "I always seem to have problems with the restaurants in the Carluccios chain. They're never all that significant but I feel like they could always be a bit better somehow. Sadly, this visit was another example of this.First off some good service from our waiter, who had no trouble making sure we got two n'duja and mozzarella arancini rather than one, plus a Gorgonzola one. Then it just became a bit irritating sub average afterwards. This isn't to say anything was bad, but nothing was great.The arancini were delicious. Garlic bread, again, good. My main? Well the pasta was cooked perfectly but the chicken was just funky and the sauce may have been pure unseasoned cream as far as I know. It was improved a lot by dumped a load of salt and pepper into it, but despite an interesting description on the menu, it just didn't meet my expectations.Again, not bad, just pretty meh. My only real issue is the density of the tables in here. When there are so many that a waiter has trouble getting between them then I'm sure that's too many tables. But the restaurant is in South Ken, so I can understand that volumes are put above the customer experience due to all the tourists.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBqJ32j3nsyugAhuh0h2bw"
  },
  "7IvIVVEQsYyF9xjnAcmx4w": {
    "date": "5/12/2016",
    "text": "I really don't know why we persist in going to Carluccios - I never leave especially happy, it's pricey, and the service is hit and miss.I know to avoid the mains - I don't like how they cook their pasta, and the meat is more than I like to spend for not-great quality, so I had the arancini starter (subbed the gorgonzola one for another n'duja) and some garlic bread (which I shared with Brian).My food was fine, and Brian's was edible, but on this occasion the service was pretty bad. Our waiter was doing that 'I'm your new friend/aren't I handsome' thing that just seems sleazy and is obviously just tip begging, and then when I didn't appear charmed enough (he wasn't at all charming) he just shut it off and we basically didn't see him again. The restaurant was busy but not packed, but the tables are so close together that it feels very cramped and crowded. The table next to us had to put their hand in the air and wave at the waiter to get his attention from where he stood by the bar not doing anything discernible.I guess I just need a reminder every once in a while to avoid this chain. Thanks Carluccios, my memory is refreshed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiojkDLHYdkfTJlINzUv-Q"
  },
  "CIBK79wquqJ3k5JR0xQwzA": {
    "date": "8/11/2015",
    "text": "I ate my first \"real\" dinner in London at this Carluccio's back in January. I got ravioli with spinach and cheese in a white wine/oil sauce, along with a glass of pinot grigio, and it was absolutely delicious. The waiters and waitresses here are very kind and are willing to accommodate the needs of your party without complaints. The atmosphere is very relaxed and calming, so it's perfect for a romantic date, as well as a nice night out talking with friends over yummy food and wine.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aFFwQJnugWdvKEk1XIRh4g"
  },
  "fQYbre02fr1GyKfQWXXFEw": {
    "date": "8/30/2015",
    "text": "I've only been here for dessert, but I was surprised that they didn't do Pizza..An italian that doesn't do pizza? Huh?So the emphasis is on pasta, and the food is pretty good. It's a little pricy if you go for the a la carte menu but I got the 3 course menu for around £15 which was pretty good. I had the Chicken liver pate with caramalised onion and toast. Very very good.Italian chicken milanese. Basically a chicken schnitzel with some rocket and potatoes. The potatoes were a little salty, but the portion was perfect and chicken perfectly cooked and mouth-watering.Dessert was a panna cotta with rum infused orange peel. Exceedingly rich and whilst lovely I couldn't finish it all.In terms of service our waiter was great. My food seemed to have more problems that anyone else, since I was the only person to order from the set menu and items came our erattically. E.g. Despite asking for my food to come out with everyone else's to prevent them having to wait for me. My starter came out before everyone's main, but then my main seem to  have been forgotten and there was a small wait. Similar situation with dessert. I'm not one to hold it against them as the place was pretty busy with lots of big tables and they did a great job in the situation ensuring we always got what we needed quickly after grabbing a member of staff's attention and ensuring food came out mostly at the same time.I'd come back to this chain again for sure. It's a safe bet for good quality food that is nothing mind-blowing but simple, safe and hearty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "smF1wvmNKx8rGiy3ifKpjg",
        "caption": "Photo of Carluccio's - London, United Kingdom. Panama cotta with rum infused orange peel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/smF1wvmNKx8rGiy3ifKpjg/o.jpg"
      },
      {
        "img_id": "I0ieyLS6uoOuB0wTwUN_ug",
        "caption": "Photo of Carluccio's - London, United Kingdom. Chicken liver pate and toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I0ieyLS6uoOuB0wTwUN_ug/o.jpg"
      },
      {
        "img_id": "d0umGpzUYp57HN5RLQDvgA",
        "caption": "Photo of Carluccio's - London, United Kingdom. Italian chicken Milanese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d0umGpzUYp57HN5RLQDvgA/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "1rJ1Xn-dY4wqXNOGShxUGQ": {
    "date": "1/4/2017",
    "text": "Lovely place with good decor. Service is a bit slow and quite tricky to get attention of staff to order food. Given that there's no halal option on the menu, it leaves you with only fish options. The sea bass is brilliant with the tartare sauce and roasted mint potatoes. Excellent combo. Reasonably priced but wouldn't be first choice of place. What makes it attractive was being able to eat outdoors during summer weather in a good setting.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QyGa8XC5ZxiIuXXSBkaDaw",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QyGa8XC5ZxiIuXXSBkaDaw/o.jpg"
      }
    ],
    "user_id": "nizVN60pdsIsjB8X3ao25w"
  },
  "4hU-fTSzX-9Rz-DFJbrGUA": {
    "date": "5/19/2016",
    "text": "Busy place and clean! Wait staff was nice and food was  good. They had 3 course for 12.99 which is very affordable by London standards. Would recommend to anyone in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xgAc7iUiEGTAoh0hIbcxyg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xgAc7iUiEGTAoh0hIbcxyg/o.jpg"
      }
    ],
    "user_id": "dupkbFxLZkSI40GnGICqPQ"
  },
  "w0VtZqCKQRiubTlKl4Hxow": {
    "date": "6/16/2015",
    "text": "The branch is well located opposite the tube station.  We visited on a Sunday for lunch.  The restaurant was busy and lively but the staff was still very friendly and efficient.  We received our drinks and food promptly.  Our selection of food ranged from salat to pasta everything taste great.Over all the shop looked good and felt clean.  I would visit again...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qRLOVl7WLpO5y4Zppy_GDw",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qRLOVl7WLpO5y4Zppy_GDw/o.jpg"
      },
      {
        "img_id": "rT8TptEOayNE7k_lDkLKMg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rT8TptEOayNE7k_lDkLKMg/o.jpg"
      },
      {
        "img_id": "0EzWeItfaK-XvjEnk86-zg",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0EzWeItfaK-XvjEnk86-zg/o.jpg"
      }
    ],
    "user_id": "TAOass0cFSHdU0JBfZRDOg"
  },
  "057vdQkh2hwTlXrFVSrklA": {
    "date": "5/14/2017",
    "text": "Its an Italian breakfast place , breakfast and coffee was real good.decor of the place is nice..",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "smy0mW5PAdcy8WCnNRz-rQ"
  },
  "zjAmUzMItc3CBrfA_IIx8g": {
    "date": "1/11/2015",
    "text": "I don't know why some people say this is the McDonald's of Italian. I disagree. The food here is delicious and well cooked. I had linguine with seafood and it was one of the best I've tasted.  I went here with five other friends, and they all loved their choices of food as well.At the moment they also have a two for one offer until end of January. I shall be back there for lunch tomorrow then.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-79TDQVTZmzxWCCTfobrRA",
        "caption": "Photo of Carluccio's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-79TDQVTZmzxWCCTfobrRA/o.jpg"
      }
    ],
    "user_id": "_obGEh0dUdfRSZscN4UV4g"
  },
  "fGs-2_AGhUwUJI7PvzFP6A": {
    "date": "11/11/2015",
    "text": "I went there on a Tuesday night, the place was not crowded. Me and my friend we ordered all the sharing starters, as it is 10 pounds for 3 starters, and so with 20 pounds, u can get 6 starters, and they are yummy and filling! and then we ordered a bottle of white, it was fruity. One thing that could be improved is the waitress can reduce the time for interfering people, i know i know they just want to make sure the food is okay, but man, we were chatting!!! duhhhhhh... but i guess sometimes their appearance can save some from awkward moments. LOL.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NROjgCtmJGjqwHEm8lvQlg",
        "caption": "Photo of Carluccio's - London, United Kingdom. Caponata 3.95",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NROjgCtmJGjqwHEm8lvQlg/o.jpg"
      },
      {
        "img_id": "v9z0Xa3kFWMGfafddtFv7g",
        "caption": "Photo of Carluccio's - London, United Kingdom. Beef Meetballs 3.95",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v9z0Xa3kFWMGfafddtFv7g/o.jpg"
      },
      {
        "img_id": "-9UN2G7VIJDrnMdLNa7_8Q",
        "caption": "Photo of Carluccio's - London, United Kingdom. Funghi fritti 3.95",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-9UN2G7VIJDrnMdLNa7_8Q/o.jpg"
      }
    ],
    "user_id": "MKgjzsiFjlOELz3K0Fa_tg"
  },
  "rbGxFY0aA_uUIxMJGSFkeA": {
    "date": "9/17/2014",
    "text": "Really good italian food and great home made pasta ( ravioli with spinach and ricota ) , the 10.95 menu definitely a good deal u can choose between app and main dish or main dish and dessert. The chef menu is also very tempting with fresh food. the atmosphere of the place is very nice and the service was impeccable !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d-hD6MPY-Zll5xkm6wBnLg",
        "caption": "Photo of Carluccio's - London, United Kingdom. Soup of the day! Delicious pumpkin soup :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d-hD6MPY-Zll5xkm6wBnLg/o.jpg"
      }
    ],
    "user_id": "0IRO2SEY24WVqmvocLTOgA"
  },
  "fgxIl3GJD7HO2ZAf469EUQ": {
    "date": "7/30/2015",
    "text": "My wife and I checked out this place our first night in London.  There are several Italian places nearby and this one had the best reviews so we decided to have dinner here.  The service is very professional but otherwise there was nothing special or worth mentioning.  I find Italian is often all too expensive for what it is and I'd say that rang true for Carluccios as well.  The food was decent but not worth a trip back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "51K0w1o2K2_wYgphWxBFdA"
  },
  "nKPuMwRQ2l_KCxo3OGoiCw": {
    "date": "4/7/2016",
    "text": "A chain restaurant, so it was a very pleasant surprise to find the food was so good. Beautifully cooked fresh seafood, great wine list and a full selection of Gluten free pasta dishes. It was as good as Italian restaurants that are much more expensive!  I don't know why I had avoided them until now thinking it was gonna be the UK version of Olive Garden...it isn't ....it is much better.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nN4in7UJeqeN2ErJIsqE2g"
  },
  "f56N6gu02JuXs7_dv6-GBg": {
    "date": "10/1/2014",
    "text": "Another in the sad list of busy spots in London with ok food but absolutely awful service - from the hostess who seats you - empty smile and zero cares whether the experience is good or bad - to the non present wait staff - I waited 15 minutes to get served, no apology - Too many other good options - avoid this place",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SgJIcEB1xJWvsz94tCTUkg"
  },
  "W_TRYw9HSmpjQ_oPXTIkkg": {
    "date": "3/31/2013",
    "text": "Unbeknownst to us, as tourists, we had not known that Carluccio's was a chain restaurant :( But the cute interior and tempting menu seemed very inviting so we stayed. I started my dinner with the Arancini di Riso. Two crispy fried rice balls one flavored with a basil pesto and one with a meat ragu filling, served with a side of red pepper dipping sauce. The basil was my favorite of the two, offering a balanced creamy and savory interior. The meat ragu filling was a bit bland. I couldn't really taste the ragu or any tomato-type flavor and I'm not quite sure I even recall any meat in the ball(?). The arancini's flavor was enhanced when I used the red pepper dipping sauce. Both were cooked perfectly with a nice creamy, chewy texture and a light crispy, crunchy exterior. For my main dish the Risotto special. (I didn't really think my selections through, starting with rice balls and having rice again for dinner!) The special that day was Risotto with chicken and spinach. A hearty dish that actually tasted like a warm bowl of chicken noodle soup. Creamy, chewy risotto tossed with tender chunks of white meat chicken and spinach leaves. A plate of comfort food...just wished the spinach was chopped smaller. Some of the large wilted leaves had a mushy texture and were unappetizing. Service was prompt, however, not super friendly and the food came out timely and piping hot! The restaurant itself was pretty packed (I think we were there on a Monday or Tuesday night(?) )and noisy and the tables are close together. Not a huge problem, but it was difficult to have a conversation and to hear the server. They also have a cute mini store with a deli, bakery, books and sweet treats near the entrance of the restaurant and their barista was mixing coffees, teas and espressos exposed adjacent to the dining area. Overall good experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vbc5cXOI-RBHuVmE_hZj9Q",
        "caption": "Photo of Carluccio's - London, United Kingdom. Dining area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vbc5cXOI-RBHuVmE_hZj9Q/o.jpg"
      },
      {
        "img_id": "jN0J6oweq4RqYUr5MSiY3w",
        "caption": "Photo of Carluccio's - London, United Kingdom. Deli and market area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jN0J6oweq4RqYUr5MSiY3w/o.jpg"
      },
      {
        "img_id": "kGon-fXvhJegLX9NWBsvuw",
        "caption": "Photo of Carluccio's - London, United Kingdom. Risotto with chicken and spinach",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kGon-fXvhJegLX9NWBsvuw/o.jpg"
      }
    ],
    "user_id": "fF96J8EaHKFoIecd2MHmnA"
  },
  "IPnX90B42RL5t-qeTLYG8Q": {
    "date": "3/3/2015",
    "text": "I prefer sitting next to the window. People here are welcoming. We chose four main courses and I would say it was overall pretty good. I am more interest in their soup TBH, however they did not have it yesterday. It would be so much better for u to have a little bit cheese rather than none or too much. I drank so much water after overwhelming cheese. Trust me they use good Italian olive oil. 加一点黑胡椒或奶酪都会比什么都不加好很多，但如果你加了太多就会像我一样吃过后就要喝大量的水。他们在叶子上加入的是不错的橄榄油",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5MkjV_b0Nct1Pcp69Ey_HQ",
        "caption": "Photo of Carluccio's - London, United Kingdom. Tip: Go a bit cheese rather none or too much",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5MkjV_b0Nct1Pcp69Ey_HQ/o.jpg"
      }
    ],
    "user_id": "nJVJ9g3dNAVYl9LCyYi66Q"
  }
}