{
  "C9Ei8G16qVhhH-VCwCAshw": {
    "date": "3/22/2015",
    "text": "The place offers food of poor quality, especially for the price level. I had ribs which were overcooked and the meet seemed old. My girlfriend had a burger which was tasteless with very bad meet, bacon and sauce.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Di-tk9Qg2dvKmX_Pjw2QmA"
  },
  "h5BB2MUgJ1YRSFez0LKuVQ": {
    "date": "7/12/2010",
    "text": "The chicken sandwiches are fantastic, and the hot dogs look really good, but the burgers SUCK.  There's a huge gourmet burger craze going on in the UK and Ireland, and at the risk of sounding like a burger-snob American, none of them really seem to know what they're doing.  We Americans love our burgers, which is one reason we're so fat.  If you are an American seeking your burger fix, well then you're not going to do it here.First off, I ordered my burger medium rare and they brought it out well done.  I realize that many Brits don't actually enjoy flavor in their food, but why even allow me to order it medium rare if you were going to bring it to me dry and bland?Second, they didn't melt the cheese.  Let me repeat that - THEY DIDN'T MELT THE FUCKING CHEESE.  How can you claim to specialize in burgers and not melt the cheese?  Unacceptable.  Completely unforgivable and totally unacceptable.Finally, the attempt-to-be-fancy ciabatta buns just don't work with the burgers.  They're too dry and crunchy, which does not accentuate an already dry and overcooked burger.Fail. Epic burger fail.  The only reason they get 2 stars instead of 1 is because of the chicken and the fact that they appear to have a nightclub in the back. Yes, a nightclub.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvVj-bD8-ccNW1m7zCO7WA"
  },
  "iGpCAFyqI0x2Kd4u3lauSQ": {
    "date": "7/7/2009",
    "text": "It looked at first like a tourist trap to me, but being so close to Upper Playground (shameless plug for their tees), and being very hungry, this was a logical try.I will get this out of the way first. The service was slow. They seemed one short and although we were relatively unaffected by this, many of the patrons around us looked restless. In fact the guy behind me asked for his appetizer 3 times before he got it, although to Carnaby's credit, he was totally unreasonable about his time expectations.On to the food! The veg selection is strong for a burger joint, and my expectations were definitely exceeded. I've come to since find out that the restaurant does a lot of local, sustainable and organic ingredients which is always a plus. When I ordered I was disappointed to hear that they had run out of the home-made falafel, which is a favorite, but my second choice, the spicy bean burger was extremely delicious. In fact it was good enough to make me forget about my first choice until I sat down to write this. One thing they definitely had right on this burger was the ratio of ingredients to bun. Just because I don't eat meat doesn't mean I want a thin veggie patty smashed between two hemispheres of bready goodness. Well done Carnaby! I also must recommend the posh fries to anyone. They are a medium serving of fries doused in sweet chili and ginger sauce with a dollop of guacamole. Wow, those were good.What started as a meal of function turned out to be very pleasant. I will definitely be back and this is a great place to take friends or family in town for a bite after doing some shopping on Oxford.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3P_b7jCVMRuBprj51qUH7A"
  },
  "GJOlPZ0YlsoyTj5vO3Jt8w": {
    "date": "8/2/2011",
    "text": "Worst burger place I have ever been too. I do not recommend this place to anyone. Burgers are way below average. Burger King is probably better. The manager is also extremely rude with no sense of customer service.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NZhLM1oo28LWTyid9pRkAw"
  },
  "Iu3KNTaUwBIupyn80TGMoA": {
    "date": "3/13/2014",
    "text": "Among the worst burgers in its price level. Perhaps one step above mc Donald's and Burger King, but not more than that unfortunately. Presentation of the food ok but ingredients fell prefabricated :/",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bs6fYv-bwNIuGNYEhvRKOA"
  },
  "dql2TsAsDCGFuQeSTybnqQ": {
    "date": "8/12/2011",
    "text": "Get the Sticky Toffee Pudding for dessert.  My 4 star rating is for that!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQOy8Ea0-TLDclpmG6hs4Q"
  },
  "qWzMFonw1ruxJw6h4GfINg": {
    "date": "4/1/2013",
    "text": "Probably the best of its type in London - just discovered today and had a stonking quick lunch. Wide range of burgers for all - I had chicken with cheese and mushrooms and it was really really good.  Great selection of drinks. Probably give it 4.5 not 5 as they need one extra member of staff - they were all brilliant but run off their feet. A great find.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzazP0bxfr5x1v1dKJDebQ"
  },
  "YCoM5HWm2Q8l3RF5MEGUFg": {
    "date": "3/20/2008",
    "text": "If you're looking for a place to have a great burger in an unhurried atmosphere with great customer service - go somewhere else. From the inability to provide us with a place to sit, through placing 3 people on a table for 2, leaving the food to get cold, overcooking my hot dog, to failing to provide the correct change, this was the worst lunch I've had in a long time. After waiting 10 minutes (timed) to take our order, it took a further 11 minutes (timed) to deliver the tap water we asked for to our table. We spent 20 minutes (timed) waiting for food that was up well before then and just sitting getting cold. Around us, a woman was moved to make way for a large family only to be berated by a waiter for moving and making it difficult to deliver her drink to her. The tables next to us got the wrong orders and the chefs were visibly agitated by the lack of service. The only reason I gave this establishment one star is my colleagues enjoyed their meals which were lukewarm, not hot, having also stood waiting. I had gone to this establishment specifically to assess it for future departmental meals but I cannot recommend it at ant time. The line outside this restaurant is because of incompetence, not popularity.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XbWsBsuJ2Ut6CemFUXllKQ": {
    "date": "7/21/2010",
    "text": "This place is better for mcdonalds / burger king, etc but not much better. Although the place has a certain character / quirkiness, the burgers are not hugely impressive, although they do taste decent - but they dont have much of a \"wow\" factor",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E27Rwcl2QJSLCUYOk4h_6w"
  },
  "wG900LsogSPLB-PzW0txSw": {
    "date": "8/31/2012",
    "text": "The rudest staff ever! We were seated outside at the center of three tables under the canopy. We were midway through our dinner when two staff members disrupted our meal by insisting that we move tables so that a party of four could be accommodated at the remaining tables.  I literally had a fork full of food halfway between plate and mouth when this happened.  Combined, the two staff brains were not able to think of an alternative solution for the party of four, such as picking up and moving one of the empty tables next to the other.  The real kicker came when only two in the party of four wanted to order food!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yC_KC56BjFaa9aA8MPKGMg"
  },
  "RWD8goo7fCwlYp0d0oVlBQ": {
    "date": "8/5/2009",
    "text": "The service is slow, and the waitress, though very polite when serving us, was often hard to locate. When we arrived, we sat for 15 minutes without being offered menus. That said, the food was great. I ordered the penne pasta with creamy cajun sauce, roast chicken, and mushrooms. I was initially wary of ordering pasta at a burger joint, but sometimes you just need some carbs. It was delicious! My fiance's chili cheese hot dog was also very good. Sadly, the onion rings were not as impressive. They were made from small bits of onion mixed with batter. So if you are looking for thick slices of onion, don't order them.This place's menu was like America in a nutshell. They even had ribs!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZovUhls_e2xCJ3dw7aOKA"
  },
  "VsGwctxcPcKRvJTRoxIsdw": {
    "date": "12/15/2008",
    "text": "I've only gotten takeaway from here - the service is consistently flaky and slow, so that I hate to think what it's like to sit down and eat here.  Anyway, the food is pretty average.  I'm giving it 2 stars because I expected it to be worse, and I like the fact that nothing (I've had) tastes disgustingly, gratuitously greasy.  I'll admit that I haven't tried their beef burgers, but the chicken burger was pretty boring, and the portobello burger was a shrunken fungus that had been completely overtaken by dry bun.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E69rFWaIJHTa1DpLytxyEw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E69rFWaIJHTa1DpLytxyEw/o.jpg"
      }
    ],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "L9RZv2vYB27VR_GyzadBng": {
    "date": "12/7/2008",
    "text": "If you want a real burger and not the McDonald or Burger King variety this burger joint is really good. Situated near Carnaby Street, the restaurant is perfect in the summer as you can sit outside, enjoy your burger and people watch. When it gets colder sit inside the relaxed surroundings complete with music memorabilia and try to decide which burger you want. I would recommend the chilli burger which is tasty and I'm getting hungry just thing about it. the hotdogs are also really good- nothing like the greasy sausage in bun sold on the street corners of Leicester Square. However, the only downside is that the service can be a bit slow. This has never been a huge problem for me beacuse the food has always been exceptional  but if you've gone during your lunch break it could be very annoying.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibGwYz5b6zO5FA03b2EBxA"
  },
  "FaMU5E7KfGCKG7oWO4dNQQ": {
    "date": "5/2/2010",
    "text": "My friends and I and our children were looking for a place to eat that has delicious food and is also child-friendly. After a long shopping errand in Oxford Street and especially after spending hours in very-noisy very-distracting-for-kids, Hamleys! We were tired and hungry with cranky children. As we strolled through Carnaby street, the delicious-looking dishes and burger yummy grill smell attracted us to the place! We went for it with no previous (Yelping) reviews and completely loved it! We had a 7-min. wait before we were seated in the comfortable sofa table. Apart from the three girls on diet sitting next to our table and staring at our calorie-rich food and less-than-ideal shapes (LOL) the experience was an absolute bliss! We all ordered burgers, I had the Jerk Chicken and my two other friends had The Mexican burgers and the kids had the fish fingers -- we all indulged heavenly! They had highchairs and colouring menus for kids that kept them busy and happy. The waiter was really sweet and kept a very attentive eye and hospitable attitude on our endless requests. The service was a bit slow, but that's understandable given it was a busy Sat. afternoon! The bill came out nice too, we each paid £20 (on behalf of the kids as well). The environment was lovely and decent, the music was cool and man oh man, the food is just too delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "4ABtcePDJqmGrIoWlGkQ_g"
  },
  "nCdMZCR1F7XoFJbec7rqDg": {
    "date": "6/16/2009",
    "text": "It is interesting to see that since the last review over a year ago this restaurant has not improved in the slightest. Went there with my son for a quick bite after shopping. If it hadn't been for the charming waiter it would have been a truly disappointing experience. To top it all when I went to the ladies at the end of the meal I found one of those attendants who hand you towels and offer you perfume - something I have come to expect in nightclubs but not in a downmarket burger restaurant where I have just gone for an informal meal! Who do they think they are?",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "d-gwBn7u3F28V31qdYmS5A": {
    "date": "4/4/2008",
    "text": "I can honestly say that the service in this burger bar was awful. A crying shame actually because the food was actually ok if you're looking for a lunchtime burger. From being squashed around a small table to waiting forever for our order the experience was inexplicably bad. In fact if they had at least given us a reason for the poor service or an inkling the food would take that long then maybe my expectations would have been managed better and the restaurants failings not have appeared so huge.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cVosRVQ6XfdKJOOaxEMt9g": {
    "date": "7/29/2015",
    "text": "Went to Carnaby Street with my brother to do a little shopping and stopped by here to get something small to eat. Carnaby Street is know for the shopping and the eateries, and we decided to go here.Turned out to be a good choice because they have relatively small portioned food and we weren't that hungry, but still wanted something good to eat.I ordered the Canadian Poutine fries and my brother ordered the Nachos. Being from Southern California, I know a thing or two about nachos and how authentic and good they can be. Now these weren't typical nachos, and I understood that, knowing full well that nature of the area. The nachos has grilled strips of chicken, sour cream, guacamole (which I may say was pretty good ~ avocados and guacamole are very popular in Southern California and restaurants can be judged just on their quality of guac), pico de gallo and salsa, and of course cheese and tortilla chips.My Canadian Poutine was very good. Nice thick fries, caramelized onions with a fig and apricot jam mixed in, gravy at the bottom and a bit of cheese. No curds though (which I kind of wanted but it was great nonetheless).It was a really great place and my brother wants to go back again. I call that a win because my brother is on the picky side and he's found a place that he really enjoys (that's decent as well haha). Sadly, there isn't one when we go back home... so we'll have to visit it at least two times more!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ox0udgQERQ8Me9-gjOHhoQ"
  },
  "kouAS4nq8GSWYdDI3JmwgQ": {
    "date": "10/27/2017",
    "text": "Nice burger option.  I had a bacon and bleu cheese burger and enjoyed it.  American style bacon, nice brioche bun and plentiful cheese.  Had fries (chips) with guacamole and sweet chili sauce, a good side.  A little spicy but far from boring chips.  A good lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tkAjiVsQEhcVjc-0CKzcNg"
  },
  "2jmCIV3hksGLCHPtuGWJGw": {
    "date": "12/19/2015",
    "text": "Nestled behind the bustling Carnaby Street this Burger company I stumbled across while waking the streets is small and petite.  I'm only giving this 3 stars at present and will update my review if I go there again in the future as I had the Mr's chips and they were very nice.  The only thing that put me off about this place was that the tables were to close together and we ended sitting right in the corner with hardly any leg room.  The wallswere decorated nice (one of an old picture of Carnaby Street and one made up to look like a load of front book covers) maybe this old shop used to be a book shop in the 60/70's?",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AhJndlQTTrC-vdACted6oA",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AhJndlQTTrC-vdACted6oA/o.jpg"
      },
      {
        "img_id": "QudRIIS2ZYICfcX21erEsg",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QudRIIS2ZYICfcX21erEsg/o.jpg"
      },
      {
        "img_id": "DPX6rz7P2CINMMQB7KDEHw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DPX6rz7P2CINMMQB7KDEHw/o.jpg"
      }
    ],
    "user_id": "pa0Z6FGRCF_tYe-kgHQq5w"
  },
  "arhhXdNasJGmv0xogBDjZA": {
    "date": "12/20/2015",
    "text": "This place is OK. The food is alright but I have had better burgers at other places such as Gbk for lesser cost. Chips were a nice thickness but luke warm. Decor alright wooden but tables too close and area small so with all that said I would properly not go back there.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bKGJDmVYiiEbN4HXsrlX1w",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bKGJDmVYiiEbN4HXsrlX1w/o.jpg"
      },
      {
        "img_id": "7ExpsXw9S-L8DSQAYYbMCg",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7ExpsXw9S-L8DSQAYYbMCg/o.jpg"
      },
      {
        "img_id": "lTv9ubZVwMZ7Y__iubl2JQ",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lTv9ubZVwMZ7Y__iubl2JQ/o.jpg"
      }
    ],
    "user_id": "5fqP70CNVTZwwNrk-bmnYA"
  },
  "78P4nvs-satphaHWdsyHYw": {
    "date": "2/1/2016",
    "text": "I came across Carnaby Burger looking for somewhere quick to eat, it looked busy so thought it might be a good place to eat.  We were seated at the front of the restaurant at tiny tables cramped between other diners.  I wouldn't like to sit there again it was very uncomfortable.  I ordered the BBQ Beef burger minus the cheese and some Posh Fries.   It didn't take long for our orders to arrive.  The burger was ok, better than McDonalds but I really liked the Posh Fries with ginger, chilli and guacamole.  I've definitely eaten at better burger places and probably would opt for a different place if Ii had a craving for a burger.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qKq6ZugO3K5IF6GiwdzoiA",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. BBQ Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qKq6ZugO3K5IF6GiwdzoiA/o.jpg"
      }
    ],
    "user_id": "ud_XSg8h2NFskZaqGrCu8A"
  },
  "7EBlG8-kkNNVS1IMacg9Qg": {
    "date": "4/30/2014",
    "text": "After seeing Carnaby Burger Co had gluten free options I couldn't wait to stop by and check it out. While it wasn't terrible I was pretty disappointed. Firstly the good. The staff did go out of their way to accommodate my onion allergy. Secondly despite their menu saying their gluten free options are burgers without bread, they do have gluten free buns.Ok the bad. The service is slow. My gluten free bun was as hard as a rock. The pineapple sunrise drink tasted of nothing. The wet fries are ok.... but nothing special. The burgers are bland and taste like reheated fast food. I really wanted this to be good and I just walked out disappointed. The price tag doesn't match the quality at all, however they do have a large menu so maybe other items are better. ....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YIa2S4F_wU5iPoWNQrmJUA",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YIa2S4F_wU5iPoWNQrmJUA/o.jpg"
      },
      {
        "img_id": "ybUTGWRI1K5R7wOQALu2qA",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. Gluten free burger in background.  Jerk chicken burger in front plus wet fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ybUTGWRI1K5R7wOQALu2qA/o.jpg"
      }
    ],
    "user_id": "ATCCIn13BcH2xamvZBCLlA"
  },
  "gNpARv1NwvurPgqHNXrgVw": {
    "date": "7/10/2015",
    "text": "Last week a few work friend, then partner in crime and I headed over to the Carnaby Burger Co. just off Carnaby Street as it's only a short walk from our office. Little did we know we'd be feasting on such amazing food! The atmosphere was lovely and the staff were very entertaining, so we were in our element when we were brought amazing burgers too! Between the 6 of us we all had something different and we had 6 empty plates!  I had the chilli cheese burger that was out of this world.We also had a cheese burger, a falafel burger, a bbq beef burger, a New York strip sandwich and a pasta dish.  Of course sides are VERY important and when they come in the shape of cheese and bacon fries you've got me good!This was literally living the dream, and the amazing cocktails certainly helped too!I can't recommend this place enough!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cbt2BfHLvRceqr0aEOBQkQ"
  },
  "wRrVoaT32wicz6WSze-Mqg": {
    "date": "3/11/2014",
    "text": "It's an nice burger, no more, no less. Fairly tasty but nothing to write home about unfortunately. The chips were average, run-of-the-mill as well. Even the almost 4 quid chile and guacamole chips were pretty bog standard. It's a nice place though, a good spot to sit outside on a sunny day. The staff are friendly and the indoor decor pleasant. All in all though, if I'm going to pay over 15 quid for a burger, chips and ginger beer, I'd like it to be a super burger, chips and ginger beer!c*",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LM8kvBzsbu9qyEOZU3W2FQ"
  },
  "a22kqxwc4xHAsWda1sCTtA": {
    "date": "11/10/2012",
    "text": "Stumbled upon this place on a flying visit to the big smoke one busy Friday night.situated between Regent's Street and Carnaby Street the place looked busy and inviting so we thought we'd give it a go.Right, the negatives first.The service was slow, sit down...wait....eventually get a waiters attention, order food and drinks......wait.....drinks eventually turn up....wait....you can see your order by the grill.....wait...one of the orders arrives (you have to ask for cutlery) the waiter then takes someone else's order before getting the rest if your meal!!!!! (words were exchanged! )Yes they were busy but this is the worst service I have received for years, very very poor.Now the food.I went for my old favourite Blue Cheese and Bacon Burger.It looked good, nice ciabatta roll, lettuce, tomato and red onion salad inside, it tasted sensational, incredibly tasty meat, subtle blue cheese sauce, lovely crispy bacon, I had a side of chips which I pretty much ignored, so good was the burger.Yes the service was pants, but I'd go back tomorrow so good was the food.(Probably the BEST burger I can remember tasting for a long long time)My partner had the Tex Mex Burger (jalapenos, guacamole, bacon) and see was also blown away by the quality!Stunning food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GF3wzEb__JGvpcnCrs8Wbw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. Carnaby Burger Co.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GF3wzEb__JGvpcnCrs8Wbw/o.jpg"
      },
      {
        "img_id": "OWna78dF25cOwHXhcVs1zw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. The delicious Blue Cheese and Bacon Burger dissected.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OWna78dF25cOwHXhcVs1zw/o.jpg"
      }
    ],
    "user_id": "bQ3LZso3gCFnv91zfs_5eA"
  },
  "P_uALL3TEgng49PzXUjAUQ": {
    "date": "11/12/2013",
    "text": "Delicious menu with a great range of burgers. Excellent brioche buns! Everything sounds really fresh and exciting, and there are a number of different types of fries, including posh (with guac and sweet chili) and wet (with vegetarian peppercorn gravy). It's a cute concept; we sat in the window looking out towards Carnaby Street and listening to rock classics. Reasonably priced and creative drinks menu. Perhaps because we went for a late dinner, the servers kind of ignored us after we'd received our food, but whatev.There seems to be a room at the back where you can have a large group. Lots of vegetarian options (you can replace most patties with Quorn) and gluten-free.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks-RuwIQU_7oA5Sstor67g"
  },
  "7iu4hiD5W_dDZCtJAS_fvw": {
    "date": "7/23/2012",
    "text": "Carnaby has solid burgers, but the ciabatta buns are an odd choice as a default. In the end it doesn't quite fit with the texture of the burger and the cheese. They're still pretty good, but there's nothing special about them that makes me want to return, especially when the cheapest burger is nearly £9 w/out fries.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uNK8OEO4wEtcY2XYdYK1bw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. Up close and personal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uNK8OEO4wEtcY2XYdYK1bw/o.jpg"
      },
      {
        "img_id": "ShqNsBhT_nfyIja7e5nnCw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. Thick-cut chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ShqNsBhT_nfyIja7e5nnCw/o.jpg"
      },
      {
        "img_id": "RmIMs_5YfIkmuBV1vvDWJw",
        "caption": "Photo of Carnaby Burger Co - London, United Kingdom. Ciabatta burgers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RmIMs_5YfIkmuBV1vvDWJw/o.jpg"
      }
    ],
    "user_id": "Ctrp5IoEKHkixDSIyYHDpw"
  },
  "6KtqkWMkK4eOBL9PyVsDfw": {
    "date": "1/3/2013",
    "text": "We came here for a lunch after shopping in the area.  We were very impressed by the burgers.  I had a customized chicken burger, which was excellent (really liked the bread).  My brother-in-law raved about their unique veggie patty.  The fries were very good as well.  Service was excellent.  I highly recommend this place if you like burgers.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9pWuBXSLjvgqpW3MdAho5Q"
  },
  "s-kD3yDnCH6FHLU_TrVB_w": {
    "date": "2/7/2011",
    "text": "I love Carnaby Burger. The only downside is that it is located in the Oxford Circus area, which I very rarely go to. The food is delicious. I have a soft spot in my heart for the falafel burger, which seems like it gets bigger and bigger each and every time I order it. The American in me loves the food here because the sandwiches are those massive, greasy, condiment-dripping behemoths of taste. The chips (regular and their specialty versions) are little fried bits of heaven. However, I am warning that you should definitely have someone to share them with, as the burgers are normally excessively large as it is.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5lzxA444rZf39IpJiFYyVA"
  },
  "q20TyjOdQN8brTR2ft70Rw": {
    "date": "8/31/2010",
    "text": "Like said before, if you want a bit more than a Big Mac or Whopper and you're in Carnaby - this is the place to go. Not the best gourmet burgers around Soho (There's a Gourmet Burger Kitchen 10mins walk away which is much better)The burger are as expected for gourmet, very big, use fresh salad and dips. Service has always been slow which is a little annoying. I would suggest going to the Gourmet Burger Kitchen which is less busy, nicer burgers and attentive staff.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "VD0jfC6UZqg2VN1ocaB5kw"
  },
  "8IfJ-eKAtckVvD9Ij0gIBg": {
    "date": "7/29/2011",
    "text": "Only just a 3 because some of the little touches were impressive - the guacamole with the posh chips and the peppercorn gravy with the wet fries were both made with real ingredients and tasted like it. The burgers themselves were ok, nothing special. But the bun was a hot mess, either stale or not fully defrosted as it was hard and brittle, luckily the copiuus amounts of unidentified juice flowing from my pepperjack burger soon sorted this out... until it all started to disintegrate. Needs some attention people. Service was a bit too in your face - its a burger not a king crab i think most toddlers can figure it out... o yea the actualf ries themselves weren't up to much either.And there is a night club at the back. 3 stars confirmed then...much better burgers to be had but the menu is large so maybe the chicken burger or hot dog would be less disappointing?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0BTCHMYh7_DHyvq4D12LIA"
  },
  "wvj-PVj8vT5drYLSTdhhSg": {
    "date": "6/21/2010",
    "text": "Delicious. And even better we got 20% off because a friend have us their frequent burger card. It is basically a stamp system where you get a stamp for every burger you order.The burgers were delicious. The buns left more to be desired but the burger made up for it when I ordered fresh avocado, it was avocado and not guacomle. There are a ton of places that boast good burgers but the soup, burger, and chips here are great. The chili cheese fries were so greasy and delicious I wanted more. Can't wait to head back and try another burger, maybe a veggie one next time.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LVHJA0O0Z3RKdV8NGCi8SQ"
  },
  "bTC-pqgvFMzrqTaIyU8Ryg": {
    "date": "10/14/2011",
    "text": "The food I thought was quite ok for the price. I went with my girlfriend and orders:2 big dogs2 fries2 soft drinksTotal was £21 which I thought was quite reasonable.This is the third time I've been here and its the worse experience of service ever!The waiter who showed us to our table brought us our menu, then never came back to take our order. After about 10mins of waiting for someone to return to the table, no one did. Looking around I saw 6 waiters, three chatting by the bar and three beside the table next to the till arguing over the table numbers. I flagged down a waiter finally but he said to me that my waiter was coming. I waited another 10mins for a waiter to come, still seeing waiters standing around doing nothing, to which my gf had to shout at one of the waiter to come to our table. No one seemed to be in charge in the restaurant, a bit like leaving a school room of kids with no teacher.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LVeFXkgP98IxCPMvVzwzog"
  },
  "vBsZTUaxYPK1Ccj4qBZAYw": {
    "date": "10/3/2013",
    "text": "The classic burger with cheese lacks that something special. The patty was perfectly formed like a shop brought burger and didn't look hand made (i might be wrong), and there wasn't any juice that a freshly made burger leaves after your first bit. Hence 3 stars (ok). It's £9 without sides, posh fries are an extra £3.95. You can find something similar in any half decent pub with your posh fries, plus a decent pint...Service was good and quick. Wednesday eve.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5U_fiJ_vK28eayj8MHZSA"
  },
  "jNfkFBkSjE130CgFGeqFlQ": {
    "date": "11/1/2009",
    "text": "When you want to be so stuffed with delicious food that you have trouble making it out of the restaurant, Carnaby Burger Co. is where you should go.  My friends and I grabbed lunch here yesterday before shopping in the neighborhood, and I was immediately impressed by the extensive menu from a burger joint-the menu includes numerous varieties of salads, burgers and hot dogs, pastas, steaks, milkshakes, and fries.  And these aren't your typical meat, cheese, lettuce, and tomato burgers either-nope, how about a falafel burger?  or a chicken burger with brie and cranberry? I recommend the posh fries which are fries with ginger and guac-amazing!The only reason my review goes down to four stars is because of service.  The people were very nice, but quite slow.  It took me forever to get ahold of my waitress to ask for silverware, which wasn't given to me with my food.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "9oMYZWaut4YkEGQqL4nT_w"
  },
  "4HAKTBuIlXAFTZdbpoFPZw": {
    "date": "3/15/2010",
    "text": "NOM NOM NOM. BURGER NOM FTW.Carnaby Burger Co is a well-run burger shop just down a side lane from bustling Carnaby St that offers way too much naughty-food (i.e. delicious food that I really shouldn't be eating) for a totally reasonable price. The service is great, the restaurant is attractive, and the burger was serious NOM-status. Love it.Though we were enticed by myriad creative and awesome-sounding choices--Goat Cheese and Cranberry burger, Lentil burger, many excellent-looking chicken sandwiches--The Boy and I both just opted for good ol' classic Cheeseburgers. The drinks were teensy-tiny and came with more ice than diet coke, but I had a sneaky bottle in my bag so I was ok. A quick trip to the newsagents to grab the Observer and we spent a lovely, luxurious lunchtime munching some yummy food and taking our time over the paper. Not a bad way to spend a Sunday afternoon, eh? Though I will certainly be getting a salad next time I visit (can't justify eating more than one of these burgers a year!), I will look forward to a trip back. If they would only increase the size of their drinks (or at least leave the rest of the can for diners to refill their glasses!), I would be even more enthusiastic. If you're ever feeling like a big ol' dense bowling ball of a burger dressed with all sorts of crazy culinary embellishments, get your butt straight down to Carnaby Burger Co! You won't regret it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zptTiLrI85MWA96eDM84A"
  }
}