{
  "tp_aYSMho8O5FtIg8U4F3g": {
    "date": "9/9/2010",
    "text": "Food was distinctly average and the beer was warm. Very busy on a Friday night, and the venue itself was fairly nice, but nothing to write home about.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EhRzLBtMpKYNRON3JVHaXw": {
    "date": "1/21/2009",
    "text": "Great for drinks and parties, but perhaps not so great for Mexican food. When I came to this restaurant it was crowded, and the staff were slow and unhelpful. The food was okay, nothing special, and the portions weren't very big. The overall impression is that due to the amount of traffic Las Iguanas get thanks to the popular South Bank location, nobody cares if you will ever come back. If I were in the area again, I'd rather go to Cubana on Lower Marsh Street (behind Waterloo) where you can get all the cocktails and much more exciting food.",
    "rating": 2.0,
    "rated": {},
    "photos": [
      {
        "img_id": "IDSnOUJ3Xipw7IUrOrEo1A",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IDSnOUJ3Xipw7IUrOrEo1A/o.jpg"
      }
    ],
    "user_id": null
  },
  "8z-0i9O3BXQB9dI8aTg8ow": {
    "date": "3/11/2011",
    "text": "My wife and I are both new fans of Las Iguanas and decided to check out this one near Waterloo Station. For a Monday evening the restaurant and bar were ridiculously busy and we had to wait around forty minutes for a table. We filled that time with a cheeky cocktail which was rather nice. The dining area here is very busy and crowded. We were squeezed into a table with barely enough elbow room but the food and service more then made up for things. On this occasion we opted to have the taco sharing platter which is sensational and surprisingly large for the price (£12). I'd like to come back here but don't know if this particular restaurant has a 'quiet night' given that even Mondays are busy here. 10/10 for the service",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VnBbirXcIs18OPThUlxRxA": {
    "date": "1/14/2008",
    "text": "4 of us had a lovely Lunch here, the O2 is nice just to visit and wander around the main concourse, lots of bars and restaurants, we've been a few times for gigs/events and both times have eaten at Las Iguanas. They do a great deal on Cocktails at lunchtimes and a couple of Long Island Iced Teas (recommended) and I was starving...Try the XimXim, kind of a curry/Satay feel to it, but lots of extras for a hungry person and it was wonderful. (supposed to be Peles favourite and I can see why) My friends food was just as good, dont have starters, the mains are huge. The drinks are not too expensive and the staff were really great, friendly and attentive. The music was good too. I can highly recommend this place.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BETToAfMs6_EJ58F549MMg": {
    "date": "5/9/2010",
    "text": "It's a fun and buzzy bar but make sure you reserve a table or you're going to end up standing with the crowds as there aren't many bar stools. The drink are reasonably priced (£6) and great on the happy hour 2 4 1. My passionfruit caipirinha was great but the glass was so full of ice I could barely get at it. In Brazil they fill the glass about 2/3 with ice at most. What little I had was nice though. Avoid the Acapulco Cream one at all costs it is repulsive! I also ordered 5 tapas and they were all lukewarm, I probably wouldn't bother getting these again but would just come back for drinks. Bar staff were pleasant though, not always the case in such a busy place and service was pretty fast.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "oStwTHMZysQsAwPcMsyh3g": {
    "date": "6/16/2010",
    "text": "The restaurant is located in a really busy spot by South Bank and was absolutely heaving when we visited. We took advantage of the two for one cocktails when we were there which was great. The seating itself is really tight, definately trying to pack as many people in as possible and not mega comfortable. Food was ok, I had the chicken dish which is apprarently a favourite of Pele's when he was growing up.. it was nice enough. I think this place just has that rushed, packed chainy/touristy vibe which I just don't really like - you know they just want to get you out of there as soon as they can!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fy5HaeKaunJrlmFjXq6CVw": {
    "date": "1/19/2009",
    "text": "Went here before seeing Lee Evans in Oct 08, we had the pre theatre set menu which was really good value.The food was served quickly since it was full, we qued 1/2 hour to go in. If you like Mexican food, you cant go wrong.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Vg0guGUp7jyQ3bgVILftWA": {
    "date": "7/5/2010",
    "text": "very busy but beautiful location, think sunsetgreat deals and nice food. not good if your a large person as its packed with tables so no room to move",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_96vOTKdPGMqH5Ap7Q9gXg": {
    "date": "2/10/2009",
    "text": "Came here in the summer for dinner with 2.5 friends*.  We were seated outside, by the walkway on the Thames and it was a beautiful night. The food were decent portions. I specifically remembered the Paella we ordered because a homeless woman**  had no problem devouring it. Did you just go back and re-read that sentence? My friends and I were enjoying our dinner and having a lovely conversation*** when a homeless woman came by and panhandeled while we were eating our dinner. My friend tenderly said that we didn't have any money for her but that we would have left overs. Sure enough the woman took her hand and started eating off the plates. Then she pointed to the paella my friend was still eating and asked in her lovely east London accent: \"What about that, are you going to eat it?\" and before anyone could answer, her fingers were digging in. No one knew what to say or do so we just sat and stared. By the time she polished off our Paella the waiter saw what was happening and \"shoe-ed\" the woman away. He apologized and said that the woman comes by begging for change often, then left. We all felt awful for this woman and would have loved to giver her our leftovers, if she left any. Maybe we brought it upon ourselves by being unclear as to what \"leftovers\" are. We ordered about 4 dishes (like I said i only remembered the Paella), we were all stuffed... although, I guess I can't speak for the homeless woman. I hope she had enough to eat that night. Our bill was about 75 quid. Not too shabby for a nice restaurant on the Thames. Just be careful not to offer leftovers to anyone until they're actually packed in the doggy bag.*hah, and you were annoyed that you couldn't give establishments half stars on Yelp.** my .5 friend. Not because she's .5 of a person but because I never got her name.*** ok fine, the rule #1 rule while consuming yummy food is NO TALKING.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Z2pXm4f-2O5ZpMUmXuYK0Q"
  },
  "H_nXqcAaMBtYw7BBwuS-Vw": {
    "date": "2/26/2010",
    "text": "I must say that I was a little disappointed by Las Iguanas. The food isn't horrible, it's just that it's nothing special at all. If I didn't know better ( not that I do know better ) I would have said that the meals are pre-packed ready meals shipped in and re-heated. For starters I had chorizo braised in rioja. I cook with chorizo all the time at home, being a fan of Spanish cooking and I know that it has tones of flavour. The sauce I had didn't taste much of chorizo or the wine, and should be rich with the taste of both. The starter was \"nice\" but nothing else. I could cook this at home much better. For mains I had the Xim Xim chicken. The chicken was pale white and slightly rubbery - in fact exactly like you would find in a ready meal. The dish described as lime chicken in a peanut/crayfish sauce didn't taste of lime or cray fish or peanuts. The sauce was creamy slightly peanutty. Again, not unpleasent, but not at all great. I have had better ready meals. The green beans I had were raw. Don't get me wrong, I am not one of these boil the veg to death brits. I love my veggies to have crunch and texture, but there is is that and there is raw - my veg was raw. My desert was passion fruit cheese cake which was actually very nice. However, I wouldn't go out to have a meal somewhere for the cheese cake. The staff were business like and professional. They did the job and nothing more. Just like the food. It seems like getting the job done is enough and going the extra mile is not required. The music was far too loud like the place is trying to hard to pretend to be something it's not. I can't see myself going to Las Iguanas again - the food is bland and I have to shout to be heard.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aHh6TixQ2x9xnnIWewel5w": {
    "date": "2/2/2009",
    "text": "We were originally planning to go to DimSum (3 shops away from here) but it was closed due to the snow. So we decided to drop in at Las Iguanas.Great food, good music, lucky find. Will definitely be back sometime. They have happy hour all day Sunday if you care for a drink x2",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnW8s96nCnFFn4q5chWw8w"
  },
  "tKOPDWx6Y3A2D5BTL82IYg": {
    "date": "10/16/2009",
    "text": "Your standard Las Iguanas food, tasty, well priced and attentative staff. Great deals on cocktails during happy hour (usually on until 7pm) 2for1!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21BHwqdpSWIZqlhTW5KUUQ"
  },
  "SouYTa1K6sf44SmaU_WYow": {
    "date": "8/13/2009",
    "text": "Cocktails are great here, especially if you come during happy hour where you can get 2 for 1's! But the food is appauling, do not waste your time on it, it is overpriced and tastes bland.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6xn_8Pmd19eTtjltv68Zsw": {
    "date": "9/19/2011",
    "text": "We went on a Saturday early evening in July (2 couples). It looked there was a fair queue outside but we got to the front very quickly. The waitress raushed our drinks order so we could take advantage of the 2 for 2 cocktails offer, great! Even though they had an early evening set menu, we opted for a la carte and had steak, chicken kebabs, prawn curry & steak fajitas between 4 of us, washed down with 2 huge jugs of long island iced tea. Perfect fodder before a night on the town.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Ko5Q7Gy_sfKyo5DsctWsfw": {
    "date": "1/25/2009",
    "text": "Myself and my husband had a brilliant night here recently. I had the duck fajitas for my main course (after seeing them on Masterchef) and they were to die for. Loads of duck and really tender. We were there on a Sunday night and had a voucher for BOGOF on main course which was excellent and saved as 12 quid. They also had a deal on for BOGOF on there cocktails. I had a Long Island Iced Tea which was great but the Vanilla Mojita was the best cocktail that I have ever tasted in my entire life and I have had quite a few in my time. Even without the deals prices are reasonable as great food and staff and a really wonderful atmosphere.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fAxGTWR5YdsSxtpQ3Of2_w": {
    "date": "10/31/2007",
    "text": "This restaurant is a real gem on the South Bank. Specialising in Latin food and drinks, it has an amazing menu which contains everything you may want from bar snacks (nachos are excellent) and a variety of tapas to delicious main meals (ranging from an amazing brazilian curry to tender steaks and lamb), all at a reasonable price. Best of all is the fantastic cocktail list (the caipirinhas are fabulous) and the fact that on the 5 or 6 occasions I have been, I have always managed to get a table without more than a 10-15 minute wait. That said, it is still busy and vibey without being overcrowded. Definitely worth a visit!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-j29xyl4i-FvIcKDj2MAfQ": {
    "date": "1/15/2008",
    "text": "beautifully located you may reach las iguanas crossing the bridge form embakment station, that sets you up for all an experience. i must say it is a bit noisy, and i do hate latin music, but appart from that the place is very pleasing, staff is friendly and helpful, which is cool, being the menu as complicated as it is, even for a spanish bloke.take your time, there are a few gems hidden in the menu.the brazilian dishes, xim xim and moqueca resemble a bit the indian curry, but with another concept of flavour. xim xim is a daring and nutty chicken dish...the favourite of pele, according to the menu. moqueca is a salmon dish, based on coriander and coconut that scored high for me.many people will be tempted of fajitas. well, they are great, served in sizzling skillets, with tortillas for you to wrap it, or bunddle it ,depending on your skills. fajitas are a bit expensive, but you get the joy of handling your food ,mexican style.then, some grills and meats. among those, lamb is just cool, a chunky shank to wolf down and not mess up wraping your stuff.last of all, desserts, really really nice, the mascarpone with merengue is delightful. even you can ask for a single scoop of coconut ice cream for the digestion if you had enough. wines and alcohol plentiful. a good place after all. even after the bill, which won't be little",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ST2c_uofU6QSM_FSAymahw": {
    "date": "7/3/2008",
    "text": "Absolutely fantastic! The food is delicious, portion sizes are extremely generous, brilliant value for money, excellent atmosphere and happy hour between 5-7pm - what more could you want?! Service is very efficient and friendly! If you want to eat there between 4 and 9:30pm make sure you book, it gets very busy and they quite often don't have 'spare' tables until 10pm on Thursdays/Fridays/Saturdays. Highly recommended!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dV1onvF5iH8YLQBwRsI61A": {
    "date": "7/30/2013",
    "text": "I popped in here with a good mate of mine for a catch up. We had a few beers or ten outside before coming inside. I didn't eat but my friend said the food was good. The beers were good apart from them running out of Corona which is understandable, baring in mind the amount of people that were there. The service however was quite poor. It was difficult to get anyone's attention, again, due to the amount of people there. All in all, I had a good time bar the service. I shall be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OK24Bcw7wyP3P9n6FKg5Ag"
  },
  "E4whqeeSpe3zehXi6PrN2Q": {
    "date": "1/25/2014",
    "text": "After reading some less than positive reviews about Las Iguanas, I was a little bit worried but we had super food, excellent service and a brilliant time. We booked ahead which is a must and we also arrived quite early at 6pm, so I think this added to our overall good time as we didn't have to wait for our table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RPkuW3E72ZH1Lp2RXt9kkw"
  },
  "SQ96LD5OtuDwLRO1X6dn_w": {
    "date": "9/28/2010",
    "text": "Although I love going there because of the area, it is hard to say good things about Las Iguanas.starting with cocktails- I have tried almost everything on drink menu- and nothing really was that impressive- unless you don't care about taste and enjoy sugar and alcohol at any ratio, drinks are really hideous!Food wise, I like that this restaurant have options like vegetarian dishes, Gluten Free, special dishes of the week, etc. nevertheless, you still get cold dishes, easily find granules and stones in your meal, or at the slightest find the taste not up to expectations!Service in one word- RUBBISH- you need to beg for the waitress to look at you!!and after all what was mentioned above, you still have to wait every time between 30-45 minutes to get a chance to eat there!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kIHG6LSUp-Ubqe9zbayzA"
  },
  "4zY8KYhALISE9ynu2aCC9Q": {
    "date": "8/22/2010",
    "text": "Came here with a friend while down in London the other week, looking to have a drink and a few things to snack on at the same time. The Nachos (Around £5) were a few chips scattered loosely across the wide white plate. They tasted dry and papery. Some were covered in a thick layer of cheese that had the texture of dried glue and didn't really taste of anything at all. In the middle of plate was a pot where watery canned tomato seeped together with cream and a vague green paste that would be difficult to call guacamole.  The Calamari (also around $5) were equally disappointing. There were four or five small squid which just about covered a (thankfully) smaller plate but still seemed to be taunting our hunger with how few they were. They shared the nachos overwhelming impression of being turned in a microwave until they were warm and slightly soggy. The squid itself was overly chewy so that it stretched out and tasted much like an elastic band when you tried to bite into it. In keeping with their seaside origin they had been rolled around in what tasted like sand - small, grainy breadcrumbs that didn't add any crispness. Only by rolling them around until they were covered in the mayonnaise could you get them to taste of anything at all.  Service was poor too. After a good ten minutes gazing around, at the start eventually I got up myself to collect some menus. There were plenty of staff running about but nobody made any effort to come to us. I then had to get up again to get somebody's attention to order, only to be told that if you sat outside you had to order at the bar. And then I got up a third time because no napkins were brought out with our two finger food dishes.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ew1rDXAMZtAJcenq2nOwHQ"
  },
  "ld3jUfTkIpMriVRFiLFwGw": {
    "date": "6/30/2011",
    "text": "Went with a friend for a pre-theatre meal. We opted for the tapas to share - 5 courses for £22 (before 7pm) which was brilliant - the lamb empanadas were a definite high! We also had the Happy Hour cocktails - two glasses (or pitchers) of the same cocktail (from a choice of 5 alcoholic or 3 virgin). So the final bill was under £30 for the 2 of us (exc service), which we were more than happy with. I would definitely go again to work my way through the tapas menu, although I think that the main menu after 7pm may feel a little costly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mwhar09i6Zmhlo-xw5mDow"
  },
  "LQMZAuoYuLDWRdjLJYF7og": {
    "date": "2/13/2013",
    "text": "I live in San Diego (which is practically Mexico). So I'm judging this in a bit unfair way, but meh, I've had better mexican food. Guacamole was average, the lamb meatballs were tasty, the chorizo-black bean brazilian main dish was pretty good. Patatas bravas were not so good. Mojito was quite poorly prepared. Overall, nice location, ok-ish service, meh-food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xl_TqSKBvWl_Wv3MyTJeLg"
  },
  "9whYHOwvKpPTjgnwuNqZiQ": {
    "date": "6/14/2010",
    "text": "Had dinner here on a summery Friday evening. Here's a list of my impressions, in timeline form. - Crow-ded! And nobody's eating. Hope there's seats outside and that the food is good. - Wow, I can barely wiggle to my table, it's so close to the neighbouring ones! - Ooooh! Lots of cocktails. And tortilla chips. Yummy homemade tortilla chips. More please! - Cute waiter. Spanish. (not latin american -their pronunciation differs-. I am very slightly amused) Very nice, and fairly efficient, if in slight headless chicken mode. - Hmm.. Enchiladas or Quesadillas... Enchilada it is! Not rolled at the ends, it makes for an impressive length on my plate. But surrounded as it is in refried beans, it looks like a wooden log floating in a pool of s*. Nonetheless very very good :) - Eating the enchilada I accumulate an onion-bhaji-worthy hill of onion pieces. (I don't like eating too much onion, the flavour's too strong) A tad much, perhaps? - Hill of rice under enchilada is very rich... in uncooked or overcooked rice grains. My teeth hurt and I need to return items from my mouth to the plate somewhat ungracefully. - We dined so late, that I'm still hungry. As a result, the desserts menu intrigues me. There is a chocolate pot that mentions kahlua and mocha custard... I drool, then order. It looks like a glass full of chocolate mousse, but it's much better than that. Me and the boyfriend have a spoon battle in the glass for the most chocolate. NOM! - Waiting for the bill and for paying the bill takes a while, and given the sun has disappeared over the embankment, the chilliness is a potent reminder of wanting to move. Overall: good food, great dessert, average speed service. Cocktails: £6, Enchilada £10, Fajitas £14 (not that much meat, and they hide the veg under it!) Desserts £5. (roughly) Highlight: Location, location, location. Benefiting from delicious sunset light, this place has excellent outdoor seating for chatty summery afternoons. I would never come back here unless it was to sit outside, soak up some sun, and watch the people walk by.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "ZWnTG4HLueMXMwNb8s-zaw": {
    "date": "11/23/2009",
    "text": "I met with a few friends for dinner tonight and we browsed the row of restaurants on Festival Row before settling on Las Iguanas.Firstly, I have to say that the kitchen and waitress were really good when we told them that one of our friends had to catch a train from Waterloo station in just over an hour and they made sure that our starters and main courses were served promptlyAlthough the menu is Latin American, it's mainly dominated by Mexican and Brazilian dishes. Having said that, there were some interesting Brazilian curries on the menu which I've not seen beforeWe had missed the value tapas deal and ordered a selection of starters to share - nachos, calamares (deep fried squid), gambas (prawns) and champinones (mushrooms in chilli and tomato sauce).While the nachos and calamares were quite generic, the gambas and champinones had some kick, which was niceFro main course, the salmon moqueca was a creamy coconut curry, which was quite mild but flavoursome. My cordero - lamb rump - was a bit disappointing as I couldn't really taste the coriander and parsley rub nor the papaya in my salsa. My friend's spring chicken was nicely roasted but served with cold vegetables. The steak fajita was quite genericThe banoffee pie was passable but not enough banana! I did enjoy a virgin apple mojito while my friends shared a nice south American merlot.I did enjoy my evening here but this may not be the most authentic Latin American food you'll find in London.A last bonus was that we spotted Juan Martin del Potro dining here. He's the current men's US Open tennis champion from Argentina",
    "rating": 4.0,
    "rated": {
      "useful": 11,
      "funny": 3,
      "cool": 9
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "4E6qRUYH9AhTQ7Apgs3wxg": {
    "date": "1/18/2010",
    "text": "2 for 1 cocktails during happy hour, 12p-7p EVERYDAY.  No that doesn't mean yall order two different cocktails and pay for the more expensive one.  That means you get two of whatever cocktail you order, at ONCE.  NICE.  Double fisting (and no that doesn't mean whatever you think it means, non-yankie-college attending peeps).I got a grilled chicken chimichanga the size of my head (also, try to ignore that blatant innuendo) which was deep fried and delicious.  Authentic?  Probably not.  Filling and delicious...and cheap??  YES.  Somebody please remove one of those pound signs from the price range, likenow.For some tasty tex-mex swing by Las Iguanas...it's on the way home from work so always an option to sip on two cocktails at once and stuff my face with Chevy's-esque chips and salsa and large quantities of cheese/meat/beans/rice.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "X4RmwwxpRjAkjm50DYLmoA"
  },
  "WRRjlsXaM_xxuLQ5AyXc7w": {
    "date": "2/17/2010",
    "text": "A good latin/mexican/brazillian food outpost in a great location on the Southbank.In my experience, the food was ok to good, but I felt like I wasn't getting great value. We took advantage of a cocktail pitcher to go with dinner for 3 of us. By the time we'd poured the whole jug out we'd barely filled each glass 2/3 full. Woah there, easy on that ice!As for the food, not bad at all, but the portions were stingy. We got some loaded nachos to share and a quesadilla before our mains thinking they'd tide us over. They really didn't and we'd seen them off within 2mins. No joke. My burger seemed like it'd had grown up in a White Castle yet my friend's risotto was about right. The other entree ordered was again on the small side. It's a shame we had to stock up on popcorn afterwards at the IMAX!I've also been here after work on a Friday just for drinks and it has a good atmosphere, especially in the warmer months when you can stand outside. I'm afraid that's all i'll be returning for; not the restaurant.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "ig0QX3mvPgnVcnIN1YUCiQ": {
    "date": "7/8/2009",
    "text": "I reeeeeeeeally wasn't expecting much from Las Iguanas, because every time I have walked past, it's drunken post-work clientele annoy the pants off of me. But if you can brave the crowds by the doors taking advantage of the 2-4-1 happy hour in the bar area, you'll find a pretty decent restaurant inside.We only had a half hour wait, which gave us plenty of time to enjoy margaritas and caipirinhas (2-4-1 of course) under the umbrellas outside by the South Bank. Service was good all night, considering how busy they were.The food is so much better than I thought! I was expecting grubby Mexican or half-assed Spanish food. Oh no! Featuring mostly Brazilian dishes, almost all of their options are HEALTHY and delicious. I had grilled chicken, which came with roasted sweet potato and squash pieces, roasted grape tomatoes, and a handful of rocket, plus a choice of sauce (tons of different types of salsa to choose from). I had the papaya mint salsa... MMMMMMMMMMMM. Warning: their guacamole has sour cream in it. Told you Larissa D!Anyway, if you happen to be in the area, say, to catch a gig at Heaven just over Waterloo Bridge, then give Las Iguanas a try. Es muy bueno.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "XGaMoQ6sg0B5hSzC5aRmdw"
  },
  "3I5m5mZuJJD3FBppYd72Lw": {
    "date": "9/11/2009",
    "text": "I labeled Las Iguanas as another Giraffe before I tried it, deciding that the suited city boys drinking cocktails after work as I walked from Waterloo to Embankment weren't worth joining.Until, short of options, I went for dinner. The happy hour accounts for the aforementioned smartarses, but the restaurant has a wholly different feel to it. You are well looked after and the menu is varied, interesting and modest in price. There are plenty of options for carnivores, herbivores, and allergy sufferers, and with a much larger space than it first appears, you don't usually need to wait long to be seated.I've been three times now and enjoyed it every time. That said, I'd recommend the full meals over the tapas options, which are slightly lacking in comparison, both taste-wise and value-wise.Before I make up any more words, I'll leave you to see what you make of it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5vD1hK-oG4tKgnLKZCGRhw"
  },
  "4YN4x4o79QZuiYy6shwLNg": {
    "date": "12/6/2014",
    "text": "Been to all of their London locations, all equally AMAZING. Been going here for years whenever I visit London, it's my favourite restaurant ever. Best mushroom fajitas ever, they are delicious beyond reason. Best nachos ever too, they sprinkle some spices on it that are so darn good. Go during happy hour though because their drinks are pretty expensive, but at least you can buy a pitcher and get one free! Their Long Island iced teas are simply the best. Amazing Latin playlist too, and cool decor. Go here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOTN-5XmAHGlhnaNtbVXqw"
  },
  "UgzvnvX-Y77aWVSFZkyiIw": {
    "date": "5/3/2010",
    "text": "I love, love, love the food in Las Iguanas. I also love the theming and the music but as with all chains, each venue can vary in terms of service and food quality. I headed here for lunch today and was pleasantly surprised by the lunch menu with main meals at just £6.90 - a bargain for the portion of chilli, rice, tortillas and tortilla chips that I got. Until 7pm there is also Buy one get one free on cocktails which I urge you to take advantage of. The bar service we got was hardly with a smile though, I think we caught the barman on a very bad day. He prepared the wrong drink and when we made reference to it he threw the drink (and almost the glass) at the sink with not a word of explanation. With that aside, the food was good. It took a while to come out, but we were served with tortilla chips and guacamole while we waited. Do note though that as this is a busy chain there is a 1.5 hour limit on the tables so don't expect to while away the afternoon here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXcUi2fBbV18TNpOpfi-rw"
  },
  "fVEpcBHteXWv6CgK7PHqoQ": {
    "date": "12/21/2009",
    "text": "No thrills, no creative fresh cuisine even though the menu would try and tell you otherwise as much as I wanted to enjoy the place I just found it poorly executed Latin themed.  Now to be a bit more clear ...Even though they have a happy hour the cocktails are quite poorly made and presented, especially if you are after a old favorite. I always hate writing terrible reviews but nothing really came together for my party the other evening at Las Iguagnas. The starters were anything but fresh and the salsa puts jarred off license salsa to shame. All the street food is not as processed as tex mex but lacked any real flavor and I would have to say we tried both Brazilian curries and it tasted like the curry special at your local pub. I have no other way to say it, poor service and disappointing.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTKJnHOq1FCgcdJYzMzm2g"
  },
  "PQHWgQ2wnPU1AbjU-INJZg": {
    "date": "6/11/2012",
    "text": "It's hard to find a good ol' burrito in London, but Las Iquanas delivers. Big portions and good flavor. A little noisy, but the food is worth it.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qHJnFFnZlgHHo-kWoYTmPw": {
    "date": "7/16/2009",
    "text": "The South Bank entry in this London chain of Mexican-ish restaurants. This spot if great as a meeting place, right at the south end of the Jubilee footbridge. It's a good choice for meeting before an arts event in the South Bank Centre, too. It's very large, with many dozens of tables inside, with shiny new decor. Outside are several tables too, with the occasional rumble of trains above your head leaving Charing Cross station. They have good deals on during their noon-7pm happy hour. Several cocktails are 2 for 1, house wines are a few pounds cheaper, and there are several meal deals. The food and drink menu is extensive. It's all a bit chainy for me, though. The only beer on tap is San Miguel. They have several bottles. Good because of its location and size, nothing special otherwise.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3IZjJTDAx6x0EPVns3ZHbw": {
    "date": "12/3/2008",
    "text": "The Southbank branch of this small Latin American chain of restaurants and bars, the wonderful thing about this establishment is it's wonderful position. IF you opt to sit outside on one of the many heated tables, you have a splendid view of the Southbank. There's a happy hour between 5pm and 7pm, where it's 2-4-1 on the extensive cocktail menu; they've gt pretty much everything you could want, and their Long Island Ice Tea's are fantastic. They serve a vast menu of Southern American dishes, the usual fajitas, jambalaya rice but also some great little tapas dishes, their spiced potato's are very nice. Prices are pretty steep, but given the location you're paying for where you are, as much as what you're ingesting. The vast cocktail menu, and long opening hours means this is a popular spot with those looking for a place to drink on the Southbank, and late into the night the place gets very busy, making it fairly hard to get to the bar. A great place to sit with a friend, having a good old chin wag over cocktails, watching the world go by on the Southbank.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "B5YMFMRpeR101H4EDJv5pQ": {
    "date": "10/25/2009",
    "text": "I had been to quite a few spanish, portuguese and south american places in the last few weeks ... so i was a tad disapointed when my friends selected this one for the sunday dinner. But maybe it was the food, or it might have been the pleasant environment of the south bank, i have ended up feeling good about this meal.We started off with a pitcher of Long Island iced tea. Now i have had long island at many places, but the muddy colour of the drink here was clearly unique. It tasted good though.The food was menu was a mixture of spanish and portuguese and mexican and brazilian food. I ordered a lamb empanada as a starter. It was pretty much a lamb pasty, though the filling was cooked in a latin american style. Very tasty :)For the main course it was ensopado de carne ... a dish of red goat meat curry and rice. The curry wasn't spicy ... a bit sweetish in fact ... but the combination with the rice worked rather well. I was pleased.The service was good. In spite of it being a big restaurant and very crowded when we went in, we didn't have to wait long for anything.In the line of chains that adorn the south bank centre, this is surely one of the better ones, and at 20 pounds per head, one of the reasonably priced ones.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "yRow_F_QceHiCnQWA9UHrg": {
    "date": "10/9/2008",
    "text": "Haven't eaten here but the cocktails are great. Fantastic location if you can get a table outside in the summer too. Also a lovely spot for a late drink post theatre, the crowds have died down by then and you can get a table at the bar easily.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-58CWJ48is4duXgpvsWEGA"
  },
  "JEJAC2xlBA-Bzpj7GZCN1g": {
    "date": "4/15/2015",
    "text": "I usually love Las Iguanas as a chain, but the reason I am not checking in here, in keeping with the theme of the restaurant my phone also had no service. Firstly our booking was mixed up and so they gave away our table. When I proved that we had a booking for 11 at 18.30 not 18.00 they found us a table for 10 and then we had one person standing for 20 mons until they found us another seat. We waited 45 mins for our cocktails which was probably because we were a large order and in the happy hour, but when they arrived they had mixed up the order. Our starters arrived before our drinks and the starters were good, but spicy and the tap water we ordered for the table didnt arrive until after our mains. We had to send three mains back, not inculding the veggy burger they assumed we had ordered, because they had mixed up the style of burger or over-cooked the steak to beyond edible. The staff didn't come to check on us until they finally delivered our water. All in all this is the worst Las Iguanas experience I have ever had. I won't be returning again, but as it is situated in a tourist trap I doubt that would matter. If you are a tourist and thinking of coming here, don't there are more interesting and better places nearby.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RDIHIE0Fawi_T553O-PT_g"
  },
  "LfbJS_yUEVK5ClLc5jxFyw": {
    "date": "4/4/2015",
    "text": "I've been there two days ago and received the worse service ever. When we sat down, no one came to serve us for like 30min. After we've been served, we had to wait more than 25min just to get our drinks on the table that were already done (just no one bother to bring ) so we had to ask for them. It wasn't even that busy.The food was great tho. Rather than that, waiting for nearly an hour to get something really exhausted us. Not comming back",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sfHHy1k9u9SjEKQLURChYQ"
  },
  "7tnKU7XFhMqdH1BGMfkosw": {
    "date": "5/23/2013",
    "text": "The first drink my friend and I had was a passion fruit champagne drink. It was okay. I could taste more mango than passion fruit. It was a 2 for 1 at like 9pm lol. Then we both wanted to try the passion fruit caipirinha. The bartender was very passionate about it according to my friend. Telling him the story behind it. The drink reminds me of a margarita. Not a fan of margaritas. Too limey. The drink was impossible to drink due to the passion fruit getting stuck in the straw lol. It was very different. I would love to come back though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d1kfyfvbz728Q6L6OUNLOw",
        "caption": "Photo of Las Iguanas - London, United Kingdom. Passion fruit caipirinha",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d1kfyfvbz728Q6L6OUNLOw/o.jpg"
      }
    ],
    "user_id": "K7B3tFqLFbG8DSK7yLjCpQ"
  },
  "JtxBsmGydxBTMFW3Mud7eQ": {
    "date": "2/7/2015",
    "text": "We ended up in Las Iguanas when we were looking for food on the Southbank. We were told the wait for a table for two would be half an hour so we grabbed a couple of cocktails at the bar. It always seems busy in Las Iguanas but especially as we went on a Friday night. Cocktails were ok (my friend had a mojito and I had a strawberry dacquiri) but I've had much better for the same price elsewhere. The dacquiri was a little bit sharp for me even though I happily eat slices of lemon! The wait for a table ended up being near to 45mins so we wish we'd ordered nachos to start to eat in the bar first, which a couple next to us had done. When our number came up we were shown to a table and I have to say that I was impressed with the staff. They were friendly and calm despite it being so busy. So often in chain restaurants I find the staff aren't always like this so I really noticed it.We had nachos to start then I had pollo con chorizo and my friend had a burrito. The nachos could have done with a bit more cheese but the guacamole was good and the tortilla crisps were really tasty. My chicken and chorizo was delicious and flavoursome but I would have liked more meat in it and less rice on the side (although I shouldn't really complain about being given too much!). The portion sizes were good and it was reasonable value. My friend enjoyed get burrito but didn't manage to finish it as it was pretty big.I've had tapas here before, but it's better in groups so you can get more variety of dishes. Overall a good chain restaurant. I've not been to South America so can't compare the food for authenticity but it tasted good to me.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djbrXe5gUUaVDWIEqGrq9w"
  },
  "cNjYoYmdngEtbWYlVteBxQ": {
    "date": "5/22/2015",
    "text": "Cheap and cheerful.Easy and quick but a long way from fine dining.Considering how many better restaurants are nearby I can see no good reason to eat here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HCA8QLZcJBNY8InbFaXAQ"
  },
  "RrX7QoFLTO3WWOPxNjXdgg": {
    "date": "3/26/2015",
    "text": "This is an incredibly friendly place.You're always given a welcoming reception and great service for the entire stay.With regards to food, a myriad of Latin-style dishes awaits.I must emphasise Latin-Style - as sometimes it seems that with certain dishes, food is placed much too neatly on the plate, considering the cuisine.BUT that is just my personal preference - I tend to love a good mess on plate in all honesty! :PI'd definitely recommend Las Iguanas for many occasions.Try the XinXim and the Chicken Enchilada!Price wise, hmmmm - Well, it is central London after all :)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PSD52ISJf05NhlC2U_rqMg"
  },
  "RD1bqlKKJ6J0m3Idmv3rvg": {
    "date": "5/25/2014",
    "text": "I'm surprised by people's enthusiasm for this place if I'm honest. My sum up would be: mediocre food at tourist prices, and weird cocktails. This is the second time I've been here and failed to be impressed. Nothing was terrible and the service was friendly. But the food didn't live up to the fantastic sounding descriptions in the menu - I had a brazilian chicken number which sounded incredible, but turned up looking like a canteen curry and sounded like something i could probably throw together given a can of coconut milk. It was tasty, but I was expecting more - although the pink pickled onions were lovely. My friend had a similar experience. At £13 each those dishes weren't cheap either. The fajitas which went past us looked to be nice and substantial but with Wahaca just down the street and i'd walk the extra few metres: Las Iguanas is mex-lite, I think.  We only tried one cocktail, the coconut margarita, and it was just plain odd.  Like 2 different drinks in one. The drinks prices, to be fair, are quite reasonable but the bar space is cramped as the wait for tables can be long. Convenient and by no means terrible but I'd recommend a wander around the South Bank before you commit...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "_I0KIrVlZq4sSiOUSbPT7Q": {
    "date": "7/30/2013",
    "text": "Las Iguanas. My favourite. Where to begin? This was one of the highlights of my birthday, food and drinks at this fabulous restaurant with the Englishman. The wait was ridiculously long and we ended up waiting much longer than we were advised. Usually that's fine as you wait around the bar. However, it was a serious wait to get drinks as it was so packed and congested around the bar. The Englishman raised the issue with the staff who were very courteous and seeing how it was my birthday and we had to wait for soooooooo long, they very kindly offered us happy hour all night. Amazing! 2 for 1 on drinks all night. The drinks at Las Iguanas are delicious! My favourite is the raspberry caiprinhas, what a dream. The food is delicious! Las Iguanas is definitely worth checking out if not for the drinks alone.  Tip: Check out other locations away from tourist traps for less of a wait to get in. I took a star off because of the wait, but the staff didn't let it ruin our night out and the dining area is a bit too dark for eating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEOkH2CXCEg00NggPwB-ZA"
  },
  "3pz3DcVC4bXGJ1qFGsmu9A": {
    "date": "7/14/2015",
    "text": "I love Las Iguanas for its ever happy happy hour! Plus the new drinks on there are so luscious! The Coco Manzana was surprisingly delish with a good kick ;) Food is great for a chain restaurant - I am a fan of the tapas and the new lamb meatballs are just yum and as always the champignones are always ordered:) will be back soon!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mz-dF85zuAetYW2ZvO6f0g"
  },
  "GqBS4ie4G8KRJScAI-PoSQ": {
    "date": "6/10/2015",
    "text": "It was okay.They have happy hour which ends at seven, theres a nice range of cocktails to chose from but you have to have two of the same despite them all costing the same, it would have been nice to try to different ones! The cocktails were good, my girlfriend had the iguanas cosmo - I must admit I quite enjoyed it too!The food was  good, we had fajitas, very nice - would definitely go back for the food.We also had the churros for dessert, very nice.The atmosphere was very loud, which wasn't ideal for us, catching up with friends but we still had a lovely evening.The staff were lovely and very good and attentive considering how busy the restaurant was.It was very nice but would maybe go for a different kind of occasion next time!(for all you vegetarians out there, there is a whole separate vegetarian menu, so you'll be spoilt for choice, our vegetarian guests were very pleased with it)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hcGna-OEuQ7Adz41az6yg"
  },
  "647erbvPhOr-8Cdf_kcdZA": {
    "date": "11/6/2012",
    "text": "Every time I walked past this place for some reason I thought it was a generic European restaurant. Despite it's name and decore, it had never tempted me in based on that incorrect assumption. A friend brought me and the Mrs here after a trip to the Wonderground, it was heaving. The bar was busy and the restaurant full from what we could see. Three is not the magic number when it comes to restaurant seating but we were seated within minutes by the extrovert and friendly hostess. The cocktail list was expansive and there was a great choice of tequila (for me) and non-alcoholic cocktails (for the oldies).  Great timing, Happy Hour, BOGOF. It was a tough choice, I love Mexican food. There were the standard fajitas and some surprises there. Good Vegetarian choices for mains and deserts. The service was fast for the size of the restaurant and how full it was. Our waitress was friendly and up beat and got a big tip from us. Downside.... Christmas tree, in SEPTEMBER. Loose a star for that. Defiantly would recommend if you want a decent meal after a stroll along the river.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9s6xe93UEyFvV28URWRrtA"
  },
  "Efg8HDxiKosem7F17KdmQQ": {
    "date": "4/20/2012",
    "text": "I find this chain really overrated and disappointing but other people seem to rave about it. I've only been to this branch once and that was enough, because of its location - on the Southbank and close to Waterloo Station - it's always packed and full of tourists and I think the service is slow; surly and pretty poor. The food was okay when I went but nothing to write home about, the drinks especially the cocktails were good but again, there are plenty of other restaurants that deliver more for your money and appetite!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S771b84rRUVnRRFy1fIBcw"
  },
  "CCSNaxagYLOa993DdOw8mg": {
    "date": "2/12/2012",
    "text": "Las Iguanas - how the mighty have fallen. When i first visited, I gave you 4 stars. After many more visits, I gave 5. But after my last 3 visits, you get downgraded to 3. Why? Because you keep changing what is good!Ever since I first started going to Las Iguanas, the hosts/hostess/greeters/whatever you wish to call them have always been crap. Rude, or non-English speaking, or just unavailable. They seem to have gotten worse of late. A few months back I wanted to meet up here for dinner with friends. We had a day and time in mind. So I tried to make reservations. There were 4 in our party. We were told we couldn't book for less than 5 people, but were told that they \"keep 1/3 of the restaurant available for walk-ins\". I called back and fibbed and said we had 5 as we really wanted to make sure we could have a nice night out. Upon arrival we were told they \"needed the table back\" in 1h45m. What?!  After about an hour (with slow, but polite, service) we kept being reminded that we needed to hurry it along. In the end, we took our drinks and desserts and moved to some empty seats outside. We watched as \"our\" table remained empty for nearly 40 minutes.After that occasion, at the request of my bf's mum, we returned this weekend. Again, I wasn't allowed to book a table for 3. Again I was promised that \"1/3 of the restaurant is kept free.\" We got there and were told by the VERY rude host that there was a table \"right now\" but we had to \"give it back in 1h40m.\" We knew we wanted to have drinks and then dinner, so asked if there was something available later. \"No - I have a table for you now, but we're fully booked the rest of the night.\" I pointed out to him that I was told I couldn't book for less than 5 people. \"That's right,\" he said. \"But you have no space for walk-ins *later*?\" I asked. \"No. You can have the table now, but we're fully booked.\"  (So much for the \"1/3 open\" policy). We decided this was better than nothing and took the table. When he sat us he told us we now had to be finished in \"1h30m\". It was 30 minutes before we were served our drinks. Hopes were low. In the end, we weren't rushed away. We stayed for just over 2 hours. The restaurant was slow. MANY MANY tables, both small and large, were open when we left. So either we were flat out lied to by the host, or gobs of people cancelled their reservations. The other downfall is the drinks and tapas menus. They keep shrinking and/or the best items disappear or change description greatly. The introduction last year of the taco sharing platter is a great one, but other than that, Las Iguanas on the whole is going downhill. I still enjoy the food. And the waiters and waitresses, while slower than molasses in January, tend to be competent and kind. But the feel of the place isn't the laid back Latin of 3 years ago. It's changed for the worse.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "u2NjjrFtg4ZMsoDXtDBqjA"
  },
  "rtj3IxPBW6hUYanWAvS4Fw": {
    "date": "1/18/2014",
    "text": "A spontaneous night on the Southbank landed us in Las Iguanas. I was sceptical because I think it would be a chain with mediocre-y food but I was proven to be wrong. We had to wait a loooooong time, much longer than advised, but I was impressed that the management recognised this by giving us happy hour all night. And true to form, it was happy all night, as the food was actually really good. The tacos were fantastic and so were the enchiladas. We left merry and drunk for a very reasonable price. Four stars.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hD15GhDY6GN7GUEUzJKtIg"
  },
  "NHPB7GlE491vJnh5lOmTUg": {
    "date": "10/30/2011",
    "text": "I really really like this place - two for one cocktails every day 12-7pm will always win fondness in my mind (only on a small selection mind you)The small dishes selection is a great deal (5 for £22.50) - we had 10 dishes between 5 which was by far enough.  The food is fresh and always tasty with a great mexican - style feel.  One  of our dishes came out late and without asking it was taken off our bill, very impressed.  In general the service has always been good here (although the main desk aren't always the most smiley....) however it should be given they automatically add 12.5% service onto food bills - I'm not a fan of this, I always tip but like to decide my own amount please!!One downside, it feels a bit chain-y and is always rammed (probably because it is a chain! and is in one of the most touristy places in London)Top Tips;1 - Long island iced tea (most alcholic cocktail on most menus!)2 - The small dishes selection3 - Shredded beef on your nachos",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "STg2BMQwU8wWh9D_gEf-mA"
  },
  "_XxGpGBe1L9-qX2DPxjdAQ": {
    "date": "1/21/2012",
    "text": "Good tasty reasonably priced, filling food and unexpectably good cocktails what more do you need for a good night out? Apart that is for having to wait for an hour for a table. Although we did go on a Friday so should have expected this. The staff are very friendly and approachable and if you look out you'll find some good discount deals for this chain that will make your visit even sweeter.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "Gm_ng2_Ez7TdGyCyIwO7qg": {
    "date": "5/10/2014",
    "text": "This was one of my favorite meals while traveling in London. The food was delicious and fresh, and the service was great. I had the mushroom fajitas and a dark and stormy to drink.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQxrsdJ0vX38RW7zx7UTgw"
  },
  "RAdRTdYXWZj3bqIO7dytrQ": {
    "date": "12/4/2011",
    "text": "3.5 stars for decent mexican food that's palatable.it's not too expensive here if you have lunch. About £7 for a main, and 1.50 or 2.50 for any add-on lunch size appetizers. Their appetizers are definitely really tasty. We got the soup and the nachos and none of us could stop eating. For entree, I had a taste of the chimichanga and the fish fritas. The chimichanga was okay..the chicken was a bit dry. The Fish fritas are these fried mozzarella looking sticks and it was overcooked and not very good. Service was a bit slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "yLivWTCxAtFO3-1tv8RKNA": {
    "date": "2/16/2011",
    "text": "This place is simply mediocre to the extreme.  Yes, I have been there a few times, but that's because I work round the corner and you can always get a table, even for a group.Please, if you're looking to eat, try somewhere else - there are so many better options, even amongst the unimaginative selection of chains on offer around the Festival Hall.  There are some genuinely nice indepedent places within ten-minutes walk if you're happy to head a bit away from the river.Yes, they do 2 for 1 cocktails, but they definitely taste like 2-for-1s: watery, weak and made with cheap ingrediants.  Even their 'signature' caipirinha is poor.The food menu is confused and dull.  They can't quite decide whether they're going for comfort food stodge (burrito - not as good as other comfort-food-stodge places that are way cheaper, like Chipotle) or interesting world cuisine (but all these taste identical anyway).They're evidently very proud of their (pricey) fajitas, but I could make better myself: dry, bad-quality meat mixed with soggy over-seasoned onions and peppers.  Plus, they give you the usual range of things to put in - salsa, guacamole, sour cream etc. - but all in bizarrely miniscule quantities.  And the tortillas were cold by the time they got to us, and evidently weren't freshly made in the first place.The service was friendly enough, but not the speediest or most competent.  It took about fifteen minutes to pay our bill.The place is nicely set out, and really makes the most of its sub-railway placement.  The vibe and music are nice.  But that's really not enough to sell a restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "imxW4Dun1OhOWDnP-vN-og"
  },
  "eLTiri_rcHF37D0QA6wIig": {
    "date": "6/30/2015",
    "text": "Got dragged here last night by our cousins for 'dinner and drinks'. I think the two for one cocktails may have been the main attraction. The experience itself wasn't too bad, our waitress was really super nice and they gave free cake and sung happy birthday to birthday cuz. The hostess who greeted us wasn't great. First she told us there were no tables available for 45 minutes. When she 'found' us a table, which she led us through a half empty dining room to get to, she 'double checked' that we were eating, and said we'd have to vacate the table in two hours. Not great service. The food and drink are awful. The menu is a kind of mash up of Cuban, Brazilian and Mexican-inspired food, but there's always something a bit weird about each dish. Like fish tacos with sweet chilli sauce rather than lime and coriander. The cocktails were weak and tasted of washing up liquid, making the two for one deal slightly less enticing. The food was really expensive for the quality. £15 for chicken fajitas and you have to pay extra for cheese. I just had a salad as the least offensive thing on the menu. It was £10 and was mainly just leaves. I wouldn't go here again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AQCCtgg_IXVjgKR5PlMdQ"
  },
  "Vm_VELhG6xtZBFI_HaY8VQ": {
    "date": "10/26/2018",
    "text": "Love the happy hour here!! Service was prompt and friendly and the food was also good standards.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzuFwnOK1UoTRnN3aNkiTw"
  },
  "iorqM-4nWNbUYoNOgcvBRg": {
    "date": "8/19/2018",
    "text": "Might be good for happy hour cocktails, but definitely not good for dinner after happy hour.Service is slow. It took a very long time for server to come about with a menu. Took even longer for her to return to actually take the order and... they had to come back 3 times.. because they were out of 2 entrees and 1 beer. It was unreal. Felt like I was picking from the leftovers.  Should have been a sign to get up and go...and the food took very long to get out. think 45 minutes, to the point, we had to tell the server, that other tables were here later and they were served already.  When the food arrived, omg.. I swear Taco Bell or frozen tacos would have tasted better. We barely nibbled on our and had enough...   When we finally got our check.. we were charged 10% or 12% of service charge.  I think I should have asked to see a manager and bring this to his/her attention, but I am simply too exhausted. Bottom line,,, maybe this is a good place for happy hour cocktail.. but defintely, don't stay for dinner.  The bartending crew may be ok.. but the kitchen needs some improvement.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "W1CXbA0PnkCARhy-q3M7wQ",
        "caption": "Photo of Las Iguanas - London, United Kingdom. This Cuba Libre by the Thames , my sunsetter..",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W1CXbA0PnkCARhy-q3M7wQ/o.jpg"
      }
    ],
    "user_id": "JysF40STBTmx7h-sU1FHgg"
  },
  "3xwiMYYbQtA9Pf5tF3alKQ": {
    "date": "5/26/2018",
    "text": "Good food, Great Drinks, Great service.2 for 1 martinis at lunch time doesn't hurt.  . I had the chicken enchiladas and it was quite good.  The Porn Star martinis live up to their name.   LOTS of eye candy while you eat as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1p-_hkY18QoLjG1muUPxUg"
  },
  "WRKVLamCabhfixL6O6Bdig": {
    "date": "1/16/2017",
    "text": "Surprisingly decent food for a chain! I got the surprisingly tasty quinoa ensalada. Black beans, sweet potato and charred corn with salsa served atop avo with a cranberry chili  salsa. Topped with sweet potato crisps. The menu caters very well for veg and vegans and the happy hour offer is good as well (although I wish it extended to wine!)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M0gIOJQ5dshF-TulP3tz7Q",
        "caption": "Photo of Las Iguanas - London, United Kingdom. The very good quinoa ensalada.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/M0gIOJQ5dshF-TulP3tz7Q/o.jpg"
      }
    ],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "VAiGiD68pdM4X1Do-RBSGQ": {
    "date": "12/12/2017",
    "text": "Not quite the worst Mexican food I've had in London, but no where near authentic with lacklustre flavours.Service was not great. Took nearly 10 minutes after getting seated for a waiter to come by. Food came out before drinks, and when I pointed out my order was incorrect they argued about me sending it back versus wanting me to just deal with it. When our drinks did come out, they informed me that they did not have the beer I ordered and tried to give me a substitute that I declined. Our server never came back over to just on us and they tried to charge me for the beer I did not receive anyway. Would not go back or recommend. If you're in the area, go to Wahaca instead. Much better food and overall vibe.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOgO1LnS-xPi-69jTsDGAQ"
  },
  "pQ2-I6frFMmnH4GLV9fLVQ": {
    "date": "10/25/2017",
    "text": "Good food, awful service. Never before have I been motivated to write a negative review, but tonight's experience was dire.  We waited an age for our drinks and food to appear, because the server took our order on paper rather than via their tablet system.  I don't know if the server forgot to transfer the order, or if it got lost in the kitchen, but either way, we waited 45 mins for food, and a good 20 mins for drinks.  One of our group was brought the wrong beer, and after sending it back, the same beer returned with a passive aggressive server (not the person who took the order) informing him that it was the beer he had ordered. Another ten mins passed until the correct beer showed up. At this point, we had waited so long to eat that my 1 year old daughter was supremely grouchy. Rather than irritate the other customers with a screaming infant, I asked for my food to be boxed, so I could leave early.  Simply boxing my food took 10 mins, all the while my daughter screamed, and annoyed the other customers. The food was good, but ugh, service sucked.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upF_K5awFmOZFNneafHNVQ"
  },
  "hsJzgBltlOYJnU4F-2KFVQ": {
    "date": "4/9/2016",
    "text": "Service is good. The servers are really on top of their stuff, unless they're new. The food is just terrible. The burritos, even though the menu indicates they have refried beans, do not have any. The menu also indicated it was spicy... It wasn't. And I was explained that \"the mix is done in the morning and it may not hold the spices if served for dinner\" (?)Rice in a burrito... Is expected. Not at Las Iguanas. I could not see more than two or three rice grains in the burrito ... The quesadilla ... Also advertised (in the menu) as spicy. Negative. There was barely any cheese too... Hence the \"quesadilla\" name to it. Fajitas were apparently ok, according to my partner. Beer selection was poor in variety, but the few they have were ok. Especially the ales. I would not go for a Corona, though. Would I recommend this place?... Possibly for drinks during happy hour only. Otherwise, no.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bWxbhZ8vZu7KegTqJtGLmw",
        "caption": "Photo of Las Iguanas - London, United Kingdom. Dulce de leche .... Deffo!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bWxbhZ8vZu7KegTqJtGLmw/o.jpg"
      }
    ],
    "user_id": "4oibCWDvzl6YXCZVE9KK6w"
  },
  "MpNeoliGcFxwphtKM7MGAA": {
    "date": "8/7/2017",
    "text": "Ok, I see people here enjoying drinks, so it's probably an ok bar. For the food, however, quite disappointing.  Sad wilted salad, everything oversalted, the mac & cheese was so bad my 8 year old wouldn't eat it. (How do you ruin mac & cheese?  That takes some doing.)  Perhaps the food is just for folks too drunk to care. If you're sober, give it a pass.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxcJtQUcXc0M5NGRO0f5zQ"
  },
  "M_0AouIe7scr7KMuBCiYoQ": {
    "date": "11/11/2015",
    "text": "So...... I was going about my business when my friend notified me that Las Iguanas had some kind of Tuesday Fajita deal going on. She had me at Tuesday!We booked a table to be safe as I know that after work hours London commuters turn into hungry beasts! Long story short we ordered the chicken and prawn fajita .... BANG BANG INTO THE ROOOOOOOM! Flavourville!! Both were so yummy! I was a little surprised I won't lie .. Didn't expect the flavours to hit me so hard on a Tuesday like that!I didn't get to try their cocktail menu as I have a terrible cold :( but I did opt for red wine .. The Merlot was surprisingly nice! A lot of surprises that night haha ... Your get four fajita rolls and four other ingredients to help take the meal to even higher heights! Guac,jalapeños ,sour cream and some salsa which I hated! Sad times ... Over all a great evening and it was 2 for one so yay even better!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NF4fV3neMSac2BWBEoTfRA",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NF4fV3neMSac2BWBEoTfRA/o.jpg"
      },
      {
        "img_id": "V7QqkLM6hEB3HXLzDdzmnQ",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V7QqkLM6hEB3HXLzDdzmnQ/o.jpg"
      },
      {
        "img_id": "sdDewzHNQKlJgd_M6qAImQ",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sdDewzHNQKlJgd_M6qAImQ/o.jpg"
      }
    ],
    "user_id": "Ft8cn80hAJcOl_hRiVpP1Q"
  },
  "1JXDx4Mr5LuQbwPGJlTQ4Q": {
    "date": "11/15/2015",
    "text": "So I've been meaning to come to this place for like forever and when I saw they had a deal going on and I was damn let me get some of that! I'd already made plans with a friend, so I won her her over with the promise of a Mexican feast and lots of guac! When we arrived the place, I was shocked by how big the place actually was! It massive once you go downstairs, and we got given a really nice table in the corner, plenty of space for a good convo and not to get squashed.The food was ridiculous! So good! We both got fajitas.. I was craving seafood, so I went for the prawns and she chose the chicken. Both were cooked to perfection. They were served with salsa, guac, jalapeñoes  and sour cream. The salsa wasn't my favourite, but the rest were delicious. Drinks wise, I was feeling a cocktail, but my friend was sick so lead the way and ordered red wine, so I was tempted to join. I got a juicy Malbec, which was light and easy to drink. She opted for the Rioja, which was a bit more spicy.All in all, so impressed by this place. I can't wait to come back and check out more of the menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0c5qZVWUDtNQLef_7LURQQ",
        "caption": "Photo of Las Iguanas - London, United Kingdom. Red",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0c5qZVWUDtNQLef_7LURQQ/o.jpg"
      },
      {
        "img_id": "DGUuPwmOQEd8VvMeC6lzFA",
        "caption": "Photo of Las Iguanas - London, United Kingdom. Diptastic",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DGUuPwmOQEd8VvMeC6lzFA/o.jpg"
      },
      {
        "img_id": "xqe3FaCtafhhtKguPokP5w",
        "caption": "Photo of Las Iguanas - London, United Kingdom. Chicken fajitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xqe3FaCtafhhtKguPokP5w/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "Fsiu8Do0peMi4L6McSMTPg": {
    "date": "7/30/2015",
    "text": "Las iguanas is one of those chains that I visit, like and then don't go again for ages, simply because there's so many other places to go to. However I was quite happy to get the chance to go again, as I mentioned it to my colleagues and they agreed (they know by now that my obsession with yelp is here to stay).Anyway, we went in, got seated and ordered our drinks. I do have to mention that one of my colleagues got a dirty (kinda mouldy) cup that we returned. The staff apologised about it and mentioned that it happens some times. It has not happened to me before but ok... Nevertheless, we ordered our food and it came shortly after. I had the chicken burrito from the lunch menu and the mushroom starter. The mushrooms were great but the chicken in the burrito was a bit dry. I did feel quite full afterwards and only paid about £9 for the food so it is quite good value for money, even if the quality has room for improvement. My colleagues who had the half chicken said its not as good as Nando's and the really spicy one was not as spicy as they thought but still good value for money in terms of portion sizes.Since I personally have had a good experience with the venue in the past I would like to think that the few mishaps of this visit were an exception and I would go back again, but in general I think wagamama is a better alternative.If you are in the area I would recommend their cocktail happy hour but there are some better places to go for food.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Xe3YEjwzWJCnjAgz8DLgww",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xe3YEjwzWJCnjAgz8DLgww/o.jpg"
      },
      {
        "img_id": "uXCICl45BAgH0EDKZVUYuw",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uXCICl45BAgH0EDKZVUYuw/o.jpg"
      },
      {
        "img_id": "RKRaolIQ1D8Y1YXQWmRG2g",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RKRaolIQ1D8Y1YXQWmRG2g/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "XGpiszuQYWGjU91pARRlGg": {
    "date": "7/12/2016",
    "text": "A cousin was visiting London and we decided to hit the Udderbelly festival and then dine at Las Iguanas. I booked us a table for 8:30 and we had to wait a good 10-15 minutes before we got a table. While waiting, we had to actually go ask 2 times and even though the table was ready we weren't called.Decent cocktails...they have quite a few options. Liked the ones with cahaca (of course!) and though El Presidente looked like it would be good one, it was strictly ok. Food was great. We had tapas for starters..loved the prawns and the calamari. Their ciabatta with the gambas reminded me of pao from back home.The mains were good as well. The Xinxim was a huge portion, while the sea bass and chicken were more one-person portions. Lovely aromas and delicious comforting food.We got nice window-side seats at the corner. Nice place. Service at the table was good.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LScF4h8D88MAxT3nMsSVEQ"
  },
  "9XnYtBk_uwCoxJTBfZzW9w": {
    "date": "6/26/2015",
    "text": "I've been to Las Iguanas before and although the food isn't amazing you can't go wrong with a burrito or fajitas! Also their cocktail menu is good although all are very sweet!Recently went for dinner with 3 friends and was quite impressed with the menu. There had been a lot of change and lots of tasty looking things. My friends both had chilli; one beef and one pumpkin. Both enjoyed however I don't think it is anything to shout about. I had a roasted butternut squash, cheese and spinach enchiladas which was really nice. Came with refried beans (wahacas are better) and quite bland rice. We also shared cassava fries. Ok but would go for sweet potato fries or plantain next time! Overall a nice evening - we sat outside on a Friday evening so nice ambience. The service was quite slow however we were in no rush so it was fine.Would return with a group of friends if craving Mexican however there are other restaurants in London I would pick over this!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GbRPmSkJbgq---ohxRBJJQ",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GbRPmSkJbgq---ohxRBJJQ/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "P2jfqH7bG7qrC5SkcPY3Eg": {
    "date": "4/16/2017",
    "text": "Food was great ! I ordered the chicken fajitas which were actually very delicious. Bae had a chicken burrito she also liked her meal. The only weird/interesting part of our meal was the guacamole we had to assemble ourselves Not usual nyc style that we've seen but it was alright. Not a big fan of it to be honest. Wouldn't order the guac again. But everything else was good! Drinks were decent we went during happy hour so good price",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gaqXR14Uk2wIIHlyZ_fHFA"
  },
  "kmEL3VvoXjuJIPy6uQjl-A": {
    "date": "2/2/2015",
    "text": "I've only been here for drinks. I've tried to come here for dinner on a Friday night once and it was a 2 hour wait! (Thanks, but no thanks.)The inside has a Latin theme, but the decor reminds me of a big chain restaurant so to be honest it didn't appeal to me. There is also a large seating area outside that I'm sure would be lovely in the summertime.Anyway their USP for me is happy hour. 2 for 1. Honestly I can't complain about 2 for 1, so I would definitely return!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChpJXNhUFl4AK0huG2xb4A"
  },
  "DBga68NDqyfZJB0IpPjP_w": {
    "date": "8/3/2015",
    "text": "This is a great spot for a Birthday treat, even better if you signed up for their mailing list!I was taken here the other week and treated by my girlfriend for my Birthday. We were looking for a place close to Southbank that would eb a bit exotic. Las Iguanas fit that criteria perfectly. I am a fan of Mexican food, but never had the opportunity to sample Brazillian food so I was excited for this. There didn't seem to be any reservations but we left my phone number and they called within 15 minutes saying a table was held for us. We are led into the ever expanding interior that is so much larger than outside appearances.We start the evening with a cocktail jug (purple zombie or something similar sounding). We share Pato Taquito and Chicken Wings as starters which are small but increibly powerful in taste. This was followed by Camarao a la Criolla (Prawns in) for my girlfriend and I chose the Cordero (boneless lamb in sweet orange and tamarind glaze).This meal was incredible.Portion size was reasonable but not what would be considered enormous. But what they lacked in size was instead replaced by overall tastes and aromas. The conbinations of flavours on the lamb was amazing. I do not usually choose lamb, but they were cooked perfectly, soft, and very juicy. To top off the night, I remembered that I have been to Las Iguanas for lunch last year and joined their email newsletter. I had received an email for my Birthday wishing me a Happy Birthday and a free main meal! So with that significnat discount to the total meal we leave feeling like we have incredible value for money and a very pleasant experience. In terms of atmosphere, the restaurant on the Southbank is obviously very busy and this created a great lively mood for a Thursday evening.To conclude, we were treated to great cocktails, great starts, even better Brazilian main courses and a free main course for my Birthday!I enjoyed the meal so much, I have started my fitness campaign to join the GB Olympic squad so I get a free trip to Rio in 2016!!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "OEXrsx1-tCXu6vr-WhlL_w"
  },
  "tGByT9muaYtlW1yJDLNiMw": {
    "date": "2/11/2017",
    "text": "We tried the south bank London on a Wednesday for some food now Being a lover of picky teas we always opt for the taps selection and it never fails to disappoint however the reason behind the 3 stars is simple the venue is too small to host happy hours on cocktails and serve food. After you India jones your way through the very large crowed bar to try and attempt to make your way to the table you are then left with either a rock hard chair to sit on or a well padded seat, We tend to pick 5 tapas and and extraSide so 6 dishes at the most by time these are places on your table with the twoSide plates the candle the menus the salt and pepper and your glass of whatever, you literally find those Tetris skills coming into good use. This is also avoiding people's bums bumping your table as they pass you. We also had to wait 45 mins to be served our food and 30 mins to be served our pudding which we didn't take any chances and asked for the bill straight Away before the service team disappeared forAnother 40mins. On top of all this you also have the noise from trains from the above line/ station running over head in competition with the music they try to lay to drowned it out. In a nutshell if you don't mind a dead bum a constant rhythm of boom boom boom and a very popular buy one get one free cocktail then this is your place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aV3ikWP9TddtYXok2Sdl3Q"
  },
  "8lvDnkh6bTq5NR5sb0zKDQ": {
    "date": "11/23/2014",
    "text": "I visited Las Iguanas with two friends to celebrate my birthday and had a disappointing experience. The kitchen had lost its gas supply so a limited menu was on offer - however I won't hold this against the restaurant as they did warn us beforehand and were still able to offer a good range of dishes.Unfortunately when we received our food (I had the vegetarian burrito), it was both dry and bland - a far cry from the wholesome, tasty comfort food we were looking for at Las Iguanas. In addition the service was poor - our drinks did not arrive for a long time, and when we asked the serving staff for our cocktails, we were told our order had been lost..Overall not a great experience, and I'll probably choose an alternative chain next time I'm looking for Mexican / Brazilian comfort food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oXb4868B35Jl-E55vv4P_w",
        "caption": "Photo of Las Iguanas - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oXb4868B35Jl-E55vv4P_w/o.jpg"
      }
    ],
    "user_id": "bRhsEMuHR8OPUudJZkFQsA"
  },
  "y1_1d7Fqiv8FFEpbm8yp7Q": {
    "date": "8/15/2015",
    "text": "I travel to London frequently to visit family, and Las Iguanas on Royal Festival Hall is a must-go every time I visit. Right next to the London Eye and with a fantastic view of Big Ben and Parliament, the location itself is a must for anyone who's visiting the UK.As a small chain, each location of Las Iguanas has this fun, beachy, 60's inspired ambiance that makes eating there an experience. While the decor at the Spitalfield Market is my favorite, this location is cute as well. The restaurant boasts an extensive and delicious selection of margaritas (the coconut one is my personal favorite) as well as a menu that appeals to both meat-eaters and vegetarians. I eat meat; however, I always opt for the butternut squash enchiladas. Each dish is quite filling on its own; however, I would recommend splitting some appetizers with your dining guests (you can either select three starters for 15 pounds or five for 24 pounds). I must say that the menu has changed since I started eating at Las Iguanas. Their \"Cha Cha Chorizo\" was a fantastic starter, and has since been eliminated from the menu.Overall, an affordable, aesthetically-pleasing Mexican restaurant that will  leave you satiated and satisfied.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-PfOPGuBjiZACNfXOwUKg"
  },
  "WyIt4xQBix-rdkRBgL4umQ": {
    "date": "8/12/2015",
    "text": "My flatmate loves South American food and invited us to join her for a dinner at Las Iguanas. To me that sounded like an avocado and cilantro feast so I was defenitely up for it.I passed the time with a classic Margarita until our party was complete and then craved the Cranberry & Avocado Salad. Sprinkled with candied almonds, the salad was a bit too heavy and sweet. Although there wasn't much on the plate, I didn't feel the need to finish it up.My friends were happy with their Mexican comfort food and although I prefer smaller, more unique restaurants, I might come again some day.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPutIn3JgUQyVBLOeilXEA"
  }
}