{
  "AcZIGJLy7yireMHVF3krXQ": {
    "date": "5/24/2016",
    "text": "I've been stalking 26 Grains on Instagram forever, long before I'd even cemented my plans to move to London. So on my first day out, it was top on my list of spots to try out on the London breakfast scene. After getting ever so slightly lost (I'm new) I found it in a wonderfully remote triangle courtyard-style area in the middle of Neal's Yard in the Seven Dials area. It's tiny with just one large table outside and a few small ones inside. Note that the seats are quite small timber square stools - not the most comfortable seats but not awful. The menu, written on chalkboards both inside and outside, display a range of seasonally changing porridges plus a few cold dishes (this may change in other seasons I'm guessing) like Bircher and a smoothie bowl plus some delicious sounding savoury options. A good range of hot and cold drinks available too, including some trendier sounding options like turmeric hot chocolate and the now common matcha latte.I ordered the Rhubarb & Cardamom porridge with buckwheat and oats on almond milk with stewed rhubarb, tahini Greek yoghurt, cardamom granola, coconut flakes and amaranth (6) plus an Americano and milk on the side (2.5). Ordering and payment is done at the counter simultaneously. Considering their porridge is made fresh (you can see them stirring over the stovetop) it didn't take long to arrive and the coffee came quickly too. Coffee (Workshop Coffee roast) was excellent and exceed my snobby Australian expectations. The porridge was creamy but not heavy and relatively unsweetened with the rhubarb and yoghurt adding tartness balanced by the sweeter granola and coconut.  It was basically a porridge version of my ideal Bircher muesli with contrasting flavours and textures - granola on porridge is genius. It was a delicious and substantial breakfast and I will be back to try more of the menu! Very cute spot and with Neal's Yard Wi-Fi available, it was the perfect spot to chill out and enjoy the morning although the minimal amount of seating meant that I felt I shouldn't linger too long.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "IytwaGxqxmB_wdibTXvS9g",
        "caption": "Photo of 26 Grains - London, United Kingdom. Bircher muesli (oats, chia, almond milk, apple) with coconut flakes, cardamom granola, Coyo.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IytwaGxqxmB_wdibTXvS9g/o.jpg"
      }
    ],
    "user_id": "hRnWguf_vfC3doijLJdBcA"
  },
  "yRTgDyOIyfHGs7oomXZ6iQ": {
    "date": "1/16/2017",
    "text": "I really love this place, it's very sweet and the girls are lovely. Porridge is my favourite and they do such a great variety. I've been many times and I just love it!My only 2 little complaints are the lack of seating or the lack of a queueing system. Especially on a Saturday morning at peak time they should take your name when a table becomes available. And also, the lattes although they are delicious they are often not hot enough so it's best to ask for your drink extra hot in my opinion!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5MyU2VI8uvXhh-FJyJ1Q0w"
  },
  "262oxlonJVJax2BiPI7tVA": {
    "date": "4/25/2016",
    "text": "After the goop raves I had to check out 26 Grains. Located in the \"off the beaten path\" Neals Yard, this place is a real gem. I went on a weekday so we luckily walk right in to find a spot which was lucky because I would venture to say the indoor seating space could at most accommodate 15 people. This places effortless hits the nail on the head for balancing fresh and healthy with artisan goodness. All of our dishes were wholesome and hearty while being beautifully presented as their own little works of art. I personally had the matcha latte and waffles. I added the tahini Greek yogurt and almond butter to the waffles. The matcha was not overly sweet. And the waffles were spot on. For a further breakdown see below: Location-5Seating- 3, my only issue was that I found the seats small, hard and a tad bit uncomfortable (perhaps they don't want to encourage people hanging along too long due to the shortage of space)Staff- 5, friendly but not overbearing. Also good at recommending things if necessaryFood- 5, simple goodness that doesn't try tooverachieveOverall it's getting a 5 stars from me.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_tRwx2KCTtK8kKya1zZx1A",
        "caption": "Photo of 26 Grains - London, United Kingdom. Matcha green tea and coffee",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_tRwx2KCTtK8kKya1zZx1A/o.jpg"
      },
      {
        "img_id": "PpALc2-3UyCCi5Z5J5w1PQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Toasted banana bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PpALc2-3UyCCi5Z5J5w1PQ/o.jpg"
      },
      {
        "img_id": "KKks_4TICIC04w7N-172Uw",
        "caption": "Photo of 26 Grains - London, United Kingdom. A rhubarb porridge bowl",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KKks_4TICIC04w7N-172Uw/o.jpg"
      }
    ],
    "user_id": "deKKI7o2gMlQKzL3UX5LeQ"
  },
  "lOoDLZMFgnztN0eLU4-vzA": {
    "date": "10/5/2017",
    "text": "This is an incredible little place.  Lovely setting, wholesome healthful food, friendly staff.  From now on, my default when in London..",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R1TZJXYkI2HFBnsjTZOXOQ"
  },
  "z3uSfua2P_UeIuR_U6t1-Q": {
    "date": "1/4/2017",
    "text": "Made it back here for another breakfast & the latte, service and food were once again excellent. The friendly vibe and happy atmosphere being cultivated here with the staff & customers is great. As soon as you walk in you feel good. Please, 26 grains, don't ever change.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6CR8pPiqL1NBPb1VUEYTg"
  },
  "C--fiQ7RsoYk8VOr7MgT0Q": {
    "date": "3/13/2017",
    "text": "Delicious, innovative and healthy. A bit tight on space, but you can watch everything prepared as in  your own kitchen.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d6dJYZOqE-eF-v5sMF9O8w"
  },
  "mJKiJlVS4d_vKn2dx3Sm6w": {
    "date": "6/22/2016",
    "text": "I spent three weeks in London studying and I came here for breakfast almost every day. it's an incredible little gem tucked away in the yard. The food and ambiance are both very California - organic, healthy, well-plated dishes many of which are vegan. Have tried just about everything on the menu. I highly recommend the Bircher museli, matcha and chai latte, and Indonesian chicken.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjIAT2mBO5_stti22yRnkg"
  },
  "laXzf0mA8o4saBqg8FdvZg": {
    "date": "7/8/2017",
    "text": "Friendly, fast and delicious food.  I had a fantastic Americano. The seating is limited so be prepared so snuggle up.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BN0tjYXkT7qF38CLgRMBKA"
  },
  "xkF3EEs1Zyf7GfHyFo2Mag": {
    "date": "3/6/2017",
    "text": "So yeah, very good porridge indeed. Matcha latte, on the other hand, could have been much better. The matcha flavor was weak, and the oat milk latte part lacked a certain consistency of foam. (I later went and had a perfect matcha latte with oat milk at a nearby cafe by way of comparison. But If you're going to offer matcha, you do need to get it right.) The only other thing is it was kind of loud. The music was good, but a bit high, and some food prep machines were quite loud, if only temporarily. Notwithstanding, I definitely recommend and will return here to try other things on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fnEnJQRt9XfMpkvS2Owzg"
  },
  "wF35VQcLZdnTslIZnLqu3A": {
    "date": "3/21/2016",
    "text": "Great spot if you're around Covent Garden for healthy breakfast or lunch + juices and coffees to enjoy a sunny day outside inside this cute yard.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BUX4FxTitg2iRFXOqrTHwA"
  },
  "FiWGQVD95L4DIx8c6sCWLA": {
    "date": "12/19/2015",
    "text": "Tiny little porridge spot in Neal's Yard but seriously delicious!! They've mastered the art of porridge (which you wouldn't think there is such a thing, but this place made me believe it). I had the hazelnut & butter porridge and if I could have that every morning, I think I'd be ecstatic! They also made a kickass chai tea, so overall loved this place",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Xr8zIXFqC6pnry-Ynln3w"
  },
  "2oi_yWRq2OFyw8FzKPPVfg": {
    "date": "7/5/2016",
    "text": "Went to this place for breakfast on recommendation from a friend - I ordered the matcha cacao coconut porridge and thought it was delicious. This is the place to go for original and healthy porridge! Price is very reasonable as well. Not fancy, but a cute place for breakfast. Place is small so I wouldn't bring big groups!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "9FrFcENfnqHAE6Tr3uhuKQ"
  },
  "9-3li7MFvPUbRElr9PdzEg": {
    "date": "2/4/2016",
    "text": "A bowl of porridge from 26 Grains definitely warms the soul on cold rainy days. I ordered the apple, beetroot and cranberry porridge with almond butter, pecans and coconut yoghurt. It was healthy, delicious, and unexpectedly filling. Staff was friendly and the Scandinavian decor is a plus too!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "liPX5jq3Z9Nf-5xl8xQsPw"
  },
  "XoZrBsqaB1wFCPQcEVz34w": {
    "date": "11/25/2017",
    "text": "mainly oat porridges and change with season. Just ...latte with almond milk might really not b an ideal choice. Healthy brunch!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ztasnKg7tqHPSWShjSOUA",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ztasnKg7tqHPSWShjSOUA/o.jpg"
      }
    ],
    "user_id": "CN0OrfT7czaNRBtJ6D2KuQ"
  },
  "exDWCVI80gHM59EAVQyKuw": {
    "date": "1/12/2018",
    "text": "This is a tiny breakfast cafe serving all-day ostmeals and toasts. It's pretty much as organic and vegan as you can get. That said, the oatmeal bowls weren't nearly as flavorful or exciting as they sounded. Maybe it's my American palate, but I had to add a lot of honey to the dish to make it taste right :/Also, this place was lacking in friendliness and I could sense a lot of attitude... I mean, I am putting down $7+ for oatmeals and toasts that I could easily get at Pret or EAT faster and more cheaply. I chose to come here and support this business- at least treat me nicely?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WWxeno6spKvUm1yyGsyVnA",
        "caption": "Photo of 26 Grains - London, United Kingdom. Looks beautiful, tastes just ok",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WWxeno6spKvUm1yyGsyVnA/o.jpg"
      },
      {
        "img_id": "vpxC99IDv5y9Zncz_BzDfg",
        "caption": "Photo of 26 Grains - London, United Kingdom. Looks beautiful, tastes just ok",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vpxC99IDv5y9Zncz_BzDfg/o.jpg"
      }
    ],
    "user_id": "4jqlk3iGoJNdSbBTbYqhIQ"
  },
  "B5XNBO2FLIg69Dv1_s6UYg": {
    "date": "4/4/2018",
    "text": "Excellent creative porridge. Friendly staff. Nice setting. A great way to start the day in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCobl2RdDhd1p7IG8IGifQ"
  },
  "ScemK0V-F04ENj_yaZvIPA": {
    "date": "3/15/2018",
    "text": "Yummy food and good portions. Limited menu but what they do is good and exciting. Fresh ingredients and am interesting mix per dish. Friendly staff :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "avbCtDKSE-ZaMbrp-PcrIQ",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/avbCtDKSE-ZaMbrp-PcrIQ/o.jpg"
      }
    ],
    "user_id": "avBwPFFd5JJqqvxgkTUBGQ"
  },
  "wI_3fXvqDH1Kv5n3qzJHhg": {
    "date": "11/1/2017",
    "text": "This place is amazing! I had the nordic pear porridge and it was tasty as hell.I also had a Chai Latte from Almond milk and it tasted good. The whole place has a nice atmosphere in a small yard",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HIVSfN06RiXi-W01N6-umg"
  },
  "fOP-nSfVlF2h74ZgiNh0Dg": {
    "date": "12/1/2016",
    "text": "I've only marked down one star because it was a little bit of a 'thing' to find the spot. I only found it after searching the reviews for help. The shop is small and cozy, able to seat about 13 people comfortably. The food was delicious and the options, top notch. I love that they have an oatmilk option for coffee drinks! Definitely recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TzEo5roZ44AAith2AX3atA",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TzEo5roZ44AAith2AX3atA/o.jpg"
      },
      {
        "img_id": "_7_LEI_0kCiUiE9yAtbJgQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Located in Neal's yard!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_7_LEI_0kCiUiE9yAtbJgQ/o.jpg"
      },
      {
        "img_id": "2mopQGNyDHg1XWbMDYyCTQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Small spot, but well worth it if you can snag a seat.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2mopQGNyDHg1XWbMDYyCTQ/o.jpg"
      }
    ],
    "user_id": "jvdPKx8FAQxUFCiVFIZHQg"
  },
  "I3D2Pu6SZalRxxjvoXY7lw": {
    "date": "1/4/2017",
    "text": "My best friend who was visiting from the states IS OBSESSED with porridge so we found this place. Best. Porridge. Ever. I mean the place is TINY so going in the wintertime and trying to not site outside is kind of a pain in the a**, but it was the best porridge I've ever had in my life. I wasn't even a fan of porridge, but this place was awesome.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mt3H2I41tBvhJVY3UEPWbA"
  },
  "b-CpA1GDP908dF46a0Jrog": {
    "date": "7/19/2018",
    "text": "Ordered some blueberry porridge and greens. Both tasted great. This place does a good job of making simple food taste good. Awesome environment as well, right in the heart of covent garden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FpgL0c9_UeQN-GtY_vPNNg"
  },
  "q3r15Q5s_j_IDwOqTndv7Q": {
    "date": "5/13/2017",
    "text": "OBSESSED. This place has the BEST. PORRIDGE. IN LIFE. The ingredients are perfection and everything is prepared with such love and care, it's truly nourishment for body AND soul. The only problem is that I wanted to sit there and work my way through the entire menu, but I had to decide on what would actually fit in my belly. The Nordic pear porridge did not disappoint, and the sprinkling of gorgeous amaranth garnish was delightful. I also had the turmeric hot chocolate, which I wanted to last forever.I am SO coming back when I'm in London again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9zc2GykPmncBLKdPttdcVA"
  },
  "09haurtIcPrktq3OSJmc_A": {
    "date": "6/15/2016",
    "text": "26 Grains is one of my absolute favourite places in London. Located in the coziest little square, Neal's Yard, this small intimate place serves up bowls of some seriously good porridge. No, not only good. Fantastic. Amazing. Outstanding porridge.I had the 'Blueberry Almond' porridge which was heavenly. Oats cooked with almond milk, and then topped with a sweet blueberry compote, seeds, toasted coconut, strawberries, almond butter and amaranth. I am still dreaming about it. The coffee, with beans provide from Workshop Coffee, was just as good.Coming from Copenhagen, and being used to the famous 'Grød' café, I really know when porridge is good and when it isn't. This place surely tops 'best porridge so far' together with Grød in Copenhagen.Go here. Just do it. You won't regret it.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CbbG7amINVcIV6sRSafq3w",
        "caption": "Photo of 26 Grains - London, United Kingdom. Blueberry Almond porridge",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CbbG7amINVcIV6sRSafq3w/o.jpg"
      },
      {
        "img_id": "8mil5v5KweenhtXUW4xBCw",
        "caption": "Photo of 26 Grains - London, United Kingdom. Coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8mil5v5KweenhtXUW4xBCw/o.jpg"
      }
    ],
    "user_id": "wWfcZx6WIJtgvFqsn9JnSA"
  },
  "pfEDrW0ayCt_oUGAyvBg-w": {
    "date": "3/18/2017",
    "text": "Delicious soup here today. It can be tricky to get a seat, and being propped up at the bar can make you feel in the way a bit, however the food is so good. Feels like only great quality ingredients go into the heart warming and satisfying meal. Have to come back for breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "36uUEnzBM52pjB7hDlPSmA"
  },
  "yxLeMxGUYn62txZAFP8gSA": {
    "date": "5/23/2018",
    "text": "Breakfast was so good! The spices are flavors were different and very satisfying. Would definetely come here again. The location was also really nice. Dont hesitate to try this.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhYY6qm3-Q_1a0XheGFmNA"
  },
  "co-RbKDt9WhjeAWMc3H8ww": {
    "date": "5/17/2017",
    "text": "Excellent spot tucked away in a beautiful alley in Central London. Glad I discovered this as a tourist, because it definitely felt like an escape from the hustle of the big city.The food is excellent and the ambiance of the cafe and Neal's Square are fitting for the vibe it puts off. No wifi, which is a bit of a disappointment,  but considering the limited number of seats, it's understandable that they're aiming for a social experience or a quick turnaround.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9acXSCFQHFxa1rbfHPjVg"
  },
  "Pxl6l3jNA6oPi8xTnNwFQw": {
    "date": "5/3/2017",
    "text": "I'm not obsessed with porridges but I decided to try 26 Grains after seeing really cool pictures on Instagram. I had the Hazelnut & Butter porridge and guess what? It was simply delicious! The place is really small and cosy, located in one of my favourite areas of London: Neal's Yard. Trust me, you're gonna love it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F8PafUhNitHafBAzhrWQ0A",
        "caption": "Photo of 26 Grains - London, United Kingdom. Hazelnut & Butter porridge.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F8PafUhNitHafBAzhrWQ0A/o.jpg"
      }
    ],
    "user_id": "wAN7j002JS-Y64huxQngzA"
  },
  "_7aXZEGg8YcQQdItr81x6w": {
    "date": "10/15/2017",
    "text": "Very small place, but we didn't have to wait long. The avocado toast with fried egg was amazing. Very friendly staff. We enjoyed it and we are coming back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2nXlpDtNZ5csxafovx_32w"
  },
  "kmyUa_4abMcfNXl_KE5kNQ": {
    "date": "8/15/2017",
    "text": "Ridiculously tasty! Four of us Americans came for a tasty bite, one with a finicky diet, and we all left with full, happy bellies! I'll have to admit, I've never tried porridge, not knowing the difference between porridge and oatmeal, but I'm definitely going to try and make myself a savory porridge when I get home!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZ04HdEGu-LfUStNpbk-fQ"
  },
  "DeUiwsyZdh8g8SVcUW1h_A": {
    "date": "3/16/2018",
    "text": "Such sweet staff. Could tell I was running late in the AM and personally made sure that my order came out quickly. Peaceful haven outside of London hustle and bustle in Neal's yard. Love the Nordic pear porridge",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tyvfT3gv9pAGsE_DHaFcSw"
  },
  "6WIvdANTsAZGs136uiD-nQ": {
    "date": "5/17/2017",
    "text": "This is a great breakfast brunch place; the porridge is really great and the feeling of the place is very cosy, despite being in central London. However they don't issue paper receipts and that's a bit of a pain, there also isn't much seating. Worth a visit!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bSEO7HpwcuQF1jWuiCvZHg"
  },
  "9jTWyMA6irDmcKY-VgDk4g": {
    "date": "1/5/2018",
    "text": "If you like porridge, this is the place to be. 26 Grains is like a warm hug in the middle of Neal's Yard. We tried the Banana Cacao, Nordic Pear, and Hazelnut Butter porridges. All three of them were amazing. The service is very laidback - you order your dish, pay for it, they make your dish individually, serve it to you and you're left alone to enjoy your meal. The staff never hover. The coffee is also really good, especially the Americano.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9iTFDfyinXVvg_L5wghsug"
  },
  "z_nIb7Z1StttsnJGBtgHDA": {
    "date": "5/6/2017",
    "text": "We got the Chicken Snørrebrød, and oh my, I want this place to open a shop in my kitchen.  Everything looks delicious, and the plating is so aesthetic for a cafe.  I took a look through their cookbook, and I want it all.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeB4eBt-oqHTdzMrcVQTxw"
  },
  "WlmCyc_2-DpKqckhw3GdHA": {
    "date": "10/14/2018",
    "text": "Excellent, healthy, delicious porridge. Loved the turmeric latte. Friendly staff and good music. Perfect Sunday morning.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0GZMtP-wDvChAjrxK0YY6g"
  },
  "esNAuMcKw7eELZBgCBpGGQ": {
    "date": "11/1/2018",
    "text": "I'm so sad about 26 Grains. I came to London a year ago and saw all the rave reviews of the place, but never got the opportunity to go. This year, I was so determined to go, and finally made it happen (twice). Maybe I just hyped up the place too much in my head, but I really didn't like this place.Okay, yes, the porridge is BEAUTIFULLY presented, and I love how cute the place is, tucked into a corner of Neal's Yard. I DON'T love how crowded the place is, especially on a Saturday afternoon. The first time I came was a random Wednesday morning and the wait wasn't too bad. Others have mentioned that they take a long time with the porridge; the second time I came, I waited over 30 minutes for them to make my porridge. It just seems that they have a very inefficient system of taking orders and making them. So the first time I came, I got the Nordic pear porridge. Really great texture in the porridge - creamy, smooth, and thick. However, I couldn't get over the spices they used. I think there was tumeric in there? My porridge had a salty taste that really made me dislike the dish. Wanting to give them another chance, I went again that weekend and ordered the apple butter & hazelnut porridge. Again, it was salty, though still maintained a beautiful presentation. I really love porridge and really wanted to love this place, but sadly, this was a miss for me. Maybe my taste buds are just messed up though, or I got a dud out of the batches of porridge, since everyone else seems to like it so much!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kk027ylXs-Sz9s0kVM3VEg"
  },
  "3PasWpANAYgqQn3iddyDqw": {
    "date": "11/27/2017",
    "text": "If you come here, stick with the savory dishes and avoid the sweet! I love myself sweet porridge in the morning, but they make it way too sweet here. Hidden within Neal's Yard, this place offers the perfect farm to table dishes and highlights simple grains, avocadoes, and sprouts. In my most recent trip here, I got the savoury porridge with kale, egg, avocado, sriracha and seriously can't stop thinking about it. Oh Lawd was that good and pair that with their green smoothie - you are winning in life. Biggest downside is that they have somewhat small portions and it took about half an hour to get our food. They do warn you about this ahead of time, but if you are super hungry, this is not your place. The queue goes by really fast, but beware of waiting for your food.",
    "rating": 4.0,
    "rated": {
      "useful": 20,
      "funny": 13,
      "cool": 16
    },
    "photos": [
      {
        "img_id": "Fso3ho0vWueTuDI75A8WgQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Green Smoothie!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fso3ho0vWueTuDI75A8WgQ/o.jpg"
      },
      {
        "img_id": "lS621vX2qeLiyeYBSGuK5g",
        "caption": "Photo of 26 Grains - London, United Kingdom. Sriracha Grain Bowl.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lS621vX2qeLiyeYBSGuK5g/o.jpg"
      }
    ],
    "user_id": "AhntYDYezxv6k_YFPdBRTg"
  },
  "p0EaobkfVbjupL74e3PGUg": {
    "date": "11/14/2017",
    "text": "This is a hidden gem in Neal's Yard tucked away in the heart of Covent Garden. We came twice - once for breakfast and once for lunch. The food on both occasions was phenomenal. Dishes have a homely, farm fresh aesthetic with moderate to smaller portions. Inside, 26 Grains looks like the set for a Food Network show with a beautiful, open kitchen.I tried the open-faced chicken salad sandwich [A] and savory porridge with kale, greens, egg, Sriracha, and avocado [A+]. Both amazing! Wife and I also split the toasted banana bread topped with butter and cocoa nibs [A+]. Wife ordered the hot porridge with apple, hazelnut, cinnamon and loved it [A+].Overall, this was one of our favorite meals while traveling in the UK. Do not miss!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "SUAFCKtkx8RrQ6EgJQIVrw"
  },
  "RfzniYdH4SezM9X-eFo8UQ": {
    "date": "8/7/2018",
    "text": "It is a lovely space and I love the vibe so much but avocado toast I have here is horrible!! It's just a not completed flavor! Too much of things you don't need on avocado like herb seeds that killed the whole thing!! I give star out for the atmosphere but I'm giving none to the dish I had.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a3yOeL5b0lzbo1ORHF2yHg"
  },
  "xfn6UxbIB9cOUMVK4zrPHg": {
    "date": "10/13/2018",
    "text": "Nice little place tucked in an alley way. Went there for breakfast twice. There specialty is porridge and it was done very well on our first visit. When I went the second time it wasn't as good as the first time. The first time it was served in nice bowl very well garnished with toppings. The second time it was served in takeaway containers and not garnished and topped so well. Both times flavor was good but inconsistent in presentation. I would have given 26 Grains 4 stars consistency is key.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "37I2BJHJYNWjS9_TdOxFMg"
  },
  "lmRzhj1KzsTtiVkVJ-CXaQ": {
    "date": "4/27/2018",
    "text": "Porridge perfection. This little and well-known cafe brings the best of Copenhagen tastes to Neil's Yard. Like Grom, Alex Hely-Hutchinson helps the masses recover from childhood porridge traumas to rediscover and enjoy the beauty of the grain. The sweet selection is headed by the ever-popular blueberry, bay and cacao porridge. But, I'd urge you to go for the savoury sriracha spiced porridge instead. It's a subtle patchwork of texture, flavoursome and warming for a cool morning and a dish that will be hard to get out of your mind. If you really really hate porridge, there is a selection of breakfast pastries available at the counter. The banana chocolate danish is not bad either",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Shni55R6JJyLiMuQ8nwSCA"
  },
  "54nNHC7ZlSPv4ZDoDS0d1w": {
    "date": "9/8/2018",
    "text": "Of all the restaurants I had the pleasure of enjoying while in London, I miss this place the most. I came across 26 Grains for the first time after a long, early morning stroll. It had started to rain (it's London, after all) and I was famished. Luckily, I was there when they opened, because a line was already forming and the eager crowds just kept coming. I watched from the counter as the chefs made a steaming bowl of the most delicious porridge I'd ever eaten, accompanied by a pot of perfectly steeped hot tea, all served up by a kind and friendly staff.  The meal was so soothing and exactly what I needed. I came back again the next day, and probably would have returned every day after if I hadn't run out of vacation days. (Luckily, I now have a copy of the 26 Grains cookbook so I can attempt to re-create some of my favorite combinations.)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJ2nNrFdIT0ezBPGcDwq4Q"
  },
  "xbVeoJilQtgGJqMenaSCxw": {
    "date": "9/8/2018",
    "text": "marvellous toasts. we had the avocado one and the blackberry & cream cheese one and i was so surprised of how good that combo was. the only thing i didn't like was the coffee. i had an iced latte with almond milk and the almond milk probably just wasn't made to mix with coffee cause you could still see small pieces of it floating and the taste wasn't good :/ anyway would recommend for anything else :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "erpdb7EyPKcBTWjouchxNA",
        "caption": "Photo of 26 Grains - London, United Kingdom. avocado toast & orange juice, blackberry and cream cheese toast & iced almond latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/erpdb7EyPKcBTWjouchxNA/o.jpg"
      }
    ],
    "user_id": "inJ7pWTILWNO-r9lW6KFTw"
  },
  "BqI6EKLTpvvfAqITxOkkEQ": {
    "date": "12/4/2017",
    "text": "So good! It's a busy and tiny restaurant. But they serve food fast. My porridge is savory his is sweet. A great start for our trip on day 1.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QUEUnRqXMcDtAfdh8J1u8g",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QUEUnRqXMcDtAfdh8J1u8g/o.jpg"
      }
    ],
    "user_id": "C9v0_tQ8iFtgZKONZrGTlQ"
  },
  "_CnvvDSI6kYDCi3pNTmJpg": {
    "date": "10/18/2017",
    "text": "First things first, I'm not a fan of porridge. But this cozy breakfast/lunch restaurant in Neal's Yard with a constant queue caught my foodie eye. So I gave it a try.(1) Starting with the Green Smoothie, this tastes great for something so green!(2) My first trip here was memorable since my view of porridge changed as soon as I tasted the savoury porridge with kale, egg, avocado and sriracha. Now it's my go-to whenever I visit.(3) With a couple of sweet porridge options, I tried the Nordic Pear with coconut milk oats. It was alright at first but when I was halfway into it, I couldn't continue as it was so thick and slightly bland. I guess I'm not a porridge person after all (with the exception of her savoury one).--voodie rating: 7.5/10£12",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MqLTmsgIqnG_fGE2gRMnLQ",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MqLTmsgIqnG_fGE2gRMnLQ/o.jpg"
      },
      {
        "img_id": "kRvyEAleezSEv0gwpxXTBA",
        "caption": "Photo of 26 Grains - London, United Kingdom. Green Smoothie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kRvyEAleezSEv0gwpxXTBA/o.jpg"
      },
      {
        "img_id": "ERQLlfv1Va1cIIaKOBI6EA",
        "caption": "Photo of 26 Grains - London, United Kingdom. Nordic Pear coconut milk oats",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ERQLlfv1Va1cIIaKOBI6EA/o.jpg"
      }
    ],
    "user_id": "Ht4lUtwBASNv24eCN6FMEA"
  },
  "PI_zOTnaXtBmjDt3ijCIJg": {
    "date": "6/19/2018",
    "text": "Amazing food! People told me the food in London sucked but all of my experiences have been AMAZING! 26 Grain made simple food taste gourmet! I am in love with this place and will go there first the next time I visit London! I recommend the avocado toast with two fried eggs on top, and any of the porridge bowls... split it with a friend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O6AN03tz85NO10c1j9BtQA",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O6AN03tz85NO10c1j9BtQA/o.jpg"
      }
    ],
    "user_id": "VpeVobVbqXOjGRC3gtYbJw"
  },
  "uyfx0EaRN8G8vJ8OgrwFaA": {
    "date": "9/25/2017",
    "text": "Delicious porridge with many interesting combination of ingredients.  I had the Nordic Pear Porridge.  The Porridge was perfectly prepared.  The combination of ingredients includes creamy coconut milk and yogurt, a crunchy delicious granola, pears of course and some pumpkin seeds.  Best porridge I've ever had bar none.  Looking forward to trying their other menu items.Did I mention that they prepare excellent coffee?  - comparably to the best coffee I've had in Rome and Portland Oregon.We've been back 4 more times.  We obviously loved the food.  The Porridge served with Fried Egg and Spinach was wonderful.  The Banana Cocoa Porridge and the Hazelnut Butter Porridge was likewise great.I'm now inspired to prepare Porridge at home.  I purchased the 26 Grains book written by the owner (sold at the restaurant).",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q8n4i36LN6OBMRaDSSyUSg",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q8n4i36LN6OBMRaDSSyUSg/o.jpg"
      },
      {
        "img_id": "9U--YcYmBiQkm7cAa14_tQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Banana Cacao Porridge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9U--YcYmBiQkm7cAa14_tQ/o.jpg"
      },
      {
        "img_id": "YcaWIFT-t8mP7mkoIZ4U7w",
        "caption": "Photo of 26 Grains - London, United Kingdom. Nordic Pear Porridge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YcaWIFT-t8mP7mkoIZ4U7w/o.jpg"
      }
    ],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "deH_jEmz24XgF7JZ-WZXqQ": {
    "date": "5/28/2018",
    "text": "This place is hidden in Covent garden, a charming spot fitted for the spectacular food. The atmosphere is lovely- you can sit inside the small shop, or enjoy the breeze outside. I had the almond flakes with melted butter porridge and a matcha latte. Both bring a hyggeligt experience of warm bowls of farm to table dishes and drinks. Will return again when I come to London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I6Ayvw8yiHRfKIS_SCgEaQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. View outside 26 Grains (Covent Garden)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I6Ayvw8yiHRfKIS_SCgEaQ/o.jpg"
      },
      {
        "img_id": "QHUN-59a0WjJAAlvR4gggA",
        "caption": "Photo of 26 Grains - London, United Kingdom. Turmeric latte, matcha latte, almond flakes and melted butter porridge, Nordic pear porridge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QHUN-59a0WjJAAlvR4gggA/o.jpg"
      }
    ],
    "user_id": "U0Ad0Bf4UdJ4c0cD-JfXgg"
  },
  "g1mSLegqyl34CHyrxUiUUw": {
    "date": "8/19/2017",
    "text": "Such a cute and cozy cafe! I love oatmeal and porridge, so I was super excited after seeing this place on Yelp!I got the hazelnut butter porridge! Loved it! Had tons of hazelnuts and the perfect amount of sugar and butter! I wish I put bananas inside instead of apples, but I am pretty sure you are able to add/replace toppings if you ask! Just wished the lady used gloves when making the oats, but not a big deal :)Haven't tried the Museli (cold oats), but I will definitely be back before I head back to California!Update: I went back again before heading back home haha! I got the same exact porridge  (Hazelnut & Butter) because I was craving it since the day before and it was just as delicious as the first time :) Definitely try it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JhM8RhRbIv-KzQPLLESz-g",
        "caption": "Photo of 26 Grains - London, United Kingdom. Hazelnut & Butter Porridge for a second time!! So tasty!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JhM8RhRbIv-KzQPLLESz-g/o.jpg"
      },
      {
        "img_id": "AdU2eFwO498Qj2sWawkSIg",
        "caption": "Photo of 26 Grains - London, United Kingdom. Hazelnut & Butter Porridge",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AdU2eFwO498Qj2sWawkSIg/o.jpg"
      }
    ],
    "user_id": "aT0P1x9rByuL8zap3lofLw"
  },
  "XmPgLG2221RAuOr4VjVxGA": {
    "date": "1/5/2018",
    "text": "From the Covent Garden Underground, it is a nice walk going through the streets to find 26 Grains. The porridge here are delicious, but a tad expensive and might not be filling. Still, any porridge with honey will hit the spot. Most of the bowls are on the sweeter side. The staff are very friendly and offers their views on what you might like based on your taste. If you sit outside, you have a beautiful view of a small and colorful square. The seating area inside the restaurant is tight, but cozy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5PRM9gpc0qARtEkG0VAkw"
  },
  "WRIERP-rbmwH_3RkB3ZVmA": {
    "date": "7/20/2018",
    "text": "Fabulous coffee and light fare in quaint Covent Garden courtyard. Loved the porridge + halloumi sandwich!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzV62jQgNk0B3D6bwsPnKQ"
  },
  "i0v-UKxP5ql3cO-U1Zkcxw": {
    "date": "5/30/2017",
    "text": "Overall: The cutest little brunch spot I found while in London! Delicious porridge, cosy, cute ambience and friendly service. Hoping I can find a place like this in the Bay Area, otherwise I will be back if I visit London again!  Cuisine: Ordered the Apricot Elderflower Bircher Muesli and Hazelnut & Butter Porridge. Both dishes were full of delicious, well-paired flavors! Would recommend the muesli if you're craving more of a cold, refreshing dish and the Hazelnut & Butter Porridge for a sweet, warm dish. If you're interested in savory, others next to us ordered the Egg and Kale which looked awesome! Ambience: Located through a small, beautiful alleyway. On warm days, the store front opens up to connect to an outside seating area in a little square surrounded by colorful buildings. The seating is very tight and at the outside tables you almost rub shoulders and backs with the people behind and to the side of you. Nonetheless it's part of the charm!Service: Friendly staff! Order at the counter then find yourself a table (or wait for one to open up). Despite the tight quarters, someone will bring you your dishes and when you're finished they will clean up your table once you leave.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_xocgXxRibQqCrQCCqaKnQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Apricot Elderflower Bircher Muesli, Hazelnut & Butter Porridge, Earl Grey Tea and a Latte.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_xocgXxRibQqCrQCCqaKnQ/o.jpg"
      }
    ],
    "user_id": "_EVk5rCGW6V-Q_RvAnvE4A"
  },
  "FsN0es5XHxudpzamPAVaGg": {
    "date": "6/14/2018",
    "text": "We went to this place after noticing the high review on yelp. Neal yard setting was very beautiful. We sat right outside of the shop, enjoying latte and porridge. I liked my hazelnut butter porridge. Half way through our meal, we felt bunch of dust fell from above. We looked up but only saw empty balcony. I went inside the store and told the girl behind the counter about it. She quickly responded \"that wasn't our fault\" multiple times and didn't seem to talk no more. Hmm that reaction was a bit unusual. Wonder how many times this happened before. I was just trying to let them know that maybe directly under the window is not a good seating place. Bewildered, I went back to the table, after trying to save the food unsuccessfully, we left.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WSrf1YHFqFv54HnuRc0-dQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. Beautiful window/balcony above the restaurant",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WSrf1YHFqFv54HnuRc0-dQ/o.jpg"
      },
      {
        "img_id": "C3J8n251rpzLcvnNRooUaQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. We did eat there :)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C3J8n251rpzLcvnNRooUaQ/o.jpg"
      },
      {
        "img_id": "gHAb4305YvyW1RO_RKSIKQ",
        "caption": "Photo of 26 Grains - London, United Kingdom. What fell on my hair",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gHAb4305YvyW1RO_RKSIKQ/o.jpg"
      }
    ],
    "user_id": "xreR9IsHCIgUSV4EfEAFkA"
  },
  "PwM_G_SLKQUcQvY1X0-TnA": {
    "date": "8/1/2017",
    "text": "A small lovely Cafe in a wonderful location. Good service, very tasty and healthy food. Loved their breakfast bowls and a turmeric latte - first time that I tasted it.Worth to come and to try something new, unusual and very tasty",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yfZXSynIoyfXT2q5Wbsy0A",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yfZXSynIoyfXT2q5Wbsy0A/o.jpg"
      },
      {
        "img_id": "HGpc4EPjV0e53Rp6MEkV6g",
        "caption": "Photo of 26 Grains - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HGpc4EPjV0e53Rp6MEkV6g/o.jpg"
      }
    ],
    "user_id": "X9-X4xmju6ttDL5ePmrdyw"
  }
}