{
  "r4bZWsfEbPjLpEazaufaHA": {
    "date": "4/5/2014",
    "text": "They are awesome!!! Pasta is fantastic !! And the seafood starter, OMG!so fresh and tasty! What's more, the dishes contains a lot! For a Asian girl it's hard to have all of them! Such a pity cuz they a sooooo delicious !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VsXW006eqLIpdjJmgUDoNA",
        "caption": "Photo of Bizzarro - London, United Kingdom. good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VsXW006eqLIpdjJmgUDoNA/o.jpg"
      },
      {
        "img_id": "38gVTIFxDMefOImIK2nZ7g",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/38gVTIFxDMefOImIK2nZ7g/o.jpg"
      }
    ],
    "user_id": "PA_dWwhUGa8dWOJxNNX26A"
  },
  "i3tsGNdRUgCTTcs2dprsAw": {
    "date": "6/21/2015",
    "text": "For the doubters, there is plenty of Italian spoken between the proprietors managing the floor and back of house.   Bread good, house red hearty , insal mista needs more dressing, less lettuce,  spaghetti bolognaise is good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PBcpO4fsCq5SSQE-EShxfw"
  },
  "suHm9Hbadqquo3dEsZYX-Q": {
    "date": "5/24/2014",
    "text": "One of the best meals I've ever had. I had the hake special and husband had the grilled steak fillet. The house red wine went down easy, and the tiramisu was well-portioned and just delicious. The service was perfect -- attentive, friendly, very Italian! We spent a few hours here, and didn't want to leave! We even joked about yelling at passersby to come in and eat. Definitely try this place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YLq1Spqg7vJsgfzCwUj-Ew",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YLq1Spqg7vJsgfzCwUj-Ew/o.jpg"
      }
    ],
    "user_id": "o3r11Sko8b8F-1NW0HlYsQ"
  },
  "SqMb67sEGOLxcDNEXp3eVQ": {
    "date": "8/4/2015",
    "text": "Mediocre at best. My veal in a cream sauce with mushrooms was tender but not very tasty. My wife's saltimbocca was nothing but a veal in a brown gravy. My gin and tonic had 2 cubes if ice and a lemon in a highball glass. Mostly tonic water and mostly unrecognizable. The guy next to me ordered one too and had the same reaction. The service was ok and ambiance ok as well.  The place was crowded though on a Tuesday night.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W9S3oH4y0zAt6PXOKijQCA"
  },
  "6x8OFMd2mKWhdoGIhnHkHQ": {
    "date": "3/27/2015",
    "text": "Great pasta for a reasonable price. Cute little establishment and the servers were funny. However they did start blasting loud music so you couldn't even hear the person next to you talking. The manager made them turn it off but it was very odd. They also know that their main clientele is tourists so they try to push more food on you.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "73NSHbBxp5evcxAcv-uiPQ"
  },
  "gWwIp8W7aLoRdOLNCH6mIA": {
    "date": "8/12/2013",
    "text": "I happened to find this restaurant as I walked from my hotel to Paddington Station. It was 50% occupied when I checked in, but became full in a next moment. Food is really nice especially fettucine salmon was excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w3qkcVsxdg8R5LR11OLOew",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w3qkcVsxdg8R5LR11OLOew/o.jpg"
      },
      {
        "img_id": "y6gWQKdXeW5RfDCnbX-NrQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y6gWQKdXeW5RfDCnbX-NrQ/o.jpg"
      },
      {
        "img_id": "jrecKQKc893xQdOwnrJcTQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jrecKQKc893xQdOwnrJcTQ/o.jpg"
      }
    ],
    "user_id": "dh9V6LmGaPvkJ7O1GBiOGw"
  },
  "q2zzW9B-RVLOMPtxYFwUpw": {
    "date": "6/13/2015",
    "text": "Bizzarro has some of the most authentic Italian good I have ever tasted, with a reasonable price tag as well. Waiters were really busy because of the amount of people in the restaurant, but were still really helpful. The fact that many local Italians eat at this restaurant says a lot about its food and service. Will definitely try to come again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZaL6LUnhBMHUqFVNcWOkpg"
  },
  "HG-fxbNipXrVNonzUqDDqQ": {
    "date": "11/12/2016",
    "text": "The food here is excellent. I had the seabass and it was cooked perfectly. No complains about the food and even dessert at all. The service is slow overall, there was long wait for the order and the bill. This is a busy place and the waiting staff try hard to keep up",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "knsX-6or-zxH2lV1oze0oA"
  },
  "wIZ2jmkAzxQvyU-taVjxIg": {
    "date": "7/6/2015",
    "text": "Food was great! Staff was friendly, prompt and acomodating!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "64blT46_hM6jp7jCVBFrdw"
  },
  "2tayqbsXzkV-Uuic57jDrA": {
    "date": "10/21/2015",
    "text": "The service is awful. It took 39 minutes to bring a very oily minestrone. After that I'm still waiting for more than 15 min a pasta I ordered 45 min ago when I sat down. The spaghetti gritting di mare came in and plenty of mussels one shrimp and a ton of oil.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kXawKiKMgDx-G03f5tvfJw"
  },
  "T_jTDuzzeLhyuIcAihOIDA": {
    "date": "1/2/2015",
    "text": "I've been to this delicious, authentic Italian eatery several times over the years during visits and generally have had enjoyable meals and experiences. It has the best lasagne in London, which explodes with favor and tastes homemade!  The spaghetti carbonara is equally as delicious.  My favorite soup in London is the Fusilli & Pasta soup. The mixed green salad is delicious, simple and has a delicious vinaigrette house dressing (ask for 3x the amount if you like a reasonable portion).  The bread was not exceptionally fresh, and I do not recommend. If you do order it, beware, as  you will be charged 0.95 cents per person even though you may only consume a portion of the bread. This bread charge is on top of the service charge! The waiters are friendly, but the place is often very busy at dinner time, so call for reservations to ensure a good seat. I suggest that you review your bill thoroughly as we were charged for two bottles of water, which were never served. Again, the place was heaving with people, so service was just okay. On one occasion, the food was overcooked, so we sent it back and the manager was extremely accommodating to replace/remove. All in all, one of the very best casual Italian restaurants in London, particularly for an extremely good value.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dqXnIDr6XMr2aMbA02sSRw"
  },
  "8ruhzw6e9ECImS42Sk-jkQ": {
    "date": "11/30/2012",
    "text": "I got a wrong impression reading so many great Yelp reviews.  I will say the food is quite good, especially  for a touristy feeling place (most notably, the gnocchi surprisingly great.  And gnocchi is really easy to make very bad!).   And it definitely was reasonably priced, esp considering the quality.  But don't go here on a date - the ambience is a bit like a school cafeteria.   i wanted a nice evening with my good friend, relaxing over wine and a great italian dinner, after an all day work meeting, the evening before I had to fly home.  This expectation was not met. I was also surprised somebody commented favorably on the 'wine list' and in fact that was a primary reason I picked this place.  The 'wine list' was four or five kinds of red wine, including 'Barolo - £49.'. No vintage - no winemaker.  I ordered it anyway ... It was actually a pretty decent food wine, although a bit young. Service was fine.  The place seems family owned.  they definitely did not hurry us through the dinner (we did linger awhile over that Barolo, even despite the school cafeteria atmosphere).  So - all in all - it wasn't what I was looking for, but if you want a decent Italian dinner at a decent price pretty quick, when you're near Paddington - this place will be just the thing.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JeS7ciQNAY6seqFVrhsIuw"
  },
  "K9C_bVqFf5DsEucS-Zl24Q": {
    "date": "4/15/2015",
    "text": "Stopped by here for a nice dinner. Definitely got a nice dinner. The dishes are classic and well done - spaghetti bolognese and a salad - and the service was decent. The little round-the-corner Italian place every one wishes was on their street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rKE0odPNpGUtlqx4W1kwQ"
  },
  "pdv6ExkEd578cRGhbhjjFQ": {
    "date": "6/12/2015",
    "text": "Not a good choice at all. Especially when you are not Italian. The staffs are not so friendly. The food is just so so. And I only found four or five pieces of ham on my ham pizza",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbHUStmk7NbZHYYqWD-waA"
  },
  "LuOeQfdiD5QHh0-lf7Yk4A": {
    "date": "7/24/2016",
    "text": "Great food and FABULOUS service. We would absolutely eat here again. My daughter did not care for her meal and the owner asked her (very nicely) to explain what was wrong. He then gave her a free meal of her choice. I wish I had saved room for dessert!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCmneJGC7JKyAsCuxkXqsw"
  },
  "amOOviPEYbuV06qvIW4ukA": {
    "date": "7/20/2016",
    "text": "Grabbed a takeaway from here.. The food was great. Very reasonably priced and fast service.. Definitely recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_M9wB1G6HT-28aXSyVUmiQ"
  },
  "IlOjiXxo4-YVWZTITnI67Q": {
    "date": "5/20/2015",
    "text": "The children loved the pizza and I loved the fillet of chicken.  Husband had the spaghetti and we all shared both the apple pie and the ice cream.  Best of all was how friendly everyone was....we will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PY81PsMryliajQZ1zXACTw"
  },
  "jb_uUSX_jZ04Mv4EVeZhmw": {
    "date": "3/17/2015",
    "text": "Decent food.  Good prices.  Good services.  Open Touristic ambiance.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GR1HzADkbQQ8B-6-SGvGWg"
  },
  "fRaT4P6-9LWHtlrra4K7Bg": {
    "date": "3/11/2016",
    "text": "This is one of the best Italian restaurants I have ever experienced. Staying near Paddington Station I took a gamble on it. Visiting from USA I did not have my cell and access to Yelp reviews. So glad I did. From the instant welcoming when I walked in to quick seating, followed by enthusiastic and very pleasant service. I had the garlic and mozzarella bread (more like a thin pizza style dough cut into about 6 pieces and served in a basket) plenty of cheese and great flavor. Then for the master main dish- the BEST meat Lasagna I have ever had. It was chuck full of meat, great tasting sauce, and just the right amount of cheese. Baked in a round lasagna dish to perfection. Was able to purchase just a half bottle of wine, good house Chianti served in a nice carafe. Can't wait to come back to London to be able to eat here again. And the cost was very reasonable. Total bill including 10% service was 23 pounds.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_KQRuwtxsQ9hREKk0mXoA"
  },
  "uccx5Ji97RTuSfShK0C9Kw": {
    "date": "7/17/2014",
    "text": "I never thought I would say that the best Italian I've had yet was in London, but after eating here... it's true! We enjoyed everything!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8iVLoRtV4yNGlM4nEtU-Fg"
  },
  "6zoC2R7mcrxOswIhQ4vX4w": {
    "date": "8/10/2016",
    "text": "I will start with the good and end with the bad. The waitstaff was good and attentive. The food was fairly good. I had pizza and it was fine, nothing special but ok. The wine was good and actually reasonably priced. Now, the bad. We checked our credit card bill when we arrived home and found three charges for the meal, two that same day and one the next. I have never had that happen so I contacted my credit card company and they removed two. Left a very bad taste in my mouth. Make sure that you check your statement. Better yet, pay with cash there.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6d6BCfhuX6Ip02EWDtkivQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6d6BCfhuX6Ip02EWDtkivQ/o.jpg"
      }
    ],
    "user_id": "6GkC91NlLDHWjQvKksJ5hA"
  },
  "dnROzibcl4Qa9DzEDeytXA": {
    "date": "2/23/2017",
    "text": "This gets 3 stars only because it's a relatively inexpensive meal. Service was just sufficient, food was OK and getting stuck downstairs in a little nook made it all an unfortunate experience. It's busy, but can't imagine it's locals. Must be tourists who don't know any better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NepJ9x5v--gkbuqGS5EvQQ"
  },
  "ch9HSUWR26XdNUTttkZLPg": {
    "date": "9/6/2015",
    "text": "Ate here repeatedly over the years never any issues till two days ago.  I've loved all the sauces but the other night a dead roach was in the bottom of my plate.  They were great about bringing me a new dish with different sauce.  BUT came to find out it's a repeat problem in the lift.  The food comes up from basement and they don't cover it.  So sorry as I loved this place but God cover the plates.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewnnhQ--YyMym9TI1fLz1Q"
  },
  "SO_YhG1NETL4cy7JIzXpJg": {
    "date": "3/14/2017",
    "text": "Excellent food. Authentic Italian. Reasonably priced. A must go if watching your budget ! We had the pizza and spaghetti carbonara! Highly recommended,",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pN9qhSpKnxTSlVBNLE2PLA"
  },
  "iI0FfbblcFqPEz4QSA0_Sw": {
    "date": "7/9/2016",
    "text": "We went here on a whim and I am SO glad we did the prices are unbeatable. Everything is so authentic and everyone who works there is true Italiano. The homemade pasta blew us away and we are tempted to go back again before our vacation is up. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THmPdt-igO39RfdnvK9jWw"
  },
  "7TTjTNHiUWi0uqNfxZcL7w": {
    "date": "6/28/2015",
    "text": "This was my third visit. Each time I lest totally satisfied.  The service was attentive, helpful, polite, and fun!  The food is authentic Italian. From the prawn apps, to the crisp thin crust pizza, to the main courses, all delicious!!  If you're near Paddington station and looking for a real Italian meal, look no further.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rXCYcEd5Rg_KZxDUIrw2wg"
  },
  "bX-R77_vsOybhfFPuyFRvQ": {
    "date": "8/20/2016",
    "text": "The service was attentive and the restaurant pleasant.  The meal good but not great.  I had the the alio olio first, which was prepared well, and the lemon chicken with spinach second.  Finally, I had the tiramisou for dessert.Overall, it was a reasonably priced solid meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CK_mERKcA2_FU_Pg7eVyzg"
  },
  "S88rDboxZOnc30Nm0CUNSw": {
    "date": "8/3/2015",
    "text": "The food there was delicious.  The lasagna seemed like it was pre-made and reheated, hence the burnt edges but the taste was on-point.  You could tell that the pasta was made from scratch.  The chicken florentine was a bit bland but not bad once you added some salt.  The decor was a bit strange but the outdoor patio more than made up for it.  Owner/manager was out on the street trying to shuffle people into the restaurant.  The service was quick and standard.  Overall, I think the food was worth it if you're ever around Paddington.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kG8eaXdOzIbwOiXSnY0aKA"
  },
  "Am2wLdt3uLdwkbxnfGiqLA": {
    "date": "3/29/2016",
    "text": "We stopped here on our first day visiting London.  The food was decent.  I got veal saltimbocca, which was good, but a little oily.  And a side of veggies that were nicely sautéed in olive oil.  My daughter ordered pizza which was fine.  Service was good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LghHcDB42fkYx43rVq-O9w"
  },
  "36KHq5ZWLIBnfrGP3MjZaQ": {
    "date": "12/3/2016",
    "text": "Adorable, basic and inexpensive. Basic wine list, food was good and served quickly. A block from Paddington Station. Its not a romantic date spot or a place I would seek out for a special night - but a good place to grab a quick bite and glass of wine.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aH6fX2gXK1XI6JUIKsWLlg"
  },
  "VSft1NPkNNjyep4qyMrwwQ": {
    "date": "10/18/2014",
    "text": "It's funny that the waiters start speaking in italian with you and they just give you hints in englishYummy food",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "x70IFn4fcTUEb2SGi-55MQ"
  },
  "WMBLHkCj7TLLdWiI98tQcA": {
    "date": "10/16/2015",
    "text": "We found this restaurant on Yelp and were craving Italian food but didn't want to spend a fortune. What a good choice! I got the carbonara with mushrooms and ham and my husband got the bolognese. We also got bruschetta and the house red wine. A very yummy meal and very reasonably priced! If you're looking for Italian, this is a place to try.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FL6mfwYd8Syj2A3u57HKg"
  },
  "qe41k0jqFaev-pn-nsI6ag": {
    "date": "2/7/2016",
    "text": "We were recommended this place by our hotel concierge and treated like royalty as soon as we walked in.  Once they brought out the garlic bread, I knew I was going to be in for a treat.  (The garlic bread was a meal unto itself.)  I recommend any of their veal dishes, and the tiramisu was amazing.  Light, fluffy and delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7uD6PRDFDL-m7ieTCaEOag"
  },
  "40BWs1o-6gjB8EeGfhmsTw": {
    "date": "5/26/2016",
    "text": "Amazing Italian food.  Everyone in here speaks Italian which leads me to believe they come here cause it's LEGIT!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "whBpByq7lATfRwNB4e_O7A"
  },
  "31rVRpuCm96gbpI-w4X0Mg": {
    "date": "3/18/2016",
    "text": "I don't really get what the bad reviews are about... This place was pretty fantastic! We were greeted by an extremely friendly crew, sat at a great table by the window, and enjoyed the food! The food was fresh and delicious, with great flavor and nice presentation. I would definitely recommend this place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpI-CHVSdyZiNKJY0GHe_Q"
  },
  "jBt0dJof5yHSNBSXCiuK4w": {
    "date": "12/10/2009",
    "text": "Great service, I was walking past this restaurant that was on the way back to my hotel from Paddington. I was greeted even before I walked in, then I was shown to a small table. Interesting Christmas decorations still up, the restaurant was half-filled and other tables were enjoying their food.I was given plenty of time to review the menu and decide. The drinks list offered \"Italian Birra\" so I asked the waiter what it was - San Georgio. Sure, I ordered one of those and a plate of lasagna. The waiter also \"upsold\" me to a plate of bread (90p).The beer was cold and when it arrived, the lasagna was still bubbling. Good flavor and well assembled, it tasted like what lasagna should taste like - meaty, cheesy, and lots of layered pasta - and it looked like it too. See picture.The price was good - £13 - and I felt that I got a good value.Would I return? Yes!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "2hiJPUn071oJxh_ysd1nag",
        "caption": "Photo of Bizzarro - London, United Kingdom. Lasagna. Garfield would be pleased.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2hiJPUn071oJxh_ysd1nag/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "ny4eMkChsoPvrReKM5EUTg": {
    "date": "5/19/2014",
    "text": "A very good Italian spot amongst the plethora of touristy eateries in the area. Service was a bit slow but not awful. Apparently several staff hadnt shown that night..which however wasn't impressing my friends from NYC! Regardless, all the mains were very good and excellent value for money. My pasta con salmone was creamy without being too rich. A friend had the stuffed chicken breast which was served in a large portion and was fresh and flavourful: crispy on the outside, tasty herb infused stuffing inside. For me, the desserts highlighted the meal. They served the best tiramisu I've had in some time. Delicate sponge, a bit of cream, and heavenly coffee/cinnamon powder on top ....I had to stop myself from gobbling it down too quickly. The banoffee pot was surprisingly tasty, as normally I find them overly sweet yet bland. For Americans who haven't had banoffee: it tastes like a melted Heath Bar. Overall , an enjoyable experience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuIuTO0t6AxBhQgIfnNKkw"
  },
  "rD59et7eIaB7eZERpxtAvQ": {
    "date": "8/6/2014",
    "text": "Had spaghetti with sundried tomato and mushroom.  NOM.  Nice quiet afternoon.  Very pleased.  Likely to return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TORZB7MOQg-wprqZaEI7WQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Spaghetti w.sundried tomato and mushroom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TORZB7MOQg-wprqZaEI7WQ/o.jpg"
      }
    ],
    "user_id": "fHGJIDBPtdYNvdbFK-h7ig"
  },
  "-qLjGXmBi0O7koRckWaSpQ": {
    "date": "8/8/2014",
    "text": "This resto is on the tourist path to paddington so the place always seems full but may be due more to its location than it's cuisine.We were hungry for pasta so I ordered spaghetti bolognaise. The pasta itself was well prepared, al dente, but the sauce was unremarkable. We also had bruschetta which I would not recommend.We made the mistake of ordering the daily dessert which was Apple pie and I took two bites and left it. It really was bland and seemed overly processed apple mix thrown together.The waiter was friendly and the service was fast.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bH2332xJL0s2K2eFxEcAQ"
  },
  "duzSxQHRhZ8TaL3Qt594wA": {
    "date": "9/17/2016",
    "text": "Super food and service. Great place for a family with teenagers. And has the Italian atmosphere. A piece of Italy in London a restaurant we would visit again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WjPzT6IYDaCZevOqAU2L-w"
  },
  "_6b42sJl-Q4tpksTjuFqsA": {
    "date": "9/4/2016",
    "text": "Close by Paddington station.  We ordered the salami pizza made a request to leave chili out and they were very accommodating.   Second dish spaghetti bolagnese was amazing as well, they did not cheap out on the meat in the sauce.  Definitely recommend for anyone craving Italian cuisine.  Our total bill came up to only 16 pounds!!!  Great value.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wgQ1_n3w2Df37MPrrgq4JQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wgQ1_n3w2Df37MPrrgq4JQ/o.jpg"
      }
    ],
    "user_id": "zukm8pq_Yh9M6ads0_Hc1A"
  },
  "IiYN3wftlJ8qTpAr2LHhsg": {
    "date": "5/11/2015",
    "text": "This restaurant really surprised me!!After a lazy Sunday afternoon in Hyde Park we decided to find a restaurant or diner to grab some food before my girlfriend returned to Oxford. Needing to be close to Paddington station I wasn't too optimistic! If I wanted MCdonalds, KFC, Subway or Burger King we would have been fine!But just 5 minutes down the street we stumbled across Bizzarro's. Quite a strange name, but the look of the restaurant stood out from the rest of the street. It didn't quite seem to belong in its surroundings, which is a good thing,Whilst looking at the menu we were approached by a waiter who has the classic 'cheeky Italian' vibe about him and without being overly pushy asked us if we would like a table. The menu looked plentiful and very reasonable so we went for it!We were seating on a table outside, but with the huge windows completely open we didn't feel detached form the internal restaurant at all. It gave us a very European vibe as it was still early evening.The waiters were incredibly attentive and prompt with their service, with drinks arriving less than a minute after ordering. The food arrived and I was impressed with portion size. The pizza tasted authentic and my girlfriends pasta dish was very filling. We paid promptly, and left with plenty of money still in the wallet! To summarise: This restaurant really does feel genuinely Italian, and i would strongly recommend this place for any pizza lovers close to Paddington!",
    "rating": 5.0,
    "rated": {
      "useful": 11,
      "funny": 6,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "TS6CDh1v0IhFMWjTpG4oYQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Bizzarro's as we left.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TS6CDh1v0IhFMWjTpG4oYQ/o.jpg"
      },
      {
        "img_id": "6TJnYKJh5Aj5okmbJu1l_A",
        "caption": "Photo of Bizzarro - London, United Kingdom. Interior of Restaurant taken from where we were sitting outside.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6TJnYKJh5Aj5okmbJu1l_A/o.jpg"
      },
      {
        "img_id": "ZCZkAxYNw1jjmx16Dr-1pw",
        "caption": "Photo of Bizzarro - London, United Kingdom. Main Course: Pizza Tutta Carne & Cannelloni",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCZkAxYNw1jjmx16Dr-1pw/o.jpg"
      }
    ],
    "user_id": "OEXrsx1-tCXu6vr-WhlL_w"
  },
  "FD-Cx5w5XcnUicVOTapTRw": {
    "date": "12/28/2016",
    "text": "Special place. Great food. Terrific service. Very friendly staff. Reasonably priced. Came highly recommended from the staff at the Hilton Hotel in Paddington. Took my family there for lunch when we arrived. We ended up eating four dinners at the restaurant because that's where everyone wanted to eat.If you are near Paddington, I highly recommend this place. We had five pasta dishes tonight, 3 appetizers, 2 deserts, drinks for everyone. The total bill was 63 POUNDS for everything - including tip. Love this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fMCwOH3zodv5d44nlFblSA"
  },
  "DWv3mMVDclfkjYF5MxYDzg": {
    "date": "10/24/2017",
    "text": "This restaurant created a perfect night out. Food was absolutely lovely, both the starters (our party has gnocchi, calamari and a rocket salad) and main course (pizza). The ambiance is lively (at times a little noisy, so don't come here for a calm dinner). Have plans for going back already!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3zQTYo7OxLd30Ym9lCnxw"
  },
  "rebWfD_LhNTJvNvDDqcC3g": {
    "date": "2/17/2016",
    "text": "We started with delicious garlic bread. Then the main course we shared a nice fresh salad and I had the Lasagne. The Lasagne was really delicious. My wife hat the swordfish that was really well prepared except for it being a bit on the salty side.The service was perfect and quick. Really a cosy place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ABWK2XnuybEzXS3QCeQdLg"
  },
  "kChDlRlmrN2iZ--4GkRUaQ": {
    "date": "10/27/2016",
    "text": "Great food. The service is good the waiters are nice. We ordered a lamb cutlets, a risotto and a clams pasta. All taste good! My pasta was wonderful. The risotto and the lamb were reported nice too!The atmosphere was nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pTiwwvZBAGKrYYFNOfzTlA",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pTiwwvZBAGKrYYFNOfzTlA/o.jpg"
      },
      {
        "img_id": "MHg4uy2nVrJ1rXqTEv168w",
        "caption": "Photo of Bizzarro - London, United Kingdom. Lamb cutlets",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MHg4uy2nVrJ1rXqTEv168w/o.jpg"
      },
      {
        "img_id": "nnRxVBIvi_jklzCdxgME9Q",
        "caption": "Photo of Bizzarro - London, United Kingdom. Risotto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nnRxVBIvi_jklzCdxgME9Q/o.jpg"
      }
    ],
    "user_id": "4NVOAmOogYuSYfhEP-8R3A"
  },
  "6A37Lre-Srk3EfSqKVl5Ig": {
    "date": "11/17/2014",
    "text": "I'm not an expert in West London but I was starving and this was the closest option, open at the time. Everyone is really nice, Italian friendly in a way you won't find very often in London. We sat down and were quickly welcomed by the waiter who offered us some wine and the food menu. I was hungry but not so much, I decided to try out the mushroom pasta they had and my companion had the lasagna. I liked his option better than mine, it was much more flavorful and delicious, mine was a bit plain. Unfortunately I did not have enough space for dessert but they did look appealing. Total bill was around 20 pounds for two people (which is really good). PS: Not sure why the place is named Bizzarro, but as far as my Italian goes this means \"bizarre/stange\", so I would probably never name my restaurant like that.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "sgW7KBn12BaIhqQ_mixb2Q"
  },
  "HQGb6796nRaZ9Ab_53ysRQ": {
    "date": "4/12/2017",
    "text": "AVOID AT ALL COST!  Quick seating, terrible service.  Lost our appetizer order, then when reminded they brought us two of the same thing... us thinking that the redundant appetizer was a form of apologizing for the oversight, we went on with our meal.  They were 'fresh out' of the dish I wanted most on the menu as my main course, so I quickly found another.  Waited an additional 30 minutes without anyone checking on the table.  Finally our meal came.  To be fair, the food was good (but we were also extremely hungry by this point, so our judgment was shaded).  Gobbled down our food and got out as fast as possible, only to realize when we got home that they charged us for the redundant appetizer that we did not order.  Stay far away from this place!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-1cbFFLh8yKmoD0h_bDRg"
  },
  "efRv-j2TdCqpoDPiZJinyg": {
    "date": "8/8/2017",
    "text": "Authentic Italian restaurant with friendly staff and affordable prices. The place was very crowded and the pasta was absolutely delicious. Would definitely come here again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LEGSKvPcIS_FlU5hMmoj9A"
  },
  "ktAwcANFgjhTQSMgJ11qpw": {
    "date": "12/31/2015",
    "text": "My sister and I went here for dinner on a Wednesday night, the place was busy but we got seated quickly and the service was good, very nice staff! I ordered the vegetarian lasagna which was really good, typical Italian lasagna! My sister had a pizza with ham, cheese and pineapple! According to her it was her second best pizza ever (the best one is from Frankie & Fanucci in NY)!I would recommend this place if you are visiting Paddington!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ASBDTPqu93lrK_Ku4kB4nw"
  },
  "hKZZOIhS-mzgSPvMwjDofA": {
    "date": "2/26/2017",
    "text": "This is a good Italian restaurant right next to the Paddington station. Their pizza vegetariana was excellent. The staff were friendly and the service was fast. While I was ordering our food I mentioned my nut allergy and the staff very helpfully made sure that nothing I ordered would contain nuts. Their prices are quite affordable, the pizzas cost around 6 to 9 pounds each.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jgd_EaA0tMP4-1kyh2U5RQ"
  },
  "L-DnBN8ak79g-QTM21WqWw": {
    "date": "6/23/2014",
    "text": "Everything was well prepared and tasted excellent. The staff was attentive, quick and professional in their service. The main courses took a bit of time to arrive but nothing extraordinary especially for the quality.  We had the vegetable lasagna and spaghetti with shrimp. Wife had the minestrone soup and was talking about how good it was all night. I'd go here again in a heartbeat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lZgbmXoa_QymXCjPIHTrpQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Tiramusu.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lZgbmXoa_QymXCjPIHTrpQ/o.jpg"
      },
      {
        "img_id": "2BfZ-eXvVEdoWRJKevliKg",
        "caption": "Photo of Bizzarro - London, United Kingdom. Vegetarian lasagne and spaghetti with seafood.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2BfZ-eXvVEdoWRJKevliKg/o.jpg"
      },
      {
        "img_id": "ztt_ZoamHeCkHEmPkitL7Q",
        "caption": "Photo of Bizzarro - London, United Kingdom. Open air. Great atmosphere.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ztt_ZoamHeCkHEmPkitL7Q/o.jpg"
      }
    ],
    "user_id": "yR2aB814ayg2ufcSMKBl7w"
  },
  "uneiJqVEpdLoVnqA13h5yw": {
    "date": "6/22/2017",
    "text": "We waited 45min for ONE PIZZA TAKEAWAY! 45min! The waiter told us it would be ready in 15mins. The restaurant was crowded and hot, so we had to stand outside and wait. FINALLY it took the waiter 45min to rush out to hand us the pizza without saying any word nor making any eye contact. When we got back to our hotel, we found the pizza was burnt on the bottom, the crust was very hard and dry. We are really disappointed.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GpTfcnyN14-V-udrjgVYqA"
  },
  "6iN8MX9SewKDo1ieS1j9xQ": {
    "date": "4/29/2015",
    "text": "I found this place on yelp after a LONG day of walking and sight seeing.  All I wanted to do was quickly grab some food to go and take it back to my hotel which was right down the street.  Upon arriving, all the employees were very nice and very helpful.  They answered questions I had regarding the menu and even brought me water while I waited for my food.  The food was done quickly and only took about 5-10 minutes for alfredo pasta and cheese cake.  The pasta was AMAZING!  I am sure it helped that I was starving, but regardless I was very happy I found this place and it was exactly what I needed after a long, tiring day of wandering around London.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbGgl0-C3i-JtoIWAXNyOQ"
  },
  "MewQ_DwoiG2GzEPEMsP8mA": {
    "date": "3/30/2015",
    "text": "The food here was an unexpected surprise! The reviews are right when they say it's great pasta at a reasonable price. The staff was friendly and helpful from the minute we walked in. Our food was out incredibly fast, and the ambiance was cute.There was a group of older men at a table speaking in Italian, and it felt like a scene out of a movie. I would definitely go back next time I'm in the area!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ak_wXdBsUccSgYg-i2mjYA"
  },
  "ZLOKaW5OuTx9CerScRfcHA": {
    "date": "4/5/2015",
    "text": "The food here is very reasonably priced.  Lots of options for non-meat eaters and meat-eaters alike.  The pizzas were good sized and the wine selection is decent.  My husband and I both had the lasagna - mine was the vegetable version.  We both noted that while it was good, the sauce was a bit creamier than we are accustomed to with lasagna.  The service was good until the end when they cleared out plates, brought no check, offered no dessert, and amongst the growing crowd of diners, seemed to forget we were there.  I had to summon the manager in order to get our bill.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qBHHwY8oYknfA6xlkCMOxQ"
  },
  "QdBcQpc7zcHOlIbdWT4yXw": {
    "date": "12/8/2016",
    "text": "This place is simply amazing. Although it might not look like much from the outside, the inside is truly stunning. The staff are by far the nicest and most service-minded people I have ever met. It truly feels like you become apart of an Italian family. The food is also outstanding. If you're in London, you should definitely visit this place. 10/10 experience for sure.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkQkpAAPe018MK9bLzikkQ"
  },
  "chlmAqVp-De8knONPQZTxA": {
    "date": "8/2/2015",
    "text": "We lived near here this summer and went to Bizarro a few times. Spaghetti. Lasagna.  Pizzas. Gnocchi.  All pretty good.  Definitely got an\"ugh, Americans\" vibe the first few times we went until they got to know us.  I wish there was a \"I'm a foodie\" card we could show people so they give us a chance. Not award winning but a decent value for what you get.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9FnOE_sFkmltRtKFIe6bzw"
  },
  "nNM4PjWIqhbhxRSNPfmO_A": {
    "date": "7/14/2016",
    "text": "Great service & excellent food, and budget friendly! We had everything from the pasta with prawns & zucchini to the pizza, and it all was great. Real Italian food made by Italians. We would come back again for certain. I Highly recommend eating here for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUPe_RybRmbCAVKt1cglcg"
  },
  "VLUsW0F4OO1hXQlsi3aEyA": {
    "date": "6/14/2015",
    "text": "The lasagna was most delicious! The margherita pizza was more like a cheese pizza. I would recommend the lasagna to anyone. One downfall is the waitstaff is rather pushy to get you inside and they don't give you the option on where to sit they want you right at the front door to look busy. Otherwise though they are very helpful and are on top of refilling drinks and helping out whenever you need it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Epr3PrdIVgE01Lv5ty3pwQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Margherita pizza (more like a cheese)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Epr3PrdIVgE01Lv5ty3pwQ/o.jpg"
      },
      {
        "img_id": "NT9oElDdwMU675hmFp-43Q",
        "caption": "Photo of Bizzarro - London, United Kingdom. Lasagne and it is so tasty!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NT9oElDdwMU675hmFp-43Q/o.jpg"
      }
    ],
    "user_id": "G7qs5RiLZTrMAlaZDF9Kng"
  },
  "J85F9N5uToyNXRs_Wv7Fbw": {
    "date": "7/13/2017",
    "text": "Definitely a big fan of this authentic Italian restaurant in the heart of Paddington! They have an incredibly homey feel and provide outstanding, fast, and friendly service. The waiters were helpful and knowledgeable about every menu item and all had great senses of humor. I enjoyed a pint of guinness, the chicken bizzaro pizza, and some bruschetta. Each dish was incredibly flarvorful and on point, would highly recommend this spot!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "CEqv4F2ugpP7-T9SNyNRaQ"
  },
  "x0AEk80QPs1YbhDj3OwKBA": {
    "date": "8/1/2018",
    "text": "Food is amazing but the server tried to over sell and bring things to the table that I'm not asking for bc I'm young and American. I suppose he thought I didn't understand what he was trying to do but I saw through it... excellent food. Second time eating here. Recommend the Gnocchi Napoli.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivxiqQj5BaaiwXdmMg9sPg"
  },
  "FOrqWC3SIRENonVH9YvFqA": {
    "date": "5/25/2017",
    "text": "We enjoyed a file meal with good service, even though this popular restaurant was very busy.  Reservations advised during diner hours.  Our table ready and service was quick.  An extensive menu (see photo) offered many choices.  We three ordered pizza, mussels, pasta with clams, pasta with seafood. Pastas were al dente, sauces balanced and not overdone, pizza flavorful. And those mussels perfectly prepared, tender and sauced nicely in tomato broth.  Desserts- oh my!  Tiramasu will float away if your not careful.  We'll chosen wine list.  If you're seeking Italian , you won't be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XPVGKWIwmdiYLDKLnXuHCA",
        "caption": "Photo of Bizzarro - London, United Kingdom. Extensive menu!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XPVGKWIwmdiYLDKLnXuHCA/o.jpg"
      }
    ],
    "user_id": "_sBLNG9mqupU6wSzUilavw"
  },
  "RP9x-y76WBrjn3MaisjqUQ": {
    "date": "3/24/2017",
    "text": "This is by far my favorite Italian restaurant in all of London, and I've been to quite a few. All of which cost four times my bill here (per meal) but are worth nothing of the quality and flavors I experienced at Bizzaro. When my friend and I first found this place, we literally had dinner at it three days in a row. All the pizzas we tried were great (braseola pizza yumm) and the pastas (beef cannelloni, Pennette con Melanzane e Basilico if you like aubergines, and our allllll time ultimate favorite: Linguine con Pollo & Spinaci with mushrooms added to it) were so flavorful too! Having all the pastas showered with grated parmesan was a delight.We've thoroughly enjoyed all our evenings there, the staff is very attentive and service is quick. The decor is quite dated, but I think that just adds to the charm of an authentic Italian experience. If you're looking for actual Italian food and flavors, this should be your go-to spot.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "idZdFzjhUZoB-Wxgrr8Hfg",
        "caption": "Photo of Bizzarro - London, United Kingdom. Chicken and spinach linguini, beef cannelloni, penne with aubergines",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/idZdFzjhUZoB-Wxgrr8Hfg/o.jpg"
      },
      {
        "img_id": "KB3fWMJJx34L7PFBpK3VCQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Linguine con Pollo & Spinaci with mushrooms and looooots of parmesan",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KB3fWMJJx34L7PFBpK3VCQ/o.jpg"
      },
      {
        "img_id": "wA3_HxlvzkolwfUy8pj0dQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Braseola pizza and Linguine con Pollo & Spinaci (both absolutely delish!)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wA3_HxlvzkolwfUy8pj0dQ/o.jpg"
      }
    ],
    "user_id": "doqeiPC0zWGE3zVKKiRp4A"
  },
  "DUpAjaSks_NM8ngpjV85UQ": {
    "date": "1/23/2018",
    "text": "We loved it here. Had great service and delicious pasta. The pizza looks good too.   Nice decors. Very fresh tasting food. We will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-VFG3nVHwXScfsBRnqXj-w"
  },
  "ZSxoHJyjONWg-D12n55Xkg": {
    "date": "1/13/2018",
    "text": "The foods are incredibly good and way beyond my expectations. I lived in a hotel nearby and after an early flight and a long trip, I need something good for lunch. I met Bizzarro just around the corner. With its normal and average look, the food and service are amazing. I never thought I would have such good spaghetti here, but I did. Amazing one.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2yE3SZjJhpi5jKCrChr_zw",
        "caption": "Photo of Bizzarro - London, United Kingdom. The food is incredibly good.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2yE3SZjJhpi5jKCrChr_zw/o.jpg"
      }
    ],
    "user_id": "ahO0aA4NORUaDB1UznM_Ww"
  },
  "lW3ImZUrgSnYOUbD8mVT4g": {
    "date": "10/9/2017",
    "text": "First a silverfish (insect) ran off of the (empty) plate placed in front of me. The waiter kept trying to tell me that it was okay because it probably just fell from the ceiling. The appetizer of king prawns that was brought out wasn't  de-veined (for those that don't know, that \"vein\" is the intestinal tract, full of feces). The water glass felt gritty on the outside, like food was stuck to it. Some people might have good experiences here but I suspect you don't want to know what happens in the kitchen at this place.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "npZRAi6_vaC0_PeFAf75MA"
  },
  "Pok3p2y9BMCLVKWybFZllg": {
    "date": "3/2/2017",
    "text": "It's a surprise to find a restaurant near Paddington station that is not a tourist baiting monstrosity (expensive and bad food) but this is an exception.  I wouldn't call it amazing by any means, but it's definitely good.   The pasta was properly cooked and there veg in the minestrone was plentiful and not overcooked.  The reason for the four stars is that the prices were very reasonable.   £7 for a main of pasta?  Sign me up.   Good for a lunch or dinner if you are in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "b-fP5XcqMMI4dhp4bAxRrA"
  },
  "kVq-AEeMYJdRbp-XsOWcdA": {
    "date": "8/4/2016",
    "text": "We were running around Paddington looking for ice cream and found this place...It appears they found us! A gentleman at the entrance motioned us in and we shared a magnificent chocolate soufflé to satisfy our insatiable sweet tooth!Cheers",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PmU2NKdjaxxDltFh5dAksw",
        "caption": "Photo of Bizzarro - London, United Kingdom. We shared a wonderful chocolate souffle on the terrace",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PmU2NKdjaxxDltFh5dAksw/o.jpg"
      }
    ],
    "user_id": "pg0ox7jgEyAGr5mkfA7FVQ"
  },
  "H-PGfQnCaacLUVjFA5WgRA": {
    "date": "4/3/2017",
    "text": "Really great calzone and house wine, you must order tiramisu (with mascarpone cheese). Attention was very rude but  food is really great. Payment by credit card accepted. Muy buen calzone con vino de la casa, pidan el tiramisu que es con mascarpone. La atención fue un poco displicente pero la comida vale la pena. Tarjetas de crédito son aceptadas.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DWdHCrNB4Q6ZrCGjN7DN9Q"
  },
  "ORsZ_Y5SNwjSc7pktZdMUQ": {
    "date": "11/2/2017",
    "text": "BEWARE!!10/28  I went in person to order 4 pizzas and a salad to \"take away.\"  My wife has a food allergy to onions in any form, so I ordered the salad and her pizza with great care.  I quizzed the Manager before and after he entered the order, after he assured me there were NO onions in the tomato base.  \"No problem\" to omit onions from the salad and dressing.The pizzas were very good!  However, my wife had not even finished her pizza when she became urgently sick - the hallmark reaction to onions in her pizza.  Not only that, we opened the salad to share it and discovered minced onion PIECES in the salad - too many to find and confidently remove.So, is the Manager dishonest, is the kitchen incompetent, or both?  What should have been a great experience was the opposite.  Our apartment was too many blocks away to return and attempt to find a resolution and trustworthy outcome.Good pizza, but completely untrustworthy if you have any dietary limitations.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3k3_Z_bZYjCoRoLAYSfJg"
  },
  "Hm8vAURmKmdW2Ww6GJeqaw": {
    "date": "3/3/2016",
    "text": "I'll keep this short and recommend you avoid unless you're feeling brave. We were greeted warmly and seated quickly and alas that was the highlight of the visit. The waiter was incredibly aggressive when he took my order. It was just unpleasant! I ordered a pasta arrabbiata and was shocked at how oily the pasta was. It had absolutely no flavour and the sauce was 50% oil, 50% tomato (yuck). We overheard the waiter taking a few more orders and were relieved that he was rude to everyone (atleast we didn't feel special!). They charged an additional service fee and on top of that the waiter didn't warn me that he would charge me an extra pound for EACH vegetable he added to my pasta. Usually restaurants will add an extra 2/3 dollars to add in veggies. Instead they charged me a pound each for every vegetable that they put into my plate.The food and the terrible service paired together made this restaurant a definite member of my \"never go again\" list.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BytRWk8X1OelSgwwfXd8Aw"
  },
  "vOyDtUrso-9uKm6haUbvxw": {
    "date": "5/19/2016",
    "text": "The food was pretty good overall, the service was ok but kind of slow. We tried the bruschetta, which wasn't all that good and the spaghetti bolognese which was pretty good. Their top shelf red wine, don't remember the name, would definitely recommend",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dByZpu77rVyDGtrESyLmZg",
        "caption": "Photo of Bizzarro - London, United Kingdom. Spaghetti Bolognese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dByZpu77rVyDGtrESyLmZg/o.jpg"
      },
      {
        "img_id": "qO8OseDr1TEfBsI-rMIUiQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Bruschetta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qO8OseDr1TEfBsI-rMIUiQ/o.jpg"
      },
      {
        "img_id": "_rTTDz9h3LkvNZkiKYlmbw",
        "caption": "Photo of Bizzarro - London, United Kingdom. Salmon salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_rTTDz9h3LkvNZkiKYlmbw/o.jpg"
      }
    ],
    "user_id": "AG2Nbx6T4vGEsmk_Z7TZfA"
  },
  "ZGCPlPgp1htPKNzzWMD81g": {
    "date": "3/31/2017",
    "text": "This is delicious, authentic, affordable Italian food. I rarely write reviews, but I wrote this one to convince you to try this place. DELICIOUS: We ordered pizza style garlic bread with cheese, lasagna, and tortellini. All three were as good as we could hope for. We are trying not to go anywhere twice while in London, but this place is so good we may make an exception.AUTHENTIC: The staff are all very friendly and helpful, and all that I've seen and heard are Italian. The menu is in Italian with English translation. Decor is Italian. AFFORDABLE: Our total came to £23. Tips in London are optional, and not expected. We purposely sought the chance to tip here. The total came to $33 after a 15% tip; by far our cheapest dinner and less expensive than several lunches.   I rarely write reviews, but I noticed some negative reviews, so I want to throw my voice in with the many people who rated this restaurant highly. On TripAdvisor this place does very well with more than 1,000 reviews. Stop browsing and just try it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1rQw_-4ZOI30e2S5GYtAfQ"
  },
  "1-QQvyD8mRo4dS2Hfc10qw": {
    "date": "9/6/2017",
    "text": "We were warmly welcomed by the staff and given great treatment throughout our meal. The swordfish was incredible along with the sole and spinach. After a long day of cruising the streets Bizzarro was definitely a home run.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "acZ6RagHg82xsCYYIgBSxQ"
  },
  "-7WxXIapT06f20axw20skg": {
    "date": "10/2/2016",
    "text": "Came here right after my flight. This was one of the few restaurants that was willing to have the kitchen make is food when we wandered in at 1130 pm. I ordered the gnocchi and a lemonade. Price was not bad and the food was pretty good. The server forgot to bring us water and was very apologetic. Overall a good place to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "I6YARR1VloAua-buFULo1Q"
  },
  "3luTnbWL2m4j8z-krX_9Lw": {
    "date": "3/24/2018",
    "text": "Very attentive service. Excellent food, with authentic Italian flavours. Prices are reasonable for London. Recommend the veal dishes",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hpqgSXGBxvTveSEKXyE5Uw"
  },
  "QXegetHXP9ui17at7rw1cA": {
    "date": "2/23/2018",
    "text": "Great atmosphere, and although it was very busy the staff was very efficient. Drinks were rapidly delivered and food was perfectly prepared and on time. Attentive staff and manager was much appreciated",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3YgQbneJZpolIV4tthIzbw"
  },
  "uljSyhEsebiRNSoBWTmc_g": {
    "date": "7/11/2017",
    "text": "We went back multiple times while staying nearby. We had multiple pasta dishes as well as stuffed chicken and several desserts. Everything was delicious and the service was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SWAaDCusi26enx6WmkhRw"
  },
  "y1AivyRykFCvoYUZrH0WYw": {
    "date": "6/5/2017",
    "text": "We had very nice spaghetti and pizza with good house wine. Service was prompt, friendly and helpful. Would definitely return next visit to Paddington.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxR3b7VgkxyOjGirMHYyfA"
  },
  "uosGuIh3NhMJRELL9vOWkw": {
    "date": "11/4/2018",
    "text": "Tutto Bene. Flori gave us outstanding service and was a charming host. Everything was fresh and delicious from the pasta fagioli to the entrees (linguini w/mussels and clams which were perfectly prepared and tortellini w/ricotta and spinach-yum!) and the house wine to the aptly named torta fantastica and sambuca for dessert. Amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CrVuL3VZ_PJdlWNZT73cjQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Dessert Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CrVuL3VZ_PJdlWNZT73cjQ/o.jpg"
      }
    ],
    "user_id": "T-7IcNGcHpLm2Wd-vqZwJA"
  },
  "4ASmfCc5aNhozDfteYpGSA": {
    "date": "6/27/2018",
    "text": "Great food and the atmosphere is casual.  Prices are ow but they nickel and dime on bread and water. £.99 per person for bread is a little ridiculous.Overall food is tasty and the portions are good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qbotYuZxYXMCiF2rHbNDuA"
  },
  "_FFJVl0a32h0DHbswqFBlw": {
    "date": "10/15/2018",
    "text": "We were looking for an Italian place near our hotel for our last night in town. The reviews looked the best out of most options in the are so we gave it a shot. From the time we walked in we could tell it was a good place to be. Been in business a long time and had a teamwork, family momentum throughout the restaurant. We ordered the risotto on special which was a little bland. I thought it was going to have big shrimp/prawns but instead had tiny bay shrimp. It also had asparagus, but could have used some more flavor/fillings. The other item ordered was a stuffed chicken with vegetables which we both thought was delicious. All of the food at the surrounding tables also looked sooo yummy and everyone was clearing their plates. Since it was our last night we also got cheesecake and chocolate cake which were both so good! I'd certainly give this place a try if you're in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o9aZeO81i53hDl92wfj-kg",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o9aZeO81i53hDl92wfj-kg/o.jpg"
      }
    ],
    "user_id": "G7j1ae82hpJCq6CM_iaeDA"
  },
  "0TBDEOacMZkzywxdt1rctg": {
    "date": "10/22/2018",
    "text": "Steak with pepper sauce and chips. The steak was tender, juicy, and full of flavor. The place is small with lots of tables, but again... so are most restaurants in London. Space is a premium there. Would definitely visit again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d79dPSEQNogIarJb0lY-0w"
  },
  "q19BXBuuWjlACAX40h3Fuw": {
    "date": "10/21/2018",
    "text": "This place was a solid 4 stars. They did not have great food, they had good food. We had an array of food and no one had their socks knocked off. We all looked at each other and had that same kind of general nod of approval. The staff was ...very direct (I believe that's a nice way of saying what I am thinking, ha). I must say the deserts we very delish. Everyone had the hum of mmmmm-yaaaaaaah, this is really good. I would go back for deserts and the unusual (Bizzarro?) demeanor of the staff. And yes, watch the nickel and dime items.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAAnbXzummptZ-WlDa0YXA"
  },
  "Y84Kc2lXd6lTC7EkJbOevA": {
    "date": "3/16/2018",
    "text": "Old school Italian restaurant serving up pasta and pizza dishes in a slightly upscale setting. Easily able to get a table for two on a Monday night as the place is maximized with seating.One thing I immediately noticed is the overwhelming smell of flowers. not sure if it was the greatest scent, yet it's good if you want to cover up everything else. As for the food, ordered the Lasagna (£8.90) - a thick serving of lasagna swimming in a pool of marinara sauce. Cheese is a little burnt, though the waiter comes by and adds some parmigiana on top to offset. Pretty good meal and surprisingly not hefty.A little on the annoying side is the small expenses. They ask if you want sparkling or still; and my friend said sparking which is (£3.90). If you want pasta as main course it's £1 extra. Bread and butter isn't included but £0.95 a person. Gratuity of 10% is added on top. Other than that, a fine sitdown establishment for Italian food.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ghMlf7fYVCtfZpYyX1-p8A",
        "caption": "Photo of Bizzarro - London, United Kingdom. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ghMlf7fYVCtfZpYyX1-p8A/o.jpg"
      },
      {
        "img_id": "D6t_1xeUF_DP12yKlAeABw",
        "caption": "Photo of Bizzarro - London, United Kingdom. Lasagna",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D6t_1xeUF_DP12yKlAeABw/o.jpg"
      }
    ],
    "user_id": "uDBnapEGywTQ0ovaCu7Orw"
  },
  "jASi6Bp8eXbCphH91INjww": {
    "date": "1/17/2018",
    "text": "Everything is à la carte here, like in Italy, but the food is not ... like in Italy. Meat dishes come with nothing and bread is €1/person. A 10% service charge (£4.19 - $5.80) was also automatically included, so our server seemed extremely arrogant and nonchalant, a bit of an ass. Why should he care if the service charge (tip) is mandatory? He did not get a pence more.A half liter of house red wine is £9.40 ($13) on their website menu, but it was £10.20 ($14.15) when the bill arrived. The half liter carafe was far from full and it was not good. I had the Pasta e Fagioli (£4.50) and it was too soupy, had the wrong beans, and bland. Two teaspoons of grated parmesan did not even help. My wife the Olives (£2.90), a decent portion, but a tad spicy-hot because of the sliced jalapeños in the olive oil. Strange.She had the Fettuccine Prosciutto e Funghi (£8.90 - $12.32 for a \"main\" - £1 more than the small) and I the Vitello Saltimbocca alla Romana (veal topped with prosciutto and sage in a wine sauce - £10.90 - $15.09). Her portion of fettuccine was not very big, so I would hate to see the small version (£7.90), and it was bland with little flavor. My veal was actually beef (you can tell by the color - greyish, not white - and the way it cuts) and had a strange flavor. I am not sure if it was the wine they used, the sage, or both, but it tasted a little of a chemical of some kind.It was a disappointing experience after having read the great reviews, but then some throw 5-Stars around like candy. I guess I am a bit more demanding than most, having lived and traveled extensively in Italy for many years, but this meal was not even close to the 4-Stars (7-8 Bombs) they average on yelp. It was one of the worst £46 ($64) meals I have eaten. Bizzarro!CombatCritic Gives Bizzarro 3 Bombs Out Of 10 ... More Bombs Are Better!",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k0c8Pz5Zk3xVrtC7Txs9XA",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k0c8Pz5Zk3xVrtC7Txs9XA/o.jpg"
      }
    ],
    "user_id": "QrmvIxbRKJbyEzLZMumfhA"
  },
  "-dK6Zc5iDxU-yH4CjtkJhw": {
    "date": "9/8/2017",
    "text": "Everything was excellent from the service, food, to their atmosphere! I had spaghetti bolognese, my sister ordered Fettuccine con Prosciutto e Funghi and my friend had Lasagne Casalinghe. We also order their Tiramisu and Profiteroles Scuro for dessert! Everything was tasting so good and everybody were so nice, also our server; Jose was so attentive! We will come back before the end of our trip!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "DPJj6CKY9zEZPbOlNbe6vQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DPJj6CKY9zEZPbOlNbe6vQ/o.jpg"
      },
      {
        "img_id": "XtGdB_kjiN-J6IR2pcFnBw",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XtGdB_kjiN-J6IR2pcFnBw/o.jpg"
      },
      {
        "img_id": "YWlbmNhuvHhsqbnG-XyGgw",
        "caption": "Photo of Bizzarro - London, United Kingdom. w/ the manager of Bizzarro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YWlbmNhuvHhsqbnG-XyGgw/o.jpg"
      }
    ],
    "user_id": "MVSpZumy974f0-quznvAmg"
  },
  "ZD9U6duvT06B4hIlHFAcpg": {
    "date": "7/9/2018",
    "text": "What a nice find right in front of our apartment. Came close to 7pm and by 8pm the place was packed with a line outside (on a Monday night). Service was really good, fast and helpful. The food was excellent from the calamari and mozzarella starter to main dishes like clam linguini, pizza, salmon and more. Highly highly recommend. Also a good place for kids.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1X7pmvRh3vW-rmEwIqwhqQ",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1X7pmvRh3vW-rmEwIqwhqQ/o.jpg"
      }
    ],
    "user_id": "jyIlV_xeeBPvUFR-wdIYdw"
  },
  "PkxXdCJPr5QMHtxDTMCAvg": {
    "date": "12/29/2017",
    "text": "This restaurant was walking distance from a nearby apartment we rented. The pasta and pizza are delicious. The place was packed on a week night. For the cost, this is a gem in the Paddington Station area. Not too pricey, family friendly, teens loved the food and service is really good, even when crowded.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "heSD8DBMNMW77Eqi31I9Xg"
  },
  "8fof4B8wdYyvvZkvVdZcrg": {
    "date": "9/26/2017",
    "text": "Came back a year later and things pretty much the same. I teetered though on giving this three stars not four because the linguine with clams was very bland -- add more garlic and spices!--and the bruschetta similarly needed more garlic and flavor. What saved it was the ingredients were uniformly very fresh, whether tomatoes, arugula salad or pasta.  Place was pleasantly busy and jovial at 930 pm on a Tuesday.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JDDoGlSg0nVrqKwVbJAQMQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Linguine with clam sauce, chicken in lemon sauce and bruschetta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JDDoGlSg0nVrqKwVbJAQMQ/o.jpg"
      }
    ],
    "user_id": "OmEpzRfwZAgCS0AlDcj9Ag"
  },
  "yHOK1rWu6CQLHlMCmS7HHA": {
    "date": "3/4/2017",
    "text": "I've been in places in the Far East with far better Italian food than I had on this evening.I'll keep this short, because it isn't really necessary to focus much energy on the review.The plus here is that the service was fine, and the people quite gracious and accommodating.The food was fair, at best.As I'm want to do, regardless of where in the world I find myself, I tried the pizza. It's not terrible - it's also not very good, if that makes sense, and the picture looks far better than it actually tastes.The tricolore salad was so-so. Not sure why it's difficult to make a tasty mix of three very good individual ingredients - avocado, tomato, and mozzarella - but this is closer to 'fail' than it is 'pass'.The butter roasted potatoes were, in a word, \"pedestrian\".I won't be returning here, but I would dissuade others from trying for themselves either.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "p75cj6jnNH--685UVolndQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Butter roasted potatoes.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p75cj6jnNH--685UVolndQ/o.jpg"
      },
      {
        "img_id": "4-zsvbP4SaO_Imo-64roxg",
        "caption": "Photo of Bizzarro - London, United Kingdom. Margherita pizza. So-so, at best.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4-zsvbP4SaO_Imo-64roxg/o.jpg"
      },
      {
        "img_id": "edWZTpLJz0CfiQH98gJwGA",
        "caption": "Photo of Bizzarro - London, United Kingdom. Tricolore salad. Not worth the effort.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/edWZTpLJz0CfiQH98gJwGA/o.jpg"
      }
    ],
    "user_id": "CioDTqsG3pggmoL7y2IsLQ"
  },
  "0BBXL3cOCE_PdSaxCQHbHA": {
    "date": "5/20/2018",
    "text": "This is absolutely must-go Italian restaurant. I had outdoor seat, not only nicely dry weather but some staff entertained us by funny talks. Food was also awesome in particular calf's lever and lamb cutlets were wonderful. Italian Red wine recommended was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qGY_3RcTIQ7XBo9v4v2-NA",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qGY_3RcTIQ7XBo9v4v2-NA/o.jpg"
      },
      {
        "img_id": "Fy44cGp3tglqokH_DvkEag",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Fy44cGp3tglqokH_DvkEag/o.jpg"
      },
      {
        "img_id": "k9HresNebzCm3iYS2Zdoag",
        "caption": "Photo of Bizzarro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k9HresNebzCm3iYS2Zdoag/o.jpg"
      }
    ],
    "user_id": "OGMgJ3P6-5UHT1jHrFArdQ"
  },
  "9Bojex-uwS9lK1oDIbaAAA": {
    "date": "7/27/2018",
    "text": "Just amazing Italian cuisine down the street from Paddington station.  We walked past two other Italian places that we practically empty.  Bizzarro had a line on the street for a table.  We took that as a good sign and wow were we rewarded.  My friends had the best gnocchi she's ever had and my lasagna was to die for. Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CI74QiPkHqgBM6uauw6gtw"
  },
  "kEDeSSwpO5Ya-WJ5-43rtg": {
    "date": "7/4/2018",
    "text": "Very rude service and very mediocre food.  Our waiter was absolutely terrible.  He was rude and abrupt and paid very little attention to us.  The food was ok, but nothing special and certainly didn't overcome the service.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzVufNmcrlsTkx2LONAt6A"
  },
  "lFJ7upt4wl6Rw2ds1pWTGA": {
    "date": "11/28/2016",
    "text": "Fairly disappointingBeen here for a dinner for one as I stayed in a hotel nearby. Prices were okay but this is probably as positive as you can be. I ordered a tomato salad, which was not very tasty at all. Next was a pizza quattro stagione, which was very bland and needed quite a bit of the spicy olive oil. Apart from the food the place looks a bit tired and the decor probably has not changed since the early 80's. Not really one to recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OGEvatqHfotmn-S3Pn2ueQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Not the biggest of bills. Probably the best about the restaurant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OGEvatqHfotmn-S3Pn2ueQ/o.jpg"
      },
      {
        "img_id": "ph49uimEia3JGUj6k2hSGQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Pizza Quattro Stagione was okay-ish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ph49uimEia3JGUj6k2hSGQ/o.jpg"
      },
      {
        "img_id": "xXUQCsz8gtwEt0KmLwsf7A",
        "caption": "Photo of Bizzarro - London, United Kingdom. Place around since 1957, I guess refurbished once",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xXUQCsz8gtwEt0KmLwsf7A/o.jpg"
      }
    ],
    "user_id": "x-id3JOFXtATBJmKFvLZEA"
  },
  "d30SCXAwV8hL7dfkqpC1_A": {
    "date": "4/16/2017",
    "text": "I'm only giving this four stars because the employees were so nice to me. I ordered my food to takeaway (that's how us Europeans say it-I mean those Europeans say it :-)I ordered a pizza and Penne with Tomato & Basil. Ordering process- easy. It wasn't crowded, so they let me sit down and wait. The pizza itself was thin crust and delicious. Just like the kind I've had in Italy. The Penne with Tomato & Basil was too bland for my American taste buds. It lack flavoring in the sauce. No seasoning whatsoever. All I could think to do so I could eat it was add a  little sugar to it. I know I know, that's all I had in my hotel room.It helped. But Dang, it needed Thyme, oregano, more basil, black pepper. Something...Would I go here again, for pizza yes- not sure about anything else. Oh and you can look at the menu on their website to get an idea of prices ahead of time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "is1QDFJTd17q4Isk89EHBQ",
        "caption": "Photo of Bizzarro - London, United Kingdom. Penne with Tomato & Basil",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/is1QDFJTd17q4Isk89EHBQ/o.jpg"
      },
      {
        "img_id": "3R09v2VhCHWoZG-sdvz7KA",
        "caption": "Photo of Bizzarro - London, United Kingdom. Margherita pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3R09v2VhCHWoZG-sdvz7KA/o.jpg"
      }
    ],
    "user_id": "3hxKvqoA9XTqfkDsRPFiaw"
  },
  "FsTWzRiP6KReI_ugNWgx2g": {
    "date": "4/5/2017",
    "text": "So disappointed. Yelp steered me wrong. Went in at 5pm on a Sunday evening. Only a few tables taken.  Still slow & unwelcoming service. My friend & I had already seen menu online so had items in mind to order. Not clear if the chicken & other meat dishes were served with a side of pasta and came to find out that no they don't. So I ordered the linguini con pollo y spinaci. Not bad but needed salt. My friend ordered the gnocchi Quattro formagi. Good cheese flavor. Bread service for 1£ per person not worth it.   Cold average French bread. I'll stick with Coppa from now on",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sW6YwBkyO4LhWvhknmzog"
  },
  "hpF3ePS1XUf85895ONmKVA": {
    "date": "5/2/2018",
    "text": "We were looking for a casual place to eat at the end of our long day in London near our hotel.  Based on other reviews were weren't sure, but thought we would give it try.  We are so glad that we did!  The wait staff was great, they promptly greeted us upon entering and immediately sat us at a table.Other reviews stated that the food was lacking in taste, but our experience was completely different.  The food was fantastic, we ordered the garlic cheese bread and a spicy pepperoni pizza and the quantity of food was ample enough for two people to share.The restaurant was very busy, but the staff there was so friendly and engaging with all of their customers.  We were sitting next to group celebrating a birthday and all of the servers were engaged in helping them celebrate.  The group seemed to be having a great time, and this certainly added to our wonderful experience.With the close proximity to Paddington Station we look forward to visiting again when we are back in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Ssl6vfEn9xkM1PVPzNyqg"
  },
  "JVHr0YqXm4oef1lgU05TWA": {
    "date": "6/28/2016",
    "text": "I'm cringing as I write this, but my experience at Bizzarro was nothing less than (dare I say) bizarre. After reading some great reviews for it on yelp and walking from Notting Hill to Paddington, I was optimistic - and ravenous. We were seated very quickly at a table outside, which was cozy and really pleasant as there was a breeze.Our entrees were pretty good. The lasagna was definitely the highlight of the meal - though it was a little oily, the noodles were well-cooked and flavorful. I ordered the gnocchi as I usually do, and it was just fine. Nothing spectacular, but definitely a decent meal (especially considering the price and the fact that I didn't have to cook it myself).As we are gluttons for punishment and things that are sweet, we each ordered dessert. I had the tartufo: essentially, a few scoops of ice cream rolled in crushed hazelnuts and dusted in cocoa powder. My boyfriend had the banoffee pot: toffee and fake-banana ice cream drizzled in caramel). Both were perfectly portioned, but neither were worth the forty-minute wait.The service was extraordinarily hit or miss. After great, attentive service for the first half of our meal, things completely deteriorated and we were waiting on our dessert and the check for nearly an hour. So if you're craving a standard Italian dish and quite a bit of waiting, hit up Bizzarro.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZheGAntd67UwxViC-NaAfA",
        "caption": "Photo of Bizzarro - London, United Kingdom. Banoffee pot & tartufo.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZheGAntd67UwxViC-NaAfA/o.jpg"
      },
      {
        "img_id": "ehCvMoaEg2FsloKu65mVKg",
        "caption": "Photo of Bizzarro - London, United Kingdom. Lasagna & gnocchi.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ehCvMoaEg2FsloKu65mVKg/o.jpg"
      }
    ],
    "user_id": "MumODgS0Q4C6r5gYoIdiaA"
  },
  "QK_w9ibJIIVEdlRqxOtukA": {
    "date": "7/21/2012",
    "text": "Decent food, but the decor and atmosphere is a bit retro and cheesy. I wouldn't object to going there again but I prefer Il Gusto across the street.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Ymb2_Yc_2se2E471OzoQXQ": {
    "date": "12/12/2011",
    "text": "Service was good and very friendly, however the dish I ordered (a special, prosciutto-stuffed pasta in a pink sauce) was very meh. The pasta was cooked well, but the sauce reminded me a bit of cheese wiz. Not that cheese wiz doesn't have a place, just not in my dinner pasta. I didn't get any flavor from the dish apart from the sauce. I thought I was ordering garlic bread but it was garlic pizza crust and was just OK - glad I said no cheese. I liked the house Chianti, didn't like paying for water and bread. I would probably try this place again, ordering something not in pink sauce.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWuIimN47LqDG9nEXNiuJg"
  },
  "iA9scFR0d7mW99kbsqgqdw": {
    "date": "2/2/2009",
    "text": "What an absolute delight! The staff were amazing, the venu is lovely and the food was good. Not excellent but good - the American Hot pizza wasnt hot - jalapeno peppers were ordinary green peppers which was a little bit disappointing - the vegetarian selection wasnt amazing either but the venu and friendliness of the staff more than made up for the shortcomings in the food served. Prices given on the menu were out of date (meals were about £1-£2 more expensive than listed) and a service charge was added, which bumped the price up by a bit. But after traipsing around busy london, it was nice to have a relaxed meal. Incidentally, we also tried Garfunkles which is on the same street - while the food was better - i would choose this restaurant to Garfunkles everytime!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRBo5Pv46KtyvYlYIdo7jg"
  },
  "DyB5hPjJDnKqXFXOQPUErA": {
    "date": "7/13/2010",
    "text": "Great food, great service!! Literally the best meal we had all week on a recent trip to London. Walking distance from Paddington station, be sure to check out this gem of a restaurant!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cOkmmlZw0f-qrfEif1HgRw"
  },
  "tdDMTUJBrGk8uPBhhFPxlw": {
    "date": "9/24/2012",
    "text": "Great. We had an absolutely great dinner and great time at Bizzarro. The food was an excellent value and the wait staff made it feel like an authentic Italian experience. We had the table for the evening - no rushing... we could have stayed for a third bottle of wine!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sX9TYmid7YSLUW_-OcbfPQ"
  },
  "qaaTPzyoUyphlAIXeYzE3w": {
    "date": "7/22/2012",
    "text": "Delicious!  The lasagna was excellent, and the portion was large and filling.  We sat outside on a nice night, and it was very comfortable.  I would definitely recommend this place to anyone looking for Italian food in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INWFnCEcrjAFnoABPt7MmA"
  },
  "iGDxgLuV9e3UdxOTR3hLIA": {
    "date": "7/15/2015",
    "text": "An Italian restaurant with good prices but just-okay food.  The linguini with clams was good.  The Spaghetti Bolognese tasted okay but the amount of sauce was rather sparing.  The lasagne was so-so.  My four-cheese gnocchi was too salty.  Overall, I now understand why the maitre d' works so hard to entice passersby.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gAe_lubSSrf1ZeK5m_LYA"
  },
  "ScKnGRIH-lqDsq3JTk-d7A": {
    "date": "6/28/2014",
    "text": "Great service, great food, and pretty well-priced. Friendly waitstaff (real Italians, for what it's worth). Beer list could be better(Guinness and something yellow) but they have plenty of wines to choose from and serve it by the carafe. We had the eggplant penne and the pasta carbonara.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJUoHxSeASDPz8plngxz3Q"
  },
  "e_SEUlvcY1JsTp2h2mK3hQ": {
    "date": "6/7/2014",
    "text": "I read the reviews and just didn't think much of it but was craving Italian.  I now know what the girl meant about shouting to people on the street to come in and eat.   It's simply that good.  They have to have Italian Cooks in the Kitchen because it felt like I stepped into Sicily for a brief moment. The food transcends your senses and leaves you wondering \"how did they do that?\"  Ha!  It's just that good.  I will be eating there tomorrow one last time....it will be like meeting up with an your love one final time before going off to war. \"I love you and I'll always remember the times we shared Bizzarro.\"  I will say this  as I sip my wine stoically, heart broke,  brave, and dying.....knowing a might not make it back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnJUntjjVxnb1Q8Jibxqeg"
  },
  "fHFeS4o6wwjkNyfrxAmztQ": {
    "date": "7/15/2014",
    "text": "A cheap Italian restaurant that seems to mainly cater to tourists. Usually if there is a guy standing outside trying to get you into the restaurant, that is a sure sign that it is not a good one. However, I was on my way to my friend's and just needed to get some takeaway, so I went in. Also, most of the restaurants on this street seem to be tourist traps anyways. I ordered a pasta to go. They were nice enough to offer me table while I wait and brought over water as well. The food was actually quite decent. However, I probably will only order something basic from here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "WnXP6ARj228h7_irh3Pf9w": {
    "date": "7/4/2014",
    "text": "I was initially skeptical, thinking the restaurant was a tourist trap. After walking by this place for a month, I finally decided to stop in. I am so glad I did. First, this restaurant had many regulars. The waiters knew many by name, greeting most in Italian. Second my linguini vongole (my favorite dish) was really really good - fresh clam, tasty white wine sauce, just the right level of heat. Best linguini vongole in a long time. I am no longer skeptical and will definitely come back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzaQkK_hTnRclYk1Dls9nA"
  },
  "cPlqCgiLXoUZuqcBpYB_Fg": {
    "date": "11/11/2014",
    "text": "Great spot - came in after long flight from US and welcomed immediately by friendly staff, warm environment, and excellent food.    I ordered the linguine pollo - very good - and the caprese salad.  Close to several hotels.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NLWbUPPLD9J-xet4BqNXyg"
  },
  "0ohanSYiPN0w560if6pRqg": {
    "date": "7/29/2009",
    "text": "I came here for dinner with my 12 year old grandson. We selected it over a couple other Italian restaurants on the same block across the street, and we weren't disappointed. He had the Margherita pizza (perfect, crisp thin crust) and I had penne bolagnaise (al dente), and we thought both were excellent. We loved the interior ambiance and found the service to be quite good, if a bit breezy, in an Italian way.We would happily return here.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "9OR0X4T6JjvzLTW6-XZq8g"
  },
  "Ad-z4YHQz4TbtWMf5qpqrA": {
    "date": "12/30/2013",
    "text": "Well the service was great guys were jolly and accommodating. I ordered a mixed salad and beef lasagna had a very home made taste to it would visit here again and ain't that far from padington station which is",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok2enORZm5JzXl2i7MSK5A"
  },
  "3WoaN6U2iFFjOpIEd7yg8A": {
    "date": "11/11/2014",
    "text": "Trust me, go here!  This food is just delicious.  Not a single bad part about this restaurant!  We had an awesome set of waiters serving us head and foot.  All of the food we ordered was beyond delicious!  We randomly picked Bizzarro and it ended up being the best meal we had in all of London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mgj9RIFFkkZxxbKy8kvY3A"
  },
  "EAbhbTJvWPgkRtkuMVogww": {
    "date": "4/6/2014",
    "text": "The owners and the staff are very nice. The vino della casa rosso and veal saltimbocca were amazing. We all had great meals. My go to Italian place when I get the craving on Craven Road.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2STkaIKc_GKZs68RiFkELA"
  },
  "8kDQfBf3DzTV9lHENmYepQ": {
    "date": "7/19/2013",
    "text": "Great place for some Italian for a good price (3 people and we all loved what we ordered) the calamari is different but really nice. The prices were awesome at £5 for a pasta dish.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLdXzBYErDL6AxU9YN_cLg"
  },
  "Rvzj91-PW1p_qHbz2-3gbQ": {
    "date": "6/23/2014",
    "text": "Went here during my first trip to London. Good authentic Italian food in a great location. Nothing too special, but good if just looking for a quick but quality dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HwSqpZgithPOt3r59fVjXQ"
  },
  "Le05JVc-twJFAXCluF27Hg": {
    "date": "6/21/2015",
    "text": "Really disappointed, especially given the high scores others have given this place. Veal Parmesan was tough and served lukewarm, broccoli side dish appeared to be fresh and would probably have been pretty good if it hadn't been served cold.  The red sauce on the pasta and the veal was about what I would expect out of a jar.  Service was quick enough, but wouldn't recommend.  \"Edible\" is about the best I could say about the overall food experience.   Maybe the pizza is better?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tEzgbTu44opsd8qyPoNABA"
  },
  "7qLdefIIB1W5GRlm7dTkHQ": {
    "date": "4/24/2014",
    "text": "Visited Bizzaro 3 times on my most recent trip to London, as it was a block away from our hotel and had something on the menu everyone liked. I had dishes ranging from the pizza (thin crust), spaghetti carbonara, and a light appetizer salad which included avocado and mozzarella (delicious!)Everyone I went with multiple times was pleased with their food, they had a wide selection of seafood, pizza, pasta and appetizers and the price was very reasonable for the quality of food. While the ambiance wasn't amazing, it was comfortable although the tables were a bit packed together.The real stand out of Bizzaro though is the service. We had visited during off-hours as well as a time when the entire restaurant was packed and there was a line out the door, and we received the same outstanding level of service every time, which was unparalleled to what I usually find in restaurants today. Fabrizzio and the rest of the crew were attentive to all customers and patient under very stressful situations and never missed a beat - always delivering their service with a smile and a funny joke.I would definitely recommend if you find yourself near Paddington Station and are looking for a great Italian meal served with great service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqfQFRAD19LdEp63-3qAQw"
  },
  "fxknZC94U19M8g28wH3tkw": {
    "date": "4/22/2015",
    "text": "Seriously this restaurant must have never heard about salt. And all other spices. Everything lacked flavor. And taste. Pizza was cheap cheese and oily. Fine for a hot meal but not a tasty one.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7fb15sOH80KpHNE4KQPsw"
  },
  "teA0jU3oSPAIU1tUZPUdow": {
    "date": "3/22/2012",
    "text": "This place was amazing! I went with a few friends and not a single one of us was anything less than obsessed with the dish we got. We weren't necessarily expecting how amazing it was going to be because we literally just stumbled upon it looking for a good lunch. It was defiantly one of the more satisfying pasta dishes I've had out at a restaurant and the price was REALLY reasonable for what you get (mine was 7) The desert menu looked amazing but we didn't order anything because we were in a rush (regrettably)......  it was so good were even going back this weekend on our visit to London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bfEh-xQK-AdpNKzV68YanA"
  },
  "Br5xUIZxobCLs0OShvM8EQ": {
    "date": "6/11/2015",
    "text": "During our recent stay in London, we ate at Bizzarro's numerous times.  The food was great and the staff wonderful!  The kids LOVED the pizza and bread with cheese.  I had various spaghetti dishes all of which were excellent!  One of the waiters even \"attempted\" to show my daughter how to fold the napkins they leave on the tables.  We will definitely visit each time we are in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O7Zc_zH7r4uQcTg12nc3fw"
  },
  "j8U8sqYXUp25b-JAzOLRCg": {
    "date": "8/6/2012",
    "text": "Great food, decor reminds me of The Como in Niagara Falls NY.  The staff was welcoming and speaks primarily Italian.  They were very generous in listening to my terrible attempts to play along :)  Prices are reasonable.  They made excellent wine suggestions.  We actually visited twice we enjoyed it so much.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5BmMpDqDLGbYAvj5G1bt0A"
  },
  "Tn8RBOHdPiCYVbqxsdwpzA": {
    "date": "12/26/2011",
    "text": "I was in the Paddington area looking for a place to eat. I consulted Yelp and saw a few reviews of this place. Short walk from Paddington station and there were several Italian restaurants on the same block. We had pizza, lasagna, spaghetti bolognese and a small pizza. everything was excellent and VERY reasonable. I mean quite reasonable. The lasagna was one of the best if not the best I have eaten in my like or at least many years. I saw the comments here and this was a great find. Service was very quick and friendly. I will be back. Surprised that this place doesnt get even more attention as they have been there a while from what I can see. I miss Bizzarro, now that I am back in the USA",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "L7rq2lzuWbYmKEFRPrlZkg"
  },
  "SDZT9Sa7-YjZuhc_xX2OIA": {
    "date": "2/28/2013",
    "text": "Had dinner here after reading reviews on Yelp. Had the bruschetta to start, it was ok. Followed by the spaghetti with a seafood sauce. Good portion. Both dishes lacked depth of flavor in my opinion. Service was prompt and very friendly.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPlvRCDbmMCr5egyn_82Xg"
  }
}