{
  "6G5akBoKmxJTNNkJm1DzfQ": {
    "date": "9/23/2011",
    "text": "lovely dining experience.  service was beyond excellent.  we went with the tasting menu and wine pairings.  i was simply stuffed and barely touched the last 2 courses.  the attention to detail - whether that's changing plates, glasses and flatware, wiping the edge of plates when the garnish moved in transit, or even guiding me to the restroom (for some reason, every time i went to the the ladies room...).  and they have a few original chagall's in the bar to keep one amused over a drink.it's classy and traditional with air.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "TOZALhGS2M1Rgm90lC8bag": {
    "date": "4/28/2010",
    "text": "Went for lunch as a party of 6. They took a deposit from my card on booking, but as I am not known there & they are evidently full every day I think it fair. Easy to find, and a nice welcome with a pleasant sit & gather area, where we were offered excellent nibbles. It was immediately apparent that this is a first class place where everyone is proud to work there and dedicated to being the best. They carry on Albert's dedication. I checked the wine list and could have chosen reasonably priced(considering where you are) from the nearly all French list. Downstairs indeed to a smart and comfortable room with nicely spaced tables. We had chosen the 'set' lunch, which is excellent value, and plenty of choices with wine included and good ones to boot. We started at 1 and left at 4.15, no hurry.I won't go into the detail as other reviewers correctly describe the food as excellent, and I have to agree that I really enjoyed my choices.Service was a pleasure. I simply have to ask why I have not been before. We are spoiled for choice in London at this level though, so I'll just have to ration myself.Do go for a first class Traditional Haut Cousine experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-UnHQ1gq-4pWhxCEXx3_A"
  },
  "k9BC7qfawNWN6-L2VtNyjQ": {
    "date": "2/7/2010",
    "text": "I had my birthday meal there with my parents and oh my gosh what an epic feast we had! We opted for the tasting menu and it was wine matched and I have never felt so drunk from eating out in my whole life but it was worth it. Here is what I had and I can say that this has to be one of the most memorable meals I have ever experienced. It is worth visiting at least once in your life, but come starving and don't expect to leave early or be able to move after wards for that matter! Our Amuse Bouche consisted of a Foie Gras Mousse and the tartlet thing which definitely had a bit of blue cheese in and has an airdried ham rose thing on top. I drank this with a Kir Royale. The first course was some Foie Gras that had a gingerbread crust around the outside and some pickled walnuts and cherries. This was matched with a Sauternes which was very pleasant but a little on the rich side. The second course (and quite possibly my favorite) was the tuna tartare which was served with a Cherry beer. I thought it was crazy at first as the tuna had flavours of sesame, coriander and chilli. But if you took a mouthful of the tuna, then had a sip of the beer something really interesting with the flavors happened. The cherry with the sesame actually worked and I never thought two such things would work. The third course was some langoustines with some thinly sliced pigs trotters which looked like it had a mustardy sauce on top and then underneath it was a green puree and it was very light but nice. This was matched with a Gewurztraminer that had also been blended with something else to which I can't quite remember. But the wine was very clean tasting and did cut through the mustard in the sauce really well. They then gave us a glass of champagne as there was a slight gap in next course arriving. For the fourth course we had some sea bass with parsnips and shallots. Very very simple but was the best piece of seabass I have ever eaten. This was matched with a wine that all I remember was from south west france. (My alcohol intake at this point was a glass of champagne at a place I met my parents previously, then a kir royale now 3 glasses of wine and a glass of cherry beer...I had been drinking lots of water too) The fifth course was a cheese and onion souffle which was like eating a cheesey cloud. You could hardly get it on the spoon as it was so light and this was served with another white, I think a riesling. This course was interesting but I personally thought it was a bit of cheese overkill, given we were going to have a cheese course as part of the tasting menu anyhow! But still it was pleasant enough and was a nice follow on from the sea bass and made a good prelude to the sixth course. Sixth course was venison with some green peppercorns and cranberries and it was lovely. Really nice and cleansing to the palate after having the souffle. This came with a red wine which wasn't a malbec but had the very similar chocolately smokiness of a malbec but sat lightly on the stomach. Then came the cheese course! I ate a small amount of cheese but for me the highlight of this was that they had my absolute favorite red wine ever. It was matched with a 2002 Pomerol which was divine! My Mum couldn't finish her Pomerol so I helped. As for cheeses they were all excellent and they had a really interesting variety on there but I was starting to feel absolutely stuffed. Finally we had the dessert! Which was a very beautiful upside down caramalised apple tart. Their caramel sauce was sooooo good! The ice cream was beautiful too, very vanillery and I had a candle in mine with Happy Birthday on the plate and everyone sang it to me too. The alcohol consumed by then meant that there was no embarassment to be had anymore! Then came some petit fours, I had a toffee covered gooseberry (and by watching how drunkenly romantic my parents were getting by then) I felt that was the most apt to have!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "us0Ynq9C040hxcUoocjdkw": {
    "date": "3/16/2009",
    "text": "Sorry, can't compete with all the restaurants the previous reveiwer has visited, but this is my absolute favourite.The food is consistently brilliant, varied and exciting. The staff are \"simply the best\" and it is difficult if not impossible to see how the place could be improved.Not cheap, but then who would expect it to be?Instead of going out for mediocre meals once a week, save up and do Le Gavroche once a month. You will not be disappointed",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "NallW6SWxKc4jgStBeN79Q"
  },
  "7zIBIVNZ5uo1QbGU86D1lg": {
    "date": "8/13/2011",
    "text": "Hands down the most expensive meal my wife and I have ever had, $450, for two. We had to try it, food was excellent as was service. There was staff for everything from giving you more bread to changing your plate and fork. The head waiter, I called him Herr Mac, kept the service moving promptly, we can hear the yelling in the kitchen. Hey, if you're not passionate about your cooking, get out of the kitchen. An overall fun, interesting, experience. A place to rub elbows with members of Parliament. Food was great, but bring a fat wallet. Main reason for the 4 out of 5 rating.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5Qy_O17tZTYYShuECvME4Q"
  },
  "evlHKye_ligSNhrhiO2LFg": {
    "date": "2/16/2012",
    "text": "Le Gavroche has got to be the No.1 restaurant in London for me. Experience old school Parisian glamour and cuisine in a traditional dining room (dress up). They do have a more affordable lunch menu but go A la Carte for the best including the best cheese soufflé you will ever taste (it's an institution in itself- one big yummy, fluffy cloud). Also the rather distinguished and friendly Mr Roux may pop out of the kitchen and say bonjour (added bonus). (Monikasays.com)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0z2KVN8tGSwQDJ7uHw-g8Q": {
    "date": "8/12/2009",
    "text": "This restaurant stands out for its outstanding food and an amazing experience. We visited at lunch, where the set menu offers superb value: it includes half a bottle of wine, mineral water and coffee, while you don't miss out on extras including an amuse bouche and petits fours. I was particularly impressed that there was a choice of wines on this menu. The food is gorgeous: classical French cuisine with modern touches. Service is attentive and outstandingly good, while the surroundings are comfortable and classy (rather than light or contemporary). It's fun spotting little details like the 'gavroche' figure on cutlery handles and the cutlery sculptures on each table. Altogether, a lovely experience and at lunch, one offering excellent value. I'm now tempted to return for dinner",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qIXJBbx8liwhjuWKc6KyFw": {
    "date": "9/23/2011",
    "text": "Thanks for the wonderfull evening we enjoy it very much and come back soon",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0mQ-jFMZW14gERtn9Mai6Q": {
    "date": "11/21/2008",
    "text": "You often hear that you get what you pay for and, in the case of Le Gavroche, this is an absolute certainty. You will pay a lot of money to eat here. No, you will pay one hell of a lot of money to eat here. Forget it though, because you may only ever get one chance in life to enjoy what must be the ultimate dining experience. From the elegantly understated dining room, to the silence of the waiting staff as they glide from table to table with un-erring skill and patience to, of course, probably the best food you have ever eaten in your entire life. From entrance to exit, your time in Le Gavroche will be something that lives with you forever. Inside, you will be able to chuckle politely as other folks rave about their fine dining experiences - for you know, that you have dined at the finest.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JD5sVV3sARkuaHupEfGfSw"
  },
  "qcqrd_xpTlUQG1mqhHC-Ew": {
    "date": "5/2/2011",
    "text": "Traditional french food at its very best! Make sure you have an empty stomach before coming here too. You'll find all the traditional french dishes here, and cooked at its very best.The best cheese souffle, langoustine gratin, mmm and the cheese trolley! I was bursting by the time we got to the cheese trolley. I would add another star as my fiance proposed to me here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOoFZlv2kDLyHBJ4nneWnA"
  },
  "jeG9VznJuu7bgkpmZg1b7Q": {
    "date": "8/20/2008",
    "text": "Forget The Ivy, where all the celebrities swarm and where people go to be 'seen', the real foodies go to Le Gavroche, a much more understated establishment in Mayfair renowned for its incredible food and service. It has to be said that Le Gavroche offers a unique dining experience for the uninitiated; you walk into a slightly dimly-lit basement, someone will pull out your chair for you and shake your napkin into your lap. You are treated like royalty (and you should be for the price). The French art of waiting is revived here, as the waiters take pride in their work, knowledge and appearance and are incredibly charming, and can even be cajoled into singing happy birthday on occasion (I was the lucky one!) The food defies description. I tried the milk-fed lamb from the Pyrenées back in January, and the August before I'd tried the ginger scallops; both were without a doubt the most amazing thing I'd ever tasted. Moreover, between courses (and to make it all the more special), you are plied with little amuse-bouches, tiny little morsels which only whet your appetite. This restaurant is without a doubt one of the best, and is for those who actually want good food, not food hyped up by glitz and glamour. However, gentlemen be warned - you still need a jacket; there's no slacking here.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hcYtkGPfksuvljtb7e3PHQ": {
    "date": "8/16/2009",
    "text": "My boyfriend surprised me with dinner here and I was blown away. Everything was perfect. A jaw dropping menu accompanied by a wine bible. The staff we're absolutely amazing and made the evening flawless. The only way to best describe the food would be to book yourself a table. Being a perfect gentleman my boyfriend never disclosed the expense of the evening. It's definitely not dining you do regularly if you are mere mortal, but totally worth every penny.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QQM6jv7CoAEb71wW8Qvi2Q"
  },
  "XYKi9xx9jfsrlRfzanhQAw": {
    "date": "9/16/2010",
    "text": "I have wanted to go to this place for many years and got the chance this week. The whole jacket thing is a little old-fashioned now but this was the only fault I could find. The food was absolutely excellent. Classic French Michelin Star food at its best. The setting is extremely elegant and the service superb. Unfortunately it is not somewhere I can afford to eat to often but would recommend pushing the boat out and giving it a try.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7cfwakVqWTchfIAyIoDBaQ": {
    "date": "3/17/2012",
    "text": "I was here a while ago. the service/waiter was very good. very very good choice of red wine from the sommelier. amazing dessert. but the starter and the main course, was at that time rather standard or lets say pretty classical. i prefer more the creative kitchen",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gmddV3TUsS83cNBjUodZvw": {
    "date": "9/19/2010",
    "text": "treat your taste buds to an orgasmic experience, Le Gavroche is simply the best, the decor is quirky, the service is impeccable, the waiters were extremely attentive, i had the cheese souffle as the entree and the garlic lobster for main with matching wines ... it is certainly one of the best places i've dinned in.... highly recommended, it's not cheap but you get what you pay for!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QBIvYP0z0OMDzHlI3pLz_g"
  },
  "H4jBfi-qDVoP5fSrvhhnDg": {
    "date": "11/25/2008",
    "text": "There is no doubt that this is a pricey restaurant but the lunch menu is fantastic value (three courses plus half a bottle of wine per person plus mineral water) for the quality of the whole dining experience. We were a little unlucky with a table right near the kitchen exit (I suspect only regulars get the good tables!) and fortunately had been forewarned about the dress code for gents. I can't actually remember what I ordered as the whole experience merged into one gastronomic delight. The very attentive service was impressive but I found it irritating to have only taken a sip of wine and someone was over to pour some more out!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mHqvqIqttUFgtzUvwVkbXA": {
    "date": "11/17/2008",
    "text": "I refuse to believe there is a better restaurant than this in London. The food is simply stunnign and the staff are attentive wihtout being overly nice. As soon as you walk in you feel as if you're being ushered into a bygone world of haute cuisine and you really are. hte menu has some modern, Asian touches - a bit of sesame here some miso there - but Michel ROux JR is such a good chef that it relly doesnt matter what he puts on the plate it will all tast amazing. the petits fours at the end of the meal were so good they made me want to start all over again. You simply have to save up and try this place. Despite being in a basement it's the closest you get to heaven.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ekLEH8Jp-YG8vSeZXXNevw": {
    "date": "11/15/2008",
    "text": "I have been visiting this restaurant regularly over the years and to me although I am in a similar trade it is by far the best place I have ever experienced. It is consistently excellent and has always exceeded my expectations. I would thoroughly recommend it to all.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-hY36_oekIDCkbMLtrA-Zw": {
    "date": "6/27/2007",
    "text": "This has to be the number one restaurant in London!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Q8vQHMec2atB7f-BI1cCsQ": {
    "date": "3/25/2013",
    "text": "Some of the best service I have ever encountered at any restaurant.  Overall this place is amazing.  The ambiance is not what you'd expect from a 2 star Michelin restaurant in terms of lavishness like in Las Vegas.  Instead this place is all about the details. From the silverware, to the glasses, to cheese presentation. Everything here is 5 stars.  We did the tasting menu here and it was the only way to go.  You'll get to see what the world reclaimed chef can really do through the numerous courses.  We also went with a half bottle of white, cointreau viognier,  which AMAZING and a French Paulliac for dinner.  The wine list here is vast and the somiller was more than happy to help us and keep us in reasonable price range.  This place is a special treat, don't take it for granted.  You could also be like me and forget to wear a jacket (they are required), but don't worry they will provide one for you with the a  \"La Gavroche\" stitching on the front to insure that everyone will know that you were the rookie that forgot to wear one! oops!I'll be back!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "smcntJvBuWr_J_NhlSyHeA"
  },
  "S9P6xI9LoCFEax69IjxPCQ": {
    "date": "7/5/2012",
    "text": "I would counsel only one warning about this place which is that if you do go with the tasting menu at least one of the courses won't be any where near as good as the others ...I still order the tasting menu most of the time and one day I hope not to be reminded of my own rule about this place ...",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "e6gCLjdMQZjcjFukNuZtxg"
  },
  "tb2mSwA8C_WBH71SMP_OJQ": {
    "date": "2/23/2012",
    "text": "Wow, it actually feels pretty intimidating to review Le Gavroche. Is my prose sufficiently eloquent to do justice to a restaurant which has led the way in London fine dining over the last 45 (yes, forty five) years.From the outside, the restaurant looks like a (very) nice house and if you didn't know what you were looking for you might miss it, especially in the day when it is not lit up. The restaurant itself is partially underground which could feel a little claustrophobic. Instead it feels warm and relatively relaxed for a place where gentlemen are asked to wear a jacket. However, it is still pretty traditional. For example, in addition to needing to wear a jacket, if you come here (as a man) with a female date they won't see the price of the dishes on the menu - that sharp intake of breath is reserved for men only! A bit quirky but quite fun if you don't take it too seriously.The food is why you come here. Classic French dishes delivered faultlessly. However wine lovers will have much to enjoy as well. A list which is bigger than many books awaits your perusal with expert guidance (thankfully) on hand to provide welcome recommendations if needed. So, to the food. The stand out dish that I have had is the Soufflé Suissesse. This is a cheese souffle which is baked with double cream. No doubt this is horrifically bad for the diner's long term health. However, it tastes light and delicious. It is a dish that has stood the test of time, featuring on the a la carte menu for many many years.   Almost all the food is served under cloches which results in some fab 'ceremonial' cloche lifting at the start of every course - super theatrical.Finally, it is worth mentioning that although the a la carte menu is expensive, the midweek lunch menu represents excellent value and allows Le Gavroche to be experienced at a very reasonable cost (£51 per person including wine and coffee). You might even get to meet Michel Roux Jr!",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "sXcEvJHocUnXLGl0xILYgw"
  },
  "tU6kIyGUMJFoywpfvLqDGw": {
    "date": "10/29/2012",
    "text": "I came here for the famous Gavroche set lunch menu.  Everything was very impressive---the service, the food, the silverware ;) haha.  Michel Roux Jr. even came out to say hello to us, which was a pleasant surprise!Classic french cuisine.  Clientele was pretty old and stuffy (as was the interior decoration) but who else would you expect to be having a 3-hour tasting lunch on a Wednesday? The only thing preventing me from giving a 5 star rating is that none of the dishes really made a strong impression on me.  Don't get me wrong, the food was delicious and really very well executed, but I guess nothing was particularly inventive?  Perhaps it is the nature of the lunch.... I will have to find an opportunity to come back for the dinner tasting menu.....",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vUimuuObOODnXe614ViuAw"
  },
  "g8MoQdJ0LbG1dsZ8YTooSA": {
    "date": "10/11/2011",
    "text": "Blew. me. away.  Completely and utterly.  My husband and I were lucky enough to eat at Le Gavroche, courtesy of my dad who kindly bought some vouchers for my hubby's birthday present (and of course, it was a birthday present for two!).  It was the perfect meal. From the moment we arrived, the service was impeccable (and not overbearing at all).  The main dining floor is downstairs (which means really rubbish mobile reception, and consequently, no annoyingly loud phone conversations).  Even the cutlery has been designed specially for Le Gavroche (cute little soldier and jester handles).  We had the tasting menu, which means you get to try 5-6 (or more, I sort of lost count...) dishes.  The standout dish for me was langoustine and snail dish - really, really amazing.  You have to taste it to believe it! The main course is a beef dish, which is served at the side of the table and placed very delicately and precisely onto your plate. (I've since been told that the signature dish is the chocolate fondant, which we didn't have.  And now I have the perfect excuse to come back! I hope my husband is reading this...)I have to say, we were very starstruck.  I spotted Michel Roux Jr coming in and out of the kitchen 3-4 times (but my husband kept missing him!).  At the end of the meal, Michel Roux Jr himself, came round and personally spoke to every table - thanking them for coming, asking if they had enjoyed my meal, which was a lovely touch and completely made our evening.  Unfortunately, like I said, we were very starstruck and could barely make out the words \"It was a really yummy meal\"... But we honestly meant every word!!!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "bof36DzRtPknHxP_CNTJ2A"
  },
  "RQl9LZu4eVzjbi-oEYj3lg": {
    "date": "9/3/2012",
    "text": "Outstanding.  Everything from the food to the service was just top notch.  And you would expect so cause you're paying a fair bit for it.  We had the tasting menu with matching wine and can honestly say that we were legless by the end of the night.The food was amazing and that cheese cart... it was like I died and went to smelly heaven.  AH-MAZING!!!My only gripe is the jacket dress policy for men.  A bit unnecessary.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "OBvSTh3sFvHGHHGt1TPnfA": {
    "date": "2/4/2010",
    "text": "Yes.  Classic evening, everything is done seamlessly and the staff could not be more accommodating.Be prepared to bring your black AmEx b/c this level of culinarily lusciousness is not without its price, but if you're in London and looking for an exquisite, yet also comfortable, dining experience, Le Gavroche will not disappoint.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2setZ2_pKZ9CWEb0IgrOQ"
  },
  "EhwFx8DskgVoSfnUMLkLSA": {
    "date": "1/14/2014",
    "text": "Definitely one of the best meals I've had in my entire life! Everything we had was amazing from the lobster mousse with caviar starter to dessert. The foie gras was silky and smooth, the beef with bone marrow was incredible and all of the dishes were so beautiful to look at. We were hoping that this restaurant really was as good as the hype and we were not disappointed.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-RTI11qfiCjfnpsUxSG5vQ"
  },
  "BqvbZT3CPwwrhLGmsGX79g": {
    "date": "1/26/2009",
    "text": "Visiting London this past September, my family and I wanted to experience a wonderful meal which led us to Le Gavroche. This historic, Michelin 2-star restaurant was first opened by Michel and Albert Roux and now Albert's son, Michel Jr. runs the kitchen with mastery. The restaurant is very elegant and traditional in its decor. The color green is the dominant color I have to say. Service is sublime in that every server is attentive to the utmost detail. Now onto the food, in which we had the Menu Exceptionnel.-Lobster Salad w/ Mango, Avocado, Basil, and Lime: Deliciously light and refreshing. The flavors of the dish were bright and vibrant. I enjoyed the tender piece of lobster tail meat seated atop a piece of endive accompanied by small dice of sweet mango and buttery avocado. Definitely a winner.-Souffle Suissesse: One of the classic dishes of Le Gavroche. It's light, airy, cheesy, and temperature-wise definitely hot so be careful. The cream sauce that the souffle is sitting in makes you feel like perhaps you should see a cardiologist afterwards. Sinfully good.-Grilled Diver Caught Scallop, Spicy Aubergine, Fennel Pollen, and Parsley Coulis: Scallop was carefully grilled and therefore juicy and tender. The aubergine aka eggplant was OK only because I'm not a big fan of eggplant. Parsley coulis didn't really add much to the dish.-Hot Duck Foie Gras w/ Grapes and Crispy Duck Pancake Flavored w/ Cinnamon: The duck foie gras was luxurious. I love foie gras and it was seared perfectly. The crispy duck pancake was a bit odd as it was a savory dish that felt like a dessert. A bit too much cinnamon and sweetness for my taste.-Tender Braised Beef in Red Wine, Parsnip Puree, Cepes Mushrooms and Bacon: A very comforting dish that similar to good ol' meat and potatoes. The beef was melt-in-your-mouth tender and just fell apart when you cut it with your fork. The red wine sauce was hearty and the parsnip puree was a nice twist on the mashed potatoes component. And huge chunks of bacon. Everything is exponentially better with bacon.-Selection of French and British Farmhouse Cheeses: I had a few slivers of cheese but was not a big fan. Not because they weren't great but because I'm not a connoisseur of fine cheeses.-Rich Amedei Chocolate Truffle Scented w/ Rum and Praline Crisp: Decadent and rich chocolate in a small cylindrical shape. And yes you can taste a bit of rum in there. Praline crisp was so-so. It added a nice textural component to the dessert.-Classic Upside Down Caramelized Apple Tarte w/ Vanilla Ice Cream: This dessert I was too big a fan of. The top part was slightly over-caramelized and therefore mildly burnt-tasting. The crust was too chewy and hard to cut with my spoon. The vanilla ice cream was good though but overall nothing spectacular about this dessert.We were seated across from the automatic sliding glass door in which staff would enter and exit the kitchen. As I was having my coffee, I see the door open and Michel Roux Jr. coming out like as if exiting his spaceship into the dining area. At the beginning of the meal, we had asked our maitre d' if he could sign a copy of the menu that was on our table. He then came to our table and greeted us and asked how our meal was. Then he signed our menu and he even graciously agreed to have a couple pictures taken with us. Overall, it was a great experience with classical French food. It's not a place where you'll find innovative dishes but it sticks to what it knows and what dishes have stood through the test of time. For 3 people it came out to £340 or about $600. A wonderful meal and a nice way to end our stay in London.",
    "rating": 4.0,
    "rated": {
      "useful": 11,
      "funny": 9,
      "cool": 8
    },
    "photos": [],
    "user_id": "V0Kg9fkgfoCNvYpNJcv0Ng"
  },
  "cU63lRFMtBFPEN4SCjSZ8g": {
    "date": "7/2/2013",
    "text": "Possibly the biggest Yelp let-down of my life. I purposefully didn't write this review immediately because I wanted to compare Le Gavroche to some other restaurants in London first. The problems began because the reservations lady misinformed me as to when they would stop serving the tasting menu. This was supposed to be our first and nicest dinner during our London trip, and I got into an argument with the snooty and obnoxious maitre d' as to what had happened. They did end up serving us the food, but this made for a very unpleasant beginning to the evening, and I honestly felt bad for the other staff who was clearly embarrassed by the MD's behavior.I am only giving this three stars instead of two because of the extremely friendly and competent demeanor of some of the staff, such as the two female sommeliers and the young man in charge of the cheese tray and other matters. I say this because not only was the maitre d' unpleasant, but the food was not up to snuff for a place of this caliber. Many of the dishes were boring and some over-salted for my taste. I liked the seafood appetizer and various elements here and there, but when even your foie gras is mediocre, something is wrong.I am really torn about writing this review because I suspect many staff members, including cooks, worked hard on our meal and had to deal with the aftermath of the reservation lady's mistake and MD's attitude. But at the end of the day, you can't charge these prices unless your food is impeccable. Dinner by Heston Blumenthal in London can pull it off, as can Bouley in NYC. These guys, not so much.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M3g2meevFv7mIxT_JgilxQ"
  },
  "0jI8prtZYOsR6ucwqV9oyw": {
    "date": "6/3/2013",
    "text": "Le Gavroche is going to replace my current favorite \"last meal on earth\". The food is fabulous and the service is impeccable. My current favorite French restaurant in the world.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3XYQu__xCRO1CYVVCQC69Q"
  },
  "zPOf5PuCDzIjkkZf0Htplg": {
    "date": "7/29/2009",
    "text": "I wish that I liked Le Gavroche more. It's a 'proper' restaurant with superb service and highly accomplished cooking, but.somehow the whole thing's a bit corporate; a bit dull and disappointing compared to the many French places that have much more elan. It's in nondescript block in Mayfair with a door that might harbour a hedge fund and there's a cramped reception desk where you and others arrivals will huddle uncomfortably before being moved into the bar - a nice bar but nothing special. But instead of being taken on into a bright, beautiful and interesting room (think the River Cafe, though the chairs are better here), you go down into a dark, green basement that feels as though it might be the home of mermaids. I went in telling my companions that I was looking forward to tasting a superb 'reduction' sauce - which is really where French classical cooking stands out - but the waiter barely paused at my question before suggesting a salad. Even the dish that we eventually settled on - warm fois gras - was poorly sauced and the accompanying duck pancake almost too small to taste. The troncon de turbot was so-so - a far better one can be had at the Poisonnerie. But assiette du chef - the selection of patisserie - was justly feted, and spoons appeared as if by magic from all over the table heedless of the risk of contracting fell disease, to feast on it. The restaurant was full - despite the £120 a head bill - which suggests that in such places 'recession' is a relative term. But it'll be another decade before I forget my disappointment and try again",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_oo0FStj8gM3r27jgsz6Aw",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_oo0FStj8gM3r27jgsz6Aw/o.jpg"
      }
    ],
    "user_id": "2fEE3xEhaRhC2qWnip4Aqw"
  },
  "AXSEt-tHNSyR7dSawvs8ZQ": {
    "date": "12/16/2008",
    "text": "Yesterday I experienced heaven. For just over 3 hours, I sat in complete and utter bliss and witnessed the most exquisite service I have ever seen.The service is so incredibly perfect that you don't even notice it happening. The waiters are so smooth and so seemless that you are never left wanting for anything- I have never experienced anything like it before. My glass was constantly full, though I never noticed it being filled and our napkins was always beautifully arranged when we came back from the bathroom, though no-one ever saw who did it. To make things even more perfect, Michel Roux came over TWICE to see if we were enjoying our meal (we were more than enjoying it)The menu is incredible but because my French is quite poor, the waiter was very helpful and pleased to take me through the menu and explain it throroughly (and he didn't make me feel embarassed for asking) The food was perfect. I had a shellfish soup to start with lobster, prawns,scallops and I think snails (though I am not entirely sure) and a game pie with artichoke hearts for a main course.  The dessert selection was wonderful- I picked from a large trolley of sorbets and homemade ice creams, whilst my boyfriend had a rich chocolate log. We were both very impressed with the amount of extra bits we both got- two types of amuse bouches and a large plate of some delicious petit fours. La Gavroche is without doubt the best restaurant in London.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Eg8s97W0LtNqQsaM2vK_wA",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Eg8s97W0LtNqQsaM2vK_wA/o.jpg"
      }
    ],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "cquaOdgrzN4I5kX-D8py_g": {
    "date": "6/25/2010",
    "text": "Ah, Le Gavroche, let me count the ways I love thee!Your unbelievable canapés and amuse bouche.The excellent (and reasonably-priced) house Champagne.The elegant and not overly-stuffy decor - especially the beautiful sculptures made from silver cutlery.Your unrivalled wine list, both for its sheer depth as well as the expertise from the sommelier which supports it.The cheese soufflé - I have to take a change of underwear every time I eat it.The otherwise flawlessly executed haute cuisine which doesn't suffer from being overly ambitious or fussy.Your impeccable level of service, from lowliest busboy to Maitre d', everyone is unceasingly professional and attentive.The Omelette Rothschild /sighs longingly.Getting to have brief chat with Michel Jr. every time I am there (and apparently the ability to see the kitchen if you ask nicely).Your superbly priced fixed lunch menu.Deeply tempted to write a 3000-word poem about how wonderful Le Gavroche is, but a concise summary should convey the same thing, without wasting all the time that you should spend leaping to the nearest telephone in order to make a reservation. Everything here is at the top of its game, from front of house and waiters to chefs and buyers.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "jmZw98KuIqvp8NNaTZJDuA"
  },
  "YBbkOoUVn1kx98qhAxkt3w": {
    "date": "12/18/2008",
    "text": "I have only eaten in this wonderful French restaurant once and as you would expect from a two starred Michelin rated restaurant is was a magical experience. From memory it is remarkably small inside which means that it feels very cosy and exclusive. Wonderfully elegant with all the right things in the right places you really will get a sense of grandeur and feel very special to be in such surroundings. The food is too die for and the wine simply exquisite. Now you would imagine that a place like this has to be expensive and it can be. That said you can choose from a fixed price menu, a seven course fixed price menu or go for the full blown a'la carte. Then seven course meal was £95 which whilst that sounds expensive it is exceptional value for money to experience such food from such a chef in such a setting. If you want the best in London, this has to be right up there.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-6L6Klk3Ei44yKAQFhnn7Q",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-6L6Klk3Ei44yKAQFhnn7Q/o.jpg"
      }
    ],
    "user_id": "mQkBnWxkYKAShYr_spk64w"
  },
  "v2WAUPp4ga-EKn8n3i3_vQ": {
    "date": "2/21/2012",
    "text": "I have to agree with reviewers - it's traditional french food at its very best! Excellent service, timing, attention to detail, plating, presentation... and sublime cooking at it's very best. Grab your platinum card or check your credit limit in advance.",
    "rating": 4.0,
    "rated": {
      "useful": 8,
      "funny": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "2MwAOz04jJk83ZMKGHfo6A"
  },
  "twxcQa0pkWrfCOD1y8eiUQ": {
    "date": "1/4/2013",
    "text": "My husband and I went to Le Gavroche for our anniversary dinner and needless to say, it was brilliant. We got the later sitting at 9:30pm and although it was a tad bit late for such heavy food, we still enjoyed it. We didn't do the set menu but decided to order off the a la carte menu instead. The food was fantastic. We had lobster, cheese soufflé, crab and more lobster. It was very heavy, dominated by cream and butter, but of course very delicious. For dessert, we had a caramelized pears in filo pastry, which was, by far one of the better desserts I have ever eaten. Highly recommended! All in all, it was a brilliant experience. The cherry on the cake was of course meeting Michel Roux Jr. himself who came by the table to exchange a few words!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DsYpzl_nr1wazM1syAnjkw"
  },
  "sBRbGGfVi67JZGUmYd3qYA": {
    "date": "4/13/2010",
    "text": "Booking Le Gavroche made me feel like Patrick Bateman trying to get a reservation at Dorsia. I think Michel Roux Jnr's popularity yo-yo's like the stock market depending on the relative recency of professional Masterchef, and I stupidly tried to book immediately after the last series. (Maybe turning off my chainsaw before I called might not have scared the Maitre'd so much).Nonetheless, I succeeded last week and six of us dined for lunch, taking advantage of the extremely reasonable £48 set menu. A starter of Venison carpaccio and spring salad was tasty but dull, prompting immediate food envy upon the arrival of somebody's poached pike in lobster sauce. A main of lamb offal however, was a delight, with delicately grilled tongue, fried sweetbreads and kidneys. To finish, a child-like delve into an extensive cheese board capped off a superb meal.Spring water and a 1/2 bottle of wine are included in the price, as is all the pomp and necessity one would expect from such an old-school French establishment. Don't forget your dinner jacket gents and enjoy watching the 40-strong waiting staff navigate their way around the room without crashing into one another...although you'll have your fingers crossed the whole time that they do!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "Im-a2j8pJA4s7gp1YxbDPA"
  },
  "ptd_7EuVPWMxyqVkP4m7uQ": {
    "date": "5/3/2014",
    "text": "The most disappointed Michelin restaurant I had. The meal is only available on the lower ground floor. I came over for dinner and chose the scallop , John Dory and soufflé. The taste of scallop is too light. It was just like the chef put all the source above the food instead of cooking it. On the other hand, the same problem with John Dory. Food just tastes like NORMAL and COMMON.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8jdKNMWv3yO83-ZV4C-vA"
  },
  "H635TTcDeaQFctlS_mjgPA": {
    "date": "6/21/2011",
    "text": "The best food I have had anywhere in the world. Even in comparison to somewhere like Le Manoir this place is on another level. It's not too stuffy, but still formal. The food is high quality and technical, but still fun. The food is light but you leave satisfied. It is very expensive and very good value for money.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Dnv0Uehb8dsS2I0hTQi4Qw": {
    "date": "6/13/2018",
    "text": "Last night was my third visit to Le Gavroche over a 20+ year period.Each time the service was impeccable and the food was exceptional.We always do the tasting menu to see what they have concocted and to try the wine pairings. We have never been disappointed for even a single course.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bOCTBNuOQMdUalENivcZUg"
  },
  "1dsy7xBqOrCSCHMj1hBVkw": {
    "date": "8/21/2018",
    "text": "Unfortunately it felt more like a hugely overpriced brasserie rather than a 2-Michelin starred restaurant. Not a single cooked dish from so called 'exceptional' tasting menu had a wow-factor, apart from the cheeseboard (which I must say was very impressive).Very dated, tired interior, dark and unwelcoming.Service was just okay, didn't make the dinner feel special, definitely not personal for such calibre restaurant.Overall, quite a disappointing experience considering it took over 2 years to make a booking over an old-fashioned form-based reservation \"system\".I've been to quite a few Roux's restaurants in London. I'd rather recommend 'Roux at Parliament Square' - very pleasant, delicious meal with great value for money. Even Roux's stall at Taste of London summer festival at Regent's Park was way more exciting.For special occasions, better visit L'enclume by Simon Rogan in Cartmel (or his restaurants La Fera and Roganic in London), Le Manoir by Raymond Blanc in Oxfordshire, or Sat Bains in Nottingham - these are really worth a detour.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-5lPn82WmjzkfwR_hBy6Q"
  },
  "SDnWz8PzRgAMqw4TpoA5oA": {
    "date": "10/18/2017",
    "text": "I am quite shocked that a meal at Le Gavroche could be so mediocre. I was really excited to come here, having been recommended to come here (by someone I don't know well) and seeing all the great reviews. The venue seemed alright, the lighting was a bit dim for my taste, but it was nice. The service was lovely and I really do enjoy the pride they take in serving the meal. No food was served for any course until each of us had a waiter standing next to us holding our food, so that they could serve us all at the same time. Little details like that stand out, and I especially enjoyed the dishes served with a flourish by showing me a gorgeous silver covered dish and them removing it to present the food like a show. Even the gelato dessert was served well; a trolley with silver domes holding different ice cream flavours was rolled to us and the waitress asked what flavour was wanted, scooping out each flavour one by one into a plate.  But that doesn't change the fact that the gelato was extremely mediocre. I could hardly bring myself to eat any of it, it was mostly too tart and not tasty in any way. The best dish I had was my scallop appetiser, which while decent, certainly doesn't deserve to be especially remembered in any way. The rack of lamb I ordered was difficult to eat; I was sawing away at it with my knife trying to get a piece at least.  It wasn't tasty in any way and was too chewy. I went with three other people, and every single one of us was taken aback by the lack of any particular merit to any of our dishes. We couldn't even say that we had liked one thing, and we all ordered different appetisers and mains, so I don't think the problem was just particular to me. Mostly we just felt terrible that we had spent far more on this meal than on any other in London, but we had enjoyed it the absolute least. It was also a special occasion and made it difficult to enjoy the birthday, with the excitement and expectation we had arrived with. I would certainly never come back to spend this much money for something so subpar and can get much tastier food elsewhere in London. I wish the food had been as good as the service.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dAz5UoYBrv5cZZzwO1db_Q",
        "caption": "Photo of Le Gavroche - London, United Kingdom. It's fun when they remove it with a flourish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dAz5UoYBrv5cZZzwO1db_Q/o.jpg"
      },
      {
        "img_id": "FeC_zZExooecKuOe1CE2VQ",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Presentation",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FeC_zZExooecKuOe1CE2VQ/o.jpg"
      },
      {
        "img_id": "y6LkqHKEkdvVvJWQIg8Jkw",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Scallops - I think Coquille St Jacques",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y6LkqHKEkdvVvJWQIg8Jkw/o.jpg"
      }
    ],
    "user_id": "PWOk9EXCeuwHAayusD8oXQ"
  },
  "sNUkVI7V2RMJ-KfcIK4Yng": {
    "date": "6/20/2018",
    "text": "One of the most extraordinary dinners I've had. The combination of atmosphere, food, wine, and service was unimaginable. This is my second visit here and the quality is consistent with the first.  The staff is very orderly but also friendly.  It's proper but you can still have fun and joke with the staff. Highly recommended when you are in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Q-K_9pc5JxtawAoORBp2g"
  },
  "HcWXPDtxgKK25xwQBftuVQ": {
    "date": "5/19/2018",
    "text": "Such a disappointing dining experience. Subpar food, wine pairing was off, took ages to have courses brought out...just awful. There are better places to go than this tourist trap.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgvTxem9zYf3oE_QHKbBmQ"
  },
  "yF13oIecz4rQiKzZHpnt3Q": {
    "date": "2/11/2018",
    "text": "Usually, I never write Yelp reviews but I felt so strongly (negative) about this experience that I felt I needed to write this up.Traveling for my first time to London for the sole purpose of food, I was was looking forward to dining at Le Gavroche after reading a few articles about the restaurant and having our hotel recommend them as they were only a few blocks away and I was looking specifically for French cuisine.I reserved for a romantic date night meant for an early Valentine's Day celebration for my boyfriend and I, and went for the tasting menu with the wine pairings. Right when we were first seated at our table, we were already made to feel quite uncomfortable for being tourists and non-French speaking (we are Asian-American and dressed nicely according to their dress code). I even noticed that the servers seemed to be rudely and openly mocking us, trying to imitate our \"American accent.\" I did not want that to be ruining my overall judgement of their food, however, and went on with the meal. I notified them that I was very allergic to lamb and I am slightly lactose intolerant.. but it seemed like they customized my courses to where there was absolutely no meat, and every plate that was supposed to have meat was replaced with vegetables. The wine pairings were also not explained in-depth and when I tried to ask, it seemed like they took offense that I was questioning their pairing selections.Overall, I would definitely not return to this restaurant based on the price we paid for the service/food we received. I left with a poor taste in my mouth and saddened that I was treated differently as a paying customer just because I was not a London native.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n5xaoD0WnmZPtAcV0QAhyA"
  },
  "WgOyfTJIChqORgP8HqznKQ": {
    "date": "12/23/2017",
    "text": "Excellent food and service!  I had the tasting menu. I really enjoyed the three hour experience that included meeting and conversing with Michel Roux. The servers were helpful and had great sense of humor. So well coordinated was the dinner. I was impressed by the lady who managed the cheese cart. She made delicious recommendations.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F_Ipv2o0dD1tK4hutD-_jA",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F_Ipv2o0dD1tK4hutD-_jA/o.jpg"
      }
    ],
    "user_id": "2w7eaFen5cozjX84h4-9kg"
  },
  "TSNklgoBps8dDznfgY07lg": {
    "date": "12/19/2015",
    "text": "Truly one of my best experiences at a deservedly three (but only awarded two in recent times) star Michelin restaurant in London. Classical French cuisine at its best. We had the Tasting Menu and was truly delighted with every dish that was served up. Le Gavroche may have one of the best wine cellars in London with bottles ranging up to £20,000 but we can also have decent bottles of wines from £50. We selected the Gigondas 2011 from Rhone which went really well with the partridge main course. Excellent service and Michel Roux Jr came round twice to say hello, which truly made our day. An unforgettable evening made splendid by the warm welcome we received!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cqctzNmpuFCg16jAlYEYfA",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Cheese trolley",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cqctzNmpuFCg16jAlYEYfA/o.jpg"
      },
      {
        "img_id": "0yynNVXvN7B53kx7fIG59Q",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Roast partridge",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0yynNVXvN7B53kx7fIG59Q/o.jpg"
      },
      {
        "img_id": "ACVERYeGI1VsG_ZFoK-s8A",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Stone bass",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ACVERYeGI1VsG_ZFoK-s8A/o.jpg"
      }
    ],
    "user_id": "ky_D495gGOHkt1LmqaKreA"
  },
  "FD-LvJ6Hnt753MXt2Eu5ew": {
    "date": "6/29/2016",
    "text": "My Le Gavroche experience was one of three fancy tasting-menu dinners I got to try while I was in London for three weeks -- the other two being Maze (the Asian side, not the grill) and Alain Ducasse at The Dorchester.  Le Gavroche was, hands down, my favorite.  Absolutely no contest.I had been unable to get a reservation to Le Gavroche because I was travelling on very short notice, so I requested to be put on a waiting list, and, happily, was taken off the wait-list the morning of my visit.  (As an aside, my entire series of interactions with the reservation staff was excellent.)Because I was travelling alone, I also was dining alone.  That can often be awkward, and sometimes a restaurant doesn't quite know what to do with you (reactions range from pitying looks, to offers of a book, to being seated in a corner and facing the corner).  But, unsurprisingly, the staff at Le Gavroche made me feel exceptionally welcome (and not at all pitied for being out by myself!).I ordered the tasting menu, which was, as expected, spectacular.  It started with their famous cheese soufflé (which was truly epic, and something that should be on your bucket list!).  Next was a roast scallop dish with carrot and chartreuse - my favorite dish of the night.  Third was a stone bass with a fennel coulis.  Fourth was a pigs' head terrine with snails - so wonderful.  The main course was a roast squab, which was followed by a selection of cheeses, pistachio cake, and petit fours.  Everything was delightful, and the staff was so helpful and attentive.The wine pairings were also fantastic, and every wine was carefully explained.  Also, if you order the tasting menu, you are given a small version of it to keep (which is very nice, seeing as it is hard to remember details of what you ate and drank... particularly vintners and vintages).The cheese course was simultaneously overwhelming (in a positive way) and awesome - I was presented with a large rolling table with no less than 40 or 50 different kinds of cheese which I could choose from.  Thankfully, the staff helped me make my selections, as, by this time, I had drunk a fair bit of wine, and really wasn't going to be capable of making advisable decisions!!This experience was truly the highlight of my trip, and a memory I will not soon forget.  Also, Michel Roux Jr. came out of the kitchen to say hello to me (and everyone else in the dining room), which caught me off guard (and, frankly, half terrified me), but it was an exceptionally kind gesture.As a totally irrelevant aside, the clientele at Le Gavroche was truly fascinating (when one dines alone, there isn't much to do besides get lost in your own thoughts and stare at other people); there were young couples, old couples, families, friends... it ranged widely.  The dining room is exceptionally cozy and comfortable, and everyone seemed to be having a wonderful time.  I'm not entirely sure why, but this was not the experience I had at many of the other restaurants I visited - something about Le Gavroche's atmosphere meant that people seemed much more engaged with their loved ones (fewer cell phones, to be sure).  It was a breath of fresh air.I would come all the way back to London just to visit Le Gavroche.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbAm7H4se3DFpbGMK1lLpA"
  },
  "0zQs9VSGVFayG6C_xRXPXQ": {
    "date": "10/19/2016",
    "text": "Was such a treat to have the degustation menu. I'm still thinking about the soufflé and the cheese board. For classic fine dining, Le Gavroche is definitely worth the experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cQPE7Foz-hQTX3SLRktYcg",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Cheese board",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cQPE7Foz-hQTX3SLRktYcg/o.jpg"
      },
      {
        "img_id": "VpgQWt5tXGTOeGWJBD3g2g",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Degustation",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VpgQWt5tXGTOeGWJBD3g2g/o.jpg"
      }
    ],
    "user_id": "vShrnlVR5BgjoOjo7pVMhg"
  },
  "1rs9lcOgT1CCCYddOhd7sA": {
    "date": "9/24/2014",
    "text": "I have been to numerous michelin starred restaurants and this one is still at the top of my list. Chef Roux really puts a great deal of thought and effort to his dishes. The restaurant was vintage but immaculate. Everything was placed perfectly. Staff were very professional but very friendly, so I felt very welcomed and did not feel out of place.The food. OMG. Its like chef Roux knew me for a very long time. I ordered the tasting menu and from the first until the last course I was smiling with happiness.To top the evening off- I got a picture with the chef himself ! and if you tell them its your birthday they give you an extra cake with candles and chocolate writings. I don't understand why this place is only rated 2*. Its a well deserved 3* restaurant !",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "lNGL1RH3RvIUrnimeUj7Jw",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lNGL1RH3RvIUrnimeUj7Jw/o.jpg"
      },
      {
        "img_id": "O4Dim1eKErdBdKWUGpMxvQ",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O4Dim1eKErdBdKWUGpMxvQ/o.jpg"
      }
    ],
    "user_id": "h-Zk1v7q1QKpsZ_c5fdD_A"
  },
  "xlUy5voSIB_JdTOWLPRVdQ": {
    "date": "6/20/2012",
    "text": "When I come back to London, I'll make sure to book another reservation here at Le Gavroche.On my visit here, I came in at 10pm since that was the only time alloted for 1 person. I wanted the \"Menu Exceptionnel\" and they were ok in giving me this 9 course meal especially this late at night. I paired that with the wine and it was perfect.Although, it did feel that they had to rush me since it was obvious that the workers wanted to go home. But what can you do?But anyways, regardless of what time your reservation is, go for the \"Menu Exceptionnel\" with the wine pairing.Started off with the Cheese Souffle cooked on Double Cream. My first bite gave me that shock and awe moment. I knew then that my experience here was going to be a great one.The same goes for course 2 through 9. But I'm not going to write a dissertation on every course. But I did enjoy the cheese cart and yes, I got some macarons at the end.The ambiance here is great. The paintings on the walls alone would make me come back. They even have a few prints by Picasso too. So you're getting fine dining and some culture as well. And as a gift, you get to keep the really cool menu too. After all, it's hard enough to hear the French/British accent when they announce your meal to you throughout the evening so at least you now know what you ate throughout the evening.Jackets are required, ties are optional. Make sure your credit card can handle tonight's main event. Because remember, it's in pounds, not dollars. And on your way out at the lobby, there is more free stuff you can get too including books and magazines.Michelin 2 stars 2012.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "2WMp3ov-Ecw9_ay9L75bGw",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Boudin Noir, Oeuf Frit, Salade d'Asperges Crues",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2WMp3ov-Ecw9_ay9L75bGw/o.jpg"
      },
      {
        "img_id": "NpSqB3yP485vqKMSWx0ESA",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Coquilles St. Jacques Grillees",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NpSqB3yP485vqKMSWx0ESA/o.jpg"
      },
      {
        "img_id": "bARzE_9L-pmkTZDCJPwpGA",
        "caption": "Photo of Le Gavroche - London, United Kingdom. Filet de Maigre Parfume au Ras-el-Hanout",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bARzE_9L-pmkTZDCJPwpGA/o.jpg"
      }
    ],
    "user_id": "opPpHVIp8SKHMJg3_y5Lew"
  },
  "Jq_GhwX2-9hh1VYWcDMWhA": {
    "date": "8/22/2015",
    "text": "Michelin Two-Starred, Le Gavroche, London. This was the first restaurant in London to be awarded a three michelin star in 1982. However when Michael Roux Jr took over his father Albert Rouz restaurant he had asked the Michelin to revaluate the restaurant and they had awarded him with the two michelin star. Regardless of the Michelin star system Le Gavroche has considtently placed in restaurant's top 50. Truely I had hard time understanding the overall theme of the meal and it just seem bit out of place. Nothing really made me satisfied and for me this is not very good. Because I don't usually prefer certain style but when I feel some rhythm feels off, the chef or dish has been lost. Regardless I would not dine here ever again.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NP0nQkRQiUANleVEJ6EM2g",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NP0nQkRQiUANleVEJ6EM2g/o.jpg"
      },
      {
        "img_id": "0jRaprkYICN93Y4szFa37A",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0jRaprkYICN93Y4szFa37A/o.jpg"
      },
      {
        "img_id": "4nDoTJSz3suM7jq753Nrrg",
        "caption": "Photo of Le Gavroche - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4nDoTJSz3suM7jq753Nrrg/o.jpg"
      }
    ],
    "user_id": "a-DORrA_NZGSr9wkzBTGHw"
  },
  "8DNgBTgyTnsBgu9Wdghohg": {
    "date": "10/29/2015",
    "text": "Been coming here many many times since 1982 and it hasn't changed much, thank god.This is the restaurant that brought great French food to the UK for the first time.Been to Ducasses 3 star Dorchester Disaster recently and le Gavroche is a much much better restaurant in every way.The fresh graduates of catering college employed by the MICHELIN guide have no clue about food, if they did great food would be common... The guide may have lost its way but LE Gavroche has stayed true.Discrete understated decor and excelent service reliably wonderful food, the same experience every time. LE Gavroche is bliss.If you are a vegan it will be wasted on you and if you really resent wearing a jacket don't go.But if you love food and wine you must go to this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qk490rPyTGIrg2oTb_IxwQ"
  },
  "SYQm0XaYBIVDtIiGIkTrpw": {
    "date": "3/18/2016",
    "text": "I was heading towards west end in a taxi for dinner after 9:30 pm,when I spotted the name,I thought it was a basic high end French restaurant,stopped the taxi to find out if he accommodate  us.They did,The service was excellent,I had the veal entree,followed by a cheese plate.They have big selection of wines by the glass.Definitely recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCr8FYCq0MMDDvePw3xYFQ"
  },
  "ax90xAauw5gGe8SeForCbQ": {
    "date": "4/7/2014",
    "text": "Brilliant, brilliant, brilliant! Me and my bf had such a great time here for many reasons. First and foremost the food was delicious, not a thing wrong with any of it. We had the wines to match each course for the tasting menu, which isn't always a good idea if you're a bit of a light weight like me, as you can find yourself distracted away from the food and i'm a bit disappointed in myself for not pacing myself a bit more! :P The satff were great, really friendly and we had a good laugh with them through out the evening. Not at all stuck up as a lot of people may expect it to be. Michelle Roux popped out of the kitchen on a number of occasions to say hi to guests and see if they were enjoying their meals! I ended up getting a pic with him at the table, think it was the Dutch courage as he i really respect him as a chef and never thought for a second I would ask! It's very romantic. A brilliant place for a lovely date, or a classy catch up with friends. I recommend it to everyone, you should go at least once!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "NO9t3B8PyHTM7svhCOYXcg"
  },
  "ZojMUienJMYg8poYa1eCtQ": {
    "date": "5/5/2015",
    "text": "I hated this place. If you are a man you have to wear a jacket - which as stupid as it is sexist. I took mine off and was told to put it back on. I almost left at this point. If i had signal I probably would have ordered pizza to eat at my table. The food was un-exciting. I had a veggi tasting menu, which was basically the standard one with the meat swapped out, which is just awful. Good restaurants of this class actually think about what a vegetarian option should be and do something interesting. The wine pairing was average and the sommelier provided almost no information about what the wines were or why they were chosen. The whole experience was expensive and awful. There are much better places to eat in London.",
    "rating": 1.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "-874rcE5hDXSsjb5qxKjmg"
  },
  "yCQ787Z40GcjD3IrfB2k6A": {
    "date": "8/21/2015",
    "text": "Yet another incredible evening at Le Gavroche, the cooking was excellent and it is so rare in London to find classical French cooking of such fine quality. But this restaurant is so much more than just the food, from the lovely vintage decor to the formal, but charming services, this is a full package to a time machine that takes you back to the 80s for a slice of gastronomic experiences that you can't find elsewhere in London. Le Gavroche is truly special.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "LF3oFHI9vA_Ze2DCpUGAVA": {
    "date": "4/27/2013",
    "text": "We came here as a special treat to celebrate my wife's birthday.  The whole experience makes you feel like a VIP - the location in Mayfair, the perfect attention to detail and impeccable service.  When you are downstairs in the dining room surrounded by such luxury, it's easy to forget about any stress in your life.We each had a glass of Gosset champagne, which was delicious.  We had a look through the wine \"bible\" and had some expert assistance from the sommelier who answered our queries on pomerot and the bordeaux region before recommending a very nice red wine (Lasseque 2004).  At all points, you could ask anyone about aspects of the meal and they would know the answer.We chose to order a la carte.  I got the langoustines/escargot as the entree and the rabbit for the main.  My wife got the duck tartare for her entree and the veal for the main.  All of these dishes were tasty, but some things about them were not up to 5-star quality.  I found the crunchy noodle part of my main made it difficult to eat without spilling it off my fork.  Components were also very salty - it felt like eating cheese and onion crisps.  My wife really enjoyed her main although, to her, the veal came out closer to medium-well, rather than medium-rare as she ordered.  Some of the components of her entree seemed like they didn't fit, but the tartare itself was very good.  Small points, to be sure, but you have a very high expectation when you come to a two-michelin star restaurant.I got the chocolate amedei mousse for dessert and my wife chose the chef's tasting plate.  Mine was very very chocolate, which was a decadent delight.  My wife enjoyed all of the components of her plate and I was lucky to be able to sample all of them.  Husband's prerogative, I guess!  (However, I silently screamed when I noticed that this dessert tasting plate was almost £40 on its own.)I have to stress that the service was perfect and the staff really made the night enjoyable for us.  It felt effortless on the part of the servers, but it shows that they really have the best people working there, who appear to enjoy what they do.  The overall cost was just over £340, but I didn't feel like we had overpaid.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "vxENGsTvG00yR0XL8W2pcg": {
    "date": "11/19/2012",
    "text": "I finally got to come back to Le Gavroche, again for a birthday. A big birthday, as befits a big bill, ahem, I mean, dining experience. Five of us had the tasting menu and what can I say that hasn't already been said? Everything was wonderful - a couple of us struggled with the snail dish, but not me, the unbelievable hollandaise that came with it was good enough to bathe in. In fact I hoovered up an extra snail. A couple of warnings - beware the bread, and beware the cheese! We went nuts on the cheese trolley (that was all five of us yelling comte! simultanenously...it lived up to our high expectations) and I have NEVER been so full in my life. The dishes are small but deceptively rich. There are three sets of petit fours, and we had to take two home!Our first bottle of white wasn't knock-your-socks-off, but the bottle of red the sommelier recommended was absolutely delicious - chocolate and pepper and everything she promised, and it went grandly with the venison. There was only one teeny tiny (literally) thing we didn't like - a teeny tiny radish that sat next to the foie gras parfait. It was so bitter it took your breath away. But the parfait and confit carrot (how do you confit a carrot?!) took your breath away for the other reason - it tasted amazing. Seven stars.... I wish I could eat here every day, though I would die of a heart attack very very quickly. They even stuck a candle in my baba and wrote happy birthday in chocolate - what more could a girl want?",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 8,
      "cool": 7
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  }
}