{
  "7w-NhfPQ27PYDuqru4hQtw": {
    "date": "7/23/2014",
    "text": "My favourite burger joint in London bar the mighty Dirty Burger. More convenient for me as I spend alot of time in this area. Always a great burger. The fries are perfect and the chili cheese fries are serious peice of kit. Its the sister company of Meatliquor which is a great burger too but this beats it for location and less queues. Not much more to add but I've never queued for long and is a satisfying burger.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ql_IjW6MBtkPvmz8f7FV1A"
  },
  "kALbLFIPodJAZIibi9MrBg": {
    "date": "5/8/2012",
    "text": "I was really looking forward to my Dead Hippy Burger, but sadly I was left rather underwhelmed.  Luckily there was ketchup and mustard on the table as something was really lacking. I do like the location and presentation, but to be honest, for the price I expected more.However, the 'Poppers' which are fried and battered Jalapenos and Cheese were pretty good and worth a try.Overall it's OK but nothing special. I found myself wishing I had just gone to Bodeans instead.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4LdbjVTEST49gXmPuffp9w"
  },
  "m5rPFKo2VCmV0wKDMfxt_Q": {
    "date": "7/14/2013",
    "text": "I much prefer this outpost rather than the main one in marlyebone. It's not as busy, it's quiet enough to hold a conversation and you can actually see other people! Having to get up to collect your order is a bit of a drag as the area is a bit cramped but overall it's a good place. Everyone knows about the burgers by now they are good but greasy as f*ck. The fries here are amaaaaaaaaaaazing. Very similar to mcdonalds but thats cool if you love their chips like me. Went here with an American and she loved the food so I guess that says something.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wOwUvJscRRMqK6p9owCeYQ"
  },
  "GaB5JJfgN58Pd84oGGsN-Q": {
    "date": "12/22/2013",
    "text": "I loved this place when I was in London. My preference of the Yianni restaurants is still MEATLiquor, but Market was always less busy - almost no queue unless it was RIGHT at lunchtime. The Dead Hippie was actually my favorite, though I'll agree that it's not the healthiest feeling food (though if you go here, you should probably know that). My favorite thing to eat here overall, was the jalapeno poppers. They are so good and the sauce that goes with them just makes it. I could eat them all the time and never get sick of them. Their hard shakes are good, though super small, be warned. Their \"Miami Nice\" slush is delicious, but also kind of small for the price. Also, there's a reason it's limit two per person, so keep that in mind. When my flatmates and I would go here, we'd share some poppers and grab burgers. Good place for friends, though it is noisy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PorUmUEZw79q54VpWRE2NA"
  },
  "6d46_H2xuaBNTvmqiJ4U4Q": {
    "date": "1/29/2013",
    "text": "The 'Dead Hippie' Burger is fantastic. One of the best burgers I've had (second to Patty & Bun). High recommended. They do bottomless soft drinks which is always a bonus.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3CiHrfNQzNvB9xWsf2TJw"
  },
  "OySpZ-gbDlnhxfcDqNlLrQ": {
    "date": "6/12/2012",
    "text": "I should preface this review with the fact that I love, love, love Meat Liquor - I will queue, I will order more than I can possibly eat, I will rave about the food.  Meat Market, however, I can do without.  Maybe I had too high of expectations, but £30 later I was still hungry and unimpressed.  And maybe the zillion references to tipping, when I had to pick up my food and get my own drink, got on my nerves.  Will be sticking to Meat Liquor I'm afraid.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4by2v3Yn0h6FSJUSAfwd1g"
  },
  "8p6o02qJVSFI_scV5ai_mg": {
    "date": "8/25/2012",
    "text": "I'm going to concur with the general sentiment here - the burgers, they are fine. Not the best in London and certainly expensive, but fine. The sides were good. Quality was what you'd expect from any decent American bar (speaking as an American), but I'm not going to slate them for that. If I got their andouille corn dogs and jalapeno poppaz in America, I'd be happy.Here's what I'm going to slate them for - the service. My friend and I just wanted to grab something light before drinks, so we decided to split a burger. She wanted onions, I didn't, I wanted mustard, she didn't - so we asked them to put both on the side. The woman at the till, with the sincerity of a nun, told us that the chefs didn't take requests. For a £7.50 burger. In a dingy market. Cooked on site.My body language gave her a clue that it would be a deal breaker. Cut to our final moments there. There are only about ten of us there on the sunny Bank Holiday Thursday evening. A gentleman named Jake places an order at the till, the order comes out in about 5 minutes, and they've already forgotten who he is. \"Jake\", they call out. Jake doesn't answer. \"Jake?\", the waitress snarls, before taking his £7.50 burger back to the kitchen. Charming.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyr0OtUdRE92gUs-E8ZR4w"
  },
  "qmYlbzo6P0PwhxDA6rcN7A": {
    "date": "9/4/2012",
    "text": "For British burgers this was a good shout, but as an ex-pat it doesn't cut it against the big-league food chains like Five Guys and Elevation. Nice and dirty how I like my burgers, but a bit too much mustard and not enough cheese. The meat was good but not as juicy as I'd like it, though with the bun included it was a very tasty package. All in all not disappointed by the (otherwise) good reputation, but it was a very tasty burger considering the (British context).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yFtXeU4z-bdV3czVt4pD8A"
  },
  "ZNU3yYMtmRy-0OAOycsi0w": {
    "date": "2/18/2013",
    "text": "Not as good as Meat Liquor but still damn good. Pretty much the same formula as its big brother but in a fast food form. So no waiting around to be seated if you just want to grab a burger to go. There are shared benches if you do want to sit but they are not always available. I have tried both the burgers and chili dog here and they were both great. In fact I went twice in one day as I was drinking in a pub nearby and suddenly had a craving after already eating here in the afternoon! To be honest I haven't tried a better chili dog in London so if you fancy one I recommend it. Although this place is right in Covent Garden market it still feels a bit hidden away which I think adds to its charm.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loBW3BWuNfJGwPeBOCuBBg"
  },
  "gW8IGG0Sp22Rmi93e4imjA": {
    "date": "10/13/2012",
    "text": "Not a bad burger, but it won't blow you away. I had the Black Palace burger and the grilled onions were lacking a bit in flavour (I didn't think that was possible for onions) and although the meat was juicy and plentiful, it was a bit on the bland side of things. Better off going to Honest Burgers (sooooo much better) or even Byron's down the street.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "80YrrFwr8raAGbBfSbhw6A": {
    "date": "9/16/2012",
    "text": "This is my second favourite place for burgers in London.  Trying to be a cool, ironic take on American burger joints with random signage hidden away on the 1st floor of the Jubilee market in Covent Garden.  The burgers are great, get a Dead Hippie with secret burger sauce and a bowl of fries, all served in fast food style wraps and on a plastic tray. Grab a beer or an unlimited soda and you are away.  It's simple, isn't as mental as MeatLiquor, is fast food, reasonably priced and somewhere I will come back to.  Not really the shabby chicness of Honest and in some ways can look a bit cold and corporate but maybe what it is gunning for. It's all about the burgers though and the doubt patty cheeseburger that is the Dead Hippie satisfies.  A complete mess to eat but that's the way it should be.  Much better than the English fry up that preceded this place and where some of the photos on the wall echo rememberence to.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUKheMge-ONOb9_HwP-m-Q"
  },
  "IoH1R80P4JXMSMO5KFX0iw": {
    "date": "6/11/2013",
    "text": "Good burgers, slightly over seasoned and a little annoying that you can't change the ingredients.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IzDNFht0xnZC47hf4OA6Jg": {
    "date": "10/29/2013",
    "text": "I will hear nothing bad about this place, seriously can it about the grease unless all your carbs are coming from broccoli. I didn't even have the Dead Hippie, but the standard cheese burger was entrancing enough. The vanilla milkshake was pretty great, but omg was it TINY; I didn't notice any copy indicating it, but I hope those cows were 5 generations organic. The staff was very nice, and yeah the place is noisy.Fries = terrific, srsly tell me they aren't to see somebody turn purpleNot small caveat: I had an eerily, and however distant, still familiar aftertaste when I was done, was this because of a non-artisanal bun, subpar oil? Please let me know.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5TtAGCQx1MZFY_RKIrGww"
  },
  "iSeX6n9ZCq5P9zF2h7T5RA": {
    "date": "6/22/2012",
    "text": "Every time I eat at one of the MEAT empire's locations, I get a stomach ache.Still, the food is tasty at the time. Expensive, but tasty.The decor is a bit overwhelmingly hip(ster twatty).Middle of the road.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "hWGHWjXwDFo6U6pYA17F0A": {
    "date": "5/22/2012",
    "text": "What do I do when I've finished a steak at Hawksmoor Seven Dials and am still hungry?  Go to MEATmarket and have a dead hippie burger.... duh!The burger was exactly like those at Meat Liquor (Best burger in London!)This location is PERFECT for a quick fix for lunch if you are near Covent Garden.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vgnxCeEh7M8SXHnm4yKC1Q"
  },
  "JDAFMbj3EoVWUAAYpVWASg": {
    "date": "5/8/2012",
    "text": "I feel like I'm taking crazy pills! I'm obviously the only person who was hugely underwhelmed by MeatMarket. Maybe because they swizzed me on their website by sending me to MeatLiquor by advertising they weren't serving burgers at the wrong location. Annoyed. But mostly because it's just a bit shit. It's such a limited menu, no chilli cheese fries, wings or fried pickles. No corndog and my cheesesteak had more peppers in it than steak. My boyfriend also asked whether they were getting their fries from McDonald's. Exactly the same look and taste. He also said 'it's just a greasy burger, what's the fuss*?'These Meat dudes specialise in greasy, greasy burgers. And eating grease has its acceptable place, in a cool venue (MeatLiquor), great cocktail menu not from a Slurpee machine (MeatMarket, really?) and chocolate cream pie. MeatMarket's venue is upstairs in the sad, dirty and depressing Jubilee Market, where people sell depressing 'antiques'.  It's cold and draughty and feels like you are sitting in a Wendy's food court. I felt dirty and not in a good way. *MeatLiquor is just a greasy burger too, but the venue is cool and the rest of the menu makes up for it.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "1SBbxnE_KpZo076ITlL8bw": {
    "date": "1/22/2013",
    "text": "I am in total agreement with the 3 star reviews on here - I will echo their sentiments when I say that while the burger was good, it was pretty overpriced.  I came here for lunch on a very cold day, so it was quite empty.  If I had to queue for this place, I think I would have been pretty displeased, but at least that was not a problem.Pros:Good quality patties - very juicyDead hippie sauce was very good, but basically reminded me of the sauce on an In N' Out Burger (a reference for all you West Coasters out there).Cons:Fries were too crispy and overly deep friedPricey pricey pricey - Fries & a burger came out to be £10.50.  In summary, I got the equivalent of an In N' Out meal & \"service\" (although might argue that In N' Out has much better fries), at 2-3x the price.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vUimuuObOODnXe614ViuAw"
  },
  "dsESJgrf8BIlzXm82bcGDQ": {
    "date": "5/7/2012",
    "text": "There seems to be some confusion. See, I've popped in on the bank holiday and the website said no burgers on the bank holiday, but they'd have meatloaf or something else instead. Once I got there, they were indeed making burgers and the meatloaf was meant to be at MEAT Liquor, so you can imagine my shrug and the horror of my fellow yelper who had tried to go to MEAT Liquor to get a burger only to be told otherwise. So please get your twitter feeds and sites in alignment, and yes I'm looking at them now just to double-check I hadn't hallucinated, your content person is updating the wrong things! Anyway, I kind of prefer this to MEAT Liquor on a couple of levels, 1) No queue2) Sit wherever3) Refillable soda4) No queue5) There's light6) Jalapeno poppers7) No queueIt's all the goodness that you expect from the meaty ML food, but I really hate having to jump through all the hoops and deal with the volume of that place to get a greasy lunch, I'd much rather just go here where it's a little less frills. Of course there's things that ML will always have that cannot be replaced on the rest of the menu, so don't expect those cheese fries... but I think it's a win. The location is odd as, though. I was expecting it to be on top of one of the ends of the main market, the jubilee one kind of threw me off.... You can expect some guilty pleasures and a roll of paper towel to soak up the mess. They're supposed to have a bigger selection of dogs coming along, including the corn dog, which TBH I can live without, but I can see how this would be a great takeout on a sunny day to go sit in the streets and binge out. If you like the MEAT Liquor sister, you'll have a place in your heart for this one, just don't expect the same ambiance, cause like the name says, you're in a market.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "HGGt3DrzbHvpgLAlOHjIKw": {
    "date": "6/14/2012",
    "text": "The newest member of the MEAT-family, Meat Market falls a bit flat on almost all areas of importance. The burger is juicy but oozes grease and the Dead Hippie sauce has a decayed taste that, while keeping it true to its namesake, is not what I want slicked over my taste buds. The fries were crunchy with soft fluffy insides and would have been perfect (think gourmet McD's fries) except they were showered in about a pound of salt. I've got a salt tolerance second to none but that was too much even for me.A bit more detail for those of you still interested or not convinced. MEATMarket is confusingly located in the Jubilee Market (this is the rundown one tucked away almost out of side of the main Covent Garden area) up on the 1st floor. You either wade through a mess of flea market stalls and lost tourists or magically find your way around to the downtrodden door from the street. Upstairs, you order at the till and I think you even have to grab your burger from the counter although I imagine they will have some sort of table service soon. The menu is extremely limited two 2-3 burgers and a cheese steak being all I recall. There are also few sides and extra toppings which makes the whole thing more appropriate for a food van than a proper brick and mortar location. Actually that's not quite true, Kimchi Cult operate out of stalls and still manage to provide more variety on the burger front.I opted for the Dead Hippie burger which was composed of two beef patties, a couple slices of cheese, and the infamous Dead Hippie sauce. I really don't know what to make of the sauce other than to say it's a bit like what you would get if you left the Big Mac special sauce (which I'm pretty sure is just mayo and ketchup) out in the sun for a few days and then tried to cover it up with a dollop of Wal-mart generic brand BBQ sauce. If I wasn't so hungry I'm sure that would have ruined my meal.The staff are friendly and up for a bit of a chat, but seem to be focused on speed when it comes to getting your order. The girl asked if I'd like a drink and while I was pondering she had already rung up my burger and handed me the card machine. So no drink for me which was unfortunate because halfway through my fries I would have considered selling an organ for a glass of water. It's worth noting that these are American style fries (thin, crunchy, a bit oil saturated) not thicker chips that are more commonly on offer in the UK.Portion-wise, the fries are generous but the burger is a bit small (think quarter pounder not Whopper). For £10.50 for the burger and fries, it's a bit on the expensive side for a small/moderate meal.Overall, I'd rather queue at MEATLiquor for the cooler vibe (although the food is roughly the same). Sorry MEATMarket, you didn't make a believer out of me and in good conscience I can't put you anywhere near the top burgers of London.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "8FD_Z9b4_ECTw7pNcs3mtA": {
    "date": "11/22/2012",
    "text": "This is good, but really not an epiphany.  It feels like an American truck stop store room with a lot of interesting signage and seems to be built out of something like scaffolding overlooking one of Covent Garden's markets.  The burgers are heart attack territory large and they have a hotdog that is wrapped in bacon and deep fried.  As you eat it you can hear your arteries crackle.  The Dead Hippy burger is what a Wimpy burger would be if it won the lottery.  The burgers are how they are and you get them as they come.  There is a chalkboard on the wall that lists converted vegetarians. I'm not sure they could have been die hards as the burgers are definitely good but you walk away thinking that you have just sprung over £10 for a dining experience that is a halfway house between a B&Q burger van and Bladerunner.  It would be a hit if it was a bit cheaper.  If you can get in without queuing, go, but this probably isn't going to be the burger that fuels crazed beef patty dreams and carnivorous fantasies.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "Sw-x-dLqCPw5bDDYxTFP1Q": {
    "date": "10/16/2013",
    "text": "Being a huge fan of Meatliquor, I decided it was time to give this place a go! I must say from the second I walked in, I liked the atmosphere better than Meatliquor as there was no pounding music blaring, and I could actually see everyone that was there. I also liked the set up of the place and the fact that they had an actual fountain drink machine where you serve yourself with unlimited refills, unlike at Meatliquor.Unfortunately, despite all this goodness, the food just did not taste the same. Plus, my cheeseburger had a double patty which honestly was a bit too much meat. The patty's at Meatliquor were already pretty thick so to double it up makes no sense. I couldn't even finish my burger as it just didn't have that same delicious taste. And although the fries looked the same, for some reason they didn't taste the same. Although I'm glad I tried out MeatMarket because I would have otherwise always been curious, I'll definitely be sticking to Meatliquor from now on!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNtiIYMcmvRP_2bpByKLcw"
  },
  "UE3j06KHEs5xXq6TRrOKdw": {
    "date": "7/30/2012",
    "text": "I came here on a Sunday after reading some reviews on some blogs from people who recommended their \"juicy\" burger. I love burgers - I can eat them every day. Most recently a few weeks ago I spent some time in San Francisco where they have three amazing chains: In-n-out burger, 5 Guys, and Superduper Burger. All three serve quite different burgers, but all three are equally amazing (5 Guys maybe slightly too greasy) and I can't wait for them to open up here in London soon. In any case, I had strong expectations on this place.After paying 13.50 for a burger (more than a three course meal in several restaurants around the corner!), a shake and fries, I must say that all three items were worse than I could have had anywhere - any random pub, and significantly worse than a McDonalds even! First, the burger was completely tasteless, it's like they had forgotten salt and pepper and used some weird form of tasteless meat. It was like chewing on pieces of old skin, grey and just tasteless. Yuck! The bun seemed old.  And, also lacked taste. The special sauce, was special in terms of lacking taste as well, except for some type of oily/sour residue! Probably the worst burger I had all year, maybe ever. Who recommended this place???? How can they fail so completely with a burger?The fries were soggy and also slightly tasteless. Lots of salt helped, but I wonder what oil they use? It gave a weird aftertaste. They were the best part of the meal though, which just shows that if soggy fries can make you happy then something is wrong with the meal.Finally, the milkshake. I think it was supposed to be vanilla, but tasted just milk, o rather some milky powder. Baby formula maybe? In any case, it was the worst milkshake ever. I couldn't even finish it - and I LOVE milkshakes. Lucky for me, the portion size was so small, I had never seen a milkshake like this! It was like a small coffeecup size (like the cups you get from a machine). Half size. In any case, I felt sick after having drunk half the cup.I was keen to ask for my money back after this meal. Don't waste your money. Avoid at all cost.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89NQNm30q1axS2_69Xu4Xw"
  },
  "US9wFGdtY6NK7HeFq2FihQ": {
    "date": "9/7/2014",
    "text": "Tucked away in Covent Garden, from the same 'meat' family, the Meat Market has the same menu as the Meat Liquor, but without the agonizing que, and with a shared wooden high table high chair, completely different from the biker bar + heavy metal theme from Meat Liquor.You came her for good old juicy burger, not for a healthy meal just so you know, but definitely this place is one of London's best burger joints!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_bdtlFWY2mpOfisbp-KYWQ"
  },
  "0HrSjNWk5C5WLpftLUt3Ww": {
    "date": "7/21/2014",
    "text": "If I make this review long, I will have failed, as the conclusion is so very simple: this is a fantastic burger together with the more upscale brother restaurant MEATliquor this is probably one of the best burgers I have ever had - this is exactly how a burger is supposed to be. The bread was a light brioche bun - just the way it is supposed to. The burger itself was also amazing: juicy and cooked to perfection - don't kid yourself the tradeoff is that this is no light meal, and my only regret is that I was full after one. but already looking forward to going back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Mn-auRS-XI7-5evPKBhxdg"
  },
  "6kVXw9l0LrgX-FzwRB8GhA": {
    "date": "5/22/2012",
    "text": "In terms of burgers there really isn't any better you can do!All the joys of Meat Liquor without any of the wait. The menu is limited - 3 different burgers, some hot dog options, fries and a few sides but holy crap it's delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "PEg9CgPQBmRulp4dN1alKQ": {
    "date": "6/14/2012",
    "text": "I order a Dead Hippie, (lettuce, cheese, minced onions, pickles, two beef patties and some dead hippie sauce). I skip the drink and fries, and the total is almost £8 - Ouch!The burger was good, so good I find I've burnt the roof of my mouth I'm eating it so quickly. But its soggy, so soggy! the bun is dripping in sauce, its a messy affair and I'm reaching for one of the large kitchen rolls before I know it (conveniently placed on each table). Super Burger, I just think they overdo it on the sauce, I've had plenty similar in the states, it doesn't have to be wet to be good!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fRTby8Cl5r440v0XoiZuag"
  },
  "ejlO-Y-68UAZDgYqcV7iFg": {
    "date": "5/11/2012",
    "text": "This place makes ordering a burger feel ironically retro cool as well as slightly illicit and fetishist. Accompanied by a hip club vibe the saucy backlit lonely hearts style signage adds an entertaining dimension which differentiates it from the average burger joint.The Black Palace was a monster of a burger - impossible to eat with any degree of decorum. Expect burger juice to be running down your cheeks and wrists as you wrestle to retain control of it. Definitely something to roll up your sleeves for. At least they provide more than the usual flimsy paper napkins to mop it up with, in the form of a substantial roll of kitchen paper on the table.I liked Meatmarket a lot and it seemed a pretty chilled hangout spot. It could run the risk of becoming style over substance and will require another visit to get a better measure of the place. Not any time soon though as I fear excessive consumption of these burgers could well bring on a coronary.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WpyL_tAWvAF8YT7QH_UD3Q"
  },
  "w56cYlPM-vZQSNc2oSbvrw": {
    "date": "6/7/2012",
    "text": "Great location, simple menu and easy seating.  Nice burger, not incredible and just ok fries.  Don't think it really justifies the price.  Its like an extra greasy, not quite as tasty and 3 x expensive in and out.It might be that I am now ruined by the Jacob's ladder burger I had a couple of days before :-)Next stop Hawksmoor?",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yh2LI7JQAODDn8a1ky0qxw"
  },
  "gHVeHgXMaLHY3zF008vFEQ": {
    "date": "7/15/2012",
    "text": "Thanks to Burgerac's Burgerapp (burgerac.com/p/burgerapp… ) I came across MEAT Market. Well, it's located in Covent Garden in the Jubilee Market Hall, so quite central. It's worth mentioning, that MEAT Market is open much longer than the market itself. It feels very much like your random fast food or take away restaurant.I really like Meat Liquor (see qype.co.uk/place/2167625… ), but I found my burger at MEAT Market - kind of a sister restaurant to Meat Liquor - too greasy and messy. For me, it was more mess than joy. The fries are just okay, but nothing more.Overall, the taste is fine, but I don't like buns that dissolve almost when you merely look at the burger. So, the burger is probably very good, but it's not really for me. Not the burger. And not the atmosphere. But then, it's still better than many many other burgers.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNOawJ5EBL8PRBN5_Rwa4A"
  },
  "SVbRcfYq0wRFhMJiUB1IDQ": {
    "date": "7/26/2014",
    "text": "The good thing is it's open late. It's on par with any fast food chain in the US. Other that serving alcohol, there's nothing to write home about. I was reaped in by the name. I was expecting Meaty and juicy, but left with a mediocre burger on an above average brioche bun.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZpNMuBHUj--ymOho29maw"
  },
  "qFkvqHeWTrZaAExwk3u2iw": {
    "date": "9/24/2014",
    "text": "Went to Meat Market on the recommendation of a friend. I thought the decor of the place was awesome and cheeky. It was a very loud and boisterous atmosphere. I got a cheeseburger and was very impressed by how good it was (I'm always apprehensive about ordering burgers in Europe). I split the hippie fries with a friend. We ordered them after reading several reviews that recommended them. The dish upset both of our stomachs greatly, and I wish that we had ordered normal fries instead. My friend got the halloumi and mushroom burger, which was awesome! The drinks looked delicious and creative, and I am looking forward to trying one next time I go to Meat Market!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFjOK-LFR2G_O65WgICLfw"
  },
  "x9em5bkprhC-KSdK3O30hw": {
    "date": "7/11/2013",
    "text": "I kept hearing about MEATmarket again and again, so I brought some out-of-town visitors to try it out.  BIG MISTAKE.  I should have known better and actually done some research on this place. While they have a few things on their menu, their focus is on their beef burgers, and serve the following 3:  Dead Hippie Burger, Double Bubble, and Black Palace.  They pretty much have the standard double patty with cheese, onion (raw or fried), ketchup and pickles.  I already tried the DHB at MEATLiquor, and wasn't tempted to try it again (the elusive DH sauce everyone kept raving about was a hot oily mess, a bit nauseating to be honest).  I went with the Black Palace burger, which had everything listed above, but with fried onions.  I'm also going to note that there's a sign stating that their patties are cooked medium rare (as it should be), otherwise anything else needs to be specified.  You'd think it would be hard to mess this up, but oh, they messed this up big time.My friend ordered her patty well done (WTF was she thinking?), and it arrived medium rare.  The waitress said \"thats how its supposed to be\"... not quite.  That got sent back to the kitchen, and my friend finally got a well done burger.  10 minutes later, my burger arrives well done, even though I didn't specify any changes.  It was greasy all over the bun, oil was dripping off, and the meat was so dry, the burger was falling apart.  I managed to try some of the patty, which was underseasoned and bland.  The waitress brought it back to the kitchen, but not before she said \"well, thats how medium rare is supposed to be... you can see a liiiiiiittle bit of pink here.\"  sigh.. Anyhow, over the next 30 minutes, they managed to mess up an additional two burgers for me, all well done.  The waitress was apologetic and insisted she was telling the chef that its supposed to be medium rare.  I started to wonder whether they were screwing up my burger on purpose.  I asked for my money back instead and saved my stomach space for something else.  Clearly - they still have a lot of work to do.  I can't see how you can screw up a burger so many times, when their menu is so limited!After the experience at MEATLiquor and MEATmarket, I have no desire whatsoever to visit MEATmission.  The 30+ reviews here aren't consistent - people either love it or hate it, but I really don't get where the love is coming from.  Go to Honest Burgers, and get yourself a real juicy burger with amazing rosemary chips for a tenner.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJKnmUxpJfzPovCTsT1kLg"
  },
  "BorsblnHnVH6zVsFRdnlOA": {
    "date": "9/23/2014",
    "text": "I kept hearing how MEATmarket is the place for burgers in London...and I will say that I was not disappointed.  The burgers here are fresh, juicy and are delicious!  It was £8 for a cheeseburger (two patties) and I thought it was pretty good value considering other places charge £9 for a burger with one patty.  The fries were really good and I loved how if you bought a soft drink it was unlimited refills.  Hooray!Really enjoyed it here.  Good service, great burger and an amazing time with friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OepicbUeYRwxGWM_rp1JRw"
  },
  "jLyIJD5nuQtzIXXx2ZazDw": {
    "date": "1/17/2014",
    "text": "My aversion to queuing for a loud, dark burger restaurant makes MEATmarket a breath a fresh air. I have thoroughly enjoyed the gross, heavy, dirty meals I've had at Meat Liquor, but can't be bothered to deal with the fussing to wait for a table. We walked into MEATmarket on a Tuesday night, ordered, and sat down immediately. In less than 10 minutes, our food was ready. It's very fast food style - you order and pay at the counter, then collect your food when they call your name. They also do takeout, which is nice if you're in a hurry or if you work nearby, I guess. The burger was what you'd expect from this franchise: really juicy, sloppy, and loaded with mustard. Mmm. The fried pickles are also great, although I'd recommend splitting an order because it is a lot of fryer grease even for the most seasoned junk food eater. I am writing this review just after writing a 3-star review for Honest Burgers. I think the MEAT shops do a better burger overall and their meat mixture is more tasty to me, but I'd rank Honest Burgers a better place to actually sit and enjoy your meal. I need to come back here to try the tequila + beer cocktail. And, you know, eat more meat.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "8TzhTCHZ1Trf2zsgpQGOwQ": {
    "date": "8/2/2014",
    "text": "When some colleagues suggested this place for lunch last week, I thought, \"Ugh, I thought London's burger trend (a la GBK, Lucky 7, etc.) was over in 2007\" and was reluctantly dragged along and up the stairs to MEATmarket.  However, the burger (and the deep fried pickles! OMG!) shut me up.  I had the bacon cheeseburger and was a bit daunted when it showed up with two (2!) patties - but the burger was just the right combination of meat, bun, cheese and bacon, that I have to say I devoured it in a most unladylike fashion.  I don't know how anyone could eat a burger AND fries, but between four of us we managed to sample a side of jalapeño poppers and deep fried pickles (did I mention the DEEP FRIED PICKLES?!), and that was probably the right amount of sides for a group our size.  There's nothing great about the ambience here - it's crowded, loud music is playing even at noon, the staff shout your name at you when you're order's up, and there's nothing but slightly rickety stools to sit on, but I'd definitely go back for another burger - this time to go.  With a side of (you guessed it) - deep friend pickles.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CR4_Kl4eqc-SKzk3sdUvFg"
  },
  "_Piha8u1tcSfzxYc0GbJOA": {
    "date": "6/22/2012",
    "text": "After some consideration, I've erred on the side of caution and gone with 3 stars.I feel it would deserve one more if the prices weren't so punchy and a little bit presumptious. What they do, they do well. Despite it falling apart in my hands, I did enjoy the Philly Cheesesteak here (I'm a well-noted moaner about the lack of decent cheesesteaks in London), albeit not a patch on what you'd get in the 'iladelph.Cool concept - but not enough seating. Expect queues in the evenings. We were lucky to eat about midday on a Saturday and only have to wait a couple of minutes for a bench.I'll try a burger next time - there were some consistent moans of pleasure from my friends. Although they had the same issue with keeping their meal in one piece - falling apart everywhere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0Flh7VJikDldjgTWnXQg5A",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0Flh7VJikDldjgTWnXQg5A/o.jpg"
      },
      {
        "img_id": "X7Am3x4tjbnqUUmFeMv1tA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Philly cheesesteak.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X7Am3x4tjbnqUUmFeMv1tA/o.jpg"
      }
    ],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "gVNWyOrk9hao9uIgi3Jkpw": {
    "date": "3/7/2015",
    "text": "Wowowwowwowowowwowowow. I love it here. The burgers are insanely good. Fries alright. And the vanilla milkshake with getting fat for. I almost got two. Then I remembered I like being slim.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "74ejsTj1cE7Q4VynYFpwew": {
    "date": "12/26/2013",
    "text": "Juicy succulent burger, particularly like how the cheese is steamed into the meat using a big metal lid.Service prompt and none of the queues of sister restaurant Meat Liquor!!!Good beer selection and cocktails looked tasty. Deep fried pickle is a must try.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P7nK3H0wi6vXTKrlSb_LWQ"
  },
  "ic0E8JQy4ardqa9ORPv2vQ": {
    "date": "11/6/2015",
    "text": "So frickin' delicious! Sinfully good! This place gives you the best dirrrty burgers out there. The deep fried mac n cheese - I want to live in it! So gooey and tasty, proper comfort food. If you're health conscious or on a diet don't even bother ascending the staircase as this place is filth in the best possible way. I cannot recommend this place enough. Got to be visited to be believed. Will not take reservations so be prepared to share tables with strangers but it's totes worth it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPf_H17tWMtRnrjB8IrXkQ"
  },
  "5B_BBPxFufE9XiE74E2CJg": {
    "date": "4/27/2014",
    "text": "So first thing is first: Don't come here on a first date. In fact, don't come here on any date - it's really not that kind of place.Trust me on that.Now that we've got that out the way, MEATmarket is very much your down and dirty greaseball fast food spot. It's American style food, served to you after waiting in a long queue, shouting your over-complicated name at the waitress to record your order (PAPA-ROMEO-ALPHA-DELTA) and on a plastic tray with barber-striped parchment paper.I opted for a Philly Cheesesteak, which though it was pretty much on par for the exquisite culinary experience one expects for £8, on a late Saturday night. And then once you've collected your food, you face the notorious \"Battle for the Tablespace\". Think of it like making new friends, but these friends are armed with cheap plastic cutlery and scornful looks. And the music is beautifully selected to be a high tempo, paced to ensure you eat fast and get out, so that long queue can keep on moving.There is, however, refillable sodas - a treat rarely bestowed on the London cuisine scene outside of a Nando's. So there is that.My big regret was shown to me, literally on a platter, when many a buffalo wing passed my by and went onto other tables. As a sucker for buffalo wings, they looked very good, and I'll likely make a trip back to MEATmarket to try them out.Once my battle scars from this encounter have healed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0G-4DW_8r0Kz94JkFLj4A"
  },
  "RrEDDeNnf036qlIrx7Z2tQ": {
    "date": "4/6/2014",
    "text": "These burgers are not for beginners. Big suckers, lot of meat. Messy. But really damn good. The sides are solid as well. Free refills on the soda.Decent value. Fairly busy spot. Tables are first come, first served. Likely one of London's top 10 burger joints.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "muxohLRpkEm1beXPefpGow": {
    "date": "9/1/2014",
    "text": "Unapologetically Burger. That about sums up the Meat Market.Nothing is left half-hearted here. From the chilli cheese fries with jalapeños on top to the deep-fried bacon on your cheeseburger all the way to the bourbon-and-maple-syrup milk shake, you will find everything here that you shouldn't have - but really, really want.The staff is friendly and if you really don't know what you want, they'll be happy to make suggestions.So if you've had one of those days, why not treat yourself to a really good-for-you-bad-for-you dinner?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HiF85NcR-A0JuhA_nNAuXQ"
  },
  "3BXVkkWTraASwRxpFBobQA": {
    "date": "5/14/2013",
    "text": "This is more low key than MeatLiquor, and has a cut down menu. But it is still a decent place for greasy burgers/dogs, chili fries and a drink.I will always order the chili fries whenever I go here (and I have been a lot), and I take the burger, dogs and cheese steak in turns. I rate the cheese steak and dogs over the beef burgers, but enjoy it all.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nUQDnlfdpSP9YPzees_xg"
  },
  "JdEjKXwxaMZDauiKJwBFMw": {
    "date": "12/19/2013",
    "text": "Swinging by Meatmarket late one evening, I was a little unsure of what to expect. I had heard a number of mixed reviews from friends. At least, due to the time of night. It was easy to place my order and have it made!Maybe it was my fault for ordering the Chilli Cheese Fries, but I have to agree with Larissa and her tummy ache troubles - my normally cast iron/asbestos lined stomach grumbled and ached after eating here.I am not a huge soda fan so the all you can drink bottomless option was not enough of an inducement to order that and I went for a good old water instead. Which was just as well due to the huge salt content of the food!Pricewise, MEATmarket was fairly pricey for chopped up moo-meat in a bun and chilli cheese fries. Not prohibitively so, but I would say that Honest Burger offers a tastier, superior burger with better fries for a lower price.This place is certainly not where you would choose to take a date, unless you like, sparsely furnished hipster decor with loud and flattery ambience. For me, and a buddy it was pretty cool though.Overall, MEATLiquor was a better experience for me, but overall Honest Burger still holds the West End Burger Crown!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "xNMIbD4X1qa4x8CrZ_BbkA": {
    "date": "8/6/2012",
    "text": "I really want to love this place ...I mean #Meateasy was the best burger joint in town and meatLiquor just plan rules as an overly hip burger joint in weird industrial feeling back street (surely the definition of cool).But MeatMarket with its personal ads hanging from the ceiling which read like the kind of funny lines thought up by 40 something execs who think they're being cool and funny, but as they have never been cool and believe cool is the fashion bits in the Evening Standard colour supplement will obviously never be cool and witty.The burgers are dreadful and the hard liquor milkshakes are the definition of dull.The location is again a very weird back street of somewhere that is just around the corner from places that are famous and easy to get to ... The décor with its colour scheme of black, white and red should look like a Che t-shirt, cool and revolutionary, but feel slightly more like a jumble of good ideas. And the hot dogs and chilli cheese fries are to die for (although like all the other venues if you don't like VERY salty bacon don't order anything with bacon in it). Oh and if you like a Philly cheese steak roll it is worth eating.I hope it doesn't go bust and am grateful that after a number of visits I have found things to eat there but would I recommend it to other people ... Hmmm ...I think that says it all",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "e6gCLjdMQZjcjFukNuZtxg"
  },
  "1VnfMCOFQ4LJi0BY80eA_A": {
    "date": "7/16/2012",
    "text": "I'll set out my stall straight away - I was incredibly underwhelmed.Having bought the hype and gone to Meat Liquor (ML) a few months ago, only to be fairly disappointed, I hadn't expected that I'd go to another franchise. However, I found myself in Covent Garden, and figured that everyone deserves a second bite of the cherry, so off I toddled to Meat Market (MM) with some friends ... a couple of cocktails to the good and feeling magnanimous, hoping that MM would blow my socks off and absolve the chain's previous failure to delight and entrance.Alas, whilst ML had been only mildly disappointing, this was hugely disappointing. So let down was I, that I was actually angry. \"Who are these tasteless numpties who keep banging on about how great these burgers are?\" I cried, gnashing my teeth and tortured by despair which can only be likened to King Lear (or any number of Shakespeare's other tragic leads, for that matter).First off - the decor and location. It's ironic, low-rent and perfectly fine. Claridges it is not, but you wouldn't want that anyway. The former takeaway menu signage being left up feels a little gauche, but I get it ... it's somewhat funny. All in all, it was totally fit for purpose, if not a massive point in its favour.Service - we went earlyish (6pm) on a Saturday. It was surprisingly unbusy, so we were not rushed out. Staff were perfunctorily polite - not super engaging, but hey this is only supposed to be a burger joint. As with the decor, let's judge it on what it's trying to be (rather than what it could be).Drinks - one of the saving graces of the meal, perhaps in no small part because they offered booze to ease my pain. \"Hard\" milkshakes using Coole Swan (\"dirty white\" ... CS being a sublime whisky cream which spanks Bailey's like a red-headed step-child) and Woodford Reserve & maple syrup (\"beige\") were both excellent. Supremely tasty and well-conceived. Bravo. \"Miami Vice\" comprised a mix slushy of pina colada and strawberry daiquiri. Fun idea, and it also slipped down quite easily. Food - arguably what we all really care about. We ordered a Black Palace burger, Ripper hotdog, Philly cheesesteak, corn puppies and chilli cheese fries.Chilli cheese fries came came in a bizarre lasagne-esque mess, but was fairly solid - ground meat was reasonably well-seasoned with decent flavour, chips were adequate, cheese was quite nice.Corn puppies (livery/porky andouille sausage in corn-bread) were surprisingly good. Quality of the sausage was good, with a satisfying coarse grind interplaying with the unique texture of cornmeal dough. Philly Cheesesteak - I wanted to love it, I really did. Overstuffed, under-flavoured. Just incredibly bland. Beef of dubious quality, but you don't expect sliced fillet (though at these prices ...). Cheese sauce was alright, but sparse.Ripper hotdog - what an absolute bloody mess. Covered in \"Danish sauce\" and mustard. Completely drowned the dog, which was quite nice in isolation - good solid bratwurst. Bun was meh. Overall just a tragic disappointment, rendered almost inedible by monsoon-like quantities of peripheral condiment.Black palace burger - thoroughly mediocre. Patty was overcooked IMO. Burger was overstuffed , and the bun disintegrating. It's just so \"busy\" ... too much going on. Not a bad burger per se, but certainly nothing to write home about. Just a big indistinguishable and unremarkable mess The thing is, in another time and place, MM/ML burgers may have passed as being good ... but in a world where Hawksmoor exists (or on the other end of the spectrum - Shake Shack in NYC) there's simply no excuse for burgers which fall so far from the pinnacles reached by others. Eaten at a burger van for half the price when you're drunk, these would suffice. For these prices in the heart of Covent Garden when you're sober, it's incredibly under-par.Shame, really.",
    "rating": 2.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "jmZw98KuIqvp8NNaTZJDuA"
  },
  "TI7Sc3Jt7bCO11hT75jA1g": {
    "date": "8/24/2013",
    "text": "One of my hubby's coworkers claimed this was the \"best\" burger in London.  I completely beg to differ!First of all, the meat.  You can only order burgers with multiple patties.  That is just a little too much meat for me (overcompensating?).  The meat had very little flavor to my great disappointment.  To be a good burger, the patty should be able to stand on it's own and this was simply not the case.Second, my bun was completely soggy (from grease?).  Yuck!  I couldn't even lift the burger to eat it, because it was falling apart.The only reason why I didn't give it 1 star is because the fries were okay and the atmosphere was interesting.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqkXwOT7k-QQJB5Eiu4ykA"
  },
  "kadzGh46Jv80B1P7SOGiaA": {
    "date": "1/16/2014",
    "text": "Someone told me that this place is from the same owners as Meat & Liquor so my expectations coming in were high. Lets start on a positive note: the staff are super friendly and the decor is pretty cool. Very relaxed, very well located... the term burger joint suits it just fine (and I mean that as a compliment). The price range is also pretty decent and you can get refillable sodas.However, I don't think the burgers are that great which is a bit of a problem if you are in the business of... well...: selling burgers.I got a bacon cheeseburger that had so much condiments that you could hardly taste the meat (was there any bacon in that onion brother?). It was an outpouring of mustard with an excessive amount of onions and pickles. Too bad! Also, although it's a double decker, one of the burgers was pink inside and the other one overcooked - what the heck happened to the twins here?The fries weren't too bad but nothing to die for. And yes, you can die for fries: just ask Shake Shack or Five Guys. It's an average place that I think has the potential to get better. If you are looking for a place to get a quick decent burger before going to the 7.30 theater shows then this might be your place since there's hardly any queue (at least on weekdays) and the food is just about average. But if you want something a bit more \"yes brother!\" then look elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMEWEhMMtG90t8my48f7jg"
  },
  "F-NES1c8i4jVGe-nQld7rg": {
    "date": "7/11/2012",
    "text": "Now everybody seems to rave about MEATliquor/MEATmarket so i thought i'd check it out and see what all the fuss is about, as i was in a rush to get to Brixton for a Faith No More gig i opted for MEATmarket and found it with no trouble as the neon MEATmarket sign lured me in, so my first impressions were good, i loved the decor, so rock n roll.  So i scanned the menu, i ordered 'The Dead Hippie' burger, Chilli Cheese Fries and the Jalapeno Poppers and when it came out i was like \"SHIT\" that's a mountain of food, the only thing that surprised me was the burger size, i had visions that it would be bigger than that but anyway, i'm glad it wasn't in the end.   So, let's get down to business, First up the burger, my first bite was one i'll never forget, it's was a explosion of flavor, the onion, the pickle, the sauce, then the show stopper, the patty, seasoned just right and nice pinky tinge in the middle, heaven! So whilst i was in burger heaven i decided to tuck in to my sides, the chilli cheese fries is the biggest value for money on the menu, £4.50 for a tub of fires, mixed in with tasty chilli all topped off with stringy cheese, onion & French's mustard, really good.  The poppers were also good, crunchy on the outside nice a gooey on the inside, winner.  After i had eaten this lot, i sat back with a grin on my face as if i had just won a Olympic gold medal for the most  amount of food consumed, a truly glutinous experience which should make my Weightwatcher weigh-in very interesting tonight, so all in all, a great food experience.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "A_ki-IX4owLVeLnIykGvgw",
        "caption": "Photo of MEATmarket - London, United Kingdom. THE DEAD HIPPIE BURGER",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A_ki-IX4owLVeLnIykGvgw/o.jpg"
      },
      {
        "img_id": "D40tp2CIeE4pxe3ufQ3pKQ",
        "caption": "Photo of MEATmarket - London, United Kingdom. The Dead Hippie Burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D40tp2CIeE4pxe3ufQ3pKQ/o.jpg"
      },
      {
        "img_id": "_RauuW3hzQ6s85AbbShKZg",
        "caption": "Photo of MEATmarket - London, United Kingdom. Gooey Jalapeno Popper",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_RauuW3hzQ6s85AbbShKZg/o.jpg"
      }
    ],
    "user_id": "JYuy-qxJvV7GXfnpH87odA"
  },
  "OyZokppeu0fLCjxZd5LMvw": {
    "date": "9/7/2013",
    "text": "Not sure what it is about this place. As much as I find MeatLiquor overbearing, I prefer it to Meatmarket.I've only been here once, and I'd have to give the burgers a 4 out of 5. It's pretty much on par with meatliquor. Also, there wasn't really a wait and we came on a Friday evening so that was nice. Despite all of these sounding like plus points, the experience just wasn't that great.It feels like McDonalds, and the whole experience is just too 'sterile' for lack of a better word. Good burgers but I wouldn't go back. Especially now that shake shack is around the corner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tIXoexTdxCj2B8S-4jFOPA"
  },
  "vB0x_vs8nwZPnRWArI6duw": {
    "date": "9/27/2012",
    "text": "Look - this place may be cheesy/corny, and it may not be uber stylish, and no, their burgers aren't quite a shack stack or a beloved 4x4 animal style, but the burgers are great (at least in the american sense, which is very obviously what they're going for) and the chili fries honestly feel like they're from the other side of the Atlantic. I will say this though -- who honestly thinks hard milkshakes are a good idea? Has anyone ever enjoyed more than the first two sips of one? None for me, thanks. Also, draught beer would be a big plus. Please get on that, MM.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Vh-z4u73KV3GhP1KOL36uA"
  },
  "Gw6IOAppL8tt5-U81KTtUw": {
    "date": "10/22/2013",
    "text": "I think I'm willing to go out on a limb here and say that this is the best burger I have had in Europe. While there are many worthy burgers in London, this one is my favorite because of the unique blend of location, locale, service, and quality. London is definitely the burger capital of Europe and, because of this, I'm sticking to my \"best burger in Europe\" rating for Meat Market. Here's why:1. Selection of burgers is focused: Black Palace, Basic, Cheeseburger, Dead Hippie, and a few others. The Dead Hippie is the best of the bunch if you want your burger \"done up\". Otherwise, the Basic is a hit for me. Many would love to bathe in the Dead Hippie sauce. Me, I like it, but I also love a streamlined, high quality, beefy-tasting burger. Meat Market delivers that on a great role at a reasonable size and a great value for the money.2. Friendly service. Every time I come here, I feel like I've made friends with the friendly team. 3. The chicken wings. You know how I said that this place is dishing out the best burgers in Europe. Well, they are also in contention for the best chicken wings in Europe. Unlike the continental purveyors, Meat Market skips the 5 spice and other \"off\" flavorings and focuses on a true buffalo sauce. Unlike the wing place I went to in Vienna (Smokey's), these are served with true blue cheese dressing (as they should be), celery and carrots. At Smokey's, they're pushing \"ranch dressing\" and when I asked them for blue cheese, they said \"nobody has ever asked for that before.\" RUSRS?!?!Still on my \"to try\" list: the alcoholic milkshakes! Oh, yes, I will try them.I noticed they have opened a Shake Shack nearby. Skip it. Shake Shack is just a corporate chain burger of higher-than-average quality. Meat Market is a superior burger experience with a lot of soul. Shake Shack can't touch it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z9jWNM1UevSmHjcaPGFQng"
  },
  "yt_gRnAfyMABMoR1DH9Mww": {
    "date": "5/14/2015",
    "text": "Great place if you are after something filthy, dripping in tasty fatty goodness. The burgers may not look big in size, but they pack a lot of flavour. I love the spicy green chilli one - seriously spicy and will make you sweat. The buffalo wings here are great as well and the monkey fingers, made of chicken breast pieces smothered in the same tasty buffalo sauce. They both come with a blue cheese dip that (unlike at some other places) has actual pieces of blue cheese in it.If you have space left for their milkshakes, I highly recommend the vanilla one with a shot of bourbon. mmmmh.Ordering is done at the till, you pay upfront and your number gets called out when the order is ready and you go collect. Simple and efficient.Decor is quite interesting too.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "50CiFw-_PZqOT1hUOrDyng"
  },
  "G_9fhHkxDUHh2YzXb8DSnw": {
    "date": "3/1/2015",
    "text": "Meatmarket was a fast paced, crammed dining experience, but I blooming loved it.We had got in here late on a Friday night after travelling down from Glasgow, and were gagging for a burger. Meatmarket delivered.The decor is wild - it's a bit spit and sawdust, with basic furniture, a stripped down, minimalist effect and all the feel of a fast paced food bartering system. Trendy, arty, backlit signage dangles down from the ceiling, including some cheeky customized signs. My favourite was \"Ice Ice Baby\", in relation to nothing - it was just a nice wee nod to Vanilla Ice.I loved the old school market feel of the place, with food being called out in the style of an old diner, and the place having a constant turnover of dinner guests. It was a bit frantic for some of my pals but I liked feeling as though burgers were going out of fashion and I had to grab the tastiest one off the menu before I lost my chance.Staff were friendly, a good laugh and didn't crumble under the pressure of the enormous throng of people waiting to get in the door. Surprisingly, although it was the weekend, we all got a seat - and there were about 8 of us. Despite it being mobbed we didn't get rushed on, and had time to digest our burger and listen to some of the tunes.Busy, throbbing, vibrant - not for the faint of heart at the weekend, or someone on a first date who wants to hear what their future wife/husband is saying - but great fun, tasty, fresh food. Loved my chicken burger - typing about it is making me hungry at an Ungodly hour of night - I also found out this was my boyfriend's fave place when he's in London. Next time we're both there we'll need to make a pilgrimage!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5iRCT4uAsyP1UoEUoxbylA"
  },
  "G4kfMAg4HNdr2-dNVB7beg": {
    "date": "3/21/2014",
    "text": "I'm starting to get sick of burgers...went to Honest Burger on Monday and Tuesday came to this place. I mean, not long ago I was at Five Guys + Shake Shack and there's still a long list of burger places to try, what to do?? Surely I cannot live out my life purely on more burgers?First impression: Hmm this place was a bit hard to find, even with google maps on the phone. Vaguely knew it was near Shake Shack but wandered to the wrong side of the market and had to ask for directions. Nevertheless, we got there after a movie at around 8pm and it looked completely deserted outside! Market is closed, no-one at the entrance, we thought the place had shut down! Nevermind, up the stairs and two doors later you immediately hear the loud music pumping out. I like the signs above the tables, there were a lot to take in, and obviously, the usual red and white decor of an American joint. Overall, it's not posh, it's canteen style and I don't mind it one bit. For some reason there were only about 2 people when we got there but while we were pondering over the menu at least like 10 people followed us in and the place became packed. Maybe they all following us from the cinema?Food-wise we picked the bingo wings, cheesy fries, dead hippie, black palace, and a root beer float. You order at counter and they deliver any pre-made drinks, although soft drinks and water are self service. They call out your name and you pick up the rest of your order about 5-10 minutes later.Onto the food:The burgers are not overtly huge so you could order sides! YES!Black Palace - I didn't really like the sauce, the burger was ok but it was splitting in my hands....Dead Hippie - OMG the sauce is amazing. Because me and Wendy L split our burgers 50/50 I ate this first and could not commend it enough....and then I ate the Black Palace and regretted eating Dead Hippie first :(Bingo Wings - I think this is the real authentic taste, but sadly enough, I like my sweet BBQ sauces and didn't really appreciate this one, even though there was a mayonnaise? dip to cool down the flames.Cheese Fries - MMmm these were nice until the cheese congealed, but not bad. Still prefer cajun fries from Five Guys though, please introduce to menu.Root Beer Floater - I love A&W, a lot. So this is a winner. Might be tempted to come back and try one of those hard shakes all the other reviewers are talking about another time though. I love my sweet drinks.All of the above came to around £30. Not bad I suppose, the Dead Hippie was really nice. Would come back just for that.Next mission: To go to the rest of the meat sister restaurants. OH NO! Did I just tell myself I need to eat more burgers?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QFS6BLw4R87KGOKJMLxN8A",
        "caption": "Photo of MEATmarket - London, United Kingdom. Black Palace",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QFS6BLw4R87KGOKJMLxN8A/o.jpg"
      },
      {
        "img_id": "U9EanRcee_2yrP7Y81BEVw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Dead hippie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U9EanRcee_2yrP7Y81BEVw/o.jpg"
      },
      {
        "img_id": "Yt387qqJVRZO1krdu7nFXA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Bingo wings, cheese fries and 2 burgers",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yt387qqJVRZO1krdu7nFXA/o.jpg"
      }
    ],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "um-UxrQl1bU9P1MUTOTh2Q": {
    "date": "6/23/2014",
    "text": "Grabbed a late, post work, post bar dinner here.  Have been a couple of times before and it doesn't disappoint.Opted for a juicy bacon cheese burger.  Was cooked perfectly and really tasty.Had chilli fries on the side which were nice but beat me!It's a great simple place, with a great mix of customers and friendly staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9f1s2Wi6bJ1Y5aJfG77d-g"
  },
  "hxwMsIPVQWTUBfvPTHiPJw": {
    "date": "10/4/2016",
    "text": "The Dead Hippie burger and Fried Mac N' Cheese were freaking incredible. The fries definitely left a bit to be desired, though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkFnVaNQTc-SrGsCgTbXwg"
  },
  "J9Xbh4B6_wCo1QAnKpQYeQ": {
    "date": "4/13/2015",
    "text": "I have heard so many things about the Meat chain of restaurants and kept forgetting about this little gem tucked in behind Covent Garden. I think it's because it's tucked away upstairs above the market itself. This isn't a place for fine dining. It's a place for stuffing your face with some of the most inventive burgers around. I kind of wanted a hot dog but who goes to a burger place and orders a hot dog?! I'll save that for Bubbledogs whenever I get round to going. I ended up having the mushroom swiss and a side portion of deep-fried mac n cheese because um who wouldn't? I was tempted by the poppers but I never know how spicy those things will be.When you order they take your name just like in Starbucks and shout it out when it's ready for you to collect. Not the most sophisticated system but it works. For some reason despite him ordering before me my food came out first but that was a blessing in disguise as it meant I had time to take pictures of my food before we started chowing down.The burger was a double patty beast that was just perfect for picking up and taking a massive bite of. No forks and knives here people just get stuck in however you can. Normally I like my burgers well done but MeatMarket cook theirs with a little bit of pink still in the middle unless you ask otherwise which is how I ended up having mine and it was delicious. One of the best burgers I've had in a long time.The deep-fried mac n cheese was OK, nothing to write home about as was the brain freeze cocktail that I had to go with it. (They actually forgot about my drink and I had to go up and ask for it once I had my food.)MeatMarket is a great place for a catchup with friends, it's got a great buzz to it and were playing some excellent tuned when we were there. I wouldn't recommend it as somewhere to take someone on a first date though!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vwgvK7fyM9ahSZzdKuksZA"
  },
  "Mfv2Oimlb0BZlAj7PFFOaw": {
    "date": "5/25/2014",
    "text": "Just tried this place and I fall In love :) the we spent 25£ for two bacon cheeseburger, fries, beer and coke. Really a good deal!The location is cool and the meat is not good.. Even better! Free refills on soft drinks!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aQzILmsAbU3ky9wPQ3Y34g",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aQzILmsAbU3ky9wPQ3Y34g/o.jpg"
      }
    ],
    "user_id": "OCW7PI4LumTQVpOkpQINog"
  },
  "nbrLKBEfCFQmr3VOfgGAAw": {
    "date": "7/15/2012",
    "text": "A lot of effort and care has been taken with the decor here to try to persuade people to part with more than £10 to purchase a burger and fries from this take away joint.However, while sitting in the midst of this hipster chic is fun, the burger itself disappoints.   It is greasy (something which is not helped by it being served wrapped up McDonalds style) and also very difficult to eat - too many ingredients crammed into a relatively small bun.The staff are very friendly but also super efficient - your burger is made worryingly quickly and then cleared away with military efficiency as soon as your meal is finished. This is clearly not a place to linger!For me, there are better options available.  However, it is still probably coming here at least once, just to check out the crazy decor.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O8cqOd8wpVQsBjouJGUsEA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Converted Veggies!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O8cqOd8wpVQsBjouJGUsEA/o.jpg"
      }
    ],
    "user_id": "sXcEvJHocUnXLGl0xILYgw"
  },
  "rLZuALylrRZ7JUTGdV-kXw": {
    "date": "6/22/2012",
    "text": "Coming from an American that usually gets disappointed with burgers in this country, definitely agree these are the best I've had.  Yeah they're messy, but there's no shame in fork and knifing it like I did.  It was delicious!  The fries were just like McDs!  They can ease up on the salt but none the less really good.  If you order soda, it is all you can drink!  I suppose it helps with the salty fries.  It really doesn't get any better than this.For a burger, fries and a drink it came out to about £13.  Not too bad especially if you're comparing it to getting burgers at pubs.  It is a bit big.  I felt like a real sense of achievement when I finished it but also thought I should skip dinner that night.  The only thing I wish they had were 1 patty versions because they all come with 2 patties.  Only odd thing is that the place overlooks the Jubilee market in Covent Garden.  If you're ever in the mood to people watch tourist buying random trinkets, this is def the place for you.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "aMBDE9gXezR3Yet4isCQtA": {
    "date": "7/8/2012",
    "text": "After a completely depressing 4th of July \"celebration\" in the UK, I decided that I needed to ease my depression by gorging myself on the most American-esque food possible.  Ummm,  hello MEATmarket!My friend and I both got chili dogs and split an order of chili fries.  Oink oink, yet no shame...these dogs were good...real good.  Battling the crowds at Covent Garden is always painful, but I'll happily do it again for a taste of the MEATMarket!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kZEH4nejufwaTP6Ka3WgIQ",
        "caption": "Photo of MEATmarket - London, United Kingdom. Hellllllo yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kZEH4nejufwaTP6Ka3WgIQ/o.jpg"
      }
    ],
    "user_id": "79LjNkAODyzlwW2X4AqkfA"
  },
  "_zhmnmjSPCk6_fh0SA7mpA": {
    "date": "3/24/2014",
    "text": "Maybe it took me too long to finally get my hands on the 'Meat' chains that by the time I did which was just last week, better burger chains such as Patty and Bun have already overtook over the' better' burgers in London. Sadly Meatmarket was disappointing and did not live up all the hype I've heard. It could have been a bad day as it wasn't a bad burger but assembled and made poorly.We arrived quite late in the evening and I did like the old  building it was located in, cold looking backstreet of Covent Garden resembling nothing like a restaurant inside but more like a typical office building or a school entrance. You only knew you were in the right place with the big 'Meatmarket' lit up sign and it's display bike outside.Inside resembled nothing like I've seen before, American diner themed but not the bright lit up, clean vivid ones we may be used to but the dark, sinister kind, the place you would expect to eat your dirty burger served in a ruffed up paper wrapping and sides in disposable aluminium trays. It's clearly a fast food place and not one for service with a self water machine, cutlery, napkins and condiments, all readily available. Seats were off high stools against thick wooden planked tables going across this narrow restaurant, more for sharing  with others, for single diners too. It was cool looking but may not be everyone's cup of tea.As my first visit I had to order a bit of everything so we shared the well known Dead Hippy Burger, Black Palace, cheesy fries and bingo wings. Firstly our patties itself was too overdone as we found it disappointing that we couldn't request for it to be cooked medium rare. I think the main reason why we preferred the Dead Hippy Burger a lot over the Black Palace was because the patty wasn't as overdone. With two thin patties stacked into one burger the last thing you want is two bite into several layers of the over charred hard crust of the patties which really ruined the texture of the burger. As our buns were quite doughy and thick to hold the bun, it made the Black Palace burger a bit dry although saved by the sauces and the juicy onions that was in there. But I didn't enjoy the coarseness of it all. The Black Palace burger itself was also quite bland. The more successful burger was the Dead Hippie as the patty itself was more pink and juicy. Wasn't perfect and I would still prefer one thick slab of juicy patty rather than two medium cooked ones. But flavour wise this one was very good and I believe it was that dead hippie sauce they used which consisted of mustard and pickles- lovely heat coming though. Compared to the Black Palace there was a lot of flavour packed in and I enjoyed the doughier bun soaking in all that lovely sauce too.Sides also let me down. Cheesy fries were good for a while until the cheese went cold but it was just cheese on fries, nothing special and the fries were quite plain and average. Bingo wings came smoothered in it's homemade chilli sauce which was okay but it didn't hide the fact that were slightly overcooked too which meant the edges of the wings were tough and dry. The cheese dip did help a lot in its enjoyable but for the wrong reasons. Portions wise they were very generous and overloaded our containers but this is when it really felt like a poor American takeaway from the local pizza shop. I do feel I need to give the other 'Meat' chains a chance as it could have been the chef that day. The Dead Hippie Burger was the only thing that was made our meal worthwhile and memorable, enough for me to even want to go back to give it another shot, that and the lovely root beer float I had. Personally I wasn't a big fan of the high stools and dark cold atmosphere, wasn't really comfy and quite spooky. But that's my personal preference. Still something needs to done with the consistency of how the burgers are cooked here. Not acceptable for such a well known brand.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5fXlHkpJ7DqUfz1fcyM_2A",
        "caption": "Photo of MEATmarket - London, United Kingdom. Dead hippie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5fXlHkpJ7DqUfz1fcyM_2A/o.jpg"
      },
      {
        "img_id": "pzIZNrf7WSnPmjZLkptk0A",
        "caption": "Photo of MEATmarket - London, United Kingdom. Black Palace (patty overdone) :(",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pzIZNrf7WSnPmjZLkptk0A/o.jpg"
      },
      {
        "img_id": "_s6jXmW7j3Y9eEWoIQs0zQ",
        "caption": "Photo of MEATmarket - London, United Kingdom. Bingo wings and cheesy fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_s6jXmW7j3Y9eEWoIQs0zQ/o.jpg"
      }
    ],
    "user_id": "GhmA0xBVIxxlfOhnEiUyIQ"
  },
  "vdi4_eHfWdwPlpw1wbW5Bw": {
    "date": "9/14/2013",
    "text": "MEATmarket is a lively burger joint catering to young people looking for a tasty bite with their friends. Featuring tasty burgers, fun sides, and social seating MEATmarket is a fun place to be. Despite being very popular, it seems serving times are generally pretty rather quick. They are famous for a few burgers, but I decided to try the Dead Hippie burger that has helped to put them on the map. The Dead Hippie is two very juicy beef patties, a soft bun, dead hippie sauce, pickles, and minced white onion. The Dead Hippie's ingredients all melt together into a perfect combination. Each bite has a perfect distribution of flavor and ingredients. The stand out ingredients are the dead hippie sauce, the medium-rare beef, and the soft and tender bun. The creamy texture, soft bun, flavorful sauce, tangy pickles, melted cheese, and are executed perfectly . While the burger is very messy, it is still manageable in size. Due to the size of the patties, putting two of them on top of each other with another slice of cheese is not overwhelming. Given the price of this burger, and the speed it came out of the kitchen, this is definitely one of the best places to satisfy a sudden burger craving.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wjRNA6XBr8q91DckQh6zuA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Dead Hippie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wjRNA6XBr8q91DckQh6zuA/o.jpg"
      }
    ],
    "user_id": "GwKyDhybZm6huIQFC2IbjA"
  },
  "4fH9xcHDDLx2jyeW54rkKA": {
    "date": "5/6/2012",
    "text": "MEATmarket - think Meat Liquor with an emphasis on queue-busting speed of service with a menu to suit. Favourites from its sister venue such as the Double Bubble and Philly Cheesesteak are there along with new items including several mean-looking hotdogs, jalapeño poppers and a range of boozed-up milkshakes (What was that? \"Jägermeister soft-serve\"?!).The new double - the Black Palace burger - is a beaut, loaded with sautéed onions, two juicy patties and American cheese to bind the whole delicious mess together. It was described as 'the perfect burger' more than once among my dining companions - the type of sandwich you eat, regret, and want to eat all over again (twice) within the space of ten minutes. When we were there two of the new hotdogs weren't available (the \"Kraut\" and the Corndog), but the \"Ripper\" was a success - a 'Dutch frank' covered in bacon, minced onion and a special sauce not disimilar to the Big Mac's. Beastly.Throw in a range of frozen cocktails and desserts - the 'Miami Nice' looked mean - and a menu that we were told by our waitress would be growing in the not-too-distant future, and this slick operation looks like being another central pole in London's burger geography.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vVtDqmPi2x_XVKUqUAs7IA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Signage almost as filthy as the edible offerings.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vVtDqmPi2x_XVKUqUAs7IA/o.jpg"
      },
      {
        "img_id": "qi6I211HP4s_hAfIuxdFbQ",
        "caption": "Photo of MEATmarket - London, United Kingdom. Restaurant pano",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qi6I211HP4s_hAfIuxdFbQ/o.jpg"
      },
      {
        "img_id": "ep8YoYxNIHAffSS2fBGlhA",
        "caption": "Photo of MEATmarket - London, United Kingdom. The Black Palace burger - royally filthy...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ep8YoYxNIHAffSS2fBGlhA/o.jpg"
      }
    ],
    "user_id": "LbdSUsuvfhaZ4xJVziUgwg"
  },
  "kB1cbGj4sekmNG5UinEnYg": {
    "date": "5/2/2015",
    "text": "Meatmarket is perfection, the burgers, the fries. Yum.Highly recommend the vanilla milkshake.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iTT3eqVjgkClv3qu0OuKFw"
  },
  "RluFwKziXF9i1z2h0JnbDg": {
    "date": "3/23/2016",
    "text": "It's a no from me.  The atmosphere felt like a cross between an actual meat market and a cheap diner.  The prices were actually a lot higher than you would think.    I went with friends and no one liked what they got.  Just skip this one.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "vOW1x7kSmQtmxCOg-S1nEQ": {
    "date": "8/9/2014",
    "text": "The winner in the burger wars is the Meat chain... This is the quick in/out experience unlike the other locations.They now do some of the other popular items such as the divine bingo wings, hippy fries along with the awesone signature Dead Hippy burger.Update: Not what it used to be, still some great items like bingo wings and Dead Hippy Burger but the recent menu changes are not good.  Dropping the Philly Cheese is a mistake, and the void speakers are now vibrating badly killing the atmosphere along with a retina burning menu display.Dropped a rating star, fingers crossed it will not continue this journey down to average...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wfX5k1Mx4l-PottuvZzTVA"
  },
  "cFU6_3puaujCZPrVivqVUA": {
    "date": "1/22/2016",
    "text": "Food was great but the decor gave me a headache. My preference is for a more comfortable dinner with less sensory overload!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvgVPn7xyDS2T8kJf0F7PA"
  },
  "TNb5pfFFBxfMYGqpadnJGA": {
    "date": "3/12/2014",
    "text": "Attention American ex-pats: Buffalo wings.Like, actual Buffalo wings, not a sad approximation thereof.Let's break it down:Buffalo wings: As close to the real deal as I've found in London to date. They're tossed in a proper hot sauce/vinegar/butter sauce and served with the closest thing to blue cheese dressing you're likely to encounter on this side of the pond. You get a big basket, they're saucy and messy, and they're also crispy and delicious. Get some. You'll thank me.Buffalo chicken burger: This is my gal's thing and not my preferred rodeo, but she ate every scrap.Philly cheese steak: I won't stop trying. Sigh. Ok, but they got a little closer than most. You can see my review of Soho Diner for what maketh a cheesesteak, but this wasn't bad. Next time, I'm asking them to hold the peppers and the black pepper (cheesesteak meat is meant to be pretty bland) and go heavier on the cheese; that might get us closer to a cheesesteak in flavour if not in texture. But, not a bad turn-out.Hobo fries: I'm not sure I want to know how many hobos go in the sauce, but these are delicious.People get a little rammy about sharing a table, but elbow your way in and make some new frenemies. Now you're in the know.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y8Fc_lP3Lgzns-0XXaLSEQ"
  },
  "U115wDCI-36EIzzZ2Os39w": {
    "date": "5/6/2012",
    "text": "Tried out MEATmarket for the first time on Saturday night, having read about it on Thrillist. It was very good and the Philly cheesesteak I had was nearly up there with Pat's from Philadelphia. Make sure you try the hard shake with bourbon and maple syrup in it. It's not cheap though for what is essentially a fast food place. A burger, cheesesteak, fries, jalapeño poppers, two beers and two hard shakes came to £40.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PW2NngnGjY9w0Jqa-8W8vw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Philly cheesesteak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PW2NngnGjY9w0Jqa-8W8vw/o.jpg"
      }
    ],
    "user_id": "Da1T5_Ffi9bylFEoHn9FTw"
  },
  "ODQGz2Y_Z9ue60M81J3LOg": {
    "date": "12/20/2014",
    "text": "Sometimes, all you need is a good burger. MEATmarket delivers this and leaves you wishing you could try things you didn't know you wanted. Slightly off the beaten track, its worth finding, head to the back of Jubilee Market, look up and look for the red and black writing, head up the stairs, menu on your right as you enter. Order at the counter and they'll call your name when the food is ready. Bottomless soft drinks are a nice touch and I enjoy having kitchen roll on every table, its a messy business after all!Only issue was chips weren't piping hot, just hot. Fussy? Moi?Burgers are great, juicy, piping hot, stringy cheese and a cool, open kitchen  environment to eat in. Great burger option in the area, especially when competition in the area has a big queue. I don't feel like I settled for the poorer option just because I didn't have to queue for my lunch, the very opposite actually and I will come back, soon!!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n8w-TgVOXaISN6Kyoogo1Q"
  },
  "p3ApGNLTVK2GOgHwTdADJg": {
    "date": "7/12/2018",
    "text": "Awesome burgers. Went for lunch and had the £10 special.  Burger, HUGE amount of fries and unlimited soda. Would definitely come again.  Our Hippie burger had a yummy sauce and we had it rabbit style (no bun). The buns were also great if you decide to eat it the regular way. Double patties were cooked and served perfectly.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mha6sVepd3wQ4ARyxo6M9g",
        "caption": "Photo of MEATmarket - London, United Kingdom. Hippie burgers rabbit style (no bun)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mha6sVepd3wQ4ARyxo6M9g/o.jpg"
      }
    ],
    "user_id": "R8pT1RRQ8OhCzNQRB9stHQ"
  },
  "Df8hlNErO3l-C-5IyJ_l8A": {
    "date": "8/19/2017",
    "text": "Fun, casual dining when you need a greasy fix. I particularly like the artwork and peering into Jubilee Market below. Cool mix of music and quick service. The dirty burgers are messy but that's the point, right? Cooked well and served in a wrap paper as they should be. So many types of sides and fries. We went with the buffalo fries which were topped with chunks of blue cheese and a side of spicy sauce. The winner was clearly the POPPA, jalapeño poppers that oozed cheesy goodness and ranch dipping sauce.The shake was not too bad either. Great flavours and recommend the salted caramel. It was a bit smaller than expected for nearly £5 but a tasty treat. This place has clogged my arteries but I would say it was a good spot when you want a satisfying meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JZV6VD23dIj3UkElgqD72g",
        "caption": "Photo of MEATmarket - London, United Kingdom. Entrance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JZV6VD23dIj3UkElgqD72g/o.jpg"
      },
      {
        "img_id": "GgL4vWKy4XxtI2PE2yxGoA",
        "caption": "Photo of MEATmarket - London, United Kingdom. View of the market",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GgL4vWKy4XxtI2PE2yxGoA/o.jpg"
      },
      {
        "img_id": "R4LM9KoyxXRlKr0oP3LkOw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Unhealthy but satisfying",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R4LM9KoyxXRlKr0oP3LkOw/o.jpg"
      }
    ],
    "user_id": "gs1HAp_sImvHS_yCfySaKQ"
  },
  "JzhZhKx5ZeB5w-gVJ2Xo5g": {
    "date": "4/30/2017",
    "text": "This was a recommendation from a transplanted Londoner, and we are so pleased we tried it. It is a bit hard to find, but convenient to Covent Gardens. It is upstairs and overlooks the market area.It has a unique atmosphere like a deli in New York or Los Angeles. It is clearly a burger joint with a lot of additional offerings to make it special. My wife and I tried two different selections of chicken sandwiches, mine was a Chicken Parmesan and my wife had a Dirty Chicken. Both were very, very good. Bottomless cokes and excellent fries make for a delightful lunch.OH, PRICE SPECIAL ALERT! If you have theater tickets, present them for a special price and special offerings. We saved about 30% on our order! Otherwise, not cheap, but worth the price!We loved it here and would highly recommend it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t4_0Xy1yoHFOGoQXB1ldgA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Lots of tables . . .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t4_0Xy1yoHFOGoQXB1ldgA/o.jpg"
      },
      {
        "img_id": "4LGwZVk0Zyz_XMsWloFYhg",
        "caption": "Photo of MEATmarket - London, United Kingdom. The helpful and courteous staff",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4LGwZVk0Zyz_XMsWloFYhg/o.jpg"
      },
      {
        "img_id": "y6sV37uGOwdCCgkY1veeRw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Unique atmosphere",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y6sV37uGOwdCCgkY1veeRw/o.jpg"
      }
    ],
    "user_id": "sfLTjzc1ceEpzZRnXz512Q"
  },
  "lN-Iw0n26u71UacBc_1Z4g": {
    "date": "6/29/2016",
    "text": "I've been coming to this chain since back when it was based in a van in East London. I followed it to New Cross, and to Meatliquor. This marks the second time I've been to MeatMarket - the first time was shortly after opening.I arrived just after opening and I think I may have been the first customer of the day. I ordered what I think is some of the best chicken anywhere - the monkey fingers.Took a seat and waited. After a fairly normal length of time, they brought the food to me - calling me by name, which I felt was a nice touch.The fingers were as good as I remember from MeatLiqour. Spicy, tangy and crispy but not overly hot. Buffalo rather than chilli. The blue cheese sauce is the best I've ever had, basically because I don't think there's actually a great deal of blue cheese in it, but I prefer it that way.Big portions, far more than I could finish. I mean the chicken filled one of those metal containers you get from a Chinese takeaway. It wasn't cheap at £13.50 for the chicken, chips and a soda. But it was awesome.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mGxK6kWagWkh5uTWNu5oPA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Monkey fingers and fries! Massive portions!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mGxK6kWagWkh5uTWNu5oPA/o.jpg"
      }
    ],
    "user_id": "jBqJ32j3nsyugAhuh0h2bw"
  },
  "qwhPqBF6Bnk_slmd3Wc6dA": {
    "date": "7/16/2018",
    "text": "Probably one of the best burger joints I've had in a while. One of the few places I've been too that can cook a perfect medium burger. Far and few places can do it. Everything was good even the fries. Definitely recommend this place. I'm from the U.S. and i would say this will too most places there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ernL25DfPwv7HsYyhrNIfw"
  },
  "MYY9XuyTq49lk86ZCcoG2A": {
    "date": "4/9/2017",
    "text": "The food was alright. It felt like a fast food place, but the burgers are much better. I would have preferred they served my burger on a plate if I'm eating there. It is simple, the cheese on my cheeseburger got all over the paper wrapper.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "r-GUzoUNg9mDxdfmL99Teg",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r-GUzoUNg9mDxdfmL99Teg/o.jpg"
      }
    ],
    "user_id": "75OBxtyITK3O0JofLsAYVg"
  },
  "qz6KyEPjVvVLJHjSFKuG2w": {
    "date": "9/17/2016",
    "text": "Went here on a Friday early afternoon. It was busy but the four of us managed to get a table. Decor isn't the nicest (wooden stools and tables, lots of red lighting overlooking the part of Covent Garden that sells a load of tourist tat). Maybe I'm just used to/spoilt by Birmingham prices but I thought £8.75 for just a burger was a bit mad. It was a good burger but not '£8.75 and doesn't even come with fries' good. Plus the fries were bloody £5 on top of this. I won't be back. Londoners: if you're visiting Birmingham and want a burger then give Original Patty Men a visit.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5TU3gS-hbC8T5-hVBMVX8A",
        "caption": "Photo of MEATmarket - London, United Kingdom. Dead Hippie burger. Tasty but not 8.75 tasty.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5TU3gS-hbC8T5-hVBMVX8A/o.jpg"
      },
      {
        "img_id": "bpek9gF5b0bwWbKMeL_QIg",
        "caption": "Photo of MEATmarket - London, United Kingdom. Hippie fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bpek9gF5b0bwWbKMeL_QIg/o.jpg"
      }
    ],
    "user_id": "_zKS1CoTjGatG556pjD5DA"
  },
  "g3UFv8wLhB4kCJH9kMl6CA": {
    "date": "9/21/2015",
    "text": "I've been nipping into MEATmarket for a long time now, in fact when the burger craze started a good few years back - this was somewhere I'd make a pilgrimage over to, mainly because MEATliquor was more formal and MEATmission was just a twinkle in the owners eyes...Here it's like an upmarket fast food place which means you get premo burgers without thinking you're having to go out for a full expensive meal! Situated under the less formal market part of Covent Garden and only a few mins from the tube - walk up a few stairs and through some old butchers doors and you're here in burger heaven. There's some great burgers, fries, shakes and sides all available - on this occasion we tucked into 'Dead Hippy' burgers (fairly plain in toppings in today's crazy world on always going for more - but still amazing), fries and some deep fries pickled gherkins - really good all round for about £11 each. Definitely worth calling in to if you wanna get your burger on!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "cmMthhRybX7TOeCJGkyi3A",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cmMthhRybX7TOeCJGkyi3A/o.jpg"
      },
      {
        "img_id": "0xQUUmnA7YEUPFPG-DWrUg",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0xQUUmnA7YEUPFPG-DWrUg/o.jpg"
      },
      {
        "img_id": "xTlDRSpVS44WC3kC1EZx0A",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xTlDRSpVS44WC3kC1EZx0A/o.jpg"
      }
    ],
    "user_id": "SdyaF3_mFMdCig_25qW7TQ"
  },
  "OD84kh-WfLNs6H_5KKJ4mA": {
    "date": "2/25/2017",
    "text": "Get American type burger place, menu is on the board so that's a little annoying it is hard to get seats!! Amazing burgers and fries! The hard shakes taste great - over 18 for sure get one!Dirty cheeseburger + fries Tables are set in a long narrow way, so there might be people sat next to you",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmEBk4C9_1gX8KFo693ThA"
  },
  "a7qLLe2SjBOMaYmIWfSYVw": {
    "date": "9/29/2016",
    "text": "So so so good.  I had a fantastic meal at meat liquor  so didn't expect any less but isn't it wonderful when expectations are met??? So simple-burgers and sides but such a great vibe with rockabilly music and clever signs makes lunch a great experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bywkyc0SF6VMrxS5A4f_Rg",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bywkyc0SF6VMrxS5A4f_Rg/o.jpg"
      },
      {
        "img_id": "9HOb-9z0Q202Y9e7U-qkkA",
        "caption": "Photo of MEATmarket - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9HOb-9z0Q202Y9e7U-qkkA/o.jpg"
      },
      {
        "img_id": "FZ21i8ZZX6YAgXRyLIuewA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Dead Hippy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FZ21i8ZZX6YAgXRyLIuewA/o.jpg"
      }
    ],
    "user_id": "lSMJ15XRfcx_BNIBwD17Ww"
  },
  "cS2xvU9knG3uuNFm3UJ5UA": {
    "date": "2/25/2016",
    "text": "I wasn't a huge fan of this place.Although despite the busy, bustling atmosphere and quick service, the actual food wasn't great and the seating was uncomfortable - my bum has seen better days at a bus stop, to be honest.I ordered a chicken burger and chips and the former could be likened to what you might imagine a vegetarian chicken burger would taste like. And the chips weren't much better with a cardboard after-taste - so again, edible, but not great.I do have to say that the person I was with ordered a beef/bacon burger and he hoovered that up in no time - so he was a happy bunny with his burger, but his hippie chips (that's not my interpretation of it, thats their actual name!) missed the mark as well.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zpnbBQKYFuuduMWf2B_yRQ"
  },
  "gwqXdXCddd6sNz5eiDYYPw": {
    "date": "9/17/2016",
    "text": "A trendy NYC style burger \"dive\" joint which did your standard burgery burgers. Definition of Burgery: to know what a burger will contain before seeing the menu Ok I obviously made that up but calling a chicken fillet burger the dirty chicken burger is just lazy. If you want to make it dirty put some beef brisket on it. Wow, I'd buy that a chicken beef burger! But the Hippy Fries at £5 was a bit much for an oversized portion of chips that just contained cooked onions and mayo on it.If you're looking for a burger - The Original Patty Men in Digbeth Birmingham is the place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kJfRL9ujljnJxCNZ4ve4og"
  },
  "6P5ir9B9DADgB2vIRwWJBw": {
    "date": "10/9/2016",
    "text": "Visited on the recommendation of a friend on a Saturday evening. It was very busy with limited seating however didn't have to wait too long for food and the dead hippie burger and fries I had were both very tasty. The milkshake I tried too was great.Would be nice if the seating space was bigger and better but apart from that fun little burger place near Covent Garden.Noticed they had a deal for people with theatre tickets, £10 for burger, fries and soda.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SjOLc4yta5KVXs0uIXgIzQ",
        "caption": "Photo of MEATmarket - London, United Kingdom. Milkshake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SjOLc4yta5KVXs0uIXgIzQ/o.jpg"
      },
      {
        "img_id": "u7dsb8tkATyPLSRRSD-vuw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Inside MEATmarket",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/u7dsb8tkATyPLSRRSD-vuw/o.jpg"
      }
    ],
    "user_id": "GtAjkslL-M5m5LFEIWB0Hw"
  },
  "nPLsk2AF9D66V0F0Pzn5-A": {
    "date": "5/25/2015",
    "text": "One word - filthy Be prepared for burgers and sides that are full of great flavour but tonnes of grease as well - not the sit down dinner date venue I've been dying to go to a Meat chain for ages and forgot there was one in Covent Garden. From the outside you would walk straight past it as it isn't so obvious. Also not of the main market in Covent Garden but down the street behindBf and I turned up about 7 on a Friday and got a seat easy. It was busy but there were a few available. Be prepared to get cosy with neighbours! Also if a big group of you you will need to be prepared for space to free upMenu is quite straight forward 6/7 burgers including some chicken options, a few hot dogs, sides then a few shakes and beers Bf and I both went for a burger ( dead hippie for bf and black palace for me) both double patties with slightly different toppings. Mine was incred! Lots of onions and cheese and buns also v good! Bf also enjoyed his but mine looked better. We also ordered the deep fried Mac n cheese and the chilli cheese fries. Mac n cheese were really nice! As were fries because of the chilli cheese and jalapeños (be warned quite spicy) but the chips them selves were pretty average and I wouldn't recommend getting them plain as a side! No desserts available but I was so full after there was no need!Will definitely be going to another branch to try it out (v similar menus) and would go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "CH1i0NkCe67aZg_C_R8zVg": {
    "date": "4/12/2017",
    "text": "Dogs are Not allowed - there ist an Open kittchenThere was no way to stay with the dog We have search Restaurant with dog",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DE3GMbRWnAidBNSofhzlNg"
  },
  "OSQ6xARNc75aWEVa7qw3qg": {
    "date": "4/26/2015",
    "text": "I loved MEATmarket.. It was a little hard to find but SO worth it! Staff were super friendly and answered questions from all and sundry whilst we were there with humour and a friendly attitide. The dead hippie sauce is outstanding and does some seriously good work on the burger, which is now my number 1 burger ever... We also had fried pickles and honestly - sod the fries. Fried pickles are the only way forward! My friend got a hard shake with jaeger and well, meh. Medicinal milk not so much fun it turns out.. but the Lagerita (me)? Up there with the pickles my friend. Only issue was that our fries did not arrive at all, but with the onion rings and pickles we were fine. Probably should've got the cashola back but the food coma had kicked in by that point..",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OFAsXrk3pAfRuxXkGhzACw",
        "caption": "Photo of MEATmarket - London, United Kingdom. Lagerita and jaegershake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OFAsXrk3pAfRuxXkGhzACw/o.jpg"
      }
    ],
    "user_id": "h8Sgxq6Z7bJuJscBa__h5Q"
  },
  "oySXIhurMEy8e1kxhzwMsw": {
    "date": "11/19/2015",
    "text": "Gosh... what can I say... I was here before the Mulled Wine Festival (wanting to fortify myself before heading out to help) and thought, why not, I've been here before, it's a decent burger, what could go wrong?Well... The unlimited refill soda was good...The staff were nice... It was relatively quiet at 5pm...BUT...Firstly, I was delivered someone else's order first, not a biggie but I almost started digging into it, thinking it was the chili cheese fries before seeing it was a chili cheese dog... Also with only 2 people in the place waiting for food, getting it wrong is a bit difficult.Okay, let's get down to the actual foodCheese and Bacon burger - hot but the meat seemed dry and tasteless somehow. The bacon was good but I really came away with how mealy the meat seemed to be.Chili Cheese Fries - fried covered in chili, cheese, jalapenos and mustard. The main flavour seemed to be heat from both the jalapenos and the mustard. Chili flavour really wasn't there and it was dry too. Normally I find chili cheese fries to be wetter allowing for a proper melding of all the ingredients, here the fries were I think overfried leading to an inability to be forked. This combined with the dry chili led to a disapponting dish - I actually had some small cuts on the roof of my mouth from them! Mustard and jalapenos were scraped off some of it and mayo and ketchup were added but still didn't make them palatable - I threw half of it away along with a third of the burger...This contrasted so differently with the burger I had from their stand a short while later at the mulled wine festival, juicy, hot and oh so good, how could I get two such differing burgers from the same place?",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "6eXslx3z7bnFy_31nUo1Lg": {
    "date": "10/30/2015",
    "text": "Super delicious burgers in the middle of the tourist area in London! Though it's in Covent Garden I still think that not many tourists finds it since it's a bit \"hidden away\".I must say that this was a very nice burger restaurant. Actually one of the best burgers I have had in London.The place tries a little too much to be \"cool\" - but I can easily forgive that - because of their very nice, good and professional personnel - and of course for their delicious burgers! I must recommend the \"DEAD HIPPIE\"-burger, as this was truly amazing!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ycfxcj9yX8A8Z6Hq_5AdyA"
  },
  "m5DI_j7FGhb6u4nRHJoW2A": {
    "date": "6/25/2013",
    "text": "If you're a hipster, and you love meat, this is the place for you. No doubt it's really cool but that comes with a price, a price you pay to \"be seen\" rather than enjoy something that's twice as good as somewhere else.I would however definitely recommend the chilli cheese fries, which are a meal in themselves and well worth the £5.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eKYhaDFSm_6WPO5czwJ8JA",
        "caption": "Photo of MEATmarket - London, United Kingdom. Hmmm tasty flesh!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eKYhaDFSm_6WPO5czwJ8JA/o.jpg"
      },
      {
        "img_id": "RCUcV7I0Ko_QcaAIkyf68g",
        "caption": "Photo of MEATmarket - London, United Kingdom. The chilli cheese \"AWESOME\" fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RCUcV7I0Ko_QcaAIkyf68g/o.jpg"
      }
    ],
    "user_id": "xqx9kLxuVJ2RkqUX4oBjSA"
  },
  "cFaNWlVTQRGkN731PRQ6YQ": {
    "date": "8/27/2015",
    "text": "So, firstly, a disclaimer. We ate here pretty much for free and with a lot of free booze. Why? We 'removed' a very drunk and abusive person from the venue, whom was preventing the staff from serving anyone (or feeling safe). Management were highly appreciative as apparently they cannot even touch a person on their premises due to liability.Anyway,what you really care about: + Staff are f**king solid people, and nice as hell.+ Burgers (Hippie, Bacon Cheese and Red Chilli) are solid tasty choices, the Green Chili was meh. Fries are tasty.+ whatever they put in that jungle juice makes it potent as hell.+ Great for a slightly tipsy filler on an evening out.- Not the best burgers in London (sorry guys)- Not a date venue- Not the most comfortable seating arrangements, especially if you are on a high-chair.- Not quite the best value for money.- Far from 'classy'.- Not Patty & Bun.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6e3PuTV4CB_f5ugrxkfiZw"
  }
}