{
  "eZYSfDjQ8xF3yuH48hsN4A": {
    "date": "6/12/2008",
    "text": "For tasty but cheap food this is THE place to go in Greenwich. With row upon row of bench tables you must be willing to share your table with other parties. However, this place does the biggest portions I have EVER seen, it is affordable and the quality of the food is second to none. Ranging from rice dishes to soups, there is something for everyone. Def. worth a visit if you are in Greenwich.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oGGrHfPra0mIy1OQiB9zZw": {
    "date": "10/21/2008",
    "text": "Cheap ish and cheerful noodle house, good selection of food available, i hope your not shy because, its compact dining at its best, herded in like cattle and seated on wooden benches, not the place to propose to a loved one, the staff are fast and efficient, although i constantly had the feeling i was moving along on a conveyor belt and as soon as i was seated, they wanted to take my money and ship me out of the door making space for the next punter in the line. If you want your belly filling for a reasonable price and dont expect a fine dining experience, then give this place a go.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W3ra9EDLL0Snksi01qADSg": {
    "date": "3/25/2009",
    "text": "Perhaps there are some OK things on the menu but most people I know have come out in a state of shock at having eaten anything quite this horrible. The tourist trade should ensure that trade is brisk though",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "i4UK1d0T6mXUWpiygEkcog": {
    "date": "12/19/2008",
    "text": "have been here a couple of times, about as much that can be expected of a chinese resturant, last time I went there was 4 years ago, left that much of a good impression",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LL6Q_lB2ejtkgLlx9S1D-w": {
    "date": "11/22/2012",
    "text": "Came here because my friends said it was really cheap, quick and tasty. Well, it was cheap and quick but I'm not sure about tasty! I got fried chicken noodles, my friend got fried meat noodles, and we got prawn toast, prawn crackers and BBQ sauce to share. As soon as we ordered the food was on the table - yup, it was that quick! So, the food - prawn toast greasy and very bland, BBQ sauce tasted of nothing (we were both quite amazed at how it tasted of nothing!), crackers were greasy. The plate of noodles was HUGE, but again I felt like I was eating a mouthful of oil. My friend put salt on her noodles and she never salts her food. If you want a really quick cheap meal and don't really know how good properly cooked Chinese food can taste then by all means visit here, but this is just not for me, I don't care how hungry I am!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMjexqCM00KQmSt6uQNBBA"
  },
  "L-a4fRTKZIgKU3Aq95i4zg": {
    "date": "12/28/2013",
    "text": "All points go to the portion size, (which is HUGE!), as well as its reasonable price. Other than that, the food is just of ok-quality, this is not the place if you want some genuine tastes of Chinese cuisine. Another good thing is the food being served very fast most of the time",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Suiy4AJB5WlRKIu-P6QcAw"
  },
  "k09tAZSE3OZJLqnsYKd7aA": {
    "date": "10/28/2009",
    "text": "Three reasons you should come and eat here:1. If you have virtually run out of money.2. If you can only have one meal a day (the portions are HUGE).3. If you are craving greasy chinese food.I can't say all the food on the menu is worth a try, but some certainly are. You're not going to get amazing quality for the £4.50 price tag (for this you get a mountain of noodles or rice and meat in your choice of sauce) but it really isn't that bad!The dishes are definitely big enough to share between two, unless you have bottomless pits for stomachs, so you could end up paying just over £2 each for a hearty lunch or dinner!SCORE :-)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pme5k0opii_BRpr7FT4sjA"
  },
  "EceSHPhvhngwZ8oxtTqVVA": {
    "date": "7/26/2010",
    "text": "Back when I was a student, Tai Won Mein was my sanctuary - well that and Goddards, the ultimate Pie & Mash shop (R.I.P). After all, there aren't many places in London where you can get a mountain of Sweet and Sour Chicken noodles with a pot of green tea and still have change from a fiver. Plus, there was the fact that my tastes were slightly 'unrefined' back then, meaning that a pile of gelatinous crispy chicken basted in MSG felt like the height of luxury for a poor skinflint like me. I could even cope with the surly staff and the fact that my food was quite often slammed down in front of me. If I had a good book, plenty of tea and my favourite seat by the window, it was heaven. Then I went back there a few months ago in a fit of nostalgia and it just wasn't the same. The food was soggy, overly sweet and made my mouth fizz - and not in a good way. It made me feel dehydrated, hungry within ten minutes and made me really really REALLY need the toilet. As Sian said above, Tai Won Mein may be cheap, but at the end of the day you get what you pay for. But if you've only got a fiver in your pocket and are looking for a relatively noodly way to fill your belly, you could do a lot worse. (And yes, in case you're wondering, it is much much better than Noodle Time).",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "22sL5WONcyWkKXiYuZbNWA": {
    "date": "1/6/2013",
    "text": "One of the best Noodle Houses I've been at. Atmosphere is kinda busy due to the big amount of people visiting the place. Decoration is decent, but I've seen better. What makes this place really good is the food of course, its tasty, delicious and really well cooked. I'm giving this 4 out of 5 due to the service. Yes the staff are polite, welcoming etc, but they could've been a bit faster with the serving, thats the only downside in my point of view.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gGCP-GMfz2vmoBPYV8lJnw": {
    "date": "2/24/2013",
    "text": "cheap cheap cheap...the portion of the chicken satay with rice was FxxxxxING huge!!! i only ate the rice and onions, i couldnt even start on the chicken i was so full! very cheap, very fast service, i definitely agree wit the comment below about how you could come here if skint and just eat one meal a day! hahaa!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "76NiwyWuwGpSw7ZPmFA1Ug": {
    "date": "7/14/2009",
    "text": "Big portion of rice and mixed meat for £4.50,so not surprising that the place was packed. With added soy sauce, I found the food reasonable and very filling. The place was clean and bright, (including the loo). The Oriental staff were extremely efficient,but angry looking and almost aggressive, so I did wonder if they were trying to get their own back for us messing up their countries with opium back in the 1800's.You probably know that my friend Charles Dickens did regularly use laudanum. Also his descriptions of London opium dens are legendary.Excellent value, so do try it if you have a big appetite.",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "0aF7yMKtWahr0sQqb5TJvA",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0aF7yMKtWahr0sQqb5TJvA/o.jpg"
      }
    ],
    "user_id": null
  },
  "MkBnBFfigXAY3t272OJDMA": {
    "date": "11/30/2008",
    "text": "My boyfriend controversially believes that Noodle Time is slightly tastier than here. However, we also get take aways from this place too. Very similar scenario to across the road - generous, cheap dishes of noodles and rice. Slightly more expensive than Noodle Time but still absurdly affordable. I've never eaten in, so don't know what the ambience or atmosphere is like - but I imagine it's not as nice as getting home and piling all the noodles on your own crockery and stuffing your face in front of the telly.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "g-snf-IzDKaPvM7KWrpMuQ": {
    "date": "8/23/2008",
    "text": "This place is cheap. But y'know, cheap places are usually cheap for a reason. And it's really just not that great. Piles of tastless noodles with some cheap meat and a gluttinous sauce thrown over them really isn't my idea of dinner. I know this makes me sound like a snob and I don't care. Greenwich is well known for it's many (many) eateries and I rather go elsewhere. That said, it's slightly better than Noodle Time.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2caolDCQWO0lNXAarq3D5A": {
    "date": "8/22/2011",
    "text": "Finally we got round to visiting the Tai Won Mein Noodle House. Having walked past the restaurant for over a year, looking at the number of people always packing the place out and hearing its praises being sung by one of my work colleagues I was wondering could it really be that good? I finally found out the answer!We decided to go in on a whim and found the place pretty packed, we were quickly shown to a noodle bench (ie a long benches with seating each side  its not as close quarters as some places I have been to) by an efficient waitress.We both decided on noodle soups from the menu, it just being lunch and we fancied something light, but the menu covers anything noodle wise you could possibly want.Looking around I couldn't help but notice that the portions are huge and this was confirmed when our noodle soups arrived, super big bowls with plenty of chicken and prawns in respectively.The food tasted very fresh and healthy, we did manage to finish but around us people were pouring their leftovers into handy doggy bags, well actually take away boxes (they charge 50p for one of these), but to be honest its well worth the money. I always think noodles are like Pizza, even better the day after (although is that just me?)You pay up at the till here and as we approached the lady magically seemed to know what we had ordered. The cost (without service charge  they don't add one or expect you pay one) was £14.95 all in  but we did make sure we popped some money in the tip box by the till.If you are after great noodles, at an amazing price and brilliant value for money with no nonsense staff (I love no fuss kinda of places) then this isWon the place for you. I just wished we had had something a little more naughty and had to take advantage of the doggy bags!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bW9MuMTXcMDFN9Ukif-xHw": {
    "date": "12/27/2007",
    "text": "This is probably the busiest, most popular noodle house in Greenwich. I've been here countless times and it's always packed. With good reason too. The food is excellent, comes in enormous portions, and is dirt cheap. Two people can eat a massive meal here for less than 10 quid. It's fairly large and the service is very quick and efficient. The menus are printed on the table mats and you order by number. The Chicken Curry and Rice and the Chicken Satay and Rice are really good and the other items are uniformly high standard as well. If you don't mind eating shoulder to shoulder with strangers and if you're willing to order, eat and leave quickly, this is a very good place to get a good, cheap meal in a relatively expensive area. P.S - They only take cash.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Ti7iY9UfnvVyiCAHFSi_ng": {
    "date": "12/17/2008",
    "text": "The positives of Tai Won Mein are clear: price and speed of service (two main courses, side dishes and drinks for £15, in and out in under an 45 mins). The downsides are that the price clearly comes at the expense of quality (ropey meat, rice swimming in grease), and the speed comes at the expense of any sort of friendliness from the staff (it's possible to be quick without being rude). Not a bad way to get an ok meal in the area (especially given the number of less than average pub grub joints, and identikit Spanish places that dominate), but certainly not a venue to bother seeking out in itself.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fHRidE_ekTJj2A3uy5Tkag": {
    "date": "8/3/2008",
    "text": "I love this place. After a hard days work in the docklands and the walk through the Greenwich tunnel you can park your behind on a communal bench in Tai Won Mein and feast on a huge plate of noodles for less than a fiver. Don't expect all the trimmings but two of you can eat here for less than a tenner - the portions are huge, try getting one starter and one main and sharing - you will not go hungry. This is a simple place, so take note - cash only and no bar licence but worth it for fast, delicious food and it is close the bus stops, DLR and ferry.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KuEjWPDju6_0tgI5ZWkrMQ": {
    "date": "10/8/2009",
    "text": "Big portion of rice and mixed meat for £4.50,so not surprising that the place was packed. With added soy sauce, I found the food reasonable and very filling. The place was clean and bright, (including the loo). The Oriental staff were extremely efficient,but angry looking and almost aggressive, so I did wonder if they were trying to get their own back for us messing up their countries with opium back in the 1800's.You probably know that my friend Charles Dickens did regularly use laudanum. Also his descriptions of London opium dens are legendary.Excellent value, so do try it if you have a big appetite.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oILKW1SlVZbanICCJNGbwA"
  },
  "CLxPhJB7ECkSMC0eJB0iEQ": {
    "date": "2/9/2009",
    "text": "Cheap - and you get what you pay for. I'd describe this place as a 'filling station' - Chinese fast food with no airs. Get in, order, eat and get out - that's it. Reasonable quality for a low price in central Greenwich.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVMLxovuKxzxHfYr7ul7Ug"
  },
  "hF40H4UJpAd81jCRJFRQGg": {
    "date": "6/19/2009",
    "text": "Great place. Cheap, quick service, and the food's good. Well, I guess maybe the food's just average, but you get a lot of it and I'm greedy so that works for me.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CMRTPhXLLqOcd8XN_U3Tvw": {
    "date": "1/9/2009",
    "text": "Cheap - to the point of when you get your portion (which is massive) you wonder what kind of quality produce they're using to still turn a profit. I got one of the noodle soups which was close to simply being warm water, tasteless. It was a bit like the Deer Hunter when we were paying at the till; no smiling, just a demand!",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "D9kvBgUDG5MFIYS3Fyt0Gg": {
    "date": "11/19/2008",
    "text": "This is a great value restaurant right in the middle of Greenwich - noodles and rice at great prices. Service is fast and not very friendly - be prepared to share long tables like at Wagamama - but this is chinese food rather than Japanese. My favourite is the seafood ho fun and grilled dumplings. This branch, unlike the Catford one, isn't family friendly - it's much smaller and crowded - you can't really get a buggy in and they don't have high chairs. Still the best (and cheapest) place in Greenwich to fill up!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZSvDZiZbLNYf2vDOQ7bGPw": {
    "date": "4/28/2008",
    "text": "Cheap, cheap, cheap, is all I can say about this eatery! A plate of fried squid is only £3.95 and a plate of fried noodles if between £3.80 and £4.50 such great deals! No wonder why it is always packed with customers! This is a Chinese fast food, equivalent to MacDonald's. Not the best food in town but it's fast and cheap! It is great for a quick everyday meal. The only thing I won't recommend is the dumplings and wonton; lots of dough and not much meat. I certainly have it when there are so many other choices; there is quite a huge range of food to choose from. They even have udon in all style of cooking!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bnHyVC9XBFva-0zjaNDBYA": {
    "date": "10/21/2008",
    "text": "I give this place 4 out of 5, because when I wanty my belly filling for a resonable place and dont expect a find dining expereince (but do want a huge portion), then I come to Tai Won Mein in Greenwich.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UxsdpCR7Sb12LvglDa6p2Q": {
    "date": "7/8/2018",
    "text": "Delicious! Tricked my family into coming and they all loved it too! We ordered the chicken fried rice and it was amazing. My parents ordered the seafood fried noodles and it was flavorful without having a fishy flavor. We also got the grilled pork dumplings and they were some of the best dumplings we have ever had. Portions are huge so you can definitely share. Also, fresh squeezed OJ is random but delicious. Side note: cash only.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PfHe533rXl9TThijf8DPsA"
  },
  "laAOvO3-WCgR_B2w8_vLTw": {
    "date": "4/17/2017",
    "text": "The shop is located at the heart of Greenwich basically next to Cutty Sark DLR station. Upon first look you might think, awesome cheap big portion Asian food; and yeah that's basically all this shop has to offer...Tai Won Mein, directly translates to Big Bowl Noodle, is, as it's named, serve very big portions of food, however, there is absolutely no quality to it, and it's just quite plain...The BBQ Roast Pork and Duck rice was untraditional, serve with gravy rather than the traditional soy sauce, while the Black Bean Beef Hor Fun was just a Fried beef hor fun adding some black bean sauce on top, and to make the matter worst the Hor fun wasn't even seasoned properly while the beef is over cooked.I mean I wasn't expecting a lot, but you can at least try not waste perfectly fine ingredients?I will commend on their portion though, and given the size and the price, you can't really complain too much...",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "H0TkyoOU0x95nXrkTg_2jw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H0TkyoOU0x95nXrkTg_2jw/o.jpg"
      },
      {
        "img_id": "mAqO4fRwqzvYA2xuShEGkg",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mAqO4fRwqzvYA2xuShEGkg/o.jpg"
      },
      {
        "img_id": "rDmH-rG1iEKJnWjbX9jRhw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rDmH-rG1iEKJnWjbX9jRhw/o.jpg"
      }
    ],
    "user_id": "Adg7wTKXnMxCERIQ1tv8fg"
  },
  "BB7i4Gas2ZYnxf2uB97RTQ": {
    "date": "8/6/2016",
    "text": "This is a relatively inexpensive rice and noodle shop in central Greenwich, right near the Cutty Sark DLR stop and Greenwich Market.Most mains are around £6-7, though plain fried noodles or rice are a mere £4. Drinks are also a little cheaper than others nearby, with sodas at £1.8 (for a small/medium glass) and glasses of wine at £3.8.The portions are actually quite huge, with almost enough to split between two only medium-hungry individuals.One thing to know is that they are cash only, so be prepared.They also only have wooden tables and benches, so though there is ample seating, it is not the most comfortable.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "0RxyHjJM9JjHLSogZAvSdg",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Fried Noodles with Chicken (6.2) and Egg Fried Rice (4)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0RxyHjJM9JjHLSogZAvSdg/o.jpg"
      },
      {
        "img_id": "RdxVUPDzLYxtx4-b45hs4A",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RdxVUPDzLYxtx4-b45hs4A/o.jpg"
      }
    ],
    "user_id": "44faC3qch9dPNOucJI4ccQ"
  },
  "21yaSvs8onqbdYeLnP0u0Q": {
    "date": "11/6/2016",
    "text": "This place was alright but definitely not great. We ordered quite a few things from the menu and to be honest everything is very unmemorable with the exception being the whole fish we ordered that was swimming in wonderful flavours and was the standout of the entire meal.Would I eat here again? The answer would be no.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "95ZUcICnFkqLnBS8CAIcXw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/95ZUcICnFkqLnBS8CAIcXw/o.jpg"
      },
      {
        "img_id": "3EQpr1m6bXDmL1I0X9GwPQ",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3EQpr1m6bXDmL1I0X9GwPQ/o.jpg"
      }
    ],
    "user_id": "U4OUYHjJT86cQpbWfe5Czg"
  },
  "5ehsaBDyGu7SaOE3Bof4tg": {
    "date": "12/18/2015",
    "text": "It's not the best Chinese you'll find, but the food is good. Huge plates and cheap. If you don't care the quality of the service and you want a good deal, this is your place.No se puede ir a este restaurante esperando encontrar la mejor comida china y el mejor servicio. Pero las cantidades son muy generosas y de precio está muy bien. Muy recomendable si estas en el bonito Greenwich.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oOc9ovfMdGLV5rz7gKpSRA",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oOc9ovfMdGLV5rz7gKpSRA/o.jpg"
      }
    ],
    "user_id": "hcP6AH-ghUPFzZ9XpgS-3Q"
  },
  "EVf7iQxNjMfOHhfkvtNS5w": {
    "date": "2/24/2018",
    "text": "Flavorless and plain Chinese food. We ordered fried rice, roasted duck, roasted pork, salt and pepper squid, seafood udon noodle, wonton noodle soup. All items tasted quite bland except for the salt and paper squid. While each item was relatively cheap £6-£7, the total bill was about £50 and would have been much more tastier elsewhere. Would not recommend unless you're looking for unseasoned or bland Chinese food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znKgUtDED8ZsUf_cJkd9Qw"
  },
  "DFy7RMkazEDlBS0iOvrVIA": {
    "date": "6/6/2015",
    "text": "After my friend and I enjoyed Greenwich market, we visited this Chinese restaurant because it was very lively with customers and close to the market!Overall, I couldn't have a good time there. Because they brought me a wrong dish and when I told them so, they expressed like I was wrong. After an awkward moment, they served me what I ordered without any comment.The restaurant was clean, cheerful atmosphere and the food was tasty and very volumy, the ingredients they use like prawns looked quite nice, but the service affected the satisfaction so much to me this time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aEM1aG0AjhOIY5q6gQctNw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. It included 2 big prawns and many squid!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aEM1aG0AjhOIY5q6gQctNw/o.jpg"
      },
      {
        "img_id": "xi2vgj4mywbDHNfN0eYOgw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xi2vgj4mywbDHNfN0eYOgw/o.jpg"
      },
      {
        "img_id": "LW1U9aXEYPD5967ts_GTBg",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. It was clean and spacious.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LW1U9aXEYPD5967ts_GTBg/o.jpg"
      }
    ],
    "user_id": "9rqmoNhTI5Sd7zI2UYe-mA"
  },
  "P-oSrV3m4ZlnDwhpm0eqig": {
    "date": "3/24/2016",
    "text": "Not a place that you would go to if you wanted Chinese food.Definitely a place to go to if you're drunk and is hungry. Open till late, this cafe doesn't offer fancy service but gets the job done for you.I don't know what made me stumble in..was it the alcohol or was it the cold? Hmm..I can't remember but oh well, it's okay if you're not picky and is looking for cheap food to fill your tummy.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Sss56zd071bKG83IvQDow"
  },
  "T_YLyx8QttFkbddV2KGxLA": {
    "date": "4/26/2015",
    "text": "Right next to the Cutty Sark DLR Station, huge plates of Chinese food between £6.95 to £7.20 per dish.  Good wholesome food.  Uniquely, they also serve fat chips as a side dish!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8r-2YOZ9k_Jk5jLgNdXkiQ",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Fat, succulent mince pork fried dumplings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8r-2YOZ9k_Jk5jLgNdXkiQ/o.jpg"
      },
      {
        "img_id": "Uu6CutDHhNNRDa7Ee6EkDQ",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Seafood Satay and RIce; and The House Udon (fish balls, squid, crab, prawns and egg)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Uu6CutDHhNNRDa7Ee6EkDQ/o.jpg"
      },
      {
        "img_id": "ywSsDPRtVLVsf9WvC5r_bw",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Wooden benches at wooden tables",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ywSsDPRtVLVsf9WvC5r_bw/o.jpg"
      }
    ],
    "user_id": "NcGrzF4ygFZEOhWIkLdOVQ"
  },
  "xg8s5IepJyZBXjPKNLep_g": {
    "date": "10/30/2015",
    "text": "I have been eating at this establishment for over 10 years and there's a reason why this place is still going strong...The meal portions are large and incredibly reasonable, the staff are friendly and very helpful...The food itself is at a level beyond its price range and I would wholly recommend the Singapore Fried Noodles or if spicy isn't your thing they have a large menu variety not only that they are more than happy to tailor your order to suit your own tastes...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WiyrxBmQ7E9zqgQB-Z7IYA"
  },
  "Gy7lgtTn2PeORmF7taJMOA": {
    "date": "7/4/2015",
    "text": "The worst service, attitude and manners I've ever experienced in a Chinese restaurant. First very disrespectful when I walked in. Then I watched three separate tables get seated and served drinks before me. I had to ask for my drink again twice. After I watched 8 people whom arrived after me receive there food. I was told five minutes maybe five minutes another five minutes. So I went to the manager and asked for my money back and she tried to give me something else after waiting a total of 25 minutes for a simple rice dish.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pvlx6JVqjqz-7agZJ0ZxVA"
  },
  "c1GCuYCKl0FgaYTx_Bi3Sg": {
    "date": "7/20/2015",
    "text": "We call this our \"Cheap and Cheerful\" as while it is cheap it certainly aint cheerful but that, ladies and gentlemen, is part of the charm. Don't expect a warm greeting or a cheery hello as you certainly won't get that but what you will get is good quality, cheap Chinese food and loads of it. Seriously the portions are HUGE. You can easily share a dish between two and still have some left over. The food is great and there is a huge selection. It doesn't feel as greasy as some Chinese places either and while it is more fast food than gourmet, you could easily come here and have a nice meal with friends. The tables are of a similar set up to Wagamama in that they are long and you share them with others. The turnover is pretty quick (although they never push you to leave). The decor is a little dated and the toilets are not the best in town but for these prices you would be mad not to give it a go, as long as you don't mind a 'no frills' kind of service.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ScJk0a6s8Jfw0sVb2y2zQ"
  },
  "dWK-VQhkWdAP80LrGBncdA": {
    "date": "8/20/2013",
    "text": "Huge portions!! Food is just okay; it'll keep you satisfied, but it's nothing out of this world. In fact, there are 2 or 3 other Chinese restaurants within walking distance if you want.There was a lot of people when I went that day, but I'm not sure if it's like this everyday. Nonetheless, we had to wait. A long time. Menu items include fried egg/rice noodles, fried rice, rice plates, noodle soups. If you want something cheap and filling, come here! Otherwise, if a tourist, I would recommend really getting your day in Greenwich by visiting the Greenwich market and stopping by all of their food tents!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJpfp-tqQ1Z4sXeNeUCiPg"
  },
  "8cORI-ATMeO9lLokPjtZPw": {
    "date": "7/13/2014",
    "text": "Local and reliable.We all know these type of places; in your neighbourhood & you don't feel robbed of the £5-10 you just dropped in there for acceptable food. I like that because I don't want to eat anywhere and by the time I pay the bill I'm hungry again.Nothing new to add; the portions are huge and food is tasty (yes, it is tons better than Noodle Time - why are they still in business anyway?) Busy - I don't care because I never eat it anyway. Take mine home & chill.Located in the main drag of Greenwich High Street, it's a tourist nightmare but it also has some homestyle charms that I like...-I come in & promptly someone is asking what I want-I pay, take a seat & wait for my grub-Get handed my bag & sent on my wayThose eating in will get their plates chucked down in front of them. Forget the flowery chit-chat cause you won't get it in here from the staff. Just your food in a large enough to accomodate restaurant that is clean & tidy.No muss, no fuss - it works.#LiveLifeLikeLDN",
    "rating": 3.0,
    "rated": {
      "useful": 28,
      "funny": 24,
      "cool": 28
    },
    "photos": [],
    "user_id": "_V2BZA6ZKxSM6J9wTBszkw"
  },
  "0xHUGpPbZKzaiP-fCu90Jw": {
    "date": "5/14/2015",
    "text": "I went in without expecting much, it was just a mindless choice for a quick lunch with a few friends after a long morning. I had the roast duck fried rice, the portion was large! It was very quick to reach the table. It tasted good, nothing ground breaking. I couldn't finish and had to take it home, it costs 50p for a takeaway box and a carrier bag. It was relatively cheap and has huge portions. However, don't go in expecting top notch friendly service and a great atmosphere. This is just a local Chinese restaurant, with quick services, large portions and reasonable prices, nothing more, nothing less.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MR77UPafgDyN4BxsdNFhAQ"
  },
  "N6h6YagMfkO_Q_pULNauIQ": {
    "date": "11/6/2014",
    "text": "The price and the food is a bit expensive for a quality in some menu  but the taste is so so not as I aspect for the duck. but my frd told me tat the noodles is really deli and they give u a huge plate whichu can share with ur frds !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-VBzxDix8KdIiZFqY603LQ",
        "caption": "Photo of Tai Won Mein - London, United Kingdom. Chicken with veg soup ;-) not bad at all !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-VBzxDix8KdIiZFqY603LQ/o.jpg"
      }
    ],
    "user_id": "GTzai1jmpsxNvA4XDZn2-A"
  },
  "NiUusK4z88emIsBwW4xUfA": {
    "date": "5/17/2015",
    "text": "This place does what you expect. The portions are HUGE! I'm a big eater but even I struggled. Which is good because the quality isn't amazing. But what do you expect with these prices. It's a good stop off, they give you value for money and it is always busy because of this is worth trying if stuck for something in area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "G92XfSfubeQX8-aTHfDa6A": {
    "date": "3/18/2013",
    "text": "Giganticos! For a few quid you can have enough to last you for a day. They tell me this is the equivalent of a working class canteen or food hal if you will back in the land. So the food doesn't taste 'gourmet' but heck I pay extra money for messy burgers I'd pay extra money for messy chinese! Its a bit out of the way - close to the Cutty Sark. But definitely worth trying out on a weekend you don't want to cook. For around 10 quid you can have enough food for a meal and then to take away the rest as well. One thing I found very interesting was that when I asked them to pack up the remaining food, they said its 50p for this - which is fine by me. A minute later she tosses a foil container and a lid in my direction and leaves. Packing is DIY! Lovely!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "kwmToyRa85G49WxbsYB1Aw"
  },
  "BTnOo4lNwM7eEPdR2NbexQ": {
    "date": "6/18/2016",
    "text": "Very well priced. The food was authentic Chinese. It wasn't amazing, but good enough. I got a seafood noodle soup. You can get spicy sauce if you ask. That and a bit of soy made for a tasty bowl of soup noodles.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7wMik41nTjr0Rb1E4_A-3w"
  },
  "_B-FVYoDacgu-mKut7x5qQ": {
    "date": "1/25/2015",
    "text": "This is one of my favourite places to eat. The fried squid and duck noodle soup always hit the spot. I would go pretty much every Friday after work drinks. The portions are a good size and very affordable!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "srwShojNtgfzA37K7hzmHw"
  }
}