{
  "X6spRyCEqkYpwY2KoSQp3w": {
    "date": "6/5/2009",
    "text": "I don't care if this was an 'authentic' Indian restaurant; it was a very good restaurant (though there was a preponderance of Indian workers...) .Service was quick, genuine, and pleasant. The atmosphere was lively.We were quite surprised by the fantastic tastes that rolled through our table; the papadum was fresh and hot, with accompanying sauces and chutney; and that was the starter. The lamb was tender and moist, and cooked through well-- which is quite the challenge.Excellent overall, and we were glad to find it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "S91nycJX8WaKenrqI4yivA"
  },
  "jGLey3p2LoSxoVO_9QMDUg": {
    "date": "7/1/2011",
    "text": "I was tempted to order one of the tasting menus, but there were so many unusual dishes I wanted to try I decided on a la carte. Service was wonderful, the wine list was perfectly appropriate for the spice of the food with lots of wonderful rieslings, gewurztraminer, pinots, etc. Definitely a top rate place. Definitely recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z22JqwXbQH5n-0MpF-1sOA"
  },
  "rJtNstHs2mn1qq-gPeFjCg": {
    "date": "7/19/2012",
    "text": "I don't really understand how this place doesn't have five stars.  Yes, it is pricey, but it's a delicious Michelin star restaurant!  The decor is very nice, and the service is excellent.  Everyone was very nice and welcoming.The food was spectacular.  We ate at a few different Indian restaurants in London, and this was by far our favorite.  It's very worth the money if you don't mind a splurge.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85yjmSbuLVXLpxd71x-Jqw"
  },
  "mfCNTNmErbyPy7CEkkdsaw": {
    "date": "10/23/2009",
    "text": "Really good, not what I'd come to expect from Indian food.  We took a large group here, and had quite a feast.We had the \"medium priced\" prix fixe menu.  Really solid; makes me wonder what the high priced menu would've been like.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pxf8Sa0c55kQMgfSfxXcqg"
  },
  "NbEPZBuwFpNnk1MqUdBWig": {
    "date": "2/23/2010",
    "text": "Really not sure why Qype redirects a search for 'Tamarind' to the results page for the spice itself, but regardless, I thought this was really good. Not cheap, by any means, but probably the best curry I've had outside India itself: nicely spiced (fairly mild but enough to add a bit of heat to the dishes) and the amount of food we had with the pre-theatre early evening dinner menu (3 courses for £25 + service) was pretty good too. Having to be in and out within 90 minutes was a pity, but the meal didn't feel hugely rushed, despite the waiter taking our orders for all 3 courses at once. Given how much I've paid for similarly high-end indian meals in far less glamorous places, none of which have come close to this, I'd definitely favour Tamarind.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZnWtwq5hv-hOdHh1To6vGg": {
    "date": "2/21/2012",
    "text": "Pics@Chopstix2Steakniveschopstix2steaknives.blog… Catching up with SC, we ended up heading to Tamarind for dinner. I was looking forward to the meal and we both opted for the tasting menu. A round of various sauces to dip our papadums started us off. Spiced chickpeas with mint chutney and sweetened yoghurt topped with tamarind chutney skewered ground lamb kebab with ginger, chilli, cheese, paprika and basil The chickpeas had a delicate spiciness which was a great contrast to the coolness of mint and yoghurt. The lamb kebab was moist and tasty without a greasy aftertaste. Tiger prawns marinated with ginger, yoghurt, paprika, dill leaves and ajwain This wasn't as positively received as the prawn was either frozen, not fresh or overcooked as it had a mushy texture. After the duo of starters, a tray of various bowls with ladened with our mains arrived. Monkfish chunks marinated with yoghurt, coriander, mint, mint-leaf, green chilli, roasted gram flour and saffron The Monkfish was cooked well with the aroma and taste of lemongrass sealed in the charred bits. The spices harmonised together with an overall sweetness balance. Chicken Tikka in sauce of fresh tomatoes, with ginger, red onions, green chillies and crushed fenugreek leaves I found the chicken tikka to be veering slightly on the sweet side as well. On the vegetables side, we had shiitake mushrooms in pureed spinach, flavoured with cumin and garlic and slow cooked black lentils, a speciality of the Northwest frontier All these were mopped up with a choice of cumin and saffron rice and toasted almond/date naan. For desserts, we had a velvety dark chocolate mousse with a hint of cinnamon and orange zest and basmati rice simmered in milk flavoured with cloves At the end of the dinner, I found the meal to be satisfying. The dishes were all made to be friendly and appeal without pushing the boundaries of the palate of the people I didn't get the spicy explosion that usually comes with Indian cuisine but it does hit all the basic elements.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-oXRxuTJYAEQ83nQ0DhonA": {
    "date": "7/25/2012",
    "text": "Went for post-theatre dinner.  Resies at 10:30.  The restaurant was quiet but not empty (not surprising, given that we were the last people they let in).  Good - Service is very attentive, with orbiting staff who are constantly scanning tables.  Food was excellent.  My wife liked it enough that she vetoed going back to any of the previous Indian spots that we had visited in previous London trips (I convinced her to grab lunch on Brick Lane, though).  Strange event - the waiter offered to charge my iPhone when he saw that I had plugged it into a portable charger. Thanks!  The staff were patient when we ordered a bottle of wine so late in the evening, even though it meant that we were going to be the last people in the restaurant.Not so good - I like my Indian food crazy-hot.  The flavour of the curries was excellent, but I couldn't convince them to spice it up enough to bring the heat level to what I like.  This is a common issue though.  Overall an excellent dinner.  I have other Indian faves in London that are on a similar level of excellence, but my wife likes this one best of all.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lrWuegIGZCq8INPntw1iog"
  },
  "TbVHCqtKqqrn5oduy6_1gw": {
    "date": "11/2/2009",
    "text": "I had lunch at Tamarind recently. It was my third visit to the place (and the first without the wife, but I won't tell her if you won't) and my third excellent meal. I first visited about two weeks before it received its Michelin star, and last visited not long after Alfred Prassad had replaced Atul Kochhar in the kitchen. Maybe I've been lucky but what I found leaves me slightly bemused by the negative comments here and on other (obviously lesser) review sites. I've had three delicious meals, all with exemplary service and exquisite wines. Yes, it's expensive but you know what? Sometimes quality costs. You can certainly eat great Indian for much less in London - hello Tayyabs, Needoo, etc - but for formal but spicy dining? I'll take Tamarind over its rivals anyday. I'll also take Alfred's cooking over Atul's. That, admittedly, is a very close run thing but there's a lightness to Alfred's dishes that belies their depth of flavour. You'll come away, tingling at the heat-inspired joys but not reeling with a body that's now around 83% ghee. The prices mean this is probably one for special occasions only but that just makes me appreciate it more - and, with a little judicious bread ordering, you could happily share a few bits and pieces with your nearest and dearest and get out at around £35 a head. Just delicious.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dqsIdAwsq8cdYzBHsl6sFA": {
    "date": "9/21/2010",
    "text": "I took an African friend here in hopes of convincing them that Indian cuisine is great. Unfortunately they don't serve it here. What they do produce is something which has had all of the distinctive flavours of India removed (and obviously any heat) so that smart Italian or American socialite ladies can eat here with without the worry that the food will in any way be noticeable (during and after). Mayfair at its considerable worst - hopelessly bad food at astronomical prices for rich people who really couldn't care less about food.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0szY-wQDQLRkwtuR693bqg"
  },
  "_nt6xLWoW8RtEE74N5CKJQ": {
    "date": "2/18/2012",
    "text": "I've never really had much Indian food before, but my family took me here a few months back. I can say that it was probably one of the best meals of my life. We all shared a few appetizers, ate baskets of flatbread,  and shared entrees. We had two lamb entrees and a chicken tikka masala. The chicken was amazing - perfectly moist, not tough at all. Don't know how they did it. The lamb curries were amazing as well. Service was very formal, which was refreshing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vyVIjwmuZOyvHbeOW6hv5w"
  },
  "t6OzTrVOq4NHpwa8Z2uDaA": {
    "date": "8/28/2012",
    "text": "Prepare to be blown away by an exquisite dining experience. A bit on the pricier side but completely worth it, as it certainly did change my perception of Indian cuisine.  I like the Dawat Menu, which offers a wide variety of different dishes that are far from the usual curry from the corner shop.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-j9ju5Nv3Ya7PDkGPWBCug"
  },
  "NHZX3SVn4brKkkKu1f3L0A": {
    "date": "5/22/2009",
    "text": "Why are the best Indian restaurants in central London such clandestine affairs? First La Porte des Indes, which I must have walked past several times before actually recognising its existence, and now Tamarind. Well not really 'and now' because it has been there for ages, with a Michelin-star no less. While the dining room is typically lavish, for some reason it reminds me of a 20s Chicago speakeasy, the sort of place high society went at night to kick back with some swing music and a bathtub mint julep. With hints of the exotic in its decoration, there is still something disconcerting about a room without windows. While I'm sure there are plenty of exits, it just seems to me to have a tomb feel to it. which isn't ideal for a relaxing meal. The food is of course inspiring, with delicate spices coaxing sensual moans from the taster, rather than the usual cacophony coaxing gasps for water. The taster menu is a particularly good choice is you enjoy the eclectic tastes of the subcontinent. All in all, I would definitely check this place out, particularly at the moment, when the capital's finest eateries are gasping for custom and real deals can be found (I believe their set menu is currently at 1999 prices).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "K8rH_JxeotcIX-_OFXrcTA": {
    "date": "2/7/2010",
    "text": "Tamarind is one of the more famous Indian restaurants in London ... one of the few which had been awarded a Michelin star ... and praised by most people i knew who had been there. So it was definitely a \"must go\" for me.It took us quite a while to find Tamarind, having got lost in the alleys of Mayfair while on our way there. The place was disappointing ... wasn't worth the effort we had made to reserve a table and get there.The vegetarian dishes were ok ... the lamb portion that i had ordered was somewhat dry and below par. The service was good. It was pricey, but at ~£35 a head, less so than i had imagined.Normally i would have described the entire experience as enjoyable ... had it not been for the immensely high expectations that i had from this place. My fault entirely i suppose.Now that they have recently regained their lost Michelin star, i am assuming that the levels would have improved significantly. I will go back once at least to check it out again.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "yGXxVqF0yvgt-8nP9X0qfA": {
    "date": "9/2/2008",
    "text": "Tamarind, which as far as I know is the world's only Michelin starred Indian restaurant, wants to change your perception of Indian dining. Okay. Before I ate at Tamarind my impression was that dining at a good Indian restaurant in London was a wonderful and affordable experience. After my visit to Tamarind, my perception was that dining at this particular restaurant was stupidly expensive, especially considering how mediocre the food was. Tamarind did manage to change my perception of what it takes to be a Michelin starred restaurant. It doesn't seem as such a reputable and exclusive club anymore. Service was phenomenal but the food was just okay. Really, I've had better Indian food at a tenth the price Tamarind charged. And the décor wasn't even all that. I mean, it was kinda nice-looking inside but not what I would expect from (or have seen at other) Michelin starred restaurants. Honestly, it was a bit tattered and in need of some touching up. Service was phenomenal, but ultimately who cares? There's no reason to eat here. It's star-status and astronomical prices are an enigma.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "uFz44MBLqCpkcSqmIhJslg": {
    "date": "2/28/2010",
    "text": "Okay, so yes, it's famous, it has its Michelin star, etc etc, etc. And you are definitely paying out the nose for these accolades. But in my opinion, there is better \"special occasion\" Indian to be had in London, specifically at Chutney Mary in Chelsea or at the Red Fort. I'm not saying the food isn't excellently prepared and presented, because it is.  But Tamarind felt pretentious to me just for the sake of it. And for what it's worth, I can't remember a single dish that I had the one time I went. Not so memorable.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZGTn42PI10nzs0Amg-7qg"
  },
  "Fye7G-iNIGTDljo7dqNxJQ": {
    "date": "9/30/2009",
    "text": "My boyfriend and I visited London for the first time and heard from several people that London had some of the best Indian food they had ever had.  So, after searching for weeks before we arrived in London, we decided to head to Tamarind our second night there.As soon as we walked in the door, we immediately felt welcome.  After staring at our menus for about 20 minutes I think the staff could tell we had no idea what to order!!!  Someone - who wasn't our waiter and I assume was a manager of some sort - came over to assist us.  He said he would prepare a mixed kebab for us for an appetizer which consisted of lamb, monkfish and chicken - and was ABSOLUTELY DECLICIOUS!!!  He then made for us a curry dish which had both chicken and lamb.  I haven't had many Indian meals but this was the best Indian I have ever had and was the best meal we had while visiting London for a week (we live in Boston).  I highly recommend this restaurant!!!!!  If I lived in London - I would be there every week...if my wallet could afford it!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L09yUwWHBZh31oCyIikgjg"
  },
  "FKG5_hX2mPo9ATlZVvaTvA": {
    "date": "5/14/2012",
    "text": "Horrible restaurant. Ultra snobbish, they think they are from out of this world and doing a favor serving you. Keep away, or you'll spoil your evening",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnaHsnjs9swUdQccTkJV7w"
  },
  "1A0T69XAALC-SyIMUAaOzQ": {
    "date": "9/24/2012",
    "text": "One of our favorite restaurants in London. Great Indian food and attentive yet unobtrusive service. I can recommend it highly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oqz_cxmdSkI8AAnRjZCf1Q"
  },
  "dCo9s-xRHHbcvriAnNjH7Q": {
    "date": "2/6/2011",
    "text": "This was easily the most high end Indian food restaurant I have ever been to. The service was very attentive and at that level you would expect considering the prices. I'd say its a romantic place also. We ordered the chef's 4 course selections for two when I was there the other night. It came out slowly on plates of starters like shrimps, scallop and other things that were unidentifiable but good, one after the other, in a fancy presentation until all the main courses came out of lamb, chicken, lentils, mustard greens and lots of nan bread and sauces. We could not come close to finishing it and there was nothing served we didn't think was very good. The place is probably a little more pricey that it should be. Our dinner for two with a couple drinks was 198 pounds. A ginger mojito we had was 11.50 pounds alone. Come on people, its only rum, lime, mint, ginger and ginger ale. Yes this is a place to impress someone and surely a safe place for a first time Indian food taster as virtually nothing was spicy that we had. Regardless of the high prices, it was a treat of an experience and I'd go again order off the regular menu which would cost considerably less.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtWYsp3Fagzr-yWtJvO8JQ"
  },
  "ZkMd3-QMpSPa_b2b_kOWAw": {
    "date": "11/29/2008",
    "text": "Mayfair was full of people on this Wednesday evening but all was so full that I ended up in this place.Down some stairs, I was accepted (with no noticable enthusiasm) and pressed into a corner. To be able to breathe I had to push the table back.There was only one other customer. He tried to request a special request concerning his food. After he got it wrong twice, he gave up.The papadom was good the pickles/chutneys rather peculiar.The food was OK even though a little different from how I know the dishes.The service people tried to do what they thought was expected.Anyway, with two soft drinks I paid 16 Pounds. Well.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pH7nTeWRHzUoEPGG0McgFQ": {
    "date": "6/12/2012",
    "text": "During a recent family trip to London, my In-Laws took us to Tamarind.  They live in Orange County and have been to the Tamarind location there and thoroughly enjoyed it, in fact, the owner set up the reservation for them.  Needless to say, we were all very excited for this Indian dining experience.  After taking the tube to the nearest stop and locating the restaurant, we descended downstairs and entered this beautiful restaurant.  I've been to many Indian restaurants, but this one by far is the classiest and nicest I've seen.  It's beautifully decorated inside with an elegance and lighting that makes it special.After ordering drinks (I had a delightful champagne cocktail), we placed our order including a variety of appetizers and entrees to share.  The appetizers, in my opinion, were the standouts.  I especially enjoyed the lamb chops and aloo tikki (potato cake).  In addition, we had chicken tikka masala and shrimp, along with a vegetarian dish and naan.  The mains were alright, but nothing had flavors that blew me away (like the appetizers).  The Hubs and I shared the dumpling dessert, which wasn't my favorite, but wasn't bad either.All in all, this was a memorable meal for all of us.  The service was great and the food is beautifully presented.  It is rather expensive, but the experience was unique and fun.  We all had a good night and we were glad we went to Tamarind during our stay in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b3DYIU3TFc4gy9H_50_hUA"
  },
  "sIg0u5VA03v0riQOJT6kDw": {
    "date": "6/6/2014",
    "text": "Great food, great ambiance and great experience.  It was a pricey meal (being in London on top of the expense), but it was well worth it.  Will definitely be returning.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "60_YVWROJLwG6RqUlLFMXw"
  },
  "CU2DECgf149P4TOUgj28zg": {
    "date": "6/4/2012",
    "text": "Very expensive Indian food!  We started off with complimentary chips with some sweet sauce.  We also ordered naan with chickpeas.  Both were good but not out of the ordinary.  I moved on to some fish dish that as you can tell was not memorable.   The only reason I know I had fish was the picture I had taken.  The only reason we tried this restaurant was due to the Michelin award.  Not worth it!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_GpktcrK2IUGduABrV0cVw",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_GpktcrK2IUGduABrV0cVw/o.jpg"
      },
      {
        "img_id": "_m6w0moWQeEO7654bsVf1w",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_m6w0moWQeEO7654bsVf1w/o.jpg"
      },
      {
        "img_id": "bMmCvzpVWP_GrleIERPFMA",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bMmCvzpVWP_GrleIERPFMA/o.jpg"
      }
    ],
    "user_id": "uujPDJmYzLJ7iUejqpc7sA"
  },
  "ks05mWNSQRvhs5iNYSGf2Q": {
    "date": "2/4/2014",
    "text": "I had a delicious dinner with a dear old friend and my husband here. We ate a lot for dinner: aloo tikki, gilafi reshmi, rogan josh, paneer labadbar, murgh makhni, raita, rice, and naan. Then splurged on dessert: tandoori ananas, chocolate mousse, and gajjar halwa. Plus some fabulous martinis and red wine. I am very thankful that this was recommended to me by a Brit that I highly respect. His recommendation definitely paid off even if it was one of the most expensive meals I have ever indulged in. Worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1D0quQaZ1k6YtjmV9tvRA"
  },
  "j7No6BSWrikwl8Z0JTHAwA": {
    "date": "2/16/2011",
    "text": "We adore it's downmarket sister eatery Imli, but wanted to see if Tamarind's higher prices meant higher quality food. No. Service and decor are typical Mayfair, but the Indian flavors were not as bright and differentiated as at Imli. Even the 3 sauces served with Pappadum included a cranberry (?) sauce that was more Like jam. Lamb cakes were so finely ground and under-seasoned, they could have been hospital food. Steamed sea bass had a \"fish whiff\" that suggested not the freshest. I will not be going back. There are much better upscale Indian joints nearby.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ACs87gU4xHw3-DM95ajbA"
  },
  "v08m9sPhAL7bjpR--Nc70Q": {
    "date": "12/23/2013",
    "text": "Tamarind is a great Indian restaurant in Mayfair.  The papdi chaat is amazing; great flavor and texture.  this is a must have every time.  I also like the Pudhina chops and kebab selection--you cant go wrong.  Great flavors and well cooked meat and seafood.On mains, the rogan josh and jhinga kallmirch are both very niceThe two kinds of dal are both excellent.  You also need to get a bread basket for the variety of naan breads.  And some riceWe had three people at dinner and probably had a bit too much food but not by a ton.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZGmjA3NrrmcHVX3SoAWaZw"
  },
  "y-tmttnSOquXG1XRTjPl4Q": {
    "date": "5/31/2015",
    "text": "We were so lucky to have them squeeze us in! Best meal of our trip! The Papdi Chaat had great flavors all mixed together. I have a garlic allergy that they worked with and created an amazing lobster meal. My husband had the hyderabadi shank and love it as well. We indulged and got several types of stuffed naan. So good! Highly recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suPOs9GcYMi0rCJhSr-PKA"
  },
  "KRvXOqvfNyJvYH9nf5qr5A": {
    "date": "11/10/2007",
    "text": "When Tamarind was first launched in 1995 its unusual decor of gilded Lillies running through the restaurant was a big hit in Mayfair. Very recently I decided to take some friends there and I must admit that the quality of the food is just as good as it was 12 years ago when it first opened. Although the decor looks a bit scuffed but I though to myself I am not going to be eating the decor.Chef Alfred Prasad is still the chef and the quality of his cooking has lost none of its goodness. He still produces consistently perfect dishes, otherwise they wouldn't be open. On this occasion I had a classic North Indian Lamb Biriyani topped witha pastry lid which releases the dish's aromas when lifted;the generous amount of Lamb chunks within were tender and succulent; the rice grains distinctively flavoured with mild aromatic spices. Even something as homely as the Tarka Dhal was sublime. Not all the dishes are as Classic as these.There are new tastes and flavours as well like Paneer Tikka-vegetarian cheese chunks marinated and cooked in a hot charcoal oven, or grilled Kingfish Chunks both light dishes which have a very nice pleasing taste. Whenever I eat Indian food be at someone's house or at a restaurant or cafe I always go for the Rice Dishes because they really know how to cook Rice. I am always amazed at how seperate and perfectly cooked through each grain of Rice is. Basmati Rice which come in numerous varieities is just right for curry and Biryani dishes. Enough digressing-although the prices are high in Mayfair we did not mind paying for the excellent cooking and friendly attentive service for party of 10.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "AmIXI3TRAMVteOEN81Jz5w",
        "caption": "Photo of Tamarind - London, United Kingdom. Tikka",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AmIXI3TRAMVteOEN81Jz5w/o.jpg"
      }
    ],
    "user_id": null
  },
  "ZQnZDrMTEBcMJqGJQKFsRA": {
    "date": "2/2/2011",
    "text": "I first encountered Tamarind at the Taste of London.  In comparison to the Cinnamon Club, I didn't think it was nearly as good but I like to give any place the benefit of the doubt.  I love January and all the deals you come across because there was a 2 for 1 sunday lunch offer on toptable for the tasting menu.  Service was really good but I think initially they had forgotten to put our order through for about 15-20 minutes but later apologized and brought out poppadoms.  There was a huge variety but really enjoyed the lamb chop and the fish curry.  Was officially overstuffed and completely content by the end of the meal.  Will definitely come by with or without any offers.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "iUMiF4-440qjVxLgJaTCvg": {
    "date": "9/5/2013",
    "text": "Excellent service, great food, great ambience. Couldn't ask for more. The crew works as a well orchestrated team, and service is fast, friendly and courteous. Will love to come back again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aGCseYvl-1LfsMRwRtPNfA",
        "caption": "Photo of Tamarind - London, United Kingdom. Great ambience at Tamrind London!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aGCseYvl-1LfsMRwRtPNfA/o.jpg"
      }
    ],
    "user_id": "epux2DEkzy4l2C4XLWiOEw"
  },
  "Nwpi_rtjlz2pD6ukC29Ghw": {
    "date": "7/7/2010",
    "text": "I'm really surprised by the good reviews as I didn't find this place very good. It's definitively over priced for what it is - an average Indian restaurant. I've had far better elsewhere. Having lived in California and worked with many Indians, I have had my share of great and tasty Indian food, for much less :))) I was really shocked to pay £80 per person for ok food. The dessert (gulab) was especially disappointing and a little ridiculously presented. Apart from the price, I also was a little puzzled by the cuisine style. We had told me it was a modern twist on Indian food. I didn't see that.But I would say that Tamarind is a nice place, quite dark but pleasant for a date. The staff is really nice and smiling. It is underground, so it all makes it a little claustrophobic to my taste ;)I wouldn't go back, and well prefer a small shabby place and get the full Indian experience at a far better price :)",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dCc-tKxHrXd54oYqmQhng"
  },
  "GgPdQ8aZiobcYIWaO4I4Eg": {
    "date": "5/13/2015",
    "text": "We had a very good meal at this restaurant. The prawn and chicken starters were some of the juiciest I've ever had and the palak paneer was superb. The lamb kharai and chicken tikka was good but not outstanding. The service was friendly and attentive from start to finish. All in all a very nice (but pricey) experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8999qt0V_2dh2qkbgbh1g"
  },
  "ht8os3pmJAMrm2T7AxtXVg": {
    "date": "1/30/2011",
    "text": "We came here on Tuesday night with a special offer from Keynoir, we got a £150 voucher for £75. The staff seemed really pleased to see us and were helpful and involved in choosing us pre-dinner cocktails. Popadoms came with three diferent dips, none of the usual stuff you get in curry places but they were all interesting and a change is always nice. Then we had a trio of starters, one lamb, one prawn and one vegetable. These were all excellent (and filling). For the main course, we had a lamb curry, a chicken curry (a lot like a masala), a couple of vegetable dishes, naans and rice. One of the naans was flavoured, I can't remember with what, but it was great. Of the other dishes I enjoyed them all, but the chicken was probably the best. I was pretty stuffed after that but there was still dessert to come, luckily this was quite small portions of a chocolate mousse, rice pudding and something else I couldn't identify. Rice pudding was especially tasty. Will definitely be going back here.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jQmrNMem_E7p1R7PmCtt3w": {
    "date": "4/16/2011",
    "text": "Wow! I have never associated Indian restaurants and fine dining, but Tamarind has re-written the rule book. The food was delicately spiced and packed a punch of flavour. Lamb that was so tender my fork went through it like a hot knife through butter. The portions were perfect - not too much to overface, but enough to make sure that every last morsel was savoured. The staff are quiet and attentive, and the decor absolutely beautiful. I will have no hesitation in visiting again next time that I am in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JD5sVV3sARkuaHupEfGfSw"
  },
  "tQFagbCSXH4avy0t1vDodQ": {
    "date": "7/26/2010",
    "text": "We came here on our first night in town, at the suggestion of the concierge at our hotel. He named it as his favorite Indian restaurant in the area, and after dining at another more notable Indian place (coughVeeraswamycough) and having a less than stellar experience, I can see why.The staff was friendly, the atmosphere was really unique, and the food was great. The portions weren't as big as I expected for the price, but they were enough for me. We got the cheese stuffed naan (not enough cheesy stuffiness), the lamb chops (perfect), and the chicken masala (because I'm boring.)I really like the fact that you can see the chefs through the glass, but in a way that doesn't scream Chuck-E-Cheese. The place was empty when we came in (red flag) but packed by the time we left. I would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yMbA8Znv8CF4wJyUfM6XCA"
  },
  "iwbyhgXZV4JK6d1EWNfU8A": {
    "date": "9/30/2011",
    "text": "not sure what the rave is about...the food is pretty good but at that level in mayfair, i expected better service and organization.  super disappointing after recommendations from colleagues.for starters, we were introduced to this restaurant through the london festival and thought it was a good way to check it out.  made reservations through bookatable for which the email reservation confirmation clearly stated the offer.  upon arrival at the restaurant, they had no idea what i was talking about and instead, tried to offer a 90/ or 50/ person menu.  not wanting to make a fuss, we just order a la carte.the server had very little patience for some reason.  and when asked, \"what do you recommend?\" - just wanting him to order for me, he threw me this look, \"can you read?\"  the food was good.  wine list was good.  just really unorganized and not helpful.  the restaurant did call to apologize for their festival offer error...but that was it.  the consumer is always the one out of pocket.  they didn't even have the business savvy to honor their advertisement.i definitely prefer cinnamon club or noorjahan2 over tamarind.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "bSGYA0zwYaP0o2HbkBpwQg": {
    "date": "1/13/2010",
    "text": "White table cloth Indian restaurant with an abundance of well dressed staff catering to a well healed crowd. The underground dining area is quite nice and decorated with style. We enjoyed seeing the kitchen through the glass window wall.  Food is fine. Best to come looking for a nice experience rather than a traditional Indian food meal. The prices were a bit high considering the portions are served in small dishes (although, I appreciate the small size thus ability to try many different tastes). This is a nice alternative to what you find in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOGy3TnKjUzUPVH3kqh5mg"
  },
  "6n8gw9oPkMR8xvUt8vezTg": {
    "date": "2/19/2010",
    "text": "Generally regarded as a must go...and I guess that's about right.This is not your local indian it is as far removed as you can get.I have been twice and both times thought that the food was good and the cocktails nice (okay I had a beer)  and I left sated....and a little poorer. Very good if you want to impress a date or business clients.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q59vnLIaj0S0NbQDfAtORg"
  },
  "Bx68alr_o5EWzMtgJvbk4w": {
    "date": "2/16/2009",
    "text": "It looks like I am going to be the first to review this place, and I feel badly panning it without some back story.1) My wife is Indian, I go to India at least once a year, and yes, I eat a lot of Indian food.2) I am extremely suspicious of attempts at taking ethnic cuisine, and some how making it 'upscale' by serving it on small white plates and charging 4 times the going rate.That being said, OH PLEASE......Look, its not like Tamarind is serving up slop, they're not. The food is well prepared (a few dishes were a bit bland), and I asked for their house red wine, and it was quite good. In fact if you go there, I would guess you will get a good meal (eventually).But basically this is a repackaging of standard north Indian dishes. Its not bad. But it sure as hell does not justify the cost! Wait, wait, I know what your thinking. Sometime one WANTS to shell out the clams and have an upscale experience. Perhaps you want to impress a client or a hot date with your knowledge of exotic food. Well by all means do it. But I do hope you score that deal, or perhaps a good night kiss, because this place is not a good value proposition. The service was crap. There, I said it. Pure crap. My wine glass sat empty for 10 minutes waiting for attention. After quite a while of waiting, we had to flag someone down to get more rice. WTF? Are you kidding? Tamarind is not a bad restaurant. Its simply a very overpriced restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 8,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "gQ--9tYglqyx5TfO-1mw0g"
  },
  "ppkL1D0DGKXzcvCd9M73Tw": {
    "date": "6/30/2014",
    "text": "This is an expensive restaurant w very fussy service. I thought the waiter was go to slap my husband's hand for pouring his own water. But we chose several appetizers to share and no wine. So maybe they were annoyed. Have to say food was excellent. Very nice flavors. Go when you have lots of time and money. Oh and it is loud.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9yYXfXZZ9X3YehCr0pSm8A"
  },
  "-VPUpmwRf4Bc-plgyDw0lw": {
    "date": "10/21/2013",
    "text": "This was not the best, not the worst.  Just ok. The service was good and I loved the kabobs. Something weird was going on because two cops kept walking up and down the street with machine guns. Had nothing to do with the restaurant but still unnerving. The location is great! Right in Shepards Market.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WD0pchQWVY5tBbPqRq4zjQ"
  },
  "_xcrZP_Alcwa717CVmv_Kw": {
    "date": "12/29/2015",
    "text": "One of our favorite Indian restaurants in London- the service and food are great! It's on the nicer side but still very comfortable with very accommodating staff. Their gluten free options are exceptional and they made sure to tell me when they brought food to the table if something wasn't GF.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "icsKqtfjENqIjhdWx9nOQA"
  },
  "GrdNiJxH_5i65csSXph70Q": {
    "date": "10/23/2013",
    "text": "Very delicious food from the set menu. Favorites were the lentils and chicken tikka masala. Lamb cutlet, marinated chicken and yogurt tiger prawn were also amazing. Great service and ambience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lXOIKycprQt0L--cjAGCdQ",
        "caption": "Photo of Tamarind - London, United Kingdom. Mango basil sorbet was the best way to end the meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lXOIKycprQt0L--cjAGCdQ/o.jpg"
      },
      {
        "img_id": "JWHdYIRWWg-KTQ1vwm3Bhw",
        "caption": "Photo of Tamarind - London, United Kingdom. Tilapia, king fish and tiger prawn",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JWHdYIRWWg-KTQ1vwm3Bhw/o.jpg"
      },
      {
        "img_id": "kmzrjyVZXqUWysWNDUp5Aw",
        "caption": "Photo of Tamarind - London, United Kingdom. Lamb, chickpeas and chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kmzrjyVZXqUWysWNDUp5Aw/o.jpg"
      }
    ],
    "user_id": "v81yCSm28kfOsZ4IneR1nA"
  },
  "CRMA88jl_sf0JgoR2jDjqA": {
    "date": "1/26/2014",
    "text": "Tried to get a reservation for Zaika last night but was informed they were closed for remodeling and on their suggestion decided on Tamarind. Overall good service, nice decor and atmosphere and good but not stand out food. Started out with the scallop appetizer and the chicken kabob. The scallops were cooked perfectly but under seasoned for my taste and barely warm when brought to the table. The chicken kabob was made up of ground chicken, green peppers and spices and had a slight kick to it. It was good but not something I'd go back specifically for. None of the chicken main dishes stood out to me so after describing what I typically enjoy (lots of heat and cardamom, star anise) the waiter recommended a dish that was not on the menu. I also ordered the bread basket. The chicken dish was seasoned excellent and had plenty of heat but unfortunately I failed to ask for chicken breast which I prefer and it definitely needed more sauce. The best part for me is dipping my naan bread in the sauce and unfortunately there wasn't much to dip in! The bread basket consisted of regular naan which was bland, a stuffed naan which I was really excited to try but again tasted bland to me and one that I think was garlic which was decent but not the best I've had. I would give this 3.5 stars (if I could). Good but no comparison to my favorites Zaika and Tamarind in NYC! Forgot to mention the white chocolate dipped mint leaves at the end of the meal....yummy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c8vHe2n9IUH3zcm74GXk8w",
        "caption": "Photo of Tamarind - London, United Kingdom. Scallop appetizer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c8vHe2n9IUH3zcm74GXk8w/o.jpg"
      },
      {
        "img_id": "Atcd-m14Y_Vxl-1YPekMVg",
        "caption": "Photo of Tamarind - London, United Kingdom. Chicken kabob appetizer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Atcd-m14Y_Vxl-1YPekMVg/o.jpg"
      }
    ],
    "user_id": "qaju-460BsyxaVKhcdEogQ"
  },
  "0je9uv5DJWunP3Rwe1NozA": {
    "date": "8/2/2013",
    "text": "Upscale Indian is an oxymoron like jumbo shrimp.  I am a salt of the earth type of food person.  I don't mind nice while tablecloth, good service, austere room, etc... when it makes sense.  I've had great meals in other high end Indian like Cinammon Club but I think Indian is better served in more homey type settings. The chicken tikka like dish was very good.  The appetizer with chick peas and yogurt sauce was very lovely.  I thought the jumbo prawn was ok, didn't have much flavor compared to the other dishes.  Vegetable dishes were very nice.The amount of naan per order for 4 pounds was absurdly small. My 3 stars here is probably a little harsh but for the price I think I'd rather keep some extra pounds in my pocket and go somewhere a little more run down.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "op8FmScVlXFkVcqmyAlD3w"
  },
  "R87xdZ3UTW1BZEfTYZxOBw": {
    "date": "5/12/2013",
    "text": "Definately had better Indian food in London.    Was he for a friends birthday and probably had the worst table in the restaurant. Persuaded to have a set menu by the waiter which was not that great and pretty run off the mill Indian fareNot worth the money",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmhoNslSVLE_Yviz9HO8pw"
  },
  "CEJzYUKd4eSny97TKP2wew": {
    "date": "1/29/2013",
    "text": "My experience at Tamarind was very good, but that might be because I wasn't the one paying the bill. The atmosphere was inviting and very posh, and the service was out of this world. My wine glass was never any less than half full. Our server was very nice and answered all of our questions and provided many recommendations when asked. My brother asked what the spiciest thing on the menu was. Our server told him that while nothing was very spicy, he could certainly tell the chef to make his order extra spicy (which my brother later regretted, because the definition of spicy with Indian food is quite different). The food was very good. I ordered the Chicken Tikka Masala, and definitely enjoyed it. Everyone in my group thoroughly enjoyed their food.All of that being said, I have had Indian food that was just as good, if not better at other Indian restaurants for a fraction of the price. You're paying more for the dining experience, I suppose. But I was extremely happy I wasn't paying the bill. My wallet cannot even comprehend spending that much money. The final bill was more than I spent on my bed and mattress...and is more money than I have in my bank account right now. I don't want to give them a negative review, by any means. It was a great dinner, experience wise it was my best meal in London. I'm just holding the food to a high standard because of the price. It wasn't as good as what we paid for it. The service was.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmdkdw3k6n46fQPUziRRRw"
  },
  "mlbT6GXqfxxjEP7cjJ2-ew": {
    "date": "10/6/2012",
    "text": "I ended up at this very posh Indian restaurant with two friends the other day. The decor here and elegance is quite simply unbelievable and right up there with any other restaurant I have ever eaten at. We chose to split a bottle of red wine and went with the chef's selection. It was incredible. From the incredible appetizers to the dal, naan and chicken tikka masala, this easily goes down as one of my best Indian food experiences ever. My only minor complaint is that the service was a little bit silly with 2-3 servers asking us about water/food/wine and or dessert. This place is also quite expensive, but it is money well spent!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "k1pEVOCNUaklSh01l04aiw"
  },
  "t4JG2yBkyNtAurUeWKJIkA": {
    "date": "2/27/2017",
    "text": "A friend from San Francisco happened to be in London last week the same time I was visiting for business so we decided to have dinner together at Tamarind's.  I had been twice for dinner over the last few years and had always enjoyed my meal if not \"wowed\" by the experience.  The restaurant is below ground in a pretty enough space, the tables are always full so be prepared for a noisy background which certainly would make conversation challenging for more than 2 people.  The food was good - we ordered naan with raita, adraki tikka, chicken tikka masala and saffron rice.  The portions were surprisingly small for the price but still sufficient.  Think our biggest disappointment was the service.  Our waiter virtually disappeared after our main courses were served.  We had to search out a waiter who would bring us more naan, take away our plates, bring us our check, etc.  Too many fabulous restaurants in London to return here.  Think the bloom is a bit off the rose.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayYPcaYfelWUfqquCOdgTg"
  },
  "Tnm_pBiT1xxOheakn5jpBg": {
    "date": "7/14/2016",
    "text": "It is difficult to write a review for this place. The food is good. It is comparable to the top Indian restaurants in London like Amaya. The decor and ambience is also pleasant and simple. The main issue with this place is the service. The service is almost arrogant and tries to be smart on customers. They have Head Waiters who take orders and bring bills while the waiters only bring food and clear tables. They have only 2 Head Waiters so when the place is busy no one pays attention to the customers. When we were sat down the Head waiter asked us if he should arrange the dinner! (we were only three) or whether we would like to have a menu (is that a question?). I like to check the menu and while I may ask for recommendations I don't like someone else to choose my food. So when I said we would like to see the menu the service went down the drain from there. No attention at all. We had to call few times for anything including placing an order! We had to call three times to get the dessert menu and when it was given to us no one came to take the order after waiting for 15 minutes. Finally we asked for the bill and decided to leave without ordering any desserts. When the bill arrived we realized why they are hesitant in giving out the menu. They had charged us for dishes that we didn't order no had. After we complained they removed the items without even apologizing. It seems that this is a usual practice. So one has to be very careful here. Will I come back? I don't think so. Service is an important element of a dining experience and this place definitely lacks it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2vnLbkofUDnmdi0edPhew"
  },
  "G-5KvhFuaxlCD_2ayFB5Qw": {
    "date": "7/24/2013",
    "text": "Great service and really good food and presentation. Indian food in Toronto (where I live) is usually a miss rather than a hit, but places like Tamarind in UK bring in the good stuff. The kebabs were fantastic and the mushroom appetizer was good. The mains were good too. Service was stellar and the ambience was good.But this place doesn't come cheap.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kf10dTiGlcnyhj8DBoZn1A"
  },
  "RaAlGc9RieX06qW_VsmUjQ": {
    "date": "7/4/2016",
    "text": "Great restaurant and even greater service! Its in a fancy location, quiet and ideal for indian food lovers",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SjP_FaFRJg8hTQeHfIrd8g"
  },
  "nkKT6utcVuTSBuAtXsM6Sg": {
    "date": "11/15/2015",
    "text": "So very good! Amazing indian cuisine in London! We have been going there for years and everything is delicious.  Tamarind Mayfair was the first Indian restaurant in the world to be awarded a Michelin star. The Malabar Shrimp is delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vl_56eCWkgKV-qq-HvSfFg"
  },
  "7ZhkJG6svNIQyTVI1JeTKQ": {
    "date": "5/26/2013",
    "text": "I once considered Tamarind the best Indian restaurant in the English speaking world. I'd say still good, but the competition has elevated itself. A few mishaps with the lunch special, including a very small piece of shell in my seafood dish. Still an experience and if you can't get a table elsewhere, Tamarind will suffice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ox99-mEMGzT2c0tS30sDGQ"
  },
  "QgQvfZVIFWD3yJKsjUSxrw": {
    "date": "2/13/2013",
    "text": "Oh man! An Indian w/ a Michelin Star ...What'll you expect? Perfect food? Perfect service?OK - all true!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2qc0uWaSRWDXMxVTtfNr-g"
  },
  "wSSxnOvyzpv6QmIdMExlbA": {
    "date": "8/8/2012",
    "text": "I've been to Tamarind a few times now and every time has been a wonderful Indian-dining experience. Their unique cuisine is the best Indian food I've tasted. It's full of rich, authentic flavours, traditionally and beautifully presented! Service from staff was excellent, they were all very friendly, efficient and helpful.Yes, it is pricey, but well worth the money. If you're looking for a restaurant to celebrate an event like a birthday or an anniversary, Tamarind is perfect. I'll definitely be going there for my next birthday! ;)Oh, and just a polite note to reviewers who complained it was expensive and not worth the money - You're dined in London's Mayfair, one of the City's most affluent areas! If you wanted a cheap curry you should have went to Tooting or Brixton ............. :P",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8FUPOPt_6i9msqmWvze71w"
  },
  "Rld459TqTZs8cEFuoMOyLQ": {
    "date": "12/4/2011",
    "text": "As part of our trip, we wanted to try a real authentic London style Indian restaurant.  So my boss suggested we try Tamarind.   This place was more then we expected.  This restaurant is Indian cuisine in a fine dining atmosphere.  The decor is dark and modern.  Very posh!!!I was very pleased with our choice.  The service here was outstanding.  They gave us nothing less then 5 star service.  The staff here are very attentive since the moment you walk thru the doors.  The food was incredible.  It was even better then I could ever imagine.  The chicken Malasa was out of this world yummy.  The Tandoori chicken was well prepared.  It was seasoned perfectly and very moist.  Both dishes were outstanding.  Everything was sold a la carte.   Therefore at £15- £20 per dish, it gets rather pricey dining experience.  But it is well worth it on those special occasions.  There is an additional VAT service charge.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "BGtm4ze2UUHOKEwlILx_mw"
  },
  "QTDGCSd06S5bfa7Mkld7IQ": {
    "date": "2/20/2012",
    "text": "Catching up with SC, we ended up heading to Tamarind for dinner. I was looking forward to the meal and we both opted for the tasting menu. A round of various sauces to dip our papadums started us off.Spiced chickpeas with mint chutney and sweetened yoghurt topped with tamarind chutney skewered ground lamb kebab with ginger, chilli, cheese, paprika and basilThe chickpeas had a delicate spiciness which was a great contrast to the coolness of mint and yoghurt.The lamb kebab was moist and tasty without a greasy aftertaste.Tiger prawns marinated with ginger, yoghurt, paprika, dill leaves and ajwainThis wasn't as positively received as the prawn was either frozen, not fresh or overcooked as it had a mushy texture.After the duo of starters, a tray of various bowls with ladened with our mains arrived.Monkfish chunks marinated with yoghurt, coriander, mint, mint-leaf, green chilli, roasted gram flour and saffronThe Monkfish was cooked well with the aroma and taste of lemongrass sealed in the charred bits. The spices harmonised together with an overall sweetness balance.Chicken Tikka in sauce of fresh tomatoes, with ginger, red onions, green chillies and crushed fenugreek leavesI found the chicken tikka to be veering slightly on the sweet side as well.On the vegetables side, we had shiitake mushrooms in pureed spinach, flavoured with cumin and garlic and slow cooked black lentils, a speciality of the Northwest frontierAll these were mopped up with a choice of cumin and saffron rice and toasted almond/date naan.For desserts, we had a velvety dark chocolate mousse with a hint of cinnamon and orange zest and basmati rice simmered in milk flavoured with clovesAt the end of the dinner, I found the meal to be satisfying. The dishes were all made to be friendly and appeal without pushing the boundaries of the palate of the people I didn't get the spicy explosion that usually comes with Indian cuisine but it does hit all the basic elements.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "RdoAoxO3bem8QcRB6GhQPw": {
    "date": "1/6/2015",
    "text": "Expensive and poor service. Food is nothing special either. Little care is taken I am afraid to the detail. I was very disappointed. You will not write home about the food unless you like the average.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f5ucpG5YxKQeJoHCr0Phtg"
  },
  "h9OF7XI3CjGAA6fR-DC3Og": {
    "date": "8/18/2009",
    "text": "In short, Tamarind was good, not great, and very overpriced.  Small entrees hovered around the £20 mark, and the food was not delicious enough to warrant this price point.To be fair, Tamarind makes no pretensions at being an authentic hole-in-the-wall type of place and what they offer is meant to be high-end.  The atmosphere furthers this purpose - upon entering, a set of stairs takes you down to a glowing dining room with a high ceiling, with a sizable wait staff dressed in smart uniforms.  Service was attentive as well.The food was pretty decent for the most part, with a couple misses.  The complimentary crispy chips and the trio of accompanying chutneys was great.  Our table of four shared three appetizers, two kabab dishes, and three curries, along with sides of nan and rice and one dessert.  Of the appetizers, the palak-patta chaat (spiced chickpeas and whole wheat crisps with mint chutney, sweetened yogurt and tamarind chutney) was my favorite, followed by the spicy galaoti murgh (ground chicken with browned onions, mace, saffron and herbs with mint chutney).  The grilled scallops, flavored with peppercorns and drizzled with roasted peppers and crushed fenugreek in olive oil, were a little more cooked than I would've liked, especially at £4 per scallop.The kababs were, on balance, very dull.  Tandoori chicken was dry and lacking in flavor.  The kabab selection (£22 for four pieces of meat - the winner for biggest rip-off) came with monkfish, tiger prawn, corn fed chicken supreme, and lamb cutlet.  Of these four, the lamb cutlet was the only one worth remembering, though I'll admit that was quite good.  Curries were better.  Both the achari jhinga (tiger prawns tossed with cumin, onions, and tomatoes) and the chicken tikka with chunks of potato were very, very tasty.  I didn't like the kashmiri shank, which was labeled as a house specialty.  This was slow cooked lamb shank and it had more fat than flavor to offer.  The naan and braised rice with browned onions, cumin, and saffron were both good, but I've certainly had better for under £3.95.The tandoori ananas dessert - a house specialty of grilled pineapple marinated with star anise, honey, and saffron, served with a scoop of rose petal ice cream and two blackberries with a drizzle of berry sauce - was a nice way to end the meal.  The pineapple was warm and tasty and the ice cream fragrant and lovely.  I'm not sure that their integration did a whole lot to elevate the separate components, but definitely solid.  After our meal we were given dark chocolate clusters with fruit and nuts as well as mint leaves coated in white chocolate.  These were welcome surprises.A special challenge faces proprietors of upscale ethnic establishments - people who know and enjoy their ethnic food can usually get it cheap and delicious elsewhere.  The challenge is not insurmountable - Hakkasan, another Michelin-starred restaurant we visited on this trip comes to mind - but I don't think that Tamarind successfully surmounted it.  That said, I had some good food here and the wine we ordered was better than what I might get at, say, an Indian lunch buffet in the States.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WWnhqRnWWjutMqh-2SzEuQ"
  },
  "TaPYFOaXOejavmSjBbnvww": {
    "date": "6/15/2017",
    "text": "Without a doubt the best, fanciest Indian I have ever had. A great wine list, a helpful and attentive staff and gorgeous food. I don't think I could have asked for more. Awesome!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kyBCAm0mKlhseBheKgJPdg"
  },
  "FxAQFmydwPzg_JTqS3iUxg": {
    "date": "5/9/2016",
    "text": "Was recommended as one of the best Indian in town.  It wasn't.  Don't get me wrong, food was ok/good but I don't think it deserves best of...Chicken Tikka Masala: We ordered extra spicy.  That particular request costed us an extra half an hour - or at least that's what we were told when we inquired whereabouts of our much delayed food.  And it wasn't extra spicy.Don't think I'll go again.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_kRX4bvP6HFII_OtX65GQ"
  },
  "ATLTZ_10G6m1orFdXfaf7w": {
    "date": "12/6/2016",
    "text": "This is a really great experience in no small part due  to our waiter, Joseph. First class food, liquor and service from the moment we walked in. My favorite was the lamb chop appetizer.  But it all was great. It's not inexpensive, but it is value for the price. Try the yoghurt and chickpea appetizer - it was killer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljNNJjrtxqWaNnSamXDXMg"
  },
  "N2EVRY3IsTL9mpxbewkhPw": {
    "date": "4/14/2015",
    "text": "I always get worried when I have to go to an Indian restaurant. I think will this live up to my mother's cooking? The answer is usually no and Tamarind was a no.Four of us went for a friend's birthday and upon arrival we were asked for our coats and were sent down the dimly lit stairs which revealed the beautifully decorated restaurant. At the bottom of the hallway we were instantly greeted again and were escorted to our seats, where a waiter welcomed and introduced himself, even though most of the evening we had different waiters serving us.The menu was pretty limited from what I had expected but that to me meant that they were confident about the dishes they were serving. I had scallops for starters, the shank for mains, no desserts as we were not totally satisfied with what we had and for drinks I had a virgin colada, strawberry lassi, plenty of water and coca cola (I was the designated driver). They all came presented perfectly.The scallops were cooked and seasoned perfectly but nothing else. I was waiting for a punch of spice or something that would have made the dish standout but nothing. I got to try my friend's Papdi Chaat, that was delicious, fresh and I could have happily ate a plate by myself. My virgin colada was nice but that was it. The shank was beautiful, cooked perfectly and the spices were bang on. I ordered naan which was the wrong thing to do but why did the waiter not stop me when I was making that error. He could have easily said I would recommend rice but we never got that from the waiter except would you like any dal tadka to go with that. Hmm... no dal tadka thank you but you could have recommended me rice for my shank. Anyway I still enjoyed the naan with my shank. My friend totally hated the biryani and she never complains about biryani but she said it lacked spice and flavour.The last thing I had was the strawberry lassi and what a disappointment that was. Hardly any flavour of the strawberries coming through which gave it more of a lassi taste rather than of the sweet strawberries described.We asked for the weighty bill which was accompanied with some lovely chocolates and off we were out of the restaurant, half full and half disappointed. Comparing Tamarind to Benares which is also an Indian Michelin Star restaurant, Benares wins outright.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A-18F7EkYzbsZ-NcP-lZbA",
        "caption": "Photo of Tamarind - London, United Kingdom. Shank, Rice, Biryani and Virgin Colada",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A-18F7EkYzbsZ-NcP-lZbA/o.jpg"
      },
      {
        "img_id": "f_CdXWKIPbdOgWyJCrSPSw",
        "caption": "Photo of Tamarind - London, United Kingdom. Scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f_CdXWKIPbdOgWyJCrSPSw/o.jpg"
      }
    ],
    "user_id": "zRs1n6ONHsaIEe0EbV3snQ"
  },
  "FSv0nFokTSPN7J3oyli2gA": {
    "date": "4/27/2016",
    "text": "Tamarind is an elegant, modern, white linen Michelin Star Indian Restaurant located in the Mayfair district of London.  The dining room is located below street level in a small intimate room.  This is a great venue for both intimate personal dinners as well as business dinners. The Indian food at Tamarind is traditional West Indian food prepared in a tandoor oven; it is delicate, subtle, and expertly balanced with spice resulting in delicious unforgettable food.  Dining at Tamarind is a special experience that will transform your experience with Indian food and perhaps directly influence your thoughts about India's culture.Tamarind's atmosphere is warm and inviting; the service (run by Fernandes, a native of GOA) is impeccable, the head wine sommelier Reynald Felder is refreshingly knowledgable and passionate about wine and it's pairing with Indian food.  There are very few (if any) restaurants that we dine at where the sommelier knows as much as my husband does about wine or is as passionate as he is.  For wine lovers, the wine list at Tamarind is well assembled and balanced.To assist you with the menu you may want the assistance of Fernandes.  For our recent dinner we paired a delicious bottle of white burgandy (a Folatieres, Puligny Montrachet) ....  which has a light, smooth, and a seductive taste with a mixed appetizer from the kebab menu, including tikka prawn (our favorite); and the main course items of Lamb masala, Chicken tikka in tomatoe, potatoes and okra, and garlic naan.Tamarind is a fabulous restaurant that never disappoints.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ctDkiUl2xIo6oGgTVO-w-g"
  },
  "HcG3pcSAHLdVh5i44vYvIw": {
    "date": "3/21/2016",
    "text": "I've been coming to Tamarind since they first opened. I would always try to stay in Mayfair when I would come to London on Business every quarter. Walking inside Tamarind I love the beautiful well appointed and elegant decor that is sophisticated and luxurious, not stuffy.Tamarind's traditional Moghul cuisine allows you to try dishes that are cooked in their authentic tandoor style oven. I lost a bet the previous evening with my college roommate so I was buying dinner. I figured if I was paying we might as well try as much of the menu as possible. We started with Aloo Tikki, Grilled scallops, Kalonji Jhinga Tiger prawns with ginger, yoghurt, paprika,ground spices and toasted nigella seeds - Yum. For main courses we loved the Kadhai Gosht Lamb with peppers, onions, crushed coriander and cumin; The Chicken Tikka, and Tali Macchi fillet of sea bass.Needless to say we skipped the desserts, but were able to wash this 3 hour dinner down with some cold lagers. New York needs some better Indian cuisine, and a proper Tamarind is in order.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGehWsGAHrtN5KLZ7JyE6A"
  },
  "kmuK9VWbzHGNLKuFH8Koag": {
    "date": "4/28/2017",
    "text": "We had a reservation, we were delayed about 10 minutes. The table was not up to the delay. The service was fast, so fast that they brought the salad with main dish. Of course we refused the salad and they didn't apologize and refused to pay for it when they billed us. I strongly believe that the food was precooked, and they only heated it for us. It tasted good to average. We ate Lam Biryani and something like butter chicken. It was overpriced by 25-35%. Most or serving staff were not Indians, which made the restaurant loose its authenticity. For food 4 stars for service one star.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jwqcHuPJ1McewCctpdS2Eg"
  },
  "irOfXhluSGHjgShU7tgPPQ": {
    "date": "1/14/2016",
    "text": "Extremely well done Michelin starred Indian cuisine - I was very happy on almost every level.My girlfriend and I made a late arrival into London and were extremely fortunate that our reservation at Tamarind was held despite it being a Friday night reservation (and what we saw was a full house).The hostess (Natalia) was very kind and guided us to our table where we were served by what looks like Indian mafia bosses as waiters. We ordered the following:1) Papdi Chaat - Surprisingly light for a street food appetizer dish like this and full of flavor2) Lobster Masala - Lobster tail meat, surprisingly a good portion. For some reason, the sauce didn't do a whole lot for me but the meat was great.3) Murgh Makhani - You can't go wrong with this butter chicken dish. Excellent curry.4) Prawn with Coconut Curry (forgot the exact name for this curry) - Highly recommend this one. The curry was also very very VERY good.5) Plain naan of course which was good6) Kulfi (both pistachio and mango) - Surprisingly a bit let down by these BUT worth a shot. Maybe do the gulab jaman instead!With Indian food, I always do Old Fashioned cocktails as it pairs very well for me and I gotta say...they make an AWESOME Old Fashioned here.The space is great, service is class, and you walk away with a full stomach guaranteed.Highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_-ZsOb-U0Z8I9BthrVoFIA"
  },
  "bb4rMZULBheqS1vg--UiJQ": {
    "date": "12/20/2015",
    "text": "This place is excellent.Had a wonderful dinner here. Was in a party of three. We got the group menu (£72 per person). Obviously that's not cheap, but the food was outstanding and the portions voluminous; we had quite a bit left over, and we were completely stuffed.What I liked about the food is that it wasn't over-engineered or anything. It was classic, hearty and delicious. I think the other set menu ('tasting menu') was more high-end and painstakingly presented, but the stuff we got was straightforward.There's an exhaustive wine list, but we just kept it to a couple rounds of Cobra (priced at a refreshing £5 per bottle). Very pleasant ambiance, not too stuffy. Stellar service.Absolutely worth a visit if you like Indian food and are willing to pay up a bit for a special experience.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "3HKtVkHgH9o5y33UUaz3uw": {
    "date": "8/22/2014",
    "text": "After hearing, for years, how great Tamarind is we finally had a chance to visit for dinner this past week. I'm sorry to write that this place is very overrated. Ambiance: Tamarind is a beautiful place. Clean, well-decorated, and located in Mayfair (where we usually stay). Note that this place isn't as formal as one would think, with people dressed in jeans and polo shirts. Service: Very lacking. While we were seated immediately (we had a reservation), we waited for a long time for someone to take our order. I finally had to flag someone down, which strikes me as very inappropriate for this type of restaurant.Food: Average all around. The seabass needed salt and was also too acidic. The bhindi was bland. The lamb biryani was so spicy my in-laws sent it back (and they never do that). The replacement biryani was just as spicy and thus didn't get eaten. The roti and daal seemed to be fine for my FIL (I didn't try either). My husband said the chicken was bland but at least the meat was good quality. The papadums and chutneys were fantastic!Prices: This restaurant is VERY expensive. Definitely not worth the inflated prices.Overall: I had a much better meal at Masala Zone on Monday of this week, at a fraction of the cost. The food was better there, the service was better there, and the ambiance was just as nice. I don't recommend Tamarind at all.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYv8xJeLdN0aQq8dZqIH4w"
  },
  "c32lLl7TdgaT2oT7wvenKQ": {
    "date": "1/26/2015",
    "text": "We were led downstairs to a spacious dining room and seated straight away.The place is very popular so i do recommend a reservation.They offer a pre theater menu with lots of tasty dishes £35 ph or an a la carte menu.We chose the Kabab selection and this was substantial and VERY tasty. A huge tiger prawn, chicken, monk fish and lamb chop. For our main we selected an array of dishes so we could sample  everything. They have a good cocktail selection and were more than happy to make a cocktail for me that was not on their list. The staff were very friendly and attentive.I will definetely be back and they do have a monthly competition where you can win a meal for 2 if you place your business card in the bowl.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MrEc_zBPvLaD6tOTHlZVuQ",
        "caption": "Photo of Tamarind - London, United Kingdom. Gajjar halwa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MrEc_zBPvLaD6tOTHlZVuQ/o.jpg"
      },
      {
        "img_id": "nUS_KqIKaqEUF4nXQ96LWg",
        "caption": "Photo of Tamarind - London, United Kingdom. Dessert sampler",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nUS_KqIKaqEUF4nXQ96LWg/o.jpg"
      },
      {
        "img_id": "iE-v_cMBsTGylw3OlasTjQ",
        "caption": "Photo of Tamarind - London, United Kingdom. Dal tadka",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iE-v_cMBsTGylw3OlasTjQ/o.jpg"
      }
    ],
    "user_id": "vuNn6yPCp32iOWpJdoMVOQ"
  },
  "_w8C4k7cSXD2N6k_-DYQWA": {
    "date": "12/16/2015",
    "text": "Great high end Indian. It's one of those places that just takes the usual up a few notches. I wouldn't say this was a life changing meal but everything was cooked well.The most memorable dish was the lamb shank, tender, good. The sea bass was very well cooked but definitely the least memorable in terms of something uniqueAll in all a great meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qw0BcQV2xH-pKFYwoju4Kg"
  },
  "HJ1WfI7P0aD3ZBQMsBjMLg": {
    "date": "12/6/2015",
    "text": "It was my first visit to a Michelin Starred restaurant in London, and Tamarind did not disappoint.  It's in Mayfair, so of course expect a lot of suits and serious conversations, and make sure you book ahead on a weekday.  They have a very reasonably priced 30£ lunch menu which comes with a starter, a main, and dessert.  That's apart from the papadum that you're served before an amuse from the chef - in this case we got a warm winter soup in an espresso demi-tasse.  The main is served with rice and naan and lentils so dessert will be a \"stretch\" in more ways than one, but eat slowly, savor the food and atmosphere, and enjoy your conversation.  You'll want to return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVUIi0q38pAvsfuEEppe0Q"
  },
  "4uFRJaf5Dd5xvCcZP-n5EQ": {
    "date": "7/20/2014",
    "text": "This is how Indian food should be. I only wish we had someplace like this in New York, as flying to London makes a expensive meal even more expensive.Perfectly flavored, and the right heat level combined with impeccable service and a truly upscale restaurant, made for a very memorable meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSHQGf6xQrkJYCJgOXfjUw"
  },
  "KNiMmWd2NUSibeBbpgylKg": {
    "date": "9/22/2016",
    "text": "Great food, excellent service, nice ambiance, not stuffy for a pricey Indian meal. I gave it a five star because good experience is what I've expected. The waiter asked us if one of us was left handed so he can properly position our wine glasses!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FxJ4XbGe1JaqVHjjF8i9OQ"
  },
  "Svc89f5o312TcV5C5NBfnA": {
    "date": "10/26/2015",
    "text": "You don't get awarded a Michelin star for making average food. U don't retain it unless you can manta in the highest standards. I have been to many Michelin star restaurants and tamarind is no disappointment. This is not home style cooking that your mama makes. The level of cooking skill and complexity is very high and takes years at the highest level to develop. The food is simply amazing. No wonder the sultan of Brunei often comes here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "D_7QIscA8oP5jo6g1OGTxA"
  },
  "O-5zOt0Z3fvfJeCp2KB0Cg": {
    "date": "2/7/2016",
    "text": "Outstanding food.  Traditional dishes and some with more modern interpretations.  In a city with great Indian cuisine, Tamarind is one of the standouts.  Consistently good service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jht8X9w__fe10IwtYTyPSw"
  },
  "iXd1W_Y2Hi0cxWua9_z-NA": {
    "date": "4/11/2016",
    "text": "Fantastic Indian food. A must for Indian food fans. The location is in the basement of this building but that won't matter the service is fantastic and the food is so good you will forget all about the location. I read about this place 3 years a go in the NY Times I'm glad I remember about it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rnN8npwfS_Nfl3J24o7WKA"
  },
  "Cq8uugqbggkH23cahSb79g": {
    "date": "6/7/2012",
    "text": "My first introduction to Indian food was on a business trip here in 2002, when Tamarind was near the peak of its popularity and tables were hard to find. My Indian colleague had been there before and was very enthusiastic about what he felt was honest-to-goodness, traditional Indian food of the highest quality. Indeed, I was blown away by the heartiness and full flavors of the otherwise deceivingly small dishes, and I've been a fan of Indian food ever since.Fast forward to a more recent visit. While it's clear that Tamarind's aura has faded somewhat and tables are now much easier to find, you'd be hard-pressed to find a higher quality Indian experience, as long as you're willing to pay up for the location and the Michelin star. The portions are as small as ever, but still very filling without being overpoweringly heavy. The food, including the rogan josh (lamb) and malai tikka (chicken kebob) remains wholesome, fresh, and flavorful.It's a small, intimate, subterranean space in the heart of Mayfair and there's a windowed view into the kitchen. It remains a dependable place for a business dinner or a nice night out.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bQCHF5rn5lMI9c5kEwCaNA"
  },
  "IZ5C6mMFoqA5ZyZEb2X9Fw": {
    "date": "4/18/2016",
    "text": "Outstanding Indian Restaurant in Mayfair!  A little hard to find. Very upscale but worth every penny!  Again, like in my other review, the lobster was the best here. We ate Easter dinner here in 2015 and what a memorable dinner! Reservations are essential.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVb8ZaxQKzcEsbTHiF3IPw"
  },
  "JUV96qdNdzw-xSxe4KsKSg": {
    "date": "9/17/2018",
    "text": "Our first dinner out in London and it really was amazing. This restaurant knows how to spice their food. I love Indian food because it is both flavorful and often packed with heat. Tamarind checks both boxes. The ambiance is lovely here. Definitely a place to come for a romantic dinner or a dinner to catch up with an old friend. I hope to come back here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cswZPTfrQeh9-Q8V2VevVw"
  },
  "5U0brNPIxBMPBCEEbnjUwQ": {
    "date": "5/17/2018",
    "text": "We called and made a reservation ahead of time and arrived there with ten minutes to spare.  We looked and looked and looked for the restaurant but could not find it.We checked and double checked the address online and were totally confused as to why it wasn't there.  After walking up and down the road for 10 minutes, we finally gave up and took a taxi back to the hotel.When we got back I phoned them, she said \"Oh, well, that location is closed for renovation, shall I look up which restaurant you were actually booked to?\"  WTF?  I told her it was too late, we'd gone to the location that was stated online and now it was too late.  I have never heard of a restaurant taking a booking, and not telling you that the actual location you booked into doesn't exist anymore.RIDICULOUS!So, guys, IF you decide to phone, make sure you ask them their ACTUAL location, because otherwise you'll end up starving and angry.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ij00q8CkcC_MOuHBI44J6g"
  },
  "w5vde4lBJ2P8Kv_XYxuhwQ": {
    "date": "4/18/2018",
    "text": "I have a hard time seeing why many of the reviewers deducted a star after reading their reviews. This was my first Michelin starred restaurant that I'm aware of, and it did not disappoint. I've eaten at some of the top restaurants in Beijing, Lima, NYC, LA, San Francisco, Berlin, Moscow, and St. Petersburg, and this one was just as good if not better. The service was impeccable, and we interacted with the hostess, bartender, waiter, and manager. The food was sublime.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hA1SvaUYQnfgU5IhNGVh8A",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hA1SvaUYQnfgU5IhNGVh8A/o.jpg"
      },
      {
        "img_id": "o1mmbXasTpGHMIBIRWtyvw",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o1mmbXasTpGHMIBIRWtyvw/o.jpg"
      },
      {
        "img_id": "frTIGUzpFX7Tnfwdo3ZUFw",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/frTIGUzpFX7Tnfwdo3ZUFw/o.jpg"
      }
    ],
    "user_id": "SF7cQfmHuQWqINKruCe-kA"
  },
  "NbNU2xfjsr4ye7ZKyfeFZw": {
    "date": "3/25/2018",
    "text": "I loved this Michelin star restaurant.  The food was awesome and the service was great as well.  I tried their dinner and lunch prix fixe.  I think the lunch prix fixe was the best bang for your buck.Dinner:- Tamarind salad: of course we had to order their name-sake salad.  It was a good mixture of fruits and veggies.  Fresh clean taste to start the dinner.- Adraki Tikka: The chicken was so tender and flavorful.  All the flavors and spices blended nicely for an amazing dish.- Lobster Masala: amazing.  The lobster was so juicy and cooked at the perfect consistency.  I just can't get enough of the sauce. I cleaned the dish clean.  The flavors still linger in my thoughts after a couple of eating there.  - Even their white rice with seasoning was tasty.  Lunch:Best bang for your buck in London I think. You can get a 2 course meal for £22 and then the wine pairing is only £10 more.  That's an awesome deal.  Plus you get rice, daal and veggies with the meal.  So much amazing food with great service.  You still get the chocolates you normally would get for dinner during lunchtime too.  There is a dress code (I got away with smart casual) for dinner, but their pretty casual (many were wearing sneakers) for London standards during lunchtime.  We did make a reservation for dinner, however, we just walked in for lunch.  Tamarind will be my go to place every time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "JCapJcvST-rREaLEvNRMcQ"
  },
  "3uaVI64RzUrMaIUdg0GSHg": {
    "date": "4/18/2018",
    "text": "One of the first Indian restaurants in the world to receive a Michelin star, Tamarind did not disappoint. Their weekday lunch menu is way more affordable, but we actually came for dinner and ordered a la carte. The lobster masala here is not to be missed! I also really enjoyed the stuffed naan with date, coconut, and poppy seed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "65smoBoOcgNIQwoS6zuW-w",
        "caption": "Photo of Tamarind - London, United Kingdom. Peshawari Champen (39.75) - lamb chops marinated with raw papaya, fennel and yoghurt",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/65smoBoOcgNIQwoS6zuW-w/o.jpg"
      },
      {
        "img_id": "KcHoLukdkmPhglsp_whWmQ",
        "caption": "Photo of Tamarind - London, United Kingdom. Kabab Selection (38.50) - tiger prawn, monkfish, chicken supreme and lamb chop",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KcHoLukdkmPhglsp_whWmQ/o.jpg"
      },
      {
        "img_id": "oucDnaEKcURNVIQIMSMjbg",
        "caption": "Photo of Tamarind - London, United Kingdom. Lobster Masala (39.75) - lobster tail with shallots, tomatoes and mixed peppercorns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oucDnaEKcURNVIQIMSMjbg/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "TY0ErLq7LsIxaPb7WgpVHA": {
    "date": "6/5/2017",
    "text": "I enjoyed Tamarind very much. It was my first time dining at an Indian restaurant so I didn't know what to expect. My co-worker loves Indian food and was given Tamarind as a recommendation. It is a Michelin starred restaurant and is worthy of the rating.To get started I ordered the passion fruit martini and my co-worker ordered the rose petal martini. OMG delicious drinks! After taking a sip of the rose petal martini I knew that had to be my second drink. Both were expertly crafted. As for our meal we enjoyed: *Pudhina chops which featured lamb cutlets with dried mint, tomato & coriander chutney. Absolutely delicious with no one flavor too overpowering.*Tandoori grilled jumbo prawn with a mint sauce. Another excellent choice.*Chicken Tikka Masala. A staple dish in Indian cuisine featuring perfectly flavored chicken cooked with tomato, onion, and ginger with dried fenugreek leaves. My co-worker said this was the best chicken Tikka she ever had. I didn't have anything to compare it to but I couldn't imagine it tasting any better.We also enjoyed a side of roasted eggplant and seasoned rice. The rice was light and delicious. Not sure what flavors were in it but it complimented everything we ate. The roasted eggplant was not too soggy which can often times happen.  As for dessert we shared the Gulab Jamun which was cardamom flavored milk dumplings and hazelnut chantillie. It almost tasted like a warm doughnut. Really hard to pinpoint the flavor or texture but it was excellent.Service was fast and efficient. Our server wasn't overly attentive or friendly but was in no way rude. We enjoyed a pleasant conversation with the Sommelier who was quick to bring us our cocktails and make sure we were happy with our drink choices. Tamarind was a wonderful experience and I would enthusiastically recommend dining here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GZ3nsGgFGCFgkFhRObJy9g",
        "caption": "Photo of Tamarind - London, United Kingdom. Passion fruit martini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GZ3nsGgFGCFgkFhRObJy9g/o.jpg"
      },
      {
        "img_id": "5Sz1RMQEx8CFGh8Ig-3nbg",
        "caption": "Photo of Tamarind - London, United Kingdom. Rose petal martini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5Sz1RMQEx8CFGh8Ig-3nbg/o.jpg"
      },
      {
        "img_id": "VjvOQnfN9Om86tyIO3PzsQ",
        "caption": "Photo of Tamarind - London, United Kingdom. Gulab Jamun for desert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VjvOQnfN9Om86tyIO3PzsQ/o.jpg"
      }
    ],
    "user_id": "ziiMYejVJAjbkRjSeAzrbQ"
  },
  "dhHUEaelwaEcZ1e-tznPSQ": {
    "date": "6/9/2017",
    "text": "Another great meal at Tamarind, super service and amazing Indian in the heart of Mayfair near Berkeley Square.Enjoyed the Murgh Chicken Tikka Masala, so delicious and creamy. The best Dal Makhni ever and some really well done Malabar Praun. Something so good about a well cooked praun in a delicious spicy sauce. Had both date and cheese naan - so good. Finally had a succulent Golub Jamun and a really great pistachio kulfi. Super attentive, great service and a great environment. Will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PCYNbbUik3BoraFdJw4zgg",
        "caption": "Photo of Tamarind - London, United Kingdom. Murg Tika Massala, Dal Makhni and Malabar Praun",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PCYNbbUik3BoraFdJw4zgg/o.jpg"
      },
      {
        "img_id": "R_7oik7WxTyyp-rgYq394A",
        "caption": "Photo of Tamarind - London, United Kingdom. Broccoli cake (Hara Gobi) starter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R_7oik7WxTyyp-rgYq394A/o.jpg"
      },
      {
        "img_id": "q-so65FWGjQcBojVF5Rb_Q",
        "caption": "Photo of Tamarind - London, United Kingdom. Delicious pistachio kulfi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q-so65FWGjQcBojVF5Rb_Q/o.jpg"
      }
    ],
    "user_id": "e53DYFCNH8uH5S0YEb9wzQ"
  },
  "DeAdrLpJv5f3CQfyKYxuBA": {
    "date": "2/5/2018",
    "text": "Tamarind - Oh my what good food!  Any thing from the tandoor is amazing the jumbo shrimp \"wow\" mouthwatering!!!  The atmosphere is elegant and the service is impeccable.  If you are searching for high quality Indian food that is delish then this is a place you must try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bFEEyxqxXgAFEonGbiawkA"
  },
  "9u_wWJ11y0QEGNr6L-5MkA": {
    "date": "6/25/2018",
    "text": "Food was incredible and cocktails were tasty and beautiful. The atmosphere inside is gorgeous and staff is very friendly. I recommend the potatoes, lentils, naan and mango cocktail.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vmk6nG84N4FbxCEmWf8BgQ",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vmk6nG84N4FbxCEmWf8BgQ/o.jpg"
      }
    ],
    "user_id": "ZW3BK8Qsecjm3tRHEHOL3w"
  },
  "2HdJTYH32Jm9ddKReHvfYQ": {
    "date": "11/4/2017",
    "text": "Summary: deserves the Michelin star for food and service, but the atmosphere feels dated and somewhat stale.  We had the lunch prix fixe, which was a great deal.  The game tikka and prawns were both tender and the sauces extremely well balanced.  Great service.  Just noticed little things like the stoneware being chipped/stained or lots of marks on the stairs/walls.  We went at lunch on a Friday and it was pretty dead.  All in all a fine experience but I wouldn't make a return visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_s-WaMfr86dU_q2XBlP2Hg",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_s-WaMfr86dU_q2XBlP2Hg/o.jpg"
      },
      {
        "img_id": "exr3MUXLVVIHAWvIXrOYWg",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/exr3MUXLVVIHAWvIXrOYWg/o.jpg"
      }
    ],
    "user_id": "f7N-kXxDki9H55q_MaWW9g"
  },
  "wg1GVAIakXbhqSTj9RuisQ": {
    "date": "1/20/2018",
    "text": "Food was, like always, awesome, but the service was not very attentive and difficult to get a hold of. In general, very good value for money, but don't expect a great service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsFX95QeHVEDX7gsX9Fi5w"
  },
  "AuF9uf-yBTtTv2ohNAnWtg": {
    "date": "12/12/2016",
    "text": "I've been to Tamarind a couple times, and without a doubt it's one of my favorite place to eat in London. While the set lunch with 3 courses and sides for £32 is an absolute steal, it's worth every penny to veer into the pricier a la carte menu. The tandoori grilled jumbo prawns are heavenly and perhaps one of the best things I've ever eaten. Even if you think you know Indian food, a visit to Tamarind will show you how Indian flavors can be elevated to a level you've never tasted before. While I was skeptical at first, Tamarind is very deserving of its Michelin star.Service is excellent, being both attentive and approachable. The dining room is very bright and airy despite being in a basement location. Wine service is excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gH40ouZQR9fonXwn-4ko-A"
  },
  "ydAuC6PDmajLB7AxMFWu1g": {
    "date": "3/4/2018",
    "text": "After a long day at work(yes we came on a business trip here) we decided to have some good quality but different kinda Indian food. This place has the best ambience and very good service. The food here is definitely topnotch with enough options to choose from for vegetarians. We ordered baigan curry, some paneer curry and avocado chutney( not guacamole but chutney). Food was delicious and the portions were just right. If you are looking for street side Indian food then this is NOT the place for you. I would recommend dishoom or tally joe for that matter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIzz-oQ2mrgEXxBg-xKOmw"
  },
  "xWcv_onQj5V0dO7FDwMv7w": {
    "date": "9/8/2016",
    "text": "We went to Tamarind while visiting London by a recommendation of a friend. My husband and i were celebrating our Anniversary and so we wanted somewhere special. Tamarind was a great choice. We both love Indian food so an Indian food restaurant was a must while in London!. The fact that is Michelin stared place was a big draw as well.The restaurant is located in the posh Mayfair district, and the restaurant itself is very elegant. The crowd is very elegant as well. The service was a little overwhelming as you have about 5 people waiting on you at all times, but it was a very nice dinner and the staff even remembered it was our Anniversary. Very nice touch!.The food, OMG, the food is amazing!. A medley of flavors, sauces and spices. Not for the faint of heart as Indian food is. Very authentic plates as well as some fusion ones.However all of it was delicious.The Maitre D suggested a very nice wine, we also tried some excellent cocktails suggested by out server and went with the Chef's Menu. Now in hindsight, this was way too much food, about 7 courses or so, but so delicious!. We tried a bit of everything: from lamb to masala to Tandori oven dishes. 5 star all the way!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPdwdEG4iyA19nJ5YjNbuw"
  },
  "z47XnQ72SMcuJjonOac8vg": {
    "date": "1/14/2017",
    "text": "The chicken tikka masala was cooked very carefully and expertly.  A well-balanced and tasty dish overall.What I enjoyed was the diversity of authentic Indian dishes prepared so well.  Bravo!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b3Ti_5Q0e2GRnERWm13nAw",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b3Ti_5Q0e2GRnERWm13nAw/o.jpg"
      },
      {
        "img_id": "qWOHPXyhFM9veqUZYiSJ7A",
        "caption": "Photo of Tamarind - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qWOHPXyhFM9veqUZYiSJ7A/o.jpg"
      }
    ],
    "user_id": "atqeCkHgE7-27Qg3eA3_-Q"
  },
  "zhI-_VZSNOpT2SKrB2iEUg": {
    "date": "12/13/2017",
    "text": "I took my partner here for his birthday and we really loved it. The service from the beginning was amazing. We were shown to our table and given our menu shortly after. The sommelier came by with the wine list. We asked for his help in recommending a good wine to go with our choice of food and were not disappointed. For the starters, we had the Gilafi Reshmi and Grilled Scallops which were very good. These were followed by the mains of the Murgh Tikka Masala and the Hyderabadi Shank with sides of pilau rice and dark lentils. Both meat dishes were soft and well seasoned to the taste. All in all it was a good experience. The restaurant wasn't too noisy but still had a lovely atmosphere under the customers chatter.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vMu-PHcIVX9Jh8BzyywBBQ"
  },
  "FlpGgaBYox69wWJXmAFEKw": {
    "date": "10/5/2017",
    "text": "Worth the Michelin star! I have been coming here every trip to London since 1995 never falls to disappoint! I have referred countless people here and all loved it. Menu changes with season but is always rich and delicious the saag paneer is the best ive ever had. Whats nice is jeans are ok although the setting is very chic. While it is pricey it's well worth. They now have several locations but i prefer the Mayfair location.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6d04MO8Xd8FhyAGQrUX8qw"
  },
  "kHTGH0rVv6CD5CnQxhM7tg": {
    "date": "7/17/2017",
    "text": "I was very impressed with the food and service at Tamarind. Probably the best lamb I have ever had anywhere. The monkfish appetizer was equally sublime.  Our waiter Hasan was helpful in offering selections of food and very well paced in his service, allowing us time to  enjoy our courses.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ss4BhKvZ0Fbb359PKkNeg"
  },
  "dvnRdM6L89Ymvbjidqzkng": {
    "date": "6/24/2017",
    "text": "Awesome service and a great flavor for everything. the Chaat was presented so nicely and it tasted perfect. The prawn curry was cooked just right and the lamb was so render. And we had the raita and bread basket which were super also. Loved it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLpNLciQy8zW7KG1sM27Gg"
  },
  "3RDNybemvWnu7qLeacKfpA": {
    "date": "7/23/2017",
    "text": "We had a wonderful dinner here with the kids. The lassi is some the best I have had. Good service and choices. The hostess was helpful.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGYLEaPh14A9_riuZ4JT7A"
  },
  "KCAEzuk6uW0dQd5LGWRvWw": {
    "date": "11/20/2008",
    "text": "I ate here in the same week as Uma Thurman visited apparently! A very swanky restaurant, michelin starred, so not a place for a Friday night curry with the lads! The food is delicious, the decor is luxurious and service is impeccable. Yes, it is very expensive but in my opinion the food quality reflects the prices. The desserts should not be missed, I had never really had much in the way of Indian desserts before, but these were stunning.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "P0VhxKYJkL4zCQTZhqulaQ": {
    "date": "11/26/2008",
    "text": "I had a very nice meal here around a year ago, so looked forward to my return last month. What I found was a place that seems to be living off its reputation, as the food was average at best. There was no outstanding dish and the main courses were served luke-warm. The calamari in the seafood masala was overcooked. Having eaten in many michelin starred restaurants, I would suggest that this establishment no longer deserves this honour.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8QGL-vmmaySGebhZC4P9ng": {
    "date": "7/13/2008",
    "text": "Tamarind has always been on my circuit of restaurants to take family, business colleagues and friends. The decor is oppulent-asian (with lots of gold, brass, strong materials etc), and nestled underground you feel miles away from the city above. Service is impeccable (the drinks trolley being a nice touch) and the food is, as you would expect, superb, and really celebrates (in my opinion) the diversity and elegance of proper indian cooking.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}