{
  "m6XIASvqXGGir-EHqXLrjA": {
    "date": "3/8/2016",
    "text": "Great service and a very friendly staff!  We would recommend it for single travelers, couples or families.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGEdRFNfm3hAVqW8X5LWpQ"
  },
  "XOp4Vr-HkkF18bIDdHN2EQ": {
    "date": "10/4/2009",
    "text": "I read positive reviews on the TripAdvisor regarding Orsini, so while we were in London, and since it was close to the hotel, we went there for dinner one night.We made a reservation, and luckily we did since the restaurant was close to being full when we got there. We ordered a bottle of table wine from our friendly attendant, and then he showed us the specials.We had the starters: D had the linguini with mussels and I had the seafood pasta. For our entrees, we ordered the veal and the chicken.The pasta was cooked just right, and the seafood in the light tomato sauce was delicious. The veal was so tender and the chicken was so moist and tasty. The choice of the table wine was just right.For dessert we had the panna cota, which was OK. We ended our dinner with a nice coffee each. It was a lovely dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_LbK9H21Hm6nx7FzjeGpEg"
  },
  "SX-dJLcltPjIpjAaoWgNjQ": {
    "date": "2/7/2016",
    "text": "Not great, not particularly bad either. OK for a quick coffee before / after the museums.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dcfkaawiRdKnVXLzX62ZQ"
  },
  "HykliS30q9ZMvxGTawy1AA": {
    "date": "3/8/2014",
    "text": "My mom and I found this place nearby after a long, tiring day of walking and shopping. I was in crappy mood when we arrived, but it was the perfect relaxing meal. We split a salad (I forget which - I think it had verde in the name). It was simple, with lettuce and green veggies, and we got to top with our own oil and vinegar. I got the gnocchi, and it blew me away - perfect, fluffy pillows that sort of melted away like cheese. I wasn't up for drinks or dessert, although tiramisu was tempting... I definitely left feeling full and relaxed after a long day.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4tmvlmzmDGhdmAK5_TXHKA"
  },
  "geedui--bg-tv_oquPeTvA": {
    "date": "8/8/2014",
    "text": "Wonderful, quick meal after an evening at the v&a. Great food and friendly service to a solo American. Hubs went on to later devour my leftover carbonara in moments.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "piwY-jY8hSCaRVCw5x99tg"
  },
  "hhdMT9-7o2CS72mwaqRwnw": {
    "date": "3/25/2014",
    "text": "Just ate a delicious meal here this evening.  We arrived a little earlier than the typical dinner rush as we were starving since we hadn't eaten all day.  I ordered the chicken in a white wine sauce topped with buffalo mozzarella and very thinly sliced ham.  It also came with perfectly prepared green beans.  I also shared a special Tiramisu with my daughter that was scrumptious!  Not the typical dessert as it was prepared with strawberries, so unpredictable.  It was a perfect meal after a long day.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z91j3wXCkmiJ7t-ZUJn0Pw"
  },
  "ASmdTX0cOaEqIYcxrGmu8Q": {
    "date": "7/26/2015",
    "text": "My family came in for dinner with plans to eat before the Proms. We told the waitstaff that we had to leave by 1900- we came a 1730. That should be plenty of time for a drink, an appetizer and a main course. The wine arrived promptly, the bruschetta and eggplant appetizers arrive over 40 minutes later. They were tasty and well plated. The main courses- 2 seafood special and a veal had not arrived 80 minutes after we ordered. We still had a 15 minute walk to RAH so we left. They graciously did not charge us for the wine and appetizers but I have NEVER had such slow albeit polite service anywhere in the world. So, warning to future diners- beware and make sure that they understand any time limits. I was sad to leave as the ambiance was nice, the wine was good and it was comfortable. I am not going back tho. A sandwich at RAH sufficed for dinner.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DbtukzZDKFGdyVNmE8fkUg"
  },
  "_oZfMuDGFH7rdXA9tRDwhw": {
    "date": "8/23/2015",
    "text": "Afternoon snack of 3 starters - all excellent  staff was attentive and very helpful. Would certainly recommend and will return!  Would give them 4.5 if I could figure out how",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRin3LYlZHRIzlq-DPkS5Q"
  },
  "-n3x5D1RJZ5IEyPYQULOjA": {
    "date": "12/6/2008",
    "text": "Orsini is a friendly little Italian restaurant with a laid back and cosy atmosphere. I've only ever visited for lunch and we're usually surrounded by smart families, shoppers and museum goers as it's only a couple of minutes from exhibition road. I like the food here because they keep it plain and simple, emphasising good produce and fresh flavours. The pasta is particularly nice and they do a really good gnocchi in white wine sauce. There are also daily specials and today i tried the chickpea soup that was very wholesome although it did only come with one small bread roll that was a bit disappointing. The coffee is great and of course they serve the Italian staple beverages; big, glass bottles of chilled San Pellegrino and strong coffees. The creamy hot chocolates are fab too.It's best for a quick brunch before hitting the shops as there service can be very quick if you tell them politely that you're in a rush. Three of us went in today and ordered prosciutto and mozzarella panini's, that were made with lovely warm crispy baguettes. More importantly, we were done and dusted in half an hour, even though the restaurant was full.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "M0UxBX925hTegZOr5HXyvw",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M0UxBX925hTegZOr5HXyvw/o.jpg"
      }
    ],
    "user_id": "SazNhsqh0aCMKkn55MXjBQ"
  },
  "JoSiDjxGVET7iGMLnb52nQ": {
    "date": "9/17/2015",
    "text": "We had a wonderful dining experience here in July. The staff was very attentive and helpful, and the food was excellent. We particularly enjoyed the antipasti platter and homemade pasta dishes. Great location near the museums. Our children loved it, too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gW-iSCNC1oC_GXPUzt4ZlA"
  },
  "9KmVp9a4CZC5lKVvr6Nqjw": {
    "date": "7/1/2015",
    "text": "High quality food that reflects on the chef's passion to cook and the flavor of the food is absolutely incredibly good. My only complaint is that I wish the portion sizes were larger!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l03BBHLhMWzvU2b3_PJhWA"
  },
  "8DlOER_hz9g3t7ErddPeYw": {
    "date": "11/19/2012",
    "text": "Even though it's been a few years since I was in England, I still have dreams of this place. I was in London for 2 weeks in 2007, and my classmates and I became regulars here in those short 2 weeks. The pasta dishes are to die for, and everything is fresh and delicious. Authentic quality Italian food, and great friendly staff. The environment is cozy and quaint, and the staff work hard to please! I would definitely recommend to anyone looking for a great Italian food and a wonderful experience. It's practically across the street from the Victoria and Albert Museum, so stop by for a bite before or after going there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_IR-mkQ7iY3X2pBLy66wQ"
  },
  "thEFnCi7vV6_cNGwkjRCOg": {
    "date": "9/21/2010",
    "text": "While I can no longer remember what I ate here, I remember my friend and I loving each of our pasta dishes. Although disappointed by other restaurants, we left Orsini feeling our taste buds satisfied.The environment is warm and friendly, and I remember being joyed after 2 weeks away from home to hear the handsome waiter with an Californian accent =)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1bjOt3gHjOVEHR4GcWm2w"
  },
  "LSQIQYraVV0KMkCafxUoFg": {
    "date": "2/18/2013",
    "text": "I stopped here for a lunch break during a visit to the V&A. I ventured outside after seeing the crowds at the museum cafeteria and I was very glad I did. This is a nice, small, family Italian restaurant. The pasta was very fresh and flavourful. A lovely comfort meal with friendly service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Ky_AXxBe8gzwcya-n4bpA"
  },
  "K2DCYNzH5vWabTRH9JmjgQ": {
    "date": "7/10/2013",
    "text": "Great food and service. Service is attentive and friendly with the Italian waitstaff and owners. Took a little long to get checked out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0nm-gYagFHLZCqntnIpuig"
  },
  "onWG5PeycSBevQJYsoXASA": {
    "date": "11/28/2011",
    "text": "The staff were accommodating and were happy to adapt a breakfast dish on the menu to my requirements. The poached eggs were very good.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Sw00AyrxrsaqfX5bZ5NCHQ": {
    "date": "8/17/2009",
    "text": "wow! just couldn't believe this great italian ristorante-cafe had yet to be reviewed on qype - what have you guys been missing?!! possibly the most delicious home made desserts, all cooked by grandma on the premises and great coffee -and thats AFTER you've enjoyed some great pasta freshly cooked delicious & tasty or maybe a fresh risotto all typico italia and washed down with a cool italian beer - moretti or pironi or some refreshing ice cold mineral water. Orsini is a small family run venture, they are great people, honestly, sooo friendly and welcoming and in agreat location right opposite the V&A Museum. Call by for a coffee&cake,chit chat, enjoy!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cJAbjShcEI7aHRywYmv-CA": {
    "date": "8/1/2015",
    "text": "Summary based on one lunch:-convenient to V&A-decent food- better than average service-ok pricesRecommended in this area. We had immediate seating for three for a late lunch, but hard to tell how much was just luck",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0PGQWRDjFDhvnGkipBG_wQ"
  },
  "rePuiNDdNFiqVPCLqqVwug": {
    "date": "6/8/2016",
    "text": "The staff were all incredibly friendly and patient with my 2 year old little monster. The food was great. My wife had recently returned from Rome and thought it was as delicious as anything she ate on that trip.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "G1VfJemcpgyFrAKMVzFNeA"
  },
  "fSBf7vlwYWu6LMon3rV_YQ": {
    "date": "5/28/2017",
    "text": "This place was amazing. House wine was delicious,  only 9.75, awesome. We tried about 7 things on entire venue, all fabulous. Deserts amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGnOtjqxee8keMRpSadP5w"
  },
  "kjCXWOeWjWVDiy6Fs1btKA": {
    "date": "7/17/2015",
    "text": "We discovered this gem walking by and after reading yelp reviews decided to go in. The food was fantastic. It was simple, flavorful dishes with home made pasta. The service was relaxed yet attentive, it made an ordinary night special for us. Thank you Orsini. You're now one of our go-to places for Italian.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "twACz4OqKtEt-wI5U4qnAg",
        "caption": "Photo of Orsini - London, United Kingdom. Delicious fresh tricolore salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/twACz4OqKtEt-wI5U4qnAg/o.jpg"
      }
    ],
    "user_id": "c7iVzWtc6I8b9ELpIfSFgQ"
  },
  "3I3BtIhY4nwmuko-FjLAwg": {
    "date": "9/18/2016",
    "text": "Well...where do I begin.  Was very disappointed with this place.  The place was not very crowded, only about 4 tables were taken.   First I ordered a Peroni which I never received.  We were a group of 3.  I ordered a mista salad, which was ok.   We ordered the lasagna,  which was not good at all.  We also ordered a penne dish, this was good,  just a bit spicy but that's what we wanted.   My companions were finished with their food and my food had not arrived yet.  I waited at least 20 minutes after finishing my salad.   Since all the dishes were cleared and I still did not have my food,  I cancelled my order,  which I have never done before.  I was really looking forward to the pasta too.  I feel the service was not very good and I would not recommend going here.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C-L-0BEUCv-7cA6ZaIb1xw"
  },
  "TqcrWMNEFCuyOOBY2ZuoBw": {
    "date": "6/15/2016",
    "text": "Good food, good service. Proximity to Natural History and V&A Museums make this a great stop if you're in the neighborhood.  Clean bathroom.  Saw a chocolate cake in the kitchen that was calling my name, but was too full to order dessert :(",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bMQWDGhh2er9lyMcHmhWEQ"
  },
  "dIwmVLGRA27IKtMrekeo7g": {
    "date": "3/8/2016",
    "text": "I tried the house red wine, bruschetta with garlic, olive plate, homemade potato crisp, and the lasagne with homemade pasta. I don't have a single complaint. Fabio, our waiter, was very friendly and very helpful in deciding what to try. The atmosphere was casual and welcoming. The bruschetta and the lasagna were the best I've ever had. The olives were fantastic, moist yet not soggy. At the end of my meal I was talked into trying the espresso and it was some of the best I've had.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HpHk04Cr7yvcJZyTzBTFQg",
        "caption": "Photo of Orsini - London, United Kingdom. Homemade Potato Crisp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HpHk04Cr7yvcJZyTzBTFQg/o.jpg"
      },
      {
        "img_id": "i63HyejbmAX0L8kkYUXniQ",
        "caption": "Photo of Orsini - London, United Kingdom. Spinach Lasagne with Homemade Pasta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i63HyejbmAX0L8kkYUXniQ/o.jpg"
      }
    ],
    "user_id": "5ddMtYhrW1La4SNbSfI8MA"
  },
  "GE8jzDSKVotOgTuiLZUgDw": {
    "date": "6/21/2016",
    "text": "Fresh pasta. And be sure to try their homemade cakes.    It is a little pricey but worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KyRArLxd0soz2q0mm2Vxcg"
  },
  "afcd3VMV8U6R2ofi2en1bA": {
    "date": "6/9/2016",
    "text": "Incredible food and excellent friendly helpful staff. Stumbled upon this hidden gem that we noticed next to our hotel. No wonder it was busy all the time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXPgvjtDOjlWfqpuuNanTg"
  },
  "07-5FMzObs5IsYpUO1p4Mg": {
    "date": "7/23/2016",
    "text": "Absolutely loved this place! My family and I are staying in South Kensington for a month and have had very hit-or-miss meals. Coming from the LA area we are rather spoiled with great food;Orsini did not disappoint. My mother and aunt ordered two different types of chicken, one with mushrooms and one with ham and cheese on top. Both dishes had a side of delicious green beans. They were both incredibly pleased with the dish. My dad got the Gorgonzola gnocchi with pears and it was probably my favorite of the four. The sauce was soo rich and absolutely perfectly executed. The gnocchi was the best we've ever had, even after eating gnocchi in Italy. It was sincerely melt-in-your-mouth gnocchi. I got my staple penne al' arrabiatta and it was delicious. Perfectly cooked and the sauce was perfectly spicy and complex. We also had wine, the tricolore appetizer, tiramisu, and panna cotta. All was delicious. Oh, and the service was excellent! Our waitress was so accommodating and kind. She answered any and all questions with a smile on her face. We will definitely be frequenting this place while we are in town.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kO61i0OqK2njssHx9BcjQ"
  },
  "aIyfd1SzOAL3YoqdXPcQnA": {
    "date": "1/22/2017",
    "text": "Food was good. Had the squid ink pasta and bruschetta. All in all a better than average Italian restaurant with some more unique homemade pasta offerings. The wait staff were also very pleasant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GtGQAlNNxk_F-mwHdGrqg"
  },
  "hxT6VmNGRSFbKBgzLd5OBQ": {
    "date": "10/22/2016",
    "text": "very basic kitchen. the pasta of my wife was too dante (dry). the lasagna is o.k- not more.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJh3MBn5RnCDWdZSH2pXpA"
  },
  "T5RwpqpwbCVBAAVr70MDrg": {
    "date": "6/17/2015",
    "text": "We discovered with lovely little spot in 2010 and every time we are in London, we dine here. It's a favorite of my entire family. The kids especially. Very authentic. Great fresh pastas. Also for the quality of food and ambience, the price is affordable, considering London standards.  You can't go wrong!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rSz9RxV2R5-M_yo7bisbQ"
  },
  "Zhcm1sK32CdT5qu-qi6yMA": {
    "date": "4/11/2015",
    "text": "always wanted to eat here but never bothered for like 9 years of living nearby. its always jammed so wasn't sure if it was a tourist trap or a real place.pasta was excellent. fluffy gnocchi, total suprise how good it was.would go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "oL8co4QXiN7ZesPd0sP1Mg": {
    "date": "1/12/2015",
    "text": "Delicious meal, charming and friendly people...really everything we look for in a dining experience.  Gnocchi with Gorgonzola, pears, arugula was a fantastic combination. Best meal we've had in London!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLOAGmsL2lCTw3Xs8HLXvw"
  },
  "Re5JB-GESLf1wTQPF9PBow": {
    "date": "6/21/2016",
    "text": "We ate at Orsini on a Saturday and had a great time. The food was good and service exceptional. For that reason, we went back on a Tuesday. The service was still good due mainly to Fabio who was very attentive. However, the calamari was over cooked and had to be returned twice. We ended up ordering a different starter at the suggestion of our waiter. Overall, a disappointing meal for the price. It may have been a problem in the kitchen or just a bad night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRhGzQZAJjcC0N_mqYVz-g"
  },
  "9EKn5N-B0yJX8etUxzRyxw": {
    "date": "2/8/2010",
    "text": "This family run Italian restaurant is located right opposite the Victoria and Albert Museum making it a great stop for lunch.This place serves good pastas and delicious desserts. The portions are generous and good value for price.Service is attentive and friendly with the Italian waitstaff and owners.. IMO ~ Molto Bene!",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "umRKD4v8Kkp5BGsULuYEFw",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/umRKD4v8Kkp5BGsULuYEFw/o.jpg"
      }
    ],
    "user_id": "KETa97Knz4ZJZPv53CHGcg"
  },
  "eDHOVAnc3eiSHsfeERdMTQ": {
    "date": "3/30/2014",
    "text": "This was the best meal in our week stay in London.  The pasta was fresh, flavorful, and perfectly cooked.  Sauces were flavorful, but still allowed the flavor of the pasta to carry through.  Good wine selection, excellent appetizers, and lovely dessert.  Service was exceptional, and they were very kind and welcoming to our seven-year-old child.  An excellent restaurant well worth your time.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KhxqDWjONPbXaVdGX6FpWA"
  },
  "Vm0jTCE2-sCAL6TqmjB6hQ": {
    "date": "4/22/2014",
    "text": "good place to go when visiting the museum's, and whilst its raining outside. Friendly staff, good selection of Italian food, quiet authentic. Their table wine was nice, not a very expensive place to go.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSQ7StMICBXInKQe0bEU3Q"
  },
  "UnhIMBmaOtWcKhmglAe-GQ": {
    "date": "4/3/2015",
    "text": "Eaten here a few times over the last 2 yearsLast night was disappointing Waiter disappeared after initial orderMozzarella and pros was good, bread s bit stale Veal Milanese was not good. Over cooked and dryManager tok 5$ off but...They can do better",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAUUFq27e8NyIFoyduvvoQ"
  },
  "3tY0Rx9fjM89_Ik45FDJzw": {
    "date": "8/11/2018",
    "text": "A fantastic meal to kickstart our London experience.  Across from the Victoria and Albert Museum. We ordered around the menu and it was all delicious.   The bolognese was perfect Italian comfort food on a rainy night.  Ihad the squid ink pasta with clams, and it was excellent.   Garlicky sauce worthy of the home made pasta.  My youngest had the carbonara, but I have no idea if it was good, as he was not sharing.Exceptionally friendly staff, too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZs2QPiAPZIaerbiZPIk3A"
  },
  "V4MW50ia0kb0G36d-WgQOw": {
    "date": "6/23/2018",
    "text": "Excellent quality Italian food! Our family had home-made pastas, seafood soup, and salmon. All food was delicious! We came in at atypical hour (15:30) and there were no people in this otherwise busy spot. The service was impeccable!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lio3wt6rR_-E7hNb1Zk_NA",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lio3wt6rR_-E7hNb1Zk_NA/o.jpg"
      }
    ],
    "user_id": "w1PMjsVd-X7yUG2jg1hd4w"
  },
  "Aqn57pIVj44fkG39oNSnKw": {
    "date": "11/5/2017",
    "text": "Delicious Italian food.I'm usually not a fan of risotto because I don't like the mushiness of typically, poorly cooked risottos. But, Orsini does them right. If anything, the risotto was undercooked, which is perfect for me because I like my rice on the harder side. The seafood in the risotto was also very fresh and well mixed into the sauce.-- taste / 5aesthetics / 4vibe / 4service / 4price for quality / 3OVERALL / 4",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EV5M_5j4KFvZ8szeavmVsw",
        "caption": "Photo of Orsini - London, United Kingdom. risotto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EV5M_5j4KFvZ8szeavmVsw/o.jpg"
      }
    ],
    "user_id": "a7Rev5cakyRURz9F87f0aA"
  },
  "rlobblWQN6YkJOskuZugiA": {
    "date": "5/23/2018",
    "text": "Great service, great food and great wine.The wine was Grecco Di Tufo and the fritters were a mixture of rice, meat and peas. The sauce was amazingly good as it was a bit spicy and went perfect with the breading and the bread. It is conveniently located across the V&A museum though it is a bit small, it is comfortable and cozy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E_1w9uE28YJ_FhZRcQ5GeA",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E_1w9uE28YJ_FhZRcQ5GeA/o.jpg"
      },
      {
        "img_id": "dWUpvqA26pBDPNc4jA7pxw",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dWUpvqA26pBDPNc4jA7pxw/o.jpg"
      }
    ],
    "user_id": "ZcyOnXPE_IhtOR3EFioXVA"
  },
  "i7kZ_Kqm1um3oHUWdJ7oww": {
    "date": "10/9/2018",
    "text": "Small place right next to the Rembrandt Hotel. Good food. The service was so-so, but the seafood soup was delicious. Would recommend coming here for a quick meal, nothing fancy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTbA_5p8X8DUblIieLMFjA"
  },
  "s0dZSVjZY1iFP7bAGze_NQ": {
    "date": "5/28/2018",
    "text": "10/10 would go again! Already talking about the next time we can come to this restaurant. I recommend the gnocchi and bolognese! The service was great too - shoutout to our wonderful waiter.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v69BnzH1gYSb-SgJsQ4auQ"
  },
  "KAMDVu88sP5IM9aLhp2upQ": {
    "date": "7/17/2017",
    "text": "Amazing homemade pastas in a cute and modern space. Perfect for an afternoon cappuccino or evening outing after the museum.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vFeSxEHdSzpDXEUsIZxPkQ",
        "caption": "Photo of Orsini - London, United Kingdom. Homemade beef, pork, and veal bolognese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vFeSxEHdSzpDXEUsIZxPkQ/o.jpg"
      },
      {
        "img_id": "mjRtRgAFHuWcDh5whegtog",
        "caption": "Photo of Orsini - London, United Kingdom. Homemade squid ink pasta with prawns, mussels, squid, cherry tomatoes, and chilis",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mjRtRgAFHuWcDh5whegtog/o.jpg"
      }
    ],
    "user_id": "Yb8XWnIQzdGkNQF8a55HdQ"
  },
  "8d-z5faYdhmNYYN9pCZjiw": {
    "date": "5/19/2017",
    "text": "Fantastic Italian. Not the largest restaurant, but awesome fresh fish dishes and authentic Italian food. Highly recommend and especially good after a day at the Victoria and Albert",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7J-yeP1WHlLgUie3ojCfjw",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7J-yeP1WHlLgUie3ojCfjw/o.jpg"
      },
      {
        "img_id": "198HEXMdNwOMlCPg8GGUkA",
        "caption": "Photo of Orsini - London, United Kingdom. Fantastic Seafood soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/198HEXMdNwOMlCPg8GGUkA/o.jpg"
      }
    ],
    "user_id": "tLxohSdK76fQzxLK_q-UiQ"
  },
  "dcq-77DszlE40LBJB_5ImQ": {
    "date": "11/29/2015",
    "text": "*** coffee reviewSuper nice spot and friendly people working here, but their flat white to go was not good. It was probably the worst coffee I had my whole time in London, sadly. Maybe it was burnt? And the milk was not done properly for a flat white. Sounds like the food is good, though!",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "wZPizeBxMAyOSl0M0zuCjg"
  },
  "nPdGU7LY4P1heEHd1Be0LA": {
    "date": "8/15/2014",
    "text": "Was walking around after a full day of exploring and came across this little place. I looked it up on yelp and since they had decent reviews I decided to go in. I was greeted promptly by a very sweet Italian waiter. I got the menu and after a while of deciding what I wanted, I ordered a special seafood risotto and bruschette for starters. The bruschette comes with chopped tomato, an olive paste, and delicious roasted garlic. Each item complemented the other very well. Did I mention that the bread was delicious? Crispy, warm, and light.The seafood risotto came with prawns, calamari and the sauce was this creamy tomato sauce. It was topped with capers, which I felt wasn't needed but still AMAZING.All of this came to about £20, which I felt was much only because the food took a significantly long time to arrive. After I was done with my bruschette,  I literally felt like I waited a solid 30 minutes for the risotto to come out. Don't get me wrong, it was delicious but I did wait a while. The risotto was also piping hot, so I wasn't quite as peeved, since it seemed like it was made fresh. My other gripe was that the service was subpar. All the interactions I had with the staff consisted of them having to come to my table. For example, seating me, taking my order, giving me my order, and giving me my bill. No one came to ask if I wanted anything else to drink or to see if I was doing ok, even though the table next to me had plenty of that action. With that all being said, the food was still fabulous and I'll give them some slack cause that's what Jesus would do. Overall, is definitely come back if I was given the chance.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ypDwlvtEQABVU5T4-n0EQQ",
        "caption": "Photo of Orsini - London, United Kingdom. Seafood Risotto Special! Amazing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ypDwlvtEQABVU5T4-n0EQQ/o.jpg"
      },
      {
        "img_id": "X2rg32KQuA2LxVDMpaEg4Q",
        "caption": "Photo of Orsini - London, United Kingdom. The menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X2rg32KQuA2LxVDMpaEg4Q/o.jpg"
      },
      {
        "img_id": "xkhePSxVh1s7Rqz_fSy7oA",
        "caption": "Photo of Orsini - London, United Kingdom. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xkhePSxVh1s7Rqz_fSy7oA/o.jpg"
      }
    ],
    "user_id": "OSVP5gnarZ4Vke9HhvRCrA"
  },
  "NFz9lBf0OKK9RYbiI0VgJA": {
    "date": "11/13/2016",
    "text": "Very nice, small casual dining..staff very friendly food quite good!Great spot for lunch or as in our case a late dinner...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMhw8byQ43eGP-9WHWds9Q"
  },
  "iCu7u5jHHAXc-vQwtUx2SQ": {
    "date": "1/29/2017",
    "text": "We were seated quickly mid-afternoon on a Sunday. The service was polite and efficient. Pretty little restaurant. I got the homemade tagliatelle with zucchini and shrimp, while my spouse got the gnocchi with ricotta, gorgonzola, and pear plus a fresh pea and mint soup. All items were delicious! The soup especially tasted very fresh. the gnocchi was rich.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hKAelF9K5XSL9bjQO7PpIw"
  },
  "8nQzy2eAy1v1mqA8HJWOWg": {
    "date": "5/29/2017",
    "text": "Superb Italian food and attentive and courteous service. Outstanding fresh homemade tagliatelle with Bolognese and delicious lasagna. This place is the real thing... authentic from the food, ambience and service.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hveVzecVwLi2SHc93WeAMg"
  },
  "N4TjWfYl47LSE5p9kGFIEw": {
    "date": "11/3/2016",
    "text": "I was visiting London for a few days as a birthday present from my mother and since we were staying at the hotel two doors down from this restaurant, we decided to give it a try. We are so glad we did! Everything was perfect! The bruschetta came with olive spread, fresh tomatoes and a whole head of roasted garlic that spread like butter. the lasagna was the perfect size and actually was made with bechamel, like it should be! the lemon sponge cake was made that day and it shows as the cake was soft and cream was perfectly light and sweet. This was awesome from beginning to end and has easily taken place as one of my top 3 italian meals of all time! If you come to London, you've got this place a try!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "awfa5pKsPR-BeEkNX4WEzw",
        "caption": "Photo of Orsini - London, United Kingdom. Lemon sponge cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/awfa5pKsPR-BeEkNX4WEzw/o.jpg"
      },
      {
        "img_id": "-81biTExGypSPd8sKisrTQ",
        "caption": "Photo of Orsini - London, United Kingdom. Lasagna made with bechamel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-81biTExGypSPd8sKisrTQ/o.jpg"
      },
      {
        "img_id": "OyFFS48P_EoDL2u4t7flQg",
        "caption": "Photo of Orsini - London, United Kingdom. Bruschetta with roasted garlic, fresh tomatoes and olive spread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OyFFS48P_EoDL2u4t7flQg/o.jpg"
      }
    ],
    "user_id": "1qTQNplP-VP8IQrhF8ab3g"
  },
  "rAwLHuU3SeJB_uiue2k5pw": {
    "date": "1/9/2017",
    "text": "Delicious Italian food, very good Valpolicella and friendly service at Christmas time. I'll be back here, absolutely.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0WpqJiigzAtFpimQb0NFug"
  },
  "T5golfWVSQM-dvzBCF8aRw": {
    "date": "5/19/2016",
    "text": "Very good! Nice ambiance and staff was super friendly. Nice for intimate evening or with group of friends. Price point is not over the top and good value for the money.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y8tNtVH58COhuQnCDkHyeQ",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y8tNtVH58COhuQnCDkHyeQ/o.jpg"
      },
      {
        "img_id": "BO7Ae2NTRlLvld7cTj5zDg",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BO7Ae2NTRlLvld7cTj5zDg/o.jpg"
      },
      {
        "img_id": "6cDfbQcXrFPAYq1ewXd_Ew",
        "caption": "Photo of Orsini - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6cDfbQcXrFPAYq1ewXd_Ew/o.jpg"
      }
    ],
    "user_id": "dupkbFxLZkSI40GnGICqPQ"
  },
  "uywJOlTLn6cCzXdhYukAXw": {
    "date": "10/9/2016",
    "text": "I had one of the best cheese cakes I have ever tasted in my life at this restaurantVery friendly staff.Cakes are made by themselves and I will go to taste other cakes soon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLBg2EYOKVbSUwabCnHfMQ"
  },
  "KRZpSwzhBQ13CZzpfo5GRA": {
    "date": "9/11/2014",
    "text": "We arrived in London this afternoon and are staying at the Rembrandt Hotel a couple of doors away.  After a much needed nap Alan went downstairs to consult the concierge about places for dinner.  He recommended Orsini and this is where we ate tonight.  As we reached the front door we saw the familiar red \"People Love Us On Yelp!\" sticker on the glass.  The restaurant is on three levels, w/ the kitchen and bathrooms downstairs and another dining room upstairs.  The servers run up and down stairs and are very fit.  An Italian radio station plays overhead and the staff seems to be all young Italians.  Pieces of original art hang on the wall, a couple of large paintings and several folded black and white photos of celebrities like Sophia Loren, Andy Warhol, Marilyn Monroe and Alfred Hitchcock.  In the back is a bar w/ coffees, teas and pastries.We walked in and were seated immediately at a two top in front of the door.  There was a list of specials, a wine and cocktail list and the regular menu.  Our waitress was a charming young woman w/ Italian inflected English named Flavia.  She was very helpful in talking to the chef about low sodium options.  He ruled out the usual suspects, tomato sauces, Parmesan, salumi, but said anything else could be made w/ low sodium.We ordered bread to start and salads, a mista for me and a verde for Alan.  Both were generous portions w/ a mixture of lettuces, onions, shredded carrots and green beans in mine and cruets of oil and vinegar to mix for dressing.  I shared some of the onions and carrots.  The breads were a good assortment of rolls and foccacia accompanied by a tiny container of olive oil and balsamic.  There were too many to finish.  For mains Alan ordered a melange of seafood cooked w/ cherry tomatoes and seasonings.  It looked like cioppino and was a huge portion of clams, mussels and prawns in a broth w/ a couple of croutons.  I ordered a mushroom risotto.  It was served on a rectangular platter rather than a bowl, probably a more authentic presentation.  It too was a generous portion and was delicious.  We both drank water and enjoyed our meals very much.",
    "rating": 4.0,
    "rated": {
      "useful": 10,
      "funny": 6,
      "cool": 11
    },
    "photos": [],
    "user_id": "UXbCcmkYGl3DH_Py5UOtbQ"
  },
  "KfPJbmtLC-gRs1krfIpMhw": {
    "date": "12/6/2014",
    "text": "Went here for a quick lunch with a friend who was passing through London, and it turned out to be a great choice. I ordered the king prawn risotto, and it was flavourful in healthy portions. My friend ordered a salad, and she enjoyed it as well. The cappuccinos were disappointing, however. I felt like it was plain black coffee with fake foams on top -- it could have been better executed. Service was good, and ambience was relatively cozy as well. A great place for a quick, solid lunch after a stroll around the museums!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "er-j48v7jbgEGnf9cH4Cjw": {
    "date": "10/4/2016",
    "text": "Very good I Italian food my wife had the risotto and I had a penne pasta. Both were very good the price was reasonable. The service was very good and they had nice desserts. All in all it is a nice restaurant that I wouldn't mind going back to.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuOh6dTrdi6KlPyeBBYO-A"
  }
}