{
  "3o32PGfrVEeKdy1UTbPS3Q": {
    "date": "2/7/2015",
    "text": "Well,  the staff is extremely rude. The waitor took 20 minutes to get me my drink which was water, and she gave me soda. I waited an hour and a half for my food which they gave me the wrong one. And when I complained I get called the n word.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "770Y5ZbjKlywbOsTn0i8CA"
  },
  "e0UhZit1-BhWiV3RdmmJ0w": {
    "date": "7/4/2011",
    "text": "Great restaurant. The staff are attentive, polite and extremely well informed about the food and wine, which are also wonderful. The restaurant itself is attractive, dark wood and there is a bar downstairs. Convenient if you are with a large group.The food is simple, rustic and delicious. Price wise, extremely good value for money.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "o59v43hdhyDdfAulzBilSA": {
    "date": "1/6/2011",
    "text": "Goodness this place is phenomenal!Our party of 3 had a dinner of:- Cockles, leeks, and bacon- Duck confit salad- Sardines- Roast Middlewhite with a chestnut stuffing and red cabbage- Whole grilled mackerel with beets in a horseradish cream sauce- Partridge, snails, and garlic casserole- \"Greens\"- Bottle of Rioja (Grand Reserve)- White chocolate mousse- Chocolate malt ice cream- Pistachio brittle ice creamEverything was delicious, and I mean, everything. Standouts for me were: the broth that the cockles came in was delicious; the sardines were perfectly balanced with the citrus (grapefruit and orange slices); the Middlewhite had so much flavour; the mackerel was cooked to perfection; and the pistachio brittle was amazing. Service was a bit spotty but still attentive and I love the ambiance. As my coworker said after our meal, I was \"blissed out on good food\". I honestly will be talking about this meal at least for months and can't wait to return when I'm back in town next time.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jrAyaDfuVIKKzUE4ro6ZQ"
  },
  "gSwqfzGOKa5I7tMEWezqlA": {
    "date": "10/16/2013",
    "text": "After browsing the reviews on Yelp we decided to give Great  Queen Street a try. Since we didn't have a reservation we showed up right at 6 PM and we were kindly given a table until 8:15 PM. We were not disappointed. We ordered the duck crown for two which was to die for. The duck was done to perfection. We would definitely recommend this restaurant for its simplicity, sophistication and seasonal ingredients.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mxcxriim32-jT-J3ykQuYA"
  },
  "3g6BoJv1zti-jKSaqgLWtQ": {
    "date": "8/15/2009",
    "text": "Great. Loved it. Friend lives round the corner - it's his current local favourite. It was Saturday night - it was full, so we sat at the bar. Staff were amazingly friendly & helpful. Two of them advised on wine - we got a couple of samples before we bought. Ended up with a nice bottle of Rioja I had a nice samphire salad to start - friend had sardines, which were delicious. Then we shared a chicken pie. Holy smoke. Best chicken pie ever. Perfect pastry, magic sauce, outrageously tasty chicken.flickr.com/photos/rupert…  Too full for dessert. Sat and chatted and then wandered through the Saturday night West End madness for a while before heading home. Great evening.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "jh9TjM4X52KyltJBwrnppQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jh9TjM4X52KyltJBwrnppQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "La-M-FVajFflxLJrXXbkkA": {
    "date": "12/2/2011",
    "text": "My husband found Great Queen Street on Yelp when we first moved to London a few months ago.  Turned out it was just around the corner from our flat.  Lucky us!   It is now our go-to restaurant.  We've been three times so far and have been consistently wowed by the food, service, and ambiance.  The menu seems to change daily and with homemade gingerbeer and delicious dishes.  I wish we could eat here every night.  Lots of great British meat dishes--pork and cockles in a stew, duck several ways.  I am learning to just order the special and enjoy, or ask the knowledgeable waiter what he would order that night.  One of the waiters said he had been eating at GQS for seven years and finally joined the staff as a waiter 6 months ago.Hope to return soon!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0jIYAeaNYAyCxkfbuaP_w"
  },
  "DK_lIhNeGVzJSFx1bxhZ8Q": {
    "date": "9/27/2008",
    "text": "After walking around for the London Open House event, I settled in for a late lunch at the place that just won British Restaurant of the Year in the London Restaurant Awards. It's been on my list for a while, and because they typically take bookings, and I know that its sister gastropub, the Anchor and Hope is hopelessly busy I was fortunate it was fairly quiet for that time of day. From the outside, it looks like an ordinary restaurant or pub, with only a picture of a crown amidst a dinner setting instead of name distinguishing it from its neighbours. Dozens of tables inside huddle near the front of the restaurant, with only three or four alfresco tables outside. Even though they had plenty of tables to choose from, I decided to sit at the bar, if anything, just to get a better perspective of the entire place, and for an easy sideways glance into the kitchen, full of flames and a relentless stream of orders in and out. Service wise, this place impressed me because not only was it fast, efficient but it was also friendly. Whilst perusing the interesting, apparently ever changing menu, they immediately placed a board topped with hearty bread chunks, butter, salt and coarse pepper, in front of me as well as a jug of chilled tap water and a small glass. I love this about places where you don't even have to ask for it. Despite the great service, what really matters to me is the quality of the food and I cannot express how delicious my meal ended up. With lots of tempting daily specials and many dishes resembling those you'd see at St Johns, I eventually settled for the seven hour lamb shoulder, and based on a recommendation, a side of green to go with it. At the same time, as I contemplated a red wine to go with, the bartender graciously offered me a sampling of their wines including their Beaujolais wine, a lighter red wine whose full flavour peaks when it's chilled. Although I settled for something different, I thought it very nice of them to offer. Being a seven hour lamb shoulder, it unsurprisingly came out quickly since it didn't really need any other cooking. Even at £13, I thought the entire bowl was going to defeat my normally fearsome appetite, only to be satiated by the soft, melt in your mouth flesh accompanied by sweet carrots, and other vegetables in the dark gravy. The bright green cabbage brought a sharp and fresh contrast to the almost overpoweringly rich flavours of the lamb, and let's just say I walked out of there a very content person. Great for groups, couples and individuals, Great Queen Street offers something for everyone. If only I had room for dessert, I'm sure it would have been just as amazing as the main dish.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "sQcA95G3h8WdSWeJXYtwZA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sQcA95G3h8WdSWeJXYtwZA/o.jpg"
      },
      {
        "img_id": "CZXJmvSyYj3QQXErs3PGCQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CZXJmvSyYj3QQXErs3PGCQ/o.jpg"
      },
      {
        "img_id": "AQT3pD4x39u0Z0dWDIYQUQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AQT3pD4x39u0Z0dWDIYQUQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "TBRtFSrMvyedZSOgs_ZwUQ": {
    "date": "12/4/2010",
    "text": "While Great Queen Street may lack originality in name, I can assure you that argument can not be made about the food, atmosphere, and wait staff.  Seasonal food (aka Slow food) is their focus, menu appears to be constantly updated and always offering a type of \"feature beer\" of the day/week/etc.  My wife had the Fennel Pomegranate Salad and I went with Shepherds Pie.  We also ordered a side of non-descriptly titled \"Greens\".  We sampled on all three, which were amazingly robust and flavorful.  The Fennel was cooked perfectly, not too soft nor hard and the pomegranate burst through with flavor over the \"anise-like\" quality of the fennel.  The greens were actually brussel sprout tops in a butter bath/sauce.  Their coloring was so bright that you could have created a new color in your crayon box.  Flavor yet again was killer.  Shepherds pie was also right-on.  Couldn't have been happier with our three choices.  The restaurant is is dressed down, very informal feeling.  The staff do a great job focusing their attention on your service.Will consider a return to this spot if ever in a fix to make a decision on food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzyh6lJHomhhF8j6McJ3jw"
  },
  "4L9szjHQVHw7_mW36OMFdg": {
    "date": "9/9/2010",
    "text": "Funny how the penultimate day I am in London I find the best place for British food.  I know that I gave the Troubador in Ear's Court a high rating, but it wasn't full British per se.I went to the handy dandy Yelp to help me find a good place to eat that I hadn't been to yet.  Great Queen St. came up highly rated and with real English food.It's an unassuming place packed with people enjoying food.  We ended up at the bar so we didn't have to wait.  Their beer selection was limited but they had a nice local lager.  The menu was simple and had interesting points to it.  Everything seemed to fit the season also which was great to see.  I asked for the most British thing on the menu and the server said it had to be the faggot.  After chuckling, I order the faggot with a side of potatoes and my buddy got the quayle.The dish was delectable.  The faggot was flavorful and wasn't overpowered by the suace which I thought it would be after tasting the sauce.  The filling was an interesting combination of meats which came together perfectly.I ended up getting a dessert as it was my last night with a great meal and how could I not try a British dessert.  I got a chocolate pie.  WOW!!  it was very tasty but not too sweet and had other flavors in there besides chocolate.When I go back to London, I will come here for some more good British food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "30uf4qsB9RAqZFMiJG9-sw"
  },
  "bXg8yBKlIiIlwp29z2fD6g": {
    "date": "10/14/2014",
    "text": "This place had great food and great customer service! I was trying to find a place that could accommodate my dietary restrictions and they were very nice about it! I had the partridge, the split pea soup, the syllabub, the mackerel (not all on the same day!) all hearty but I didn't feel there was a dead weight in my stomach throughout the day. Great location, on a slightly less busy street, and attentive staff that always made sure that I was happy. I love the fact that both their lemonade and ginger beer were not sweet at all, and it was more like a digestif. Definitely good for an unsettled stomach!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2NikOl457UVewxYB5ZEeqg"
  },
  "pIyX64KgROGZDNhP5hTYXA": {
    "date": "4/9/2015",
    "text": "The menu changes all the time, and I was here a while ago so I can barely recall what I ate. Some sort of tangy squid dish, rabbit with chorizo and who knows what else. But I can tell you that it was all super delicious! Just go. Pick something at random. You're welcome.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjuKihGKevBn6tq_BVYr_Q"
  },
  "v3A-NYalv_mlX-UXls0OBg": {
    "date": "11/10/2009",
    "text": "I spent most of this afternoon burping up bunnie. Yep if there was any vegetarian left in me it has now completely dissolved in a peter rabbit pie with a suet pastry. I will admit not that I showed my meat eating inexperience by claiming that suet was potato based but hey, give the girl some slack.From the moment I walked into this place I felt happy. For started we were placed by the window with a perfect people watching position and secondly I later found out that this is the sister venue to The Hope and Anchor - the amazing pub that dazzled me with fish dishes that I have still yet to eat in! The menu here though is impressive, all of it seasonal and created daily. You are welcomed by positively the most intelligent servers I have ever met in London. They really know the food can explain everything on the menu and relish in that slightly without arrogance. Also with some freshly baked sour dough bread and butter...mmmm....butter!The food itself is wonderfully British and if you don't like traditional food, featuring a lot of meat then this place is not for you. But it's simple, perfectly prepared and a fantastic enjoyable meal.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "7I4Hoct1X3XITvKxwG16RA": {
    "date": "1/6/2010",
    "text": "I was toying between a 4 and a 5, but I'm going to be generous as I had a truly wonderful meal here a few weeks ago. Not for the vegetarians or for those who are somewhat wary to try game or traditional cuts of meats, but a must for those who want hearty fare - especially on a cold December evening!Went with OH and a couple of friends on their recommendation and it didn't disappoint. We started with a round of oysters - delish! I then had partridge - never had it before and it was lush (thought it might have been a little gamier though but will remember that for future reference) OH had ox casserole (not oxtail - just ox) one friend had belly pork, and the other decided upon smoked haddock. We ordered a couple of sides of potatoes and some greens. Was definitely worth ordering more potatoes - they were also very yummy!We were all pretty stuffed after the meal and so we savoured the remainder of our (very affordable and tasty) wine with a couple of cheese platters - thoroughly reccommend, truly scrumptious!One other nice touch about the menu was that several dishes were to share between 2 - in particular the sole and the pheasant pie (which i want to try next time if we are in season).Can't remember exactly  how much the bill came to - think it was around £130 or so, but that did include the wine which was probably around £30.Have since recommended it to loads of people and am looking forward to a return visit",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMOECNxIOi4677aH6ALHgw"
  },
  "q33QNcupu44osYA2qjFeoQ": {
    "date": "11/2/2009",
    "text": "Oooohhhh, nom nom nom nom.... rabbit pie.     Yes, really. Upon first bite I turned from a human Laura into cartoon Laura and instantly knew what Elmer Fudd was rambling on about for all those years: Wabbits weally are wather guuud! Especially when encased in perfect savory crust that involves suet. (Yup -- that's the fat that grows around the kidneys in cows and sheep, and it's guuuud too.)The menu was practically in another language with all of the eloquent foodie terms that end up meaning things like \"fat\" or \"innards,\" but with a server/chef/angel that took the time to delicately explain each dish in drool-worthy detail, it was like our own table translator.This is the little sister to Anchor and Hope, another top British foodie destination of which I will soon be visiting after this flawless experience. This is certainly British food at its best and I challenge anyone to question the competency of English cuisine after a meal at Great Queen Street.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "qZPE6h0TuDj3lf62qzKTMg": {
    "date": "6/13/2013",
    "text": "They offer the best national food in London. The products are always fresh and perfectly cooked. You have to book a table before you go there, because it is almost always overcrowded.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZvKpSMqgDzsh1dNPoW0x9w": {
    "date": "5/8/2013",
    "text": "I found this place on Qype while searching for a place to have dinner with my husband. We were seated almost immediately even though we showed up without a reservation. Really lovely decor and staff. The menu was interesting, slightly wacky, sometimes difficult to choose from. I would recommend it to all my friends.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q_otjYvP2TM1PTBYlaO-Cw": {
    "date": "7/14/2012",
    "text": "Have been back here many times.  On the latest visit I got to order something I've been eyeing up for some time - the 7 hour slow cooked lamb.  This easily feeds 5 and costs £64, comes with dauphinois potatoes and veg.  A minty pea starter recommended by the waiter was a great complement to the lamb which arrived shortly after.  Soooo good. Do not miss GQS!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMiEr8JQEVd6NuMfEnhQ3w"
  },
  "ugfHDXYHCtYztDt_uWxcLw": {
    "date": "1/11/2013",
    "text": "Best steaks in London!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8Q2hiI6NKCD0nuaF0oA6ZQ": {
    "date": "1/7/2009",
    "text": "A local haunt for me, this is also one of London's busiest gastropubs. The younger and more easily to get to sister of Southwark's Anchor & Hope, Great Queen Street serves quite tasty traditional pub food that is more posh and innovative than your average g-pub in town. The meats and particular cuts used here can be a bit wild (their game dishes are superb, however). The menu changes daily and is very seasonal so you know you're getting the best of British produce. My favorite dish I've had is the Arbroath Smokie (a delicate white fish they serve filleted open in a delicious cream sauce). The staff is very helpful with any questions you may have on some of the less common menu items or any of their wines, but trust their opinions! I have yet to be steered wrong by them and have been coming here for over a year now.Definitely make reservations before coming if you don't want to sit at the counter.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "ysr_2AX6ZZPEQxIFKmYZGw"
  },
  "vdFxJQixGW8gp2Yq5DCBVw": {
    "date": "7/19/2009",
    "text": "I was invited to meet at Great Queen Street by some \"Foodie\" friends of mine from the states who make sure to dine here every time they make it to London. And I could see why it would be a favorite for foodies. The fare was definitely a step above average Pub grub, with entrees such as pigs cheek and sardines. I do enjoy food, but I guess I am not that adventurous in my selections enough to be considered a foodie as I only ordered a beef burger on dripping toast. When it was delivered it looked delicious, and the taste and texture was average. Even though nothing on the plate looked \"dangerous\" I spent the rest of the day in and out of the bathroom. I don't want to speak poorly of this place seeing as how the wait staff was very friendly and my host's seemed to enjoy their meal, but personally I didn't think that Great Queen street was that great... queen.. street.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "rgm5GzQggdydRUCW5x9_1w": {
    "date": "1/14/2015",
    "text": "Wonderful meal with friends after a jaunt to the Bond in Motion exhibit at the London Film Museum.Classic yet innovative menu of shear yumminess. The steak and ale pie for 2 was epic, my kidneys with bacon/lentils were heaven, the pork chop was sublime. We didn't have the whole roast pork shoulder but it looked incredible.Solid bar menu also, good cocktails, good beer and wine.Great Service.Good idea to book ahead.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "htZb821ma_l2JGgkR4xzCA"
  },
  "IjC6PdLu_7adp2WxiVESrg": {
    "date": "6/10/2015",
    "text": "Nice. This Yank left pleased. First off, the friendly service. You made a solo, foreign diner feel welcome. Second off, the food. Nice, though I still can't fathom London prices. My salad was delicious. My cold Devon crab was nice too, but way too much work. And the mayonnaise seemed to be from a jar. Finally, the service. Superb. Thank you. Go.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "yva8Ty60sSgvOiC3ceOCWA"
  },
  "m23uwMyrVD1phLFeHufheQ": {
    "date": "5/28/2013",
    "text": "What a great gastropub! We made a last minute call for a dinner reservation and by how easily we got the booking,we were thinking...maybe they aren't busy Saturday night? Boy were we wrong. It was bustling around 9pm and we had to wait a bit for our table. Everyone working there was incredibly friendly and service was pretty fast.We went with a couple of their specials. An ox stew with gnocchi as our main and some asparagus and salami on the side. The stew was amazing. Rich and comforting with puffy gnocchi pillows in a tomato base. Yummlicious! We definitely will come back again to try some of their other items",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "Set-SijQafZBlOdpB_qYpQ": {
    "date": "10/3/2015",
    "text": "A true gem in London's Covent Garden area. Had the \"rare chicken pie\" for two which was mind-blowing amazing (and they ran out of by dessert so we were not alone). Also had the \"onion soup with stinking bishop\" appetizer which was an excellent British interpretation of a French staple.A couple of small service hiccups is all that kept this from five stars. If you are looking at this place, stop thinking about it and give it a go -- you won't be sorry!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I3XzC3kA0W2MTG_k9UWz1w"
  },
  "ZiFxdEv94OMCttI8tbHVwA": {
    "date": "4/23/2015",
    "text": "Awesome food and really helpful staff in a superb location... only downside is the price for beers... £6 per bottle is a little too steep, even for a good beer.Well worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gR8TdCzKqOW27tsHrQkj1w"
  },
  "FP19BaDYyYh9bvd9ntxGPQ": {
    "date": "8/15/2014",
    "text": "Service was with a wonderful smile. Menu somewhat arty farty and I don't eat fish so my choices limited but thats my issue not theirs.  Quality of food excellent and taste devine. For me its slightly overpriced and a 200ml Diet Coke was over £2.40... Thats NOT good, but plenty of tap water on offer by the staff.The bill just came with 12.5% service included which I asked to be removed. Less than 2 minutes later before I was able to pull out some coins and put my card away, the (?) manager approached and asked if the service was OK because I didn't pay it... Well I find that damn cheeky... Poor tourists who dont notice that added and dont know its optional by law! I have now down graded to 3 Stars because of this issue and the ordasity of being approached.  Again I tell you why I have been negative so you can draw your own opinion.  I WONT however be returning here... My money will spend anywhere!",
    "rating": 3.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uC45zBmr0Jdn2btJcOhZuA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uC45zBmr0Jdn2btJcOhZuA/o.jpg"
      },
      {
        "img_id": "Ylpua0CP0kgNd3EEExKxrg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Delicious! Lamb balls in tomato... Mmmmmm",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ylpua0CP0kgNd3EEExKxrg/o.jpg"
      }
    ],
    "user_id": "xwt5-M296Gd3gbLEX2LzTQ"
  },
  "0yk1qaJKO9uQv4WRyBIMYA": {
    "date": "5/16/2016",
    "text": "As a party of one, this place was solid but nothing amazing.  I came here because I saw pictures of amazing pies and other specialties but the interesting items available on the menu (like chicken pie and beef wellington) were for 2-3 people, so I was fairly disappointed.  I ordered the lemon sole with a butter sauce, and it was tasty, but nothing particularly special. The menu changes frequently so maybe I just didn't order the right thing, but I wasn't very impressed, and I wouldn't necessarily recommend it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FGPP7hzwQv5DO_g3aZZUFg"
  },
  "ZF7J1b-wCFQ9O9qD45ub3Q": {
    "date": "1/6/2015",
    "text": "My husband and I were visiting London from NYC.  What a great find thanks to Yelp.  We shared beets salad, smoked rainbow trout.  Which were both very good but I definitely adored the trout.  Entree we shared the steak & ale pie with a big piece of bone with marrow!!!  Not that I'm a pie expert but wow, crust was amazing, and the meat was so flavorful and not a bit over cooked.  We also had fresh veggie and hand cut chips.  So fresh!  Dessert was buttermilk pudding (like panna cotta) with prunes.  Service was impeccable.  I highly highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1k7dnouXbBjfNgNU0BcKQ"
  },
  "XaVjMLT7hC9x6Is9CqngMw": {
    "date": "2/24/2017",
    "text": "Absolutely loved this place. Wanted to try something different with my husband while we were in London. I got the pigs cheeks and my husband got the rabbit. They were both amazing!!! We had the apple tart for dessert which was also amazing. We sat at the bar because it was a little less noisy and had great service from both ladies at the bar. Couldn't have been more pleased. It is a bit loud in there though because it's so small, and I would also recommend a reservation. But over all, wonderful and different food at a reasonable price with great service. If I ever find myself back in London I would definitely visit this restaurant again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2NboV1IzI2kFA1sESYppVQ"
  },
  "KgcHNQxETREl7dWWyvrLZg": {
    "date": "1/14/2015",
    "text": "Quite nice.  They take old school \"British\" cuisine and give it a sleek update with some mediterranean flavor.  Casual and friendly atmosphere and, despite the neighborhood, not overpriced.  I think they could do a better job on the wine list --- given the many game-like options, more in the Burgundy style would be preferable.  I had- Grilled squid and hot peppers (guindillas).  A rather spartan dish, but cooked nicely and tasty.- Whole roasted partridge, celeriac mash, and greens.  The bird was beautifully prepared, with nice crispy skin and a medium/medium-rare interior.  Luckily I had recently had lots of practice carving fowl, so getting the meat off this little bird's bones wasn't too much of a struggle.- Quince and almond tart. A nice, crumbly tart.Others at the table had a foie gras terrine, the saddle of rabbit shared plate, grilled lamb hearts, and the whole plaice.  All looked quite good.  The other desserts that people had were okay--nothing stellar.  It's not the most inventive but everything seems to be executed with a high degree of precision.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JBHhhrf98CMGGXp6tZcPg"
  },
  "7NPwYD7G9POCsDtyN_vmFw": {
    "date": "4/4/2015",
    "text": "We came for lunch on a weekday after reading reviews online about this place. We weren't that hungry so we ordered the pork and duck terrine, small meat and cheese plate with quince paste, and the braised beef, ceps, oregano and polenta for entree. The pork and duck terrine was pretty good, but wasn't the best terrine we've had. The braised beef and the polenta was probably the best thing we ordered. It was tasty and well done. Service was good and our waitress answered any questions we had, but they weren't as attentive as I thought they would be. Based on other reviews, it seems like it might be better to go for dinner instead.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5VaAG4IAgavXRKGJT08GGg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. pork and duck terrine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5VaAG4IAgavXRKGJT08GGg/o.jpg"
      },
      {
        "img_id": "1BaNvrmlGK81RdwgL7EXvA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Braised beef, ceps, oregano and polenta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1BaNvrmlGK81RdwgL7EXvA/o.jpg"
      }
    ],
    "user_id": "9vf42_ov6kHNMXXJjqKOSQ"
  },
  "P-qjzr_VcuxJ1Z-uLTaflQ": {
    "date": "7/21/2016",
    "text": "Food was very good.  Service was fantastic.  Waiter know the wine list and and great recommenations.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgO1FsdtHspXpJxjS0aM6g"
  },
  "KGgOVWyosAop3uZTjVSjmg": {
    "date": "3/15/2017",
    "text": "My husband found Great Queen Street listed in the Lonely Planet guidebook while we were searching for a spot to have dinner on the final night of our week in London, and it ended up being one of my favorite meals of the trip. As we walked in we were warmly greeted and warned that there was only one Chicken Pot Pie (meant for 2 to share) left in the kitchen. Thank goodness we quickly claimed it! The pie was SO delicious, fresh and flavorful--the perfect meal for our final night in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bq8mnujQnqRy272WK7aptA"
  },
  "0pnqajrrkv6O62G4-66lQQ": {
    "date": "8/7/2015",
    "text": "Had the best rabbit pie of my life. Also the menu changes daily which gives a lot of variety. You never know what to expect when you dine at great queen street. The duck confit salad was by far the best salad and duck I ever had. The duck was tender and flavorful and combined with the salad just right.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A5f5JrUeAraRsyGNY3YLrw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. BEST duck confit salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A5f5JrUeAraRsyGNY3YLrw/o.jpg"
      }
    ],
    "user_id": "luegqDq5QEzxylXn7r70mw"
  },
  "gjWx0iOPmNqQPqXXwkdDyw": {
    "date": "5/14/2016",
    "text": "Overall Meh Minus. Food was OK.  The mushrooms on toast were nice and the fried cheese stuffed courgette flower was a bit grainy.  For mains, the kid of goat was under seasoned and gnarly. The chickpeas were hard. The quail was fine but the accompanying grilled onions were awesome. Dessert was meringue and custard for two.  Pretty good. The tables that got the leg of lamb for 3 had better food than we did.  Service was downright terrible. Absent and uninterested.  The manager should be sacked. Teams with bad attitudes are signs of poor managers.  My hotel concierge told me they stopped recommending here (Go to Beast!) and I did not listen. Next time I will.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VvUFaYFzaQMR0eweErPyMQ"
  },
  "e4ykZkwoUYMQbe92cWOOig": {
    "date": "4/23/2014",
    "text": "Amazing, perfect food. Pleasant, low-key dining area. Good service. Um, perfect?Well, it is hard to find and not really labelled from the outside. We even asked a hotel valet across the street while we were wandering around, and he'd never heard of it. Also, you must have a reservation, they're just too popular. And it may be hard to find room for dessert!Once we did find the place, my friend and I both ordered the caramelized onion and cheese tart. So much flavor packed into this dish, and it was much bigger than you'd normally expect for London portions. We were really happy with it as a pre-theatre meal and would totally go back.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VTHNbsEN_tmd7_--2Wv6LQ"
  },
  "xC8DG43xYdXj50chHHpmXQ": {
    "date": "1/21/2017",
    "text": "One of the best gastropubs I've ever been too. The Prawn risotto melts in your mouth.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHAhwC6nGaL9-QQvYYW-4Q"
  },
  "81oRsXZG5mvKlbdrXfV_kA": {
    "date": "9/8/2015",
    "text": "My husband and I found this place on yelp when we were in London last month. We ordered the Beef pie for 2 and it was AMAZING! The best thing we ate in London. It was a little pricey but worth it. We ate the entire thing. Service was also great. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iDDVkoU_LBUBGBtE3asDAA"
  },
  "FJMQCXJKnnFnPUeH8zN2Lg": {
    "date": "4/27/2016",
    "text": "Went there twice while I was in London for a week. Interesting food. Just wish they'd served the whole partridge, not chopped.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovSUqn81ytn8JV9Driu60w"
  },
  "CGwCigZEU2XBEGwuaib_uw": {
    "date": "8/12/2014",
    "text": "I been here once in 2010. It was good for Sunday lunch with the lamb shoulder for 4 people. I remember it was a lot of food. Fast forward to 2014, does this place still have what it takes? We arrived with a reservation for 10 people but two extra people came along. They were happy to move tables around to accommodate.  Looking at the menu on a Saturday night I saw the lamb shoulder, ooooh who's gonna get in on this feast tonight? We made a group decision to order a main each and share the lamb. WOW between the group we barely finished all of the lamb because there was so much of it. It was delicious and very moorish especially with the dauphinoise potatoes as a side.I had the onglet steak. It was cooked rare and well cooked. Only downside was that they cut it up for me. I am not a huge fan of that because I like to cut my own meat. Otherwise a flawless meal with great service.There is a cool cocktail bar downstairs too but didn't have a chance to check it out",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "FPBInntQg6cBMNMTqC7kdA": {
    "date": "3/20/2016",
    "text": "Did not meet high expectations. This place was alright, but I somehow expected more. The food was middle of the road and instantly forgettable. Service was a bit slow when the room was fully packed. Expensive for what it is.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V56AwFRZ7JErc_6dD5Wkbw"
  },
  "CwvU0Ia_qKuiUu5DqDB41A": {
    "date": "5/15/2016",
    "text": "The food here is pricey but extremely well done, I had the quail and it was very good. The restaurant quickly filled up for lunch which is always a good sign.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C2Jx-3H-7F472sc5PEgHOQ"
  },
  "YyqPvKZ3WSB9U5ogkNURBQ": {
    "date": "11/23/2015",
    "text": "Back to the beginning of November 2015 when I was looking for restaurants to go to for our trip to London, I found this place and figured \"why not\". The reviews are very good and there's quite a lot of them too so I shouldn't be badly surprised when actually going there.In the end, I have to say that personnally, I really enjoyed the place. The food was good, the waiters were friendly (though the one we had seemed a bit stressed somehow, even though there was basically almost nobody left to wait on) and I also liked how the place looked. Also, I have to say that I loved the food. Apart from the dessert which was some regular ice cream that I had chosen and that was all in all just ice cream, I found the other dishes I had to taste quite good and to also look fairly nice too, which is always a nice touch.Now, everything about our visit there didn't make me so happy. I was honestly a bit surprised with the way they presented their menu, on a single sheet of paper with basically no structure at all and just text. That wasn't really something that reassured me. Something else I found odd - but I have to guess it depends on the person and their taste - was how they used those little glasses for every single drink. Be it water or alcohol, the same kind of glass was used. That's not something negative, by all means, but I did find it odd.And finally, more than anything else, I was surprised by the price we paid for two. Keep in mind that we both had an alcoholic drink, a starter, a main dish and a dessert. All in all, we had to pay £97 with the service included. Honestly, I found that to be very expensive. Maybe that's normal by London's standards with restaurants, but considering it was my first time there, I had some trouble swallowing the pill, even though I had swallowed the food itself without any problems a few minutes earlier.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yeYVhlucJ_OPbS361mbtOw"
  },
  "yVR7DEBP9ZLub9_fyDkQLw": {
    "date": "4/22/2016",
    "text": "Very full place on a week night. Cute little gastropub with a changing menu. Friendly helpful service.The prosecco with strawberry was a refreshing start and the squash fritters light, crispy and flavourful. The hake was absolutely delicious.I also had a taste of the almond prune tart which was good, not too sweet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1VoG-0-bDF-us7xbWxfeg"
  },
  "-CgMNJbF86-e8UmvHAW4sQ": {
    "date": "1/28/2017",
    "text": "Excellent pre theatre experience here - we had no reservation and were seated quickly and assigned a v young, attentive and toothy server. Waters were brought and shortly after our buffalo mozzarella and tomato salad and calf liver plates. My husband had the beer on tap which was described as slightly warm flat and bitter which we found hilarious but were offered a taste. He found it to be none of those things and enjoyed a full pint. My salad was a modest portion but done v well - the mozz was sprinkled in a crunchy topping and added some textural interest to the creaminess. His calf liver was truly unctuous and well sauced. We topped off w the chocolate fritters which we noticed many other tables enjoying. My husband actually closed his eyes while biting in as the first one released the heat of the freshly made treat. It was akin to a soufflé in that way and we were so happy there were two so we didn't have to share! Pricing is decent and the overall ambiance is happy and satisfied. Will consider this a go-to whenever we are in the neighbourhood for a show.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4o1FlnvYZmdwYqbM-w9kA"
  },
  "BHJC6aCboOmTQ8_DAhNsGA": {
    "date": "10/21/2014",
    "text": "As good as it gets. Food, service, vibe and value are all spot on for me. Delicious modern british food with great ingredients. The standout for me was the rabbit pie- I could have eaten the whole thing.Bring some friends, try lots of dishes (open your mind palette to some new animal parts), share it all, and you'll have a good meal.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2XAspNpbZOBuzOBHTo0rSQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Rice semi frido",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2XAspNpbZOBuzOBHTo0rSQ/o.jpg"
      },
      {
        "img_id": "1ktiD5jnbtSo0Ss7Sglf3w",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Lamb neck",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1ktiD5jnbtSo0Ss7Sglf3w/o.jpg"
      },
      {
        "img_id": "uvMgawsADAzYr8imuIB5gQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Plaice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uvMgawsADAzYr8imuIB5gQ/o.jpg"
      }
    ],
    "user_id": "answ6V84iLiZSHxTlv87Hg"
  },
  "nmWGu8uqnon5zk6t-7_Kvg": {
    "date": "9/20/2014",
    "text": "Five stars for the food! My boyfriend and I shared crab on toast to start and then went for the lamb fillet and the pot roast partridge, swapping plates halfway... I love doing this as I get to sample more of a restaurant's food :)I was initially a bit concerned as the two-person tables are a bit crammed in and placed in rows - the waiters have to regularly  squeeze past you. As well as this, the restaurant doesn't play any music upstairs and so there is quite a din when this place gets busy. However, these two things do make the restaurant a bit more cosy and intimate!Staff are really knowledgeable and friendly, and were happy for us to take our time to decide. My boyfriend had a Freedom beer (he testifies this was really nice) and  I had a carafe of white wine which they then serve in teeny tiny glasses. I can't decide if his made me drink faster or slower!The food was too quality and I will definitely return; even though it's pricier than a lot of nearby restaurants, it's worth it.Afterwards, we went downstairs to their cellar bar which had really bright lighting and so wasn't as atmospheric as it could have been. I had a Moscow mule which was lovely, but my bf's silver bullet was hard to finish... A tad too strong! I'd avoid it if you don't want to get hammered :)",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5FUpFiWtH3pXhBGsMbAqeg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Pot roast partridge and apple black pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5FUpFiWtH3pXhBGsMbAqeg/o.jpg"
      },
      {
        "img_id": "veuX7PR-KljLZ-3Wc-1CPA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Lamb fillet, split peas and chermoula",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/veuX7PR-KljLZ-3Wc-1CPA/o.jpg"
      },
      {
        "img_id": "Ar8N8GXwSuyvWt4dTSol2g",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Crab on toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ar8N8GXwSuyvWt4dTSol2g/o.jpg"
      }
    ],
    "user_id": "0QHjjY5uopbCgdLK0kHPaA"
  },
  "7lNyJ0TJb-6cGGRB5R5e6g": {
    "date": "7/2/2014",
    "text": "JUST GO HERE AND EAT ALL THE THINGS.which, funnily enough, are on the menu :) service brilliant, as is the food. stop reading and start eating.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIwD0clhd0rAgCOOUeLoFQ"
  },
  "DPJsdVzoNqEIrVGnNnHR9A": {
    "date": "12/20/2015",
    "text": "I hosted a dinner party for 12 people at this restaurant and everything went perfectly. The service was excellent from making the reservations to food service to completing the bill - all excellent. The food was outstanding. Lots of delicious options with outstanding flavors and textures. The wine that was paired with the meal was excellent as well.The crowning moment was the satisfaction from all my guests. It was a business dinner at a restaurant I had never been to, so I was nervous, but everyone was so happy in the end. I really look forward to returning to Great Queen Street.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xhiuf-jBBWvq_4w0uSE1tA"
  },
  "vsTp1foXtUNDOtMEFRG7wQ": {
    "date": "3/20/2014",
    "text": "My first night in London is off to a great food start!Upon reading the reviews here, I decided this was a good first place to start.  I showed up close to 9:00pm I believe, the place was busy and nearly packed.  They managed to find me a small table inside just a few minutes which was nice.As others have mentioned, the bread actually came out before my water (though only by a minute or so), but that was literally the case.  The service was good, the staff was helpful and timely, no complaints there.The main dish I had was an Ox heart, served with some spinach greens and chips on the side.  I'd gone in thinking I'd get rabbit, but this was just too good to pass up as it was a special.  I don't remember the wine it was paired with, but that it was very good and matched nicely (a red).  It was prepared perfectly, had lots of flavor, and was an excellent portion size (filling but not stuffing).  The chips were also great, crisp on the outside but not overdone, warm and cooked right on the inside.After the main course I had a dessert of jelly and biscotti of which both were great and spreading the jelly on the biscotti was very tasty, and finally some Earl Grey tea.All of this was for £30, which I think is a great value.  I can see returning on a subsequent trip.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g99dRSpXlUtzfg9cfjIs-Q",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Ox heart (special).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g99dRSpXlUtzfg9cfjIs-Q/o.jpg"
      }
    ],
    "user_id": "oWMu0DVnrKjkEd98D2uEFg"
  },
  "Rutc2GbZHVCQ29Qe_r1VbQ": {
    "date": "1/16/2016",
    "text": "The place itself is very nice, wooden and more traditional. The food is British and unfortunately doesn't have the greatest choice for vegetarians BUT I must say the beans on toast were unexpectedly good! The waitress was very friendly and the wine good! For a relaxed dinner this place is def good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eO_U7_6K70EZDrnc_WiWHw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eO_U7_6K70EZDrnc_WiWHw/o.jpg"
      },
      {
        "img_id": "vdZXwoCn4NHz_Zr9-AnDMg",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vdZXwoCn4NHz_Zr9-AnDMg/o.jpg"
      },
      {
        "img_id": "A38ncC01ZNrDC6g9dxvdNA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A38ncC01ZNrDC6g9dxvdNA/o.jpg"
      }
    ],
    "user_id": "QA9LBKDFveVd_jSPpDWQng"
  },
  "r3lHb58zEIzBhrM7LXD8Yg": {
    "date": "7/24/2015",
    "text": "What a wonderful place to have dinner! Made a quick reservation online through Open Table and was able to snag a table. Warmly greeted as I waited for my friend, and the staff didn't give me the stink eye as my friend ran late about 15 minutes behind. Fantastic food--a bit comfort food like with braised and roasted meats. The menu changes frequently. Flavorful, thoughtful, and delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A4BvBLJxQnV7KjwJjM9V6w"
  },
  "mZIzD32rwIsgbrHbKOdC9g": {
    "date": "10/10/2011",
    "text": "Last night in London and we wanted some traditional British fare. Yelp steered us to Great Queen St. and it wasn't wrong. Best meal of our trip. Tables were all reserved so we sat at the bar. Good beer, great atmosphere, and delicious food - partridge and cannelinis, baked st tola (goat cheese) with leeks and pumpkin, and fig and raspberry tart for dessert.The entire experience was perfect. A must-go if you're in London.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bx9aArOUdLpqtlr-tL58GA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. fig and raspberry tart with hazelnut cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bx9aArOUdLpqtlr-tL58GA/o.jpg"
      },
      {
        "img_id": "uM96bxTEv0g1S-Gwnn-Bsw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. baked st tola with creamy leeks and pumpkin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uM96bxTEv0g1S-Gwnn-Bsw/o.jpg"
      }
    ],
    "user_id": "VLMoj6fovhYVEZWOaPiAcg"
  },
  "KZfPjszbC1Rqnsiz4m3LGg": {
    "date": "7/10/2014",
    "text": "First of all, I agree with past reviews in that the food was really good. We went for my birthday dinner around 8:30pm on a Monday night. It was still really packed however we were lucky enough to get the last table in the back. I ordered the chickpea dish, which had chickpeas, mashed potatoes and grilled vegetables. It was very flavorful and very filling (I could only finish half of it). The mushroom plate was heavier, with fried mushroom/cheese/breadcumb rolls and courgette. We loved the crusty whole wheat sourdough bread that came out before the meal as well!The reason I gave this restaurant 3 stars is primarily because of the service. Service was really slow, and it took forever to get our dishes and then finally get the check. Our server was nice, however nothing out of the ordinary. It was also really hot in the restaurant, but probably because of how many people were in there. Prices are slightly higher than our normal meals, but still reasonable.I would try it if I was in the area!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JE6ZqyqHRwTfhuDdhhS3bA"
  },
  "pxFWH0qrv-M4uBCL1KDBDw": {
    "date": "10/11/2013",
    "text": "My friend highly recommended this place because it was her favorite place when she lived here; hence, we walked so far to try this place out (we didn't rent a car in London).When we walked in around 6:00pm, 70% of the restaurants were already filled; there was one table available outside the restaurant, we asked for it, the server said OK as long as we give them our credit card to keep. We ordered their steamed whole fish, steaks, bottles of red wine, artichoke and desserts; the fish was amazingly fresh and tasty, we were impressed that they even serve whole fish (with the head); steaks were also perfectly cooked and melt in our mouth. The wine the server recommend was quite nice, smooth and goes so well with their steaks.Service was alright, perhpas they were quite busy so they were not too attentive. Overall, a very nice experience at this restaurant and I do recommend here for other people who visit this area.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_ZXnwgmEMJx2ZRwp_nl6w"
  },
  "xbxPDv1DwLQid7xWVbNLlw": {
    "date": "8/13/2016",
    "text": "This place was delicious.  We had the steak and ale pie and it was delicious but the most delicious dish we had was the cauliflower.  I must say that the cauliflower was one of the most delicious dishes.   Their beer selection is great as well. I recommend this place.  I am not in London often  but I must say I will come back here next time I am in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aSSHIcxfLzPs8Wk6W4xnRw"
  },
  "6MsfO4RqXwIuco-ihnQzPw": {
    "date": "7/14/2015",
    "text": "On a summery day my friend and I decided it would be the best of ideas to get out for a glass of wine. She, being a born and raised Londoner, is my most trusted map of the city. So willingly I let her drag me to whatever place she thought would be fabulous. Great Queen Street it was. The well hidden cellar bar is supposedly really crowded normally, but the rare appearance of the sun meant that nobody obviously wished to stay under the ground. We asked if we could have a drink outside instead and a friendly waitress guided us to a table. It's a treat as such to sit outdoors in London. I kinda wish there were more terraces for days like these. Sitting in the evening sun I ordered a glass of wine, while my friend opted for a glass of sherry.What I loved, other than the really friendly and patient waitress and the nice sunny terrace, is the fact that the restaurant has multiple really affordable wines on offer that can be ordered by the glass. To find an affordable drink in central London is a gift in itself, but to have the option to choose between multiple red wines that are all priced less than a fiver is unique. Other alcoholic beverages, including my friends sherry and a whole range of cocktails, are equally well-priced, so I will definitely return when I have the chance.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBCWMtzPMt00xIE5ntRSQA"
  },
  "uzwkxzl1sgSnly4NGrzAWg": {
    "date": "11/14/2016",
    "text": "Reservation is highly recommended!Food was great. Very nice staff. Unfortunately they ran out of Beef Wellington but the lamb for 3 was cheaper and the portion was massive!I would definitely return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZDrGqT7oxoDrzs2Di46AQ"
  },
  "_JucUqrntwVHwa2AvpIQGQ": {
    "date": "9/22/2016",
    "text": "Came here on a Friday night last week with my boyfriend. We walked in without reservations and sat at the bar and got drinks and appetizers. We were lucky that they were able to seat us! We didn't think we'd be able to get a table (which I really wanted) but the staff made that happen for us. Definitely a place you should make reservations for (I had no idea as it was my first time there). Cocktails here are great. You can get wine by the carafe (hurray!) and they have a cask ale that's also pretty good. We had the pigs head croquettes, eel salad, and the chicken pie for 2. For dessert we had the beignet with Victoria plums...which was mind blowingly good. The staff was really great too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0YI0fA3naGahJHRH6RnDzw"
  },
  "r8buBPnNH9eU27yUi8bWGQ": {
    "date": "9/21/2015",
    "text": "The nicest and most generous bartender I have ever met in London. Thanks Gareth. I hope I got it right.  I'll be back.The plum vodka was nice the whiskey was good.Can't wait to taste everything behind the bar.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFR351opDMgmF855o-iAnQ"
  },
  "L7bvSgZEoBYS4YfHOVyvHQ": {
    "date": "10/7/2011",
    "text": "My girlfriend and I decided that our last meal in London before traveling back to the States should be a \"proper bit\" of British food, and we took a chance on Great Queen Street. When we walked in the place wasn't full but we were told all the tables were booked (always a good sign) but they were happy to seat us at the bar which actually wasn't overrun with drinkers. The menu was pretty phenomenal with a lot of things US eaters might consider \"game\" meats like ox, rabbit, partridge and mutton--but I feel like they were all pretty accessible for someone wanting to try something out of the ordinary but still slightly familiar and not too far out of your comfort zone. I had the partridge with cannelloni beans and it was pretty darn spectacular. The broth/stock it was served with was great and flavorful. My girlfriend had a leek, pumpkin and goat cheese concoction that was equally good--so good well probably spend the weekend trying to replicate it. Luckily, partridges are pretty small so there was room for dessert. We had a fig and raspberry tart that may have been the best thing we ate of our whole vacation (and we had just come from Paris). Well likely try and recreate this as well!The service was great, friendly and well informed about the menu and ready to explain, the atmosphere was perfect, and the craft beer selection was great--it's nice to not have the corona/heinekin/budweiser safety net when overseas. And the price for all that (including a few pints) was just under £40. If I'm ever back in London, it's the first dinner I'm having. And maybe the second.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "nW-j_7aiNqnnGj7Hh3z6vg"
  },
  "qWEWyDZ3xmW-dpc1ZSeQFg": {
    "date": "5/10/2012",
    "text": "British Country food. Friendly staff/owner. Menu changed dailyI found this place on Yelp while staying overnight in London. The premise is real English food - not the fish and chips rot you normally get, but more traditional fare. The restaurant was full (good sign on a Thursday night), but I was able to sit at one of the three tables outside. The menu changes daily based on what ingredients are available. I chose a venison with barley dish that was slow cooked to perfection. The service was a bit irregular, but not bad for the UK and the owner/manager? was very enthusiastic and helpful. When i talked to the business they didn't know they were on Yelp or what Yelp was!All in all, a good choice instead of the usual curry houses or other imported cuisines. P.S. I am so happy Yelp now is supporting London!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lZHn-ZDHbwaxXCz7FqP2pw"
  },
  "xFZEiYuU-Zk5k6OaDISR1g": {
    "date": "2/3/2012",
    "text": "I am NOT an adventurous eater.  I am also decidedly not a fan of British food.  I do not like fish, and meats that the British dig into without thinking about it are often just too gamey for my tastes.  When a friend suggested this place, she didn't realise I think just how picky I can be, but I decided to roll with it.  I'm REALLY glad I rolled with it.  This place was great!  Awesome atmosphere, and the wait staff really were as friendly and smart as everyone says.  Very patient people, never made us feel rushed despite making it clear when we booked ahead (and you MUST book ahead, this place is absolutely hoppin') that we WOULD need to clear out by 7:45 to make room for the next wave of people.  The food was fab.  We shared the goat with chicory, neither of which I have eaten in the past.  I admit, rare meat really weirds me sometimes.  But this was cooked so beauitfully in a lovely sauce, I really really enjoyed it.  The rarer pieces had to go to my comrade, and so I didn't feel like I entirely filled up, but the food was so beautiful and so nicely prepared and so DIFFERENT that I just really enjoyed myself. I liked that the decor was understated and pub like, but the food was first-class.  I do have to say that while my friend loved it downstairs as well, I found it creepy and clausterphobic.  For those who prepare a venue with windows, stick to the upstairs.  Very yummy, worth the cost, and worth trying something new.  Hooray!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1vSKO0xWt16WpA-YQCEjg"
  },
  "U1mdnb4mGi6_9ba6fdgPiQ": {
    "date": "10/2/2011",
    "text": "We wandered in to Great Queen Street looking for something to eat on a Monday evening, and we were seated immediately but were told we would need to vacate our table in an hour and a half.  Suited us fine.Nice ambience, Rustic, floorboards, plain decor, admittedly it is a little squashed in.  One or two too many tables.The menu is interesting, slightly wacky, difficult to choose from in some cases. The most interesting dishes were sharing meals, and luckily I found someone happy to share a chicken pie for 2.  It was served in a generous iron dish, with a shortcrust lid, and was delicious.  It cost about £30.Don't bother with the homemade ginger beer.  It is £1.90 for a glass filled to the brim with ice, and a tiny amount of beer, which was not sweet enough.Service was very good, food was excellent.  I would return.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "xavRspTbFvXigHO9y_jwEQ"
  },
  "NIr1EVaz2mykDTrzOumjvg": {
    "date": "8/18/2013",
    "text": "Stepping into this establishment is like stepping into an old English country pub. When we came it was a busy night. We hoped to get a table but none were left. However they welcomed us at the bar where we enjoyed our meal. We had the sweet corn soup to start & shared their popular rabbit & mushroom pie. We also had a side of greens. We loved the soup & was perfect for a chilly night. For the most part, the pie was good... Just a little under seasoned. The rabbit was super tender & flavorful. However, I did not get the mushroom flavor. The side of greens was also a bit under seasoned. Service was friendly & attentive. I would definitely return & try the other entrees. I heard their roasted chicken is also very good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9sxvJvvTtw8y2YRDcaL9nw"
  },
  "-EB_S1jwc46Ydaw8LMTgBA": {
    "date": "10/26/2013",
    "text": "Best meal I had this year. Make reservations though. Friday I arrived to a less than full restaurant at 6:30 PM. I asked if I could book a table for three at 7:00 PM and I was told the earliest available would be at 9:45 PM. Thankfully the bar was completely open, but by 7:15 PM the whole place was packed. Tiny beer selection with only one on tap. Local, as in UK, thankfully. A huge wine list and only one cider. The menu has so many good dishes to choose from.  My mates ordered the rabbit for two and boy said it was so good. I ordered the slow braised pork with fennel and quince. Just wow! So, so good. It was melt in your mouth I need another bite now good. We decided to follow that up with the pear tart. That was so good and en we discovered the Today's Special board. We had the brown bread ice cream as well. Just more goodness. I highly recommend this restaurant. Great atmosphere, nice staff, reasonable prices, just wonderful.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0AyZxS5C--WySnbW_Q8yQ"
  },
  "8yu91MIvda3HHoiPUapdBg": {
    "date": "11/28/2014",
    "text": "One of the best restaurants I've been. The food was really good and not that expensive. We sat at the bar because we we're a bit late and all the tables were taken but it didn't matter. Next time when I'm in Londen I'm definitely going back.Enjoyed the atmosphere, food and staff. Five stars well deserved.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ekp35fNKXADSEVjw6U57-Q"
  },
  "C4lI7BM-ogFbMtN89lIMlg": {
    "date": "3/12/2011",
    "text": "Michelin star worthy.  This place delivers on what British food should be.  Standout dish was the Romesco (moon broccoli???) salad, with sultanas, pine nuts, manchego, and some other tasty bits.  Both vegetarian dishes they had that evening were superb and well thought out.  They have a cozy bar downstairs to grab a reasonably priced cocktail before you get dinner.If I lived closer to this place, I'd be a regular!  Make sure to get reservations in advance, as it's tough to get a table the day of.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "A-WwfPVKmbzo6uohiq-Z4A"
  },
  "mMm0f0LM5ewdNrZJzVu63g": {
    "date": "12/14/2013",
    "text": "Lovely place. Randomly walked in on a Christmas season Saturday lunch. Sat down at the bar and were taken care of immediately.  Had pig's cheek and some smoky fsh. Perfect for the cold windy winter day, with the food being fresh, hot and juicy. Will come again when in the neighborhood.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYjqr9cJLnSscvs7rtoRcA"
  },
  "lhFo91u13vE_UWbT1f-kVw": {
    "date": "1/29/2012",
    "text": "Had some luck on the Lottery, so we went to an ehibition and went here for some eats. Really, Really good. Very impressed, and yes, it cost a bit more than I normally payit was well worth it!! Lovely staff and we left well satiated. Will be going again..if I win again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_qkC6eKg59DygaRZiln_Cw"
  },
  "HjL_o9pI4VBb7IrwyETR1g": {
    "date": "12/2/2013",
    "text": "So, I did have a great time here, and I did love the food.  I think on any normal day, I would have loved to give this restaurant five stars.  The reason I'm taking two stars off is because I really really had my heart set on the rabbit or the lamb, but I couldn't get either.  The day I came in, the restaurant had served the last rack of lamb, so I tried to settle for the rabbit.  My second problem?  When the waitress asked if it was okay to bring the rabbit out rare, I asked if it could be prepared med rare.  She told me she had asked for a previous customer and the chef would not cook rabbit past rare.  Disappointed, I settled for my third choice, fish.  The fish was extremely juicy, tender and had a delicious citrusy flavor. I've heard a lot of rumors about how flavorless British food can be, but boy does thus this Chef knock down every stereotype.  The fish was impeccable - beautifully seasoned, perfectly cooked, and just exploded with flavor. For dessert we had a chocolate cake dish with pomegranate. I think this is my new favorite combination. Definitely beats chocolate and strawberry or chocolate wi raspberry any day of the week! I would love to come back and try some of the other dishes on another trip to London some day.  Although this time, I really hope I can get my first choice dish.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KRNbW2TCluXsd8VtNJ8uew"
  },
  "5z6tMKdhQ_varAMlHPDnoA": {
    "date": "5/10/2009",
    "text": "When this first opened in 2007 (or 08, I can't remember) I binged on it.  I just couldn't eat or drink enough there as everything was good, everytime.  As I was working in St James it was just about close enough that (with a bit of effort) I could make it my local. 20 or 30 times later I still loved it. Having moved jobs and with fewer excuses to visit it I revisited it today for a Sunday set lunch and will re binge in the near future.  If you want hearty gastro Anglicised food come here. If you want a pie, or a chunk of leg of some non descript animal stewed for 7 hours or a earthy terrine or some other solid food (almost an English version of Lyonnaise cuisine) this is the place to go.  The food is a bit less fussy than its sister restaurant in Waterloo, but it is smack bang in the centre of town, has awesome excited (in the food) staff, good wines and enjoyable house wines and along with the fact that you can get reservations here, it makes it just about perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Gfim97xkJTcr8reJB1MWNg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Interior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gfim97xkJTcr8reJB1MWNg/o.jpg"
      },
      {
        "img_id": "eshPIHecVZ2BmlpVpgsg1g",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eshPIHecVZ2BmlpVpgsg1g/o.jpg"
      }
    ],
    "user_id": "GgwkjH57TdhrCocAGHhqRA"
  },
  "0TkXPGcvJIdVMGp-AA0X0w": {
    "date": "10/27/2010",
    "text": "First of all, the name of the restaurant is original eh? =)Honestly the service here is one of the best so far I've experiencd in London - just really friendly, unpretentious and cosy service by waiters/waitresses who love food. The menu is british which means lots of gamey birds, venison, pies, rillets, fries, cheese, etc. I had the rabbit rillet as a starter which was a bit dry and flavourless. However, I might be a bit biased since the week before i had the MOST amazing duck rillet that can not be compared to anything!|As my main, i had some a whole bird (forgot what type -either quail or partridge) which w as a bit difficult to eat since my knife/fork skills are HORRIBLE! I ended up just picking it up with my hands and gnawing away on the bones; while a waitress politely placed a bowl of water to rinse the grease off my face. Anyways, this place also has a good selection of wines to go along with the meal which can be quite a rarity at mid priced restaurants. Tip for readers: Make sure to call ahead and make reservations!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "lxvVnNWEqR4bV5ZGuQiRkw"
  },
  "PDOXVs-P3DOr6ww474nayw": {
    "date": "5/5/2011",
    "text": "Dinner for 6. Took the wine recommendation which was perfect. Beef was cooked just right and the diverse menu was interesting and most importantly tasty!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N_ZVVnLvNlSauxz1jctjmQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N_ZVVnLvNlSauxz1jctjmQ/o.jpg"
      }
    ],
    "user_id": "LxLyqKGFhD7t_4Ydo9H3CA"
  },
  "b1eN3uIRJNRFmSMPjw3ezQ": {
    "date": "7/3/2011",
    "text": "Classic British food done well. Came here in March with some friends for lunch and have been meaning to write a review for ages!A step above your classic pub fare and truly delicious for it. We shared the chicken liver pate and rillettes to start with - the pate disappeared sharpish, the rillettes were less popular. I followed this by a bean and vegetable soup, my friends had a rabbit salad and confit de canard if I recall - everyone raved about their food.Dessert was a divine pistachio cake, or which I could have eaten three slices...Really loved the laid back atmosphere of this place, that still serves good beer but let's the food shine through.I hope Great Queen Street gets the recognition it deserves, although once it is awarded it's first star it will be even harder to get a table!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fm9USFMgcVhYVVWYDgU2vg"
  },
  "JNwlzWS3I09698ZR3T47VA": {
    "date": "5/5/2011",
    "text": "Can't get over this place and want to return immediately! Came here very late on a Wednesday night (they serve until 10:30!) and just ordered a course each but that was enough to hook me for more. Staff are beyond friendly, atmosphere is super cozy and cocktails are reasonable prices. -Chickpea pancake: All sorts of YUM!-Ling with beetroot & walnut sauce: Hellz yes.-Dover sole fillets: Does come with teensy bones but the fish falls right off them and is breading/cooking is perfection. Def get with a side of tasty chips.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "VPft4o4ibno7zNbIWS1OQQ": {
    "date": "7/3/2015",
    "text": "Came here for the lobster and the meal was great! The only thing I can criticize is the amount of salt on the chips, it was way too salty. Never the less, me and my SO had an excellent time due to the good service and affordable, delicious food and drinks. I would happily recommend this place to anyone who are looking for a good meal in Soho!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic2LNlH6tGfeicEMS-JMmQ"
  },
  "9Y-hCoTP2nwBO6NiT5W-pw": {
    "date": "9/1/2011",
    "text": "GQS's menu is unpredictable, but reliably unique and delicious!  Not that I don't love fish and chips from a pub, but this place is way above and beyond \"food,\" into the realm of what one may unpretentiously term \"cuisine.\"It's a wonderful spot to take your family or a larger group for a lingering dinner.  Many dishes are designed to share between several people, so coming by yourself will restrict your options (as I learned my first time here).The waitstaff is friendly, knowledgable and helpful, and they all speak with real love of their craft.  However, because they'll take the time to have a friendly chat, it means they're not the quickest.  I wouldn't recommend coming here to try a quick bite if you have any place to be.It's just too bad I don't live in London, or I'd enjoy coming back again and again to savor their next culinary revelations!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_RpaZdboEMm9Bv2J13TAw"
  },
  "tBUbaW5v3kufX-GPPifmfQ": {
    "date": "11/24/2012",
    "text": "A chinese friend recommended this place. It was fully booked, but then they offer you first come first serve seats at the bar. You can wait for that in the downstairs, rather basic, cocktail bar. So off we went. We got two seats at the bar in 10 minutes.I actually preferred eating at the bar. Also gives you a good view of the semi open kitchen. Always a good sign. Another good sign is when a restaurant has daily specials. We had what they call a 'Crab Custard', which was a Crab mousse, as an appetizer from the specials. Very nice. We also ordered some cold haring. Very refreshing. We shared the appetizers, so that made for a good combination.We took one of the specials as main course. A classic I haven't seen on a menu for ages and which I remember eating in my childhood, growing up on the french border, from a french canned brand: Cassoulet. The very friendly waiter warned us that it was quite a heavy dish and had to be ordered for two. Sharing is caring. It was a good choice: the duck was excellent and they added some blood sausage to give it a British twist. Maybe one negative was that there weren't enough beans and sauce. But I might be wrong, I only have a canned history with Cassoulet.We finished sharing some very sweet apple pie with clotted cream. The bill was reasonable and we were full and happy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8siUorJ25iorp3t-1f4Fg"
  },
  "gBK_9YgXiWujbAO4JqpdcA": {
    "date": "9/10/2010",
    "text": "I am so impressed with this restaurant. Everything I ate was incredibly delicious. The service is excellent and everyone is well informed about the dishes and seasonal ingredients. They have small plates and entrée-sized plates - all are great for sharing. I had dinner with three friends and we ordered a pumpkin dish, beef ribs, rabbit, curried aubergines, cauliflower and courgettes. I probably could have continued to order because everything was so well-prepared and wonderful!Cocktails are strong and arrive in small glasses, and you can also purchase a cookbook if you want to try this at home. This is a great find and a fantastic place to experience modern British fare where it really shines. I will definitely return the next time I am in London. What a great dining experience!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OJfHIGyA5lSF7YRbtMXh7g"
  },
  "O62CDXVJiKUp-k14XC9FnQ": {
    "date": "6/4/2016",
    "text": "Great Queen Street features all sorts of seafoods and has very good quality. The oysters rocked as much as the cured sea trout. The homemade drinks are highly recommended but also a little pricey. The sole was super fresh and the kids loves the fries. All in all a rockstar dining option. Keep it up.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q5f2MRkHuUAdFBbkOI7YwA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5f2MRkHuUAdFBbkOI7YwA/o.jpg"
      }
    ],
    "user_id": "jdYaW6pB2mawTMyeUk4O7Q"
  },
  "ZacTuvfLxH2Ckeewe0y3Vg": {
    "date": "8/30/2017",
    "text": "Not sure why this place is so loved.  Menu was really unappealing when we were there, and our family of four tried three different dishes.  Really so-so, especially for the price.  Bread was good, but rest of the food just wasn't doing it for us.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V_ApE7UX5bFTPZcEXfyE1w"
  },
  "skuo2nMCZdFvSoL7lmmZYQ": {
    "date": "9/25/2017",
    "text": "Wow. Everything is yummy. Stop by for lunch before or after a visit to the British Museum. Nice ambiance.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t270tmUV9coYuPfaEB1xgA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t270tmUV9coYuPfaEB1xgA/o.jpg"
      }
    ],
    "user_id": "bFLmdzeeU5KoZE3CkUq-_w"
  },
  "tOQUI3DvzeTszxsBqt8xBQ": {
    "date": "7/22/2017",
    "text": "One of our go to place in London. They've usually got a nice rabbit pie on the menu, which is super tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Iz8VbjbJvEq7Z2BHtfq-7w"
  },
  "kl4wM8cg50Lzx78jRDxsnw": {
    "date": "9/18/2017",
    "text": "Absolutely LOVED this place. We got the shepherd's pie and this tomato soup that were TO DIE FOR. That crust was..... amazing. It's sad that their menu is seasonal, because I would go to London just for that food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HSaAqweQvq_9kzHEPohepA"
  },
  "IlVOL7wy0zk12-WLwXTKag": {
    "date": "9/24/2015",
    "text": "A warming hearty meal in a warming hearty place. I caught up with a good friend here for dinner; she'd been before but it's somewhere I've often walked past and noticed it looking busy. Last Friday eve was the perfect opportunity for me to try it out.The interior is warm and welcoming with high end restaurant touches merged into a more informal gastropub setting. My ex-housemate shares a common characteristic with me in being ten minutes late for most things, so we arrived about the same time to be seated at a candlelit wooden table for two near the bar counter.The wine menu has a good spread of price points though doesn't tell you the grape variety for many of the bottles, so unless you're very up to speed on the names of the individual producers in each region you're somewhat flying blind. We asked our friendly waitress about some of the reds or what she'd recommend with lamb, and though I'm sure she must've been tempted to blag it, credit to her that she admitted she wasn't sure and she'd ask her more oenophilic manager. She reported back with some useful info and we were able to pick a full-bodied one that we both loved. Always good to ask on these things - life's too short to drink bad wine, right?The food menu changes daily with plenty of roasted meats and comforting sounding options. We both picked the lamb which nicely cancelled out any food envy - though that struck later when we saw a huge steak and ale pie arriving for two at the table next to us which looked great fun to dig into. The lamb was an excellent choice though - the meat nicely tender and pink, cooked with peppers, aubergines and anchovy. I wasn't sure about the anchovy part but you couldn't taste it in isolation, and altogether it was a decent-sized hearty dish that went well with new potatoes to share. The pleasingly sharp knife to get stuck in was also a welcome touch.The setting was so lovely we happily whiled away a good few hours chatting and enjoying our choice of wine. They did occasionally have a few people standing at the bar counter - and thus right next to our table - waiting to be seated, and one of them managed to drop a glass which smashed quite close to our feet. Just as we'd shot them an unimpressed look of course I managed to knock our little pepper pot off the other side of the table too. It cracked into 3 pieces which we propped back together against our empty wine bottle before leaving (childish I know but it seemed like a fun little jigsaw at the time) so err apologies to the restaurant when they found it!We went for the three-types-of-cheese plate for dessert which was the perfect way to end on a high, though far too much cheese for the two of us to finish. We gave it our best effort though - it was a good complement of a soft goats cheese, a blue and a hard all served with tasty oatcakes. It's not an everyday type of place and the bill came to £40 a head for a main, dessert and wine which felt about right for this place. There's a lot of competition around this level but I'll be adding it to the date night shortlist. Best suited for a special cosy dinner I think - they can accommodate groups but most of the tables are for two.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "E9vrC2FpOYtY9OI8Azlchg"
  },
  "iBbwkQoDeXK9Vu3F8RitOw": {
    "date": "6/22/2017",
    "text": "We enjoyed this place. I would like to give a higher rating but there were a few things holding me back.Ambiance: lot of energy in the place, nicely set up, and casual.Service: our server Elena from Florence was very helpful, efficient, suggested a wonderful wine and made dining here a pleasant experience. Food: Overall, we loved the food. We started with potted shrimp and pickled cucumbers and a special pork belly app. Both were tasty and just the right portion. We decide to share the suckling pig main plate. It was HUGE, we could never finish the dish. My wife wanted to order ravioli as an app not a main but the chef refused to do so. No worries.The suckling pig was delicious, hard (maybe a bit too hard) skin and soft, flavored pork. We put a small dent in the dish. It was tasty. The servers packaged the leftovers and we gave them to a homeless person. Overall, a good experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TjeeFCU7--LULHMCd4ukXA"
  },
  "27cF16bIPQWEwMd1324GIA": {
    "date": "7/23/2017",
    "text": "Great service, drinks and food.  Good location in Covent Gardens.  Since they were crowded and we had a family of 7, they even seated us in the lower level and we had private dining!  Amazing food!!  Be sure to try the steak pie.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQtRPXIb_HDSBhl9EGWhyA"
  },
  "PpERTFTrm66ZrzfdGzn9-g": {
    "date": "6/4/2017",
    "text": "We were looking forward to our dinner here all week, but we must have chosen an off night. Some dishes were amazing, but others were just so so. The gazpacho was incredible, with pieces of sweet cantaloupe to balance out the tart and spice of the soup. My wife loved her shrimp, mango, and avocado salad. Where dinner fell down was in the mains. There are some things my wife doesn't like to eat, and somehow every single one of them was on the menu that night. I got the cuttlefish, and my wife got the pasta, but compared to the menu we had seen earlier in the week, we were disappointed. They change the menu based on what's available, and while that makes for fresh, inventive food, it also means that you're not sure exactly what you're going to see on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JLI3qV-8dvJLW-kgZ08uAQ"
  },
  "19TqmkFyCw6lArf7Z5jEmw": {
    "date": "11/11/2015",
    "text": "A cozy and intimate restaurant that was perfect for date night.  We were catching a comedy show across the street at Soho Comedy Club so this was a very convenient spot for a pre-show meal.We ordered the lobster meal for two (a large lobster and potatoes) and also a bottle of wine.  The service was extremely accommodating, allowing us to taste a few different wines before settling on a decision.  They were very friendly and the entire place had a very mom and pop feel that was also classy and elegant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o2F54-mNID5V6F4fPudRvQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Lobster dinner for two!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o2F54-mNID5V6F4fPudRvQ/o.jpg"
      }
    ],
    "user_id": "p6FVmVUFTZ7scV9EM4l2HA"
  },
  "e3ooOCIQQTlBLAQbsq4IWw": {
    "date": "5/31/2015",
    "text": "Update from 2013. Still very nice, but ..... just not the same. Maybe it was our selection of a Pork and Bacon pie vs. the Rabbit pie. Would I go here again oh yes, would I dream about it. Don't think so.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-O1hMXecflblAs2UOdqw1Q",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Pork and Bacon Pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-O1hMXecflblAs2UOdqw1Q/o.jpg"
      }
    ],
    "user_id": "nd1S1x5YhuYu-LgoiT67-g"
  },
  "618oAMynygM1Ao-3ntLKlA": {
    "date": "10/19/2016",
    "text": "Sometimes, Yelp lets you down. The best part of this place by far was the sourdough bread, which can go toe to toe with San Francisco's best. And they seem to know it - it was featured in both my app and main, as well as being provided on its own. Food-wise, we were very disappointed. The best dish was probably the smoked eel salad, which contained plenty of eel. The potted shrimp, on the other hand, was a cold, nutmeg-shrimp flavored spread and a piece of toast. Odd, and not in a good way. On to mains: the partridge was overcooked, and tasted like very dry chicken. The grouse, meanwhile, was the most bizarre dish of the night. It was cooked correctly, and had a nice gamey flavor profile on its own, so really no more dressing was needed. However, it also contained the following:-A side dish of gravy, to be poured on top (flavor profile #2)-A side dish of cheesy, pasty stuff, which you were then supposed to dip the meat in (flavor profile #3)-A couple of spoonfuls of cranberry sauce under the bird (flavor profile #4)-A spread of pate on toast coating the bottom of the dish on a piece of toast (flavor profile #5)To quote Annie Hall - \"what, no pineapple?\". This dish was far too messy to be enjoyable in any way.  Also, note that GQS is punishingly loud. I could hear individual conversations from four or five other tables, and this was on a Monday night. That plus the bad food made us want to get out of there as soon as possible and forget the whole thing. No beers on tap save for one watery cask ale (not deducting points for this, just FYI). Service was fine, if you could hear it above the din.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4Mos3ZeuUkb9ekQO7fbnQ"
  },
  "x0Bar_VjY08ToER4BeVsWg": {
    "date": "8/22/2016",
    "text": "This restaurant was excellent. The staff was friendly and extremely helpful with the menu. There was a lot of variety, and when we asked for recommendations it became even more difficult to choose because it all sounded delicious. But most importantly the food was fantastic, and they offered really good portions.Doing a quick dollar to pound conversion in my head, I'd say it was pretty well priced, too. I will absolutely be returning next time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uNLpV79BFVRVfv3nP_Lxg"
  },
  "lHNzBcwp7X_c--cnrUP1gQ": {
    "date": "1/26/2015",
    "text": "It's been a while since I've been to this pub for dinner - and thought it would be good to go again since we weren't sure where to go for dinner before watching a show at the Peacock theatre.  (Little did we know there are so many new restaurants on Kingsway!)  Book a reservation - it gets really busy especially on a weekend evening.  We were lucky to get an early dinner reservation for 5:45 - as well as mentioning that we had to be out before 7 for our show.  Luckily we ordered quite quickly because 2 of the dishes we wanted take quite a while to prepare.  For the 5 of us, we ordered the lamb shoulder and the steak and ale pie.  They warned us that it'll take about 45 minutes to prepare but it was so worth it... even though we had to inhale our food in the end.The lamb shoulder was pure comfort.  It looks overwhelming at first but the portion is meant for 3 people (or a really hungry pair!)   Definitely the dish to get.  I heard from other friends that go regularly that they do tend to run out so get there a bit early if you don't want to be disappointed.  I had a bit of the steak and ale pie and it was delicious.  They change the menu around each day. I'd be interested to try their sunday roast one of these weekends.  Great queen street - you definitely represent gastro pub at its best.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "AGAjytwg3zG7wRunJNtUhg": {
    "date": "7/17/2016",
    "text": "This was one of our favorite places we dined while visiting London! The service and food were both amazing and the atmosphere was even better. Definitely worth trying while in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_aLRZEiL1BSm_xejdeHNA"
  },
  "5sovLGmggU-buk4PqAgMLg": {
    "date": "5/29/2016",
    "text": "I very much enjoyed my experience at Great Queen Street. The decor is super cute, the food was inventive and tasty, and the wine list was top notch. Their wine list really stands out with thoughtful selections, including an orange wine section and a \"pudding wines\" section (for dessert wines). And the service was friendly, knowledgeable, and hip. Standouts on menu: ham hock and rabbit terrine with leeks in mustard vinaigrette, ceps and Parmesan polenta cake, as well as merengue and raspberry custard for two. I did not have anything I did not like, actually, it's just that those items were extra delicious. Would definitely go back if I lived in London. :(",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BSjzOTl7K0eosbJcdxu_Dg"
  },
  "XLOCRC0kGa1yLCE1SZQoIg": {
    "date": "10/15/2016",
    "text": "Summary-- The best food we had in our 5 days in London. My husband and I went to Nopi and Dishoom the first few days, came to Greet Queens Street on the 4th day, love it so much we made another reservation for the 5th day! We totally ordered 6 different dishes and every one of it surprised us! The waiter and waitress were all very very friendly, cheerful, and accommodating. I told the waiter that it's the best meal I had in London, and I really mean it! Love the food and service both! My husband also loves how the menu is always changing, it means the chef really cares about the food they offer! Highly, highly recommend it! And we will definitely go there again the next time we are in London!  Detail-- This restaurant is indeed full of surprises! We went there for dinner and love it so much that we made another lunch reservation for the same week.  At dinner, we had the lamb shoulder  for main dish to share and the potato dish (I forgot the name), pig cheek for starter. The cream with the potato was so good, we (two ppl) finished the whole thing. I'm not good with words so I can only tell you the lamb shoulder was very tender and juicy, the carrots with it was very sweet. We love every single dish we ordered!  For lunch, we had the beef and ale pie. It wasn't usually offered at lunch, but at the previous dinner, the waitress was so nice to help us \"pre-order\" it so the chef can prepare it just for us!  I'm usually not a fan for pie crust, but I love this one!! The starters- Smoked eel salad and the fried octopus (?) was also delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzgMcaZbY6ssdoLuZv-OFg"
  },
  "2nvpdXGxFJ3WOjriBdUlGg": {
    "date": "2/12/2017",
    "text": "Small local place. Excellent food and service. Takes reservations which is nice and a rotating hand pumped ale of the day. Good steak and ale pie.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4l49_Lf442LBO5AfWMkQ7Q"
  },
  "kx4PVkScjxoO1pkAxCcVPA": {
    "date": "7/26/2016",
    "text": "What a quaint laid back restaurant with unexpectedly great food in a central area of town! I had the sirloin with peppercorn sauce and the meat was quality, decently priced and came in a good portion size. Others had the fish (for 2+ individuals) and were very satisfied. The service was also amiable with our waiter engaging in our table's jokes several times and even accommodating dessert orders even after the kitchen had closed!Definitely stop by if you're in the area!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fG9ACC-u5MufRHtt_nqmLw"
  },
  "Aj_kh3RGu7RAM7xL4n1YBQ": {
    "date": "5/12/2015",
    "text": "This was easily our best meal in London.  We were very fortunate to score two seats at the end of the bar on a busy Saturday night.  Service was spotless from start to finish, and the atmosphere was very warm.After trying a few sips of wine, we settled on the spanish red, which was perfect. We shared an app of duck hearts and bacon on toast, which was unique and delicious.  That was followed by the octopus stew and the duck breast.  The octopus was excellent with is it's mildly chewy, rich seafood sauce, but the duck was phenomenal.  It was one of the best plates I've had all year.  Perfectly cooked breast over mushy peas with a side of black pudding.  It was London fare that was perfectly elevated.I wanted to go back for a second night in a row, but unfortunately it wasn't in the cards.  If you're nearby, do not pass this one up.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "imGQirCh-t_Kftb4U7VuUA"
  },
  "RySpndDfR6uPppcXRJzrJg": {
    "date": "10/29/2017",
    "text": "We loved this place. It's run by Spaniards, and they serve a strange melange of traditional British fare with continental delicacies.  The atmosphere is casual and the service was friendly and attentive.  We had the meat pie, which was fantastic, and the fried zucchini flower, along with salad and port and sherry after.  Just a sweet little restaurant run by people who care about food and service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OHvrdMkjt8Av0o27EjbAQw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OHvrdMkjt8Av0o27EjbAQw/o.jpg"
      }
    ],
    "user_id": "pIaOh_mhoYn17ecGx-LE-g"
  },
  "QGOt64nR6Ns5A_kqpQ5vVQ": {
    "date": "12/8/2017",
    "text": "Great comfort food. Very tasty and friendly staff.Eat the Oglet and my wife had the wild mushrooms. Would definitely come back again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivfZIug28k6CanX6BdfNlA"
  },
  "1dDL1cb2HxVYCX5WflHvNw": {
    "date": "5/18/2018",
    "text": "This is a great place. I visited this place some years ago, but I was very pleased and impressed by the food, workers who are very friendly.The price is very convinable for everybody and menu is very rich and diverse.I ate lamb sweetbreads, pea puree and mint and i fell in love,it was taste and very delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hMNUIGLr6H8-KKVNGYJNQ"
  },
  "t8kqNdtBQY9AJ0NO55LpYw": {
    "date": "2/26/2018",
    "text": "Had a lovely dinner there on a busy Friday night. Three girlfriends, we arrived early and the staff were charming and accommodating. We decided to share a table full of starters and GQS did not disappoint: the food was delicious, fresh, creative and well presented. We lingered to the last and were treated with care. Lovely food and wine and a great location. Places like this are hard to find in central London - we'll be visiting again I'm certain",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6lxnYSNtjdNkbbZ5i2kEw"
  },
  "tQ5cSS52So2bxQQIeWG6yg": {
    "date": "9/24/2017",
    "text": "Quaint quality place!  Close to the British museum  so just a short walk for a nice meal before or after!  Delicious food and great service!!!!  Highly recommend and I can't wait to come again!  Also Michelin recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iTuaOt4Zw6ASyWgqxShTEw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Delicious!!!  Pork and spinach with great sauce!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iTuaOt4Zw6ASyWgqxShTEw/o.jpg"
      }
    ],
    "user_id": "I8eSJNf335wZj1njsTNf3g"
  },
  "wfxvT0GuVCZfneJZSXOQBA": {
    "date": "12/23/2017",
    "text": "Food was very good, but service was not. Waitress didn't get our complete order and never came back to check on us. The restaurant was not busy, with customers at only four tables.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WAPdeGQrj7ROfp8HEugKYQ"
  },
  "5p4LiA6a9gViKHSjbjqvbA": {
    "date": "11/17/2016",
    "text": "Really enjoyed my meal here at Great Queen Street. We received a warm welcome and helpful advice on wine choices (I thought the muscadet was lovely) and some very good bread and butter. I started my meal with two delicious oysters while my friend opted for a quince and manchego salad. I'd been hoping to try one of the more \"English\" dishes such as the cold beef and horseradish, which sounded great but my friend wanted to share the Moroccan chicken with couscous and olives. Although it would not have been my choice I did really enjoy it and it was a really generous portion.Only negative was that it took ages and several requests for the bill at the end, but the waiter acknowledged that which I appreciated.Would highly recommend this restaurant for a varied menu and quality, reliable food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "pe88XBjVVPffYsYy-kX69A": {
    "date": "11/21/2015",
    "text": "Suet crusted rare breed chicken pie. The end. Just kidding. Also got the venison and pork terrine. And the quince tart tartine, which we had to cancel on account of being stuffed. The crust is the superstar here. The suet was like a perfectly crunchy top layer and where the crust meets the chicken creates almost a dumpling like belly. Also, I was impressed with how tender the chicken was and had an amazing seasoning I could quite identify. The terrine was also tasty. Nothing really stood out other than the fact that went perfectly with the stewed plumsMan do I wish we would have had room for the quince tart tartine. Overall, what a great, homey, well-executed meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "luVmp2BLheQQGGzPQDwSew",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Venison and pork terrine",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/luVmp2BLheQQGGzPQDwSew/o.jpg"
      },
      {
        "img_id": "9SjNsEsdM-w94XyIi18TZA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9SjNsEsdM-w94XyIi18TZA/o.jpg"
      },
      {
        "img_id": "ZURDyxr57lN_SzCY8Td39Q",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Slice off hockey pie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZURDyxr57lN_SzCY8Td39Q/o.jpg"
      }
    ],
    "user_id": "_W2od_YLTYljq9bb-n-1xA"
  },
  "jcfy94o8BTVwQWrBIMJ6RQ": {
    "date": "10/4/2016",
    "text": "Wow wow wow wow wow!! My friend recommended this place for a nice place to take a favourite couple to celebrate their engagement. I wasn't sure if having such an important event at a never-tried place, but she positively promised me it was worth it. She raced about the pies, as this is one of the few remaining places that does suet crust, and said we could not be disappointed.The 4 of us thought the menu looked fantastic and decided to go for the 6-hr slow cooked lamb shoulder, which serves 3. Of course, I had to get the steak and ale pie, which serves 2, so we had 5 mains to share! So naturally we added chips and gratin dauphinois to our order as well. The smell from the lamb was almost more impressive than the flavour... ok not really as it was to die for, but you know what I mean. The pie was being scrumptious and I owe my friend a giant high-5. We tipped the night with 2 puddings to share, and the super fab staff even gave our engaged couple a glass of champers each. Love love love this place!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tnTabKH9Pt8_m_s3JxXumA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Apple tarte tatin- caramelly and gorgeous",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tnTabKH9Pt8_m_s3JxXumA/o.jpg"
      },
      {
        "img_id": "yhcXCtntmziYE6WXiIqRXA",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Steak and kidney pie with a proper suet crust",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yhcXCtntmziYE6WXiIqRXA/o.jpg"
      },
      {
        "img_id": "J0Cbge0fn1kfiTMQvuvi-g",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Lamb shoulder, steak and kidney pie, chips, potato dauphinois",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J0Cbge0fn1kfiTMQvuvi-g/o.jpg"
      }
    ],
    "user_id": "0i_ybtZGGBbootd7UqBfug"
  },
  "3d-gpB9pJdAVm0B2ecdw2Q": {
    "date": "6/20/2017",
    "text": "The duck for two was ample and tasted great. Small space but the meals came out in good time. Left very happy with my meal.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "axKAjU88XCWvIZUW18sUvQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/axKAjU88XCWvIZUW18sUvQ/o.jpg"
      },
      {
        "img_id": "JuG3BVYgmfzgjbL5GmGDcQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JuG3BVYgmfzgjbL5GmGDcQ/o.jpg"
      },
      {
        "img_id": "_4uTixEh0GryNqewBZgbEw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_4uTixEh0GryNqewBZgbEw/o.jpg"
      }
    ],
    "user_id": "MJ-MD-BTGnirxgIx9AnDZw"
  },
  "5383zvknpmHbq58RAWXBMA": {
    "date": "5/5/2017",
    "text": "Had the lamb shoulder for 3 with dauphinoise potatoes (Iike au gratin). Super tasty and probably best lamb I've ever had.  Curried Chickpeas were excellent as well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "C_AjLRMwiiIDKuwc2w9m1A",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C_AjLRMwiiIDKuwc2w9m1A/o.jpg"
      },
      {
        "img_id": "S1IaOenXmYFdC93VQqkcdA",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S1IaOenXmYFdC93VQqkcdA/o.jpg"
      }
    ],
    "user_id": "a1HsOrvmn-EW4TyNfu2awA"
  },
  "4tq3wxY27loXVPb3TAGZ9Q": {
    "date": "3/30/2017",
    "text": "The steak there was great.  The chicken pot pie was not bad.  The ambiance is nice..intimate as dim.  The service was great!   The nice lady was very personable and even sat down with us to let her know if her favorite restaurants in Paris.  Definitely enjoyed the dinner there.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T_hgGwI358mHKL1K9nCqPg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Huge chicken pot pie.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T_hgGwI358mHKL1K9nCqPg/o.jpg"
      }
    ],
    "user_id": "IWYBJemTgl3kHPm6LP-M9w"
  },
  "hLtc7-Y6AXUOb42N9PKMhQ": {
    "date": "10/11/2017",
    "text": "Really nice place for solo dining. The manager recommended the hake and he was absolutely right -- so delicious. Camped out here for a while with my kindle on a business trip and was treated well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e22rRZRNTHJwJo1JmJ40NQ"
  },
  "GjLwiWjkU05P0880elsVvw": {
    "date": "4/27/2017",
    "text": "Meat pie.  That's all you really need to know about this place.  There are a lot of other things to try at this place, but if you're dining for two, I highly recommend the meat pie.  It's really filling and really delicious.  The booze here is also pretty cheap, so have a few drinks and indulge in one of the meatiest, thick meat pies around.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jNpquKQ-lZNzj2HXd_4PKw"
  },
  "uxcinVMydyCK4kDKQ2_IoQ": {
    "date": "12/26/2017",
    "text": "The menu looked good online but our food was really very awful and the service was worse. I cannot recommend that you go else where strongly enough.My wife I were very hopeful after looking at the menu onine. The appitizer was so forgettable, that I can only remember that it was slow and mediocre. I ordered the steak. It turned out to be so tough and stringy that I could not chew it. My wife's fish stew was equally disappointing.As bad as the food was, the service was worse. The manager for some reason was refusing to seat couples at open 2 person tables. The place is small. There were 3 perfectly good tables open. He \"created\" a new table six inches from the end of the bar, then proceed to congregate six inches away from it with the other staff. He continues this trend, seating couples at the  bar as they arrived. By the end if our meal there were 5  two person  tables open, and maybe 3 additinal  couples eating at the bar. My point, don't eat here unless you love a horrible seat.Our waitress was in explicably absent. There were only maybe 6 to 10 table and 4 or 5 saff. However, they were slow , not helpful, and had a general attitude that they were completely unconcerned with providing a good dining experience.I suggest that you go  else where.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H63C4rboOGjyL17IhFQtag"
  },
  "IUQ7rpBCRHEkGfdFMnK4pQ": {
    "date": "12/21/2017",
    "text": "Lovely, little restaurant! I enjoyed the lunch menu and the atmosphere so much that I went back with a few days later with some friends for dinner. Everyone was very nice to me when I went there by myself and later on everyone in our group were satisfied with the service. I highly recommend this restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2auks77QC666pUJkdhqncQ"
  },
  "LmpzLI6YYjDZIui-MzXciA": {
    "date": "5/17/2016",
    "text": "The best thing about this restaurant is that the menu is always changing. You will never eat the same thing twice here as they adapt what they have to the best of what is available. I frequent this place regularly and I can honestly say I have never had a bad dish.Traditional British prepared game is probably what I'd say they do best here. The service is top notch, although depending on how busy it is, it can be quite slow. It can also be quite loud in this establishment and the tables are close together so you can easily hear other peoples conversations. They do have tables in the alcoves of the windows at the front, which if you are lucky enough to grab those, could be quite romantic. But the deeper you get towards the back, the louder, and hotter it becomes.They also have a spectacular drinks selection, with a lot of home made spirits and cordials. Their homemade ginger mixer is great. Perfect for a mule or dark and stormy. They also have a bar downstairs which is never as busy as I think it should be as it is pretty awesome.Overall - this place is top notch and I love it. It can be VERY busy, so a reservation would be best, or if you can go at an off-peak time.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bdTzsZcoyzKdSz21SX_YyQ"
  },
  "jFKFbcWlp1-LBZAtVqNONg": {
    "date": "4/24/2018",
    "text": "My husband and I have now dined here more times that I can count with various friends and co-workers. He has now been quoted on more than one occasion as saying \"This is exactly the kind of restaurant that I would like to run if I ever ran a restaurant!\" - To say we love this place would be an understatement! It has become easily our favorite place in London because it is fantastic, wholesome, generously portioned food that changes with the seasons and yet delivers consistently elevated flavors every time. The ambience is casual or even intentionally rustic with beautifully worn exposed wooden tables that allow the focus to be on the food and the company instead of feigned refineries. Though they take reservations, we've never had trouble getting one on short notice. The staff is wonderfully well versed in the menu and make recommendations readily. They are attentive and friendly and serve everything with the same care that you imagine they would in their own homes. On one occasion we ordered far too much food (as they have many Main options that are portioned for 2 or 3 people and in our efforts to try everything on the menu, we have issues with moderation) and three waiters worked quickly to pack up an embarrassing amount of food for us to take home. We ate like kings for a week!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "naYgsb4PSJb7sBqwoPWlgg"
  },
  "4mFcTfFZPRt1m6k6_w2UTw": {
    "date": "9/18/2017",
    "text": "We ordered duck ragu, chicken pot pie, amaretto sour drink and raspberry prosciutto. All was great! Our waitress Ana was very helpful and sweet. Overall was a great way to end our last day in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzBmEfvx5YW54DtHPGIyKg"
  },
  "gMce1qhtXmv07Pn-midTDA": {
    "date": "8/4/2018",
    "text": "Four star dinner with one star service. Had a reservation at 8:30 and arrived at 8. The bartender was kind enough to greet us and let us know that our table was available already and seated us. After about 15 minutes of sitting, she came back and apologized, brought menus, bread for the table and a carafe of water. She didn't ask a about drink orders and I figured she'd be back soon. 20 additional minutes later, a waiter who had been taking care of nearby tables approached and quickly asked what we wanted. No greeting, no apologies, just quickly tell me what you want. We ordered drinks and all of our entrees at that time. The drinks arrived quickly and the food soon followed - they were all brought by runners(not our waiter -Sebastian) Excellent rabbit, wonderful blood sausage. But- we never saw our waiter again until he showed up at 9 and asked if we were done. We had all been planning on a few additional cocktails and beer, but by then, our drinks had been empty for 20 minutes and we just wanted to leave. He quickly brought  the bill, ran it through the card machine and tore off my copy without a word. No smile, no thanks for coming, nothing. We just spent the last week in Paris where we were treated very well by the servers- I expected London to be superior, but just found this to be the least welcoming server I've ever had. Go for the excellent food , but not if you expect to be treated well.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Me7QnXS2yKcOw2Ku8JFb9A"
  },
  "jw-RQtS6kbZqUy9TlmB2Tg": {
    "date": "12/11/2012",
    "text": "Lovely place with great ambiance. The steak was cooked to perfection. On the whole an ideal place to have your meal.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xqtgbDovxnAMgOXo5m7bgg": {
    "date": "7/7/2010",
    "text": "Had a wonderful meal here with some friends who were on honeymoon - wanted to take them somewhere super brity, and Great Queen fit the bill.  The casual atmosphere and flowing beer led to a night of great conversation, an amazing meal and hopefully a relaxing start of a wonderful honeymoon for our friends...We started with an order of shuck-yourself fresh peas, yogurt & cucumber soup and a rabbit terrine.  Right in season, the peas were sweet and delicious, the soup was fresh and tasty, and the terrine was firm but spreadable - this was my first terrine, and definitely not my last in the following months...but definitely one of the best comparatively.For our entree, we all decided on the veal shin for 4...which, let me tell you, was at least enough to feed a small village, and worth the 25 min wait.  The veal was presented on a huge serving platter, and after we all stuffed our faces, barely looked like we dented it.A side of roasted new potatoes completed the meal and left us all waddling out, sated from meat & buttery potato deliciousness.  We also left with a 2lb bag of leftovers that made excellent sandwiches the next day!  We will definitely be back again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5vIBambONbnPpZysS8W1fA"
  },
  "hOWgZvqrF9ENz2P3Z6MlTA": {
    "date": "3/27/2010",
    "text": "This a great friendly venue for some good honest dining, in the tradition of the english gastropub. You will have read it all in the other reviews but I wanted to add that it's not all meat'an'game, the fish courses are great too. I had a deliciously moist lemon sole with wild garlic butter. The flesh was cooked to perfection, falling off the bone invitingly. And although I was a little scared the wild garlic would completely overpower the delicate taste of the fish, it actually made for a great companion to the sole.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uAZrBr-qfO9HbQo_LuEnqQ": {
    "date": "3/11/2010",
    "text": "Fun place - interesting British dishes such as pig's cheek, guinea fowl and a few Euro ones like lomo. I liked a lot - the good points are the decor, general warmth, reasonable wine served also in 375ml carafes, unusual range of food. The smoked mackerel and beet starter was seriously good. The pumpkin pasta less so... but then my more \"meaty\" friends relished the rabbit medallions and aforementioned pig cheek. Go, but take a serious carnivore with you.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YGLRJ5ToffiODo5zC5FYIw"
  },
  "tEcf5O9oyrg4lnSyHxeRow": {
    "date": "8/1/2012",
    "text": "I just don't know what to think Nice venue and atmosphere. Starters were a bit lacklustre I think, for the price. Plate of sand eels, basically just like whitebait. Cold peas straight out of a very chilly fridge, some were really not that fresh, cold soup. Mains were good but portions I found a bit meagre. Had to order new potatoes and greens (just cabbage) separately, small portions again. It was very good food, I had the duck with fennel, carrots and bacon. Honestly, I think I have had better, more flavoursome meals for the same price. This dish definitely needed something. Something to go with it, some sweet potato, carrot and swede mash, some real bulk. It was beautifully cooked, and tasty, but just atop a small bed of vegetables.I found the young waitress just a bit rude and a touch patronising, I am sorry to say. I was with a bunch who are a bit old and past it, and they are hard of hearing and a bit fussy, I found her not all that patient. So sorry to be writing this review after reading so many others. I wouldn't return here. I'd like to give this place a 4. Consider this a 3.6 out of 5.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLemW70cdBvhmQalAVoJXw"
  },
  "UPROIQV39yf5jXQE79S0IQ": {
    "date": "12/4/2009",
    "text": "[Non-photo Review] For full article, see: wp.me/pwXBH-uP  Long Live the Queen I had been looking forward to meeting fellow food blogger Craig Linton (twitter: @craigdlinton) for a few weeks after I invited him to meet up for lunch a while back. Luckily, I wasn't too nervous as I had already met another food blogger a few months back for lunch (see a post about that meal here). Although it is always a bit disconcerting meeting someone you've emailed and tweeted with but never met in the flesh, I had the sneaking suspicion that we were going to get on, given our seemingly similar attitudes towards restaurants and food, which are of course the two most important things in the world (Mrs. LF is going to kill me if she reads this). So, in the middle of our two places of work, Great Queen Street (GQS) awaited. The little sister of some British gourmets' favourite (and I cringe as I write the word) 'gastropub', GQS has no real name, no website, and no gimmicks. It is all simple wood and dim lighting inside, with informal but fairly knowledgeable staff. Like so many London restaurants today (St John and Bocca di Lupo spring to mind), the daily menu is presented on a loose sheet of paper, inferring that the menu changes daily and is probably more or less seasonal. And GQS checked all those boxes. The menu was quite traditionally British, and the simple, hearty fare sounded good to me as it had been a rather long and cold walk to get there. Unsurprisingly, I arrived on time, and was shown to a little square table for two, where my blind, male food blogger date was to join me. It was all a bit weird, but luckily I had seen a photo of him online so more or less knew what to look for. A bit over-anxious, I waved haphazardly to the next dude through the door based on just the faint outline of his face, who luckily happened to be the man himself. Phew. After a long and enjoyable getting-to-know-you chat, we were scouring the menus like to men on a mission, trying to make wise selections in the presence of the seasoned foodie across the table. Decisions made, we continued with a very engaging and pleasant discussion, until the thing that united us finally arrived. Grub time. Getting Down to Bi'ness Some brown bread and butter had arrived, so we both had a small piece of it. It was pretty average and there's nothing much more to say about it. I now eagerly awaited my main. 5/10. I had heard a lot about Old Spot pork but had never knowingly tried it, so despite some reservations about a room temperature dish (that's how they serve it) on a cold November day, I went for it. Luckily, I was not disappointed. It was a very simple dish with three main components. The pork was sliced to a medium thickness and the circles of fat were left in tack around the rim. It definitely had a unique full, round, mouth filling flavor that I hadn't experienced before. It was surprisingly interesting and had me going back for more, especially when combined with the tangy yet slightly sweet and in-season crab-apple jelly. Because the side of greens we ordered was so delicious with its naughty, slightly creamy mustard sauce, which had a nice streak of acidity, I sort of ignored the little salad that came on my plate. This was a shame, because when I tasted it as an afterthought, I found it was actually quite good and it would have been a nice little accompaniment to the meat and jelly. Overall, then, a simple and accomplished dish. 8/10. I had ordered a glass of Beaujolais to go with my pork, thinking a soft, easy-drinking fruity wine would marry well with the flavors. It was brought out in a little ridged tumbler (like a small water glass you get in a bistro), as was Craig's Portuguese red, which I thought was taking the minimalism a tad too far. It's okay to serve wine on tap into a glass like that (like a place I went to in Venice once called Da Marisa), and Beaujolais after all is a very casual wine drunk with simple food in France, but I like my wine to breathe a bit and think a normal little wine glass would have been better. Rants aside, the wine did what I hoped it would and was a nice sipping partner for my late Old Spotted friend. It's worth noting that before tasting my own dish, I was quite jealous of Craig's main course just on the looks. It reminded me of the hearty beef stroganoff my mom used to make us when I was a teenager. Luckily, he didn't think I was a complete freak when I asked if he wanted to taste some of my dish, and even offered up a bit of his beef. The meat itself was very soft and tender, having been stewed for a long time, and the sauce it was bathing in was not bad at all. If I had to label it, I'd say it was sort of a European beef curry sauce, with its richness being supported and enhanced by a nice underlying spice (the 'devil' bit, I supposed) that ruminated and lingered in the mouth for a good while. I didn't taste the rice or the egg, but the bit of meat and sauce I",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FCufXK4_cfulnHIG7lxoDQ": {
    "date": "6/6/2011",
    "text": "alright.  i'm home sick, and believe it or not i'm actually tired of watching svu episodes so i suppose i should catch up on reviews.  that said, i'm highly drugged so i can't promise my usual wit.after a 3 course dnr lunch at the ledbury, and 6 hours of solid eating and drinking i nearly yakked when i saw the allegedly 4-5 person lamb shoulder at great queen street.  it's really more for 6-7 and we failed to account for the presence of a vegetarian among us.  smoked mackerel starter was a standout, and potatoes dauphinoise, which i'm sure are just as cream-injected as any other cheesy potatoes, somehow seemed pleasantly light.  dunno how they did that.  the main dish of course, was the main dish: a 24 hr braised lamb shoulder (i remember thinking it was incongruous that we were like: 24 hr braised lamb shoulder please, and they were like: that'll take about 45 mins. . .but i later used my sophisticated understanding of mathematics to deduce that they probably braised it for 23.25 hours prior to our ordering of it), melt off the bone, swimming in meat juice.  i can't wish i hadn't eaten as much earlier, because lunch at the ledbury was awesome too, but i guess i can say, i wish i had replacement stomachs for days like this?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXdQAY8Jk0hszzzFSdqsIw"
  },
  "-Xk1IUaL1WAiZb2mhRh-Zw": {
    "date": "12/8/2010",
    "text": "The three of us decided to eat here before heading off to the ROH. We told the staff we didn't have a lot of time to spare so they made an effort to get our food out fast. Unfortunately by rushing, they ended up giving us half of someone else's order by mistake and before the waiter could grab the plate to correct the order my daughter was already digging into the daube of beef. We also had the plaice and the lamb neck. instead of the kale we ended up with brussel tops and some roasted potatoes. I didn't mind since I've never had brussel tops before and they ended up being pretty damn good. My favorite was the lambs neck. The meat was tender and juicy and I had to steal bits when my wife wasn't looking. I had the plaice and it was the best fish I've had in the UK so far. The daube was decent but there were other things on the menu I'd go for before ordering that again. Overall despite the mistakes it was a great meal, cozy old English atmosphere, and definitely made my list of go-to places in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZpNMuBHUj--ymOho29maw"
  },
  "j-bcUyhCQzptSnsjVJpqvA": {
    "date": "3/7/2008",
    "text": "The steak was phenomenal here - nice cozy restaurant with decent wine. The salad is uninspiring, but the service is good and its a nice simple place for a meal, although it can get expensive",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "S8BxY4Zjoq5kMR1c9JgmUA": {
    "date": "3/10/2008",
    "text": "this is a great relaxed eatery serving modern british cooking of a very good gastro pub standard. Not too pricey and a great ambience in the place. Everyone i went with thought it was lovely.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "j_49n3KB7RGNd2J2TOJMrw": {
    "date": "9/26/2018",
    "text": "You know when you pick a restaurant and after the meal you're just like \"NAILED IT!!!!\"? Well, this is what happened here. The whole time I was thinking \"Wow, I really picked a great place\", and it wasn't just the prosecco. I've had this place on my mind for a while and we were going to see the ballet afterwords so this location was really good. So much had to do with the ambiance. I'm not sure what it was. It was just cozy and sweet and the tables were far enough apart where you didn't feel like people were too close but the tables were also small enough so you could hold your partners hand and the lights were pretty dim and the place was pretty small so it felt intimate but again not to squished. I was a huge fan of the menu because it had a lot of options (especially for us fellow pescatarians... yeah, I'm pescatarian at the moment ;) ). The star of the entire meal was the entree- sole with leeks and potato. We shared it and the portion was massive and so delicious. Really, that fish was mighty tasty and the sauce and seasoning complimented it so well and the addition of the potato and leeks was important to counter balance all the saltaaayyy. The other dishes were also delicious. Trout with pickled cucumber, salted anchovy salad and burrata with asparagus. All in all it was just a fantastic meal with great ambiance. I'd definitely come here again.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UKvyLnnKVS3t0aaFF9k-_w",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Sole with leeks and potato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UKvyLnnKVS3t0aaFF9k-_w/o.jpg"
      },
      {
        "img_id": "wsUtS_c3ScHEvOayySaSkg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Potted trout with pickled cucumber and toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wsUtS_c3ScHEvOayySaSkg/o.jpg"
      },
      {
        "img_id": "FCLPFGy4RuWg7LZcCCO2Jw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Salted anchovies with salad and egg",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FCLPFGy4RuWg7LZcCCO2Jw/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "XWesYeyWy6PZ9_vzD_D0eg": {
    "date": "6/12/2018",
    "text": "- pork loin was cooked perfectly, very tender, slightly pink- quail was enjoyable but difficult to eat, basically impossible with a knife and fork (but to be expected with any small bird) - ordered the warm chocolate pudding (which for americans is just chocolate lava cake)- orange sorbet w/ shortbread was light and refreshing with soft vanilla finish- recommend: lemonade- service was pleasant but neglectful - honorable mention to the downstairs bar- DO NOT order the orange rose, strong bitter finish that persists",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pk5pWlKt7GkDUDtaSYb-NQ"
  },
  "G5dgC5BjbOlc2vvuvngYpA": {
    "date": "6/8/2018",
    "text": "What an amazing dinner experience! Great service, delicious food, and a unique interior! Large tables make it great for groups! Why I was here // my party of 7 were looking for a nice dinner place to end our day of sightseeing in London. Service // welcoming and attentive. They checked in often and were very helpfulAtmosphere // since it was dinner time, the ambiance was more funky lit. The interior was unique (very old timey feel) Food // omg everything about this dinner was great! - homemade ginger beer // 3.00 // yessss this was amazing! Love the strong kick of the ginger -appetizer // whitebait with mayo // sauce wasn't bad but I am not a huge fan of whole tiny fishy fish-appetizer // salad // also an interesting dish but very tasty. It seemed to consist of eggplant and asparagus over a nice cheese - main // suckling pig // super yummy! The outside was crispy and inside although slightly dry was still bursting with flavor. The sauerkraut and veggies paired well. Note that this dish serves more than one person. -main // lamb shoulder // super tender, melt in your mouth with tons of flavor! Served with potatoes gratin, this one was my fave! -note that this dish was for more than one person -main // quail // very tender and sooo good! Overall // this was the English feast that I dreamed about. Wish I could have tried dessert but I was so stuffed I couldn't have stomached another bite.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 4,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "_UUlTX2tcDpGe4fJnS2zXQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_UUlTX2tcDpGe4fJnS2zXQ/o.jpg"
      },
      {
        "img_id": "_SCt9Mjnu1MjmSwWeYwcnw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_SCt9Mjnu1MjmSwWeYwcnw/o.jpg"
      },
      {
        "img_id": "LTkwjCfNr14nD02Hs3pGEQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LTkwjCfNr14nD02Hs3pGEQ/o.jpg"
      }
    ],
    "user_id": "N8pDUHsa29bS3_P-fWFebg"
  },
  "dnyvaikzMllornLGq-Tuzw": {
    "date": "9/16/2018",
    "text": "Loved our dinner at great queen street. The waiter helped us select items as British food was new to us. We shared the chicken tarragon pie, warm rabbit salad, and stuffed croquette. They also had an extensive wine list. I would love to go back and try more items on the menu. Great place to have dinner in London!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lk3sSgKRRUfgOWUqprIeog"
  },
  "bvYPVz9IUmvqWKE0ZPBL_Q": {
    "date": "12/8/2017",
    "text": "Hands down the best dining experience I had in a week of eating out in London. This place was spectacular. We were very lucky to get in without a reservation, as we came right at opening time for an early dinner. What made this meal special was that even the small touches were so well executed.The menu is daily, changing depending on what ingredients are at hand, which is always exciting. That sort of rustic, farm-to-table mentality is seen throughout out the menu. We started with the warm eel and sausage salad. While this may sound strange, it was fantastic. The eel was perfectly smoked, and the sausage was very flavorful. It all came together beautifully with a tangy vinaigrette.For mains, we had the duck with lentils and seafood stew. The duck was simply to die for, perfectly medium rare with crispy skin, on a bed of lentils with a very tasty herb sauce to spice them up. I would highly recommend whatever the duck main on the menu is, as they really nail cooking this protein. The seafood stew was decent, but nothing too special.For dessert, we split the giant apple tartine with Calvados ice cream. Mmmmmh! Definitely worth the ~15 minute wait as it takes to a ooey, gooey perfection. It was beautiful to look at, and even better to eat. The Calvados ice cream was excellent on top too, and was strong enough that the whole tarte was flavored with spirit. A beautiful combination.They also have an ever changing house beer/ale, which was a nice touch. There's a varied alcohol selection, for whatever budget, including plenty of £100+ bottles.If you're in central London, head to the Great Queen. Or better yet, get a reservation in advance. You won't be disappointed.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "p0NEvB2D-t-JBpxEB-LbMg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Apple tartine for 2 topped with Calvados ice cream. Brilliant combination!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p0NEvB2D-t-JBpxEB-LbMg/o.jpg"
      },
      {
        "img_id": "WacXaIIDT56T8Rn0_ttM0w",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Perfectly cooked duck on a bed of lentils. Fantastic.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WacXaIIDT56T8Rn0_ttM0w/o.jpg"
      }
    ],
    "user_id": "sbwfBzEWBMRPbrk7DRUrXw"
  },
  "bBCHXUaPuMa6uaQbuIWZvw": {
    "date": "10/29/2018",
    "text": "I had the Halibut with pureed fennel. The Halibut was the best I ever had.  My wife had Quail.  She loved it.  The salad dressing on the green salad was superb.  The service friendly.  Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wm5csd5yUOLhh-eQXDDvJQ"
  },
  "ZdCXDzRJTQ0aFuNQ3C36EQ": {
    "date": "9/28/2017",
    "text": "Cozy and intimate place in Covent Garden with dim lighting, lively conversations and great food. The service was attentive, and waiters were great at recommending the right dishes.The razor clams with chorizo was perfectly cooked and beautifully decorated. I found it to be a tad salty, but that came from the combination with chorizo. The veal special was tenderly cooked to perfection. The meat was easy to cut and had the right flavor. The German pasta was lightly fried and very doughy. The beignets came out piping hot, were coated with sugar and came with raspberry jam and cream. I can see how this is be a crowd favorite!Overall a solid place to stop by. There's a cellar bar tucked away downstairs, which looked like the perfect place for date night.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Uhwy709Ry5TJWx62hnJMCg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Beignets with raspberry jam and heavy cream",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Uhwy709Ry5TJWx62hnJMCg/o.jpg"
      },
      {
        "img_id": "srvVFSQ3azKK0C5s44w0VQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Razor Clams with chorizo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/srvVFSQ3azKK0C5s44w0VQ/o.jpg"
      },
      {
        "img_id": "MOwH3jVZsdO2FmUuVjKsbQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Veal Special with German pasta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MOwH3jVZsdO2FmUuVjKsbQ/o.jpg"
      }
    ],
    "user_id": "J_NZejScaR5_D6LerjASew"
  },
  "u18RgGZ3d1jiS8L0fOE67w": {
    "date": "3/31/2018",
    "text": "This is an interesting spot... the menu is definitely off the beaten path. After receiving such high reviews I was immediately deflated with my pick when My husband and I sat down to the menu. There were very few items on it that I saw Yelplisted, I'm sure they change it up frequently, but it was still a shocking selection. My husband and I had the house red wine (good but sweet) and a Manhattan (too much vermouth). We were struggled to find something we'd enjoy on the menu but settled with ham and cheese croquettes which were good, and for our entree we went with one of the shared dishes (we saw it go by and it looked beautiful!)- roasted oxtail with risotto. The ox was subpar, the inside pieces were moist and delicious. The outside bits were quite overcooked and dry. I will say with whatever chutney they had on top and the risotto, every bite could be delicious, but on its own, the ox didn't stand up. The service was odd - it didn't seem like we had a dedicated server and even though everyone seemed to be serving us, we felt neglected. We sat with empty glasses for quite a while when we first arrived and then again between rounds... including water.One of our servers saw us struggling with the menu and made no attempt to offer selections.I made a reservation as suggested but the place had plenty of seating - it was a week night though. I wouldn't recommend this restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfEQQSc3WA1cjZZfZ530RA"
  },
  "EXlmAcUWlB-c7F5relvTAA": {
    "date": "4/30/2018",
    "text": "This is a very nice restaurant. We accidentally found it while strolling around. I believe most people made reservations but we were glad that the gracious host gave us a table too.The food was fantastic. We ordered two appetizers,  a Pork & Game terrine and a Stuffed Courgette. We were surprised how delicious they were.As for the main course, we had the Steak & Ale Pie for two. It was huge and can easily feed 3-4 people instead of just two.The pie had great chunks of meat with a hearty ale sauce. Absolutely delicious and very tasty. Too bad we over ate and did not try the desserts. We would definitely come back to this restaurant again the next time we are in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GYJ8-1CRLEoUmAs2eGeVnQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. The Steak & Ale Pie for two with chunky meat and ale sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GYJ8-1CRLEoUmAs2eGeVnQ/o.jpg"
      },
      {
        "img_id": "P3o_3YVhKPZDsJs0R4a87Q",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Steak & Ale Pie for two",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P3o_3YVhKPZDsJs0R4a87Q/o.jpg"
      },
      {
        "img_id": "eK7uWZiwU4ywmk7kLLXmbg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. The Stuffed Courgette",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eK7uWZiwU4ywmk7kLLXmbg/o.jpg"
      }
    ],
    "user_id": "_po5iLWs-OQ6D_bsi2nFnA"
  },
  "PhtktmiGsleUPTS2ySgubg": {
    "date": "10/16/2018",
    "text": "It was intimidating at first.  The menu is very, very \"chefy\".  Weird names for things that actually turn out to be pretty normal.  We sat at the bar and the bartender was busy but tried to be attentive.  We had the Chicken pot pie ( I don't remember what the fancy name was but essentially that's what it was).  It was good.  Really didn't need to call it more than that but somehow they felt they needed to do that.  Wine was good.  overall, nothing special but good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAPN_E-LbDnbv_LAj5mzuA"
  },
  "ZsukyWm3x50Z2KP5MKTTXQ": {
    "date": "10/27/2018",
    "text": "This was an amazing blend of bar/ comfort/ bit fancy restaurant-bar.  The chicken pie for 2, dessert and drinks were spot on, but the fried artichoke app was disappointing.  I would love to go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nk8z7b-JpvYs0foWY6bzQ"
  },
  "3Td2QfgV4ApOowvtpk2eWg": {
    "date": "8/1/2018",
    "text": "Best pub food I've had in London. High quality and modern twists on the classics with some fresh options like salads. Great service. I recommend making a reservation since it's small with only a few tables.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuRZJ2Xa6JDPVVXdlt6DJA"
  },
  "Ipx3MI9GClJl8xabQRGwDQ": {
    "date": "6/1/2017",
    "text": "We called at 6:00 pm on a Friday and were able to get a table for 4 at 9:30 that evening. Slightly disappointing at first because 3 or 4 menu items were already crossed out upon our arrival (like the mussels) but things went up from there. The steak and ale pie is A-M-A-Z-I-N-G. If you're a foreigner wanting to try this delicious British cuisine I could not recommend more. Definitely needs to be shared between 2 people but it tasted like a delicious slow cooked beef stew cooked inside the perfect homemade biscuit crust. It comes out piping hot!I also had the seafood ravioli which were a solid 4/5 but nothing compares to the steak and ale pie.Service was attentive and the food came fast. Definitely recommend calling and making a reservation or coming and trying to find a seat at the bar.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "lhfBYKIUPIB2M7U-Q97BHw"
  },
  "Q72wTGIOLUWpdX9ZEGriiA": {
    "date": "4/25/2017",
    "text": "GQS is a pub, or more accurately the very definition of a gastropub, taking pub fare and raising the quality and flavor level to make even tea-totalers come for a visit.The short rib pot pie was amazing. I don't even eat short rib, but I couldn't help myself when I saw someone at the next table order it. Everyone else loved their food too. Seriously, all the plates were scraped sparkling clean.Even better, it's in a great neighborhood in case you're interested in a pint or two before / after dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "rVHSNa7tzfz4L0J4YqyjvQ"
  },
  "GwarG8VkkVlvGEQXJdxJtA": {
    "date": "9/28/2016",
    "text": "Yummy eel salad, fish and dessert. Ordered the chicken pie as we saw lots of positive reviews.we all thought it was OK..the crust was pretty burnt hence  that was a little disappointing and the quail was nothing special. Overall, good meal.some things could have been better to make it amazing.Choose wisely, have an amazing meal. :)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "yg09asXp55R1YWUvVLW1kg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Sea bass",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yg09asXp55R1YWUvVLW1kg/o.jpg"
      },
      {
        "img_id": "QgcE2hWAPeyB2BW7J9ARlg",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Chicken pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QgcE2hWAPeyB2BW7J9ARlg/o.jpg"
      },
      {
        "img_id": "KWjgBjT4L41Q3TF-UMUAtw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Quail",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KWjgBjT4L41Q3TF-UMUAtw/o.jpg"
      }
    ],
    "user_id": "NhERs5jY_W3BF7FAA3XzXg"
  },
  "5HZfRubmH9rfJuqlPuQkag": {
    "date": "12/11/2017",
    "text": "Simply delicious. While in london our tour guide joked that british food wasn't all that great. I have to disagree! Queen street was definitely our favorite meal while in london! We got the braised lamb which was fall off the bone and say so perfectly in sauce and sauteed kale and mash. I got the ricotta dumplings baked in a dish of mushroom tomato sauce. The ambiance was great, cool laid back and packed! We ate at the bar. We were shocked that not one person was on their phone while they dined/conversed. So refreshing! Dessert was amazing, even though we were full we ate the entire slice of strawberry tart. Moist soft buttery crust with sweet slightly tart (in a good way) strawberry filling in the center. Would definitely come back on our next visit to london!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j8MYJYM8jWMGxl38BVeuAQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j8MYJYM8jWMGxl38BVeuAQ/o.jpg"
      },
      {
        "img_id": "TySOP73g1yfYv9Ra4-OBpw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TySOP73g1yfYv9Ra4-OBpw/o.jpg"
      },
      {
        "img_id": "SIGU-pui_LArlQBPymSWPw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SIGU-pui_LArlQBPymSWPw/o.jpg"
      }
    ],
    "user_id": "cF9Tuv4lrkWSwjpE_GUdYQ"
  },
  "zi7mf07_TMVF5e6cs5RSGg": {
    "date": "7/9/2018",
    "text": "Cute restaurant with great food and service!  The chicken pot pie was amazing!  Also got the beef and risotto - very good!  Fast service!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a2MsmKPlH7rgf62J-f3b7g",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a2MsmKPlH7rgf62J-f3b7g/o.jpg"
      }
    ],
    "user_id": "5_RALs8RPZudfLDu5dnvFA"
  },
  "AwojEngw78i2NjmqLR1i4Q": {
    "date": "12/18/2017",
    "text": "What a neat little restaurant that's off the beaten path. Their menu is eclectic and fresh, the service is wonderful, and the interior is gorgeous. Their bathroom is down some very narrow stairs so if you have any mobility issues be careful! Overall we all truly enjoyed our dinner here and highly recommend it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yQT09Ej-B4GN2dtnxAZ0Cw"
  },
  "skmOJ-wLn7l31G4HBQoEJA": {
    "date": "3/16/2018",
    "text": "Came here last night hoping for a bit of good old nostalgia. I had been here about 10 years ago with the man who is my husband now.Great Queen Street was a quite upmarket pub then, and we shared a rather good chateaubriand. Sadly this is now a less than average 'gastropub' serving a variety of mediocre offerings. I had the potted shrimp to start, which was ok, albeit a large portion. The other half had the mozzarella which again, was huge, and he said was drowned in mint.Next I has wanted the chicken pie, but that was only for two people, so in the end we both had the pork Milanese. It came with picked red cabbage and pea purée. The cabbage was sickly sweet and was choked with cinnamon, and the pea purée overwhelmed everything. We ordered a side of chips which were dry and tasteless. I asked for a glass of prosecco on arrival, which I had to send back because it was horribly sweet. They didn't have any other variety and wouldn't sell champagne by the glass. We shared a bottle of ribeiro de duero for £36 which was fine.Service was good and prompt. The place filled up quickly as the evening progressed and the atmosphere was good, although they did place all the diners together in the centre of the room. The tables are a bit too close; the back of my chair was touching the back of the next person. Disappointing. I won't return.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DwgoefLg51quf7saVqcTHg"
  },
  "tVv9rzfnDZm7ejTdAMy8Pg": {
    "date": "3/17/2018",
    "text": "When have you ever been told that you have to pay for a bottle of wine that was bad? It happened to me at Great Queens Street. Although it was one of my favorite restaurants in London, I'll never go back due to the arrogant and unaccommodating service I received on March 8,  2018. I will try to make this short.I live in New a York City but I am in London often. On that evening, we were a party of five with 7:15 reservations. I ordered a bottle of wine which, when it came, was sour. I asked the waiter (who was lovely throughout) to please replace it since it was sour. He came back and said he could not. I asked to speak to the manager. Someone who said he was a \"manager\", and who would not give me his name, came and said that the wine was not corked. I told him I knew the wine was not corked; I had said it was sour, not corked.  He told me that it was an organic wine and that that's the way it tasted. I explained that I knew wine and that the wine was not supposed to taste that way. He said it was, and that I was wrong. I ordered different wine which was fine and the evening proceeded nicely. When we received the bill, we were charged for the first sour bottle of wine, along with the additional bottles we ordered, plus a service fee. I went to the \"manager\" and said that I would pay for either the sour wine, or the service fee, but not both. I also said that since he was so unaccommodating, if I had to pay for the wine, I would never return to the restaurant. I explained that I am a qualified sommelier (absolutely the truth). He nastily responded, \"Good luck with that.\"  He further said that he would prefer if I didn't pay the service fee and never returned. He would not take the sour wine off the bill. I was not offensive, confrontational or abusive. But he was. Awful treatment, awful customer service, awful way to run a business!!!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhpbBAhtvMNun8vhlKH_DA"
  },
  "iT6ajLFlTTXuJ8m4nffMHQ": {
    "date": "10/11/2012",
    "text": "Always have a wonderful meal here! Even my parents insist we eat here every time they visit London (and it's very hard to impress my parents to that level when it comes to food!)Would recommend this to everyone. Got to come and try it out!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "541jycVFzlGt9yL4co4HBw": {
    "date": "8/10/2009",
    "text": "We went to Great Queen Street for Sunday lunch.  We were expecting a crowd based on reviews we read, but were surprised to see that plenty of seating was available.  The Sunday lunch menu is limited, but everything available is simple and quite nice.Very, very friendly staff.  The bloody mary was delicious and spicy.  If you're a tourist, please don't foolishly leave because there's no fish and chips!  Stay... you'll be glad you did.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gRc9-suom7ptcEEOmemyjg"
  },
  "yoxH1QQ9ZZimpHfg5_I0KQ": {
    "date": "2/23/2010",
    "text": "All these reviews made me feel I'd be missing out so Friday night was the perfect time to try this restaurant. It's on a street full of tourist type restaurants and I must have walked past it many times as it looks so unassuming. Once inside there's a lovely casual vibe and despite it being a busy Friday night we weren't rushed along at all. The staff were polite and friendly and it just had a really great, people out with their friends having a nice dinner kind of vibe. We tried the beef for two which was fine, but I think I need to remember beef != steak as it wasn't quite what I was expecting. The menu was full of gorgeous sounding stuff that I can't wait to try though. I'd recommend the roast veal as a starter. Will definitely return.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v5CXppwApu9GFUHr8tR__w": {
    "date": "3/19/2010",
    "text": "This is the sister restaurant to the Anchor & Hope on The Cut, and home to traditional British cooking  gamey, heavy, and tastes like what is on your place was jogging along the hillside just hours before  it probably was. Great for relaxed Sunday lunches or chilled out dinners with friends  superb British cooking with pates, soups and terrines to start, and fresh fish or meat as a main. At the Anchor & Hope version we shared pheasant and rabbit; at 32 Great Queen Street I had tasty pig's cheeks and El G had lamb's neck which looked like it had been guillotined off there and then. Some of our friends ordered the beef rib between six and got half a cow on a plate, cooked to perfection, a slab of rare beef with blood swimming round it. The boys were drooling a la Homer Simpson and someone mentioned the meat sweats  the sort of food I'd imagine served in a country mansion after a hunt years ago. Something your dad or boyfriend would love, and they were super nice to my veggie friend too.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LSog0cCZD6bSuC1_EQ-_YA": {
    "date": "11/8/2009",
    "text": "I'm embarrassed to admit I just discovered this gem of a restaurant. I'm in the area all the time (actually walk by it often), and have cruised right past this place en route to less delicious meals. The snails and bacon on laver bread was delightful and something that I hope stays on the menu permanently. The ribs shared with two mates (none of us little men) were gorgeous too. The beer selection and wine list were inspired. The Manhattans had at the bar at the end of our meal, excellent. When can I go back? Service was efficient and friendly and upfront.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "wzA9IDKpYUzHtPcturThMA": {
    "date": "6/21/2011",
    "text": "Ate here based on the good reviews on YELP and was disappointed.  It was by far the worst place we ate in London, including the kebab place in Hackney.  The staff was nice and helpful but the food was not that good and was very expensive.  This is not the place to go if you are in London looking for good pub food.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMYKYUzsqkMMigFWCfA4Ow"
  },
  "ecPgL-sW6AlyCOE7OBiizQ": {
    "date": "8/23/2009",
    "text": "Went on a Tuesday night with my two of my foodie friends. Our reservation wasn't until 9pm but we were starving so we headed downstairs to the bar. DO THIS! The bartender was incredible. We had some good beers and he made several recommendations, checked on the specials for us, and explained every item on the menu. By 9pm a lot of the food choices were gone so I would suggest making a reservation and arriving at an earlier time. Do not think that because you are at a nice place they are not going to feed you well! Abandon all ideas of little plates and be prepared to eat hearty heavy food- rabbit pie, pig's cheek, chicken pot pie, potato soup, lamb shoulder.We had the lamb for two. This neck flank could have fed three easily. It was so tender and juicy. I am a big fan of lamb and this was incredibly tender, fall off the bone, melt in your mouth heaven. Only one can imagine what the 7 hour lamb shoulder tastes like.It is loud, fun,crowded, friendly, dark, young, hip. Not too expensive. Wait staff amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFsi1fQfaFzeoO--xuz4FA"
  },
  "X5s0v71CO3JTeUJCrvvXhg": {
    "date": "8/7/2011",
    "text": "Great, attentive staff combined with a talented kitchen and a believably-authentic British menu. I had the pigeon and snails, a dish I would not have considered elsewhere. It was good!A great way to finish a fantastic visit to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uo9Ayh46T08UAIGnsedgyA"
  },
  "KmMXgG80NF_K-oky8I9CRg": {
    "date": "7/2/2013",
    "text": "This was either a Yelp let-down or I am just not that into British food, your pick. Our server was very nice, but while I enjoyed my dessert (buttermilk pudding), the rest of the food was rather mediocre. The third star I am giving it is benefit-of-the-doubt-ish as to my personal tastes. Skip the snails (though the bits of black pudding were good, proving I don't hate all culinary things British) and the pig and pigeon terrine. The gnocchi were interesting, but I didn't like the underlying peas. The mackerel special was okay but full of bones, as is apparently customary with most fish dishes here. Sorry, this all just wasn't quite my cup of tea.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3g2meevFv7mIxT_JgilxQ"
  },
  "tdG-VEgn9DudWjhLoNoq4A": {
    "date": "12/4/2011",
    "text": "This is a nice mix of traditional and avant-garde dishes. We shared in the rabbit and had a few starters. We also booked a table in advance and although the rest of our party was a few minutes late, they kindly seated us already and gave us water/drinks. There was a limited time that we could reserve our table but they encouraged us to move downstairs for desserts and drinks. Our server downstairs was very welcoming.Overall, the meat dishes were cooked very well. The portions were filling and warming. The ambience is polished and cool. The staff lovely and accommodating. This is one of our solid favourites. We will be returning in the near future.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Vz-_hkWs-FLptd1TMJxPw"
  },
  "5OWFRicZXIoJhZETK7tqzQ": {
    "date": "10/13/2010",
    "text": "So this place really surpassed expectations.  I was expecting a quick meal before drinks but it was a feast.  We had an entire lamb shoulder to share between12 people, 2 plates of rib-eyes, quail and numerous sides.  The portions were plentiful, the food was delicious (and perfectly cooked) and it's great for family style eating.  A must visit for big groups if you can get a table.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtc-_ItNFE7GCddADBR34Q"
  },
  "8mw_2Adbr1nwrYeFANTdKw": {
    "date": "3/7/2009",
    "text": "This has been on my favourites list since I went after it opened, and my only grouch is that they aren't open on a Sunday evening (or weren't last time I looked). So it's really all about me. For those of you who've always room for dessert, here's a tip. If you're eating anywhere else locally, come here for it - you can eat at the bar. The creme caramel (made with marsala) is absolutely the best dessert I have ever tasted; certainly in this town. Service is great (if you're nice to them, they're very nice to you), and you'll almost certainly want to go back asap, as I do. Update 15.1.10 Be careful when ordering the Mallard, currently on their menu - unless your January diet's still in force - it's legless and less substantial than you might think, although accompanied by roasted chestnuts and sprouts, all suffused with the scent of wood smoke. A carafe of Douro sufficed, a glass of beaujolais each to accompany a shared anchovy salad, the perennially delicious marsala crème caramel and buttermilk pudding for my friend, our two-and-a-half course meal came in at £68 inc service. Had our duck kept its legs, this would have been a five-starred meal!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0sajTLwjF8X7j55hEDNiCw": {
    "date": "2/12/2009",
    "text": "This is by far the nicest meal I have ever had. I took my boyfriend for his 30th after it being recommended by a colleague, we had the rib of beef, chips&hollandaise sauce followed by tarte tatin. All amazing.The service was good despite the fact that is was a busy Friday night, we had a relaxed drink in the bar downstairs before eating and this was also comfy. I think the nicest thing about this place was the mix of people in there and the fact that it was amazing good not served in fussy or stuffy surroundingsI'll definately be going again.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sLNfG_VnUu8ANvbehw7ZjQ": {
    "date": "1/30/2009",
    "text": "This is the sister restaurant to one of my favourite tables in London - The Anchor and Hope. Everything is the same in terms of great bourgeois cooking and well chosen and resonably priced wines and beers. Last night which was pretty cold I had a very light beetroot soup with sour cream and dill followed by a superb ox cheek stew with (real) chips followed by a sublime seville orange and almond tart served with a scoop of home made vanilla ice cream ! Outstanding ! The main difference with the Anchor is that you can book and of course the location is better if you work nearby or happen to be a Mason !",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1PfqX6Y34ZylWaT9oOkPFQ": {
    "date": "1/31/2011",
    "text": "I was in London on business, and this place reminded me of the best of Russian Hill bistros in San Francisco: the food was local and fresh, the chef paid brilliant attention to flavor, and like a true \"slow food\" exemplar the menu celebrated and refreshed core British traditions.Go, and bring at least two friends, so you can share the wonderfulness!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNHEao8W16IcYk89mSZbRA"
  },
  "AWERlvw8jAIuphTHEcCv1A": {
    "date": "10/3/2011",
    "text": "fabulous food.  the specials were exceptional.  we had the braised short ribs which, we were told, had been cooked on low heat for over 12 hours. 12 hours!  the beet and watercress salad was excellent, as well.  all in all, bravo to the chefs at this gastropub!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8oaJ7Tzo_Xlt5NoR85D20w"
  },
  "xN0QCEw3rjE_aNC0cr69HQ": {
    "date": "10/21/2009",
    "text": "The kind of place that anybody, no matter where you call home, would kill to call their \"neighborhood restaurant\". If I lived nearby, perhaps in a pod located deep within the bowels of the aforementioned masonic lodge, I could see myself visiting once every week or two. The term \"full mouth orgasm\" was used.Crowd was eclectic, bordering on the bizarre. A Twin Peaks style collection of hipsters, blue haired theater goers, some post-hip young adults and a few shady Mason types. Decor is nothing to write home about, but it does make for a cozy shack in which to gorge oneself on all the delicious. The food was a full step above your average gastropub fare. -A simple preparation of fresh cockles, sweet and small, bathing in a broth of onion, butter, and an alcoholic beverage I couldn't quite place (almost tasted like madeira, but it definitely wasn't). -Fresh Maldon oysters. Honestly, the liquer was a bit on the muddy side...not really Great Queen's Street fault. I'm just more used to pacific oysters which pander a bit more to my tastes. -The smoked haddock gratin (can't remember their terminology) was a monument to excess, a mound of smoky, creamy savory goodness. - A masterful mushroom ragu over something described as \"gnocchi\" but what came out appearing as a giant polenta cake. No complaints. This was the best dish of the night. If you've ever heard a chef talk about \"building flavors\", you'll know what I mean when I say that the sauce was impeccably constructed. It hit every level on the spectrum you would want out of this kind of sauce. Musty, rich, and full. -Scottish Onglet with what appeared to be fresh creamed horseradish, served admirably rare. -For dessert, make sure to get the muscat creme caramel. Sure, it's basically a flan. If flan had a sexier, more delicious cousin. Trust me. Get the damn muscat creme caramel.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "x0sdtIzd9yXIC17P91nq6Q"
  },
  "LfhAHBLyaX74olYcNR8TPA": {
    "date": "11/16/2010",
    "text": "This is my favorite place to eat in London. I'm not even a fan of British food, but this place makes the earth move for me....Although the decor is nothing fancy, the food is spectacular.  Fresh, Local and very imaginative menus are basically all very delicious.   And the service is fantastic.   The only problem is that the bathroom is down a very steep set of stairs with no handrail.  I try not to use it as I'm afraid I'm going to break my neck.And if you're at the restaurant during the business day, take a walk across the street and visit the Mason's Grand Temple.  Most of the museum is available to non-Masonics and you can see a very comprehensive and different take on world history if you walk through the place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOg8sR9-AV87geRY-vgp_Q"
  },
  "d0iBw0E-UeFR99wx_qpl7A": {
    "date": "8/29/2009",
    "text": "Going have to bump this to a 5 star as I went here one last time before leaving London. Wait staff was great as always, food divine, and good company. Will always remember this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1EMTKLDBgLuNVeIkaiIIRA"
  },
  "YbvHsRpVz7pFgly2SqHflQ": {
    "date": "3/10/2011",
    "text": "It's a real pleasure to tell you how great this place is. They have a large rectangular ground floor room with earthy red walls and kind lighting. They have resisted the temptation to pack too many tables in and consequently the waiting staff can move freely and the room is alive without being oppressively loud.The staff are excellent for one simple reason: they care. They're interested in the food, the wine, that you're happy with your choice. They want you to enjoy it. This attitude isn't easy to find in London and it really stands out.The menu is an interesting mix of (dreadful word) rustic offerings made with high quality ingredients. The wine list is reasonable and the staff can competently guide you through it. The service is friendly, relaxed and there is no pressure to clear the table.I loved it.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kY5H2OpmwmStYV0r6n-ySw": {
    "date": "10/10/2013",
    "text": "Super friendly staff slipped me onto last spot on bar... place was packed.Had BRILLIANT braised leg of Hare... amazingly good. Were out of apple tart, guy behind the bar suggested a yougurtized pudding w/ raspberries... I would have never picked it myself but it was incredibly delicious.  Nits... would be great to get carrots with the hare :)Place is packed and very loud.  But I expect a great place to be busy.  I had a great experience and great meal... definitely going back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55porcOLR-nwCuVDj6WMHA"
  },
  "vXrU2TsmvNG6QFb3_x1TuQ": {
    "date": "10/22/2010",
    "text": "Who says there isn't great food in London? That's just ridiculous, and here's 32 Great Queen Street to prove it!Take what you think as traditional English food fare, strip away mediocrity, too much of any particular ingredient, heavy grease, and all that you'd stereotype as what you wouldn't like about traditional English food, then add a HUGE heaping of fresh and local ingredients, a massive dollop of culinary excellence, healthy helpings, and casual hospitality that defines what going out to dine should be about. Beauty and simplicity all rolled into one.Oh, did I mention that it's pub-casual? Yeah, no white table cloths or cloth napkins. You're getting a fantastic top-shelf food experience without the stuff trappings of fancy restaurants. Feel free to go with a group of your best mates and chat it up without fear that you'd draw any stares. It's perfect spot to share a good time for all.Definitely ring in a few days in advance (if not a week or two) to book a table--especially if you plan on going during peak hours. It's thoroughly worth the trouble.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zmT7MffjffGuZ8q-4Jwx7A"
  },
  "3ypPykE4TVtHMMgdQWUQGA": {
    "date": "2/17/2013",
    "text": "We went to Great Queen Street today for Sunday lunch.  I had soup to start and then the Lemon Sole.  The food was absolutely outstanding with simple ingredients but rich flavor.  I was surprised that we were the only people there as I've read that people have had a hard time getting in.  I guess I recommend going on a Sunday afternoon...The menu is small which I think it GREAT and everything on it looked fantastic.  Fresh bread kept us happy until our starters came out.  My husband had the Barnsley Chop and he also loved his meal.  Bottom line:  In a rather touristy area,  this is a gem of a gastropub and I highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5WiEanv3NU6Cf-GJDiB3vg"
  },
  "OmARUCsL7KC1fQAGF0OadA": {
    "date": "6/14/2015",
    "text": "Perfect. British food can be excellent but it's super hard to find. This place is so perfect. I shared the chicken pie for 2 with a friend on Wednesday. It's the perfect crust topped with suet. So good I went back with a work mate the next night to share the crispy whole suckling duck. The menu changes a lot and the best stuff is always to be shared by 2 or 3. Additionally, they always have a true craft cask of beer in hand. It actually sits on the bar. Super casual...and comfortable at the bar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjgXwGRN8pJSFj-hCKvI0Q"
  },
  "6NkYt19125VFAYDDIKUZ_w": {
    "date": "9/25/2012",
    "text": "I am going back - there were so many other foods on the menu that caught my eye but I just couldn't order all of them.The wine selection is OK - most of them were French therefore dry and not exactly to my taste. But waiter suggested going for sweeter Italian and that's what my friend and I did. And it scored.I like the fact that even though it didn't have availability for Saturday night, the place accommodated us at a bar - and I love bar seating. Honestly I think there should be more restaurants with bar tables only in London.I ordered pork and clams - and I'm not a fan of salt so someone who's keen on that - might not enjoy it, but I liked it - it was warm and hearty - for the cold winds outside.My friend went for the Onglet, and even though it's apparatenly a diaphragm - it tasted like prime fillet steak. But better. I would certainly go back just to have a whole plate of it to myself.There are not 'stir-fry', 'curries' - the menu was British - at least as I can imagine British cuisine like to be when there were no KFC and McDonalds.It's a bit shabby - I didn't like the table arrangements and the lighting - well it's just a dark place, I think with some refurbushiment they could easily score a 5.I would certainly try the smoked roe and some of their desserts next time I'm there!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6hVGwtNetpgdMSgOgv8PWQ"
  },
  "xv_nzBGs4qh-wP1D2NF8uA": {
    "date": "7/8/2016",
    "text": "A very nice place for dinner. It is on the pricier side with some unique foods. We just ordered a ton of appetizers since the main courses did not look too interesting. Apps are great. We did also have a steak pie. The crust was amazing!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZQRbJBEew7umEjaNjTDtA"
  },
  "z7z4Ncgp3uCMWaj_3CsUBQ": {
    "date": "9/16/2012",
    "text": "Hmmmm....a little underwhelmed with my meal but enjoyed the direction and feel of the food.Started with the smoked roe, cucumber, radish, and baby gem lettuce salad. This dish was quite tasty, but I had a minor gripe; the smoked roe stuck together so you would have large bitter bites of roe in and out of your dish. Near the end this sort of killed me palate. Overall quite nice though...Next, I had one of the daily specials..a whole artichoke. This was a huge let down. I could tell that the quality of the artichoke was high, but it was so bland to the point of dismissing the dish entirely. Furthermore, it was served with a mustardy sauce that was way too bitter and not savory at all. The mixture of bland and overpowering was a major let down.Finally, I had another special: fried rabbit shoulder and celeraic remoulade. Quite hit or miss as well. I feel that although the quality of the rabbit was exceptional, the fried aspect of it overloaded the taste. The rabbit was already gamy and a bit fatty...frying the cut was a bit too much. That being said, the taste was nice and reminded me of Southern chicken. The celeraic remoulade made me sad face as well. It was a tad bit too bitter and empty as far as ingredients go. I wish it went somewhere.I'd give this place 3.5 stars if possible due to the quality of the ingredients and interesting combinations, but I don't think the execution is on the same level as it would appear when reading the menu.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsgcXHipYKv5QVjSpAy2-A"
  },
  "LQJmJuX9vF5_hFIedwQkeA": {
    "date": "5/7/2016",
    "text": "Absolutely wonderful experience here. The food is inventive and adventuresome. The service smooth and attentive. Coming back before we leave London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hl_fX_g8FKSDM5YPu4drxQ"
  },
  "SR5WS3KTxvYD5D_fSMY7iA": {
    "date": "4/20/2015",
    "text": "Went for lunch, ordering the quail, a Syrah, and chips.  All my food was excellent and delicious.  The Syrah was wine (not a connoisseur!), which is what I asked of it.  Very good food, and the prices seem reasonable to me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UQi1mYI6rEt9Q8EmcVe69Q"
  },
  "jLkJbYs72dViUoBTxRKqVg": {
    "date": "4/29/2015",
    "text": "Phenomenal!  Came in because of the Yelp reviews and they didn't disappoint. Fantastic service, the oysters were perfect, had the beef and chorizo; wife had the something weird with an egg on it but it was also delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZUn-CIV0Tzcp6AxaWGDkOA"
  },
  "JORa_FfFwOTTeh76IeQT4w": {
    "date": "4/28/2015",
    "text": "Been three times for dinner and had fantastic experiences each time. Great ambience, comfortable service, and top-notch food that's just a tiny bit different than what you'd get somewhere else. Great for a pre-theatre meal, or for a date.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZ-s6urV2V_cHFmUT6Nt_Q"
  },
  "Vg-vS3Ake0K2ZY7GydloMg": {
    "date": "3/29/2010",
    "text": "It is odd for me to walk into a restaurant and be totally stuck on what to eat. It wasn't because I was being indecisive, it was because, apart from the potato soup that was delicious and the shrimp, I had no taste experience of anything else on the list. Great Queen Street serves impressive British cuisine with offerings such as pigeon, sole and other non typical delights. Your usual eating habits may have to take a detour, as there wasn't a burger or a plate of chips in sight.All the dishes brought to the table looked excellent. My pigeon looked like a little chicken, but once you cut into it, the flesh looks and tastes like beef. Yet it went exceptionally well with the fois gras and lentils. I had to order potatoes as a side dish. They were good to. All in all, Great Queen Street is a pretty expensive casual British restaurant, serving from a high end menu that smacks of the upper class. I was there for lunch and had a good experience, but wish I got to try one of the lovely sounding desserts. The starters and mains although very good, aren't quite my style. One needs quite a refined palate to fully appreciate this place to its fullest.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vFDbguEmeA5tKKlGuYSRIw",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vFDbguEmeA5tKKlGuYSRIw/o.jpg"
      }
    ],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "eKGnhMp4R6D3CKqUenNjgQ": {
    "date": "10/11/2014",
    "text": "Thank the Maker! At last, a meal worth eating, if a little on the pricey side. Excellent eats and beautiful service at Great Queen Street. I ordered a heritage sirloin special and herb salad. Steak flavorful and well-cooked; salad interesting, not overdressed. Server was kind enough to offer chocolate sorbet for pudding. From first to last, an excellent experience. Quality food, not fussy. Warm atmosphere. Recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o5y3cwNbTooMI1wJy_M1wQ"
  },
  "TlboM8FFr0cK3setRhFrNw": {
    "date": "10/26/2014",
    "text": "Have only been to the cellar bar, but this place is a hidden gem! Nice selection of wine, and delicious cheese plate of local cheese, right from Neale's Yard! Alex the friendly bartender plays a nice eclectic mix of music from the 60's and 70's. Restaurant is always buzzing - I'll definitely check it out soon.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pAtyej-woKH_afa-6X-m-Q"
  },
  "jf0AGcHuChwmEd_FZ-sTBg": {
    "date": "8/17/2014",
    "text": "Great Queen Street this restaurant was very busy and has a lot of good reviews within this app, hence giving it a try.  I just think it is a bit outrageous when they want to charge you 12.5% service charge for bringing your food to you, when that's what we all get paid to do a job!  I was about to leave a tip (having asked for the automatic 12-5% to be removed off the bill) when the manager came over asking why? I think this is the bit outrageous.  Personally the menu wasn't exactly what I'd choose so I had a vegetarian dish which average price was £14 with no sides so side orders of chips potatoes £4 vegetables £4. I would not be returning to this place.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6kG5H9Oyn30kD0En02FKA"
  },
  "w41CSKwGseZJ3AcSfXbxBA": {
    "date": "11/7/2009",
    "text": "Our incredibly knowledgeable server had a fact-filled and eloquent answer for each and every one of our many questions. I love when I leave a restaurant feeling like I've received something of an epicurean education whilst inside.Not one to turn down cauliflower in any form, I opted to start with the cauliflower soup. Luscious and satisfying, I couldn't imagine a better appetizer.After hearing the description of the rabbit pie on special I knew I had to have it. Thankfully, my dining companions were up for taking it on together.Great Queen Street gave me a distinct appreciation for suet crust pastry. Before eating their incredible rabbit pie, I didn't have a clue about suet or the magical deliciousness it can impart. Additionally, I was completely ignorant to the fact that rabbit, when slow cooked, ends up tasting a lot like chicken without a hint of gaminess. Great Queen Street provided me with a level of satiation that's been tough to find elsewhere in London; I'm already looking forward to my next visit.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "DEACKv-eHkw1UniymhbD-g": {
    "date": "3/24/2015",
    "text": "Traditional English food in a relaxed setting. The menu changes daily - however you can expect a few gamey meat options most the time. If they have a Beef Wellington on menu that day, get it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qn7TUZoOxX7umvWoNYS7Uw"
  },
  "hQ2sFEoo1pnroSBexslLSw": {
    "date": "3/17/2012",
    "text": "A gastro-pub in the land of pubs.  This is a great place and a great way to start your time in London.  The place was packed, with a good vibe and upbeat crowd so a reservation is absolutely required.The menu is seasonal and so it will change.  On this visit, we (2 of us) had the following:  Starters:Snail salad -- this was a special of the day.  Snails served warm with bacon and lettuce.  It was delicious.Cuttlefish -- a member of the same family as octopus and squid, this dish is served with the cuttlefish being cubed and served with peas and wild garlic.  At first, I was not happy with the dish, but with each bite, it seemed to grow on me.  I would probably pass and try something else, but it still was enjoyable.  Main:Rib of Hereford beef -- this is a dish that is meant to be shared by two people and takes 45 minutes.  It was worth the wait.  The beef was perfectly cooked rare and served with a side of Bearnaise sauce.  Also accompanying the dish was a bowl of french fries (chips) that were perfectly crispy on the outside and meaty on the inside.Dessert:Apple treacle tart.  An apple pie of sorts that has a crunchy crust and nice crunchy top, with a sweet interior.  This is a perfect dessert to end the evening.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7eXcdFSIz4eocDcJlbGHng"
  },
  "_SjXFto_EpO71e0sNEhSbA": {
    "date": "4/14/2012",
    "text": "As an American I was definitely satisfied with the British-ness of the menu which included duck giblets and roast pigeon.  In the end I wussed out and had the sole with whelk butter.  Even then the fish arrived whole with all the bones in, and so was pleasingly non-American in both look and taste.  Also it was really, really good.  Especially the garlic in the whelk butter was unbelievably flavorful.I was alone so I ate at the bar which was a little cramped.  But the staff were friendly and the service was prompt even though it was Saturday night and the place was packed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uZqJoMhCMpvoqgC9-56GOQ"
  },
  "kix4AMb7yAXJhYsG8GvIhA": {
    "date": "4/2/2012",
    "text": "Just far enough out of the heart of Covent Garden to have a bustle without being too crowded.  Exactly what I was looking for  - a place that was as concerned with the food as with the drink.  Every bite was delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1EODbxPx4WptSthrm1i92w",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Cured mackerel and pickled cucumber with cream cheese mousse.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1EODbxPx4WptSthrm1i92w/o.jpg"
      },
      {
        "img_id": "ZHe4dp6wu5tEB49qV9Y9Jw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Shrimp, broccoli, leeks and anchovy dressing.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZHe4dp6wu5tEB49qV9Y9Jw/o.jpg"
      },
      {
        "img_id": "VXNS2oYXyVzkqkVr9WfFaw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Lamb sweetbreads, \"mushy\" peas and mint sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VXNS2oYXyVzkqkVr9WfFaw/o.jpg"
      }
    ],
    "user_id": "h_lXOGKjnmRX27koMpo70A"
  },
  "b6RZkFCauJD2pigsDlpKnA": {
    "date": "1/19/2014",
    "text": "Was so impressed by this place! Had pig's cheek with an apple sauce and braised cider and it was exquisite.The wait staff were all very kind and helpful - our waiter gave us a copy of the menu and wrote out the specials for us including the prices. After conversing with him for a bit, he suggested other British restaurants for us to try.Great atmosphere and experience overall! Only criticism I have is the closeness of the tables - it was hard to get out of my chair as I was leaving.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Nm2R5ylWT2a8wUMKHzUkUQ"
  },
  "Lkj2nnzhK1QfTLMYY6z7yg": {
    "date": "7/16/2014",
    "text": "This is my favorite gastropub in London. When people ask me for a recommendation for \"British food but I don't to just eat fish and chips or anything bland\", I send them here. I took a friend from out of town here during the winter and we had a really delicious, relaxed meal at the bar with some strong drinks that were surprisingly reasonably-priced, for the location. Food was well-made and portions were deceptively large! Seems like they rotate the menu regularly as well to use in-season ingredients. I had a salad with rabbit and bacon and some other things in it a while back, and it was literally the best salad I've ever eaten, and I'm sad that I haven't seen it again on the menu since. GREAT QUEEN STREET IF YOU'RE READING THIS PLEASE BRING IT BACK!It's not the cheapest place, but for the quality and creativity of the dishes prepared here, it's well worth the price! For anything else within a stone's throw of the British Museum, GQS is hard to beat.They take group bookings and it's really nice that they don't force your whole group to order off a prix fixe menu the way that it seems lots of gastropubs these days do.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMXfcEK9S4BVLYEGhyEsbQ"
  },
  "djsF9oHikfY4YvmA-kAG8w": {
    "date": "9/8/2014",
    "text": "First of all.. Thank you Yelp, without you guys I wouldn't have found this restaurant. Jetlagged and hungry but not wanting a big meal, the team at Great Queen Street recommended the salad of Heritage Tomatoes, Peach, Yogurt and Cumin salt followed by the griddled French quail and chenterelle butter. Cumin salt brought out the full sweetness of the Tomatoes and Peach. Now on to the best part.THIS IS THE BEST QUAIL I've ever had! Nicely crispy grilled on the outside yet juicy and full of flavor on the inside. Chenterelle mushrooms was fragrant added with the butter gravy had the right amount of salt without being overly salty nor oily. A pity that the meal had to come to an end. I want more!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z0-E-lJ9-22v9lGczS2jSQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z0-E-lJ9-22v9lGczS2jSQ/o.jpg"
      },
      {
        "img_id": "YeRYpuT-1_fjmXrOELMWVQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YeRYpuT-1_fjmXrOELMWVQ/o.jpg"
      },
      {
        "img_id": "Ysaz7kZ4aaaGLuGJR0WKTg",
        "caption": "Photo of Great Queen Street - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ysaz7kZ4aaaGLuGJR0WKTg/o.jpg"
      }
    ],
    "user_id": "4CzNF_ofwDVOBOrFkjVYmA"
  },
  "0OD-_Rj6vxDJihlCzG5nvg": {
    "date": "12/11/2013",
    "text": "Holy crappoli. We were cold as hell and wandering through London as my phone died. We needed food, but a lot of places were closed. We remembered that Great Queen Street was nearby, and had read good things on Yelp! It was our last night, so we decided to treat ourselves.First of all, the place is pricey. It isn't CRAZY pricey, but I wouldn't call it a \"value\" joint. The restaurant itself is very packed, but with enough room for everyone - I would say \"efficient\" seating. No wasted space. We got in, and ordered a couple of the specials - they were very good. The greens and pie were amazing. I would give it 5 stars. The service (even by UK standards) was not good. We were STARVING and didn't get our bread/drinks until we asked for it several times. It was busy, but people seated after us had received theirs long before us.  So, 3 stars for service.  Overall, a really big fan of the place and a solid four stars!!  Will be back the next time we hop over the pond.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4olPUfMrNCK3rmaJasGH6A"
  },
  "HOhV8VmLmB2bnX948mj1Zw": {
    "date": "8/26/2014",
    "text": "We had an excellent meal sharing several of the dishes including the quail and lemon sole. Our kids who were exhausted and cranky from a day of sightseeing and walking even came around and enjoyed it as well. We did not have a reservation but were seated immediately around 6:30 pm. The desserts were very good as well. The service was great and very informative about the dishes. An excellent experience overall on our visit to London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u1Xcej-zvaujMMLgCFDx-Q"
  },
  "nQY4tK5SPQhP7ovH9o6UTA": {
    "date": "10/20/2015",
    "text": "The grilled squid was cooked to just the right tenderness, the lamb kidneys were perfectly and delicately spiced with cumin and red pepper while the roasted eggplant laced with soft roasted garlic, and the chocolate fritters were a  revelation. Plus thoughtful service. As good as British food gets.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CQtTYD9ZaElsHvQifuL4Ow"
  },
  "mGYxYCk7cMXs-JSAnLdA3A": {
    "date": "10/21/2015",
    "text": "Traditional British food and service at this bustling restaurant on Great Queen Street. I enjoyed the warm duck salad and lamb's kidneys. Attentive service, reasonably priced and good atmosphere. Minor observation, tables are a little bit on the small side.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Li1HVGOQVAre8YgiTLra6w"
  },
  "OV36uDOqOOQRSoudPNifWA": {
    "date": "10/12/2015",
    "text": "I came here having visited their sister restaurant Anchor & Hope, which I loved. I ended up going for the Workers Lunch menu which is a set two course for £18. I started with a main which was homemade sausages mixed in house. It was lovely, flavoursome but it was so small and had no substance to the dish. I then went with what was supposed to be a selection of cheeses from Neal's Yard and all I got was one cheese with a few Oaty biscuits. Overall I was underwhelmed by the size and generosity of the dishes and do not believe it deserved to warrant the higher lunch price. (Visit - 03/07/2015 Lunch)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "fudujpsBsj3qtUXCSFCxmg": {
    "date": "9/2/2013",
    "text": "I came here upon the back of many great reviews, and I have to say that I'm impressed.I am not particular fan of British food, and my quest for good British food has been met with plenty of disappointing meals that never hit me in quite the right way. I've been here for 4 months already, and for some reason I've always made it a point to try something British at least once a week. If you do the math, that's over 15 places already - and still nothing that I really enjoyed.Until now.Not only did the waitress know the menu fully in-and-out, she was able to describe why she liked a particular dish - how long each dish had been in rotation, and what the chef was trying to accomplish with the ingredients. I am not sure how she manages to remember this for a rotating menu, but I decided to go for the newest item - the grouse pasta.The grouse was slow cooked and pulled apart, very tender and juicy without losing its gaminess. The vegetables that accompanied the grouse in a sort of stew-like fashion paired perfectly. The pasta was ziti and soaked up the stew very well. Overall a great meal, and one that's going to have me returning for quite a while.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "V8OsxfIHpYWeMMeEsowHRw"
  },
  "7wG0hNuiDck2CLSHHVunaA": {
    "date": "9/18/2013",
    "text": "Definitely bang on every buck!  Who said the Brits don't have good food?!?!?  I loved the meal, fresh ingredients, delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4QZZG56_7-n7yDEVk_BJyQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Pork chop was so delicious!  N",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4QZZG56_7-n7yDEVk_BJyQ/o.jpg"
      },
      {
        "img_id": "FqiBObovE9MjmqYwaJLHUw",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Cheese was divine",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FqiBObovE9MjmqYwaJLHUw/o.jpg"
      }
    ],
    "user_id": "YnDC7ZkoTF0JwrsJW_Cj7Q"
  },
  "_BjZljqUUhDtb8WvnvntyQ": {
    "date": "8/24/2013",
    "text": "We were out sightseeing our first day in London, and- although Westminster Abbey was closed, got there just as the 5 PM service with chorus was just being seated.  Great experience #1 of the evening.  When we got out, we realized we hadn't eaten all day, saw this place on Yelp and grabbed a quick cab.  We didn't have reservations, but were seated at 6:15 PM at a table that was reserved for another party - but not until 8:00 PM. Great experience #2!1 hr. and 45 minutes later, after pigs cheek and duck terrine, snails (did someone say they didn't like the snails???) and a rabbit and chestnut mushroom pie with a side of greens - oh-  and a plum and almond tart we split with cappuccino, we left and walked around all evening.  Best meal of the trip, for certain. Wait staff was amazing, as was the owner/manager.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ki2mkSunU53X9yazmRHyPw"
  },
  "kzaCA2Cuwzadmll8kj-f9g": {
    "date": "1/12/2014",
    "text": "Was looking for a place to have a last dinner before heading back to the states, and I couldn't have asked for a better place to end my experience in London. Even though the restaurant was packed, the food and service was excellent and absolutely delicious; which is probably why they were so busy. As far as price, this place was on point. When I got the ticket, I was surprised by how much the ticket was. However so, remember that the service charge isn't included, so it wouldn't hurt to leave a little extra! Especially due to the seriously outstanding service you may receive here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qn9YuohqBHgdYP2b7TJYHg"
  },
  "G5OfXqjUvsvW-5LmifM6HQ": {
    "date": "10/12/2016",
    "text": "If you like high end English food, this is a great place.  I recently had lunch here on vacation.  I started with a pork terrine and followed it up with a roasted partridge.   Both dishes were excellent.  I would give it five stars for the dishes I had, but I have to warn you that picky eaters might have some issues with the menu.  It's a little more gourmand than a pub.   Also the tables and chairs are small and you are sort of packed in there.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jS--tB4FdkQDKVGbU4gJSA"
  },
  "RF2uwLM3DfUnTUKxZMcyQw": {
    "date": "2/16/2013",
    "text": "This may be my favorite gastropub in London, after having visited about three times. If you can, get a seat near the window so you can watch people pass by. I have an English friend who now lives abroad, and she always mentions this place when we're in central London and looking for a place to eat. Now we bring our other friends here when they come to visit.During my second visit, I've enjoyed a whole fish for two, covered in vegetables and delicious sauce. On the most recent visit, I saw duck on the menu and couldn't say no. They paired it will an onion chutney and parsnips. Every duck loves a sweet accompaniment. Gluten-free notes: Most dishes here are naturally gluten free, and they were happy to advise about what was OK and what wasn't.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "xDDL9f-fhEl-gqVv11l4ww": {
    "date": "1/21/2013",
    "text": "While in London, I was in the search for tasty, affordable, and authentic British cuisine. I've heard my fair shares of how \"British food is horrible!\" and \"You're going to lose so much weight when you come back from the UK because you won't eat anything\" yadda yadda - Not so, my friends. Not only is Great Queen Street restaurant's menu full of game and all your traditional British-y foods, the food was mind you very delicious. Honestly, without a smart phone, I don't know how anyone coming here can order without looking up half the stuff on the menu. Because it has been more than a few weeks since I checked in here, I can't recite the names of the dishes off my head but they were very complicated and you'll find yourself asking the staff what exactly you are reading and is the menu still in English. Luckily, the waitress was super helpful and knowledgeable and was able to tell me exactly what was what. I played it safe anyways and got something I could pronounce - the partridge. It was my first time having partridge so I can't compare but it was pretty tasty if not plain messy. Don't think you're going to get through this entire bird without using your hands. I was hoping no one would see what a noob I was at eating whole gamey birds, but boy I was glad my waitress was attentive enough to see me struggle cause she brought over a dish of water so I could dig in and get real dirty eating. On a lunch day, I think you could score a seat without reservations but I can see how this big restaurant can easily fill up with people at night. It's good for both groups and small parties because they have the space and the table sizes of all kind. To sum it up, have your smartphone with you to look up food on the menu, attentive staff, prepared to get hands dirty if you order partridge.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "x27q-6nrp9h38-_n8WLNXQ",
        "caption": "Photo of Great Queen Street - London, United Kingdom. Partridge",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x27q-6nrp9h38-_n8WLNXQ/o.jpg"
      }
    ],
    "user_id": "csWsIQPale4_kS7ZBnTNrw"
  },
  "8iNlXvjXw8c8J0RLglCSHQ": {
    "date": "10/27/2013",
    "text": "Don't be put off by the tables and lack of fancy signage outside the front of the pub (which look like a mid-tier cafe). I walked inside and had a great lunch. Make sure you ask the staff for recommendations - they helped me pick the food (I had slow cooked pork) and guest ale (excellent one from Hampshire) and even advised me not to order sides dishes, as they would be unnecessary unless I was starving. Even recommended other (competing) pubs. Great, lively pub/ restaurant atmosphere and food, with genuinely helpful staff. I'll be back",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hEogUgY-s3B6CO2LkOQhA"
  },
  "MOEiBP6vgeoC_DU7F7UZLg": {
    "date": "8/5/2011",
    "text": "Cozy place, good for a catch up with an old friend or a small group dinner. Starters were so-so: smoked aubergine/ricotta/tomato and cockles...with stuff...Roast chicken wasn't bad (tad dry) but the greens it came with were heavenly.  Dessert was tasty too: coffee honeycomb ice cream and a biscuit and some kind of tart (which my dinner mate ate completely so I have no idea what it tasted like).Homemade lemonade was perfect on a hot evening too!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-4nQ-PHW_U8CCR0S1jT_w"
  },
  "RJ1AX7w5x-5hOJyIWNjqXA": {
    "date": "7/23/2013",
    "text": "Excellent service, delicious steak pie, super close to the theatre district.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHVhLKw_uIE7saIt_S-udw"
  },
  "Vj1MycfAeJ264Qmr2S5wtg": {
    "date": "9/24/2015",
    "text": "We are foodies! We asked the Concierge for a non tourist restaurant (as we always do when traveling). He suggested Anchor & Hope. The restaurant magnanimouslyaccepted our last minute reservation under the condition that we be OUT in one hour. That was fine with us. We jumped in a cab & arrived 25 minuted early. The restaurant was mostly empty. We reminded the MAÎTRE D'/waiter that our reservation was not for another 25 minutes, but we were early and wanted to respect their request to be OUT within one hour. Our arrival time gave us an extra 1/2 cushion.One would think that they would promptly serve us. NO. It took almost 20 minutes for them to ASK what we wanted to drink. 10 minutes to take our food order at which time THEY realized the time and were now rushing US.  We ordered lamb (wanting to eat one of their specialties.) They said that all the food is made to order and that the Chef ONLY cooks HIS way, and that we could not have it medium rare. OK fine. CAN YOU SAY RUBBER/GRIZZLE? We cut away so much that was inedible, all that was left were mouse scraps. The waiter also pushed a side salad (and I use the term loosely). It was an over filled, under sized bowl of straight \"out of the bag\" spring greens. We didn't even bother eating it. We left HUNGRY! We had better food anywhere else in London. All they accomplished was to perpetuate England's OLD reputation of having terrible food!I asked about the Free Mason Lodge across the street, (seeing men in black coming out with the same square briefcases). It was one of the few times the waiter actually smiled, he said \"They don't come here anymore because they don't like the way we treat them\"!You're not alone boys!There was NOTHING redeeming about this restaurant. Let's assume that they thought we would not be repeat customers and gave us pathetic food. Wake up Anchor & Hope! It's a small world out there and the internet is VERY BIG! People, don't waste your time. We would have been better off in a fast food joint!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWF7DsKvWLgHtpHFRum4zw"
  },
  "-jjM-6sWIxCJczlzf0QqhA": {
    "date": "8/31/2016",
    "text": "Excellent \"gastro-bistro\" near Holborn tube station. The menu has something for everyone but emphasizes hearty dishes - game, meat pies, etc.  They won't like me saying this, but the \"seven hour lamb for three\" (braised lamb shoulder with root veg and very rich pommes dauphinois) will feed four people easily. They are into bold flavors here, letting the food speak for itself amid a relaxed vibe and simple surroundings that recall a country pub with a serious cook rather than a Central London bistro .  Thoughtful and varying selection of wines and beers.  Prices quite reasonable considering the location and the quality on the plate.  It's a standby for me whenever I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTSXBvLlZM3G0xRSaQmdnA"
  }
}