{
  "z035QeMNRHxAFRlIeEFSgA": {
    "date": "3/1/2010",
    "text": "I really don't find The Cat to be as overrun with hateful, Nathan Barley-esque eejts as other reviews say. Yes, there's the occasional drainpipe clad muso but, y'know you're right next to London Fields and Crackney Wick...residential meccas of the Hoxtonite. I don't find this pub to be pretentious, rather it's a nice converted old man boozer that now sells typical gastropub food in a predictable interior (big chunky wood tables, dark lighting and young staff). If it's a crime to have a pub serving decent grub and have a younger crowd then y'all must be miserable as hell.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GbZdoIeNU7aYdta76IeJHg": {
    "date": "12/8/2008",
    "text": "No one seems to have mentioned the most important thing about the Cat and Mutton: it often smells like a toilet. It is definitely an interesting place, with really nice high ceilings and a loft level hosting a variety of arts events (comedy every thursday, for example). But really: it smells. It's enough to put even me off drink from time to time.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qEeyw1qNFVsw36Kj7FsCAg"
  },
  "Muib2COYlEjiZTxkjBKn4g": {
    "date": "1/29/2009",
    "text": "Sitting in a pub mid week over a leisurely lunch is by far the cheekiest treat I've allowed myself of late. One I can't really afford it and two, I should be at the studio working. But it's a rare occasion that my friend is in this neck of the woods, the North South divide is alive and well and we had something to celebrate, an offer being made on her flat. It doesn't really matter where we go, we always have a giggle but this was particularly fun. We sat giving a running commentary of all the odds and sods in the bar, what a colourful crowd we are. I do really like this pub, it's calm and beautiful if just a little intimidating and I've gotten over the fear of bumping into my ex- she's back on the other side of the world, phew. So, what to have? With unnaturally high levels of indecision and a pounding head I went for the heartiest thing on the menu that weren't the faggots and ordered myself the belly of pork sandwich with whole grain mustard and watercress and yes, as you've offered, I'd love chips. But not verging on burnt and a little red sauce wouldn't go a miss. I'm no great meat eater but I hate to say my £7 sarnie did taste a bit like the back end of a pig rather than it's belly and I was a bit miffed to see that I'd been charged extra for my chips when the bill came, I assumed that was part of the dish. The pub was pretty busy but still we held a big table to ourselves without anyone batting an eyelid. Really nice place but just a little up it's own behind if you know what I mean.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "KWYPvSsvv27jZV9Ku0xpqg",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KWYPvSsvv27jZV9Ku0xpqg/o.jpg"
      },
      {
        "img_id": "tkiClGTkG3mjwQUthV0eWQ",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tkiClGTkG3mjwQUthV0eWQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "taG0w_wHcl9mvA91R86ADw": {
    "date": "12/28/2008",
    "text": "When this place was first converted in 2004 from an old east end boozer the food was amazing, the best gastro food I have ever had. Food was inventive, not cheap but really amazing. Then the chef changed around 2006, around the time that Broadway Market was overun by Nathan Barley's from Hoxton Square and now its just full of style over content people that groom themselves to look like they have slept in a bush for the last week eating roast meat type nursery food whilst they ponder if moving here from Ladbrooke Grove was really the right thing to do, just because their friend Toby's dad bought a flat near the canal as an investment. We went here for dinner again recently, the gnocchi was solid and inedible and Suzi Quatro's Devil Gate Drive pumping out from the speakers made me want to stand on an antique piano stool dressed as a Chelsea Pensioner and throw up my own pelvis bone. It gets too busy too unless you go Monday-Thursday night.is this place a boozer or a restaurant??!!, I don't think it quiet knows, what I do know is that if you like eating sat next to someone who smells like a Sue Ryder shop but probably earns 75k a year for sitting in front of Quark all day then you'll love it. Service is erratic unless you have a 70's plastic jacket on and a goatee beard and a tattoo of a 'mystic' Hindu symbol on your lower left leg.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dT6Z4tAwfGuHqXix7hmH9Q": {
    "date": "8/6/2008",
    "text": "Great place for good food and fabulous people-watching. Proper, good honest food, well priced. Portions are of a good size and delicious. The gastro menu changes daily and you are rarely disaapointed. There is a spiral staircase and opened an upstairs dining room, which is great as the weekends are so busy. Well worth a visit - nice, easy atmosphere and a cool east london crowd. You will often see the odd celeb having a beverage here. You have the tables and chairs outside and an awning so you don't have to worry about getting rained on if you smoke. You can also take youru dogs inside with you which is really lovely. The drinks can be a tad pricey but then you are in London are this pub is really lovely. Brick walls and old wooden tables and chairs. If you get the chance simply go!!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GxVic2hcsB5GjzYd9Nygcw": {
    "date": "10/22/2008",
    "text": "Its my local - I love it. It smells of mischief.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FX6wdLWKfx5atUNCj1zFzA": {
    "date": "1/10/2010",
    "text": "Came here today for lunch with a friend. I can't review the food because it never came after and hour and a half. We ordered a potato soup and a starter. The waitstaff was very kind and apologetic, but unfortunately that doesn't fill hungry, waiting tummies.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X4aAWySdfI0SC84Ev9TWHQ"
  },
  "tzS8Zenx2mbzlPfBzWYX3A": {
    "date": "8/27/2008",
    "text": "i agree this is a lively well priced pub, which a few years back was a seedy dive,so nice now to visit. always a good crowd although like everywhere there the odd few who sit outside drinking from cans purchased at the nearest offy, bus stops right outside, its the only pub i would use by the broadway market,",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pduabyHsGPTc0p5wDxpWiw": {
    "date": "10/9/2008",
    "text": "Only went in as was early for a dinner reservation. At 9pm on a Saturday night the place was heaving and all human life was most definitely there. a very gentelmanly roady type drugged up to his eyeballs managed not to spikk his drink on me and managed to splash the girl next to me.We managed to get a seat at a long table and my companions pint of beer was fine and i discovered i can only drink diet tonic. two girls opposite us asked us to look after their belongings as they went for a smoke. we explained we had dinner reservations and would be going very soon. like I said lively joint, looks a bit rough but obviously from the example above people are trusting. my only complaint was instead of keeping an eye on us I had to make my way through the hoards outside to tell the girls no one was watching their coats. food looked good just don't think i'd eat there cuz the place did not seem to be the most hygienic!",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZeInuZI1hhrsVlps-0TP8g": {
    "date": "10/15/2008",
    "text": "The Cat and Mutton is my local and i love it - you can go there every day and see locals but also a cornucopia of people that include, drag queens, celebrities, stylists, DJs, locals who have lived there for years and tourists! its quite simply the best place ever to people watch. who need americas next top model when most of them are in the CAT!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3-iJ1sYwJPOZ54rLdkqsvg": {
    "date": "3/17/2011",
    "text": "This is a nice place if you want to drink. But I think their food menu is poor an uninspiring. But if I mist compare it with other pubs, I've seen better.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fYamSJQOmUArbyTK38jFCg": {
    "date": "10/13/2010",
    "text": "I live in Manchester so the Cat and Mutton is hardly a 'local' but I have friends who live nearby so if I'm down for the weekend and Saturday night creeps into Sunday lunchtime territory and the Holyoaks/Eastenders/Come Dine with Me omnibus's have finished the pull of a good Sunday Roast at the Cat & Mutton, before the arduous journey home, is enough to thrust me into mixing with people for a few hours. The pub itself has a semi rustic feel with differing sized tables and a big old bar, which for a short arse like me is not ideal, and although it is usually busy if you happen to go on a nice day, even in mid October, the crowd tend to spill out onto the street so you can often still get a table. Or share a table, you quite often find 2-3 people on a table of 8 but don't feel put off by asking to share. East London may be renowned for its 'Di**heads' but even they make for good table mates. It's a great pub for people watching. They have an upstairs area too which is sometimes overlooked, probably as the spiral staircase on a Sunday hangover is too much to attempt for someone in ridiculously skinny jeans. The food here is of a very good standard with big portions, slightly pricey, but probably not for this part of town. Roasts with all the trimmings will set you back £15. They have the usual selection of gastro pub beers and ciders although running out of cider at 6pm on a Sunday was bad planning by someone. I haven't any cause to complain about the staff being rude or pretentious as I haven't experienced it. Whenever I've been in there's been quite a varied clientele and it is bustling. I find the atmosphere vibrant and it certainly perks me up for my long journey home.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IcxrAhwANR5N0CZPChnkOQ": {
    "date": "3/5/2010",
    "text": "Had a lunch here, the food quality was excellent as was the beer. Even if i did stink the place out with the smell of kippers for an hour. The staff were a happy bunch and pretty quick on the service. And the atmosphere was light and friendly. All in all it is definitely worth coming in here for nice lunch meal.Seemed packed in the evenings too. So a popular young locals pub",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyCuNW4KZNNmy-Z1z8HL-g"
  },
  "lsQrqeRKEV_WCe1Eh9kH2g": {
    "date": "11/8/2007",
    "text": "This two-floored pub, sits on the London Fields end of Broadway Market and is a mighty fine place to quaff a beer and eat some good quality food. During the daytime I have seen mother's with their offspring meeting for a desert and a chinwag and during the eveing the places is buzzing with conversation and clinking galsses. The bar is nightmarishly small and being served can take a very long time. Tables are outside on the pavement and I thoroughly recommend it.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "SpiHblHLkGc1g3-jGsL2aw",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom. Cat & Mutton",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SpiHblHLkGc1g3-jGsL2aw/o.jpg"
      }
    ],
    "user_id": null
  },
  "nBHEIQzvEHoHha-HMWJefQ": {
    "date": "1/9/2009",
    "text": "Exchange rate: +1 EnglandFood: +1 CaliforniaI think food in England is as bad as advertised unless you're willing to pay top dollar or only eat Indian food. Seeing as how Gordon Ramsay and his wheelbarrow full of Michelin stars weren't on my list of feasible to-dos, I practically lived on beer alone when I was here in 2008.At Cat and Mutton, Guinness was aplenty and there was actually good food. I had some kind of pasta dish, and that simple meal was probably the best meal I had in four days.Names of pubs here are the best (Walrus and Carpenter, Cat and Mutton) and they're often wood-paneled and beautiful, so points all around for that. I like the East End, including Whitechapel, Bethnal Green and London Fields, so points for good surroundings, too.There was an odd mix of folks, but there was something for everyone, it seemed, including people, dogs, people with dogs, various dress-up birthday parties, dressed-down/casual tourist types like myself, and locals like our hosts.",
    "rating": 3.0,
    "rated": {
      "useful": 10,
      "funny": 7,
      "cool": 9
    },
    "photos": [],
    "user_id": "VpREWOjt5Pna6OIgXI9Jcg"
  },
  "IcLsmm_Dv2ZqB8J6_6nL-g": {
    "date": "9/29/2010",
    "text": "possibly the worst designed layout I have seen in a pub so far.The bar (elevated so they feel special) is tiny and the pub is huge, the kitchen takes up most of the space that the bar really should cover.Ultimately you can fit 5 people along the bar to order, then the queue is going right back to almost 4 deep, which blocks the whole entrance to the toilets, which you cant open the door to if someone has opened the door to come out of the loo because you get the doors banging into each other!haha ridiculous. Also toilets are gross and water always covering the floor. The general sense of this place is arrogance, both staff and clientele.basically you know what & where that 'being a d****d' song was written about.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RSmD3kIfSHJX7k6JPVqvzA": {
    "date": "12/13/2008",
    "text": "This place is filled with trendies. The bike riding crowd, with funky hairstyles, red lipstick, pearls, Checker skirts and pointy shoes, you get the drift... It can get incredibly busy, where every inch, nook and cranny has been filled to discover the gossip of who's doing what and you have met recently. Not that that's a bad thing, if you get their early then it can be a fun place to get into the jive of the evening to follow. They have a good selection of food, and drinks although it is a little pricey and if its crammed the service can understandably slacken.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nbZ3o-Wlp5Cu2SRFmhNAGA"
  },
  "3Gm8P-IcgH7pfDqBPAzOdQ": {
    "date": "7/12/2009",
    "text": "Already widely reviews as a pub/gastropub, just wanted to mention my experience recently when a friend hired out the upstairs floor for her birthday party. She'd dallied with taking somewhere in the West End until we agreed that east was vastly preferable as then most of us could stumble home afterwards, always a joy, plus for the budget, it looked like she'd get much more for her budget here - which happily turned out to be the case. The staff are all really young - or perhaps I'm not - but sweet, and friendly and once they get the hang of not opening bottles of prosecco like they're weapons and almost taking patrons' eyes out, it will be perfect. Canapés were great - sausages with mustard glaze; mini Welsh rarebits; bite-sized Yorkshire puddings with beef; asparagus spears in puff pastry. The mgmt recommended a great DJ too who played just the right mix of motown classics to keep things moving. Great location for a party - and if you want to continue on after they're shut, head down to their other pub, the London Fields on Mare St.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RsndL-TefkIBXOIGu8lNEg": {
    "date": "12/3/2008",
    "text": "I quite like the Cat and Mutton. Beautiful pub, beautiful crowd, beautiful beverages...what more does an East London gal need?Yeah, it gets pretty rammed most nights, but it's always host to a good group of people and great atmosphere.However - it doesn't boast the eclectic board game range of The Dove down the street, and if you're like me, you'll appreciate a good game of Cluedo on a wintry Sunday night...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "gDDEBjEMhpemNE8581XIWA": {
    "date": "11/29/2008",
    "text": "If you like your pubs trendy minus the Clapham-esque middle of the road gastro-pub type vibe then The Cat and Mutton might be for you. On any given day The Cat and Mutton is heaving with London Fields' finest, and with good reason.With plenty of seating inside and out, an upstairs area that occasionally plays host to screenings, and serving some damn fine food, The Cat and Mutton is the Rolls Royce of East End pubs.Try The Cat and Mutton's delicious Bloody Mary's for a Sunday pick me up but arrive early if you want to bag a table. This place fills up with East London's media crowd faster than you can say 'pedigree pooch'. Of which there are, tellingly, a countless number.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j8fZ1NtpZ4ISiNl7xL6rjg"
  },
  "ojWsDv6HcP2MxoE_v1lj1g": {
    "date": "11/28/2008",
    "text": "The Cat & Mutton has an interesting interior with large tables which you might have to share.  It is a nice pub that usually attracts the cool young things who live around London Fields.  It has a mixed reputation since some people will love this kind of crowd, others will hate it.  Either way, it is a pub that is always buzzing and a great place to come on Saturday or Sunday afternoons on a sunny day.  The seating outside is comfortable and if you can't find anymore seating anywhere, the crowds just tend to stand on the pavements with their pints for a smoke or a chat.  They serve a very pulpy, but delicious bloody mary, perfect to settle your stomach after a hangover.  The upstairs is not always open, but when it is, it is usually a pleasant space where they often host comedy nights.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KNFLFjyfR2T95kjHcNun1A",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KNFLFjyfR2T95kjHcNun1A/o.jpg"
      },
      {
        "img_id": "4lDGfp5q9I2feq6Jx_4z-A",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4lDGfp5q9I2feq6Jx_4z-A/o.jpg"
      }
    ],
    "user_id": "O3CZ6ePrFYCNKks3xCaaMQ"
  },
  "LUgt-BS2bc5te-8WkBGnYA": {
    "date": "3/5/2010",
    "text": "Had a lunch here, the food quality was excellent as was the beer. Even if i did stink the place out with the smell of kippers for an hour. The staff were a happy bunch and pretty quick on the service. And the atmosphere was light and friendly. All in all it is definitely worth coming in here for nice lunch meal. Seemed packed in the evenings too. So a popular young locals pub",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DWlBQenAFp_Pg1sN4G24zA": {
    "date": "5/16/2009",
    "text": "Everyone knows of my Love for the Dove, so why am I reviewing this place? Well, it all happened by accident you see; I have a group of pals that I go on holiday to the US with who just can't stay away. I say to them 'so, see you to the Dove?' they reply 'No it's gota be the cat and mutton!' So I end up going with the majority vote. That's proportional representation for you! It is just that tiny bit pretentious; lots of plaid shirted boys with floppy hair and girls with ballet shows and pea coats - but it's not unpleasant at all. They do coffee until closing time, which is really handy when you're flagging on the way to a big night out. The beer range is focused on the ususal popular staples, as is the wine list, but let's face it: you're not going there to drink if you're honest are you? You're going there to be seen. On any given sunny sunday (of which there have been a few I happily note) it looks a bit like London Fashion Week has descended onto a tiny corner of Hackney. I also noticed that many people just buy booze from the offy next door and stand near the throng outside the pub for some credit crunch posing. Come for the eye candy and the trashy East London glamour; don't go if you're after Trappist ale.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WxfJobvdHDtePUEJwf-Isw": {
    "date": "11/24/2008",
    "text": "Another really popular place at Broadway Market - this place is incredibly crowded all the time!! Maybe the combination of bar restaurant and the location at the end of the market -with a view to the park and having 2 floors - this place seems to be constantly going. Night or day outside or in - it is busy. Not particularly child friendly this is really an adults arena -the food is quite good  - but my feeling is this is a great meeting place and really more of a pub - You have the feeling people are more interested in coming here to go out , pre-going out or having a couple of daytime drinks.Or perhaps alot of daytime drinks....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Yh2gOf3p21baLlqK4J4gw"
  },
  "tdFgyFqFgv2V1ynFIWJZxg": {
    "date": "11/18/2008",
    "text": "Like many others, i find this pub a bit exclusionary. The location is amazing, but it's just too cliquey for it's own good. Food is pretty pricey, although they do a great Sunday Roast. I'll always remember visiting here when an acquaintance worked here and discovering a poo in the toilet - so trendies poo?! Who'd have thought it! The upstairs of the venue is available for private hire, but they only have licence until 1am so it's not the place for huge nights. Good if you can squeeze in for a Guinness after perusing Broadway Market, I'm never overjoyed with the place.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "dFBdJez6xQOYX9ZLXyyI2Q": {
    "date": "1/16/2011",
    "text": "Great spot to bring some food from the market, grab a pint and drink and eat at the outside tables with some people-watching plus!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "4olRJ-DOre8RRCw8KZ6FfQ": {
    "date": "7/28/2011",
    "text": "The beautiful people, the beautiful people, all hail the beautiful people. This well traversed pub does good beer, good food and good atmospheres. More fashionable than backstage at a LFW catwalk, this is one of the best spots post a Columbia Road Flower Market wander to people watch and gawp at cheekbones and skinny jeaned clad men and women. Not for the insecure. And not for everyone: haters call it \"C**ts Corner\".",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8Yhb8kucsa6b3Sxr0TW9Q"
  },
  "77vRKP_ujhMbJ1Km1-KE6w": {
    "date": "5/1/2011",
    "text": "Had a weekday lunch here as it's the school holidays. Was very good and cheaper than in the evenings. Had tried to go to 'Off Broadway' to sample their new Mexican menu but alas it was closed. Still Cat & Mutton did me a tasty burger.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5H1trMcZZAa-yfg_BbQ-w"
  },
  "gCdeQ9ytpKRH2DqcBJHIpw": {
    "date": "1/28/2009",
    "text": "First up I'd say this is wrongly classified - it should be a pub or gastropub. Its heaves in the summer and gets 5 stars for location every time - right in the thick of Broadway Market. We stopped by for a Sunday lunch - you can't book a table, but arrive before 2pm and you should be fine in Winter. There were a few good vegetarian options; I had the Wellington which came with delicious cauliflower, spuds and mashed butternut. Comes with hot cheese sauce, but a distinct lack of gravy. The meat-eaters seemed fairly content with their lot. The selection of beers is fairly average, but what makes up for this, is its a great looking pub, with good staff, good food and a great location.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jjPwnk5KFHkwMs8TdWrs1w"
  },
  "QWTvLm7QNMNOfdsg5gs69w": {
    "date": "8/27/2008",
    "text": "Amazing food, great atmosphere, always buzzy and easy going. A great place to chill on a Sunday afternoon, perfect for a relaxed date or, if you can bag one of the big old tables, it's ideal for celebrating with mates",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WqPF1PFGCIKjsPRv9lqJkg": {
    "date": "2/16/2015",
    "text": "Feeling a little delicate and worse for wear on a Sunday morning? The Bloody Mary's here are AMAZING... now I'm pretty picky when it comes to Bloody Mary's (I prefer Bloody Caesar's over Mary's, being Canadian and all, so I'm a pretty tough sell when it comes to these drinks) but the ones they have a The Cat and Mutton are fantastic! Not too thick and perfectly seasoned. Yum. Sunday Roasts here are also worth checking out. Comes out really quick and are delicious and filling. If you're a group of 3+ I'd recommend getting the full chicken... the table next to us got one and we were all having a bit of food envy despite being ridiculously full from our own meals.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X-mk1qWLmg_H2LJxI46-Og"
  },
  "6X4MKHCly8PD3A0OHaKugg": {
    "date": "4/7/2015",
    "text": "The cat and mutton is a lovely little pub next to London Fields park, perfect for a stop after a nice Sunday walk. The atmosphere inside is interesting due to the dark decor and metallic touches but I must admit I was not too keen on the animal heads hanging behind the bar. It does give off a hunting lodge vibe though. The food is all right but I wouldn't say it's anything special. The skewers portion was full of vegetables and hardly any meat. Their Bloody Mary smells like a frat salad and tastes quite well though.What I really liked is that they have lots of board games you can play so we had a few intense jenga rounds and a game of snakes and ladders that took way longer than it should have. It was quite fun though.I would definitely go back there if I'm near the park as its a great place to go for a drink after a barbecue.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kyfUMEMxG7S5qJGpeCFXMw",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kyfUMEMxG7S5qJGpeCFXMw/o.jpg"
      },
      {
        "img_id": "8cdamRIBoyrbsdOGuhWw2A",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8cdamRIBoyrbsdOGuhWw2A/o.jpg"
      },
      {
        "img_id": "tnYHXVoN-bdvIAf19ef5pQ",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tnYHXVoN-bdvIAf19ef5pQ/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "2g24IU685ozmu4Hzdog9-g": {
    "date": "1/6/2016",
    "text": "Had an hour to spare before a meeting in the broadway market area on a sunday late-afternoon, so I thought I'd just sip a pint together with a good internet connection. Pint part went fine (although my Dark Star Hop Head was a bit flat), but wifi didn't quite work out and the bartender dude was, well, a bit rude. \"Mate, I've been trying to connect myself since 2 weeks and didn't work...now you distracted me I don't know what I was looking for...mmmhhh\" great. Thx. This inside looks, well, like an established 1729 pub looks like I guess : brown wooden ceiling, brown wooden floor and a huge counter, all this on 2 floors.An \"a-ok\" place I guess, but far from the quality spots broadway market has to offer.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "4Qzu3MooyeO_vB-tNiQ1RQ"
  },
  "Bim39gjJaj5u9kjW8LFfew": {
    "date": "5/2/2016",
    "text": "Good, well preserved gastropub by London fields with an interesting history of pig swinging (worth a Google)Typical East London decor with shabby chic interior.Good choice of craft beers, however only one cider on tap, which was spelt wrong.Situated within reasonable walking distance to Hackney Central, Hackney Downs, London Fields and Cambridge Heath Overground Stations.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jO1eixnTbhVj8GNGjjxpmA"
  },
  "fiBKC-8DAm6cfi_k9R7xwg": {
    "date": "9/16/2013",
    "text": "We took some friends on a stroll of the Broadway Market/London Fields area -- and were in need of some sustenance by the time we hit the gates of the park. Luckily Cat & Mutton is well positioned, and just as it started to rain (pour!). Great spot for a weekday pub lunch! We started with the olives and hummus (both served with warm sourdough toast), Mac and cheese gratin with mushrooms (made fresh in its own skillet!), fish n' chips with mushy peas, chicken club (the only slight miss, would've been much better on that wonderful sourdough -- instead it was soggy wheat that was pressed in a panini fashion), numerous ciders, beers...all very satisfying. We left stuffed to make our way back home in the rain. Service was great, too. Friendly, helpful, quick food that is made right before you in the open kitchen. I'm sure this place can get mobbed on the weekends, but for Friday lunch we were quite comfortable, had a wonderful meal and enjoyed the staff. Would definitely return.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "JE_ojrIH4lqcubu8410WEw": {
    "date": "1/29/2015",
    "text": "Where to start, for me this pub is as good as it gets - A perfect location matched with a vast array of drinks, food and quality service, what else do you need from a pub?Sitting at the top of Broadway Market, the C&M is always a hive of activity but given the size of the place, it rarely gets too uncomfortable. I've been coming for a few months now and never struggled to find myself a seat, table or little booth to enjoy a few pints. Started coming here after work on a Friday evening but this soon turned into a few more evenings, and now I rarely leave over the weekend! It's a really unique pub, huge ceilings on both floors, and plenty of space to move about. The vibe in here is more than friendly, the bar staff are all keen to have a chat and just enjoy the few hours or drinks that you're going to spend there.In the week, you have a great Wednesday quiz night which is challenging but certainly got a sprinkle on fun in there (paper aeroplane round!) and the food is more tasty, quite reasonable too.During the summer days, the place is even more perfect. With London Field directly opposite people just pop in when they can and with the amazing saturday market right out the door you can't help but pop in. I'd more than urge you to try this pub out, it's worth going to the area to just sit back and relax. Perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FYqdClyfBa5mzh2kotOCwg"
  },
  "-v8gXKaaaFV8KplBxVZItg": {
    "date": "4/12/2017",
    "text": "Atmosphere ok. Good beer. Very slow service and unattenting. Should write more here, but nothing more to add.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmijiemk-AujbQUd5yHppQ"
  },
  "a1PprbMKBWsbvs4dzLkvmg": {
    "date": "11/29/2015",
    "text": "We were visiting a friend in Hackney. She quit drinking, and we'd been walking for a while. So, we popped in here for a quick pint before dropping in on her. This place is right by London Fields and gets a good crowd. Certainly when we were there, and the funk and disco were fun. We were tempted to stay longer, but we had other places to be. I would definitely go back here.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WEoKFyAYFaaVrRRoXcALoA"
  },
  "4oD72fHYCo144JnvzvLaiw": {
    "date": "4/15/2015",
    "text": "I had been so excited to finally try out this local pub's Sunday roast offering! It was Easter Sunday and the place was rammed but we managed to scrape together a table for our jolly group and enjoy the buzzing atmosphere. We decided to opt for the chicken roast between 4 people - it was a beast of a bird and absolutely delicious!! The only downfall was the accompanying veg - a little sparse and on the dull side. Our Vegetarian companions enjoyed their veg wellingtons and we had a super time digging in and downing our pints!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "94WUyt6ZNGoTq2i-WP6iqA",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom. Chicken roast for sharing - delicious beast!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/94WUyt6ZNGoTq2i-WP6iqA/o.jpg"
      }
    ],
    "user_id": "XfA448q7c0008RmLVu_TLA"
  },
  "G9jmgYq3zqLCTGhsTSWq0w": {
    "date": "11/9/2013",
    "text": "The gateway to Broadway Market - great atmosphere and cool crowd. I've been coming here on and off for about 5 years and have always enjoyed it. It would get 5 stars if it had a better range of beers as what they have is a bit of a let down, particularly when so many pubs have such a good range of proper beer these days. With the London fields brewery two minutes away you wonder why they don't have their beers on their pumps. Weird. We took some friends here last night after dinner and got a nice table and bottle of wine - the music was cool and the service quick and friendly. We will be back.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "vqw44UwJzI2DbhduLexI3A"
  },
  "WgBcbAQ9dLRh9uHqfZjpBg": {
    "date": "6/27/2015",
    "text": "The beer selection is ok, the battered asparagus with duck egg mayo is great, but sadly the music is so generic and boring.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGFZcvk3k-0NOz-5791TiQ"
  },
  "O8pHw0MwiuCYLy-AyTCKxQ": {
    "date": "9/1/2010",
    "text": "I'm going to have to have words with that fella out of Ghost Busters. You know, the one that sells tires? Well he has this guide book, the Michelin Guide, and apparently the Cat and Mutton has had it's pride of place in that book for quite a few years now. I think they were mistaken. I think this is another pub. The aliens have landed and used their transport-zapper beam to put in it's place a pub filled with twats and over priced beers. Oh and don't forget the rude and tutting staff from behind the counter. \"Oi, you with the thick glasses and a haircut your half blind friend did in your squat. Yeah, you! Don't tut at me. I live here. I live on this street and am paying you money to give me liquid that will make my day rosy. Less of the tutting okay mate!\"Alright, I didn't say that. I paid and quietly went on my way. But I was thinking it. And I'll think it again next time I go in there and get tutted at, and the next, and the next!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "KNA6AnbhwcBRc-8qaJ6ntg": {
    "date": "12/9/2014",
    "text": "This place is always SO CROWDED every time I go!  Very hard to get a seat, and not a great selection of beers on tap.  All the while, because of its location on London Fields, it is an uber convenient place to meet up in the neighbourhood.  Was recently renovated, toilets are a lot cleaner now!  Great music too.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KgJdBWS3ReP6TVhYWJRKmg"
  },
  "fB1Pla75nxEqPk5_hdqy_g": {
    "date": "8/31/2014",
    "text": "We came here for a couple drinks after a big meal. Their cocktails are great! Watermelon cooler was amazing. Atmosphere was great. Good tunes. People dancing. Crowded & hot but still a lot of fun.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_J_bJ6wAS0ejMxFa2RJLw"
  },
  "yPx1nGRR_Ji3aJMK4CtI7Q": {
    "date": "11/16/2008",
    "text": "I'm not sure what I feel about the Cat & Mutton. I should like it. After all, on paper, it has a lot of things going for it. Its got delicous food, it serves a wide range of drinks including a fine Guinness, its spacious and airy inside and there is rarely an evening when it is not full enough to have some sort of atmosphere going on. In practice I avoid it. Something about the vibe created by so many young, alternative and utterly, utterly self-concious people puts me off. I really feel when I go here that I am entering the private members room of a club I will never be offered a membership to.If you are in the area on a Saturday and you are not as bitter about the Broadway set as me, then you can do alot worse than a swig of a bottle and a giggle at all the odd people on the crowded pavement outside. But for me that appeal wore thin pretty fast and I now usually go to the Albion, the Pembury Tavern or Bidels if I'm drinking in the locality.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KQpnBtx8FiRN-kKobKga1g",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KQpnBtx8FiRN-kKobKga1g/o.jpg"
      },
      {
        "img_id": "XVhvgeI5zzeTy3dMNH3dRw",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XVhvgeI5zzeTy3dMNH3dRw/o.jpg"
      }
    ],
    "user_id": "ZXU5C5DdmLEnYvvoLv7hSA"
  },
  "2dV6GaEF8Sjs9KxnKy78Mw": {
    "date": "5/19/2013",
    "text": "On my Friday night visit this place was packed to the rafters with an uber trendy crowd displaying the usual assortment of manicured beards and amusing haircuts. It has a cool vibe, and the drinks selection is decent but the layout is a little sparse (essentially just one big room scattered with tables and chairs). It somehow lacks the cosy feel you expect to find when you approach it from the street. Good place to start your evening I guess, but I prefer the Dove.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPdTkNkh6rftSewWJqfhrw"
  },
  "P-3maS0OF9-8Ld8BaTefbg": {
    "date": "12/20/2008",
    "text": "The Cat and Mutton is the epitome of the trendy East London pub. It has a prime location at the London Fields end of Broadway market, and at its peak is one of the busiest pubs around. The pub itself is lacking something. The main down stairs are is one big room with tables and chairs, which feels like a school cafeteria more than anything.There is a open kitchen to the left at the back and the bar is to the right. There is a nice symmetry and I like that you can see the chefs at work. There is never a shortage of staff, all dressed up and easily mistaken for customers as they seem to spend as much time socialising as they do working. Maybe they are working, maybe that actually are paid to stand there and look good. After all, it is all about looks in this pub.The food is good, probably the best pub food in the area. Although you may pay in excess of 12 pounds for a main course, it is worth it. The Pork Belly is amazing, a  traditional dish with a contemporary twist.I must say the table service is really good. If you're lucky, Andy, the General Manager, will take your order in his  informal, yet personal and delicate manner. As far as table service for pub food goes, he is the master. Throughout the summer, people flock to the Cat and Mutton both at night and during the day. The pub cannot hold the amount of people that come and the outside area seems to stretch (illegally) across the road. Unless you are after a pretentiously trashy, rowdy and broken glass filled experience, avoid the Cat and Mutton on a warm summer night.The pub is closed on Monday day time but open Monday night. It opens normal pub hours the rest of the week.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mTpsx4GRTCeFsOR5mRwk3g",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mTpsx4GRTCeFsOR5mRwk3g/o.jpg"
      }
    ],
    "user_id": "WXP9hhQKPItddmjB_5nTLQ"
  },
  "d7roi7Sojaj9J-VXxrfelg": {
    "date": "6/14/2012",
    "text": "When this place was first converted in 2004 from an old east end boozer the food was amazing, the best gastro food I have ever had. Food was inventive, not cheap but really amazing. Then the chef changed around 2006, around the time that Broadway Market was overun by Nathan Barley's from Hoxton Square and now its just full of style over content people that groom themselves to look like they have slept in a bush for the last week eating roast meat type nursery food whilst they ponder if moving here from Ladbrooke Grove was really the right thing to do, just because their friend Toby's dad bought a flat near the canal as an investment. We went here for dinner again recently, the gnocchi was solid and inedible and Suzi Quatro's Devil Gate Drive pumping out from the speakers made me want to stand on an antique piano stool dressed as a Chelsea Pensioner and throw up my own pelvis bone. It gets too busy too unless you go Monday-Thursday night....is this place a boozer or a restaurant??!!, I don't think it quiet knows, what I do know is that if you like eating sat next to someone who smells like a Sue Ryder shop but probably earns 75k a year for sitting in front of Quark all day then you'll love it. Service is erratic unless you have a 70's plastic jacket on and a goatee beard and a tattoo of a 'mystic' Hindu symbol on your lower left leg.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VYy-5qPOqiJDIRfffDxZ_Q"
  },
  "CpiuTj314ar-Nc-bQYlBiQ": {
    "date": "2/24/2009",
    "text": "Busy, bustling and full of E8's over spill lining the gateway to Broadway market on a Saturday afternoon. This place is legendary in the locality, harking back to the 1700s when it was originally called the Cattle and Shoulder of Mutton, a veritable feast indeed for the opulent period. Located just a few feet from the sprawling London Fields, I spent a rather pleasant afternoon sipping on organic cider and watching girls (sorry I mean) the world go by. Famed for their hangover-banishing Sunday roasts, the menu is moderately priced (mains £11-£16) with top nosh including the scallop starter and the melt-in-the-mouth seared tuna loin. The über-trendy staff are prone to pout and ignore your order though, so wave a cravat in their face if you're thirsty!",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "u1mcCpJH2UDYGkA3ENYBzg",
        "caption": "Photo of The Cat and Mutton - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u1mcCpJH2UDYGkA3ENYBzg/o.jpg"
      }
    ],
    "user_id": null
  },
  "cbdJ-kk-Dc5rN8P6wVHQ_g": {
    "date": "4/23/2010",
    "text": "Bethnal Green, Broadway Market and London Fields always used to frighten me. I had read fairy tales documenting their dangerously cool and relaxed vibe and because of this I had scarcely made the commitment to seeing some of my friends who live out in that particular mythical part of London. However, as I continue on my quest to slay the hydra of preconception I have successfully integrated myself into East London life with a plop. I think it must be the hair. Either way, my first sample of London fields life was at the Cat & Mutton and I thoroughly enjoyed it. Another place that just reeks of cool. Arty types, let's call them, with their trilbies and glasses of white wine, deck the seating area and without appearing pretentious the cool of the cool clearly utilise this establishment to laugh, drink and eat. I can see why. The bar staff were relaxed, but not so relaxed that they didn't attend to glass collection with military precision and food that was ordered was promptly delivered. I didn't have any, but it smelt and looked awesome. Outside there is a general sensation of how I would imagine it is in a Lilt advert. Super laid back and refreshing. Drinks are standard London prices. You're looking at about 4.5 nuggets for a beer and 6 nuggets for a double spirit and mixer. So not cheap, but the atmosphere in there pays for itself. From what I hear it really is the go-to pub for the trendy elite. When Broadway market is in full swing it can get a little ramo, but could go a long way to calming that busy street stress level. I liked it and I'm sure you will too.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "9idqYuy59hz49LS9yEPIqw"
  }
}