{
  "T2LqhCqoyR_0VTG81BBeEQ": {
    "date": "11/19/2008",
    "text": "The shop was only 2mins wlak from the station.The shop was very well designed and the eating atmosphere was great.The chicken in the site was really great and specially the sauce was very tasty.The service speed in the shop was also good as the waiting time was quite reasonable.In the expensive South kensington area,this is a very good choice for dinner.Drink is also unlimited refills which makes it even more attractive.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kTuUTk5kzx1q4hs_Xz2VoQ": {
    "date": "9/12/2009",
    "text": "While on visit to London I had to make sure and stop into Nando's to satisfy my craving for their peri peri sauce.   I've only been to Nando's once before, and that was in Malaysia.  I was not disappointed in coming back once more.   For a reasonable price, you can enjoy some delicous portuguese style grilled chicken and tasty sides.   I enjoy the hot chicken wings as well.   Service was friendly, chicken delicous and properly spicy, and sides excellent.   I am going to speak to management about franchising one of these in  NYC.   Can't believe they haven't brought it to the States, it would be huge here.   What can I say, i'm a big fan.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cG_KfnsOHB_c7EwZKMEnyg"
  },
  "FHHt_dIuI7Ua1dSG6HDFVA": {
    "date": "3/31/2010",
    "text": "While the service might be a little slow at times...its worth it bc the food is GREAT and they are always crowded when I go. I am a fan of the Gloucester Road location. I think I've had everything on the entree menu... and the sweet potatoes mash is excellent.  The chix is mouth watering.  Its a great U.K. food chain and very reasonable in price while not cutting back on taste.  Anybody visiting the UK should def step in. In case anyone is interested in U.S. location, they have one in Chinatown in D.C.  however ,the U.K. locations are much better and the menu has more of a selection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q5YzY11YJXF0VgM0G7bhtQ"
  },
  "iQBPVlErFXx3rPJxFKsynA": {
    "date": "4/3/2011",
    "text": "I love roasted chicken and I love peri-peri chicken and Nando's certainly fits the bill there.  However, don't go here if you're in any sort of rush - they are incredibly slow. Seriously, they only serve a couple of things so why is it is so slow?  In the future, I'd order ahead as it's really not the kind of restaurant where you expect to spend an hour eating dinner.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJPdONCqd0UNtvUaDRlkdg"
  },
  "9a9tu9mKwZgYU7XMM9BMzA": {
    "date": "11/15/2008",
    "text": "Better atmosphere and food than kfcs along the street. The drinks are expensive though, but they are free refills. There are two floors here, and toilet downstairs only. The food is nicee, got the chicken with peri chips. Always busy whenever I go and it adds to the atmosphere.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5JKbKzhfWghgljYl5dN_lQ": {
    "date": "11/19/2008",
    "text": "I absolutely love Nandos - and I'm vegetarian! I became vegetarian 3 years ago and used to have Nandos chicken a lot so thought it would be something I missed. However, luckily, Nandos have a great vegetarian menu. I usually have the bean burger which is really nice. To be honest, I think the main thing which makes Nandos stand out is the spicey flavourings they have - really tasty and unusual in fast food restaurants! You can buy the bottles for home too mmmmm! I like that Nandos is fast food which is healthier and tastier than most of the crap around nowadays! Would definitely recommend, particularly to people who like spicey food (you can get it without spice but I don't think it's as nice)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "a70LOpMxu8AOzMQMlc5VEw": {
    "date": "6/12/2009",
    "text": "Set back £8 -- typical for London, but I could've gone somewhere better.Place reminds me of Boston Market -- you order at the counter and get your food delivered to you. Lots of grilled chicken options - salads, wraps, burgers, pittas: I got the grilled chicken breast burger w/1 side (ratatouille). Lemon breast marinade was a bit too saucy for a sandwich... made the bread soggy. Blech.Maybe I'll go for the 1/4 chicken next time or do take out. Wasn't fantastic, but do-able.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qurv1eJZswxUZaZqN53Meg"
  },
  "6JHCUQhBsmEO1n4CJNIsDw": {
    "date": "10/12/2011",
    "text": "It boggles my mind that Nando's could have equivalent ratings to place where actual good food is sold.That said, Nando's is good for a quick bite if you're desperate and not in the mood for anything fussy at all.  This particular Nandos is 25 seconds from my house so obviously I eat here fairly regularly -- a half chicken after a workout with no sides does the protein trick quickly and cheaply (without having to clean the blender after a shake).The food is terribly inconsistent, esp the chicken burgers because sometimes cooking a chicken breast to perfection is tough and it ends up tough and dry.  The leg/thigh is the best bet because it's tough to ruin (unlike the corn which is awful -- don't agree with the previous poster whatsoever -- its terrible terrible corn).What irks me is that the chips are not usually fresh and 9 times out of ten I have to order chips, specifically requesting fresh ones, and when they arrive soggy, ask for another fresh batch.  This is excruciatingly frustrating when all I want are some chips, but the fresh ones are pretty good and the soggy ones terrible.A hint -- if you order chips get a side of perinaise.  It is the best dipping sauce for chips at any fast food spot that I can think of off the top of my head.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "gkGjbOsQXTZvo57-8wcSow": {
    "date": "9/9/2015",
    "text": "Came in for a quick bite. Food was prepared very fast and everything was great! Love love love the garlic bread. Servers were friendly and nice. The medium spiced chicken was spicy without being too much. Would reccmmend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhUQjdtMLDq7M8OK6BuKpA"
  },
  "jinWI3YljhB7GBPuIBNQMg": {
    "date": "3/18/2011",
    "text": "\"Naaaan doooooooossss!!!!!\"When you are hungry and complaining, Nando's is the perfect word to stretch out and annoy your companions with until everyone decides to comply and go with you :)I love Nando's! I usually get one of the platters of chicken and share with a friend or two, and get the four small sides of fries, garlic bread (omgyum), rice, and mashed potatoes (i.e. army of carbs).All of the sauces are great in their own way, and I love making a mosaic of them on my plate. Service at this restaurant is pretty good as well, though during rush hours the waitresses/waiters do seem a bit rushed. Last time though, three of our chicken wings were overly cooked and completely black, and the waitress immediately took them away for us and brought us three new ones!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UplI21UWrE01arN0oZ5bZQ"
  },
  "_8CdsrtgDtC3n6E4gUCOgg": {
    "date": "11/30/2010",
    "text": "I didn't know what to expect from Nando's. I have seen them everywhere so I guess I was anticipating your usual run of the mill quick serve restaurant. Nando's was different in their excellent service and their flavorful and creative plates. I would definitely recommend the chips with peri-peri salt and their chicken wrap with cheese. I got mine with pineapple but tried my boyfriend's and liked his cheese one better! Nando's is a great place to go and grab a quick bite after work or school, and they are open late, making it a perfect late night snack destination.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RORrWniaUl8nseq47oLOyg"
  },
  "G2khhMJqVb2rJfuuPb7Xjg": {
    "date": "2/22/2011",
    "text": "When I was leaving for my trip to London, my friend insisted that I had to try Nando's.  I think I may have had too high of expectations for it, so it came off as okay.  I got a Portobello Mushroom sandwich, but they gave me the wrong order.  Thankfully, they were friendly enough to bring out the right order for me.  Also, I wanted to try all the different sauces but this one table hogged all of them.  Overall, the experience was alright.  Whenever I'm back in London, maybe I'll give it another try.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3URiiM_5vqsaNlywokYauw"
  },
  "I88JQRlz-x6Gl3b6mkVB7Q": {
    "date": "1/17/2011",
    "text": "I was immediately confused by the arrangement of this place. An iteration of what could only be called a \"maitre'd\" greeted me in a rush and said table 7 would be available shortly. I've never been here before, I didn't know what he was talking about... doesn't matter, I just waited and watched.I ordered at the counter (though the layout of this place suggested to me there was table service, so I was confused by the motions/actions of the staff..) - I got a veggie burger, sans their special mayo. \"Medium\" hot sauce. And a side of chips/fries.The gentlemen who brought me my burger was congenial. The \"medium\" hot sauce looked like melted cheese; he informed to the contrary. Naturally, I was confused - maybe I was just hungry...The veggie burger was decent. The bread was great. The \"medium\" sauce was spicy and worth investigating another time. The one-leaf of lettuce was sad and paltry. The one slice of tomato was an afterthought.Overall  - I was just let down. For £8.75 I anticipated a decent meal of quality. Instead I was just embarrassed for this \"burger.\"The burger was \"meh...\" with a side of chips.At least the guy who brought the burger to me had sense enough to turned the music down when I told him I couldn't hear him explain to me what the \"medium\" sauce was... Yup - \"meh.\"",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMdOKOTiy9EdeFxUCkIu_w"
  },
  "bhdF6nz2GPBfK6sfeXJMaw": {
    "date": "3/20/2011",
    "text": "This restaurant reminds of a U.S. Version of Applebees.  But with ethnic food.  I had a chicken burger with chips.  Maybe i'll stop by again before I leave to test out one more dish. Our waiter was nice.  He saw that our table wasnot clean, and cleaned it up for us before we sat downThis place also reminds of 67 Burger in Brooklyn, NY because you have to pay at the counter instead of them coming to you    With a bill after you've finished your meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1BjWrzF69f5NP1vNI2H_NA"
  },
  "kMrFgC_MZCWq3GIAENlQNg": {
    "date": "5/16/2011",
    "text": "Having been to a few Nando's in my life, I've got a feel for whether a branch is a good'un or not. This one is pretty average, though having said that I've always been here with a very (about 30-40 people) large group and so maybe standards just slip with a rush of orders all at the same time. The food is usual Nando's fare - if you don't like chicken, you're in the wrong place - and bottomless drinks are fantastic. So to make some comparison I have to go on how much food I got, how well it was cooked, service and surroundings. Firstly, quantity. I probably got the most miserly portion of chips this time round. Usually Nando's fill your plate but not this time so I was fairly disappointed with that. I also had a double chicken wrap and was expecting a bit more filling (it looked like I'd just got a single one!). It was cooked well however and service was very quick and the staff very helpful considering our group size. I love that for large groups they take your name so that everyone gets the right food in the right order, though obviously if your name is a bit tricky it results in much hilarity listening to them try to pronounce it, as with one of my friends Welsh name! Lastly, surroundings. I love the look of this branch, highly amusing is the wall made out of drinks cans upstairs, and it's all very open and airy which is great. Overall a good meal, though I wish I'd had more of it!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nv63mTIgMWXmxyVr2t9daw": {
    "date": "5/15/2011",
    "text": "It's taken a while for me to come around to Nandos...and though it's still not my first choice of restaurant, I won't refuse a trip anymore. The chikcen is decent enough, but I tend to go for the veggie burger, which I'm actually quite fond of, and yesterday I tried the beanie burger, which was also quite nice. The macho peas are a great side, and everything else I've tasted has been done well and is full of flavour. This particular branch is one I've visited a few times, usually after a concert. This means that we end up going with a huge group of students, and often quite a few instruments too. They're always welcoming, and there's usually space upstairs for us to sit, no matter how many (although we do usually try to book it as well!). The only problem I've had with this one is...they didn't have any veggie burgers yesterday. Which lost them a star. That may seem a little harsh, but...well, if they have it next time I go back, we might be able to rectify that.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fot13OO0X4KXopBGiExzOw": {
    "date": "2/16/2015",
    "text": "We love Nandos and go to tbe Kensington High St. location 2-4 times a month. However this location is HORRIBLE! On our last visit we waited an hr just for a chicken breast! This time the girl taking our order refused to listen and put the order in wrong :/",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BuSSip-lMEOhZuCy-iUnIw"
  },
  "ZIzBAsXLBPsvzKy9Syqpaw": {
    "date": "1/1/2010",
    "text": "I agree, this place needs to be brought to the US! Look at the menu, order your food at the counter, then seat yourself! This is convinient for me since lately I've been hating sit-down restaurants because of the whole bill situation, and the fact that no one ever listens to me when I say \"separate checks/separate bills please\". Anyway. I had a chicken wrap. It was very good. I had a really fun time here with my study abroad mates, and a couple of Australian guys sat next to us and made the meal all the better, mainly because one of the girls in our group kept flirting with them and eventually got their number. Sigh.I would like to try the per-peri sauce someday.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NGhXWYWbSKj4sn-8QJzPJw"
  },
  "RNoWhUbD2I8ub3w7fFFOaA": {
    "date": "6/22/2011",
    "text": "No visit to the UK is complete without a visit to Nando's. If you like chicken, this is the place for you. All the food is well cooked, deliciously spiced, and cheap. I love love love the sauces that they offer (everything from mild to hot, herbs and spices, peri-peri, and the list goes on). The side dishes are all good, and even my vegetarian friends love it here. I'd recommend ordering the actual chicken, rather than a burger. If I'm in the UK, you can guarantee that I'll be eating at Nando's at least once.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vwt6fZzz0bFt3jlEY_S-Xg"
  },
  "Jgah9CrAWGSU-1-Mz-sA-Q": {
    "date": "9/8/2013",
    "text": "The chicken is the most tender I have ever eaten just wish they had a location San Diego . Went back twice in 4 days and will most definitely return again next time we are in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDcu_JwKc7R9EE1oX5QNLQ"
  },
  "Zk24ZN6EEAMZaGGCsgq-cA": {
    "date": "2/25/2009",
    "text": "Great food and friendly people make Nando's a go-to spot at any of their locations.I'm particularly fond of this location as it is the closest to my flat.There is not much to say about this place that differs from other locations.  They have great chicken, tasty fries and a fantastic new peri peri hummous.  Great for take-away as well!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mj7nr4MWGXSaJCytA6V-ew"
  },
  "9nuqFe2__pFEa3ajuyjRag": {
    "date": "10/23/2009",
    "text": "My favourite chicken place in the world!When will they bring this place to the US??Nando's has exceptional food, for a chain restaurant. They are always consistent and crack out the most amazing and flavourful chicken ever. How do they get their stuff to taste so good?The best part about this place is the sauces... all different kinds of peri peri sauces! You can even buy a bottle (or three) to take home.I have been to most of the locations, but the South Kensington stop is my fave. Not sure why...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3fs4D1gCfwkV-I6NkzpNaw"
  },
  "sazXuo20nN9BE_FqnkYd8g": {
    "date": "5/4/2011",
    "text": "Great chicken,  love the hot peri peri.   Good fries too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W9LRbr2dR63_mIYVAyydqQ"
  },
  "eciB_P07Xi3HyQiwrpVkmA": {
    "date": "9/2/2011",
    "text": "Out of most of the food in London... this restaurant really stuck out for me!  Really delicious food and I had a fun time with my friend, his sister and his friends.  The chicken was hella good!  & The sides were also really good as well!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5v8RvipZJsTlbWbs-HjSw"
  },
  "ePG12aID1VmVxlL24NivPw": {
    "date": "12/3/2010",
    "text": "really good service and the chicken is really good! they need these in the United States. I'll miss this chain when I leave England.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KyGkyqSPuJW-Sq7OXPVu2w"
  },
  "Fo6kCxZbvnsrlhLbHQhcfQ": {
    "date": "3/6/2008",
    "text": "Before I moved to London I had never heard of Nando's. I didn't know that it was a chain - the fact that none of their facades look the same probably helps that. But there was one across the street from my hotel so we decided to give it a whack. And you know what? It wasn't half bad. I ordered up a 1/4 chicken combo with some corn on the cob and my wife had a chicken sandwich. Both came quickly and were very tasty. The chicken was juicy and the fries and corn were both excellent. The nice thing about Nando's is that their chicken is grilled, not fried, so it's a little better for you. All of it was very reasonably priced. But I think the best feature of Nando's is free refills! What a novelty!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_gA_eNBoCPhbYZ79F-_HuA"
  },
  "4kB2BA8HDFbT1nPx3PcQ7A": {
    "date": "11/24/2015",
    "text": "I loved the wings and the corn on the cob. Enough said!!! With or without sauces--it worked for me!  The corn was grilled and sweet and I didn't need butter or anything else. YUM!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ymfXm8zzFAw5kBTsz9DbXA"
  },
  "crj3r2bt4ih-GmKPe3DqLQ": {
    "date": "6/27/2015",
    "text": "We needed something to eat and it was after 10pm.  The kitchens at the pubs had closed.  Nando's to the rescue.  It was our first time at Nando's and I can only hope they make a big push into the States as the food was delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzTsnjiZHor440neG4d_KA"
  },
  "bUDXAqFIMhlTKyN0ozKkAQ": {
    "date": "8/12/2014",
    "text": "Ate there while in London.  Wandered from the Holiday Inn near by and stumbled across this Nandos.  What a great little chain, as we found out.  The chicken with it's Portuguese spices was different than anything we've had in the states. The side dishes we had were the rice and chips.  Great seasonings.Priced well and fast.  Loved it!I wished we had these in the US.  They do, but only in the DC Virginia area.  They need to expand to the Midwest and Southwest where chile-based dishes are popular.When we're back in London, we'll be sure to check out Nando's again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5P4J6isIOngEkFsT17Gh7w"
  },
  "Bm6KUVNTXy_nRk6wkFZz3w": {
    "date": "4/16/2011",
    "text": "It was our first night in London and while the time on our watches read 11pm, my belly thought it was 6pm. American Airlines' surprisingly decent airplane food aside, I was hungry. My quest for food took me through the non-grid like streets of this charming London neighborhood of gardens, roads and...restaurants closing by 11? Past the last seating so no more eating?Let's try a pub which revealed a crowded scene of happy revelers drinking but not eating. There would be plenty of time for a London pub experience but not at the moment.What to do? Enter Nando's, a chain from South Africa serving up Portuguese eats. The existence and encounter with Nando's that night saved us from raiding the packed emergency supply of Kellog's Special K bars or hitting the local Tesco's. (Which we didn't know existed at the moment).The order of operations at Nando's is slightly different than most restaurants. You are assigned a table, complete with number, and peruse the menu. Once ready to order, up you to go to the counter, tell them what you want and your table number, pay and moments later the feast is brought to your table.Under the circumstances of near starvation, this non-traditional method may have been too much but then I tasted my first bite of lemon herb chicken and was suddenly asking why there isn't a Nando's in my home town of NYC. (Washington DC is the only bastion of Nando's flavor in the US).We ordered a meal platter which includes a whole chicken and two regular sides for 18.95 pounds. This was the kind of chicken where manners are cast aside (Why look, they gave me a real knife and fork, neither a spork nor one made of plastic!) and a full hands-on, fingers in, meat and skin deep delight just happens spontaneously.The creamy mash was a hit as side #1-- surprisingly sweet and regrettably gone in moments as we gorged upon our first meal in Great Britain. Side #2, garlic bread, was also quite good and fresh, an unexpected plus when the place is preparing to shut down by midnight.The vibrant multicultural 21st Century city that is London is served well by Nando's. It was a fitting place for my first meal in the Metropole and readily disproves the myth of poor eating options across the pond. And it earns extra points for rhyming with Lando (Calrissian, of course).",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "Kchj2U3yTo1hOZoiOkcErA"
  },
  "MTeksNVTqcan0JrF4vm4vA": {
    "date": "3/10/2012",
    "text": "Think grilled chicken with a nice charred and spicy crust. A bit dry, but what do you expect when you cook chicken like this? Not bad, average price-wise, I might go back to a Nando's if I was craving their spicy fare, but I wasn't particularly impressed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8ILkiNTE3OWBuhrpitKu1A",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8ILkiNTE3OWBuhrpitKu1A/o.jpg"
      }
    ],
    "user_id": "6mgYTBGN1Ig2thDBCjmLwQ"
  },
  "vIZiq3difAc31siEhVtBaQ": {
    "date": "7/26/2011",
    "text": "This is by far my favourite Nando's in all of London. Perhaps I'm a bit partial that it was less than a 5 minute walk from our flat. This particular location is great in the spring/summer time, as there are some tables outside along the road where you can sit outside and enjoy the bustle of the Gloucester Road / South Kensington area.What to order:* The chicken burgers and pitas are best. The reason for this is that the flavouring is more plentiful on these than on the whole/half chickens.* The peri peri chips are tasty. The peri peri seasoning makes them good. The ordinary chips are all right. (I'm not a chip girl)* The corn is tasty. How can you mess up corn though?Love Nando's and terribly miss this location! Can't wait 'til we can go back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VwNhTezcwcgPMbp1UoXmTg"
  },
  "nZx7ApcgTGqJsKJ1rNHLkw": {
    "date": "11/10/2015",
    "text": "Chicken food good! but long queue! you have a lot of choice in the list !",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlWLEKAlfgEyhhdYhLNS7w"
  },
  "GYknxESBKBYIKAeC1MQ5gQ": {
    "date": "11/30/2013",
    "text": "I'd never heard of Nandos before but I enjoyed it very much and will be going back. There's not an overwhelming variety but what they do have, they do well. There are some good vegetarian options as well. I've only been to this one but I assume the others are similar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mM5WfjfBOjuiw0eELmpbA"
  },
  "oMN4ZaWbg08E85PXGm6EQA": {
    "date": "9/18/2015",
    "text": "This is the best Nandos for customer service and quality of food. The manager, Mr King is professional and courteous making the dining experience there sublime.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A9-tzQPxZyzE7WjsqDVXQ"
  },
  "YgaX84eEXRPcDkelQZ5uyA": {
    "date": "7/31/2012",
    "text": "I LOVE Nando's. Great healthy alternative for a cost effective meal. It is a very casual environment where you order your food at the counter and they bring it to your table. They are most known for their grilled peri peri chicken, which is excellent. You get to choose your level of hotness on the sauce and I recommend hot!For salad lovers, I highly recommend the mediterranean salad with grilled chicken...hot! I hope you are catching my drift by now, go with the hot. Make sure you pick up a Nando's card and you'll get something free every 3 visits. I look forward to seeing you at my local Nando's in South Ken...",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KplKymEIusNFwo7GaR5f-w"
  },
  "orQ5MJcngfwhtY7pRQ04Ew": {
    "date": "4/12/2015",
    "text": "I used to love Nando's. Now its just another like fast food chain. I don't really like the chips or the mash. What I like though is the butterfly wings. Its veery tasty!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NHQwJFzPuKD9rKA6ANjQA"
  },
  "TIOXn-fpPGG4I-B8wihO5w": {
    "date": "5/6/2013",
    "text": "Nando's is amazing. My friends were raving about it for weeks before I tried out this place. I kept my expectations high, and they were met. I got the butterfly, which is great because I don't really like to have bones in my chicken. The hot sauce makes you work up a sweat. BUT IT'S SO GOOD YOU JUST CAN'T STOP EATING IT. Garlic bread is also very good; it's has a nice crunch to it. I do wish the portions were a bit bigger, but I'm not complaining. Drinks are also bottomless for around two quid so that's a perk too. I've bought their bottled sauces for my home as well!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9C-ldORiiB-iuT1uEZFVw"
  },
  "GhjV2qIkGIkQvm_dPr6KKw": {
    "date": "12/19/2010",
    "text": "My friend and I had no idea what to expect from this place. After a long day of hitting London's tourist attractions and then fighting our way home during the Tube strike, most of the other restaurants were closed and the pubs had stopped serving food. Nando's was the only (decently affordable) place still open, so we figured we'd give it a try.We ended up really liking it. Of course, we got carded when we tried to buy beer (and we are 25-26, NOT under 18) but at least the cashier had a good sense of humor about it. My friend had some sort of chicken burger, and I had one of the veggie burgers (I believe it was the one made mostly of beans), which was delish. Some things were a bit odd (trying to figure out where to get condiments, where the napkins were, etc.), but it was quick, cheap, and good, so no real complaints here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_laOfCHYOXa9CuUJRabhFg"
  },
  "m2zQgg5xFlfXz1BwQBYGGA": {
    "date": "7/6/2013",
    "text": "I was looking for a simple dinner and found this spot a couple blocks from my hotel.  \"Simple\" is an accurate description: you order at the counter, your meal is cooked quickly and the staff deliver it to your table.  The price was reasonable and the chicken is very flavorful, clearly due to the fabulous sauce.  If you're alone I suggest the boneless chicken breast with garlic bread.  For two (or more?) they offer what appears to be a (small) whole chicken.  Grab a bottle of sauce to take to your table, or you will miss the best part of the meal.Nothing to write home about, but I would definitely return for the sauce.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2RD6i2N5tG4TBFcRUExBdg"
  },
  "5kQPN_tgXCvsnttusvf2aQ": {
    "date": "10/19/2012",
    "text": "Excited to try Nando's across the street from my hotel, I expected something flavorful and unique but was instead left disappointed. I had the half chicken and was disappointed that they could not do all dark meat. Putting that aside though, the chicken was tiny and dry. Thank goodness there were several peri peri dipping sauces, which were interesting and flavorful. The peri peri fries were just normal fries with a sprinkling of seasoning and not worth extra money. The mushy peas are a London staple and an acquired taste. I liked them, but I can see why people may not be as into them. Overall I think Boston Markets, Sonoma Chicken Coop's, and Costco's chicken are all better that Nando's. One plus was the self-service soda and ice machine, both rarities in London.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0PYkotRgNgz4ZqAjGFzPg"
  },
  "-jA8dfEhivBi8Nb79IUmiw": {
    "date": "12/30/2014",
    "text": "On holiday, and decided to check this place out. Staff is friendly. The food is just as great as the service- even better! Their  chicken is worth trying!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8QkQ6vatgQd5omgCNJe4w"
  },
  "wyS4gUhF39r27ADiZhW5MA": {
    "date": "7/23/2013",
    "text": "First stop for lunch just before a client meeting, had high expectations from friends raving about it.   The butterfly chicken was just ok, the serving was a bit on the small side, and the rest of the food was just ok.  I have mix feelings about going back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0cqyRlrHjkXz2UJq14wZwA"
  },
  "zI_Y6wPSb7e_-Xr2SJSI-Q": {
    "date": "12/22/2011",
    "text": "8 years, 27 Nando's cards, and 5 different locations later (including South Africa and Malaysia), I would have to say this Nando's is by far my favourite.Location/Atmosphere? Great spot by the river, buzzing atmosphere and cleanly laid out. Family friendly, good for groups, business lunches, no need for booking, and you can even take out! Best during summer time. Food? After experimenting with the menu, I have found the chicken breast in pitta and chicken burgers to be the most satisfying and flavorful (remember to add cheese). Houmous with peri-drizzle & pitta serves to be a great appetizer, and the prego steak roll is surprisingly tasty as well. What makes it unique? Bottomless soda, PERI PERI SAUCE, company culture.Downside? Sometimes service can be slow and one can tell the chips have been sitting out on the counter for a while. The only other minor complaint I have would be the dryness of the lettuce and some of the other veggies in the pitta but that's why you douse it in peri-peri!Now all I need now is that Nando's black card...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B_EULMaAgPyzJCgHb4RMmw"
  },
  "czidM-QlF5oJTE_d3-JPwg": {
    "date": "3/22/2012",
    "text": "I went another route and got the grilled chicken burger. It was okay, not particularly memorable. I also tried the whole chicken another time and that rendered the same result as the burger. They do have a range of sauces I've never heard of before, such as peri peri, a sauce Nando boasts about. This is just a tip, not saying it is a bad thing, but you do order at the counter, it's not a waiter, waitress situation in here. It is a very casual environment.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SK8GL6W3De6phQVBqO59FQ"
  },
  "TRJdPiswdQG5Awd1DbhQaA": {
    "date": "2/12/2014",
    "text": "This is just really good chicken. Nandos needs to be everywhere. Are they in America? Or outside of the UK? The world needs u Nandos! Spread ur chicken wings across the world.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVfeE1yt6Zsm3sdia2ZHCQ"
  },
  "5CSR7SVZ5VimPPOLrkWyWQ": {
    "date": "9/28/2016",
    "text": "Yummy, quick meal with tons of options! Chicken was moist, not at all dry, and there are sauces on the side so you can help yourself. Average prices and good for those looking for gluten free options. Casual dining and quick service.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oU8TNICZU7cy580TOQIi7g"
  },
  "baYSHN64f5O2RScRfsIZOQ": {
    "date": "7/13/2017",
    "text": "Nandos came with a lot of hype but exceeded it's reputation for being pricey. Service was also a bit rude... dare I say nandos was a bit cheeky but not in the good way. This was a far cry from the service at places in other parts of the UK and a wake up call as our first london eatery. Chicken was ok but not nearly as good as what you can find in the united states. Everything there is over priced as well. Add the rude service that seems to care not about helping you and you get three stars. Their menu and ordering system is a bit convoluted as well... knocking this down another star. I don't recommend this experience. Go get a pizza or something if you want fast food",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XssD_J_RP0c2c2icg3Pcmg"
  },
  "-sdLXaHnnWitIOeNFinwxg": {
    "date": "3/23/2017",
    "text": "The food is amazing and the price is reasonable. I came here twice during my week long vacation in London. I ordered the Peri Peri wings medium with the spicy rice and corn. Amazing! My cousin is studying aboard in London and frequents this restaurant. The service is also great. The mango quencher is a must have.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zYn_bjfhrAOu_WCHMHAJmQ"
  },
  "LrMs4-ZY6J2oBqiD786wFw": {
    "date": "12/19/2015",
    "text": "What a neat little place. They keep it simple, fun, and don't compromise on flavor. Being 4K miles from home, finding comfort food can be quite a challenge. I'm one super lucky lady... I can see Nando's from my living room window. Anytime I need a piece of home, I am only a few feet away from happiness. They offer a little something for those of us who aren't able to partake in the chicken feasting. In the UK, I've found it a bit challenging to find a selection of good vegetarian meals. Nando's has nailed it!! The beanie burger was down right tasty! The peri-peri drizzle over houmous... Oh goodness, it's heavenly! The Fino coleslaw is a must try. Don't knock it till you've rocked it. For the meat-a-tarians of the bunch, everyone around me was snarfing up their food so fast, it had to have been scrumptious. It certainly looked it.  I am looking forward to many many many more visits to Nando's. Hopefully they'll have Sangria next time. Can't wait to try some!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gplibokkDnVAnIVDKwdJ9A",
        "caption": "Photo of Nando's - London, United Kingdom. Fino slaw, sweet potato mash, and the Beanie burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gplibokkDnVAnIVDKwdJ9A/o.jpg"
      },
      {
        "img_id": "uEBSH2USCgwTaPsZ81lkJw",
        "caption": "Photo of Nando's - London, United Kingdom. Houmous with peri-peri drizzle sauce!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uEBSH2USCgwTaPsZ81lkJw/o.jpg"
      }
    ],
    "user_id": "HS4jldXgyWEVJk-eA6A02w"
  },
  "-If5aYEsssZ3gOpSemSfVw": {
    "date": "5/14/2015",
    "text": "Me, my family and my friends all love going to Nando's when we're in the UK. Delicious chicken at an OK price, good for families and those on a budget. There is a seperate childrens menu with a value meal.This location has the same feel as other Nando's, but it's not as cramped as others I've been to.I recommend getting 1/4th chicken, rice and garlic bread, my favourite!If you like chicken, you can't go wrong with Nando's! And if you're loving the peri-peri sauce (which you probably will) you can buy some to take home as well.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iERlr1bK1RYjbWrlPmBEEg",
        "caption": "Photo of Nando's - London, United Kingdom. 1/4th chicken with rice and a salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iERlr1bK1RYjbWrlPmBEEg/o.jpg"
      },
      {
        "img_id": "x20qg7EwNuy3IkzESCWToQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x20qg7EwNuy3IkzESCWToQ/o.jpg"
      }
    ],
    "user_id": "TLH5qTPXSgMnJ7wZYCwP5Q"
  },
  "N9FK8b-nQhRJ5vRMbisHAQ": {
    "date": "6/5/2014",
    "text": "While studying abroad in London, I lived a block from this Nando's and literally came here 3 times a week! The food is simply AMAZING! Pretty much anything you order will be delicious. My all time favorites are the garlic bread and the chicken burger dipped in my go-to spicy garlic peri peri sauce. I'm drooling just thinking about this! Can there be Nando's everywhere in the US too, please?",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "0wv6sDHtz-nnuMqQ3nXZuA",
        "caption": "Photo of Nando's - London, United Kingdom. chicken burger and garlic bread. YUM!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0wv6sDHtz-nnuMqQ3nXZuA/o.jpg"
      }
    ],
    "user_id": "SaSXRzjHx3SMTNnW90PetA"
  },
  "gQ3AHMlAGbVOjkNZMLtV_w": {
    "date": "11/29/2016",
    "text": "Yes it's a chain, yes it's basically fast food, but it was delicious! We stopped in for a late lunch after several hours of sightseeing. It was everything we wanted--cheap, tasty and fast. Service was great, too! Can you bring Nando's to LA?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JAUc3gY_vpyvwPKHjMrxg"
  },
  "kLko_GqLcdQ_MwkbXd044A": {
    "date": "11/28/2015",
    "text": "A must-go when in UK. You can't come back from London without having to try Nando's chicken.I think Nando's was one of the best restaurants I've been to while at London. I loved the peri peri chicken which I got at the highest level of spicyness. And to be honest, I'm not even a big fan of chicken. However, the chicken at Nando's was so tender and well-seasoned, and went great with their variety of sauces.I highly recommend going to Nando's at least once while at London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nxWRNHxBy6vWXGiax4N4Hw"
  },
  "1k442u4SAb4BNNdbwJVMJQ": {
    "date": "2/2/2017",
    "text": "Apparently nando's is pretty popular place in london. Sort of fast food ish type of place. You order at the register and the food is delivered to you. They have many sauce and dressing options. I ordered chicken with rice and garlic bread. I must say I wasn't in love or impressed by it as people hyped it up. Maybe i didn't order the correct dish but when i tried to ask what was popular to the waitress i didn't receive much of a response. My friend is vegetarian so she got the salad with garlic bread. She really enjoyed her salad as it tasted fresh and the dressing was good. Don't get me wrong my experience wasn't bad but i just didn't see what the hype was as it was okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "inY1ZgVEp97p06nIFBUO4A"
  },
  "HfJ-qN80hLh9TnAqoVthOg": {
    "date": "11/6/2015",
    "text": "Meh. I love Nando's in the US, but this one here was just not all that. Not sure if they do different spices, or make the food more plainn - but it was not nearly as flavourful.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-O0O4RJy93KOV_aaC6WJA"
  },
  "sYXtRsSsSPuFRZtTVkBP8A": {
    "date": "10/22/2015",
    "text": "Cheeky Nando's definitely lives up to its reputation for good food that you just can't resist! I'll be coming back to Nando's every few weeks with the looks of things. It's not the cheapest place out there, but it's certainly unique and you won't get food like theirs many other places. Quality is great, prices are acceptable for what you usually get. Only thing I'd take a star off for is that it sometimes takes over half an hour for your food to arrive, especially when it's busy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLob_b2vhg4_V95-VMVdLw"
  },
  "6p7b3LJCbiP7o1DDqg8gQQ": {
    "date": "7/10/2017",
    "text": "Had always wanted to go to Nandos if in London. Went one evening in June. Good food. Fast service. Great portions. variety of sauces if required.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rhss-kCD7Nv3AqG4FNOpLw"
  },
  "sQkAuTVSe2olKp0YtOIMsw": {
    "date": "5/29/2015",
    "text": "I end up having lunch at this place, the lady welcome us and sit us, took our orders and had a great meal! All good, fresh and warm food were served",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTFRPW3KUfZJNPjzBHholA"
  },
  "hhR-qG7fN80wCt2iTtpDXA": {
    "date": "1/7/2014",
    "text": "Nando's is great! They have a nice variety of chicken. I like to think of it as a \"healthier, nice\" option to Buffalo Wild Wings. Flavors were great and sides were pretty good. Sangria was super tasty though not very alcoholic. However note- London is not home to Nando's! Someone told me it was and duh it's not. They have it in the states.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdlsVlZRFH7ZQ7cP8SFmvA"
  },
  "5lJA9rtoP6AvIEMrzrlLaw": {
    "date": "3/6/2016",
    "text": "Can I please open a franchise in NYC? Love this place. Such a nice treat every time I'm in London. Must try!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TMIsH18weTsQaUngFjcWug"
  },
  "43GJwSbn_h54H4_pfQjqYA": {
    "date": "10/17/2015",
    "text": "Cheeky nandos. :PChicken is all this place is really known for.The butterfly chicken at highest spice isn't bad, except I would probably recommend other people to go for low or medium spice since I am pretty used to eating really spicy stuff my whole life, and the chicken was still a tiny bit spicy for me.I can't call it fast food, but I can't call it fancy either, so I will settle to call it, \"casual\"?Not pricey, in my opinion at least, and is a great place to go when visiting London since Portuguese food is rare in America.It closes very late. Would not recommend to work there for the 11:30 pm shift. Fries are a bit dry, nothing special there, but anyways, this is a Portuguese restaurant and not a Belgian restraint right? Who am I kidding. It was a fine place and would recommend other people to it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DPIo1e1ebZPuYi0lsEm70g"
  },
  "ljH5vyMED1V4RmjAPePqEA": {
    "date": "12/28/2010",
    "text": "I stopped here in April 2010 for dinner.  It was a little late at night on a weekday so it was not very crowded.  I am surprised that nobody mentioned the upper level; there is a large seating area upstairs.They also have different sauces at the table for you to try.  I tried a few of them but was too hungry to do any real experimentation.I was a little disoriented at the setup; I'm used to only 2 kinds of restaurants; most fast food places require you to pay, then wait, and they give you your food (even if you are eating there).  Other restaurants seat you and then come to you to take your order.  As other Yelpers have mentioned, this place does it differently; you place an order and then go sit down; they will bring your food to you.I was very surprised at this take on fast food.  It was quick but not like the greasy, factory-made fast food we have in the States.I got a 1/4 chicken, medium hot, with chips (fries :-) and slaw.  Take a look at the picture I posted.  It was very good.  I could see coming here a lot if I lived in the area, which i unfortunately do not. Check my profile for more about how I rank restaurants.  I guess this would be a 2 star type of establishment, because it's considered 'fast food'.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0PL-6wt9_6M0J41-jgbYIw",
        "caption": "Photo of Nando's - London, United Kingdom. This is the peri-peri chicken at Nando's",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0PL-6wt9_6M0J41-jgbYIw/o.jpg"
      }
    ],
    "user_id": "p7RiGtUfifXYYfDcxcGcFg"
  },
  "2FHzchBScK-la--i3k6SPA": {
    "date": "8/14/2013",
    "text": "Came back here a second time, and I would definitely go back again.Don't get the chicken burger, wrap, or pitta. The chicken breast fillet that they put into it is dry and unsaucy. Opt for the 1/4 or 1/2 chicken instead! Mango & Lime seasoning is a must-try! If you do like it spicy, just add the sauces on the table. My favorite is the Spicy Garlic Peri Peri sauce.Don't forget to ask for one of the reward cards! For every three visits with a minimum purchase, you get a free menu item! It's such a good deal.Also: unlimited froyo. Mmmmm :DI'm back in the States now, but I really do miss Nando's.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJpfp-tqQ1Z4sXeNeUCiPg"
  },
  "2Hsxlta5NTKMfvIsEShT9g": {
    "date": "3/31/2013",
    "text": "On holiday in the UK we were trying to take in local joints and restaurants, however, this visit to a chain restaurant was intentional and with good reason...it was delicious! Super casual environment and I love that the kitchen is open and you can see the large grill where they cook up their delicious chicken! I ordered the flame grilled butterfly chicken breast (medium spice) with two sides. A delicious piece of chicken flame grilled WITH the crispy skin cooked to perfection :) As a carb lover, I chose the garlic bread and french fries for my side. French fries were pretty standard and the garlic bread provided was two slices of garlic and herb grilled bread served hot and toasty. They also have bottled sauces that you can add to your meal. I believe we tried the garlic and their standard peri-peri. The garlic was pretty hot! Aside from the chicken, one of the things I liked about this restaurant was the unlimited refills on the beverages AND the self-serve ice machine :) I had heard about the lack of ice usage in the UK and I hadn't thought I would miss it, but I did.The people here were friendly, food came out quickly and hot! Great little casual restaurant for a quick hot meal!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lglrSZ6iHFp_POFuM2nj_Q",
        "caption": "Photo of Nando's - London, United Kingdom. Street side @ Nando's",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lglrSZ6iHFp_POFuM2nj_Q/o.jpg"
      },
      {
        "img_id": "6jJSBMbh5QOR7VRGXbPGqA",
        "caption": "Photo of Nando's - London, United Kingdom. Funny napkin.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6jJSBMbh5QOR7VRGXbPGqA/o.jpg"
      },
      {
        "img_id": "pQWTIWq-z0MdiYzFyJ-YyQ",
        "caption": "Photo of Nando's - London, United Kingdom. Butterfly chicken breast (medium spice) with french fries and garlic bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pQWTIWq-z0MdiYzFyJ-YyQ/o.jpg"
      }
    ],
    "user_id": "fF96J8EaHKFoIecd2MHmnA"
  },
  "8U0dx_NfYKatmS8aukgwdQ": {
    "date": "9/4/2016",
    "text": "This was a quick and delicious meal. I wasn't crazy about the coleslaw side but the chicken and mash were great. Pretty much all the chicken flavours and sauces were good. But the spicy is pretty firey! Even the mild sauces have a bit of kick.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5KmaGA2fOE8INq4RS43_g"
  },
  "AIHL10h8rMLDqv3az-X2aA": {
    "date": "11/3/2018",
    "text": "Nando's was delicious! Had 1/2 chicken with 2 sides, peri chips and side salad. Chicken was juicy and flavorful! Ordered it with medium heat and it was perfect, not too spicy. Will definitely be going back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-EBm0HFKkqmjxNCsS6aC0w"
  },
  "Fx1N0_2Q6FuZamysYzyAFg": {
    "date": "9/13/2018",
    "text": "A truly wonderful discovery while in London (of course, the origin is not English, but South African/Portuguese)!  In a nutshell, Nando's is what \"Pollo Loco\" is to California, only better.  Well, in a different way, so no disrespect to Pollo Loco, but that's another story entirely. We came in here, hungry from our travels and we were utterly surprised, and pleased, about our discovery.  And judging by the lines (queues) of patrons flocking there, it is quite the popular, affordable place to eat in London! Generous portions and delectable chicken marinade that is sure to please the discriminating palate!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B9SfkMAQFHeBIScWmWwZqw",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B9SfkMAQFHeBIScWmWwZqw/o.jpg"
      },
      {
        "img_id": "ItEhjRV-xhdMw0LQDlVvdg",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ItEhjRV-xhdMw0LQDlVvdg/o.jpg"
      }
    ],
    "user_id": "LbDCzZNUqTYyvzKZYwUpAg"
  },
  "1pS6JpxoIpSK0vDeOHAXsg": {
    "date": "11/19/2018",
    "text": "Nando's has decent chicken at a reasonable price. The sides are pretty average. Mashed potatoes are good, rice is ok but a bit dry, coleslaw is a bit watery. Service was good and helpful. Overall just an average place to get some quick chicken. I would stay away from the sides and just get the chicken.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IKH75IfxndQc4KDf4EJWzA"
  },
  "tjUBnoJE1eRZvvflQxJdGQ": {
    "date": "7/10/2017",
    "text": "Ignore the negative reviews from idiots comparing this place to their favorite restaurant in Cuba or some other bs.  Here's the basics you need to know - for London you can feed a small family for £22.  They have unlimited fountain drinks, desserts and most importantly great food!  Where else can you find that in London???  Honestly - please message me because I would like to know.  Nando's is hands down my favorite fast casual restaurant.  Don't waste time with the fast food burger places down the street or Pizza Express around the corner.   You'll thank me later.  I would suggest the platter with 2 sides and 2 drinks for £20.  The side dishes are somewhat small but it's often people's eyes being \"bigger than their stomach\". It's more than enough food to feed a small family.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fg-_W3aHD2ut4GAmjTKiUA",
        "caption": "Photo of Nando's - London, United Kingdom. Nando's amazing sauces and unlimited fountain drinks.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fg-_W3aHD2ut4GAmjTKiUA/o.jpg"
      }
    ],
    "user_id": "Sy67On9-VPt96zOtBa8zfw"
  },
  "JDhyzS_tlX6OQLrT-Kr8Ng": {
    "date": "1/4/2018",
    "text": "My 1/4 chicken was great but the chicken sandwiches everyone else ordered were way too dry.The kids meal was a great deal but I would recommend sticking to the wings instead of the burger.The service was great and very friendly. The only confusion was when we first arrived, we didn't realize that we had to order first and then it was brought to the table.I would give this place a chance again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCGSTQ-1p3zpGGRXZFimNA"
  },
  "zHYcZkG5Uik9ymuEPKAsjA": {
    "date": "3/5/2017",
    "text": "There's a couple locations on the East Coast, but Nando's is a restaurant chain I would like to see in Los Angeles. We popped in for a quick lunch with a friend who lives in Bath. Service was pretty fast, we got our dishes shortly after ordering. The peri-peri chicken was very delicious. Parts of it were probably in the grill for too long, but I could forgive them for that. Did not have the chance to try the wings, which I regret now. For a fast food chain, the food they served was really good. The price was also pretty good for the portions served. If I could, I would enjoy a visit back here again in the future. Or, they can open a location here in LA!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_81ToiC9bjEFtgwe7bZmWQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_81ToiC9bjEFtgwe7bZmWQ/o.jpg"
      }
    ],
    "user_id": "wVhd99Kl7mIxVMQ_8L210g"
  },
  "QnIS_sEiSlrS4fzaR-AvLg": {
    "date": "6/3/2017",
    "text": "The chicken breast sandwich is very flavorful! I think the medium spice could use some more kick. Overall, the sweet bread with the medium sauce was a perfect combination! The service was ok but luckily the food made up for it!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "F6ORGvA31Elrp5cr2spDTw",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F6ORGvA31Elrp5cr2spDTw/o.jpg"
      }
    ],
    "user_id": "baIs9OsD3IHluIfzJ9JvPA"
  },
  "z6LiFjtMYHrO2WW6Q7ndaA": {
    "date": "3/24/2018",
    "text": "After a long layover and a night of visiting the local bar, I stopped in for a local bite. Very tasty but the portion was small for me. Other than that staff was very polite and helpful. Clean and friendly environment. Definitely go there again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DtzTZos7p8GOSOAKGjKpxA",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DtzTZos7p8GOSOAKGjKpxA/o.jpg"
      }
    ],
    "user_id": "NieiBWM7Xh69ylwZaRNiTw"
  },
  "ooin_r8IvykRGNN8EcuYQw": {
    "date": "6/18/2018",
    "text": "Chicken was soo good that I wish there was one in San Diego, CA. My daughters loved their Mediterranean and Quinoa Salads respectively! Service was good, the Sagres Beer and Portuguese Rose WiNe was flavorful. Thumbs up!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ENo2L0FTBGwk4RO8K532Bw"
  },
  "14aMsk9hQcmgpofif6xfdg": {
    "date": "6/20/2018",
    "text": "Great tasty grilled chicken with a touch of garlic Chile sauce on the side. Yummy! Great service as well, thanks to Maura!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZeSSjKkcJUiiy8hUemUIBw"
  },
  "Htt7ykSzZbtXJxG2qJJMBA": {
    "date": "5/14/2018",
    "text": "I had never been to Nando's and am gluten-free. There was a host at the door who was just so incredibly accommodating, I was a fan before even trying the food. He guided me through picking food so very kindly, was awesome. And the food was very good. I had 1/4 medium spicy chicken that was so tasty, dipped in Peri-Peri sauce. Cole Slaw was delicious and, last, sweet potato fries that were dipped in a garlicky sauce and then in a spicy seed mix (pumpkin, millet, etc.) I had a South African canned peach tea. Was really fun to have Portugese-South African food! :) Enjoyed it very much.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1MKixCMyn65E-z8uADZmyA"
  },
  "AFT-JriXeBwDR8UVq5tT-A": {
    "date": "8/8/2017",
    "text": "Too much hype...the food was alright, nothing to write home about, I guess I've been spoiled lol",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Wb3MwNwg-k7T2XNOTLDiw"
  },
  "T8cYuRO-f9BaQwiQ42FAOg": {
    "date": "6/14/2017",
    "text": "My friends and I have been having serious withdrawals ever since we left London, and one of the things that we really miss is Nando's. This place is open until as late as 11pm and their food is so addicting! It's perfect for both a full meal and a snack, as well as desserts such as tarts and bottomless yogurt. My go-to is their combo with 5 medium wings and 2 sides. Another favorite is their kid's meal, for when I'm not so hungry. Lastly, enroll in their rewards system, it has nice payoffs ^_^",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OcgPf5H6wL2J2d5vKbMEug"
  },
  "CJlNVl3GrqMEc8MjQaPjcg": {
    "date": "3/18/2018",
    "text": "Please give me more peri peri!  On a whim, and because the place was jammed, I decided to join the queue, and I'm grateful I did. Spicy and succulent, Nando's delivers flavor!  Don't miss the peri peri chips either.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J38b9ClTCCw3MTzj9xVauQ"
  },
  "w3gh2ZiWWH2RKf95fU-tlw": {
    "date": "5/10/2017",
    "text": "As they say, everything is relative to your own personal experiences. I guess the glowing reviews on here are from people who have not had great rotisserie chicken because coming from Miami where we have Latin and Caribbean influences on rotisserie chicken this place really falls short. Portion sizes are so small, ordered a quarter chicken and it was maybe 4 bites, chicken breast must have come from a baby chicken as it was about 5 bites. They have a million sauces to choose from because they don't know how to season and marinate the chicken correctly so they want you to throw a ton of sauce on it to mask the fact the the chicken is flavorless and rubbery. Ordered corn on the cob and mashed potatoes and those were bad too. Corn on the cob was terrible quality corn and instead of being sweet and juicy it was dry and mushy. Mashed potatoes were just that mashed with no butter or sour cream so again flavorless. Do not listen to glowing reviews, bland chicken and tiny portions make this place a no go.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YyIZ9k25BcE1i94kDzq64Q"
  },
  "2b9lSlcfS9NXxsgyFArXgw": {
    "date": "7/31/2016",
    "text": "Oh Nando's. What words can I use to describe our long distance love affair? As a flight attendant for a US based carrier I often find myself in cities around the UK. No matter how hard I try, I can not keep myself from NOT popping into a Nando's for a quick and tasty meal while on layover--and all for less than £12 (with drink). Is it a chain? Yes. Does it serve semi-basic food? Yes. Do I love it? Yes. It's quick, it's easy, it's consistent, it's delicious. Can't wait to be back for my next round of medium chicken wings with table added Lemon-Herb Peri Peri sauce. **drool**Rumor has it the chain has made its way stateside, to the DC area, but I haven't made the 2 hour drive from Philadelphia yet...",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Vo6T7NmnAcWM5HsQgWYehQ",
        "caption": "Photo of Nando's - London, United Kingdom. Food menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Vo6T7NmnAcWM5HsQgWYehQ/o.jpg"
      },
      {
        "img_id": "gi86HdvUcW0l5Kq429l2IQ",
        "caption": "Photo of Nando's - London, United Kingdom. Food menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gi86HdvUcW0l5Kq429l2IQ/o.jpg"
      }
    ],
    "user_id": "ZkJdOOQtyhrwOH9MfgPQrw"
  },
  "8UszQVHkT93dt12FvLcVjg": {
    "date": "3/18/2017",
    "text": "Absolutely legit fast service chicken and side dishes! I got the butterfly chicken with the mango lime sauce and spicy rice and sweet potato mashed and it was absolutely delicious. You can't go wrong at this place! My wife had this flat iron steak sandwich and the steak was good enough to eat by itself",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2ZrEC4cDJdwWFIMjMQiQg"
  },
  "4XxQb6CcmyJoYhYa98QQ9g": {
    "date": "6/14/2016",
    "text": "Want chicken wings? Come here. I have to admit that I first learned about Nandos from my little sister who was a One Direction fan (Niall loves Nandos apparently). You seat yourself and you order at the cash register. They'll bring the food to you. You also get your own plates and silverware yourself. They have assorted hot sauces and dressings to share and you can bring whichever you like to your own table. The chicken wings here are so juicy and tender, which is why I give them 5 stars. I got the 10 wing entree with HOT Peli-Peli sauce. HOT was pretty spicy for me, they don't underestimate their spicy. The Peli Peli chips are yummy too and a tad bit spicy as well. (Chips in the UK are like fatter French fries with more potato, not potato chips which are called crisps). They also have three options of sangria which are yummy and great for sharing. It's pretty sweet though, as sangria usually is.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jw-d7oi3EUM8ArkjhDCbVg"
  },
  "QjP5f8zIR-hSRx2ab8HGjw": {
    "date": "1/12/2017",
    "text": "It's a very nice place for lunch or dinner.  Tasty food, good service.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qUAF909bO_LORKGL8oPVsg",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qUAF909bO_LORKGL8oPVsg/o.jpg"
      }
    ],
    "user_id": "cvLoMAXNCnAhDOthqTBalA"
  },
  "WKhWsXrRHBQppeLlbex4oQ": {
    "date": "6/20/2017",
    "text": "Yummy! This place was great! I had chicken and sweet potatoe fries. You can get the chicken plain or with one of the many sauces. It's a butterflies breast cook to perfection. The potatoe was served with yogurt and seeds. The best part was this is one of the only places in London that gives free refills on soda! That was a highlight for me considering I'm from the usa.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LH_kZZJuYSaVvz34dvfVmA"
  }
}