{
  "8-d6-LO-pcvuYz-GUICb9w": {
    "date": "10/23/2012",
    "text": "What an original Fast food! We do not have these restaurants in France and I deeply regret it! The food is quite good and particularly the sauce is great!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "m1shUiUvhpdIbd6RbtMf2w": {
    "date": "4/27/2010",
    "text": "This branch is way busier than it looksbeware if you walk into the bar upstairs, which can look like a haven of tranquility compared to the rest of the area on a busy eveningyou will be escorted down into the chaotic underbelly where 2 cashiers try and cope with a never ending queue of hungry punters. Once my food was ordered mind you, it wasn't long before I was digging in. After a recent post meal painful mouth experiences at Nandos I tried the medium instead of my usual hot or even extra hot choices. It was ok, but not as nice as usual. I guess I equate pain with love as I will most certainly be back on the hot stuff next time",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "FiYe1s02Ujo06brlW9o1nQ": {
    "date": "8/23/2010",
    "text": "Great chain for Rotisserie chicken lovers!  They offer the chicken in a variety of flavors from hot and mild, to lemon and herb with a great assortment of sides!This place can accommodate the heaviest of meat eaters, to the most picky vegetarian!A must try is the Peri, Peri Chips!  This location has a great bar upstairs to have a drink before a play in the west end...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZqbnAOl8TOOR5NZwUWmwg"
  },
  "msRl5Gl5Db-955ZVtMlRWg": {
    "date": "6/26/2012",
    "text": "I like this Nando's better than the Holborn branch, the food's exactly the same but the atmosphere just seems far better. Tasty chicken dishes as standard for Nando's and at a price that won't break the bank.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "esLEbkeUWelYnnQMZ_UL4g"
  },
  "qb-o5mH7WsTcbs6cxKVGEw": {
    "date": "5/29/2010",
    "text": "I try not to eat in Nandos and tonight I am reminded why. A nice day at the theatre and a few drinks in town were ruined by poor service, ignorant staff and lack of organisation. I cannot believe we waited 30 minutes for food. All the plates came at different times and worst of all the waiters didn't know our table numbers. How can a busy West End restaurant not know how many tables they have or where their tables are? When the food arrived it was cold and some how two orders arrived on the wrong table. The service calamity lasted long after we had finished when a waiter asked if we were waiting for food! I didn't see the appeal of Nando's before and now I am even less inclined to use it. A joke. Avoid Nando's. Especially in Covent Garden. A joke.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQ2hhIr2q94RBOFKYu_nUg"
  },
  "x3hQaQNYlYhiO76oK8BvQA": {
    "date": "1/8/2010",
    "text": "As the reviewer before said- average Nando's really. But that's not to say that an average Nando's insn't pretty great in the grand scheme of large chain mid-price restaurants. This centrally-located one offers a medium sized basement with lots of quirky booth areas for small groups and a couple of other tables on the ground floor where an additional serving area is situated. They also do lots of take away, with an average waiting time of 10mins for those who'd prefer to take back to their desk or munch in a nearby park on a summer's day. I just went for lunch now and had a particularly delectible beanie burger in a pitta with extra halloumi and it was delicious (all washed down with the South African Merlot, which, at less than £4 for a 250ml glass can't be bad...). Don't forget to order a pot of the Peri-naise - the final touch on those great Nando's chips!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQbG5uIXInBcBMTnOKpqfQ"
  },
  "y0oZb9obzQu0VuCaRuH5Kw": {
    "date": "3/29/2010",
    "text": "Fairly good meal quality, in particular excellent chicken, at a low price. Compared to other Nando's I found this one quite noisy though. It was difficult to have a conversation on the table. This might partially because of the large room which, when full, naturally provides a lot of background noise, but I also found that the background music was louder than usual. Because of its central location between Covent Garden and Trafalgar square, it gets crowded in the evening, and this can cause long queuing times for placing the order at the counter. Here too, one more employee at the counter would improve the situation considerably.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_IUkuBneQcz3ufUICepDtw": {
    "date": "12/19/2008",
    "text": "I am a vegetarian and I had never until yesterday ever considered going to Nando's. Firstly, I don't like chains, secondly the whole place is centered around chicken - not the best sign for a veggie!However, I was invited out with old school friends and that's where they chose to meet. I quietly grumbled about having to go there and basically acted like a snob about the situation.I was proved wrong. Although I'd never recommend Nando's for an evening out, if you're after some good fast food then it's excellent. And yes they do cater for vegetarians with more than a few options offered. I went for the vegetable pattie burger with fries and was nicely surprised. I was also quite excited to sample the infamous peri peri sauce, which was delicious (I opted for medium heat, but you can choose from a scale of mild to extra hot).The place itself reminded me of the type of restaurant you find in a theme park - a theme-bar infact -  informal, bustling, and a little over-the-top. It felt a little surreal but comfortable too.So, although I won't be hurrying there, as its style isn't what I'd choose, I can now say that yes, I do like Nando's and I certainly won't complain next time the occasion beckons.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnRGniwBA5vYvlHo7A3OHw"
  },
  "gkVV1E44pOC6RPFb_S7Dhg": {
    "date": "1/19/2014",
    "text": "Nando's is a great semi-fast food restaurant in Covent Garden where you are seated and walk up to the counter to order your food. Portuguese-inspired chicken dishes include quarter, half, and whole chickens, chicken pittas, chicken wraps, and side dishes like chips, mash, peas, rice, and garlic bread. The food can be made as spicy as you would like to to be and is served with additional dipping sauces (the garlic-herb one is lovely and still quite spicy). My favorite is the chicken breast wrap with chips, with garlic-herb sauce for dipping. The service is minimal - you order at the counter then get your own drinks, silverware, and plates. Usually there is not a wait for a table, but at busy lunch or dinner times, a 5-10 minute wait is to be expected in the large restaurant. Nando's is also a good place to take a family at a reasonable price (mains are about 8 pounds or so, including side dish) as well. All in all, if you are looking for a tasty, reasonably priced lunch without too many frills or full waiter service, Nando's is a great place to try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F444bgdrAjQK-OgPPHH6gA"
  },
  "OwG9PSDwTT2216SntcB66g": {
    "date": "11/24/2009",
    "text": "A Brazilian-themed rotisserie chicken joint with the decor and music of a bar/lounge.  It's really weird, but kind of cool because you can wash down your chicken with pitchers of caipirinhas.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ouBdbXdi8_jmXJbgQ5Jq4A"
  },
  "VKR52QfQ-D9adB6ok7BgWA": {
    "date": "6/30/2010",
    "text": "Meals here can vary but in general it is a good place to go with friends, cheap and cheerful food and you each pay for your own when ordering. The best meal I've had there was before the evening rush, the food was fresher, hotter and there was a larger portion!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dfy8Vzd9DgnfKuhxd9HiOw": {
    "date": "9/3/2009",
    "text": "Average Nandos in the grand scheme of things, not too much soul about it!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "iTT_6Lj-HFO9gyWkb5EsVg": {
    "date": "1/16/2016",
    "text": "Home of the original Peri grilled chicken, Nandos is a classic high street stalwart for chicken. I generally try to avoid chains while in London, but actually Nandos has always been a good shout! The Covent Garden branch is large, spacious and due to its busy nature, I found that the chicken here was of much better quality than some of the other branches (chicken doesn't sit around drying out for ages!) I think overall Nandos tends to be a bit pricey overall, but just go for the half chicken and sides and you'll do just fine! Plus, the new salad/veggie options are surprisingly good selections and fairly priced!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7eG-rakZRHCGyEEELoTFaQ"
  },
  "Q7adr0-NJjfISGlZf8LI-w": {
    "date": "7/31/2017",
    "text": "During our stay in London one of the things we were advised to do was to eat at Nando's. We were told that we HAD to. No location was specified so with that in mind, we dined at the first Nando's we happened upon, which just happened to be near the covent garden station. Having never eaten there, our first impression of the restaurant was good - customer service was on point (we were greeted, the ordering process explained clearly, and we were seated), everyone from the person who greeted us to the person who took our order to the person who brought us our food were pleasant and friendly, and we overall enjoyed the vibe (from the decor to the music). Everything was enjoyable and added to our experience. And then the food sold us on this restaurant. My husband loved his chicken thighs and sides of salad and garlic bread and I was more than satisfied with my vegetarian option of the beanie burger, which was a patty made of a mix of chickpeas and lentils...what really made the food, however, were the variety of sauces, which we enjoyed putting on EVERYTHING. They are that good. We especially enjoyed the herb sauce and the garlic sauce. All in all we are so happy we got to visit this restaurant and will miss it when we return to the states.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lJ20f6_MdpXs-bQN8HfGA"
  },
  "UDmKcDyZlx1RY6lt2v-ldw": {
    "date": "1/26/2016",
    "text": "I go to this place a lot because of its location. I have to say as you enter you are disappointed because it is a tiny top floor. But you realise as with most neighbouring places that you go down a stairs and BAM!....a whole lair showcasing tables and kitchen at your viewing pleasure. It's lovely lighting down there with some cool booths too for larger parties. The service is dependent on you of course but everyone is friendly and the food bang on as usual. It's a great reliable stop off .",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "pjnfovSKiPlitRbjSF7wuQ": {
    "date": "10/18/2017",
    "text": "great food and nice service but not halal - location has good seating!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63IMh5ecRFWMfE2GpAzShw"
  },
  "Ak_zTbSsS0b-Rz0Otbg1MA": {
    "date": "6/13/2015",
    "text": "Ordered the 1/2 chicken which was flavorful and satisfying, enough for me and my husband to share. I liked trying all the different sauces, esp the garlic and hot sauce. Also had the green salad, mashed potatoes, and garlic bread, which were good, nothing special, since the star is really the chicken. It was nice to have a hearty, casual, but inexpensive meal during our few days in London and we wished we had had more chances to eat there. I thought I read somewhere on the menu that the chickens they serve are specially raised in Britain, but how awesome would it be to have something similar to this open in the States.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAteXiFPrLbJiyxHbHgfow"
  },
  "jhspAd4EKm33antpGFfq_Q": {
    "date": "5/7/2012",
    "text": "Chicken is locally sourced, service is attentive, and vibe here is fun!How it works: you order your food at the counter, be seated and the food is brought over to you. You can order multiple times from the counter. The food may not all come at one. Near the front is a wall of sauces... mild, to medium, to spicy, to hot, to extra hot. Just pick up a few bottles and try them all. The chicken is like a canvas, you can dip any sauce you want.It hard to sample more than a plate if you don't have a group, so grab some friends. No reservations, and it gets busy around 7p",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "pxFrX7iCYn8rLVfxVg9PQQ"
  },
  "jAXGuV4lOd09wSfrpf5QyQ": {
    "date": "10/31/2015",
    "text": "Nando's was recommended to me by multiple friends, so I decided to give it a try on my latest trip to the UK. Nando's is known for their chicken, and rightfully so. I ordered the butterflied chicken. I was worried that it would be dried out, but it came out juicy and tasty. The peri peri sauce adds so much flavor. The restaurant itself gives off an upscale feeling. Although our order like a fast food location, the wait staff and the dining area feel like a high scale restaurant. If you're catching a show in the covent garden area, I would definitely recommend dining here. It's quick and delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxAdA54opCf5_iqkkkIVtQ"
  },
  "IV-dLSnSTujVB2P38t58MA": {
    "date": "11/13/2013",
    "text": "What's a trip to the UK without Nando's?That peri-peri chicken really is to die for. Sadly, as an American, I only had a few chances to eat a meal at Nando's before leaving Europe but those times definitely count as some of the best meals of 2013. Yeah, I know that's pretty intense to say. My heart aches thinking of and missing Nando's as we speak, but I'll have to deal. Wings Wednesday, KFC, Buffalo Wild Wings, and Wingstop just really do not compare. Sigh.I love that their napkins have charming little phrases written on them. And I love that you can customize how spicy you want your chicken. And I love that it's a trendy, nice restaurant with a fast-food type of serving system. And I love picking up one bottle of every flavor of sauce at the stand and bringing them all back to the table. And, last of all, I love all the side dishes you can order -- currently craving the mushy peas and creamy mash thing.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "D8i9LE0cqcDDnM3ur5MT_A"
  },
  "6GW0GIAIywn3ASI7WhQzNA": {
    "date": "8/9/2014",
    "text": "I love the chicken and mash here! Their sauces are also absolutely amazing! I recommend the medium peri peri sauce and the mango & lime! They have lots of choices in their menu ranging from chicken, burgers, wraps, salads and much more. The chicken and mash is a must get tho!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E89eWRsSlM8lmz_zELA4mw"
  },
  "_n89eBCMEzv2cvcz3yuQwA": {
    "date": "12/16/2010",
    "text": "In central london for the evening, I picked Nando's over many other good options. So, for those of us that grew up in South Africa, Nandos was the first and best fast food joint. Nando's uses the Portuguese peri peri spice that was the standard for many mom and pop restaurants in SA,  Chicken is first marinated then slathered with Nando's own peri-peri sauce then grilled over open flame. Very succulent, spicy. Now not all of that translated from JHB to UK and mass commercialization/chain but enough did to make this a worthwhile and inexpensive mealGet the peri-peri livers as a starter (hot not extra hot), then follow with a 1/2 chicken.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fS4n5r00CGRgujNGHZ63KA",
        "caption": "Photo of Nando's - London, United Kingdom. Chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fS4n5r00CGRgujNGHZ63KA/o.jpg"
      },
      {
        "img_id": "uIbI-wbRCkjq-kV44B2AfA",
        "caption": "Photo of Nando's - London, United Kingdom. Livers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uIbI-wbRCkjq-kV44B2AfA/o.jpg"
      }
    ],
    "user_id": "X41L6PrYRtw1E_HYg2ZfNQ"
  },
  "cqX3Sw-RS0dS9KO7iszzfg": {
    "date": "6/15/2013",
    "text": "Having just moved from the states, I have never had Nando's before. When my friends heard that, they were appalled. It was something that had to be rectified... immediately. We came here for lunch with the advice of \"they're known for their chicken, so don't bother ordering anything else.\" I ordered the half-chicken and waited in anticipation. During this time I studied all the various sauces that were available and came to the conclusion that all of them sounded delicious and I must try all of them.The food arrived and it tasted just as it looked - well prepared, no frills. It did the job, and I had no complaints. I couldn't really taste the original sauce used to cook the chicken, so I had to be liberal with the 5-6 sauces I had picked out to try. All in all, the chicken was juicy, not under or over cooked, and the sides were well-prepared also.There was nothing special about the meal, nothing that absolutely stood out, but that's not a bad thing. It was everything I expected, and usually I expect a decent amount from chicken - as it's hard to mess up but it's also hard to get right (if that makes sense). Nando's gets it right.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8OsxfIHpYWeMMeEsowHRw"
  },
  "BtMqXCy2dxT74xEBr_tgBA": {
    "date": "4/2/2012",
    "text": "Nando's is amazing! I usually go to the one in Holborn, but decided to try this one out as it was a late sunday evening, and this one closed half hour later then the usual one. The service is horrifying. The women at the bar, had to ask downstairs if a table was available, and I saw the waitress downstairs throw her arms in the air in dispair (they were closing in 50 minutes, not 5!). She was cold as ice, and quite rude! But the atmosphere and decoration is amazing!! Satisfying good food, and love the bottom-less drinks!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "cND2Z0pvutZu_Fva_RlKPA"
  },
  "pcUL35MWa9pnx40xCUKLRA": {
    "date": "9/4/2014",
    "text": "Don't expect too much from this fast food chicken chain, and you will not be disappointed.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0WEEY4WHF4rvNkIdTHfSkg"
  },
  "gsRfv6SmhgTQv93QPIcY3g": {
    "date": "7/26/2011",
    "text": "Nando's is one of those guilty pleasures.  I think that, if it went on tastiness alone, this place would have four stars in my heart, but I just can't quite formally admit that on Yelp.The absolute attraction here is the chicken obviously, or, more specifically, the peri-peri sauce.  They have a range of different heat levels, and they're all a lovely blend of spices: they're definitely not subtle, but that's not why you eat peri-peri.  I've tried to replicate their chicken at home, but have never got it tasting anywhere near as good.  And frankly, I've given up trying as surely it's easier just to go to Nando's since, like rats, you never seem to be more than ten metres from one wherever you go in London.The chicken is apparently all British sourced and, though not free range (come on Nando's), it is at least Farm Assured: so they're indoor-reared, but not in such awful conditions as your average McChicken.The sides are all pretty good (in fact, the corn is really good).  They have a few unusual (if not particularly interesting) beers, and the obligatory soda fountain.  I've not braved the cocktails yet, but maybe next time.Ultimately, it's a perfectly decent branch of an uninspiring chain, but it's definitely a notch or two above your average fast food.  That spicy chicken is always going to keep me coming back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "imxW4Dun1OhOWDnP-vN-og"
  },
  "JpHtm0gbU5FlXSB0RYJyiQ": {
    "date": "6/12/2014",
    "text": "Delicious...Love their food, service, drinks... it all just works. Not too expensive either by London standards.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mcd-b6qABZPEnBMwRVdD8A"
  },
  "qqnWmoCbd46fQH9-axyOLA": {
    "date": "6/12/2011",
    "text": "Look, nando's is a two-star kind of place, but they're *open on sunday* - and nothing else near Holborn is, so that's a full-star bump.good for you, nandos, what with having food available in exchange for money on sundays.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vh-z4u73KV3GhP1KOL36uA"
  },
  "I7JsKDajB9V98gP0dvtTqQ": {
    "date": "9/10/2015",
    "text": "STAY AWAY! My husband and I both got the worst case of food poisoning here. Ruined our trip to London as we were sick for two days. We ordered the ratatouille.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dpeWT5wOGMxxRf3eV9VB8g"
  },
  "t-NRWxz2LO4cH5gUE2iWIQ": {
    "date": "7/13/2013",
    "text": "I used to love Nando's until I came to this location. Let's just be blunt- they have mice here and a mouse careened into my food whilst I was eating. It was the most terrible experience I have ever had at any eatery- and this is London! I know there are mice everywhere- but you don't want to dine with them. Unfortunately- this really has traumatized me and I can no longer support a corporation that has rodents/vermin infestation. The management did not seem to care- which lead me to believe this sort of stuff happens all the time. I will never dine at another Nando's again if this is the way the franchise disregards cleanliness.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VDlqj5-U22KcSFgBPqaFg"
  },
  "JOuia7VgD0C2F8FOytG7nw": {
    "date": "12/20/2012",
    "text": "We already had a table booked somewhere else, but as it was raining and Nandos was nearer we decided to give this branch a try. I love Nandos, but some places cook it better than others. When we got there it seemed really busy, and was told the wait for a table was 10 minutes. So we waited, and was seated in less than 10 minutes in the entry level part of the restaurant. We ordered food then my partner want to wash his hands downstairs and informed me that there were loads of empty tables there - so I don't know why they had 20+ people all waiting for a table. Food arrived super quick and while the chicken pitta and wings were tasty, the portion of chips were tiny and the coleslaw was not really up to standards. It could have been better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMjexqCM00KQmSt6uQNBBA"
  },
  "0RX4FlRXF_9d1gaHmLClVQ": {
    "date": "4/10/2012",
    "text": "I always liked Nando's... the chicken is always tasty =)... standard good plce... theyre not the best, but for London it's great food eats =)... and I paid only 12 pounds for lots of food LOL and great sauces =D omg! ^^  I ate here with friends and had 2 sets of chips, 1 order of rice, an order of garlic bread and an order of mashed potatoes.  We had 2 whole chickens split between 5 of us and I had a good time.  I only had water, but I defo enjoyed the food and they have free wi-fi btw!  The only thing that bothered me was the fact it took a bit long for us to be seated and they weren't that busy.  They were fairly friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5v8RvipZJsTlbWbs-HjSw"
  },
  "2O5uvlxShsIHsNWfMhXXSw": {
    "date": "3/9/2018",
    "text": "I had heard a lot about Nando's from my husband and since we don't have it where I live in US, it was a must visit during my trip to London. I came here on a Friday afternoon for lunch and the place was packed. I got a table in 15 mins though. The waitress explained how to order and what to do. I got the chicken wrap. I liked that they had more sauces to add because I found myself add a lot of that to my wrap. I liked the fact that their chicken was grilled and not fried like you get everywhere in US. It was good food but probably not worth the hype in my opinion so I'd give it 3.5 stars.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNu11OSW0g_hVHrcLiJwmA"
  },
  "gIn1qaALnCMoD6zvZ4i4TA": {
    "date": "6/29/2018",
    "text": "The worst restaurant that I went to in London - very similar to a Chili's or Red Robin back home. Although they have a vast menu and tons of vegetarian options, the food is very subpar.I split the Red Pepper Dip, and got the Portobello Mushroom and Halloumi Wrap with Avocado and Garlic bread on the side. Although the pita was soft and warm, the dip felt like a cheap taste. It was too sour compared to real hummus and the spice felt fake. The wrap was also really hard to eat. It was bland and the avocado was not great. The halloumi wasn't grilled well and the mushroom felt raw and was not that flavorful. I tried to use the hottest sauce (not even that hot) to improve the flavor of the wrap but it was not helpful. The spice again was super fake and too tangy - it seems like it's an issue for a lot of their dishes. Hate wasting food but ended up leaving a bit of the wrap. The garlic bread was very average and they don't give you a dipping sauce so had to use the spicy sauce again.Overall, payed Way too much money for a meal that I wouldn't pay more than a few pounds for.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8B14ovMPFpi3-2LILxUpdA",
        "caption": "Photo of Nando's - London, United Kingdom. Portobello Mushroom and Halloumi Wrap with Avocado and Garlic bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8B14ovMPFpi3-2LILxUpdA/o.jpg"
      },
      {
        "img_id": "4QrzoiUTcche61kM6EjL4A",
        "caption": "Photo of Nando's - London, United Kingdom. Red Pepper Dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4QrzoiUTcche61kM6EjL4A/o.jpg"
      }
    ],
    "user_id": "JQ-04xOTuZKuil0xih0H1A"
  },
  "kI-Thf_ytVLxJjYm1Dzq3A": {
    "date": "12/26/2017",
    "text": "We dined at Nando's because of a recommendation. I'm glad that we did because it's possibly the best Portuguese food we've ever had. Upon walking in, they get your party size and have you wait a few minutes before you are seated down stairs. Once you are assigned a table number, you can go to their counter to order your food & give them your table number for where to bring the food. We ordered the sharing platter for two with lemon and herb sauce & chose the peas and super grain for our sides. All of the food we delicious and plentiful for the two of us. If you feel that your chicken needs more sauce, they have bottles of their different flavors of Peri Peri sauce. All of them were super delicious and worth trying. For dessert, we got a Naughty Nata Portuguese egg tart. They pretty much sold out for the night, so we were VERY lucky to get the last one! The only downfall I had here while on vacation was that there was no WiFi in the restaurant, so it was hard to research what was recommended to eat (not a deal breaker). When in London, go eat at Nando's!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "Z7vtWi3XvSE5qE0eMXzvCA",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z7vtWi3XvSE5qE0eMXzvCA/o.jpg"
      },
      {
        "img_id": "7m4Po8lMK8bm2mH0kx8SRA",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7m4Po8lMK8bm2mH0kx8SRA/o.jpg"
      },
      {
        "img_id": "9bIBIGuWY-_-sA1P5Kx4aw",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9bIBIGuWY-_-sA1P5Kx4aw/o.jpg"
      }
    ],
    "user_id": "f4_MRNHvN-yRn7EA8YWRxg"
  },
  "hAZgJYwff8O468jAFaCiiw": {
    "date": "8/27/2017",
    "text": "First founded in South Africa, this international chain has won over the masses with its Portuguese, flame-grilled chicken. 1. What is the restaurant like?This casual dining restaurant offers upstairs and downstairs seating. Given its prime location in Covent Garden, this particular Nando's seems to be consistently busy. 2. What should you get here?The peri-peri chicken meals! We ordered a half chicken meal in hot peri-peri marinade, along with a side of spicy rice and veggies. The chicken was tender and flavorful. We especially loved the various hot sauces and lemon garlic sauce that we slathered all over our chicken. 3. Other notes- Nando's sauce is available for purchase. - Customer service is excellent. Nando's, we think it's time to expand to Southern California.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "YhZ_PqBx_FpXQXnv_L0Shg",
        "caption": "Photo of Nando's - London, United Kingdom. Portuguese tart",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YhZ_PqBx_FpXQXnv_L0Shg/o.jpg"
      },
      {
        "img_id": "hQolYi2Tcc9vENxpMhicCw",
        "caption": "Photo of Nando's - London, United Kingdom. Half chicken meal",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hQolYi2Tcc9vENxpMhicCw/o.jpg"
      }
    ],
    "user_id": "v8Ddr8dOEWqadmiisTLhGA"
  },
  "TRgcMmhiFDXIGXkDKl7XUQ": {
    "date": "6/19/2017",
    "text": "The food was good and portions big, but the ordering processing was confusing.  I guess if you come here a few times you'll get use to it.  You first get seated like you would at any sit down restaurant.  There's a menu on the table and everything, but you have to get up, walk to the cash register and order you food there.  Upon ordering the employee said my dish wasn't available and then said it was after checking and then said it wasn't available again. He went back and forth for about 3 minutes until finally concluding if there were enough chicken wings for my order.  I ordered 10 wings.  The flavor was good and the staff friendly.  If it weren't for the confusing ordering process and the confused staff taking my order, it would have been a better experience.  I would come back here to try their other dishes.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XqXUx71l2mvbLARRVjAFww",
        "caption": "Photo of Nando's - London, United Kingdom. wing platter (with 4 regular size sides)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XqXUx71l2mvbLARRVjAFww/o.jpg"
      },
      {
        "img_id": "JVoG60R-Wp8l0EtRGDSRNA",
        "caption": "Photo of Nando's - London, United Kingdom. menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JVoG60R-Wp8l0EtRGDSRNA/o.jpg"
      },
      {
        "img_id": "EX21Oi4ZJxSjVAkFmw4jmA",
        "caption": "Photo of Nando's - London, United Kingdom. menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EX21Oi4ZJxSjVAkFmw4jmA/o.jpg"
      }
    ],
    "user_id": "lC3QFMTuGoK2-gfXUd8UhQ"
  },
  "5aUuzwrtzSHdQQ5UzNuoVg": {
    "date": "7/30/2017",
    "text": "This is a great concept! Love the chicken- we went with a large group and they sat us in a private den. If you have a large group and want to skipThe embarrassing split the bill 10 ways dilemma, come to Nando. Order food from a counter- pay individually or as a group- then hey bring your food out.It's piri piri chicken- choice of heat with very good sides. Came with a group of 8 chefs and we killed 3 chicken platters, 3 wing roulette plus 8 sides. Overall the food was cook nicely- sides were good and it was a perfect place to just gnaw on some chicken! Always a return for me when I am in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xROgVcT6y6-nKwdhVgCuzA"
  },
  "46MigUfZ0vzkIF48bnqBjA": {
    "date": "6/28/2017",
    "text": "I was looking forward to this visit since I tried Nando's in Toronto just 2 months ago. This location is very big - 2 floors with the reception upstairs and The dining area downstairs. The wait for a table was pretty quick, just 5 minutes but unfortunately our order took about 20 to 30mins. They handed me the natas when I ordered and paid at the counter. At first I wondered why they would give you dessert first then I realized it was because the main course was going to take forever.The chicken was really dry and the natas not so crunchy. Safe to say I've satisfied my Nando's craving for a while.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GnfA2PASWwSK6hXLBYm-pQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GnfA2PASWwSK6hXLBYm-pQ/o.jpg"
      },
      {
        "img_id": "5DUmmhminazNgjcE0v4vCQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5DUmmhminazNgjcE0v4vCQ/o.jpg"
      }
    ],
    "user_id": "zeupEHRVTS7BfJh4VfeXDw"
  },
  "qZQgt1EJEhhTovwh045iOQ": {
    "date": "4/26/2017",
    "text": "The famous Nando's in London ! I was visiting London and told my self I have to try this , I've heard so much good things. This is pretty much a self service restaurant , you order and pay for your food at the register and then they bring the food and drinks to your table.  Me and my mother both enjoyed our food , it honestly was the best thing we had eaten since being in London .  I got the double chicken sandwich with fries and yellow rice , very good . Nando's had a wide range of sauces to choose from which impressed both my mother and I . I'll def be back when I visit London again next year :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lsh0cbfYEQ1EfpBY-OR65w",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lsh0cbfYEQ1EfpBY-OR65w/o.jpg"
      }
    ],
    "user_id": "qEGiZncvaYd5Pv9i2NRCmw"
  },
  "eV3ve7wxN8OGKVVU7Yic8Q": {
    "date": "10/24/2017",
    "text": "Prime location, so waiting for a table is expected. Upstairs and downstairs seating. The downstairs is a bit like lair, but in a good way. Kind of dark interior. Most Nando's don't look like this one. Like all Nando's, the ordering concept is confusing. You get seated, then you have to get up to order. The chicken is what makes this casual dining chain memorable. If I was vegetarian I would be disappointed, the sides are nothing special on its own. I go to Nando's every time when I'm in the UK, the chicken wings are very good. Try the peri peri xtra xtra xtra hot sauce (the black bottle) on your wings and your friends will be ever so impressed by your chili heat tolerance levels.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "188nNkbt92KZoF4QtF7ApQ"
  },
  "aYXSpunIvNbd2S62m1aLQQ": {
    "date": "1/14/2018",
    "text": "Got the butterfly chicken with medium hot sauce. Mashed potatoes. Corn on the cob. Loved the chicken  and corn. Surprised the potatoes weren't that great. Next time I want to try the garlic bread.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EZ3xdSrRUxtcr8s_q8hTKg",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EZ3xdSrRUxtcr8s_q8hTKg/o.jpg"
      }
    ],
    "user_id": "AB3UQR_PqYUhvOR3Ow90rQ"
  },
  "kkOzPXaurOFUyOERrTITYw": {
    "date": "8/3/2016",
    "text": "Not blown away but a solid meal when you're looking  for something relatively in-expensive in the city.I had the Mediterranean salad with chicken- not sure I loved the spicy dressing on the chicken, caught me by surprise, but the feta was fresh along with the vegetables.My husband had chicken with sweet potato wedges and loved it, our friend had the chicken burger and liked it as well.The fries were a little spicy but delicious in texture.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PoDa9_c1Z0nk2dYtsWcKCQ"
  },
  "O0Tf7PMP5CjZUdr_voWAuA": {
    "date": "12/24/2016",
    "text": "3.5 stars.This wasn't a meal that I would write home about or something super special here in London, but it's a solid meal when you're looking for something less expensive in London.We got the fino platter (£23.95) and shared it amongst three people. It's a whole chicken with two sides - we had originally ordered sweet potato wedges on the side, but since we got to the restaurant about an hour before they were set to close, they were willing to substitute one of our sides for a side salad (around £6 more expensive) for free. The mango and lime sauce that the chicken is in is great!This particular location is very close to many West End theatres - be aware of this when you are trying to come as you might be hard-pressed to find a table right before or after showtimes.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AFWF5hcNPoMT6pdcrxEE7Q"
  },
  "BP2MWkoTuyDLfHBaKhSoHw": {
    "date": "3/10/2017",
    "text": "What to say? Just another food chain. Might have worked when they started, now it is forgettable at best. The staff was ok, one in particular was great! The kids liked it though, so it might be a good place for you if you bring the younger ones.Have fun!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-FQcGeIaAEP5zuERJT-lTw"
  },
  "6WXSjGuV_UyM-ijip8YzTQ": {
    "date": "8/13/2016",
    "text": "I came here as a suggestion of a friend of mine, and I loved it!! The chicken was so delicious that I had to order one more. It's pretty much a self service, but its worth it. I can't wait to come here again. Not expensive.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BxH6DHZzIpPwlLryCMPpOQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BxH6DHZzIpPwlLryCMPpOQ/o.jpg"
      },
      {
        "img_id": "wTSW-N-7KknOvQbNNpAtmw",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wTSW-N-7KknOvQbNNpAtmw/o.jpg"
      },
      {
        "img_id": "-Nu7WvjhpGebP1284RV4dA",
        "caption": "Photo of Nando's - London, United Kingdom. Quarter chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Nu7WvjhpGebP1284RV4dA/o.jpg"
      }
    ],
    "user_id": "yJCpfKzMG2vOpD1KuoMpSQ"
  },
  "ogJ2QLQRDZjX_x3eYZN23A": {
    "date": "8/28/2017",
    "text": "Number of customers is always predicted at this resturant because of tourists so I felt like they don't really care about customer service. The food was cold and no one came to us to check if the food was ok. And one of the sides was really salty judging by the fact that I have visited over a dozen of Nando's in London",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FS7IqU_PKOG87gPbxLvWQ"
  },
  "7BezEHHDIO0Rs5Py6gCB8g": {
    "date": "2/22/2017",
    "text": "First tried Nando's in Sydney a few years ago and loved it. We are starting to get them in the USA but they are sparsely located with less than 40 stores nationwide.Saw this one in Covent Garden and needed some food to take back to the room. The chicken here is really good. Still not wowed by the sides but don't care. Had an ice cold bottle of some Portuguese beer while waiting for my order. Will always hit these chicken joints when I can.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 6
    },
    "photos": [],
    "user_id": "qtWYsp3Fagzr-yWtJvO8JQ"
  },
  "Kw3li3CKGPlYIdIGlAGkBQ": {
    "date": "5/11/2015",
    "text": "i was told to go to Nando's while I was on a trip in the UK. I would say that Nando's is like Chipotle, because everyone loves them and you could probably eat at them every day and not be tired of them. One difference is that Nando's is a sit down restaurant.I came for dinner, and waiting for a table took an extremely long time. Turns out, there was another level below the ground floor. This location was massive yet still packed. This was the place to be.I recommend either ordering the 1/4 Chicken Breast or the 5 chicken wings. I always got the medium sauce, which I thought was plenty spicy.. (There is an area where you can get the other sauces if you want to try them out or realize you want more of a kick.) The sauces are fantastic. The chicken is extremely tender. For sides, I recommend the chips (my fellow Americans, that's \"fries\") and the corn on the cob. Don't waste your time with healthy sides. Definitely don't waste your time getting a salad. You're here for good food, so get the chicken.After eating here, I had Nando's about 4 more times in 1 week. Sure, there were probably other things to try in the UK (don't worry, I tried the other local cuisine), but I couldn't get enough of this chicken.Nando's, please open a location in the San Francisco Bay Area. I'm begging you.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fuGZDL-wrhvD_jX7_8b0Tg",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fuGZDL-wrhvD_jX7_8b0Tg/o.jpg"
      }
    ],
    "user_id": "Oy42o0vMiYeIVvgcgYUSbA"
  },
  "T3H8GCj3LCoUmFfBIeWlCA": {
    "date": "5/11/2017",
    "text": "Good food, I preferred the sides more than the chicken itself. It was good but nothing special. We were visiting from LA so we have a lot of similar places.  Would I go back, sure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUNGBo287oFoMRkyX89BDA"
  },
  "B2HH7Bh_6xT4ajxedM2M1A": {
    "date": "10/17/2013",
    "text": "Nando's is a cross between a fast food chain and a more upscale restaurant - the decor definitely suggests something fancy, but order at the counter, get your own utensils, and service in general is minimal. I'd never really seen anything quite like the service model they had, so it was definitely an interesting experience.The star of the show here is definitely the chicken - it comes drenched in peri peri sauce and has quite a kick. There are also large bottles of sauce that you can grab from the utensils counter with increasing degrees of heat.The butterfly chicken and the wings were both very tender - the meat was falling off the bone and it was drenched tangy sauce. The sides come huge - I would pass on their fries or garlic bread (they were subpar and oily) and go instead for their cole slaw and their creamy mashed potatoes.The food was great but the service definitely wasn't. You order food at the counter, and our counter was just a mess. She would constantly enter things in wrong, or leave suddenly to go into the kitchen for some unknown reason. Also, this location got pretty busy during dinnertime, and the hostess was quite rude about seating people - if we tried to ask how much time was left, she simply snapped at us. There's very minimal table service, but both times our waitperson brought our food there was something wrong with it (wrong side, wrong level of spiciness, etc). I get that they were very busy, but I didn't really see how they could be busy enough to make so many mistakes. Very delicious chicken and worth trying at least once.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rax_Eqtx6hPrDuSxUs8C-A",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Rax_Eqtx6hPrDuSxUs8C-A/o.jpg"
      },
      {
        "img_id": "gaGiuHAFMoQc_RV5iB2ZWQ",
        "caption": "Photo of Nando's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gaGiuHAFMoQc_RV5iB2ZWQ/o.jpg"
      }
    ],
    "user_id": "RAOZ3SzKlmxY3iDIlBb0dw"
  },
  "ejKTKBpmLoFmcP0eQ9ru4w": {
    "date": "5/5/2017",
    "text": "We arrived in London and knowing a lot of places close around 10:00pm (give or take), we knew we'd be safe going a bit later here as it was a Friday and they were open until 11:30pm. I had the four boneless thighs with creamy mash and garlic bread. The chicken and garlic bread were flat out amazing, like a well cooked home meal, with excellent flavor.The creamy mash was good, but lacked flavor. (I still ate 3/4 of it, as it was good, and I was extremely hungry). It should also be noted that free sauces and spices are available here and I neglected to spice anything, which was my own fault! (Lemon and herb was fresh, zesty and really complimented the chicken).The staff and setting were amazing, the staff explained in great detail how the ordering went, as our non-local accents were dead giveaways that we may be new to their restaurant. I would highly recommend Nando's to anyone wanting good food at a decent price. For the girlfriend and I, dinner was about £23, they explained that no tips were expected, as get seated, then walk to the register to order/pay for your food in advance. After that, your food is delivered to your table and you can help yourself to soda, water and frozen yogurt, tap water is free.Would totally recommend to anyone.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_0qxV6BJafub6eU7RZOew"
  }
}