{
  "KcaKllOux05OCwZ4ow2mNA": {
    "date": "2/15/2011",
    "text": "Excellent views of London (you don't need to wait in line to get on the Eye of London to see such views!), exquisite food, attentive service - slightly high prices, but who can argue with a view like that? :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fQ_WhwNNpDhv3wtR5yGBMQ"
  },
  "D7JpUCKOCQNPccR5zy7Nww": {
    "date": "7/5/2008",
    "text": "This place is not somewhere where you can bring your dog. In fact, I don't think you would want to drag him up to the 28th floor at the Park Lane Hilton and he won't appreciate the great views anyway. I have been here several times and each visit has invariably been nothing less than pleasant. To get the best views, do request a table next to the windows overlooking Buckingham Palace when booking. The waiting staff are an eclectic collection of continental Europeans who ply their trade very smoothly indeed. The decor is somewhat dated in some respects, and some bits look decidedly 70s, especially the tan-coloured curtains, but nobody notices it after a while. The food is always great, superbly well-cooked, though not quite faultless, as Andre Garrett does try to combine English with continental cuisine, and this blend can sometimes come over a bit original. So it's best to just order the simpler dishes, and perhaps avoid a few of the saucier meat dishes. However, that is just my opinion and I am totally sure that everyone will enjoy their meal here. The wine selection is quite well-studied, though I often go with their daily wine selections, which are always good, such as the Chilean Secreto Carmenere. One thing to note is that this restaurant will never be accused of being a cheap place to eat. While waiting for my table, I had a gin and tonic, and that costed well over a tenner alone. The lunchtime set menu is more economic, around £45 per head, including a half bottle of wine but add in the service charge and one would be foolish to expect change out of £100 for lunch for 2. There is also a little pre-theatre menu that does little more than taunt you but that's relatively cheap at around £20, plus extras. I know this sounds expensive but I really think it is worth ordering the degustation dinner menu at £130 per head and watch London light up at night over a fine meal. Oh, remember that does not include the service charge, so forget the idea of any change out of £300 for dinner for 2. I haven't tried but maybe you can ask to take a doggie bag home, though I seriously doubt you would have left enough.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rt-_fc9ScucMdiVWcsRdGw"
  },
  "aEzZmHm7VAYruDvf9mXG2g": {
    "date": "9/16/2010",
    "text": "We had the set lunch at Galvin at Windows in Park Lane Hilton. Pleasant service as usual and we got a window table as requested, as it was a birthday celebration- which had great views over Hyde Park. Our relatives from abroad enjoyed the experience and are still talking about it. Enjoyed the pork cheeks for mains. L'Artisan du Chocolat chocolates to end was a nice touch with the coffees. Amazing marshmallows!!! We will definitely be going back again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NyXn6VodXe190WwrDvijog"
  },
  "PVNvycomFawpGaocsEgp0w": {
    "date": "7/11/2009",
    "text": "Breath-taking views of the city, but expect to pay the price. this place is not cheap.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yHkF4YbvYMaFE-927uobSg"
  },
  "PSktmxEm56x3LQ--IeD4sQ": {
    "date": "11/24/2008",
    "text": "The views are one of the best qualities about Galvin at Windows, situated on the 28th floor of the Hilton hotel just off Park Lane in London, you are able to see many of London's top attractions. The London Eye, Hyde Park's Winter Wonderland, Canary Wharf and the Gherkin are just some of the highlights you can see in the evening. The food was amazing! I enjoyed the added extras that the waiters brought out- the little 'amuse-bouche', the box of different chocolate varieties and finally the pot of marshmallows- made the meal a special experience. The service was great from the (mostly French) staff, they were very attentive and informative. The meal is very pricey but seeing as I went there for a special occasion, I think it was definitely worth it! The bar however was smaller than what I expected and drinks were ridiculously expensive. My only gripe about it was that I didn't enjoy having a bunch of 'city boys' in suits bragging about how much money they have despite the recession and pushing everyone to get to the bar.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Fe-DrVlKvTVJ_EDkpTyQIg": {
    "date": "1/9/2010",
    "text": "Really really can't fault galvin. Fabulous food, views to die for, lovely service. The food is beautifully presented and the portions are quite small but it's so rich you feel perfectly content at the end not sickened. They also do little touches like icing happy birthday onto desserts plates which makes you feel valued and special. Bear in mind you won't get a table near the window if you are more than four as these tables can't accomodate more than that so your view will be less good. And afterwards you can go for a stroll in hyde park to work it all off!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "iD4GJBGtbQnoQrufE8kU0A": {
    "date": "11/20/2009",
    "text": "Galvin at windowz, situated at the 28th floor of Hilton hotel in Hyde Park Corner is the place to go if you enjoy good food, friendly staff, good wine, and superb view. It is expensive, but for a special occasion it is absolutely worth it. The staff took us behind the kitchens to have an overlook on one of the most stunning panorama of London I have ever seen. Taste their English mojito at the bar after your meal, absolutely amazing!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2NfWx-dkzYY1m7B2XqXeMQ": {
    "date": "6/9/2012",
    "text": "My boyfriend brought me here for birthday cocktails this week! Great views in every direction! Great cocktail menu too! Next time I will go on a clear day not a wet rainy day to make the most of the views! Might have to wait a while!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "l5wTJUeddpK0D8CJRb6uIQ": {
    "date": "4/16/2012",
    "text": "My partner and I had a fantastic evening here. We went for the tasting menu with paired wines, which is pricy but completely worth it if you looking for something special. Every wine we tried was great, and the two girls serving us were excellent. Knowledgable and attentive, while maintaining a discrete presence that didn't intrude on the romantic atmosphere of the place. They also do a good value set menu, which for the food, the amazing view and the service is a steal. Highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Io-zdW5rfLmVuOsWAypbHQ": {
    "date": "2/28/2010",
    "text": "Really good meal and experience. A bit snooty but that's what you expect in posh restaurants I guess. Excellent selection of wine at reasonable price and the view is incredible",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qVbbclTSkkKiXrnSjQVZ8A": {
    "date": "1/15/2009",
    "text": "Went for lunch with some trepidation since my real interest is food & wine, sod the views. Though expensive, it was very good. Staff were genuinely friendly, spoke good english (no point joshing with the crew if they don't understand you) and were properly attentive without fauning. I suspect the current recession will bring prices down a little, though not easy to do at this level (!). I dislike places with an 'optional' 12.5% service charge. Bring on the French rules.The dishes were inventive and flavoursome with some really thoughtful touches, though I thought the clams decorating the pork belly added nothing to the dish though they were intended as a significant part. To be picky, the slow roast pork belly itself was very good indeed, but not quite there, needed another few minutes. The lentils had added lemon which worked very nicely, lightening their meaty flavour. Everything else was better than expected, and they have a few deals going to the end of Feb., so will have to go again.And indeed have just done so a year later with a party of 7 for lunch. A couple of barely-flaws in my choice of dishes but rest of party all overcome with the excellence of presentation & food. Was also able to get away with a not shockingly priced Alsace Gewurtz and a Portugese red that showed very well indeed.And again, and the Lunch special is a very good deal. Do try this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-UnHQ1gq-4pWhxCEXx3_A"
  },
  "JvqonuW6Oq2SPwsd4zm2bA": {
    "date": "6/20/2008",
    "text": "The view is really fantastic. Very romantic. Even more expensive!! The food was very good, was it worth the money? Now there's a question, I'm not sure I have the answer to. The truth is some of it was amazing (oddly the things that I thought might be just OK) some of it was just OK (obviously good quality though, but then you'd expect no less). Maybe it's all to do with expectation. Service was excellent and the waiter even helped in our game of trying to name at least 10 landmarks each from the stunning view (not that he was much cop at it. But it's the taking part that counts, and all that). There are deals that are available for this restaurant and although I can imagine the choice is very limited I have to say the difference in price is considerable so it is worth a shot for the view alone. I believe you can just head to the bar which is a sensible option - although don't let the height go to your head - keep an eye on the tab!I won't say how much our meal cost, because frankly it's just embarassing - feed a small African village for a week kind of thing. But I'd say it is worth it for a special occasion. Actually best make that a VERY special occasion!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gRrVAa98oqgMHdHB9r0gGQ": {
    "date": "6/29/2008",
    "text": "People go to Galvin as much for the view as they do for the food. It's not to be missed. This certainly isn't going to be a cheap meal, but the quality of the food is absolutely superb, and they are always so many delicious things on the menu that you'll find it hard to choose.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jciYtshnqF9YShKjZZSYUw": {
    "date": "11/16/2008",
    "text": "Galvin at Windows was an amazing experience. My boyfriend and I loved it. AMAZING VIEWS of the whole of London, made more special by the fact we could see the fireworks displays happening all over inner and outer London. Menu was fabulous, desserts were out of this world! Very expensive but well worth it! I recommend this entirely!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6ZuZXqFUDxSZfeEg-SG7YQ": {
    "date": "11/19/2008",
    "text": "It is no doubt that this restaurant is pricey, but its worth every penny. Not only is the food absolutely divine, the atmosphere is relaxing and soothing, the service is top class!The staff are polite, friendly and very attentive. This is undoubtedly one of my favourite restaurants in London, and I can't wait to dine here again!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EBdl96lGrxRxa2xGiPLjPw": {
    "date": "11/17/2008",
    "text": "There's no denying Galvin at Windows is pricey, but you're not just paying for the amazing views - the food is worth the investment too. Immaculate and friendly (unstuffy) service allow you to properly relax.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-pcGraRZFD1hLYpmquG5xg": {
    "date": "1/27/2010",
    "text": "[Non-photo Review] For full review, please see: wp.me/pwXBH-zg  Galvin at Windows  Flying High & Deservedly So Summary: Galvin at Windows seems to have achieved a winning combination. The views and setting are stunning, the menu consists of the kind of food you want to eat quite often, and it is executed precisely with a subtle flair. The food we had at our Sunday lunch was delicious and reasonably priced for this type of venue, and I am now eager to try out their other establishments. Becoming Galvinized It was the dead of winter, the afternoons were drawing yet shorter, and there I was, still a veritable Galvin virgin. I thought to myself, I must be one of the only self-appointed 'foodies' in London who has not yet frequented one of the (then) two Galvin Brothers establishments in the London fog (they have since added the much-lauded and doted over Galvin La Chapelle and offshoot Cafe de Luxe in the City). So, when I discovered after a bit of research that you could get a 3-course lunch at their highest-flying venue for a mere £25/person  even on a Sunday  I decided I that I would finally lose my Galvinity and treat Mrs. LF to what I hoped would be a nice lunch with stunning views. Perched atop the London Hilton hotel, with a commanding view of a good deal of London, lays Galvin at Windows. I had heard many good things from various friends and food bloggers, so the bar had been set pretty, erm, 'high'. Upon taking the lift up to the top floor and soaking in the restaurant (and peeping into the nice and spacious bar), first impressions were certainly good. This place didn't exude much of the cookie-cutter, drab ho-humness that is the global Hilton brand, but actually seemed to radiate with its own design, ambience and energy. The greeting was smooth and the waiters were friendly and professional. Although we didn't get a table right by the window, as I had requested through my toptable booking, we were given a lovely table on the lower floor that looked Northwest up Park Lane and beyond. There is also a raised rectangular dining area that stands about 4 or 5 feet above the ground-level tables. It was not that busy, probably due to the fact that our reservation was for 2pm. These bros can cook As we soaked in the view, our tummies were growing hungrier by the minute, so we quickly made up our minds, although all the 3 options for each of the courses did sound very appetizing. With our starters and main courses selected, we were provided with two types of bread and a lovely little beehive of butter, all of which were fine but not stellar. 6/10. As I was mainly having veggies and fish, I wanted to go for a white wine (Mrs. LF was not drinking as per usual since 'the bump' had appeared). I was looking at the wines by the glass, but the sommelier persuaded me that their other deal (3 courses, half a bottle of wine, water & coffee at £39.50) would probably be more economical and enjoyable, and that they had some very nice wines on the accompanying half-bottle selection. Like The Dude I am, I abided, and chose the 2008 Mâcon Villages Caves de L'aurore (Burgundy), which served its purpose very nicely throughout the first two courses. It had a nice golden color, a subtle nose of tropical fruit and a nicely integrated touch of oak. I've seen this on other restaurant lists for about £15 per half-bottle, so it was a decent deal given that the water and coffee were basically thrown in for free. Starter 1: Slow Cooked Hens' Egg, Warm Salad of Charlotte Potatoes & Smoked Haddock, Whole Grain Mustard Beurre BlancSimply put, my starter of slow cooked hens' egg was as beautiful to look at as it was to taste. Everything here worked well together. When split, the egg yolk that oozed out was of a good thickness and orangey-golden hue. The sea of mustard beurre blanc was a perfect surface for the potatoes and haddock to float upon. The sauce itself was delicious  in fact, I spooned up a good deal of it on its own  and the potatoes were just warm, still firm and exhibited a note of sweetness. The taste of the smoked fish was not overpowering as not too much had been added, and as it all mingled together joyfully in my mouth I had the feeling that this was going to be a good meal. It was certainly an excellent beginning. 8/10. Starter 2: Ravioli of Braised Beef Short Rib, Roast Red Onion Fondant, Horseradish VeloutéI thought that Mrs. LF's was also presented in a beautiful and simple manner. Here's what she thought: The braised beef short rib inside the ravioli was moist and tender and the ravioli was not too filled (compared to the one I had in the York & Albany earlier in the year). The foam, or velouté, was exquisite: it kind of looked like a cream velouté and almost tasted like so, but was in fact horseradish. This was delicious and very innovative as it was a fusion of Italian and British cuisine. 8/10. Main Course 1: Fillet of Royal Bream, Gnocchi, Shellfish & TrompetteOkay, here was the deal-sealer. These boys",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aZN8JFy3xopQvkbduuajgQ": {
    "date": "5/2/2011",
    "text": "great venue, awesome view you cant get a better view than this, and the food is pretty good here too. great date venue.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOoFZlv2kDLyHBJ4nneWnA"
  },
  "ZVjcpeGCBd9rtsexnv4X4Q": {
    "date": "1/27/2013",
    "text": "Excellent setting, service and views of Hyde Park and Buckingham Palace.Enjoyed their set lunch menu, which changes regularly.From the bread, to the dishes (lamb loin) to the cheese plate (extra) everything was top drawer.Generous with complementary chocolates.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7RKe9zq1ofX2ylCDa5UKxw"
  },
  "QFk3Ajk6hysE9PgvxSIzEw": {
    "date": "12/17/2011",
    "text": "This place is in such a great location, 28th floor of the Hilton hotel on Park Lane. Beautiful food and drinks.Even if you don't fancy splashing out on an expensive meal it's a nice place to have a drink whilst admiring the views of the city. Staff are friendly too.I thought the bottled beers were a bit overpriced - £9.95 for a small bottle! Better off paying that for a nice cocktail!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "Uz9axXHcrRFcjXTxKM_Wiw": {
    "date": "7/8/2011",
    "text": "Absolutely stunning views of London! Dining here made me fall in love with London and my date ;-)Very romantic!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "TRRGX6X665v-MzYbR-R8QA"
  },
  "ACySl6u9kkTZpUxK2SCWmg": {
    "date": "2/25/2014",
    "text": "At the prices they charge (upwards of $600 for dinner for 2), this should have been one of the best meals from our recent trip to Europe. Instead, it just felt like another overpriced British eatery. Despite their Michelin star, I would put this place on par with upscale chain restaurants. In the US, think Capital Grille, Morton's, etc. There's nothing necessarily wrong with that, but those places would never garner a Michelin star. The views were just as incredible as we'd expected, but that was the lone highlight of the meal. We went with one of their tasting menus and had a nice bottle of red wine to go with the meal. The food just didn't stand out to me. The worst part, however, was that they gave us post cards to fill out and said they would mail them to our friends in the US. Two months later, no post cards were ever received!!! Thanks for making us waste our time and money!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYWcouiiAQsAR5tyMcGg-Q"
  },
  "AwzIUI3ZC_NK_gQiNkMrDw": {
    "date": "2/17/2011",
    "text": "Right around the corner from El Pirata, at the Hilton Park Lane, the bar upstairs provides maybe some of the best views in London. Don't be surprised if there's a short wait to get in (thank your stars, it's about two hours shorter than any other half decent place in the city). And don't expect to get a table right away, or at any point. It will be packed and it will not come cheap. Expect to shell about fifteen pounds a drink.Quick tip, tip once and tip big if you want fast service. It'll pay for itself after a couple of rounds.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sR2EMcrCZahvA8zOraeQnw"
  },
  "c7AttK9fcU2EhoNMbVW0nA": {
    "date": "1/30/2012",
    "text": "FOOD:Started off with a palatte cleanser.. ended with cheese platter.. forgot what I ordered for the main course, but I remember it being good :)SERVICE:Really great attentive pampering service. Pulling out chairs every time I got up and sat back down. haha. Crumb scraper, refilling our glasses of wine, bringing out the appetizers all in a very intentionally timed and plannedATMOSPHERE:Wonderful, I love views from high places. Twinkling city lights in the lounge and the dining room.14",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_VkzelWeSHzjTVDlGl-Ug"
  },
  "4bDvWgytEH7oI38TB6Vo8w": {
    "date": "2/27/2010",
    "text": "This spectacular restaurant has a great view of central london which you will love to share with family and friends. The food is good, with nice service at a decent price for the top end experience they provide.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "patjWcCve5DgaBnCe_OJBw"
  },
  "rEdMj8HsVIYqhxlgct368w": {
    "date": "2/15/2010",
    "text": "Did Sunday lunch with my two good friends and took advantage of their £25 menu with champagne thrown in. With wine & service, came to about £60 each. Total Bargain! Service was impeccable. From taking my coat, guiding me through cocktails in the bar menu while we waited for friend to arrive, to escorting us to the table and insisting on bringing our drinks over from the bar. And then fluffing the cushion on my chair while I took a seat not only overlooking Buckingham Palace, but the full view of The Queen's back garden and tennis court. Our waiter was impressive. Totally at ease with the menu, guiding us through selections and his suggested starter (salmon & crab, garnished with caviar) was a dream. The portions are not handsome but they are rich and you will not need anymore. Ahhhh, dessert...followed by coffee and petit fours sighs. The marsh mellows will melt on your tongue. You all need to do Galvin before you die, in case you don't go to heaven. It will make up for it.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "Xwy1SsoKclgyLp38FCSZDQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Dessert",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Xwy1SsoKclgyLp38FCSZDQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "Iwe65puzfTniYCmYQX1zyA": {
    "date": "7/5/2011",
    "text": "For full review, detailed rating and photos:hungryinlondon.com/2011/…  I took someone close to my heart for a birthday dinner at Galvin at Windows. I wanted a very special evening with romantic atmosphere (which I got), impeccable service (which I got), stunning views over London (I got them too) and excellent food (which I didn't get). Who gave this place a Michelin star I wonder? Either there were larger sums of bribery involved, or Galvin at Windows just stopped putting any effort into their food after they had achieved their first star in 2010. There is of course always the discussion to which extent Michelin stars reflect the quality of the food in a restaurant, but it still hardly ever happened to me that a Michelin starred place served food that was actually bordering on bad. But let's start with the things that I liked (because I am a nice blog): The views: The restaurant is located in the 28 floor of the Hilton Hotel on Park Lane with spectacular views over London. At least they would have been stunning if it hadn't been for the apocalyptic downpour, but this is something I can't really blame the restaurant for, can I. The Ambiance: Some people don't like restaurants in hotels and think it affects the atmosphere. In my opinion this is true to some extent as hotel restaurants are usually generic and lack any edge. Even though this applied to Galvin as well, I still enjoyed the bright and spacious room and of course the view. The Service: When I booked the table and mentioned that it was to be a birthday dinner, the lovely person taking my booking offered to make a little birthday plate with chocolates, how nice is this? Also apart from this, the service was faultless, if maybe a bit too stiff. But this probably comes with the Hilton. Now the food We chose the Menu Du Chef for 39 pounds. If you want to splash out, you can go for the Menu Prestige (65 pounds for 3 courses) or the Tasting Menu. Retrospectively, I was glad we didn't overdo it on this occasion, as I wouldn't have wanted to sit through a tasting menu of this quality, a horrible thought actually. I really liked the bread, in fact the bread was one of the highlights of the meal. Fresh from the oven and still hot, crisp and light. The amuse bouche was a clear, cold tomato consomme (which I had much better at Fernandez & Leluu Supper Club) with a little pastry thing and a blob of greenish brown sauce. By the way, this unattractive sauce blob appeared again and again with the starters and the mains and bode ill. Both the starters were highly mediocre. The Terrine of Guinea Fowl, foie gras, and Bayonne ham and crispy skin certainly contained high quality ingredients, and might have been really good, if it hadn't come with greenish-brown blob of caper and raisin puree. This firstly didn't go very well with the terrine and secondly was quite unpleasant. The Veloute of English Asparagus, slow cooked duck's egg, goat's curd and sourdough croutons was blandness on a plate. It says a lot about the dish that we had to ask for salt and pepper to make it edible. The mains were almost worse. The Organic pork cutlet which was advertised to come with fondant potatoes, confit carrot, confit, grilled nectarine and sauce Robert was bone-dry and there was no apricot to be found anywhere on the plate. The sauce Robert was nice though. When I saw the greenish-brown sauce blobs on the plate of Fillet of gilthead sea bream, crushed new potatoes, slow roasted tomatoes, black olives caramel & salsa verde I feared for the worst. The fish was overcooked and drowned in pungent olive flavour. This was a dish which you wouldn't even enjoy in a country pub without any credentials. At least one course was excellent and this was the dessert of Tonka bean panna cotta, strawberries, strawberry jelly and buttermilk ice cream. It seems Tonka beans are the flavour of the moment and rightly so, as they taste of vanilla, cinnamon, cloves and other wonderful spices. I had a tonka bean panna cotta only a couple of weeks ago at the Opera Tavern and I am still dreaming of its deliciousness. The Galvin at Windows version was also lovely. The panna cotta had a beautiful creamy texture and tasted like a spice shop, but subtly so. Nicely complementing this flavour firework were the neutral buttermilk ice cream and the sweet strawberries. If you haven't had the chance to try tonka beans yet, do order them when you come across them anywhere on a dessert menu. More grandness yet to come in from of the cheese course. The cheeses are sourced from La Fromagerie, so they deserve the praise really. Reminds me I should go back to La Fromagerie soon, so I can enjoy the cheese without having to sit through a tedious meal.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vVHQ9cyXQoIdPnRn5OI2Ug": {
    "date": "3/27/2014",
    "text": "Galvin is a really amazing. This was my first visit to the restaurant and a great place to sit and look over London and enjoy the views too. Would definitely come back for a treat again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lle3ubNyWGH7ZHSMdOCF3A"
  },
  "6xz6juNHQMVy3CxYbkGVWQ": {
    "date": "8/4/2013",
    "text": "An amazing restaurant and bar located in Park Lane. Incredible views of London and. Top class food and service. The beef was immense and second best I ever had.  Only downside was didn't enjoy my starter love scallops but not cold and covered in lime. Definitely recommend the cheese board, the selection was unbelievable!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFELrpa1vbUmDBUwg6Vlpw"
  },
  "p_p1t9gRkh1zYUL_CQ6roA": {
    "date": "10/27/2008",
    "text": "Those of us with family and friends with a penchant for arriving on early morning flights at Heathrow need to know about Galvin at Windows, the amazing top floor restaurant at the Hilton. If you would like to show your jet-lagged guests a stunning early morning view of London, park nearby before the traffic wardens emerge from their holes, march across the foyer, come straight up to the top floor in the lift and be amazed.For years, the buffet breakfast here cost as much as their ticket over, but recently it has been revamped as Gavin at Windows and now coffee and toast can be taken for single figures, while the morning papers and the unique view takes over what little conversation they can manage (from where else can you see into the Queen's garden?).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W94hJFu75XsjXdo9ZVu9jw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. View into Mayfair",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W94hJFu75XsjXdo9ZVu9jw/o.jpg"
      },
      {
        "img_id": "58hfySE7PkywgqjId5tP6A",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. View towards Hyde Park",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/58hfySE7PkywgqjId5tP6A/o.jpg"
      },
      {
        "img_id": "J4PDMBd_zrm2T-ygf5dq2A",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. No 1, London",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J4PDMBd_zrm2T-ygf5dq2A/o.jpg"
      }
    ],
    "user_id": "2fEE3xEhaRhC2qWnip4Aqw"
  },
  "s2rLKLrXqLq2s_6RzkBpWg": {
    "date": "7/20/2013",
    "text": "Had Sunday lunch there with my family... Amazing views matched by the care and attention of the staff. Food was vert good and prices reasonable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YT1wjtpHHD0qYhxs5GqONg"
  },
  "xlZyvnmvgPFWf3fY6D11Vg": {
    "date": "1/26/2013",
    "text": "It was a birthday meal for two that brought me here.. Loved the place, service was everything you expect of a place like this, chef kept sending random things that  looked very cool and tasted brilliant! I finally understood what the whole fuss abt Michelin star!  Meal was great and I even had a big selection of whiskys to choose from - I could take this for a birthday meal every year I reckon..",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DIDZUosR3wcJt_tSIE597w"
  },
  "R7xc756RcLKMXVFGkXeg4Q": {
    "date": "12/29/2010",
    "text": "WOW. Wow, wow, wow. I think if I ate here every week I would be as fat as a house, but for a one off, special occasion it is decadence defined. The most subtle, professional and attentive staff predict and respond to your every move without any detection of their presence. Parfait! You are also treated to the most comfortable seating I have ever had in a restaurant - just the ticket to get comfortable for the next few hours of indulgent and sublime courses of the highest quality French cuisine. Aperitifs, followed by exquisite amuse-bouche before they bring out your dishes. We feasted on foie gras, scallops, terrine and cheese with the most incredible freshly baked bread I have EVER eaten. Bon Pain indeed. Words can't quite describe the perfection of our mains, including steak, turbot, chicken and veal. C'est magnifique. Only my partner went for a sweet dessert option - creme brulee. The rest of us feasted on a cheese trolley that boasted a vast array of delights from all regions and of all types. You are able to choose your preferences, but the cheese waiter will then aptly interpret your likes and select cheeses to suit and excite your palate. All served with grapes, chutneys and charcoal crackers.... mmmmm We decided coffee was most necessary to finish off our meal, but that wasn't quite the end for the staff - we were given the most amazing truffles to go with the espresso, later followed with a jar of homemade marshmallows. A sweetener before the bill perhaps!? I was lucky enough to be treated to dinner here, but can imagine the cheque was far too higher percentage of my monthly earnings for me to be booking anytime in the near future. A wonderful experience none-the-less. Views are pretty damn-awesome too!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "U00QVRzGqw0debtSC9l2nw": {
    "date": "12/6/2012",
    "text": "This is my third time coming back to Galvin's for their set lunch which is wonderfully priced at more or less 30GBP considering the spectacular views the restaurant has to offer and the service is brilliant",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eoH_1y10_rpolMR9eW3cbA"
  },
  "x9DfiUQPOC5TWgUgtMCg7Q": {
    "date": "12/6/2009",
    "text": "This review is for the bar only, I have not yet been to the restaurant. I have attended a business function at the Hilton Park Lane for the last 20 years. Each year the prices go up and the level of service down. I can't understand why the hotel treats its events guest with such resentment. After all, this must be one of the most profitable areas for the banqueting department.The trip up to the 28th floor has become something of a tradition once the main function in the hotel's ballroom has come to an end (quite an abrupt one with staff removing the furniture around lagging guests, in order to get ready for the next event - we are herded out like sheep ...).The bar has undergone quite a transformation. No longer called \"Windows on the world\", the furniture and decor have been modernised. In keeping with the more modern skyline London now has to offer. The views are spectacular and well worth a visit. Without them this would be just another overpriced hotel bar with snotty staff.The drinks are amongst the most expensive in London. You really would expect these to be accompanied by 5-star service.Once inside it is quite pleasant that the room is not overcrowded. However, the door policy and ridiculously long queues seem excessive. And why is a table in the corner marked as reserved when it so obviously hasn't? We politely asked if we could borrow the space until the rightful owners turned up and were very brusquely turned away, so were many who came afterwards.As it stands, I look forward to visiting again come next year's business function, but remain reluctant to risk taking friends and family here - the view alone just doesn't cut it if you are not made to feel on top of the world at the same time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "Oq6TdrLW5RfUAOfL4Y6r1Q": {
    "date": "1/5/2013",
    "text": "its was second time when i had a dinner in this place, and the reason its was evening panorama, French cuisine, traditional food in modern way.Irecommend this place for french food lovers. food 6/10service 8/10ambiance 8,5\\10",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZHS8GOICfjv3zYoz3yvZ1A": {
    "date": "5/7/2011",
    "text": "i feel like such a snob rating a michelin starred place with 3 yelp stars but it really was just OK for me. my boyfriend and i celebrated our anniversary here - mind you, this was on the tails of having the most life changing michelin starred meal on a recent holiday, so we couldn't help but compare.we did the tasting (and got upsold to the dom perignon version which i really didn't appreciate to be honest - if i'm paying that amount i should be allowed to order what i want to order). the meal got off to a slow start and picked up at the end. my bf had the lamb for his main which was to die for, but my main was quite tame in comparison. i did enjoy the wine pairings with the tasting menu and the service was quite attentive, although not in a geuninely friendly way, more of a 'you are paying a lot so we'll check on you'. i'm not saying it was a bad meal by any means and the views are amazing but i just couldn't help but feel a slight bit let down on the price to overall experience ratio. still, a very memorable time and great way to celebrate a special occasion.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "CMEf8w3KciGFVAIXLMRBOg": {
    "date": "12/28/2013",
    "text": "My husband and I dined here one night during our honeymoon. Unfortunately, the experience made some memories for us that we wish could have been more positive for our honeymoon.We were seat after a brief wait at a beautifully set table overlooking London. We were promptly asked by a server what we would like to drink and it was brought over. We chose from the prix fixe menu and, unfortunately, the food quality was variable. My crab salad dish had a piece of shell in it (which I bit accidentally... ouch!), my husbands fish was very dry, and my paella had variable temperature throughout the dish (most of it being cool). We asked to speak to the manager regarding our experience, to which he very apologetically responded that he would take care of it. He was absolutely wonderful about the whole ordeal and not only did he comp our meals and provide us with a complimentary dessert wine, but he gave us a quick tour of the kitchen and showed us to a gorgeous private balcony overlooking the city. He knew that we were staying in the hotel beneath the restaurant, so he asked that we come up to the bar the following night and he would \"make sure that we had a pleasant experience and were well taken care of\". Now, if this is where our story ended, there would be at least 4 stars attached to this review. But, alas, there's more.The following evening before the bar closed, we went back up to Galvin at Windows. We mentioned to the hostess what had happened the night before and told us the manager sent us back to have a better experience. She was abrupt and stated that the gentleman was not in and had gone home for the evening, but there were seats along one of the windowsills. So, we sat down and waited... and waited... and awkwardly dealt with the two couples next to us making out (awkward)... and finally a waitress came. At that point we needed something quite strong and order two drinks. Then, we waited. And waited. Once the drinks came, we drank them pretty quickly and asked if we could order another round when the server walked by again. She very sternly let us know that they were done serving for the evening. About ten minutes later as we were waiting for our check, I saw the bartender pouring shots for a gentleman in jeans at the bar. Curious, I walked up to the bar and asked if my husband and I could order, as I thought there may have been a miscommunication between our server and ourselves. The bartender didn't bother to look me in the face before he said \"we aren't serving anymore... as he was pouring a round of shots! He said they were for the spouse of someone who worked at the restaurant. I mentioned that was he was doing was likely against policy and sat back down. A very visually upset female bar manager came over to us (because I was really upset) and said \"it seems like there's a problem here?\" and we let her know what had happened. She told us the same story the bartender did, and we mentioned again that we had a bad experience the night before and that the manager of the restaurant had sent us in for a better experience, and it wasn't any better. She then was curt and basically asked us to leave because the bar was no longer serving. We paid our bill and left.I'm sorry to say this, but please consider dining and having drinks elsewhere, as this establishment let us down on arguably the two biggest nights of our honeymoon.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdXfAvmVTYMM91NoPHJKlw"
  },
  "jid_t_noEO_PnV9Uh_QsFg": {
    "date": "7/29/2013",
    "text": "We saw an Amazon coupon deal for 98£ for two and decided to give this place a try.Located on the 28th floor of the Hilton Park Lane, the views of the surrounding area are breathtaking. Unfortunately, we could not see much from our table but the ambiance was nice anyway. Overall service was good but when delivering dishes, sometimes they announced what the dish was and what was included and other times they did not. The amuse bouche was a not creative.  From what I can remember it was some bread sticks and olives. The red mullet lacked flavor an was a bit cold. I am not sure if our experience would have been different had we not used the Amazon deal but the food was just okay for me.ChampangeAmuse boucheTomato gazpacho, watermelon, cucumber & bocconciniRed mullet, escabeche & black olive caramelBraised lamb belly, feve, Charlotte pomme ecrasee & herb lamb jusBaked egg custard, rhubard compote, chocolate foam, & honey comb",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cLOEpHKEC5TCEbFAGF5guw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cLOEpHKEC5TCEbFAGF5guw/o.jpg"
      },
      {
        "img_id": "wZ3n3vXNnlI7z1CIcvJWVA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wZ3n3vXNnlI7z1CIcvJWVA/o.jpg"
      },
      {
        "img_id": "soZ8i_Fsq4vCt_uG_odBLg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/soZ8i_Fsq4vCt_uG_odBLg/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "L2KSMLybPMhxr04nFDLUIw": {
    "date": "2/12/2016",
    "text": "I had a wonderful meal here from the set lunch menu. It is a pretty fancy place, but as it's quite a large and busy restaurant the hubbub guves it a more casual relaxed feel. The artichoke starter was possibly my favourite starter of all time! And the kimchi risotto was really special too. Also experienced the wonder of yoghurt and dill sorbet with a rich chocolate fondant. Added bonus was seeing Fred from First Dates!! :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aEvXXiSkgW4D2d8IJWPumQ"
  },
  "sGlGsaKyCF2-_ChHzhfN0w": {
    "date": "1/27/2014",
    "text": "Galvin at Windows, featuring head chef Joo Won, is a gorgeous Michelin-starred restaurant overlooking Hyde Park in the London Hilton at Park Lane. The staff is knowledgeable, friendly, and even playful for such a usually serious atmosphere. One of our servers was a bit overbearing, but she lightened up by the end.We were lucky enough to get a reservation right by the windows! I wish we came during a greener season, but the view was still beautiful.We had their set lunch menu with a starter, main course, and dessert. Fortunately, there were 5 of us, so we had a great family-style tasting of each dish.One of the starters, seared scallop with caviar had a rich, buttery foam and could have passed for an entree. It was so great. The smoked haddock fritters, Moroccan couscous & lemon yogurt were my second favorite starter.My risotto was a bit too rich/creamy for my taste, but a side of their seasoned carrots and lightly dressed salad really evened things out.I highly recommend this place -- the set menu is delicious and does not require you to put out a lot of money for what you get. Yum! They even gave us postcards to send to our friends/family, and sent them off for us!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "4ILroIO_XJ0mqYeDTShKUA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4ILroIO_XJ0mqYeDTShKUA/o.jpg"
      },
      {
        "img_id": "QH2Gb3yY7wrnsPVcHCTVJg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QH2Gb3yY7wrnsPVcHCTVJg/o.jpg"
      },
      {
        "img_id": "G8aWCkp7pBBPwjtsM22PVw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G8aWCkp7pBBPwjtsM22PVw/o.jpg"
      }
    ],
    "user_id": "4D90YMyPxBtPbIpodbBmeg"
  },
  "blFj1EFbOVtNic0h-OjVrA": {
    "date": "6/8/2017",
    "text": "Underwhelmed!!Expecting so much more... even the though views were beautiful the food was not..Presentation was lovely but the taste did not match..  the amuse bouche was a broth of ham with a pork skin..  unfortunately it was greasy and tasted like liquified ham fat.The asparagus was very tasty and the truffle sauce taste came through..  the Scottish salmon was underseasoned , thus bland..  the scallop ceviche was beautiful seasoned and i enjoyed it..The Scottish beef was good ..and the grilled brill was fine but I expect more than fine.. the lamb portion  was smaller than  expected and was underwhelming in taste.The accompanied shepherds pie was ok..The desserts were a big surprise..The passionfruit soufflé was undercooked and the coconut sorbet tasted like vanilla.The apple tatin was just ok.. and the chocolate desert was good..We requested our coffees to come with dessert but they came way after..  the petit fours were delivered with a warning that they were not sure of what ingredients were in them , this was important since one of us was allergic to certain fruits..In summary, the amount that was charged was ridiculously overpriced for what we received..I cant possibly refer anyone to this establishment and after frequenting other Michelin star restaurants I cannot understand how this one merits any stars..Do not waste your money.,",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iNiRsDJu39CGXUaLxMjsJw"
  },
  "t78UwxlSpMH6kCdC3irvdQ": {
    "date": "11/12/2013",
    "text": "We went to Galvin at Windows for dinner on my girlfriend's birthday.We were given a window table and although it was a cold and rainy evening, the views from the 28th floors were amazing. The food was fantastic and the portions a decent size. The staff were fantastic even before we arrived. Very friendly and helpful. A nice touch was the unexpected chocolates and birthday cake at the end of the meal for my girlfriend. I will definitely go back there again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OVxBBt1C0dyJ0PlVHTbe9A",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. What we had. And a free birthday cake courtesy of head chef Joowoon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OVxBBt1C0dyJ0PlVHTbe9A/o.jpg"
      }
    ],
    "user_id": "_obGEh0dUdfRSZscN4UV4g"
  },
  "p5yUOH5yDD67uNQPVp2NDA": {
    "date": "12/17/2013",
    "text": "While the view is indubitably fantastic - I recommend coming here at night - I can't really get too excited about Galvin. A formulaic menu, and hit-and-miss service ( ignoring the drinks orders of members of a large party - including a pregnant woman - and finally getting things wrong - e.g.coming back with one brandy, not two as ordered [ note - _not_ for the pregnant woman]) really undermine the overall impression. I suspect that the restaurant is highly reliant on a hard core of habitues and out-of-towners. Could easily be the best restaurant in a provincial market town, but would be outgunned somewhere a bit more cultured._____________As an addendum, I gather this place is about to go through something of a regime change - watch this space !",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GUUH2FU7r36h1KxEhZFXQ"
  },
  "YInTzmnlbp5vc--WoG_pjg": {
    "date": "3/9/2016",
    "text": "My husband and I like going out to iconic places in London and treat ourselves. This time we realised that not only food was perfect - light and flavoursome, we didn't even need salt and pepper on our table - but the service itself was beyond our expectations! There were compliments from chief at the start and end of our dinner, waiters were doting on us, they really made us feel special. And for this we do not mind to pay extra. The home made marshmallows were the best we have ever tasted, and we were given loads to take home with us. Bravo Galvin!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_yb4uprg_oduHdVEXP2bBQ"
  },
  "89ANfj9wfipfwLNO7jXoLg": {
    "date": "9/7/2016",
    "text": "Two weeks prior to my trip to London, I literally called all Michelin 3-star restaurants there and guess what? all reservations had been taken. Oh well, just go for what I have then upon arrival. I had the hotel concierge reserved a table in this Michelin star restaurant for lunch. I had 3 courses, half a bottle of wine at £55 and my guest had lamb chop from dinner menu. I chose grilled mackerel as starter, Suffolk pork belly as main course and chocolate sphere as dessert(this dessert was not on MENU DU JOUR but the server kindly offered replacement. ) We ordered another fine dessert Soufflé with pistachio ice cream. While the lamb chop was prepared perfectly, my pork belly with pork blood pudding was a little disappointed, simply not my kind dish. The waiter staffs were very considerate passing by our table several times to offer something different but I just passed. Taking into consideration not all customers were well informed what pork blood prodding was, the restaurant might train the staffs to coach customers during ordering at least some sort of reminding. Other than that, we enjoyed a spectacular view from our table and had the vibrant and memorable hospitality experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bJ71qoHLURkvdKzMpIOgOg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Souffle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bJ71qoHLURkvdKzMpIOgOg/o.jpg"
      },
      {
        "img_id": "p-lUyrzOuPDpPbYMvsAcOQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Chocolate sphere",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p-lUyrzOuPDpPbYMvsAcOQ/o.jpg"
      },
      {
        "img_id": "TR7RYSHh4Pkys4ZDfyuL9w",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Lamb chops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TR7RYSHh4Pkys4ZDfyuL9w/o.jpg"
      }
    ],
    "user_id": "3QedjfpnvBKlbaFyRTMsAA"
  },
  "29bIK2ypmEVvZtIQc4Uf4g": {
    "date": "9/11/2016",
    "text": "Bought the Amazon local voucher therefore quite reasonable price for set meals.Good view of Hyde park and good service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SnoTLuwU4Ilsfq-EBuxKWQ"
  },
  "XMatfYWZ-i1kB2Pxo-r5VA": {
    "date": "11/30/2014",
    "text": "I had high expectations given a strong recommendation from a chef friend and the Michelin one-star rating...We went for Sunday lunch and probably the jet lag didn't help our perspective. Service was attentive - overly attentive. We had no less than three different waitstaff repeatedly ask if we were ready to order until we finally made our selections. After that seemingly critical juncture, service could settled own to a more measured pace...until it was determined that our wine glasses were not sufficiently filled. At that point, we told them that we would replenish our own wine. The food was better than the service. We opted for the 3-course fixed cost choice. I started with the smoked salmon accompanied by beets and a basil mousse. The portion was large and both firm and flavorful. As a main course, I opted for the Quinoa and mushroom tart. This was good but the pastry was not very flakey and overall, the course didn't have a lot of flavor.The chocolate mousse was good but the accompanying fruit Crete (mango?) was overpowering. Overall, it wasn't my best experience at par with expectations. Maybe dinner would be better.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjgMNVvWUKcEzQsUUQPjgQ"
  },
  "__hwK7zKMME7AlzLfWZPmg": {
    "date": "6/20/2012",
    "text": "We visited here last week for my birthday and it was a beautiful restaurant with some of the most breathtaking views across London, particularly over Hyde Park. I'd requested a window seat in my booking and we got one which was even better. The atmosphere was nice and relaxed, fairly quiet with a business lunchy feel to begin with.The service was brilliant, very pleasant, friendly and unobtrusive. When the food arrived, it was hard not to feel / show a look of 'Is that it?' due to the small portions but believe me, we were full until the evening, even after a long walk around Hyde Park!We both found our starters - mine was t he mackeral tartare - a little disappointing. The mains were delicious - we both had the pork belly, it was tender and gorgeous, served with peas and potatoes.The desserts were also delicious, it was a Lemon and strawberry posset with breton shortbread. Divine. I drank the Pinot Noir from Australia and it was beautiful, I wished I'd written down the name. Also, the champagne on arrival was really nice too. At the end I was brought a nice Happy B/day dessert too which was a nice touch. With the bill - which unfortunately was wrong and a lot more than expected (the review would've have been 5 stars had it not been for this)! - we were served complimentary marshmallows which were lovely - strawberry and lime flavour which sounds weird but they were really nice! The bathrooms were stunning too, definitely worth a look! I've been told since that it's a fabulous venue for cocktails especially at night which I can imagine too. Next year maybe!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GLGLkUWXrOfjCiI-SN6_AQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Blurry pic of the nice, swanky loos!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GLGLkUWXrOfjCiI-SN6_AQ/o.jpg"
      },
      {
        "img_id": "HUKT914IIGgob01e7tm1wg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. View into the Queen's backyard from Galvin at Windows",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HUKT914IIGgob01e7tm1wg/o.jpg"
      },
      {
        "img_id": "mWaHxHnFVGNHDfW9AQQKJA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. View from Galvin at Windows",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mWaHxHnFVGNHDfW9AQQKJA/o.jpg"
      }
    ],
    "user_id": "S771b84rRUVnRRFy1fIBcw"
  },
  "vW4WU24zC3jYwkr6BwrsPw": {
    "date": "6/18/2014",
    "text": "Enjoyed a dinner at Galvin at Windows with my girl after finding ourselves in the area and looking for a nice place to eat. After positive reviews on Yelp and a last minute reservation we headed up to the top floor of the Hilton around 9pm, on a still, clear London evening. The set £68 three course dinner has some exciting options and the wine list is comprehensive. For entree we definitely recommend the scallops and caviar, perfectly cooked. The mains were small but delicious, I had lamb and her the beef, with a 2004 Bordeaux to complement. No complaints on either. Dessert of soufflé was a little lemon intensive, and the black pepper ice cream with strawberries was great. Service was superb, we had a great French waiter who was happy to help and talk. All up a pleasant evening.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wxVSLBBro8Z6xAU0rQMUJg"
  },
  "aX35Jz6YXu8-V7fEurg8YA": {
    "date": "10/11/2013",
    "text": "Surprised by the good reviews for here - I had high hopes but was left very disappointed. The view is spectacular, that can't really be disputed. However, I found there was a distinct lack of atmosphere, and the service felt simultaneously too formal but lacklustre. It was all forced, yet disinterested. And so to the food: it was passable, but nowehere near as good as other Michelin star places. In fact, last night I ate at Lamberts (no star) and it blew Galvin out of the water. To start I had a mushroom risotto - tasty, but it was accompanied by a quenelle of something dairy - I can't remember what - which was cold, and therefore quite unpleasant when eaten with hot mushroomy rice. A huge lump of pickled walnut lurked at the bottom and added nothing.  My boyfriend's fish dish just didn't work - mackerel with orange and fennel, but nothing was sharp enough to cut through the greasiness of the fish (which was, to be fair, perfectly cooked). Mains were better - pig cheeks with a delicious rich sauce, though I couldn't fathom the wisdom of putting harissa in mashed potato - and a beautiful fish dish, light and tasty.  I might add the bread was just OK as well. Desserts were the highlight - carrot cake with really good ice cream, and blobc of delicious ginger jelly - petit fours were just meh chocolate truffles. We had coffee wich was offered in such a way ('espresso is ok, yes?') that made me feel like I'd be putting them out to ask for a cappuccino. Things like that shouldn't really happen when you're paying upwards of £50 a head. Based on this experience, I wouldn't go back, not even for the view - it just wasn't worth the money, and I think there are more deserving places for that star. Nothng was bad, mind.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "hW0AmU0bTj_bwkOKDEjUnw": {
    "date": "10/24/2015",
    "text": "Lovely snacks&two cups of cocktail for £30 on Groupon. Fantastic view of London skyline& romantic place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2KNjdIKQwnb2mQ2AX51VA"
  },
  "epVW06iRKdnlqegBLCEduw": {
    "date": "8/21/2015",
    "text": "The \"pay what you like\" menu was an interesting encounter, very different to the usual menu so I guess it was more of a experimental project for the restaurant to get an idea of what  the dishes are truly worth to the consumers. I ended up paying £40 for the menu as I think there are other restaurants serving similar quality food in that price bracket at the pre-theatre time slot, such as its sister restaurant, Galvin la Chapelle. But don't forget you are dining at one of the most prestigious restaurants in London, with a stunning view of the city (28th floor inside The Hilton Park Lane Hotel) and top notch services to match.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "ZdWiE5Ur8JzsWbQpqIXbeg": {
    "date": "9/16/2013",
    "text": "We came here with a Living Daily voucher for lunch for two for £58.  It was for a 3 course lunch with a glass of champagne each.  We were satisfied with the experience and we would consider a future visit here to sample one of the more extensive menus.The restaurant is on the 28th floor of the Hilton Hotel on Park Lane.  It affords nice views of the Central London parks below and I think it may be even nicer at night time.  We got there just before 12pm and our table wasn't yet ready, but we were happy to wait momentarily in the adjacent bar.  We had a friendly welcome and this set the tone for the rest of the lunch.There were few choices for the set menu lunch, but we both found dishes to our liking.  For starters, my wife had the mackerel, escabeche and black olive caramel.  This was given an enthusiastic review and I was lucky enough to sample some.  It tasted just like the sea!  Intense flavours.  I had the salad Lyonnaise with slow cooked duck egg and smoked duck.  This was fresh and not too heavy - ideal for a starter.  However, I was thinking that perhaps I should have ordered the mackerel!We both chose the slow cooked pork belly with quinoa, peach pickled shimeji and spiced jus.  This was the obvious choice for us as we are both fans of pork.  For mine, it was a bit overcooked and the sauce was reduced too much.  Aside from that, I liked the flavour combinations and the texture contrast of the quinoa worked well.For dessert, we both chose the fig tarte fine, port, lavender & marzipan icecream.  This was light and not too sweet - it was a good way to follow up the heaviness of the main course.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "YprFMQ5vEf4IN-3iFTO0vw": {
    "date": "2/7/2015",
    "text": "Great bar with fantastic cocktails and an even better view. The only problem with this place is that, at night, it's full of prostitutes. Every other table will have some gross 60+ year old creepy guy with his arm around a pretty 20 year old girl in a tiny dress and hooker heels. Bit awkward.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "d5RdLdGU-a9tjuRapZcPwA"
  },
  "sgepVGBLXtTsyfp3Z9EIVQ": {
    "date": "4/7/2015",
    "text": "Although everything was cooked perfectly and the service was attentive. I simply wasn't blown away by the food here. Yes it was good but I've definitely eaten nicer food in non-Michelin restaurants before. Also, although we had requested a table by a window we didn't get one, so the romantic view was kind of lost in the middle where we sat.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Ge372SNSBFGvwo0Uld2bA"
  },
  "peCfLTvPhNJMrvwM6AxKvQ": {
    "date": "8/16/2014",
    "text": "Wow wow wow. My friend and I just came for cocktails but its like a joke its so great. Its on the 28th floor and the views are just extraordinary. The nuts they give you are so good and I'm guilty of eating the entire bowl. One of the cocktails was a take on the pornstar Martini (which is quickly becoming my favourite cocktail) and it comes on a tray in a potion form. Amazing experience coming here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "x5cprdVQdmgQbcM7ZYFcpQ": {
    "date": "5/14/2013",
    "text": "I ended up having lunch at Galvin at Windows as part of a school networking event, so I'll say up front that I didn't have a typical experience, since we had a set menu and servers and whatnot. However, it was still a lovely experience, including a great view punctuated by delectable courses that are exactly of the calibre you expect at a restaurant at the top of a Hilton.Each course we had was lovely, well made and with interesting and flavorful ingredients. This is certainly the kind of nice restaurant you would take your parents to, or have them take you to, if you're looking for a nice meal. It's not any particular cuisine, making it fancier in some ways, though I'm an ethnic food lover, so that's also something I missed about Galvin at Windows.The staff was great, though I thought it weird that it took upwards of 45 minutes per course to serve our group. It was five large tables, but we all ended up at different points in the meal and it just didn't flow smoothly. I'm not sure if that's typical though, so don't assume it would always be the case. I think it's certainly a nice place near Hyde Park, if you're staying in the hotel, or even if you're not and just want to enjoy the view.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "5cgLKK8wll2Qvxv7c5N75g": {
    "date": "11/4/2018",
    "text": "I had a great experience at Galvin at window with wonderful sunset view over hyde park. I went for their London restaurant festival menu - 3 courses for £35 and a cocktail on arrival. Although the cocktail was a bit too sweet to my liking (the waiter did offer to make a new one for me later in the evening seeing that the glass didn't go down much, which I have to complement on), the food was absolutely spot on. I had octopus starter, white fish main and a pear dessert. I enjoyed them all very much. With a bottle of white, olives, bread and service charge, the bill came to £75 per person - it is a bit of increase from the £35 for 3 courses but I think once in a while is worth it. I do have to say their service was wonderful, u also get a complementary postcard and once u fill it in, the restaurant post it for u! All in all, I was completely sold and will definitely go back again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdIOdqVndflxZ5L0YuHcQg"
  },
  "u029pyvapgQhr2UOxVKloA": {
    "date": "9/4/2018",
    "text": "Loved our experience here, great view and excellent staff. We both did the featured taster menu and were pretty happy with it. Although we thought they over did the soy sauce in one too many dishes - would have been nice to have a little less dominating flavor. Still, the staff was kind and helpful, they customized my menu to meet my dietary needs (I'm pregnant, so I couldn't do anything undercooked or raw). The only reason I took off a star is because the tables are setup with one person having their back to the view. I would have liked to both enjoy the backdrop of the city together.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtK7LUp7ukSxVi_EymYcKQ"
  },
  "o8OvhPu3UEqIeVhh5O5Phg": {
    "date": "7/3/2018",
    "text": "After having a wonderful dinner at Galvin La Chapelle, I was very curious to go to Galvin at Windows. ( La Chapelle is typical European food when at Windows is Korean fusion food)We went there with my family for my birthday and we were not disappointed at all!First the view! Wherever you are sitted in the room, you have a wonderful view of London.The service was amazing! Everybody was smilling, careful of our needs and looking to make our experience at Galvin perfect.This restaurant is pricy ( was decorated by Michelin guide...) but the food quality worth it. I ordered as a starter the cured salmon, then as a main the baked hake served with spicy cabbage and finally the pear souffle.It was gorgeous! Full of flavor and interesting mix. I also received a small cake for my birthday which was very thoughtful.I totally recommend this restuarant for a celebration meal to enjoy delicious food and a perfect view of London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "CzcezuffEv6boLGQkPMF4Q": {
    "date": "6/4/2018",
    "text": "I could swear I reviewed this magnificent experience before and it somehow disappeared. It's one of my favorite spots to dine in London. Should I write that the food is worthy of the view or that the view is worthy of the food? Both are outstanding!  After several dinners, today was the first time I ate lunch here. The food was just as good but the daytime view was more amazing. You can see so much of London! Perhaps the best advice is to have dinner in the winter and lunch in the spring and summer. I always get the menu degustation. Every dish is a perfect medley of flavors. The wine pairings were ideal. The sommelier described each wine, the region, and told a story about the vineyard or vintage. (All the vines at La Crema were recently destroyed by a fire!)The service is stellar. Courteous and prompt, always at hand without being clingy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6xh4RHBZS7MG6rgubRLSlw"
  },
  "SDU8woMI7myq4LwxrRpv3Q": {
    "date": "4/24/2018",
    "text": "I had a dinner with my sister in the begging of March during my visit in London . Not a secret that London is classy and has so many high end restaurants , but definitely Galvin is one of the bests . This Michelin star restaurant got a perfect combination of atmosphere , environment , service and incredibly delicious food . Starting from the view - it's located on the top floor of Hilton restaurant , so yes - they have an amazing view because the restaurant is designed with \"glass walls \" which means you're enjoying your food and the view of the whole London  The service is very friendly and very professional .They are very attentive and always make sure you never wait , you have everything you need and want ,you are fully comfortable and can enjoy your time . Now the most important - the food !!!! It looks like an artwork , you don't even want to touch , every single piece is put in the most possible perfect way in your plate - like measured each centimetre . The way they represent you is already satisfying but when you try it - that's when everything becomes 100% perfect . You can taste each flavour and how smoothly they work together . I would never believe if someone would say something negative about the food - it's cooked right in a needed measure , tastes great, is being served at a right temperature with the right dishes and even if you're not familiar with certain dish they make sure to let you know in advance so you can decide are you willing to try it or not. The chef sent us also complimentary desserts and the best marshmallow I had in my life - no joke . Would recommend to go for sure if you get a chance because the time spent there is gonna become a remarkable memory from London . It's good for any occasion - business meeting , family dinner , friends gathering , date etc . As a mention despite i don't remember any dress code  officially mentioned by them , would highly recommend to dress up appropriately . Also make sure to plan in advance and make a reservation because the space is a decent size but not huge and they are usually packed you might miss a chance to get in .",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4QZyiLSFGK0KgUholp9dbg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4QZyiLSFGK0KgUholp9dbg/o.jpg"
      },
      {
        "img_id": "hku--6C8RLwVJM45qj3azg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hku--6C8RLwVJM45qj3azg/o.jpg"
      },
      {
        "img_id": "hTGRoc4CWoYpZneZSD68CA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hTGRoc4CWoYpZneZSD68CA/o.jpg"
      }
    ],
    "user_id": "8liWrV6SwFCwHzLM7IItzw"
  },
  "CHZjbO32ubqv0_EIl9H_FQ": {
    "date": "8/31/2017",
    "text": "My second stop in London was Galvin at the Windows. Thanks to Google Trips, I found a deal for this place: 33£ starter meal, great view included. This place was gooood. Fresh on the taste buds and the mind, let me walk you through my journey here;1. First impressions: the hotel base of Galvin is dope. Mirrors everywhere, a narcissist's dream 2. First impressions pt.2: I step out on the 28th floor and immediately get greeted. I say I'm early for my reservation, the host says I can be seated or have a drink at the bar. Initially I went to the bar, but having had a long day of traveling from Los Angeles to London, I opted for Sustenance. They delivered. 3. Bread. Butter. Bellini. Need I say more?4. Course: chosen. Beet sAlad, chicken, goat cheese ice cream ( more on this later )5. Waiter walks out with a sampler of a cheesy puff pastry ( 2 quid sized ) and a shot of melon prosecco soup. Heaven 6. Sommelier comes by. We discuss my meal and he suggests a couple wines. I go with the 2012 Riojas Reserve, Spain 7. Starter: a good mix of savory and sweet with some crunch. I thought the jello were ice cubes. Pleasantly surprised. Presentation: fire8. Wine. Gooooood 9. Main: chicken with a purée of mashed potato and red bell peppers marinated in something tasty. Filling. 10. Dessert. Idek where to begin. Get the goat cheese ice cream with honey comb bathed in cherry sauce. It's unusual and delicious, plus the honey comb has a kick to it. I asked a woman working there: ginger. 11. Post dessert dessert: chocolAte Overall: 10/10 all around",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VXwrFSLodGhl8awvKMGtxg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Menu for starter / 3 course meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VXwrFSLodGhl8awvKMGtxg/o.jpg"
      },
      {
        "img_id": "mLhrAhJw8V4cBcrFr3gMpg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Belle I",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mLhrAhJw8V4cBcrFr3gMpg/o.jpg"
      },
      {
        "img_id": "UQ6pLdu8F34k21tymViVRQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Fig salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UQ6pLdu8F34k21tymViVRQ/o.jpg"
      }
    ],
    "user_id": "mwYMSnQ6GAV_4dU1xQZGvA"
  },
  "mDYPU_HvAjCARD8mRPvHdQ": {
    "date": "5/15/2017",
    "text": "Had dinner at Galvin at Windows on the 28th floor of the London Park Lane Hilton. Naturally, the views were impressive, the service was very good as was the food. The food was not great, but we didn't expect it to be, and it didn't affect how much we enjoyed the experience one bit.We started off with duck breast, cold bacon and endive appetizer and an artichoke, asparagus and goat cheese salad. Both were served with a rustic sliced bread, and dark brown wheat pull apart rolls with a rich butter to slather on top. The appetizer course was good, just not great. The bread, however, was!For entrees we had a deconstructed coq au vin. Again, no complaints, but no raves either. The broccoli I side was small but very good.The apple tart for dessert was served with a burnt butter ice cream and both were excellent.Bellinis at 15 British pounds each were excessive, but you are paying for the spectacular view!I would recommend Galvin at Windows to anyone coming to London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "bvGrZggjxWlmNgG8OrQMaA"
  },
  "LVCsVd7h_d8BjmkndDLjeQ": {
    "date": "4/27/2016",
    "text": "Lovely restaurant located on the 28th floor within Hilton London hotel. Seems to be a restaurant where people bring their business partners for lunch, there were a few tables of men in suits, ties and brief cases  Staffs: Professionally dressed and very friendly, attentive and service was fast. Offered me a postcard (With a picture of the view from your seat), they will send it anywhere it the world if you fill it in, complimentary :) I thought it was a really nice gesture! The view was ok. If you are seated next the to window (depending where) you'd probably get to have an overview of the city. But there's also a seating section where the view faces a large field.I enjoyed the food mains the most. The pork cheeks were soft and juicy, nicely paired with polenta. The portions were ok, not too big but definitely not a tasting menu's size either. I thought the orange cake could have done slightly better. Seems like an OK place to take my parents here for tea or lunch. They would probably appreciate the classic interior and the peaceful scenery.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "kE6oohcnl01m9WAVNP88GQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Dessert: Almond creme brulee, pickled pears, anise & cardamom ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kE6oohcnl01m9WAVNP88GQ/o.jpg"
      },
      {
        "img_id": "QE7DMyOIxRStCsuF2_4kjg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Dessert: Warm orange cake, cinnamon tuile & chocolate ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QE7DMyOIxRStCsuF2_4kjg/o.jpg"
      },
      {
        "img_id": "23XX0hq4kgdVywlGxRCJig",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Main: Roasted fillet hake, shellfish broth, spring vegetables & espelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/23XX0hq4kgdVywlGxRCJig/o.jpg"
      }
    ],
    "user_id": "v5XZL6DY0aWq6LEM-vVIOw"
  },
  "kytGQqxlPEll5dfGHwHFQQ": {
    "date": "8/25/2017",
    "text": "Came to Galvin for lunch on a Friday. The girl at the reception was totally rude. I thought I would have a bad day experience but it turned out to be the opposite. The rest of the staff is amazing, the food is above British average. Actually quite nice. The view is stunning and most importantly the coffee was good too! Not much more to comment on food, have a look at the pictures. I came here with a Groupon code a friend gave me so I expected less but got a lot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QHthuwfGgY9P7gASYQthAg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QHthuwfGgY9P7gASYQthAg/o.jpg"
      },
      {
        "img_id": "Wk4HMBQM_a2nS8wgnFgRtQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wk4HMBQM_a2nS8wgnFgRtQ/o.jpg"
      },
      {
        "img_id": "xcNjPwr5PddcsHGVpfUW9w",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xcNjPwr5PddcsHGVpfUW9w/o.jpg"
      }
    ],
    "user_id": "82E03DpzpFiGmvGo5T_iYQ"
  },
  "1u6LhMdZpd-L16iujdxWQA": {
    "date": "9/17/2016",
    "text": "Amazing venue, service hit or miss, lovely very overpriced cocktails - but this deal wouldn't feed a small child let alone two adults!We had to go for something to eat after. I know it was only £30 but the evening ended up costing £130! Go to M&S and buy the 'picnic' items there/ no difference!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZIf4Kzi6P8tV7PcQjKmNJw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Gosh!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZIf4Kzi6P8tV7PcQjKmNJw/o.jpg"
      }
    ],
    "user_id": "vC3HT_Pv62TblE002T567Q"
  },
  "LH6lsRNEOMn9fBw39OsiCg": {
    "date": "6/15/2017",
    "text": "AmazingOur son booked this for our family last Christmas, we had fantastic food and wine for lunch, and the views of the city were amazing.Staff were all friendly and first class service.Would I return and the answer is yes!Christmas 2016",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L7PEU0Bv3hbzdEsJcvjIMQ"
  },
  "NjHnH8yPNMntC3jHThaKtg": {
    "date": "4/4/2016",
    "text": "Set on the top floor of the Hilton Park Lane Galvin at Windows of course offers some stunning views of London. I have always have a level of suspicion towards places that have nice views, outdoor terraces etc as it more often than not means that they get their customers even if the food is not good. Galvin at Windows do however clearly also focus on the food. We were there for lunch so not sure if they were on top of their game but we had really good food straight through the meal. Especially the starters excelled. The service was always present but it appeared as if some staff were in training - a small difference maker compared to some of the top notch restaurants was also that not a single dish was presented and despite knowing what I ordered it would have been nice with some sort of presentation. Comparing it to for example Hibiscus that I ate at the day before this was equal in food quality, more relaxed service and better atmosphere at about half the price. Would consider returning as it is good food, nice space and good value for money.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ3mumX9WjJqp6qrjPPUBQ"
  },
  "KbmLtlHeWiKC-TGk8Ir8fw": {
    "date": "3/2/2016",
    "text": "For dining or drinks with a view it doesn't get much better than this!We went for early evening drinks with a few bubbles thrown in. We had a booth reserved by the huge window and the view was spectacular - the service was even better, our waitress was so attentive and made sure that our champagne glasses were never less than half full!Make sure you book to get a good seat.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n05kfanN5PD08amnGF079w",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Champagne with a view",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n05kfanN5PD08amnGF079w/o.jpg"
      }
    ],
    "user_id": "15Jq6oZmbpDSPN13Y4V87g"
  },
  "aCU6stuxjtOBzEypUMJqRw": {
    "date": "11/4/2016",
    "text": "We bought a Groupon for a set lunch, but didn't realize that we wouldn't be able to choose courses from a menu. Instead, the three courses were chosen for us. Anyway the starter was something called \"Pig...and Blood Pudding.\" It came with a thick slice of sourdough bread. It was okay, but not a starter I would have selected or had again. The main was a mackerel dish in lentils, which was extremely tasty. The dessert was a relatively simple pear, sable and cream cheese thing (nice but would not order again if I had a choice). The service was excellent and friendly and included a few extras we did not expect, such as a few chocolates and a jar of big, fluffy marshmallows near the end. Be aware that if you are offered olives or cheese, you will be charged. The olives were amazing! The sodas were also about 4 gbp...it adds up! The view was wonderful. I would definitely go back for more, but just not those particular courses.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jjRfw-tG4szubJREbacQWw"
  },
  "fywaobgZ_La4SSx4hOQqDQ": {
    "date": "11/4/2016",
    "text": "I had never been to a Michelin star Restaurant before so when London Restaurant month rolled around in October I thought it would be the best time to try!I go out around once a month with friends to somewhere new so a couple of us booked up to go to Galvin at Windows. It's on the 28th floor of the Park Lane Hilton and the views across London are outstanding.The welcome from the staff was excellent;!they were formal yet welcoming and very well turned out. Our table was located on the raised centre section of the restaurant meaning we got to enjoy the views and see across the whole establishment. We had booked for the 3 course set menu and set about making our choices. One of my group, being a Muslim, was catered too as much as was possible by the kitchen and had no trouble choosing tasty dishes.We were givens a free amuse-bouche of cold pea soup with smoked eel and Granny Smith apple. A delightful fresh way to start the meal. My palette, and that of my friends, may need a little refining though as we all thought it would've been nicer warm.For starter I opted for the ballotine of pig head. This was an incredibly tasty terrine of pork meat with black pudding cubes through it, sour dough toast and pickles on the side; just like you'd have in the finest French wine bars. My friends had celeriac velouté and smoked mackerel dishes. I tried a little of the celeriac velouté and it was delicious and rich but we both agreed that there was a lot of it and the richness stopped her from finishing it. My other friend had the smoked mackerel which looked stunning and he assured me tasted great except for the fact he found himself picking small bones out of it.For the main I had beef bourguignon with bone marrow jus. This was as good as it sounds with the beef melting in my mouth and the rich, sticky bone marrow jus giving it a beautiful coating. The vegetable garnishes were well cooked if a little cold, perhaps they spent a little too long at the pass. My friends both had the salmon dish and agreed that it was possibly the best salmon they had ever had. I don't remember the garnishes but I do remember that we couldn't convince one of my friends that you're supposed to eat the crispy salmon skin; what a waste!The desserts were very good; I had spiced William pears and my friend both had the jelly and ice cream. The pears came as a small dish but finished off my meal very well leaving me nicely satiated. My friends disagreed on their jelly and ice cream; one thinking it was amazing and the other thinking that there should've been more jelly, less berry. Both enjoyed the ice cream though.The meal was finished off with some delicious truffles and marshmallows. I particularly liked the passion fruit truffle.The meal, all in all, came to £170 including water, wine and service charge. For a 3 course Michelin star meal for 3 people, I'm certainly not complaining I just won't be doing that regularly.I can't say it was the best meal I've ever had but from what I know of Michelin it's not just about the food. The whole experience was exquisite. The staff were perfectly polite without being stuffy, even having the occasional laugh and joke with us. The restaurant itself was posh but inviting. I particularly liked that they give each guest a postcard and offer to post it anywhere in the world. This is a really nice touch. We each sent a card and within a few days they had arrived!This is a fantastic restaurant and if you haven't been you really should. I may or may not be back again because there are so many other exciting places I want to go and eat!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lBeBGEdiaG4yP1Eqa0hjkg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Spiced William pears with cream cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lBeBGEdiaG4yP1Eqa0hjkg/o.jpg"
      },
      {
        "img_id": "gswjngA3AJcE1giigq0A7w",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Ballotine of pigs head with black pudding and sour dough toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gswjngA3AJcE1giigq0A7w/o.jpg"
      },
      {
        "img_id": "KF3a2_2B8F7_VKDa_qOCTA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Beef Bourguignon with bone marrow jus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KF3a2_2B8F7_VKDa_qOCTA/o.jpg"
      }
    ],
    "user_id": "VF3-orqv6RY8eEB1zM42Bg"
  },
  "jG5Oz9Ktd7e7_acsMYJLew": {
    "date": "10/1/2016",
    "text": "My friend got a deal on Groupon for the 'Picnic in the Sky', which is what led me to Galvin at Windows. I'm glad she did as I really enjoyed it! I felt a bit like I was on holiday as I was memorized by the view. The service was excellent and everyone was very friendly. There was a mixture of tourists, city workers and dressed up people out on the town. We didn't really venture around the bar, we stuck to our table and watched the view from day to night and it was cool to see the city lit up. We had a cocktail each and some nibbles as part of the deal. The food was ok, nothing special. It wasn't really sufficient to fill me up, I was still hungry later, so it is definitely just nibbles and not a replacement for dinner. The cocktails were really nice, but if you want to keep drinking them they are on the pricier side so we shared a bottle of wine. It was a great evening and such nice surroundings, I would definitely visit again and recommend to others.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ltVFrlG9BxWKWYvWWw-TAw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Ladies bathroom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ltVFrlG9BxWKWYvWWw-TAw/o.jpg"
      },
      {
        "img_id": "pEj-wQtFKabO19Z2vDPDmA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pEj-wQtFKabO19Z2vDPDmA/o.jpg"
      },
      {
        "img_id": "Xx-QVrYcqzPEkUjt6STfuA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Cheers!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xx-QVrYcqzPEkUjt6STfuA/o.jpg"
      }
    ],
    "user_id": "iTqJhD4HXDsWLtfWfx28Ag"
  },
  "65yJ5rdahi0rAvHOoNu6Kg": {
    "date": "2/24/2017",
    "text": "What can I say other then great food great service, great views and a great price. Took my daughter to experience the finer things in life and boy did she enjoy it. I will definitely be going back the next time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lUrh7YXexcsUoaIQJQ4ayg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lUrh7YXexcsUoaIQJQ4ayg/o.jpg"
      },
      {
        "img_id": "uD1U4rnTSxKyoQ3o4DqvXw",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uD1U4rnTSxKyoQ3o4DqvXw/o.jpg"
      },
      {
        "img_id": "qTtmn0XSJUqpgBKrH7gtTQ",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qTtmn0XSJUqpgBKrH7gtTQ/o.jpg"
      }
    ],
    "user_id": "l_RN8R6yOLo9i14CM8DahA"
  },
  "QqqOqoVMM3PUSlWnYFazrw": {
    "date": "12/31/2017",
    "text": "We went to Galvin for lunch on Saturday, the view from 28th floor is impressive. The food was delicious, staff was very friendly, attentive and service was fast. I would gladly recomend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WEmQCt3kaoKqj4Q9KW6TRg"
  },
  "nN3G1-tfTXsIvdFWoMjdrA": {
    "date": "6/5/2016",
    "text": "We were a party of 3 that dined in May. We had the Chef's Menu set, 2 courses at $37 or 3 courses at $45 with a complimentary glass of Bellini.  The good:My request for a window table was accommodated. The amuse was delicious, sets you in the mood for more good food. The bad:- The service was not of a Michelin-star restaurant. Our table was not cleared of crumbs between courses, not even when the amuse was served and our table was full of crumbs from having been given a bread basket to start the dinner off with. It was only brushed after our entrees were taken away. - One of us had ordered a glass of wine and it was forgotten until he reminded our server. It was brought to him by another server with his hands around the glass body instead of at the stem. - Entrees were set down in front of us without any consideration to the plating i.e. how the diner is supposed to see the food. - The pressed chicken appetizer was served on a worn-looking plate that had black scratches in the middle and tiny holes near the rim (see picture). There was also a chip near the edge. I asked the server about the plate as it was distracting and a turn-off actually. His story was it's a custom-made plate and very expensive. There were even customers who had asked to purchase the plate. I took that to mean it's a piece of modern art and unfortunately I don't appreciate it. The appetizer itself didn't taste spectacular. - The pan-fried fillet of cod didn't have a good crust, the braised endive was bitter and not delicious. The curry oil lent an Asian taste however, it did not elevate the dish to something beyond ordinary. One of us had the pork cheeks and although it was nicely braised, the flavour of the dish was again, ordinary with Asian flavours. - The worst food item was the coconut-flavoured marshmallows offered when the bill was presented. It was made in-house but it tasted badly of artificial flavour. The first bite felt like I was eating suntan lotion! All of us grimaced at a bite, it was that bad. All in all, it was a poor dining experience because I had expected much better since it's a Michelin-star restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6SQbptMXIaoCcA0APsJf1g",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Braised pork cheeks",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6SQbptMXIaoCcA0APsJf1g/o.jpg"
      },
      {
        "img_id": "iJY1hEK_Elmdzd4laLw6AA",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. The amuse - chicken liver pate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iJY1hEK_Elmdzd4laLw6AA/o.jpg"
      },
      {
        "img_id": "pBNwZf9fKcPCbpO17wD2bg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom. Pan-fried fillet of cod",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pBNwZf9fKcPCbpO17wD2bg/o.jpg"
      }
    ],
    "user_id": "sKl_q3IcUcJUF2Cj8Y20gQ"
  },
  "2_NAwQeS9EAdd_LCO-Yr5A": {
    "date": "5/29/2014",
    "text": "Galvin is the roof bar & restaurant on the 28th floor of the Hilton Park Lane.  If this was NYC or Hong Kong, this bar would look at the side of another building, but being that it is London, you can practically see Iceland.  The view of the surrounding area is fantastic.   My visits were to the bar only.  Most of the seating looks to the west out over Hyde Park and if the sun is out, the sunset.  I think the better view is to the east, where you can see the emerging London skyline, including the Shard tower.  The music was kind of loungey, downtempo electronic and the décor was modern, but comfy.  The service was very good.  My drinks came quickly and were well made.  The only beef I have is that the drinks were very pricey.  I ordered 2 cocktails and the total was around £45. Yikes.  Also, the crowd was mainly hotel guests and couples having a \"romantic night on the town\".  Definitely not a happening, go-to hot spot, but it was a fun place for a few drinks.Great place to come after work and have a drink while watching the sun set over London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uJKwSkz6wYi3xPRTwQZArg",
        "caption": "Photo of Galvin at Windows - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uJKwSkz6wYi3xPRTwQZArg/o.jpg"
      }
    ],
    "user_id": "DRT-FcIa-ls1AqCX9e5Nvg"
  }
}