{
  "OAgjg7tjvYJlnCEXlmycUg": {
    "date": "11/14/2009",
    "text": "Caveat emptor: on the same street as Siam Central, which is under the same management.  Logically, you'd think these two restaurants would be the same, but no.  Different chefs? In my humble opinion, the tofu pad thai at SC is far superior.  My dish at TM was bland and underwhelming.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0vwC3_DwaOpO-yETIVibA"
  },
  "9rkiSOcXrBOnFaOiMHfcaw": {
    "date": "12/14/2011",
    "text": "perfect little thai place for lunch or take out.  clean and quick and cheap.  and they don't use ketchup in pad thai like the thai place across the street from me.  no ketchup in noodles in a plus.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "vojxruWbEFlodBEZSvnNnw": {
    "date": "1/31/2010",
    "text": "This place has seriously good food.  Don't miss the duck pineapple fried rice that comes served in a real pineapple.  I think this is my favorite Thai food in London!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OG6CmSFoWTLhlFyoEWL8vQ"
  },
  "69B_WY5ViC-V5XLejtFnNQ": {
    "date": "2/15/2010",
    "text": "Went here today with a colleague for lunch. You really can't beat it! 7.00 for an app and a main dish. I had the pad thai and my colleague got the red curry. Both were just really fresh and good. I was really impressed!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Z_NUr1qfK6skxkVI_oCZQ"
  },
  "aLFwUfEyImZhIq9-K8MzYQ": {
    "date": "9/10/2011",
    "text": "Our favorite Thai restaurant! Have gone here multiple times in a week before to have the yellow curry.  Love it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qSwprYehcnoIQ7XqWTtybQ"
  },
  "-quk3VyKwo2QrdDfb3UfBA": {
    "date": "1/27/2010",
    "text": "Good value for lunch - it's also fast. Food is pretty good, though I give Siam Central a small edge over Thai Metro for better ambiance.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GALwmrVU3WEm1jySFcOQpg": {
    "date": "1/11/2011",
    "text": "This is an uncomplicated Thai place for those who want acceptable to good food served rapidly. The drink arrived in 1 minute and the dish 6 minutes later, with a full restaurant bar one table. Amazing how refreshing banana critters can be after a spicy chili and basil stir fry!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ptBkDBYJvvjl3FHzPot4GA"
  },
  "0CPlH1eUkSOSTn1Tg3PLBQ": {
    "date": "2/7/2009",
    "text": "There's quite a number of Thai restaurants around this area, but Thai Metro is a good value & friendly Thai. Healthy sized portions which were presented well. Also reasonably priced. I'd go back again, even though there's nothing to make it really stand out.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "etApEX9f2JYJpRI__fpX4Q": {
    "date": "10/16/2010",
    "text": "Wonderful place - great food and great staff. The green curry was amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Y9PbSjOdJDHadiXNlvUzA"
  },
  "lF1iodRDx9jVO8LcuXPMMw": {
    "date": "1/28/2009",
    "text": "This is a great place. I probably go here at least once every couple of weeks because i love it so much. Great service, great staff, the place is very cosy and always warm. Must try it, you'll love it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DrxYe4tGLqtFe5zOiifYGQ": {
    "date": "1/21/2009",
    "text": "I came in for a quick lunch on a weekday, and found the place quite enjoyable. Clean, calm, and bright with unintrusive and very efficient staff. The food was quite nice, typical Thai menu (soup, curries, stir fries) and average prices for the neighbourhood. The drinks seemed to be on the expensive side  a rather small cup of jasmine tea cost £1.65 without the usual free top ups. 10% service charge was added to the bill.An okay experience overall, probably best for a quick lunch.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bPUKvbXL00YMH_zof732Kw": {
    "date": "1/8/2009",
    "text": "I love this place. I go here for lunch every week, sometimes twice a week. The food is very tasty and is a reasonable price. I've recommended this place to alot of my work collegues and now they have become fans too. I go there so often the staff know what to order for me as soon as i arrive. Very friendly and relaxed atmosphere.You should definately try this place out, you wont be dissapointed! As the food is so great, please note it does get very busy.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pWoMFg2jN-7dLiWFjXlUuw": {
    "date": "5/18/2011",
    "text": "would give 3.75 if i could. food was fantastic value and all very tasty with very pleasant service. only gripe would be sticky rice was too hard to pull apart and curry sauces were quite heavy for Thai.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GqoDyM4Z3EOyGzDomZVJeQ": {
    "date": "12/12/2011",
    "text": "I had a great meal at this thai resturant tonight.Previous visits have shown it to be fairlyindifferent, but I went for the steamed sea bassin tamarind sauce with boiled rice. It came tothe table in a steaming metal fish shaped casserole.It was deicious. The room downstairs is sparse &becomes too noisy to even hear yourself think - let alone talk  so I would recommend remaining upstairs, Prices are extremely good for this partof town. Mine was the most expensive dish at £12& was enough for two if you also had sweet, whichI skipped. I will definitely return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VUzziZxB54peqeY83VM0qw",
        "caption": "Photo of Thai Metro - London, United Kingdom. lovely Thai art",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VUzziZxB54peqeY83VM0qw/o.jpg"
      }
    ],
    "user_id": "5yuHp8kydkGAu9WctLlCBQ"
  },
  "-sNJO8_bRDW6IQ6IC4FHeQ": {
    "date": "10/9/2014",
    "text": "Panang curry! For some reason this curry just made my week. It was that delicious. I went on a nice September night and sat outside. It's on a fairly busy street, so maybe not the best decision, but you've got to take advantage of good London weather when you've got it! I wouldn't say the atmosphere is the nicest, but who cares when the food is so delicious. The service was friendly and fast. Don't let the name turn you off. Thai Metro is great!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "YdCN6bvDhiJa6Kk1Ghhx1A": {
    "date": "4/12/2015",
    "text": "Love the curries at thai metro! I have not been in their restaurant, but ordered their food several times on just eat. Have ordered at a couple different Thai restaurants in london but to me the yellow and red curry of thai metro are definitely the best. Soft creamy textures and nice and spicy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dfn8juB9prKsqVchKXSoHw"
  },
  "R6et9Prq5wzKBMiL1HMBVQ": {
    "date": "9/1/2014",
    "text": "We received our food quickly, perhaps a little too fast since the spring rolls were cold in the centre. The fish cakes however were perfect and the peanut dipping sauce very very good. The panaeng curry was nice and hot, but the rice seemed a little on the dry side, like they had been sitting for a while. They have a good variety on the menu, also for vegetarians.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8q-d3gR830GKnwOUANt2DQ"
  },
  "I5QMsK7PKrFQpkebpKMoZg": {
    "date": "4/19/2010",
    "text": "We decided to try this place out. The food was good, but I have tasted a lot better Thai food across the pond. The service was good, which we did appreciate.I liked sitting in the basement because it was quiet and away from the commotion up top near the bar area.The place was busy in the evening on a Monday, so make sure to make reservations (especially on weekends).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-qBdY8tMxrygPDku4Ca0w"
  },
  "tJIkVnlDS1u9U7XnbTeGjg": {
    "date": "1/26/2015",
    "text": "LOVE Thai Metro - especially the drunken rice with beef. It's really cheap, busy and about as authentic as it gets for London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_3wkyVPcPok206pcQyCcA"
  },
  "aUOL8b5hZnuf_Ftka8nnqA": {
    "date": "11/23/2014",
    "text": "We had a lunch for four today and really enjoyed it. The starters were a bit weak (except for the duck spring roll which was very good). Two of us ordered the prawn pad thai and the rest ordered the drunken noodles with duck. Both dishes were excellent, especially the drunken noodles if you like spicy dishes. Very recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utuI2x2VMuxJzvu1gBw7OA"
  },
  "oROiKIgQilygQPLbjp-gBw": {
    "date": "3/31/2014",
    "text": "Small little thai restaurant with some outdoor seating.  Prices are very fair for the excellent thai cuisine.  Curry and drunken noodles are my favorite...fast service",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFmkn1dUb4p5wwJAQ_YJQA"
  },
  "Ke9Qpl2flkZR76OgBfyHOg": {
    "date": "1/25/2011",
    "text": "Food was good, but didn't blow my brains. Portions are also kind of small (but this is also coming from the little American girl who eats like a beast, so who knows...I could be biased.) Anyways, I had the Thai metro noodles and my friend had the Pad See Ew with tofu. Both were good, but once again, nothing shamazing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "haxK-nxfmeLG0fA-nnLGJg"
  },
  "6LDFAA2JbEz5bMnNJ1sHww": {
    "date": "3/23/2014",
    "text": "This place has some really amazing Thai curry. I went with my family and we each got a different type of curry- they were all delicious. The Green and Masama were especially amazing. The only thing you want to keep in mind here is that the curries really aren't all that hot, so even if they warn you that the green is quite spicy, don't worry about it. I could pretty much drink this stuff! Not too crowded and the service was very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DIgMs8lku1x_SkbLUpNoAw"
  },
  "bu60TmzptDPhD7UUCXxp_A": {
    "date": "1/30/2015",
    "text": "I've eaten here 3 times in the last year. Every visit was great. It's a small restaurant but I've never had a problem with seating. They have a room downstairs and seating outside. Staff is friendly and attentive. Food is awesome. This is my go to place for Thai food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqDrh9AKVNrguaPjw-xE1g"
  },
  "MW-zdBbbI2giMQFh9oWrLg": {
    "date": "7/24/2009",
    "text": "What I want in a Thai restaurant:1. Good food, clean tastes,2. Decent selection3. Variations for vegetarians4. Good valueWhat you get at Thai Metro1. Excellent service, and no hanging about with getting tap water.2. Fantastic food, with really good veggie platters that can are great for carnivores as well.3. Ability to cope with some quite unusual food requirements e.g. a cucumber allergy, with no qualms4. Happy to accommodate a young child with excellent attitude.The place buzzes, turnover is brisk, and the food is excellent value for money, particularly given the area.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "MDQ7Az8MFx2IuNwZpSZDJw"
  },
  "39VeYeK0DGjkNOgeW1QmrQ": {
    "date": "8/1/2010",
    "text": "Went there last week, Friday night with friends, busy service but staff were quite attentive. We ordered 2 sets of mixed starters to share and the usual fare of thai curries which were all cooked nicely. I had the stir fry duck for a change, the meat was full of flavour but maybe there was too much sauce drowing it.Good prices for Central London and more generous portions than nearby Thai restaurants.There was a noisy hen party that night so probably best to go during the week, I remember going on a date a few years ago and the atmosphere was very relaxed.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BwiZksn7Nm3ZxASqZAB0eQ": {
    "date": "5/29/2009",
    "text": "Let's start with the amazing bits.  The Yellow Curry was absolutely the best simple curry I have ever had.  Order the Coconut Rice for your side and you will be in heaven (sorry if you one of those rare folks who don't care for coconut), but this dish is worth the trip alone....and the desert.....(wow)OK, the rest of the story, is the Pad Thai was ok, not bad, but I have had better.  The host was very stand-offish and not helpful, however the wait staff made up for his performance.  We waited about 5 mins for a table of two on a Friday night, and our food was on our table before we could discuss if we made the right choice. In the end we had a Coconut Crepe for desert that was a cross between Baklava and French Crepe(amazing). All in all, we were well satisfied at £15/person for two dishes under 7, desert under 4 and a bottle of wine for 13. The atmosphere was a bit live, but not so much that you could have an intimate occasion.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TjDUfUN2J143970UafNTtw"
  },
  "hPXKo37cI_b1rzdgFdmbjA": {
    "date": "4/8/2011",
    "text": "Great spot on Charlotte street.  They open the windows in front on the warm days which is really nice.  The Panang is good along with the chilli basil.  It is a bit on the hot side so make sure to let them know if you don't want it spicy.  This place has really great and friendly service, they only charge 10% service fee and the prices are very reasonable.  This will be one of our regular Thai go-tos in this area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rZ2FhKqV3EHgVJWj36jaYg"
  },
  "ceR9FbBJOHAWCl_KBIdIrQ": {
    "date": "9/13/2010",
    "text": "Lovely place, managed to get a table outside on a friday night. Friendly staff and the food is really really good. four of us ate for £80 including drinks. And the staff didnt rush us when we had finished. Sat talking for an hour afterwards and n one complained. Definately would recommend",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_iILEVmzr9uoiGMVQPhjdw": {
    "date": "11/8/2008",
    "text": "This place has the best prawn pad thai ever. And some really good meal deals which I would thoroughly recommend- 7.50 for a set menu including starters, a choice of mains and pudding- go for the coconut ice cream!The atmosphere is bustly, always gets crowded in the evenings and peak lunch hours. The waiters stay on top of things though, and food is served promptly. I had my birthday meal here with about 10 friends and we absolutely stuffed our faces for around 10-15 pounds a head.The green curries and coconut rice are another favourite, and also they give you liberal amounts of prawn crackers if you ask nicely.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4IBcucqWoetv1A4Mzigvw"
  },
  "XGO2P7Jdck9CaBhH0WZU-w": {
    "date": "8/31/2011",
    "text": "This is great place to meet up with someone for a quick lunch in Fitzrovia. The food is tasty and the portions are good and they have a good express lunch offer. Sometimes the service can be a little slow but if you let them know you're on the clock they're always willing to speed it up a bit. if the weather is nice you can sit outside and watch the celebs go by!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aK0LHcFMHWxriTlF-gu6Cg": {
    "date": "7/26/2008",
    "text": "Some yummy thai with a great fast lunch menu. The dishes are pretty standard if slightly pricy. The dishes are freshly prepared and yummy. The service is very fast and while there is often a queue, they do get through people quickly. There is some outdoor seating but most is indoors. I have to admit to a little disappointment with the variety of ingredients and ultimate preparation of the dishes but overall this is a solid 3 out of 5 star lunch venue.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9Ktn-0zTHHP8O9PVsF7WUg": {
    "date": "7/31/2008",
    "text": "I had lunch here yesterday with the boys from work and it was pretty difficult to get a table outside (although once we did, all of the boys moaned about how hot it was in the sun - are they never happy?) The express lunches are the best value. £5.50 for one course, £7.50 for two and about a tenner for three. Considering I tried to drag everyone to Busaba down the road, I was pretty impressed with the prices here. I had ginger beef stir fry which cam with rice and a little salad and it was actually pretty nice. Could have done with a bit more of a kick though - I'm pretty sure if I'd have asked them to add chilli they'd have been fine with that. Everyone else curry was pretty yummy looking too They do coke in glass bottles too. For some reason it tastes better out of a glass bottle. Why? The food isn't as brilliant as Busaba, and there are a lot of Thai places around here, but if you can nab a table outside you're in a great celeb spotting place (no, we didn't spot any) and you can have a good feed over a long lunch. Not too shabby for Siany.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6s7KighPPNFab8uV8hS6TA": {
    "date": "6/20/2017",
    "text": "We were up on Charlotte Street for our anniversary, and had made a booking at a restaurant. It was rather early but most of the places were busy - except for the place we booked, which was empty. We decided that wasn't a good sign and started walking up to see the other options.Charlotte Street is full of eateries, but nothing was taking our fancy. We ended up at Thai Metro, which was of course not the appropriate place for an anniversary dinner, but it was nice for a quick meal.The portions were really large and we left loads of food, unfortunately. I had a chicken massaman and it was absolutely crammed full of peanuts - luckily I thought it worked and really enjoyed it. I'd come back for a casual dinner as it was pretty tasty, a decent price, and the service was fine. Thumbs up!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiojkDLHYdkfTJlINzUv-Q"
  },
  "f0QQgRBEICFWmCfwWFeuDg": {
    "date": "10/25/2018",
    "text": "Awful service, really awful service, did I say afwul service. If that was in America they would even exist.Thanks god my amazing friend was with me.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UO-gG6-kn6VBgvMc-piNBA"
  },
  "sKozuBaKKV_pLPn0xb9nkQ": {
    "date": "7/21/2018",
    "text": "I've only ever known Thai Metro to be overflowing at lunch hours due to its popularity among workers. I went at around 2pm on a Friday and within twenty minutes had the restaurant to myself which was pleasant. I ordered the following:- Drunken noodles with beefYou get a generous portion and a slice of lime which adds a nice kick. It was a bit too sweet for me however and could do with a bit more spice (although admittedly I didn't request extra chilli, which is something that can be done). The beef was the biggest disappointment, being far too chewy without the flavour to back it up. I don't mind having to chew as long as the taste is retained throughout. The problem with the beef here as with a lot of beef in general is that the flavour soon dissipates resulting in no reward for the chew.I think I could better spend the money elsewhere but if you're in the area, it's worth checking out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hgcj-AzwcpUmceoCP9nuRA"
  },
  "94pSNC-Lim0Uv--LNbHzWg": {
    "date": "12/23/2016",
    "text": "Great lunch options!Food: They have a very nice lunch special menu with appetizers, main dish and dessert for a reasonable price. I love their fish cake appetizer! The desserts were amazing as well, even though they took a very long time to make them (over 20 mins after we're done with our food).Service: Like what? We finished our main dishes and waited a long time for our dessert. We didn't really mind it because we were having a good conversation. However, the guy just came to clean our table and put two new menus in our face with an attitude. We were really confused but he didn't give us a chance to ask any questions and left. Five minutes later, we got attention from another staff to say that we were waiting for our desserts. She was like \"oh, ok\" then took the menus away, not apologizing for the mistake or acknowledging our wait. Well, oh, ok.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WDWgY7RrFXmkS7gdzR_o9Q",
        "caption": "Photo of Thai Metro - London, United Kingdom. Pad Thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WDWgY7RrFXmkS7gdzR_o9Q/o.jpg"
      },
      {
        "img_id": "tIQet_3rYiFoWGkQJ5X15g",
        "caption": "Photo of Thai Metro - London, United Kingdom. Appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tIQet_3rYiFoWGkQJ5X15g/o.jpg"
      },
      {
        "img_id": "lTqokdTo3SyzYJ_1yecJ2A",
        "caption": "Photo of Thai Metro - London, United Kingdom. Pandan dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lTqokdTo3SyzYJ_1yecJ2A/o.jpg"
      }
    ],
    "user_id": "-dUYEbvjMGCtX_c0rVUjFw"
  },
  "8xnfGETHfp-c-tXm22kqXA": {
    "date": "6/28/2017",
    "text": "A decent thai restaurant where the servers were also very welcoming. Had the pad see ew with pork and although the noodles were thinner than other pad see ee I've had at other restaurants, still was an enjoyable meal.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jmAvbN-jAuFDJNhyX0qxQ"
  },
  "ou0dlmyUfB2XosvrDqaW0g": {
    "date": "3/12/2015",
    "text": "The food here wasn't bad, but wasn't outstanding either.However they do offer free home delivery and thats what gives them the extra half star. I would rate them 3.5. Delivery was quite prompt and my order was accurately delivered.I enjoyed the corn cakes and drunken pork rice. The chicken with cashewnuts had some pineapple in it which I wasn't expecting. The red curry was good, but didn't come with rice (I'm so used to rice being included with thai curries at restaurants back home)The pork with drunken bamboo shoots wasn't as exciting as I had hoped and used very thinly sliced lean cuts of pork which made it taste more like chicken.They don't deliver desserts home (probably because they all include ice cream?)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UalU2MTLxhupGAOHS0CQsg",
        "caption": "Photo of Thai Metro - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UalU2MTLxhupGAOHS0CQsg/o.jpg"
      },
      {
        "img_id": "JVlxSgYBibD1HcemeZQViw",
        "caption": "Photo of Thai Metro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JVlxSgYBibD1HcemeZQViw/o.jpg"
      },
      {
        "img_id": "5gxten7ose-Rl1VQ4tmzBw",
        "caption": "Photo of Thai Metro - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5gxten7ose-Rl1VQ4tmzBw/o.jpg"
      }
    ],
    "user_id": "kKM1IGrc4nCuvfv968NigA"
  },
  "G9VAVSnsOxlXPB1-9r8kYQ": {
    "date": "6/1/2015",
    "text": "Probably the worst Thai experience I've ever had in my life. THIS IS NOT THAI FOOD. I REPEAT, THIS IS NOT THAI FOOD, I HAVE NO IDEA WHAT TO CALL THIS. My company was having a group order from this restaurant, and I ordered a pad see ew with dumplings. First of all, the dumplings are actually called shiu mai so I was pleasantly surprised to see that it was pot stickers or gyoza. But WTHECK, I've never seen a Thai restaurant have that on the menu. Nevertheless, the shiu mai was the least of their worries. The pad see ew was soooo dry, the beef was chewy, there was weird veggies in it like bell peppers and onions. Traditional pad see ew should have egg and broccoli. Don't call it a pad see ew if that's not what you're going for. Again, i'll let that go if the food was decent. But it's not. The noodles were dry and tough and the bee seemed old. I would never in my life come back to this place.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RqDI5GAivS-oB3IyW73YGA"
  },
  "Tv16mN9nS8UZHPs16zfa8Q": {
    "date": "5/1/2017",
    "text": "The food here was great and the service was delightful even though they were busy. I ordered the coffee dome for desert and it was fantastic. Andrew in particular was wonderful. I will definitely be back :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQ09MpTVy3j1E1x2P-E1aw"
  },
  "RaoImDEHqZyUaXJX7QIMMw": {
    "date": "10/24/2015",
    "text": "We headed to Siam Central for lunch but it was packed so we went to Thai Metro instead. I had the aubergine and chillies with tofu from the lunch menu. It was very tasty, however it wasn't Thai enough for me. My colleagues got the green curry with chicken and the yellow curry with chicken and they liked their meals. I hope the meals on their regular menu taste more Thai, I am willing to give it another try soon. The restaurant was busy but service was good and speedy and the ambiance was nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8OcoIOzG8vZKuAsImeFqrQ",
        "caption": "Photo of Thai Metro - London, United Kingdom. Aubergine and chillies w tofu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8OcoIOzG8vZKuAsImeFqrQ/o.jpg"
      }
    ],
    "user_id": "apRZVmnNotuS5PCtdZE6ww"
  },
  "8XGwAsvLFraRsvnL7lXwRw": {
    "date": "2/17/2016",
    "text": "So my housemate and I travelled to Thailand two years ago and ever since have been trying to reclaim the smells and sensations of eating this cuisine on a beach in thirty degree temperatures, back home in London - this my friends, is not possible.However, the taste and freshness of the ingredients from Thai Metro were some of the best we've had since being back. The Panang curry was plentiful in beef, the flavours were spot on and the portion size was wonderful for two, paired with the coconut rice (if you're feeling extra naughty, this stuff could be dessert on its own, it's so delicious with some sesame seeds through it for extra yum!) We had the pad thai, which seemed to taste different in every place we visited in Thailand anyway, but this had its crushed nuts to the side and a wedge of fresh lime to squeeze over, loads of beansprouts, plenty of moist and delicate chicken and not too oily - we were, well, impressed! Because we were hungover from our Galentine's Day we decided no food could be enough, so ordered the bamboo, chilli and thai basil stir fry with prawns as well! Don't judge us. We split the one portion of rice with this and the curry, there were six perfectly cooked king prawns swimming in a spicy, delicate (not oily) sauce, with bamboo shoots, peppers and onions, really another lovely mix of flavours - we chose well even if I say so myself! To top it all off, 'cause we love a nibble, we had their thai prawn crackers and sweet chilli dip - well, I don't think I need to convince anyone that these are always a good idea! Fast delivery, hot, fresh food and wonderful flavours that bring you back to Thailand even when your thailand pants and you are sitting on your sofa!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jQuvh6FiI_2BbBDxiEVIpw"
  },
  "ttlvcnsgvwNwq86JOZwI8A": {
    "date": "11/25/2015",
    "text": "I ordered a pad Thai which tasted as if it were made with American BBQ sauce.The food came out in around 3 minutes which meant after eating half of it, I was back on the street in 11 minutes. The chicken was precooked and a bit dry.I appreciated the loads of green onions, and peanuts, and while the taste wasn't altogether bad, it was certainly not a normal pad thai.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "lFWwfgTaBR8vubPdA7NJ9A": {
    "date": "11/27/2016",
    "text": "Had their Pad See Ew and it was fantastic. The best version of that dish I've ever had with a perfect sauce and a variety of vegetables. The tofu was also cooked to just the right consistency and was full of flavor. We were seated quickly and the staff was very attentive! Can't wait to go back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ndKz9_BcWrJ54aZhcHhFxQ"
  },
  "m8PBst7PNV9w9owXMGBu1A": {
    "date": "11/2/2015",
    "text": "Truly awful food. Very disappointing given the generally positive reviews. Chicken Sate was cold, chicken stir fry had an overpowering petrol-like taste. Dumplings were heavy and also lukewarm. The only good dish was the papaya salad. Wouldn't go back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OJokAmxhQGclzV0gCx2bww"
  },
  "9WIyBar4BSo8XNbdT1f_5Q": {
    "date": "2/24/2017",
    "text": "Great lunch spot, pad Thai was delicious. Also reasonably priced and conveniently located",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ySDN2ueVB_cF9VO8yXaZg"
  },
  "dknmtzAtFYJ4iFF3jEFc6Q": {
    "date": "5/3/2015",
    "text": "I often visit this place for lunch with my colleagues. Fair price, enough portion, attentive staff. Thai Metro is a good option for lunch at Charlotte street.The only shame is the taste of the food - they used to serve very tasty thai cuisine and I'd give them five-star, but I noticed they've changed something recently; now the noodle (pad thai, pad mee) is somewhat sticky and doesn't taste really good...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhzmG5KbQRjLJUfbLDyf_w"
  },
  "_NbT1iJIdmCo66uF7qlQvg": {
    "date": "7/11/2012",
    "text": "Came here with my big boss daddy aka my actual boss at my job. We both live in LA but were here separately on separate business trips, staying in separate hotels, flying on separate flights. Thai Metro brought us together. The power of a meal. It's a positive thing.In actuality, we were planning on going to the sushi spot across the street - his recommendation - but there was a 45 minute wait, so we looked out the door and said, hmm, how about Thai? And there you have it.Prices were low - the true barometer of a good Thai restaurant, in my opinion - if they are high, run away! It will not be any good! I ordered the yellow curry (chicken) with white rice. No brown rice in the house, they said. Boo to that. Chicken Satay and Green Papaya Salad for appetizers. Boss man got some noodle dish that I guess I didn't pay attention to.Small restaurant, kind of loud, but good food, served quickly, in a cool area. I'd go back for sure. Thai Metro. What have you done for me lately? Made me dinner? Oh, cool. That's cool. Thanks for that!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ZhcB8kduDlsC3j70GYAOg"
  },
  "WeRlokw_wNunKkj820I9YQ": {
    "date": "10/16/2015",
    "text": "3.5 stars. Not bad, but some dishes are slightly tasteless. I personally think that Siam central (which has a similar menu) next door tastes better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w8-EnrU5E_F_MddvlzY_uw"
  },
  "HYIfbJa7apdXOqmIpMurRA": {
    "date": "9/15/2015",
    "text": "Not sure how this place got 4 stars.  For the lunch menu, you get your choice of 1, 2, or 3 courses for something like GBP 6.5 / GBP 8.5 / GBP 10.50I thought, I think 2 courses would be nice.  I ordered the steam dumplings and the cashew nut stir fry.Steam dumplings (3 in the order) - HORRENDOUS.  AVOID this dried out, nasty, from frozen state, whatever it is.  You can do better from a grocery store.  You can literally see the nastiness when it comes out.  It doesn't taste any better.Cashew Nut Stir Fry - portion size: average; taste: average (super salty)",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mrePr6XPB---_bdQfjQddQ"
  },
  "CU9KDQVoQZWsU3_e1KJeGw": {
    "date": "8/24/2014",
    "text": "This place was recommended to us by our London host (airbnb). He works as a lifestyle blogger on the side, so we took his word for it when he said this place was a great place for great food and great prices. We ended up going there twice during our four night stay in London.ME: Pad Thai with shrimp and broccoliPersonally, I had a bad impression of the cleanliness of the broccoli the first time I tried it, so the second time I just went with Shrimp Pad Thai, which tasted just as good as my hometown Thai food restaurant. HIM: Chicken Curry with steamed rice and SatayFor a man who loves his chicken curry, this was reported as a top competitor to our hometown Thai food restaurant.The look of the place is very Oriental Chique. Outdoor, Indoor and seating downstairs is available. The staff are very friendly, helpful, and accepting of late crashers such as ourselves.Overall great experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EUMmL3x0MuLaVHYR-hUCKA"
  },
  "Mi7eoy4zIJGjkHxc3xP_ww": {
    "date": "3/15/2014",
    "text": "Everything is good here! Two friends and I went here for dinner and we each had different meal. I had chicken pad Thai and my bud tastes agree with me that it was delicious. I also tried my friend's dragon noodle and dragon rice that were also tasty. If you fancy more spice, just ask for chili oil and they will provide it for you. As for desserts, we had the pandan sticky rice with coconut ice cream and coconut pancake with vanilla ice cream. They are oh so heavenly!! Though it doesn't taste the same with what you can have in Thailand but they make it so special for you so you won't forget it easily. Ice creams are homemade and I would recommend the coconut one. Everything tasted so wonderfully and I will definitely go for a second, third or more trip to this food heaven.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OQihILCrB3BjxPr6lQUfSA",
        "caption": "Photo of Thai Metro - London, United Kingdom. Classic pad thai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OQihILCrB3BjxPr6lQUfSA/o.jpg"
      }
    ],
    "user_id": "cU3XCh3O5lJwZv-nC-AOHQ"
  }
}