{
  "dTCcR1Db4EHRn_jR6U_DMw": {
    "date": "2/18/2009",
    "text": "It sells very nice beer (Sierra Nevada on tap, plus London Pride from the cask). This is a good thing. It also sells a wide variety of cider, if you like the stuff, which (after a nasty experience when I was younger) I don't. Being in a fairly quiet area, there's plenty of space in the summer to move out on the street and enjoy yourself. This is good too; and it's a nice place to sit out and people watch. There's a certain character to the place, with amusing and enjoyable comments pasted on the wall and on the bar. However, the bar staff are glacially slow to serve - generally, at busy times, there's only one person on, with someone else faffing about polishing glasses. The service is less than appalling. And if you order a pie for lunch (as I did once), don't be surprised if it takes 45 minutes to appear - even when there are only seven people in the pub. The music appears to be a Nathan Barleyesque character on the decks during the evening. The music's anything but Well Jackson, and frankly just serves to annoy. And sadly, the clientele (mostly BBC and meeja-types) are the kinds of people that you really want to punch. Loud, unpleasant, annoying. Except when my team's in, in which case we're lovely. So the plan is: yes, go there. But give the money to someone else, and make them waste hours of their lives queueing at the bar; and try to avoid most of the clientele and their meeja ways.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kUQlpc0l2kQU8TYEdIv4ew": {
    "date": "11/18/2008",
    "text": "Oh what a hidden GEM, in the midst of the West End, a small but lively pub just by Oxford Circus. We accidentally came across this place after a long day at work and have been addicted since. Great Cider bar, varying from strong 8.4% to the usual apple and pear ciders which are great.. I would suggest going early as it can get quite packed.. lots of BBC employees - great drinks at great prices!!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "G1xDRW8GzomogNsG09-zUw": {
    "date": "4/14/2010",
    "text": "Nice little pub in Fitzrovia. If you have the urge to get on the cider and are in town, then this is the place to go. Amazing selection of ciders, and fun atmosphere.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZpECOURi4IKBZKJAfnbmaA": {
    "date": "6/5/2011",
    "text": "had a lovely few ciders here midday on a saturday, very quiet compared to the other rammed local pubs which made it all the more enjoyable. we got one of the two tables outside which was lovely in the sun and overall we enjoyed time here. the staff were great and the location perfect, just a 5 minute walk from oxford street. definately one to enjoy the ciders at",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zEL5KpqcEdsPvQbZFhJCUg": {
    "date": "12/9/2010",
    "text": "The Green Man where pressed alcoholic apples are king. Having made this the venue for the Sexy Media Christmas party 2009/2010, this is a sweet place to both eat and drink. There is a plethora of ciders on the menu including the dangerous Old Rosie which will lure you in like a pirate hooker and then violate you when you have more than a coupple of pints. At 8.5% please drink responsibly. If that doesn't tickle your fancy there are another 15+ ciders available including the more mainstream ones such as Kopperberg and Bulmers for the less adventurous. They also inform me that they do have a beer on tap... I didn't listen to what it was. At Christmas make this a priority because thier mulled/spiced cider is UN-REAL. At 4 nuggets for a half pint it's a little spenny, but totally worth it. The pub itself is awesome with great artwork and posters throughout. There's also a solid food menu. The fish finger sandwich could rival that of the Sluaghtered Lamb in Clerkenwell. That will set you back about 6 nuggets. One of my favouritest pubs in London town. It should be yours too. Sexy Rob",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "9idqYuy59hz49LS9yEPIqw"
  },
  "KrFwlAcS2W4N6hGvsqBldQ": {
    "date": "1/5/2011",
    "text": "I love cider, it is one of my favorite alcoholic beverages thanks to the time I spent living in London.  So when I returned on vacation and my friend mentioned that she had stumbled upon a bar dedicated to cider, I couldn't hide my excitement.  A friend and I set out one night to enjoy a few pints but being directionally challenged, we were lost for quite some time before finding the bar.I'm so glad we didn't turn around.  I walked up to the bar expecting to see the typical cider options, but was excited to note all of the brands I'd never seen before.  I decided to try the Green Man's personal brew which was a 7.5% selection.  My friend and I ventured to the second floor which we had to ourselves.  I have to say, although a completely random gathering of couches and tables, it was quaint.For some reason I didn't realize that 7.5% meant seriously alcoholic, but that pint really put me under.  Sadly I didn't have it in me to try any of the other options, but I definitely suggest the pub for anyone who enjoys a delicious cider.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "wlPR1M-p7w0YtZwh5Ii-_g"
  },
  "prb4ToCBmlNXTsK9RDM7zQ": {
    "date": "6/7/2014",
    "text": "Ok-but same menu as many other pubs in London such as the Angel in Highgate etc (must be part of a chain). Food is fine, staff were a bit sullen. Not bad for a drink but there are better places to eat nearby.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdgLQpjCpM5nX1Vrg0OCdQ"
  },
  "0eQtZdMdJHAsigK7C-i10Q": {
    "date": "3/19/2012",
    "text": "Decent bar, but odd mix of people. You have the old men watching Irish rugby, along with passerbys of all ages, and then the young people staying in the hostel upstairs. It's a bit peculiar since none of the different groups interact much. There aren't many good bars in the area, so this one gets a lot of traffic because of that. If you're staying at the hostel, this is a great bar, but i wouldn't go much out of my way to find it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_UOKTpjN8GI-o5z840xyuQ"
  },
  "L3ltqC8qkQYDwb2OcyrS3g": {
    "date": "5/19/2013",
    "text": "Very very busy place after work but thankfully we had booked a table. If you like ciders you'll definitely like this place as there's at least a half a dozen on tap! They have their own Green Man Special cider which is over 8% and is really nice but definitely lethal! Decent music too without being too loud, and the food, while kind of expensive for pub fare, was really nice. The pub isn't anywhere really near my place of work but if I'm ever in the area and in need of a drink I'll definitely pop in here again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "afzXJugWWl8HmkYcStYLgQ": {
    "date": "6/15/2011",
    "text": "I don't normally drink in Central but since my friend started working here it's become one of my new regular places to go and, maybe I'm slightly biased but, I love it! The 'special brew' cider is absolutely amazing and two pints only comes to about £7 which means an evening of drinking is never too expensive.I haven't yet been when it's been too crowded and they have a DJ so the music is always fairly good as well. If you are in the area, I definitely recommend you head down to try a pint of their special brew as they are famous for it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FSTZWKFTKz9n4tDh2SAIlg": {
    "date": "12/15/2012",
    "text": "The only reason I go here is because its right next to my work. Its not the best, cheapish and can be cheerful after everyones had a few. Nothing to write home to mum about.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mCpA5YvXLSH4E48stjM9nA"
  },
  "ISMn1wbbJQoSTp2nK9dF7g": {
    "date": "3/1/2010",
    "text": "Lets be honest, getting drunk is great!! Getting drunk in a nice place even better. Getting drunk on cider in a nice place pretty much ticks all the boxes on my alcohol over indulgence wish list. Which is why I enjoyed the green man so much (at least i think thats where i was!!)As you walk in and admire the kooky surroundings and bob your head rhythimically to the funky party tunes massaging your ears at just the right volume you might be mistaken for thinking you have wandered into an establishment in Hoxton. You then realise that people are smiling and having fun rather than trying to look cool -which in my book is pretty cool.Next up you approach the bar and see a ridiculous array of ciders at your disposal  and you realise you have entered pub heaven. Being a fan of WWF wrestling i drank pints of Hogans which has a distinct earthy farmy taste and exactly what i imagine the hulk himself would sup, however there are about a million others so take your pick.This is yet another of \"Noho's\" hidden gems.NB: you know a place is good when you request REO Speedwagon and a 20 something uber cool dj looks at you like a proud father and simply says YESSSSSSSS!!.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "K_jiYINJs9xIy4SCAuJOqg"
  },
  "Y4rlrZSOmelgrVTwe2dxLA": {
    "date": "3/2/2010",
    "text": "Ah cider, the juice of champions! Unless it's that fake cider that doesn't taste of anything and gets popular in the summer.The green man however has a fantastic selection including my favourite Stowford's press.The thing with Stowford's is that you can only have a few then it's time to move on. It's not that strong at 4.5% but it does have the knack of turning the drinker into a massive jerk! That said, if you follow the guidelines you'll be fine and your friendships will remain intact!The only things i didn't like about this place were the refusal to serve Jager bombs because \"they're chavvy\". Lest ye forget young barman that Jager was invented and marketed metal heads and rock n roll types... they also taste better than tequila!At about half 10 the pub shut... not called last orders, just shut. I could understand if it was dead but the place was heaving, there was a girl at the bar wearing a banana on her head and the DJ was playing 80's power rock!Why would anyone want to stop that?The venue is also home to some very good live comedy and a tasty looking menu board... more investigation is required methinks!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RN2GUySYObl5_ytPbxIz3A"
  },
  "_iJCT5E4iN_lhO5wj0mh0w": {
    "date": "9/3/2010",
    "text": "Great range of ciders - which is very much what The Green Man is all about. They also serve a reasonable range of real ales on tap, in addition to various rare or less well-known beers. The Green Man does get VERY crowded on Thursday and Friday evenings and the loos can be shocking at busy times. Service is scatty but never rude. There's is a room for hire upstairs which is kinda classy in it's own way. Overall - I like.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVMLxovuKxzxHfYr7ul7Ug"
  },
  "FCzXOhg5bAKxc-QEC2OMsA": {
    "date": "4/4/2013",
    "text": "Really cool place to try best organic cider, gastro food really yummy! Find the place and have fun! Friendly staff and affordable prices... :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCpaBSxiclV2ZvMIGFfTCQ"
  },
  "c0Dy5oMIrKsbltXIPBRoAg": {
    "date": "9/8/2009",
    "text": "Once you've mastered the maze of streets in central London to find this pub once you will keep going back - especially if you're a fan of the alcoholic apple stuff.A relatively small but effortlessly cool pub, nestled on a back road behind Oxford Street.It serves the most amazing selection of cider, the kind that would make a West Country boozer cover it's alcohol menu in shame. Herefordshire-based cider makers Weston even make a signature cider for this pub, Green Man cider. Well worth a sup.Weekends are relatively quiet though they do host indie DJs playing a great mix of non-chart music. A great place to start the night, though drink too much cider and you may have no choice but to end it there too!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhkMfpguYez4DFazWsCMRg"
  },
  "0-beUnJtUgT4bT1JnI3Blw": {
    "date": "1/18/2010",
    "text": "This pub styles itself as a cider pub..certainly the only one I have come across in London. They also serve real ale, so anyone will be able to find something to drink here. I did find some negatives though. There were 12 ciders advertised but only actually 3 on offer during my visit, so even though the cider quality and choice is better than almost anywhere else, you may be slightly disappointed when they don't have your selection. The throughfare to the side of the bar leading to the back, upstairs and the toilets is liable to get blocked if a group takes the tables therewhich can be a pain. The upstairs room is good though, very dark and atmospheric. You can book it for a small function/meeting.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "KyRPoFoGlCCcM55ingzL9g": {
    "date": "2/24/2010",
    "text": "The best range of cider I've seen in London, with delicious burgers on offer. There were 13 ciders on offer when I was there (most draught), of which I tried 3, and they were all delicious. Definitely try their own Green Man Cider - it was lovely (and about 7%, so watch out). The pub has a very atmospheric feel to it - all kinds of people in there - I really liked it and will be back.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uzNOOQSp0m0-9_rWmAJVyQ": {
    "date": "7/29/2011",
    "text": "I popped in here after work last night and the place was heaving, but what can you expect on a sunny thursday evening in central london. Reasonably priced drinks and an excellent choice of cider!.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "U6XGbQ1kJN_MtUQqVOxyzw": {
    "date": "5/10/2009",
    "text": "This place is OK but is often crowded. There is an upstairs area but it is always booked so there is no where to get away from the press of people. In the spring and summer there is the chance to sit or more likely stand outside. This place is best known for its cider selection though and it is why it is always busy.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KgPel8fxlwRhKrHgiFcOvg": {
    "date": "7/6/2011",
    "text": "I used to work in Charlotte Street and thought there was a shortage of decent pubs in Fitzrovia. I have been walking past a few decent looking ones further west towards great titchfield st recently and starting to wonder if I was wrong. Then I met a couple of friends for lunch in the Green Man today and thought it the nicest pub I had been to for a while - loads of ales and ciders on tap, decent unpretentious food and a lovely ambiance. Will be back with my drinking shoes on...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DK8eDy4xfp0FnwWMFwCQSA"
  },
  "nHsfcDaw96IFWdiXu_9X5g": {
    "date": "2/21/2008",
    "text": "This particular Green Man Pub used to be really drab and dreary outfit but it has undergone considerable refurbishment, relaunched and is all the better for it.Its main point of interest is now -its devotion to cider - there are eight types of cider listed on their board above the bar, excluding another five bottled options.Chimes is considered to be London's top spot for cider addicts but I think the way this pub is coming up it may well take over the number one spot. Being in the London University are I think we can safely assume that it will be frequented by a younger and more contemporary crowd. The entertainment side is far more extensive because there are broader CD choices and free music papers which are usually seen in the East End bars rather than the West End.With fairly solid pub grub to soak up the (over) 7% strength of the ciders on offer, AT LEAST T6HE Green Man is a pub trying to do something different and - so far at least - succeeding.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "h0mlsh4Qtdfe5QagsCcyYg",
        "caption": "Photo of The Green Man - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h0mlsh4Qtdfe5QagsCcyYg/o.jpg"
      }
    ],
    "user_id": null
  },
  "qsouyvawm9Xy4Zhaafh0_g": {
    "date": "9/28/2008",
    "text": "Yeah it's pretty cool here. Came for a few beers after work on Friday and it was PACKED! Really really full. But there's a reason for that, it's got a fun friendly vibe that was spilling out onto the streets by the time we got there. They have some great ciders, and a dj which is a strange mix - very old man pub but with a modern edge I guess. Staff are flakey though. We ordered a round and then five minutes later our barman was serving someone else! He'd totally forgotten about us! Strange! But it's packed in here so they have a lot of orders to get through. Not overly pricey though. The pubs in this area are very hit and miss. This one is a hit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3uqy9nj-Fa9870dSm4-_sA": {
    "date": "10/2/2009",
    "text": "The Green Man is first and foremost, a cider pub, which, being a fan of the alchoholic apply stuff, is a massive relief from the usual experience I get in most establishments, when I'm faced with the choice of drinking either Strongbow or Bulmers all night. The rather bijou little bar proudly sports a choice of nine ciders on draught, fifteen bottled, and four in flagons, including the eponymously famous Green Man Special, which has to be drunk with care, as too many can lead to a sudden sensation that someone's turned up the gravity all of a sudden, and make the next morning something you really don't fancy being part of. However, there are plenty of choices, and a fine evening can be had exploring the menu, from the old country flat ciders through to their more modern fizzy counterparts. The staff are accommodating when it's quiet, but can turn surly when the place fills up and they find themselves busy, perhaps the one thing that keeps me from giving it the full five stars. There's also a rather nice room upstairs that can be booked for large groups and parties, and there's frequently DJ nights and music being played, albeit sometimes on the painfully trendy side.All in all, the Green Man is a pretty good pub to visit with friends, and it's somewhat out-of-the way location means it's nicely away from the main drag of Oxford and Regent Streets and TCR, while still being close enough for that bus home at the end of the night.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aC5U3cTkd65MY51i3EreJg"
  },
  "iIhDGydwvSK4ycHYOqoDFA": {
    "date": "7/26/2018",
    "text": "Cool spot! Was walking to a show after shopping on Oxford and stopped here for a break and some beer. Super popular, was very busy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IucvvxdQXXhjQ4z6Or6Nrw"
  },
  "mIkmZsQjP13MDWHUlgkwzQ": {
    "date": "10/1/2015",
    "text": "Excellent variety of ciders! Classic English pub vibes and very reasonable prices. Quick service. We only stopping by briefly but I did have the sweet potato fries... worth visiting just for a bowl of them bad boys (definately more-ish). Nice pub slightly away tucked away from the busier streets nearby.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NHYXH2o3WecQuMa7W-7qVw",
        "caption": "Photo of The Green Man - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NHYXH2o3WecQuMa7W-7qVw/o.jpg"
      }
    ],
    "user_id": "08UgHp1a_xIibCFYZjvblA"
  },
  "ar5I_3a1UCUeZ8qhLZ1k1g": {
    "date": "6/11/2016",
    "text": "The Green Man is tucked down a less populated street not far from Oxford Street and Charlotte Street which means that it can be slightly less crowded than some of its neighbours. Headed here for a late lunch and by 2pm, the lunchtime crowd had dispersed and my friend and I caught up over fantastic burgers.A great selection of drinks (Sierra Nevada on draft!) and a wide variety on the menu mean that this is a go to pub for me if looking for somewhere central to have a couple of drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GO-8Z06MWR5RFJ67cY-Jhw"
  },
  "hNbzdQBepNCaSje7YvD9QQ": {
    "date": "5/9/2016",
    "text": "Great place! We only came in for cold ciders on a warm day and this place did not disappoint. Great ciders, friendly staff, nice location away from crazy Oxford street.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5P3asDGDKc-rFPZSjTt5Eg"
  },
  "IfQhks4T4C8uFXkDoBksrw": {
    "date": "11/22/2016",
    "text": "Anyway, to the Burgers. There are quite a few on their list and I chickened out of the Bastard Burger as it was only lunch time and I had already had a few snacks beforehand. The Bastard Burger is two patties and so I went for the BLT - Bacon, Lettuce and Tomato for those that didn't know. The burger came with a side of Hand-Cut fries and as you can see from the pic (ignore the blob of mayo on the side) - DAS IST SER GUT!The size of the burger was manageable, just too many chips. First, second and third bites went in quickly. I was hungry and lunch time is limited. What came through straight away was the crisp of the bacon with the crunch of the lettuce. Haven't had lettuce in a burger like that since, well the whopper but you know what I mean. A lot of these new burger places don't come with lettuce. The patty itself was very juicy and the bun complimented and supported the juices. Not too dry and not ruined either, the bun held all contents in and I wasn't making a mess of my £xxx shirt. The cheese was American and that too was very nice. Not overcomplicated or extra fancy to take away or confuse the taste buds.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kygcj402c1SAop8T3Y-LZg"
  },
  "fVaaXwzFJRVOC5pr5jje-A": {
    "date": "8/31/2015",
    "text": "Meh not so good, pint of pedigree on the turn, poor salad and ok steak. No where near worthy of the other ratings imho",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8-NMaR_3_5GTvmaBchgww"
  },
  "pxN4G7rg38V1SnJaVzbPvQ": {
    "date": "4/22/2016",
    "text": "We went here for some catch up drinks on a Thursday night, which was a bad idea because it was rammed, really busy and loud. Good for crowds though, there was a good atmosphere, vibe, decor etc. They have burger offers on weds and Thursday so we had a decent meal for £7 each-bargain! Would return but it would depend on the occasion. Probably better for cider drinkers than me.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j8h5Wy6DMkdriHjmMn2c5A"
  },
  "xro7XLFa7pixgbW66z0cYA": {
    "date": "7/3/2015",
    "text": "The Green Man is a nice alternative to all the extra pricey locations in central London!Really close to Oxford Street, this nice pub has an amazing selection of ciders, cocktails (check their deals, mindblowing!) And different types of food.Service is good, location and prices are excelent but holy moly, the lovely scent that invades tje restrooms is quite unpleasing. It couldnt be perfect! Still, the place I will go for those after work drinks :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZUvkFL6QFxZFvwznLEF4Q"
  },
  "MHOvsX8t7NQcsrgUkpndaA": {
    "date": "7/13/2016",
    "text": "No tabs, have to pay for each round of beers at a time.  After a long day, it;s very annoying. Plus they didn't treat Americans nicely.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Zy04tz8tIs3Lhb5pl0HYw"
  },
  "iucKCwitxe7uLkjx-5pw9g": {
    "date": "3/9/2015",
    "text": "A bit quiet during the day on Saturday, it's a nice place to retreat from the hustle and bustle of Oxford Street. If you like ciders, this is the place for you. Try The Green Man, which is their signature cider! They also have a varied offering of wines and beers so everyone will be happy. We popped in for a Sunday roast which was pretty good and ok value considering you're in Central London. The staff was nice and the atmosphere was very calm. A great place for a mid afternoon catchup over a few drinks. I haven't been there on a weeknight or even a weekend night so not sure if the vibe changes then.Worth a stop if you are in the area and looking for a nice pub to have a drink in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "255UWFKMll3xfOtUj1E_ZQ"
  },
  "Yh-Wni6gDz9BC8RlbPUxMA": {
    "date": "4/2/2016",
    "text": "Whenever I visit London, I make this a required stop.  Outstanding ciders in a comfortable location tucked far enough away from Oxford St to avoid the rabble but close enough to catch a taxi easily.  Food is hearty and tasty.   Service a bit on the turtle, but my experiences have been polite and welcoming.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cp5vQoxQRmkUeQ4S_JE-ig"
  },
  "0WjRaFJ8OXH9R--vrMRdcw": {
    "date": "4/11/2014",
    "text": "Cider-central! The Green Man is a castle pub with a distinctly appley flavour. And I love it. Staff are usually smiley... and really, what more can you expect?Love cider, love The Green Man.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ODgGJVfwamUhWLKDmdPL4Q"
  },
  "wG-We2_LH-u0t76FqxelNw": {
    "date": "11/22/2013",
    "text": "Rarely do I find the opportunity to wield the hammer of Yelp for social good. But after last night, I feel compelled--nay, inspired--to do so. The Green Man looks pleasant from the outside. It even looks quite pleasant on the inside. Interact with the xenophobic, vindictive staff, though, and this veneer of hospitality begins to fall apart. Last night, I wandered into The Green Man with a few friends. The first approached the bar and ordered the house cider (which looks a lot like urine, by the way...). I followed suit and was asked for an ID. This is not unusual: as a youthful-looking 21-year-old, I have probably been ID'd in a third of the London establishments I've entered over the past two months. I handed the homely bartender my US driver's license, which she scrutinized for about thirty seconds before handing it back to me. Apparently it was 'very likely fake' and she had no ability to determine its authenticity. I handed over two other IDs showing the same birthday to no effect. She deemed it more plausible that I had faked multiple forms of ID than that I wasn't 18. Funny, because another friend had just received a beer with their own license from the same state as mine. A double standard, eh? I noted this to the bartender, who shrugged. Two other friends went back for a second drink, were ID'd this time, and were denied service by the same bartender who had given them their first beverage. If it smells fishy, it's because it was, indeed, fishy. As a law-abiding, jolly American citizen, it hurt to be denied service at a local pub. Apparently I was just not good enough. Undeterred, we politely stated our intention to leave and moved on to another pub a block away--The Yorkshire Grey--and had a fantastic end to a very demeaning night. If you care about common human decency and yearn for a day when all patrons will be treated equally, regardless of appearance or nationality, avoid this lackluster pub in favor of one of the other friendly outposts in the area. You'll be glad you did.",
    "rating": 1.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "2c3NDeXm-Z922wuWVmWcZA"
  },
  "ykN0kls70ScK_ZfdU8K3Ag": {
    "date": "6/29/2014",
    "text": "Very nice pub with an array of ciders.  Definitely will return for a longer stay!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "S-wrhjkKwYrdlnJHycok5A": {
    "date": "12/18/2014",
    "text": "Mother of ciders! As most of the review mention, the pub offers a great variety of ciders and all sorts of finger food and delicious burgers. There's this special dish (at least for me it holds a pretty dear memory) - sausages, beer mustard mash and red wine gravy.  It is so delicious, my taste buts are now begging me to go there and order some. I really love the decor - simple, yet forming a nice and calming eating spot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hrYQQEO2M-mrzU_QTEqq4Q"
  },
  "ASbYfRPLbr3KHcZ8cCROAw": {
    "date": "4/14/2011",
    "text": "Went here for the first time the other night during the hot spell. By comparison to another pub just a few houses down the road, the Green Man seemed not too crowded. We got there fairly early and managed to secure a lovely table in the corner. The place did fill up, though ...It seemed like a crime not to try one of their ciders, but two of us are fans of rose wine when the sun comes out - I think they even had a choice. Two of the guys had a selection of ciders and were in their element.It's nice to discover a \"new\" pub so close to Soho and I will definitely come again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "ZIlalDgkE7y_Dea6UXktyw": {
    "date": "12/5/2011",
    "text": "The 7.4% special cider is lethal. But tastes just like apple juice. I decided that sinking 3 pints of the stuff on an empty stomach before a work xmas party was wise. It was not.Popular place this. Don't tell anymore people about it, ok?",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "55vJ0_2sysYUjjYBIHg5xA": {
    "date": "8/1/2014",
    "text": "If you like cider you'll love this place, best cider house around (probably only one). Place has comfy seating with outside seating/standing area. Reasonable prices with a great selection of ciders",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQ_0QVxhbhbfHZj3qFO6Lw"
  },
  "ONqW9x4L14W2h9oq04Xr7A": {
    "date": "1/17/2013",
    "text": "Nice central London pub - and you have to love anywhere that puts cucumber in a Hendricks and tonic as standard.  Good if you're looking for a decent pub rather than a bar - has some good food and friendly bar staff.Also - worth looking out for quirky and interesting comedy in the upstairs room.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "caxEEi1xoSNOW1lvfx1a8Q"
  },
  "jh-0xzn9-jliTNwpRbjv2Q": {
    "date": "3/14/2010",
    "text": "I've always loved a cider, so finding a pub dedicated to it excited me no end!! There are sooo many ciders on offer you may have to make a day of it to try and get through them all. The even have their own house cider - at 7.3% you may need to pace yourself! The decor in this place is random and quirky, expect to see lego men and apples and teddy bears hanging from the place - really anything goes! Worth a visit for all cider fans",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "2I01BphxVcwDw7Uze2LaHw",
        "caption": "Photo of The Green Man - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2I01BphxVcwDw7Uze2LaHw/o.jpg"
      }
    ],
    "user_id": null
  }
}