{
  "7B0UibrSrSPvU0IkpTzgQQ": {
    "date": "5/19/2014",
    "text": "A must in London! A very reasonable lobster dishes with a cool ambience",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "O1YEt5rBFcyxDnuKXg_4Ow"
  },
  "08mn8wwwRJOF_0I7tEr9NQ": {
    "date": "9/3/2014",
    "text": "A friend and I ended up here on Friday night...wow. We sat at the bar which was great people watching...and celeb watching. My friend and I decided we wanted to try both the lobster and the burger so we ordered both and would share. Brilliantly we were then served with our meal totally halfed and ready for us. You can imagine our delight. The burger was up there with the best...with added bacon and cheese...so good...and the lobster was such a treat...with garlic butter served on the side in a little jug. I even had room for the salad and chips that come with each order. There was no menu, the guy behind the bar just told us what there was and that everything was £20. It's simple but effective idea. We had so much fun and stayed for more drinks after our meal just to enjoy being there and they didn't rush us all...we were one of the last to go. Loved it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABA2Ict9Qew87dW-iTsW5A"
  },
  "xs036KXSRyz9y7bMewptBg": {
    "date": "4/15/2014",
    "text": "I decided to go here for an impromptu lunch with a friend and ordered the combo meal this time (last time I'd just had a lobster and was a bit disappointed). This time was way better. The lobster was tender and delicious, very fresh. I loved the sauce that came with it, creamy and rich. I particularly enjoyed using the pincers to crack through my lobster tail, picking out the flesh as I drunk pink champagne (I'm a pink kind of guy). The burger was a nice filler, not the greatest burger in the world, but the lobster was really good. I was so full I couldn't fit in a free dessert! Will definitely be going back.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "v8RyuX7ybTlkQ9vbAd6VBw"
  },
  "r9al18DJvT3kp8oFfmQAPg": {
    "date": "2/13/2012",
    "text": "This place is way too over-hyped. Maybe we were unlucky, and our food was offered for free after a number of blunders, but we had a pretty bad experience and I won't be going back. Gourmet fast-food if there was any such thing.We arrived at 18:00 on a Monday, and were told we had to wait 40 minutes. Expected, so we went to a bar for a drink and they called us 40 minutes later. Went back and had to wait another 10-15 minutes, and there was very little space to stand. Once seated, two of us ordered lobster and one ordered the burger. The table was a bit chilly as we were right by the window, and it was very cramped (more like a table for two).The food arrived, and the burger was under-cooked. They took it back to the kitchen and returned a new burger without bacon and still a little under-cooked. They took that back and this time it came back with onion (we asked for no onion). Fourth attempt came out fine. Thankfully the owner came to our table and offered to cover the cost of our food (saving them from one star), which lead me to believe our experience was unusual. Our waitress was getting more and more impatient with us though, even though none of this was our fault.Besides the burger saga, the lobster got cold before we managed to get through the first half, and so did the butter sauce. It wasn't very tasty either, nor did the meat fall out of the shell like some other reviewers have claimed. The burger was alright, but not worth £20. The salad that came with the burger had some onion in it, and the person eating it was allergic so she suffered a bit of a reaction.The macchiata came as an espresso, and when we told the waitress she just brought cold milk. When we asked for toothpicks, they said they didn't have.We weren't the only ones to complain. We overheard a neighbouring table complain about their lobster and get two replacement dishes. Another neighbour said the dessert was pretty average, definitely not made on-site and came served in a paper cup.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PpeaZK8ocQxwl0EgtdbfPw"
  },
  "8ynCZJOrbDxcEjz0Oo1DsA": {
    "date": "12/20/2011",
    "text": "London has been cold and dreary lately. With the chilliness in the air, my heart and body started craving for something warm like noodle soup. So it was with anticipation and excitement that I set a date to head to Brixton Village to try Mama Lan with SC. As it turned out, Brixton Village isn't open on a Tuesday night and Khao Sarn was full. I suggested Roti Chai and we ended up back on the tube heading towards central London instead. As we thought about where our hungry tummies were going to eat and where we should come out, we spotted Green Park on the tube line and began to wonder if there was anything around there.I turned to SC and said that I think there is a new place called Burger & Lobster that could be there but I wasn't sure, I only remembered that it was in the west. We looked at each other and thought, should we risk it? or head straight to Roti Chai. We decided to take a risk and hopped off at Green Park. A quick confirmation on google maps revealed that we indeed came out at the right stop and walked that few minutes to our destination. Even for a Tuesday night, the place was packed but we were lucky to get a seat without waiting. Burger & Lobster don't take reservations and do note that if your entire party hasn't arrive, you won't get your table.Burger & Lobster only serves two things, burger and lobster (apologies for the pun!). Have you check out their website? It shows two tables with one having lobster and the other a burger, it was simple yet punchy and hit the mark.SC and I ordered one of each and a bottle of wine.Our order took a while to arrive but our lovely waiter, Rihanna kept us informed of the status which was great. Since it's Christmas time, we were happy to wait while catching up and sipping our wines.Our lovely lobster and burger arrived and we proceeded to wear the bibs provided to us.On the first few bites, the burger stood out more. It was a good piece of meat patty, wonderfully seasoned and delicious. It is after all a Goodman burger as this is their latest opening.We ordered our lobster grilled and it came out with a good bouncy bite to it. As we continued our meal, the freshness of the lobster starts to hit you. I was hoping for the soft sweetness of fresh lobster which was not boldly evident in the first bite, but that might be because I ordered it to be grilled instead of just steamed, I'm not sure.Looks can also be deceiving as we nearly contemplated ordering three dishes instead of two like the table next to us. Thankfully, we did not as there was a whole lot of meat in that one lobster and it took me a good steady concentration of 30 minutes to extract all that juicy meat out.The accompanying garlic butter was fragrant and not overly rich which went well with the lobster. The lobster and burgers are definitely the stars of the dishes with the salad and chips playing a side role.SC and I thoroughly enjoyed our dinner and the place has a great relaxed and informal atmosphere to it. I also have to make a special mention to our lovely waitress, Rihanna who only made our experience so much better. She checks on us regularly to make sure that we were good and even showed us the tanks where the lobsters were kept. This was a tip that I got from the twitter-verse, thank you!The best part of Burger & Lobster is yet to come, both dishes are priced at £20! Decadence without breaking the bank, I love this place already and I can see myself coming back regularly. We need more places like this in London, places that serve delicious food at great value.Much to my surprise, a chat with Rihanna revealed that Burger & Lobster only opened its doors on Saturday so a random change of events and chance led us to dining here in its very first week. To Rihanna, thanks for taking such good care of us, the next time I am back, I am leaving a bigger tip!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "XyqLiMAqeBLsH-_bS27BcQ": {
    "date": "1/13/2012",
    "text": "can't believe NY didn't think of this first.  Brillant concept:  3 things on the menu.  Repeat:  3 things on the menu.  Lobster.  Lobster roll.  Burger.  Nothing else.  Sides:  fries and salad.  That's all folks.  £20.Dessert:  lime or chocolate espresso mousse.Drinks:  great offering of beers and affordable to not so affordable wines.  Espresso served as well.So when you make so few things, you better make them well.  Lobster was delicious and meaty.  Burger was excellent.  The value is in the lobster.  Fries were great--perfect crispiness and saltiness.  Lime mousse was divine.Hottest tables in town right now--at 8:15 on a Thursday there was a 1.5 hour wait, but they'll call you.  Grabbed a drink somewhere else until we got the call.Service could have been sharper, but of course this is London.  Great vibe and a bit of a posh crowd.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "FB3miA5m4o-6WjYTSDEj8w": {
    "date": "2/22/2012",
    "text": "Extremely disappointed. 2 hours wait and still no sign of sitting down for a meal. Especially when staff misled us to think that we are will be sitting down soon. \"any moment now ... really soon ...\" We left after 2 hours and they finally called us 3 hours later to check if we still wanted a table ... what a joke !!If you are enjoying waiting like an idiot for hours for a 20 GBP meal burger ... this is definitely that place for you :-)Apparently the food is really good ... then again when you are hungry everything taste good lol",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mucV6hEzr4F9MjnZcuV72w"
  },
  "L0NCYwgJL1EE2KhdZ7u3cg": {
    "date": "12/14/2015",
    "text": "Excellent find. We found this on Yelp. Excellent burgers. If you are looking for a big menu this is not the place. They only have three items on the menu - burger, lobster, and lobster roll. Our burgers and lobster were awesome. Our waiter Roberto was excellent and very colorful!! He's an asset for this restaurant for sure. You can tell he loves working there. Highly recommend it!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmYRPFb_na4WG48zsvpLQg"
  },
  "_XIlYd30_RVihYWh0E2fZQ": {
    "date": "8/27/2014",
    "text": "Yes you have to wait, but you can go to the pub for a drink and they'll call when your table is ready.  This is one of the places that does deserve the hype.  £20 for well cooked lobster, not that flavourless overcooked stuff you see on other \"specials\" menus.  It can get messy but they know how to cook lobster so it's definitely worth it.  They accidentally gave us boiled lobster when we ordered grilled, but they quickly replaced, the manager apologised and offered us a nice little bonus too.  Staff were well trained as well, it's nice to come to a place where everyone is well trained and the place does not just survive on social media or PR hype.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INVx3MKlgB_uMR4KmuYAgA"
  },
  "ggduggNz5iwfhTJ6L9tT7w": {
    "date": "10/17/2014",
    "text": "Great service, food was very nice. Split a burger and a lobster roll and both were quite good. They come with a small salad (lettuce and dressing) and fries for $20. I can recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGitc8LZOvc4BJX8cK1UKg"
  },
  "-atk3Qt8lSxGECq20yo30w": {
    "date": "6/3/2014",
    "text": "Got take away lobster roll and it was delicious! Love that this place doesn't even have a menu. You have choice of burger or lobster roll or lobster. Great food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JbY8212QQEL5DfU0U5FXEQ"
  },
  "czkdidI5Sj02UE6pcbFnhw": {
    "date": "11/20/2014",
    "text": "My daughter and I were traveling in UK and she does not eat meat, only fish, and we ran across this place.   Great place beyond busy, interesting concept as their are no menu's. Great burgers and lobster rolls.  So good my daughter wanted to go back next day",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CIzWwrXQvvFv4TGJfTsDFw"
  },
  "gFmS8lj__mJq00GxvFhmYA": {
    "date": "11/30/2013",
    "text": "We went on a wed night and the Knightsbridge outlet was surprisingly empty. We got a seat almost immediately. We decided on the burger and the lobster. The lobster was impressive looking when it was served, but I am hesitant to give it a higher rating because the lobster could be a lot fresher. The lack of freshness was compensated by the creamy butter sauce. The burger was mediocre. For 20 pounds per dish, I would recommend trying the two lobster dishes instead. The service was really good. The waitress even offered to cut our burger as we were sharing the dishes. Overall, a good experience and worth trying!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g8GeqYOqXGI6ghogNh928A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster again! Comes with fries and salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g8GeqYOqXGI6ghogNh928A/o.jpg"
      },
      {
        "img_id": "D6ZWK_ENaTSsKsNxe6qFyQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobsters!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D6ZWK_ENaTSsKsNxe6qFyQ/o.jpg"
      },
      {
        "img_id": "iuVbzFSFx3sFxtd-zxiwCw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iuVbzFSFx3sFxtd-zxiwCw/o.jpg"
      }
    ],
    "user_id": "E4KF__3JKFNBn92fXCtfyg"
  },
  "g2njCZrPmEGe_2wDRDoDkw": {
    "date": "8/18/2014",
    "text": "I loved this place.  I went there with some friends right around 6:30 pm, and had to wait just 30-40 minutes for a table.  We got some pimm's cups at the bar while we waited.  My friend and I split a burger and a lobster.  The burger was honestly one of the best I've ever had -- and I've tried my fair share.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdxjC1n9-xpbrQ9nonJD9A"
  },
  "9T3ksLjQBIxOUyVkWPESBA": {
    "date": "8/30/2015",
    "text": "The lobster and lobster roll entrees were excellent. We were so glad we found this place during our short trip to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YpPCl6heHd_7ZIM1mH2zSg"
  },
  "TrVqTYDHaR4QlH6qbVflRQ": {
    "date": "9/20/2014",
    "text": "The lobster is available for 20 pounds. I'm not sure anything else is value for money here so I've only ever tried the lobster, although I've been to this place many times. I like the Mayfair branch because it is not so crowded as the other outlets so getting a place is a lot easier (although still a challenge!). The lobster is cooked well sometimes and other times, depending on your luck, is not cooked enough. I think some consistency would be good! The chairs are a little too high for my liking, feels like an expensive pub. The drinks are expensive but I'm guessing this is how they get their money back. A better selection of wines would be good, to go down well with the lobster.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "snR6jXPWFUmqNLH4GuwrPg"
  },
  "Sm6I0QV2_chhHWlZEEx5RA": {
    "date": "7/6/2013",
    "text": "If you can make it in through the lunch time rush and have £20 to splash on one burger then do it ! Well worth the buzz :) Juicy and flavoursome meat patty that leaves you longing for more !!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VyTQI6AJXhaJISL4vMkxRQ"
  },
  "4CeB4hcI3G-YNQNjzvaP5w": {
    "date": "5/14/2015",
    "text": "Came here with our son (Grant T.) while we were in London in early April.  It was a great experience.  We had the grilled lobster while he tried the burger (since he had not tried it on previous trips).  The burger looked absolutely wonderful.  The lobster was really great.  Our waitress from London and son were discussing where to get good California wines in London.  She was great fun and very informative.  We would definitely repeat this experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-YgAM7xwHite5wAshFAgA"
  },
  "J5K5WzlwI5tgrPIhR3Rk0w": {
    "date": "6/19/2012",
    "text": "For the post work eating what decision making does one want to make other than the drinks? A perfect little place where the food is simple to choose but exceptionally tasty and the cocktails disappear easily but with taste on the pallet.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "e6gCLjdMQZjcjFukNuZtxg"
  },
  "93PrUvBKYbx2JFLwbOz_SA": {
    "date": "12/4/2012",
    "text": "I am not always a fan of gimmicky restaurants, and while this place is a steal for lobster lovers (20 GBP for a whole one steamed with garlic butter), it's not somewhere likely to become a regular haunt for me. That said, the burger was excellent - one of the best I've had for ages - with tasty moist meat, cooked perfectly, deliciously meting cheese and salty smokey bacon. The little side salad and decent fries were a welcome addition, although I'm still not sure the whole package is worthy of the 20 quid I had to pay. The Mayfair branch's 'put your name down, we'll call you if a table becomes available' system makes for a cold wait in the current weather or a rather frustrating wander around the neighbourhood looking for a place to drink (I've heard the Soho branch offers reservations for groups). We ended up being sent away, only to find ourselves called back just as we were sitting down about to order a drink elsewhere. A few minutes later and we'd have been most annoyed to have missed our slot or had to down our drinks. Still, it all worked out and the four of us were very happy with our dinner, despite the hefty price tag for the burger. Given this is a much better deal for the crustacean lovers out there I would recommend this place if you are all ordering the lobster or the lobster roll, for the meat lovers of London beware.Side note: our Australian waiter made two of our party some of the best coffee (lattes if I recall) they had had in a while, worth asking for instead of their minimal dessert list which we didn't end up needing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fm9USFMgcVhYVVWYDgU2vg"
  },
  "DZwrbogwxrG4R8nByDfHGQ": {
    "date": "5/8/2017",
    "text": "Came here with a few buddies and we ordered the burger and lobster combo, lobster burger, and lobster roll. Everything was delicious and the service was awesome as well! Side note, the fries taste good with the lemon butter thing that the lobster comes with. Super happy and would come again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bk7b6pUY7PWmJTmJ_A9XwA"
  },
  "NCl7wq6G-VesKFYO9h0bNQ": {
    "date": "10/3/2013",
    "text": "I tried to go Burger and Lobster on a Thursday night at around 9 pm - all booked up! Amazingly, I tried again on a Saturday night and was able to get a seat at the bar which is first come, first served. I think it would be tough for any more than one person to get a seat at the bar.20£ for a burger, half a lobster or a lobster roll. I think I was the only person in the restaurant who ordered a lobster roll because I'm a sucker for a lobster roll. This wasn't the best lobster roll I've ever had but it was pretty darn good - big, cold chunks of lobster, moderate amount of mayo, not too many veggies to junk it up, all on a toasty bun. The toasty bun was surprisingly good and crunchy. All entrees come with chips also. I was surprised by the number of people who ordered both a burger and half a lobster (I guess that's why it's called burger AND lobster - not burger OR lobster). Service at the bar was really nice and quick. They don't take reservations and the wait can be brutal but the host will call when your table is ready.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aqWXHhcR_CdmKmxggFOlEA"
  },
  "ftXv_2-_zQoaQi1CVCmerw": {
    "date": "9/1/2015",
    "text": "Excellent sandwich, I ordered the Lobster roll. Fries were perfect as well; the salad was absolutely lackluster, but I wasn't there for the salad. On the expensive side, but you get what you pay for. I am taking a star off what would otherwise be a 5-star rating because of the bathrooms. They were abysmal. The soap didn't dispense, the toilets didn't flush, the stall door didn't lock, there was no toilet paper, and the air dryer wasn't working. It was as if someone went through the bathroom intentionally making sure nothing worked. So, definitely go to the restaurant, but definitely don't go at the restaurant, if you catch my drift.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "muZaae5mImKxmslD8nAAKQ"
  },
  "MALAigRWDOCgupDwD54VPA": {
    "date": "7/26/2015",
    "text": "Only 3 choices on the menu besides drinks: lobster burger, meat hamburger, lobster (steamed or grilled). A very profitable business model. Food tastes excellent, except lobster are all 1lb or so. For 20 pounds per meal (all 3 choices cost the same), this place is a good choice when in London. The place does not take reservations so our waiting time was longer than meal time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EV-mK19LGSZCDbAYdb-OGg"
  },
  "nY4owBhOth6dlQB4d8Kpvg": {
    "date": "1/8/2015",
    "text": "The lobster is so good, I go there whenever I can. I once waited for 45 minutes to get a table just because I didn't want to miss the opportunity to eat there. The burger is also good and the chips are tasty.They don't take reservations, but if you don't go on peak times, you'll get a table fast enough.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mfXlwb8AEWcQD6_4qZ31cw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The lobster",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mfXlwb8AEWcQD6_4qZ31cw/o.jpg"
      }
    ],
    "user_id": "GQ1pYZuaYfDRfm95a90ZwA"
  },
  "8zLnpmzc97Q16kOm7JeiHg": {
    "date": "4/13/2016",
    "text": "Burger & Lobster's beauty is in its simplicity. There is no menu as there are only three items on the menu and they all cost the same £20. When you've gone to Burger & Lobster once you don't even need the waiter to tell you the options. They serve a classic grilled lobster, a lobster in a bun / brioche and of course the burger. I had to go for the grilled lobster and I did not regret it. The dish comes with fries and a side salad and it's delish! I do need to go back at least two more times to test out the other options too some day. Also, the are no reservations, so get ready to wait for your table especially if you go on a weekend. But I'd say it's well worth it ;)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRWYX8DpBCjxHedRczC6Rg"
  },
  "Gj6kk2-BoviNzLcJZEe5nA": {
    "date": "10/21/2013",
    "text": "If you go there, I have one advise . Choses the lobster! If you want a good burger there is many other places where you will enjoy a better one. Also choose the size of your lobster, we picked one of the bigger one (5 peoples can share it) however if you are a lobster lover you might be disappointed ( lobster and fries isn' t the most gastronomic  menu you could imagine) Drinks : forget about cocktail ( tasteless..)",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OX2c-Wce0cuSN7XC4aEm3w",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster definitely ! I loved it .",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OX2c-Wce0cuSN7XC4aEm3w/o.jpg"
      },
      {
        "img_id": "dH2UE5Wv4PBHpzzE5YrCtQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster definitely ! I loved it .",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dH2UE5Wv4PBHpzzE5YrCtQ/o.jpg"
      }
    ],
    "user_id": "AoUhuFraURO_lynbRMbeMA"
  },
  "D7Yin4WL_gpK8UIIXI0iiA": {
    "date": "6/11/2015",
    "text": "It will be busy but for a good reason. We got there at about 12:30, 30 minutes after it opened and it was already busy. They sat us at the bar while we waited for a table. Drinks are reasonably priced. Service is friendly. Menu isn't anything surprising: lobster, burger, lobster roll, or a combo. I got the lobster roll (comes with fries and side salad). My hubs and his friend got the combo: each got 1 burger, half a lobster, side salad, fries, and pudding. Best meal we've had in London so far. Don't be shy with adding the garlic butter.  Salad isn't anything special. The fries (chips) were pretty amazing, perfectly seasoned with a fresh crispness to them. I wasn't expecting much from the pudding. They have chocolate and berry cheesecake. The chocolate has croutons (?) on top and is a nice dark/semi sweet chocolate pudding. The cheesecake has crushed graham crackers, blueberries then the pudding. Perfect. It has the full cheesecake experience without being overly rich or dense. Cheesecake should always be pudding. I hope we make it back again.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h8Y7owK_JRZnzqbTh2b9Rw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. 1 Lobster roll and 2 combos (1 burger, half lobster)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h8Y7owK_JRZnzqbTh2b9Rw/o.jpg"
      }
    ],
    "user_id": "M2nYPF1DCfGqCU5Rx8o-Eg"
  },
  "crptMzLHOE78cD1h0OHzrw": {
    "date": "8/22/2016",
    "text": "This place was delicious but, as with anything good, the wait is pretty long.  We were lucky enough to snag two bar seating right before they closed.  The bartender - forgot his name - was pretty friendly and worked quickly to get everyone drinks and food.  The lobster roll was one of the best I've had.  Would definitely visit again if I ever go back to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lrVPAYc7VBYuzscXZNQTDA"
  },
  "ZAv62I5lulofKY91I60w-A": {
    "date": "10/3/2016",
    "text": "We finished our big bus tour and we're wandering around looking for somewhere to eat We fall across a line for what we think is an interesting restaurant:Burgers & Lobster Of course that catches our attention We're told there is a wait but that we can be seated at the barWe did not hesitate As soon as we were walked in we were given great attention and service We asked for recommendations and by no means were we disappointed with the lobster roll and \"the regular\" lobster Best meal we had while in London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Lybi8EH-IhXndbt-XoM7A"
  },
  "W5mHldj8A54CnKgjXA6gWA": {
    "date": "7/25/2016",
    "text": "Brilliant late night stop for quality food. Alexandra was awesome. She broke down the menu quickly and made awesome suggestions - 14 minutes before the kitchen closed! The lobster roll and Seven Samarai were winners.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBJo4DsM3AjkdkC9gBraBA"
  },
  "U37XHvtZW5_xy2i81UCusg": {
    "date": "7/1/2015",
    "text": "Delicious meal, fairly reasonable price for a ton of lobster in my lobster roll.  No reservations, we had to wait about 45 minutes for a party of 8 on a Tuesday evening.  Everyone was quite satisfied with their meal, the quality is high.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "poDy6XhOf0u2Uqvs3VoQ7A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. You can choose grilled lobster as one of the options (vs. steamed)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/poDy6XhOf0u2Uqvs3VoQ7A/o.jpg"
      },
      {
        "img_id": "vpVBHPoqs7GyPEQ94bkxMA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Tasty lobster rolls, tons of lobster, very light mayo, selfish!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vpVBHPoqs7GyPEQ94bkxMA/o.jpg"
      }
    ],
    "user_id": "6Ck8-IAWrIcm2enXZTNVgA"
  },
  "xavMgE2WThZ6JQPjIdrw6Q": {
    "date": "7/10/2016",
    "text": "Came with my sweetheart! Liked the atmosphere! I had the Lobster roll (came with fries and a side salad) the butter sauce on the side was amazing and the roll was legit!! Great place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vf1Gdk2gVCP9xZrLTD9Y0g"
  },
  "gQfckpKWLqLhisYp5SNKnw": {
    "date": "5/31/2016",
    "text": "The Burger: A must have if you like tender, medium rare, juicy burgers that are perfectly cooked... Along with an awesome salad and fresh-out-of-the-oven fries for only £20! I highly recommend this place if your looking for a fun place to enjoy one of the best burgers of your life! Their burger's meat quality is just outstanding.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CsWYZz3qjo9IuXB0Uq-J4w"
  },
  "bb3QbQeYox130Hz6foxCkQ": {
    "date": "8/10/2016",
    "text": "Visiting from the US and I must say the burger was fantastic - rivaling anything back home.  Had the combination that also came with a delicious lobster with clarified butter.  What an unbelievable concept!  The place was busy, fun, and the waiter was terrific!  Would recommend to anyone!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pc-TMN2W3LFIXSHCosGgTA"
  },
  "VD3UsQ4OE68twWtgeOMB3w": {
    "date": "10/14/2015",
    "text": "\"Restaurants that will always do well in London are the ones that do simple food to a high standard.\" -MeThis restaurant is no exception to that quote.You all know what's going  down, you're going to end up with either a burger or a lobster for a 20ball. (Me and \"the dad\" actually did this deal thing which they have when you can share but I'm going to stop confusing you..)\"Kid, a 20ball for a burger you've got to be joking. Value for money simply states this should be the time I splash out on the lobster! Plus I get to use those cracking tools which I actually have no idea how to use properly and I get to wear a little bib thing!\"Well whatever you think of the statement above I tried both so here's my verdict.Burger (Only first in line because I'm going in alphabetical order, no favouratism here!)-Decent, pretty big but it kind of has to be if you're going to charge a 20ball for it. -Good meat, will obviously fill you up.It's good but not 20 quid's worth of good.\"What an amateur this kid is, he didn't even mention the fries which come with the burger\"The fries come with whatever you order but whatever, I'll just review them now.They're very good, exactly what you expect from a good \"junky\" restaurant. Won't be disappointed.Lobster (That's right still in alphabetical order here)-You get a lot for the money which is more of a releif than anything else-Great sauce to dip in.-Cooked really well, can have it cooked grilled or steamed.Seems worth it.Fun, lively atmosphere which is nice. Not overly expensive and you get that feeling that you're having a good quality meal.No reservations, have to go to the door and in the evenings sometimes wait an hour or so.Just missing out on the five due to the fact that the quality could be a bit better (take that with a pinch of salt though, hopefully on the fries). I feel it's great value and a fun little lunch/evening idea.\"I'm a fan\"",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bjxBr5E9MBmdFyH7oqP5Sw"
  },
  "vrLquTDGy08vLaYD1ZH6ww": {
    "date": "12/30/2015",
    "text": "review is just for the burger so if you're coming just for lobster just ignore me.The salad, burger, and fries were all pretty damn good.  the only thing I dont get is why the burger is the same price as the lobster option?  If the burger combo was 15 pounds this place would be 4 stars easy, but 20 pounds for a burger meal is a bit ridiculous.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "p8NbC5v2LjrnIZZ0aaYpUw"
  },
  "ltxslJoqoV_yTHdV95yFpw": {
    "date": "6/15/2015",
    "text": "The menu is their name and the name just what they do!!!And they do it very well.If you think you know what a good lobster should be... you need to be here!!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oRR5zqO_jKxsi_IvouX7tg"
  },
  "H_C-v37VrU6H_T3meL1MaA": {
    "date": "2/11/2013",
    "text": "Now Burger & Lobster, the name is a give away, you can either order a burger, or yep, you guessed it, a lobster; so no messing around here you go for one or the other.We headed to the Mayfair branch as we thought there would be a better chance of getting a table. we arrived and asked for a table of four; I was expecting a half hour wait at least, but the food Gods were shining down on us, a group of four hadn't turned up and the front of house man said \"I've tried ringing them three times, they have had their chance, it's yours\". Wow, we were seated straight away, bonus, and pretty unheard of at Burger and Lobster.We took our seats and the waitress explained how things worked and the prices, everything is £20, all of which comes with a side order of fries and salad. Whilst we decided which option to go for, we ordered a round of drinks. Now, there is a menu for this as they offer a lot of choice, but I made my mind up quick sharp as I spotted a craft beer that I've been wanting to try for a long time. The beer in question was Flying Dogs Brewery's Snake Dog IPA, and for £5.25 it is a lot of money for a 335ml can of beer, but it's a beauty of a beer and I happily paid for two more after I tasted the first. The perfectly smooth IPA, slithers down the throat (see what I did there) and has a really big hoppy flavour with a hint of citrus and malt, a fantastic beer.After I snapped out of my beer trance, the was the small matter of deciding what food to have, and I nearly ordered the lobster. You may be shocked, but I haven't had any for ages and it looked so tasty. The other three all went for lobster, but after much deliberation, I just couldn't, I HAD to try the burger, with added bacon of course.The food came out and all of our jaws dropped. Wow, the lobsters looked amazing and the burger, well, just looked damn sexy, cheese oozing out and the bacon and pickle poking out the sides, oh yes!The 8oz patty was cooked to perfection; medium rare and seasoned just right. It had a really good meaty flavour, the bacon wasn't too salty and complimented the patty beautifully, the lettuce and the pickle provided the crunch and freshness and the bun held up nicely even after soaking all those lovely juices up. One of the better burgers I have had in London. The fries and side salad were good, but played second fiddle to the main event. Yes the burger is expensive at £20, but I'd say it's worth it, especially with your sides included.As the lobster goes, it got a huge claws up from our table. The steamed option came up trumps, with the grilled, smoke kissed option coming closely up the rear. We all enjoyed the service, so friendly and very professional, and made our Burger & Lobster experience very enjoyable, so if you haven't yet experienced Burger & Lobster yet, you should. We will definitely be heading back, lobster roll, your cards are marked.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6ngh33t9XVftCQtusaNf1Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Dog Snake IPA, winner.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6ngh33t9XVftCQtusaNf1Q/o.jpg"
      },
      {
        "img_id": "gYFcev1TQWhNFpocGJP8cA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The burger is magnificent",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gYFcev1TQWhNFpocGJP8cA/o.jpg"
      }
    ],
    "user_id": "JYuy-qxJvV7GXfnpH87odA"
  },
  "BFYjOWnrEu5pjlAh_1qhSA": {
    "date": "1/23/2016",
    "text": "Come for the lobster, never the burger. Get your hands messy, get your mouth dirty, get your tummy satisfied. Well what did you expect from a place called burger and lobster? Simple concept that works and good for feeling like a posh bloke eating lobster.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCSfgihxACerBBSGmcHOxA"
  },
  "Or6AOoc6W5nWnIXH7-nNDw": {
    "date": "12/29/2017",
    "text": "Good Food. Decent prices for the quality. Attentive staff. Perfect for younger couples or friends. Good cocktails. A bit loud. Overall a pleasant experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2S8DSKwFYepLlqX_02mjEA"
  },
  "YxGA88Ds8oByOVjz_Gl-cQ": {
    "date": "5/9/2016",
    "text": "So I was one of the unfortunate souls who didn't know that ground beef was the same price as a whole lobster. I would have a hard time thinking a standard sized lobster roll would be a good value. The burger was definitely good, but nothing that knocked my socks off. My friend got the lobster, and it was grilled perfectly. Fries were evenly cooked, but nothing special either. I had the Gran Capitan cocktail, and it was really sweet. At 10 quid for about 6oz, it's definitely not worth it. They have two beers on tap, I believe. Both were good and typically priced. Staff is friendly, but otherwise pretty standard. Overall, this is a pretty average place, but with higher than average prices. The menu is really limited. There's not even an option for one person to sample both burger and lobster. This place should be called \"Burger OR Lobster, but don't bother with Burger since it's a ripoff\"",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vsRYTy8eT6YY_0NgWdA_dA"
  },
  "JB2yTS_iSQuBt2uW_WHFGQ": {
    "date": "8/3/2016",
    "text": "Very good place to eat alone in London.  American style bar in the heart of Mayfair with great dining options at the bar and in the restaurant.   Lets break down the menu: 1) The burger is very good.  Pretty big as well and the Fries are fantastic.  2) Steamed Lobster/Grilled Lobster and Fries.  I strongly prefer the Steamed Lobster as the flavor is very rich and is highlighted by the garlic butter which is kryptonite.  Order a second side of the butter as you will be dipping anything and everything left on your plate in this treat.  3) Lobster Roll.  Often overlooked at this restaurant and I will agree that this is my least favorite option here.  The lobster Roll is good but contains a little less lobster meat and a little too much mayo for my liking.  No reservations so be prepared to wait",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QxMjoKDyTIdSPMCILr36eA"
  },
  "F5YEhCyKpWrc2727PSVmzg": {
    "date": "2/23/2015",
    "text": "This place is Great! Only three things on the menu but they have really perfected it. Great service and decor who can ask for more!Try the lobster roll absolutely delicious my friend had the burger and we have had some nice gourmet burgers before but he said this was the best. 2 min walk from green park station And go for lunch rather than dinner as the lobster is fresher ;)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v05BaEDlMI9vqxZ8pvpmWg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v05BaEDlMI9vqxZ8pvpmWg/o.jpg"
      },
      {
        "img_id": "Wa-wZ9HugZSARueSnaIJNQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wa-wZ9HugZSARueSnaIJNQ/o.jpg"
      }
    ],
    "user_id": "eHaNR6IWBQTBeZy9IrfgfA"
  },
  "se8NNYg1gj4eSUTSO7vdiA": {
    "date": "2/23/2013",
    "text": "Why waste time printing menus when you only have 3 items right? I wonder why no other places have done this yet?!?For those of you who don't know how this place works, they only offer 3 food items:BurgerSteamed LobsterLobster RollAny of the above for 20GBP. Analysis of the Menu: Burger:I balked at paying 20GPB ($32USD) for a burger especially when there is nothing extraordinary about it (i.e. made with kobe beef or prime rib or garnished with duck confitt, lamb bacon or foie gras or anything insane or posh toppings). So that was an instant scratch in my mind. Lobster(s)The server mentioned that the standard weight for the lobster were about 1-1.5 pound range and would come steamed or chilled with lemon and drawn butter. This selection boasts the best value for money as it's not too uncommon to pay $50+ for a lobster dinner.If you manage to take a look at the tanks in the back, you will see the heavyweight monsters you can select from should you want to upgrade from the standard meal.  I didn't want to get messy to this was a scratch for me as well. Lobster Roll:This caught my eyes since I am a sucker for an awesome lobster roll. Once again I balked at the price, at first look I was a little discerned as the New England roll was cut into a pouch versus like a hot dog roll like I am used to. This gave the illusion that there was not much inside it. Thankfully looks were deceiving in this case. I kept on picking at the overflow of lobster meat but the sandwich kept on spewing! I swear the managed to stuff a whole lobster in the roll!. The evidence was apparent I saw whole claw meat as well as bits of the rest of the lobster carcass..  Needless to say I was impressed... Drinks:The cocktail list is very impressive for those who enjoy fu-fu drinks. I on the other hand prefer beer and was really disappointed at the very limited selection of draft beer. However, I was very surprised to see Asahi on tap here, I think its the only place in Greater London that I've seen to date.  While impressed at that, it does not take away from the lack of selection here; So for that my friends I'd have to take away a star.All in all I was a great dining experience. This place seems to be a new London hot spot so I would suggest making reservations...Cheers!",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kJ9yT1ycDIVGUo4uDeej6w",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. What 20 quid buys you here.. Notice the American style fries (finally)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kJ9yT1ycDIVGUo4uDeej6w/o.jpg"
      },
      {
        "img_id": "tWhR2kof_MGtpY-e31j2Iw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Option 1: lobster roll.. Loaded to the brim",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tWhR2kof_MGtpY-e31j2Iw/o.jpg"
      },
      {
        "img_id": "YihFwBYL25v1xmS6sVb3vg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Dinner set",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YihFwBYL25v1xmS6sVb3vg/o.jpg"
      }
    ],
    "user_id": "E_Ts8j758tpiAZknHR7k4g"
  },
  "QVKZUyUeYz7nevDbKER32g": {
    "date": "6/4/2016",
    "text": "We were walking our 10 miles average per day on vacation and were starving. We found this place and were happy. My guy had the lobster and I had a burger. All was yummy.  Thanks B & L!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPro5OxZwttqEfta4N3aqA"
  },
  "ZNKwUvIIehGB0dxffC2fXw": {
    "date": "4/8/2015",
    "text": "Look at the menu for drinks, but don't try to hard for dinner options - there are only 3.  Burger, lobster or lobster roll.  And let me tell you - that's one kick-ass burger.  Guessing around 1/2 pounder, get some extra pickles and hold the mayo for me, I don't think they squeeze any of the juices out of that baby on the way to your plate.Just try hard not to think about the pound to USD exchange rate making this a $30 (usd) burger and you will be fine...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fDfVp5kbYBEGcZJn8MMZBw"
  },
  "-jlgStwTkmuTZ2xVmXhWsQ": {
    "date": "2/8/2015",
    "text": "I'm not sure what to think of this place. Food: Burgers and/or Lobster rolls - that's it, done! No menu, just order one of those things, comes with fries. Lobster roll is 20 pounds (a bit steep).Place: Lots of space, but gets packed. The wait when I went was 45 minutes. Thankfully you can just sit at the bar, which is much quicker.Service: The staff is very attentive and friendly.Overall, if you don't mind spending the money, this is a nice place, high quality fodd and great staff.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YJRhX3dL8QdS2w326bG5QA"
  },
  "xIvCp5VqtxkPR4qlcm8XbQ": {
    "date": "9/22/2017",
    "text": "Noisy, crowded, 80's rock. Wouldn't have it another way. Pint of IPA & a combo hit the spot.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hCGX26ZGy2dO0TMHZESDqw"
  },
  "xpI9VRnZ4BkceFy40rb0UQ": {
    "date": "1/2/2017",
    "text": "Here's a tourist's and parent's perspective.  I'm from Miami and have good experience with both lobster and burgers.  We went with our kids around 9 at night.  The line was long and the staff was extremely accommodating. They quickly escorted us through the wait and had us seated without issue.  Both the lobster and the burgers were nothing short of great.  I'd highly recommend this restaurant to everyone from couples to those with kids.  It's got a little for everyone from locals to tourists.  Great food, great beer, and fun music.  Can't say enough positive things...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "JNpZRMEIA4vzJxvhy5QoHQ"
  },
  "8J-vdeEPxW8lthi1Q2GZFA": {
    "date": "6/28/2016",
    "text": "This place is one of my all time favorite places to eat. We were visiting London from the US and found this place thru Yelp. The food is amazing! The lobster roll is to die for, the garlic butter that comes with it is delicious. It also comes with a little salad and some French fries( also really good ). The burgers are also unreal good. I had the classic and I was blown away. Another time I had the California, which comes inside a lettuce head ( no bun ) which is a nice Lo carb alternative. The best thing about this place and I cannot stress it enough, is the staff. You feel so welcome here. You are treated like a friend. Our host was so nice to us. He even spent time with us telling us what to do around London and where to go. I'm very much in love with this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qhzrh1xuXtXieV9x_9DOTg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The lobster roll.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qhzrh1xuXtXieV9x_9DOTg/o.jpg"
      },
      {
        "img_id": "rfjUVKiLVf9ofg4Jx3iZHQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The California burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rfjUVKiLVf9ofg4Jx3iZHQ/o.jpg"
      },
      {
        "img_id": "v87vxJva_x9LhQkwZLA97Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The California burger( no bun )",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v87vxJva_x9LhQkwZLA97Q/o.jpg"
      }
    ],
    "user_id": "EYWbkgm1JiVM0spVpyOkPw"
  },
  "nlA2CYsrx1cJmxqpLGurxA": {
    "date": "8/23/2014",
    "text": "I knew about Burger and Lobster from a few different sources, as a guy at work raved about it and the missus has really wanted to go for a while. I thought I knew what it was - you know, a choice of a burger or lobster, but when it came down to it I got a little confused. Because well... define \"salad\". What sort of salad? What sort of dressing? Are the fries chunky or thin? Can I choose a sauce? All this and more was what I was expecting on a menu, but alas there is no food menu, just a spiel recited by a waitress. But regardless of that, this surpassed all expectation. Having had lobster before, and not fancy trying to crack into one at the time, I opted for the lobster roll (let's face it, the burger seemed like a cop-out). It was sublime. Tonnes of tasty lobster meat packed into some of the finest brioche I've ever had. The missus somehow knew to order some garlic butter with it and that was just amazing - even the salad was good, dressed in simple oil and vinegar, but was a perfect accompaniment. The only lobster roll I can compare this to is from Bob's Lobsters, but I think this was much better.It would have managed to get five stars, but I didn't like that a party of four was turfed out of a table that they tried to sit at because it was done up for six and the manager wouldn't let them occupy a table \"that large\" because they might have a bigger group come in later that needed it. The table was empty the entire time I was there, and I never expect to see that sort of disrespect to customers, in fact had they been loud mouth city boys who'd spend a load on booze like some of the other tables nearby then I doubt it would have happened. But instead these were Asian tourists and so instead they got the boot. I hope they showed the guy a two finger salute and went somewhere else.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jBqJ32j3nsyugAhuh0h2bw"
  },
  "oDuT8tGeS8RH0ucrlMfTsw": {
    "date": "1/12/2016",
    "text": "Place was great and everything that we thought it would be. I had the burger and my wife had the lobster roll which were both outstanding. The drinks were great as well. It was very easy to get in as we went early in the afternoon, but the place was definitely packed quite often during the lunch and evening hours. The service was still very good even though it was busy which was a pleasant surprise. Highly recommend it for a great late lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c67ZY-8SKAUVs8h1PipUWA"
  },
  "q1z9t12LTFEgv9XwDJcwEQ": {
    "date": "5/21/2015",
    "text": "I love lobster and when my partner took me here after a day out, I was so pleased. There are just three menu options at Burger and Lobster: a burger; a lobster; or a lobster roll. Each costs £20 and is served with chips and salad (so decent price for lobster but a tad expensive for a burger!!). I had the lobster and he had the burger (he's not a fan of lobster), both were great. I really enjoyed it and couldn't wait to go back. We went again but to a different branch and I must admit I didn't enjoy it as much, perhaps the atmosphere wasn't as good, but it hasn't put me off and next time I think I'll try the lobster roll.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JblNVRPu6EBKTXyqn8UazA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JblNVRPu6EBKTXyqn8UazA/o.jpg"
      },
      {
        "img_id": "E8qxGfwlNbNt4iQRbSZUJQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E8qxGfwlNbNt4iQRbSZUJQ/o.jpg"
      },
      {
        "img_id": "JmYk04ZPhNnjhIn9rhyXuw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Enjoying a prosecco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JmYk04ZPhNnjhIn9rhyXuw/o.jpg"
      }
    ],
    "user_id": "A_Pal06hxUnkHwqcqaKOBA"
  },
  "VV2Xmtb00fivOmoAf3Dahw": {
    "date": "3/5/2016",
    "text": "By far my favorite spot in London.  I've had all 3 menu items (burger,lobster, lobster roll).  All are really good - but the lobster roll is especially AMAZING!  The garlic butter really makes it along with the bread.  Service was great - friendly people and a nice environment. Definitely recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWr3exkp_V_6bl_To5kUHQ"
  },
  "dTpseZMVP91eqFw0U_D_Dw": {
    "date": "6/14/2016",
    "text": "wow.  wow. wow. What a treat.  I went to B&L based on yelp reviews.  And I'm glad I did.  In fact this is the first time I found yelp useful.The menu is rather simple.  2 burgers, 3 size of lobsters and 1 lobster roll.  Based on the waitstaff's recommendation I went with lobster roll and it was freakishly delightful.  I think what sets apart this particular roll was the bread.  The bread was warm, tasty with a bit of crunch around edges.  Next time I'm there I will try the burger.  Highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "A_kRX4bvP6HFII_OtX65GQ"
  },
  "hBqmJt-IRX9T1J69Z4FWew": {
    "date": "3/24/2016",
    "text": "Exactly what the name says; great burgers and lobster rolls/full lobster.Burgers are never disappointing and the shakes and drink range is impressive. Like many restaurants this close to Oxford Circus, it's quite the tourist trap, smattered with local Mayfair workers.No reservations allowed, so be prepared to queue; it's worth the wait though!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgnl-k4ms9HWi7m7_JN0oA"
  },
  "x6AbSD_9DIQ1Tb_4OKsnNQ": {
    "date": "11/24/2015",
    "text": "Okay, 3 items on the menu.....blew me away. I tried the burger---YUMMMMMMY!  I tasted my friends lobster and the other one's lobster roll again YUMMMMMY.  The non-alcoholic drinks weren't all that.Did I mention, I went their twice during my trip. Ha.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymfXm8zzFAw5kBTsz9DbXA"
  },
  "fOWgdAeX0IRvCJbcQE5ZpQ": {
    "date": "12/5/2013",
    "text": "Ever looked for a great lobster restaurant in London? Just stop by here, but it was SUPER good..!They have such a great deal. For just 20 pounds you will have a WHOLE lobster with fries and salad. The lobster was pretty big and it was worth waiting for it I must say. When we arrived, they said to us that we have to wait about 1 hours due to it was so incredible busy. We waited at the bar and luckily we can already sit at our table after waiting 15 minutes!They also have a great lobster menu or you can even order bigger lobsters as well! I haven't tried the burger, but it looked sooo good as well!I recommend you to go after peak hours to prevent you to wait so long, but definitely try the lobster!Next time when I am in London I definitely will come back!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "noolRFR6k0ytsHr6iPqy-w",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. This was soo goood, for only 20 pounds!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/noolRFR6k0ytsHr6iPqy-w/o.jpg"
      }
    ],
    "user_id": "FKhdK91bWqvRpGBbOjR9aA"
  },
  "FA5XtxDaiDOYpcW43WTDdQ": {
    "date": "9/15/2015",
    "text": "This joint was not creative about its name, so it is exactly what you expect. There are 3 items on the menu - - grilled/steamed lobster, lobster roll, or burger. For 20 pounds, it was hard to justify eating a burger when the alternative options were lobster, so my girlfriend and I ordered a grilled lobster and a lobster roll. As you can see in many of the pictures, the meal comes with a nice side salad and a ton of fries. Portion-wise, it was enough to fill us both up.The grilled lobster was extremely fresh and delicious. However, the special thing about the lobster is not its freshness but that it is relatively inexpensive for an entire lobster! Another key aspect of the meal is the garlic butter, which really added a nice flavor to the lobster. Even though the lobster is not unique to the area, this was a terrific deal.The lobster roll was also delicious. The buns were nicely buttered up and toasted. There was also a generous amount of lobster in the roll. The roll here was definitely as good as any other I have had.After having tried this place, I can understand why this is such a popular restaurant in London. There is an energetic vibe to the place for the younger crowd and the business crowd.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Erf1Jb6H6hsQHiLtn3G_-g"
  },
  "XlkJbA6vUmDT3NR97hoJLw": {
    "date": "12/15/2016",
    "text": "While heavy on the fat scale, the lobster roll on the garlic bread like roll was fantastic.  The salad is really necessary to counteract the fat.  I preferred the roll without the sauces.  The fries were nice and hot, using canola instead of soybean oil.  Skip the croquettes.  The cocktails were very well made.  Great staff made this a very pleasant surprise.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cd7qIyitKRdXXUy4yVG94A"
  },
  "e834AC8gtVRmRTkhpdSEUA": {
    "date": "7/1/2013",
    "text": "Not much to add to their litany of reviews other than to say that of the three menu items, their burger most definitely subsidizes the lobster.  I can guarantee that in no other restaurant in the world is the lobster the same price as the hamburger.  The lobster roll is priced exactly as it should be, although I must say that it is neither a hot or cold lobster roll (following the distinction made in New England): the bun is hot, but the sauce isn't hot butter, nor is it the usual mayo either.  I can't figure it out, but as someone suffering from lobster roll withdrawal, I can say that it is delicious.Note: they also have an upfront charge for water, but feel free to continue having more after the first bottle is finished, their is no additional charge after that.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "0dGi59C6bWFAzrhUjm_cKQ"
  },
  "IwfmZoFgj0d8JLLzMoxIAw": {
    "date": "10/17/2014",
    "text": "Lobster roll. What can I say?They were super delicious and mouthwatering and I was impressed at how much lobster meet you get. The menu doesn't offer much yet it all looks good.My friend ordered the beef burger no bacon and lots of cheese and only had good things to say about it.Can't wait to go again and try the burger and the whole lobster.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EWHNDoleMSk-zcUGe1rhEA"
  },
  "x0JTf3hsUMgCIwMnCqmzRQ": {
    "date": "4/10/2014",
    "text": "I was staying at the Dorchester during my stay in London and this place came highly recommended. It was a short walk. On a Friday night, forget it. What the hell was I thinking coming here! The people before me were told there was a TWO hour wait. WTF!!? I asked if they had any seats open at the bar. They didn't. FML.I had a friend who was gonna come meet me and luckily the Gods were on my side. Two people got up and left from the bar and I grabbed the seats. My friend arrived and we order lobster and fries! With wine of course. This place is great!!   I will def be back. People are nice and the food, even better!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhJBOPO5rYnvjhCNce4OHQ"
  },
  "BXX2vGs7UZcmSsEEtekurg": {
    "date": "7/10/2015",
    "text": "Lobster roll was good as was the cider. My son had whole lobster and enjoyed it. Fries and salad were good as well. Server was very nice. Keep in mind this place ONLY servers burgers or lobster i.e., very limited menu. Worked well for us but I was a bit surprised when the waiter explained their approach. Would go again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4XuvToT4fXGduiOIqE-Hw"
  },
  "NJ_GmGvCyCvtIGSaIce36w": {
    "date": "10/2/2016",
    "text": "Good lobster roll and grilled lobster. Enjoyed the fries. We got there a few minutes before it opened on a Sunday and there was a line out front with lots of Korean tourists due to some Korean blogger who wrote it up. Food came out fast.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQY4rCn1F-1W7e0iAOshlw"
  },
  "aNo15zMFKyREDS0NYbkUcQ": {
    "date": "1/1/2013",
    "text": "I love lobster, so going to this place is pretty much a PILGRIMAGE for me. It really is that epic because I keep getting things popping up, and then i have to cancel and them it makes me want it more. So the premise is simple, the place serves whole lobster, lobster roll and a burger. All for the wonderful price of £20. (Although 20 for a burger is pretty extortionate.) Had to wait around 30 minutes for a table, but well worth it, the bar was very good and tbh, for the prices, this is where they get their major profits from. Much to a friend's delight, they serve so many different whiskeys, because when you're living up in burger and lobster, you go the whole lobster hog. I opted for a sloe gin and lemonade. I swear they just sit you there so you can see the amazing massive lobster plates waft past and it's just either genius or just cruel. As my last few reviews have shown, I am pretty much a old chinese lady inside so steamed lobster, it was. with lemon butter. AND IT WAS SO GOOD. The lobster was meaty and so sweet and just gaaahhhh....d. Yeah. Just go. Save up £40, arrive early, get some drinks in, eat, cross off bucket list. Go. Tip: Go with less people: pick people who will appreciate this. who the hell likes going with friends that hate seafood. (i know there is burger but they'll spend the whole night grimacing at the lobsters beautiful face, and its it's ever between lobster and friend. always choose lobster.)",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "oS9fEc1kdv4OnT_Kw5ZETw": {
    "date": "8/16/2015",
    "text": "Absolutely loved everything about our evening here. Had been referred to Burger & Lobster by a local, and it did not disappoint. We started with drinks at the bar while we waited for a table. Both the staff at the door, the bar and our waiter for the evening were fantastic - welcoming, friendly, attentive and knowledgable. We both had the lobster roll - I am still dreaming about it. Absolutely delicious. Overall: fun and lively atmosphere, great service, and delicious food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2sICFAmJUB1iUMi8Qqhmfg"
  },
  "n8kpuRop5PdFyXilZrn73Q": {
    "date": "3/12/2014",
    "text": "Love this place. Fast service. Great lobster roll. Fries and salad are great too. Served with garlic butter sauce.Haven't had the burger, but you can't go wrong with either lobster option.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "13UpoWZPJEGuhuGVqiDLKw"
  },
  "51PqxCPJW5ivvoCnHvaerQ": {
    "date": "10/17/2015",
    "text": "A bit of a wait because it was very popular but it's understandable because the lobster roll was really good and so was the grilled lobster.  Definitely will visit again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VDbELdCw95ASkgzYOsHeyQ"
  },
  "3J7T-Wg9rGaJfJgR_X3w8A": {
    "date": "6/27/2015",
    "text": "Popped in here for a burger and a pint.  Great burger...now I need to return to try the lobster which looked amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzTsnjiZHor440neG4d_KA"
  },
  "NyCWgKRwZaNoLbV10RX3rw": {
    "date": "3/18/2014",
    "text": "A good hefty burger with a good beefy flavor. I ordered a medium and got a well done. That being said, the quality ingredients saved the burger. good sturdy buns, although it could be a little bit softer. The housemade pickles were particularly crisp, sweet and lifted the whole experience. The side salad was excellent and added a touch of freshness to the meal. The fries were sadly of the frozen variety which reminded me of fast food burgers.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEaVkNPBKcaHXEH3cRkX2Q"
  },
  "BaN-WjtGSLLEc1WBjwkldA": {
    "date": "5/11/2013",
    "text": "No reservations accepted but they accommodate by calling your mobile when your table is ready allowing you to wait in nearby coffee shop or bar.Long wait but worth the wait. No menu but easy to choose from 3 choices.Good vibe, lively crowd and I'd certainly go back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xKiCojDiPqBzyDOBE83zTg"
  },
  "FOUKfd9ovaC7eaozfuzY3g": {
    "date": "8/5/2012",
    "text": "The concept is simple: You are offered a choice of three items. You can get a burger, a lobster roll, or a lobster. They are each £20. (Although there are bigger lobsters you can get for £30, or even bigger lobsters for more if you so choose.) I'd been dying to try this place for awhile. It sounds amazing. So, while trying to figure out where to have dinner the night of our Olympic tickets, I suggested here. It was 6:45, and there was already an hour wait (for two people), so we put our name down (they call you when your table is ready!) and went around the corner (or several corners) to a nearby pub to wait.Anyway, we get a call, we head back, stop at the bar for drinks while they get things ready for us. The wine list is a bit small, but they have a nice selection of things, and we went with a nice Chablis to pair with lobster. They bring us to our table, and our trendy mustachioed server came up to us to offer us our options. I was dying to try the lobster roll (and the burger, just to try it), so I ordered that, and the other half got the lobster. Well our food came. Honestly, I was quite disappointed. The lobster roll was miniscule compared to the lobster that came out. It was incredibly tasty. The flavors were good, but why is the amount of lobster not the same? The chips and salad were amazing. Everything was so tasty. Luckily, my other half took a bit of pity on me and gave me a few bites of his lobster. (Not many, but a few). The lobster was fantastic. He was in love with it, claiming it was the best lobster he'd had. And for £20, that's saying something. I ended up getting dessert. Cheesecake mousse with strawberry jelly and cookie crumbles. Very tasty! The two people at the table next to us got one of each. They didn't finish everything, but the burger looked amazing. I want to try it, but I don't want to be jealous of the lobster, so I think I've managed to convince the other half to go halfsies on the burger and the lobster next time (although he said we may have to order the slightly larger lobster). I did casually mention to the server about the slight disappointment in the amount of lobster meat in the lobster roll, and he said that apparently everything is proportionately made for the best flavor. More lobster meat would ruin the taste. My solution? Make EVERYTHING slightly larger. It probably won't happen.Unless you're really not hungry, and only want a little bit of lobster, don't order the lobster roll here ever. Seriously. The lobster is a way better deal. The lobster roll may be (slightly) tastier, but not for the sheer amount of lobster you get with the lobster! Even with my slight disappointment, I'm still giving this place a full five stars, just for the sheer enjoyment of the place. It was fun, and totally worth the wait!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "zuW7aEbPlTemtkiq-1ZBow": {
    "date": "9/14/2013",
    "text": "Burger and Lobster is a current cultural phenomenon in London. Packed on weeknights, weekends, and a place to enjoy a meal with your mates or some dates. It's pricey and affordable at the same time, and fits into that little bit of luxury and fun niche that today's world needs. 3 fantastic menu items, fun drinks, and a great atmosphere.There's only 3 items on the menu. Burger, Lobster, or Lobster Roll? Burger for me! This burger's reputation preceded it so it has a lot to live up to. A 10 ounce patty of premium beef, black + white seed sesame bun, tomato, cheese, bacon, shredded lettuce, and red onion. My first impression upon receiving my burger was that it really looked the part. I was excited to take my first bite, but upon picking it up, I noticed that it was a bit hard to manage. I bit in and had a very satisfying bite of tender + juicy beef and crispy bacon. The shredded lettuce, great grind on the beef, and soft bun did wonders for the texture. The crispy bacon, sliced red onion, and rest of the flavors on the burger were great as well. I had trouble determining if there was a house sauce on top of the burger with all of the other flavors going on. I noticed I was given ketchup and mayo with the burger, however the original flavors of the burgers were enjoyable enough to need no further. My last note on taste is that the pickles were a bit sweet and I think more vinegary pickles usually pair better with beef.While the burger was great, it was too big to make it as enjoyable as it could have been. I'm not sure if Burger and Lobster is trying to offer value against the Lobster options by making the burger as big as possible, but in this case it was too much. I have found the burger sweet spot is between 5-8 ounces of beef. With all of the toppings including the thick slice of tomato (which I'd recommend taking off) the burger was just a bit too big. Size cannot take away from flavor, but if this thing were scaled down it might be that much more enjoyable... and be sitting with the best in London. Last of all, Burger and Lobster's fries might be the best in London and that in its own right is worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SEFMGfL2bJj6RkLH3jv1aA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger and Lobster - Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SEFMGfL2bJj6RkLH3jv1aA/o.jpg"
      }
    ],
    "user_id": "GwKyDhybZm6huIQFC2IbjA"
  },
  "nywnjVeons5Cso9rnvVmvA": {
    "date": "3/9/2014",
    "text": "Simply amazing. Great staff, awsome food grilled over coal and relaxed atmosphere. I had the grilled lobster and it was tasty and succulent. Will return next time in london for sure.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FNFSSvUMRAOoHkMcyCHlEw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Grilled lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FNFSSvUMRAOoHkMcyCHlEw/o.jpg"
      }
    ],
    "user_id": "ex_UEHfxCtwy9UYlCqYoVw"
  },
  "yS5ci6S4AII4x55VRn2vtg": {
    "date": "5/17/2012",
    "text": "Besides the wacky reservation policy of showing up 2 hours before your desired dining time on a weeknight and being told that there is no chance, and that we should have come around 4-5pm (sorry, I don't live or work around here so really don't want to hang around for 4 hours) or that we should have called ahead to learn the 'system' (sorry, you don't take reservation so why would I call ahead?) this is a truly great addition to the London restaurant scene, and I wish I thought of it myself! Their explanation for the reservation system was that it was a 'trendy' thing to do, which is also disappointing, seriously? But I guess it makes sense as there is only one course, and when you're selling lobsters at £20 each, you need to rotate tables quickly and don't have the luxury of holding a table for 45 minutes before the reserved party shows up, so I get it.Basically there is no menu, and there are three things on the menu: Burgers (with cheese or bacon, how you like), lobster, and a lobster roll, all at £20, with the addition of catch-of-the-day lobsters that range from 2 - 8 lbs. The most expensive one when we went was £134.00, and the claws were about the size of a toddler, true incredible specimens. All dishes come with a portion of fries and salad per person (both perfectly executed and delish), and there are two desserts, a cheesecake or chocolate mouse with crumble, in addition to an extensive wine, beer and cocktail menu.Everything was excellent, but the lobster rolls were a tad disappointing as I am used to seeing the huge, over stuffed variety, and these ones at £20 were on the measly side. Tasty, but out of scale compared to the rest of the food. Overall, the place was bumpin', the food was as good as it gets (they better get it right as there is no room for error with the highly limited menu), and it is nice to have this in your back pocket for a nice dinner when you're not prepared weeks in advance for a reservation. Oh, and the bibs are classic. I will definitely be coming back, sooner rather than later.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "kncHCJ4MLksvxP2Gzhxodg": {
    "date": "4/29/2016",
    "text": "Yummy yummy get in my tummy. Lobster role with the lemon garlic sauce is a heart attack waiting to happen. Do it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NRrhAfS15PTDAy6uE7lnhQ"
  },
  "b6M-GXDJVwxuZMbeBuOO7w": {
    "date": "5/11/2013",
    "text": "Great lobster but appalling service.Yes, the food was delicious....but the wait was far too long (just over an hour). Plus, the hostess who was putting me on the waiting list was reluctant to do so as my friend was running late (and this is despite the fact that we had to wait an hour). Definitely avoid this place during weekends as it'll be impossible to get a table!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPTSLUjrY7qm1eLy05Z0Qw"
  },
  "2xuyk3OiuLf6vEWHG_cTnw": {
    "date": "4/24/2012",
    "text": "There was so much hype about this place I just had to try it for myself - it did not disappoint though everything you have probably heard about it already is true.1.) you will have to wait, and minimum probably an hour. the good news is they will take your number so you can go have a drink in the area and wait until it's almost your turn. 2.) the burger and lobster roll are just as good as the lobster. i've found it best to have each person the party get something different so you can try the different options in one sitting.3.) it's best to go in 2's - you will get in faster than in a group.happy lobstering!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "LW9m7fgyfTYOZLS3WfLNfQ": {
    "date": "3/26/2017",
    "text": "It is sooooo good :)Had the lobster roll and lobster burger (which the waitress recommended). Comes with fries (chips) and a small mixed salad. I recommend trying the lobster roll!!! Actually chunks of lobster and the butter sauce.Is a bit on the price side.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CVkF-H7QKev78XT7MPwzFg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster burger! 12z meat with lobster meat on top.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CVkF-H7QKev78XT7MPwzFg/o.jpg"
      },
      {
        "img_id": "QLfXY9gE07S3U_tjdsixhQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll with side salad and chips (fries )",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QLfXY9gE07S3U_tjdsixhQ/o.jpg"
      }
    ],
    "user_id": "QPBiIV04u0S-aSWyI_xW6Q"
  },
  "YLz3odA6MW-_ugMeR7JHjw": {
    "date": "2/21/2017",
    "text": "Decent burgers and lobster rolls, this restaurant was a much bigger hit when it first opened in London 5 years ago and they were charging £20 for each of the only three items on the menu - a burger, a lobster roll, or a whole lobster. They seem to have since expanded their menu and adjusted prices as well with burgers at £16 and lobster rolls at a comparatively pricier £25, both with a side salad and fries. Overall still decent eats and good selection of cocktails, but now that prices have gone up I'm less excited about Burger and Lobster. Got here at 6pm on a Sunday evening and didn't have to wait, but a queue was forming by the time we left at 7pm.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b356_REnc-OoWy7_XEvFTg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b356_REnc-OoWy7_XEvFTg/o.jpg"
      }
    ],
    "user_id": "soCXdWpSaxvFqfjdlPlcUw"
  },
  "P4A6MdX31EM5BwkIGhqtpg": {
    "date": "1/9/2018",
    "text": "Great place to eat. The lobster and burger combination is quite interesting. The price is good, excellent location and very good people taking care of you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_YiUXEQzYnzVbky3AxGpA"
  },
  "IBCmTPw-6WLOt2ucVQD9Iw": {
    "date": "5/25/2016",
    "text": "Burger was huge, and tasted great. (A little too greasy for me, but my bro digged it lol)Lobster tasted okay, not bad, but it didnt exactly lived up to my expectations.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rMKDg3-PPseKDBKgXEe21g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rMKDg3-PPseKDBKgXEe21g/o.jpg"
      }
    ],
    "user_id": "bgsw5RjlCJiIGC2PwRIfIQ"
  },
  "itiSGKNlLwIamhuBNnlJZA": {
    "date": "12/5/2017",
    "text": "First thing I noticed was that there was a huge line forming outside in the rain. Once I mentioned the reservation, we were led to our table on the ground floor immediately. The kitchen is on this level, so you can see the craziness from your seat. There is a downstairs portion of this restaurant, which I was grateful to not be seated in because there are no windows and I get claustrophobic. However, when I went down there to use the restroom I notice it was very interestingly decorated, with little alcoves for your party and different artwork. It probably is also less hectic and provides more intimate seating. The food here is well spiced, fresh, and cooked to perfection. It definitely lived up to the hype and has earned return visits and recommendations from me. The service was impeccable as well. This is a perfect restaurant for date night, special occasions, and to treat yourself. Their large drink menu also makes this an option for you to make a night of it with coworkers or friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PKKbUDdCpA85ko1s-xg1pg"
  },
  "Cfz6iaoGZNug-eQxIuWORA": {
    "date": "7/19/2017",
    "text": "Most amazing lobster roll you will ever have. Perfectly seasoned with garlic and lemon. I came for lunch and got sat immediately with a very efficient and nice waitress. Would definitely recommend this place to anyone coming to London who loves lobster!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SufVGI8utYr4ZbB6GqnpUw"
  },
  "7256Yb1hFTXNY1iLqb94nQ": {
    "date": "2/7/2017",
    "text": "Make sure you try the Seven Samurai Lobster Roll! Had it with chips and a beer. I do not like mayonnaise, but this was fantastic! Next time I'm in London, I will eat here again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6HI01zjdauCD2r09GZtEvA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Menu shot",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6HI01zjdauCD2r09GZtEvA/o.jpg"
      },
      {
        "img_id": "iWRnTmL4N2U-gGShUgkvvQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Sussex Best Bitter Beer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iWRnTmL4N2U-gGShUgkvvQ/o.jpg"
      },
      {
        "img_id": "AdZ6sVpiYoo90liBQk83SA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Seven Samurai Lobster Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AdZ6sVpiYoo90liBQk83SA/o.jpg"
      }
    ],
    "user_id": "r4RvHiChaTEtJ3s3QNVIqg"
  },
  "SoAaAuLvJyAXYyDcT7fjYw": {
    "date": "4/26/2018",
    "text": "We arrived on 9:15 and still need to wait for table. Seems quite popular place. The waiting is worthy. Both burger and lobster are very nice.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jBDNevrVJnXomH25FSKgA"
  },
  "VLGPGVSn5pqJKxVcU1wrhQ": {
    "date": "11/8/2015",
    "text": "I'd been dying to try Burger and Lobster for ages so finally getting to try it was basically like winning the lottery.  Having been foiled at their Soho branch twice due to spectacularly long queues I sauntered into this branch after a spot of retail therapy. There were so many empty tables I nearly cried tears of joy!The waitress who served us was lovely and genuine. She explained the menu and took our drink orders before coming back to take care of our food orders too. All over in a flash, without any unnecessary waiting. Everything arrived quickly. We had both ordered lobster, one steamed and the other grilled. Not particularly large by any standards but generous enough for London and at £20 each I was silently sending a prayer out to all those who order £20 burgers (I'm not judging you but I'm glad I'm not you.)My only complaint is that the seating isn't very comfortable. High bar stools made it awkward, especially given the hands on nature of almost everything on the menu. Can't comment on the cocktails I'm afraid as I didn't want to bankrupt myself. All in all a great experience but not necessarily one I'd want to repeat. Another one off my London foodie bucket list though!N.B. Since my visit it's come to my attention that the prices have gone up. It's now £25.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "llrwTkcI8u1hRADL-5Lj_g"
  },
  "JiR8hI_7kIMCFUYcB_knhg": {
    "date": "7/22/2014",
    "text": "In one word, phenomenal.A friend and I went for lunch right at noon; contrary to what other people had warned, there was no queue at all, so we were seated right away. Therefore, takeaway number one: go as early or close to the opening time as you can to avoid waiting.We both ordered lobster rolls, and they were lipsmacking good.  First, I was very pleased with how much lobster meat they packed into the roll.  Second, the buttered brioche roll was fabulous.  I could have eaten just that and felt very happy, seriously.  Finally, they do amazing FRIES -- not chips.  I feel like this was a great decision on their part because otherwise, the meal overall would have felt too heavy.Haven't tried the lobster by itself or the beef burger yet, but I'd be more than happy to go back -- again and again.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "OWopnQMPtA3gkdOeMtTFGg": {
    "date": "6/21/2016",
    "text": "Stopped by after work on a Tuesday evening and the place was packed. Sat at the bar, where you can get the whole menu and the added bonus of checking out the cocktails.The lobster roll was great, tons of flavor in the seafood and the roll melted in your mouth.  The drinks are fairly priced for the quality of the liquor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-eMAqJlXCs9TPlUSJywR0A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-eMAqJlXCs9TPlUSJywR0A/o.jpg"
      },
      {
        "img_id": "3p6PnXwSG7f12oLoqH9EAg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Seasonal addition to the menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3p6PnXwSG7f12oLoqH9EAg/o.jpg"
      }
    ],
    "user_id": "A-Ik_Lv_k8RSITOEvGiUUg"
  },
  "ZrrH0Yu4N_xTypyK8Z4qyg": {
    "date": "8/22/2017",
    "text": "This place was incredible. Food and service was outstanding. Wait staff was welcoming.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QVL3-BapAv9UhUMhooYtMQ"
  },
  "FAHCTKc13INqieV6fETjXg": {
    "date": "8/28/2017",
    "text": "This place was fantastic! Close to Hyde Park, it made for a perfect lunch spot. My husband has both gluten and dairy allergies and our waitress was very knowledgeable, friendly and accommodating. Not to mention, the food was fantastic and did not disappoint.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOMnsDL3RB3w0qQLbzMPfw"
  },
  "gvHIYyV4aEhIwlrCsZrVFw": {
    "date": "9/14/2017",
    "text": "This is a must in London, recommended for lunch. Go for the Lobster or the Lobster roll, interesting concept.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpmC57AGKXUGSWFygNzmow"
  },
  "dTJfvrE16WUbRWybK_ZHkw": {
    "date": "8/22/2014",
    "text": "I've been meaning to try out Burger & Lobster for a while now. I've only been stymied by the price - I know £20 for a whole lobster is a good deal, but I knew I'd not be up for all the work of getting the meat out of the shell, so it seemed a bit steep for a cold lobster roll. But finally I could take it no more and succumbed. We were going to a nearby hotel for a gala movie screening (as you do) so we were quite early - 5.15pm - and got a table right away. When we left an hour later, there was a small queue.I've only had lobster on cruise ships, which is by all accounts, a rubbery affair. Still tasty, but nothing to write home about. I've had a lovely lobster roll from B.O.B.'s Lobster in the past but not a lot of experience with lobster in general. So I wasn't too sure what to expect.I had a bit of a strop when my husband looked puzzled about the lack of a menu. I explained it to him and he was still just, well, puzzled. Finally the much more patient waitress came to help the table next to us and he heard her spiel and the penny dropped. We both ordered lobster rolls with a coke.The food came quickly, with chips, salad, the lobster roll, and (not nearly enough) garlic butter. The garlic butter was really, really nice and both of us were dipping our chips into it. Why have I never put butter on chips before!? Oh yeah, the hope to live to 40.The lobster was so soft, without a strong taste one way or the other. The brioche was the star of the sandwich, buttery and savoury and more like a big slice of Texas toast than a bun (that is, no bun-like crust messing it all up, except at the edges). Neither of us could finish our rolls, and I barely made a dent in the fries either.The not-so-great bits were that the fries were oversalted, and I had shell in my roll and my husband had some cartilage in his. As tasty as it was, I still maintain that it's a bit expensive - our meal with the 2 cokes was over £50, as they do put a 12.5% service charge on. The service was fine and the waitress deserved it but it just makes for a bit of sticker shock. It's not that it's overpriced as such, just that lobster is expensive, so it will have to remain a special treat (and my arteries will thank me!)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ofu6GfDfKoegSbtgaMKcQw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ofu6GfDfKoegSbtgaMKcQw/o.jpg"
      }
    ],
    "user_id": "IiojkDLHYdkfTJlINzUv-Q"
  },
  "7W0T7psKL0R9UmLRsgFWQw": {
    "date": "12/16/2015",
    "text": "I went to Burger and Lobster during my trip to London. Simplest menu I've ever seen - you can either get a burger, a lobster in shell, or a lobster roll all for 20 pounds and it comes with a small salad and fries. I had the lobster roll which was fantastic. There were two dessert options  so my friend and I ordered one of each - a chocolate mousse and a cheesecake - both good but not particularly memorable.Overall: Come for the lobster and simplicity.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9k-nhREpDVclntKZ0SjziA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster Rolll, Salad, Fries.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9k-nhREpDVclntKZ0SjziA/o.jpg"
      }
    ],
    "user_id": "AaNxjSXd-7QkRoE9IUmFag"
  },
  "g6aFYOWjy7SzL5Br7mUCYA": {
    "date": "7/2/2017",
    "text": "Just what the name describes- only burgers and lobster. Done very well! Loved each part of the dish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYuIY3whB7mU1W10ROZw3A"
  },
  "xCpu4l4-3__HxMZBilk6IA": {
    "date": "10/16/2016",
    "text": "Why don't they just call it Blobster? Did my research and was rewarded with this find. It's no wonder this place has grown into a few locations - the restaurant delivers in every way. Both the burger and the lobster end of things were first rate, service was friendly, and the atmosphere was cozy. We got there at 5:30 PM on a Sunday, by 6:30 there was a wait. That's 17:30 and 18:30 to you Brits. £26 for the classic lobster, £28 for the burger/lobster combo. Great £4 draught pale ale. 75% younger Chinese clientele when I was there. They say China's minting a new billionaire every 5 days,",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4Mos3ZeuUkb9ekQO7fbnQ"
  },
  "9XKenyrZq0ABiE680g7fog": {
    "date": "8/11/2016",
    "text": "My husband, tween, teen and I came here for our first meal in London.  Directly off the plane, we were hungry and being American, we thought a burger would hit the spot.  The atmosphere was so fun...great music, high energy and a lot of interesting people.  The food menu is focused on burgers and lobster.  We didn't try the lobster but vowed to do so next time.  The bar has a veryhealthy variety, so you will find something good.  My kids got the Mayfairs with all the fixings on the side.  As Americans, we aren't super familiar with \"burger sauce.\" :)  My husband and I got the Orginals.  We are burger eaters, and we thought these were delicious!  You will not be disappointed!  Even better than the food was the staff.  Donna was such a fantastic server, answering our food questions as well as our London tourist questions.  She was so friendly and made our first London experience so enjoyable!  Jamie was also super friendly and directed us around Piccadilly for shopping.  A shout out to Remy too for fun conversation!  Ben was the manager that night and came to our table to check in on us.  We could not have felt more welcome and we can't wait to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kznHg_G4_geaZUdIqpq8Tw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The food menu.  The California is lettuce wrapped.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kznHg_G4_geaZUdIqpq8Tw/o.jpg"
      },
      {
        "img_id": "oC78d2LQdStEeez5-1YvHg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oC78d2LQdStEeez5-1YvHg/o.jpg"
      },
      {
        "img_id": "2p4JFe_j1MFZ4uJv-Svkdw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The Mayfair with all the fixings on the side for picky eaters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2p4JFe_j1MFZ4uJv-Svkdw/o.jpg"
      }
    ],
    "user_id": "cMW9owekhmRxY-bF8o0zUw"
  },
  "8ahykKwz1xCJE7Gekk6q7w": {
    "date": "2/1/2017",
    "text": "So much fun in this casual and comfortable restaurant. I was alone on business in London and the service and greeting was warm receptive. It really made the experience enjoyable but also important the lobster roll - Samari style and French fries was delicious. Try it!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ydkQC3x1Htn66_7oyZgT_Q"
  },
  "g3q8froGo14qMTtWZV-big": {
    "date": "8/27/2018",
    "text": "3.5 stars - not worth the price. For two of us, it was $108 US dollars for a hamburger with fries and for me it was the burger and lobster.  The service was slow and trying to get a refill on ice tea was quite challenging. We asked for a little more drawn butter and the manager said sure, took a very long time to get it to us and then went on to charge us for the additional serving of butter. We had to ask several times for the ice tea refill and a few times to get the check. We like trying new places and based on the other Yelp reviews we gave them our business. We do not recommend this place as there are plenty of other fantastic and less expensive places. We should have known when we walked in and didn't see any locals.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "haQ32hGl2Qp2n7zpZTZNHA"
  },
  "HHyr3pxYM41psedWBEUrRA": {
    "date": "7/29/2017",
    "text": "I left my heart in London. The burger was so succulent and moist that it brought tears to my eyes when I finished. Burger is almost a worthy contender against the in n out burger back in California(still my all time favorite burger spot). I had the steamed lobster and it was cooked to perfection. Their special garlic butter sauce is absolutely mouth watering. Staff was very friendly and very accommodating. I cant wait to come back for B+L!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S85fdayQ2MzM72KPAfmZ8A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S85fdayQ2MzM72KPAfmZ8A/o.jpg"
      },
      {
        "img_id": "ClKFRzJD03bheviW1jZ8RQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger and lobster combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ClKFRzJD03bheviW1jZ8RQ/o.jpg"
      }
    ],
    "user_id": "jQb8dI1KDDTbQgI61q09tw"
  },
  "_uC0ZVSNqFQF4ZcAZiVa1A": {
    "date": "8/11/2017",
    "text": "If you like lobsters, then you are going to love this place. Famous lobster chain of restaurants all over London with cheap lobster and chips. Apart from lobster though, they don't actually offer anything elso so special. Having tried just burger and chips, I would say that they are overpriced and nothing special about. Recommended only for lobster lovers!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1C3HSq-tH6AqjMQboFa-WA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1C3HSq-tH6AqjMQboFa-WA/o.jpg"
      },
      {
        "img_id": "Vr7RhrD7iPRyNnlpdC813Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vr7RhrD7iPRyNnlpdC813Q/o.jpg"
      }
    ],
    "user_id": "FnD5qaHuQjkzz6g-gtL2SA"
  },
  "5mnka2-UImoFTDTtuUXoAg": {
    "date": "3/26/2018",
    "text": "After spending several days in Germany, I was ready for  great burger. I ordered the burger meal (no lobster) while seated at the bar. The only reason I couldn't give 5 stars...the bun was not warm, (almost cool), which is a deal-breaker for me. I'll definitely go back and will plan to request a warm bun. Worth a visit, especially if you have a craving.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sdef73lpWmXLh2Uj9PeI0g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sdef73lpWmXLh2Uj9PeI0g/o.jpg"
      }
    ],
    "user_id": "80jF5vBRN1JhnzXi37otSw"
  },
  "gSrM_7NCYeN8MKOGiTHsdw": {
    "date": "9/29/2016",
    "text": "I really really really liked this place.sat at the bar and radha was awesome. i got the lobster roll as I'm weak for them. it was fantastic portion, fair, and the bread was superb. I'm not the biggest fan of thin fries, think McDonald's, but these were fresh and piping hot. I really wish their menu was larger as I would love to see them execute a bunch of other things. I really want to see how good the burger is after trying this place. menu is tiny but what they do, they do it wellORDER: wait staffJEANS: OK by far",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "l304vLcN5v3i3bdOBdCFmQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l304vLcN5v3i3bdOBdCFmQ/o.jpg"
      }
    ],
    "user_id": "vNkhTRxSnpLUYi0zRSt30Q"
  },
  "D7us1LEKmRr0nAtRB6DyHQ": {
    "date": "7/29/2016",
    "text": "First of all, you cannot book a table therefore be prepared to queue. Luckily, it was just two of us and we had an option to sit at the bar which we took. The service was good and waiters were friendly.There are two options which makes choosing something really easy. I hate long menus and many choices. So, I had the lobster roll. I also chose a cocktail which I can't remember. The lobster roll was yummy as were the fries and everything else. The cocktail was okay. I left leaving B&L hungry. I don't think the value of this place or at least for the lobster roll is that great which is the main reason why I give it a 3 and probably why I wouldn't come here again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F33aVyPCgvqKMLm6OqrfNg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F33aVyPCgvqKMLm6OqrfNg/o.jpg"
      }
    ],
    "user_id": "pMxAeLHIklIgwyJ_gDdBCw"
  },
  "5CpoLzCvRL3KjSrx2uAQUg": {
    "date": "6/8/2016",
    "text": "I was in the area and arrived right around opening at noon so there was no wait. I was seated at the bar and the bartender immediately noticed my American accent. We got to taking about the restaurant and its origins. This is the original location of burger and lobster so if you want to see where it all began, come here. I ordered the steamed (also available in grilled) half lobster and it came with fries and a small salad. The butter sauce was amazing and should be drizzled on everything. Their concept is quite simple which explains their huge success and opening off their New York location. Given its only over the pond, if there isn't demand the brand would fail. Luckily they did things right and I'm looking forward to coming back again to this chain. Don't worry about getting down and dirty. Thats how you should be eating seafood. There's nothing more romantic than cracking the shell off a lobster so man up and dig in. Everyone else is doing it. I left with a lighter wallet (London is a very expensive city) but the food was great and I would so it again. The waiter was kind enough to give me an extra bib and an Oyster card sleeve to take home with me. It was his third day on the job. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ax_VUoRAiebckO8w2ENeEw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Oyster card pouch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ax_VUoRAiebckO8w2ENeEw/o.jpg"
      }
    ],
    "user_id": "MVQCzaDxDr0JFefXrE38qw"
  },
  "HHTqTzdpSRlT7zGdk7MEPg": {
    "date": "9/2/2018",
    "text": "Definitely a great place to grab a bite. A little on the expensive side but food is worth it. I had the calamari first and had the lobster roll afterwards. Calamari came as a smaller dish than I expected but the flavors we're great. Crunchy and seasoned properly, the dish came with a lemon aioli and marinara sauce. The calamari itself had a small kick to it that gave dipping it in the sauces a refreshing taste. Next was the Lobster slider. Fries, a salad, the lobster roll and a sauce container of garlic butter. Fries were seasoned and plentiful. The salad was a spring mix with red onion. The dressing was a balsamic vinegar and oil. It was them sprinkled with parmesan. The lobster roll was served on a butter toasted brioche toll. A moderate amount of lobster salad in it. The roll itself was crunchy and the lobster salad was creamy and delicious. The salad left me wanting more and the fries were more than enough to complete the meal. I dipped the lobster roll in the garlic butter and it was magical. Last as a drink I got a Mandarin, pineapple, and lime drink. A lot of ice and not a lot of juice. For £5 , it should have had less ice and more drink. Aside from that I would recommend this place to others.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6RDUm06vj3AvwFgszqpww"
  },
  "t-gMtt-AtzqgcTAzjygg7w": {
    "date": "10/15/2017",
    "text": "Fun place to eat. Good burgers and fries. Sort of loud though, so expect that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0U4GUP3UKxJ9ZR9t8OiYHw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0U4GUP3UKxJ9ZR9t8OiYHw/o.jpg"
      }
    ],
    "user_id": "mtVsTE9pyOsY2xCuRRFCvw"
  },
  "CzJnEeUYEMkuEZZaWByZ4A": {
    "date": "12/24/2017",
    "text": "I have been here a couple times while visiting London.  There is usually a 30 min wait, but the lobster is worth the wait.  On my first trip, each item whether it was a burger or lobster (steamed is best since it keeps the meat moist) was 20 pounds.  The butter sauce is rich and a good complement to the lobster.  Now the burger is less expensive than the lobster, but still worth the price. The fries are crispy.  The meal was very filling, although it doesn't initially look that way.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "55CthR5W3UVo8UUt5kPyYg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/55CthR5W3UVo8UUt5kPyYg/o.jpg"
      }
    ],
    "user_id": "VkIvu6D8fnzBZg1wu2OPvA"
  },
  "D5uL3eXcrp-IsuPkwB1CHQ": {
    "date": "9/2/2017",
    "text": "Awesome. Great prices. Great service. I need to work on opening one of these in Dallas!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b8hppd1ylzvniyzfaymx1A",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b8hppd1ylzvniyzfaymx1A/o.jpg"
      }
    ],
    "user_id": "FRagcNGwEkfjSI1Vi0IokA"
  },
  "1p9XkCSZXsy1r3dse8Qe1w": {
    "date": "11/27/2016",
    "text": "Food:  My wife and I tried the burger and lobster combo, who would had thought this pairing would work.  The hamburger was pretty decent and the lobster was delightful.  Food rating:  4/5Service:  Service was standard and friendly.Service rating:  4/5Price:  Expect to pay about ~$25 for the larger size hamburger and I think $30 for the smaller lobster.Overall:  I enjoyed my dinner and a great place to warm up after the cold rainy day.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "423l3W4J98LLXnSyJ1ofvQ"
  },
  "0FnJihgW0LyQfqsq3K6vww": {
    "date": "8/12/2017",
    "text": "Interesting concept for a restaurant. We visited 2 locations while we were in LondonFood was great!  Try the lobster burger or the lobster and burger comboThe beef quality is good and the lobsters are nice sized too. It can get pricey quick - check the menu prices. Full bar and good beer and wine offerings. My two children enjoyed their dinner as well - though there is no kids menu.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vMDSZLWhvpvyh1uA8gNNsg"
  },
  "wNxTfhoQsdlMwUhueDQyOw": {
    "date": "1/7/2017",
    "text": "We were impressed with the food quality, portion and service here. Ordered Chili Lobster, several burgers, lobster rolls - everything was very good and delicious! About 27£ per person.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PbwyqwgrlC6NLZb_amm8ng",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PbwyqwgrlC6NLZb_amm8ng/o.jpg"
      },
      {
        "img_id": "OC3ewX0nUlOBMqKWjycN0w",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OC3ewX0nUlOBMqKWjycN0w/o.jpg"
      },
      {
        "img_id": "sod6BFjnaEHRwYVAlRsEcw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sod6BFjnaEHRwYVAlRsEcw/o.jpg"
      }
    ],
    "user_id": "xnsUP5pZmT54ZML3oObVlw"
  },
  "qr9HfLYX87Tp_9LAhJv1rg": {
    "date": "2/23/2018",
    "text": "Delicious. Fast and friendly service. The lobster roll was fantastic. Couple of good cocktails too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NzAW6wNwuz_vPfpT9Dbqlw"
  },
  "KeOaG0C1L6_1yZU6MgbV8w": {
    "date": "12/10/2016",
    "text": "After a long days walk around town decided to find this original spot for dinner.Got seated last minute for late night weekday dinner, no problem with group of 5.Lobster original and rolls ordered.  Dip was excellent, chips were just ok, I like it very crispy no this was a bit soggy.Restroom at the back.Price is average to high side for what you get.Burger was just so-so to me.   I'd skip that for the lobster or do combo deal if you really want it.Service charge automatically added,  everyone seemed satisfied.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PTSTr8afRAiZNT6gCLSy7Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Combo (small burger and small lobster). 11/16",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PTSTr8afRAiZNT6gCLSy7Q/o.jpg"
      }
    ],
    "user_id": "rK2t1HGJWaMIZr5L6qhbEQ"
  },
  "usgfZbmftzSQO9DY6poELQ": {
    "date": "3/10/2018",
    "text": "YES! As an American visiting London, this was such a delicious experience. Our darling server was from Poland was was absolutely lovely. We got the (not) porn star martinis - yummy! - but very sweet and could only drink one. Next up, i got the lobster roll and it was just as good as any lobster roll I've ever had, if not better. The spicy burger was great, as well! The portions are large (sandwich, fries, and a salad). Was thrilled to hear they have locations in NYC!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QVfS_F6aXnFMfqhCm7lzWg"
  },
  "MT9xkCHT5R3E-m5T9bcvdg": {
    "date": "7/7/2017",
    "text": "Read about B & L on Yelp. Figured we'd give it a go. In a word: Wow! Great atmosphere (warm, casual, efficient) and terrific food. My husband had the burger and lobster combo while I chose the lobster burger (beef cooked to  order, with lobster piled on it). Sublime. Pricey: dinner for two just shy of $100 (3 beers). Plenty of locals and visitors, alike. All treated like an old friend. Highly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DHMwzufL5OWzTdT4V3Y8PA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DHMwzufL5OWzTdT4V3Y8PA/o.jpg"
      },
      {
        "img_id": "F3ifNB61Dvt1LtJHOv4imA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F3ifNB61Dvt1LtJHOv4imA/o.jpg"
      }
    ],
    "user_id": "FeVWjIzTODnHnEdHgxfWzg"
  },
  "7byzDXyMrNIqRUxWKfFWgg": {
    "date": "10/9/2015",
    "text": "This is a place I bookmarked before going to London too.  The first night we arrived in London, we came to this place for dinner and the place was pack.  Make reservations if you want to come!  We waited a little over 30 mins for a table.  They give you a choice to put your name and number down and they will call when your table is ready.. or you can just wait there.  Since the beau and I both don't drink, we decided to waited there.There are only 3 items on the menu... burger, lobster (grilled or boiled), or lobster roll all for the price of 20 pounds each.  We both ordered the lobster roll. The dish came with fries and a salad.  Yummy.  I love the bun the lobster roll came in and the fries were also delicious! I would have to say that this is the most delicious meal we had in London.  Its a bit on the pricier side...but everything in London is expensive.  Our total came up to 43 pounds and after the conversion, the total came up to $70 USD.  If you are in London, you have to try this place out!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iupNY71z1H5y_EdT0NKhNQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster Roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iupNY71z1H5y_EdT0NKhNQ/o.jpg"
      }
    ],
    "user_id": "RQdoj8zcU5T8VjYLw3XczA"
  },
  "F3K339Yr9q4p0_KCG5lPig": {
    "date": "6/27/2017",
    "text": "first time at burger & lobster. Pricer than expected (lobster roll was £25, 2 lb lobster was £40) but the food is excellent. Casual, hip setting. Deducting 1 star for the price to food worth.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m_x3JqsncJOhfbEGjRy7Zg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster roll, 25",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m_x3JqsncJOhfbEGjRy7Zg/o.jpg"
      },
      {
        "img_id": "yWXKepU9B4GB6TbEWwVh5g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. 2 lb lobster, 40",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yWXKepU9B4GB6TbEWwVh5g/o.jpg"
      },
      {
        "img_id": "_xwvNccSbWJWwEgAYsFqZg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_xwvNccSbWJWwEgAYsFqZg/o.jpg"
      }
    ],
    "user_id": "soyS0c-gJ2Jon3K-1vIEAw"
  },
  "fApBhTpQdTRBouW7UJEIyQ": {
    "date": "11/10/2018",
    "text": "Ate at Burger and Lobster while in London a short bit ago. Amazing burger creations. Food was great and the only problem with the place is it's tough to decide what to get out of unique selections. Ended up going here after just being out and about for the day taking in some of the typical tourist sites. Glad I made the slight detour after seeing the photos and reviews on Yelp for it. The place was crowded when I arrived (late lunch on a Friday), but was able to get a seat at the bar quickly. Service was attentive and everyone in the place seemed to be enjoying themselves. Great atmosphere and great food. Highly recommend it if you get the chance to stop in for a burger.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LePcrzpsELgUl0_hbuuJqw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster burger with chips. Burger might not look that \"big\" round wise, but it was a thick burger.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LePcrzpsELgUl0_hbuuJqw/o.jpg"
      }
    ],
    "user_id": "W1SZXWe40aSz1wGLMwvCpw"
  },
  "PR1aFwdo6IjJez6ip49i5g": {
    "date": "11/26/2018",
    "text": "It reminds me Red Lobster but definitely with an higher quality. Living in NY and eating an hamburger from Nebraska and a lobster from Canada is not what I would experience in London, but my girlfriend asked for and I have no regret. The lobster was nicely cooked, the hamburger tasty and the service quick. The place was very crowded and the atmosphere nice. It definitely doesn't come at a cheap price but it's reasonable for this kind of restaurants.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4mMMEwXZqV1BZyRo4r-vBw"
  },
  "LHV48ylL7wvnpq9ZjYHEQA": {
    "date": "10/29/2018",
    "text": "This is a chain that offered, well, burgers and lobsters.  The choices were few and the meals fulfilling, satisfying, enjoyable, and messy.  I only wished their beer selection was bigger.  Don't be fooled by the cheap deco, the bill is not.There is really only one kind of burger and it's way over-priced.  I recommend coming here really for lobster only.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UXiUoGFr65lBxsPNQMSqjQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Combo lobster.  This is the one to order.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UXiUoGFr65lBxsPNQMSqjQ/o.jpg"
      }
    ],
    "user_id": "addFMW60hnUvayu7ynh_xg"
  },
  "tZypnR5T8x-bqI8UwR2t_w": {
    "date": "11/11/2018",
    "text": "Ordered \"The Beast\". Consists of a 10 oz patty imported from the US and lobster. Great tasting and finished the whole thing. Suggest using the place mat to tame this beast as it is over 4 1/2\" thick.  It cheap eats, but trendy and a great experience.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GzwjJe9EWUMsM6PR1rZi3g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GzwjJe9EWUMsM6PR1rZi3g/o.jpg"
      },
      {
        "img_id": "1UVUxR4nx_G3p0LpI0fpIA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1UVUxR4nx_G3p0LpI0fpIA/o.jpg"
      }
    ],
    "user_id": "UIfnk2trF0XZIIBC5g4I2A"
  },
  "TNb0zC0T9QEZX6JuyimkBw": {
    "date": "7/1/2018",
    "text": "Burger & Lobster started in London and my cousin raved about it so we stopped in for a meal. There are multiple locations but we ended up at this one, which was near Buckingham Palace. We were lucky to be there during the national lobster day, which means that if we buy a whole giant lobster, we get a free bottle of prosecco and unlimited sides of salad and fries.The 1.7kg lobster ran me 85 British pounds. It was indeed huge and the quality was amazing. We got half grilled and half boiled lobster. The lobster comes with unlimited garlic butter sauce. The lobster was fresh and the flesh was very firm and sweet. Between the 2 types of cooking method, I definitely preferred the boiled but both were delicious.The service here is alright. Everyone is super nice but it's extremely busy so it's hard to get somebody's attention at times. I recommend arriving around opening time to minimize the wait time as the wait can get really long.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "9lXgNWJQbGO6Qpj_ZCBnkg"
  },
  "3fhDOxgnMnry04BhDRpYBg": {
    "date": "11/27/2018",
    "text": "Nice place to have burger. The food is delicious and not too pricey. Little busy sometimes but enjoyed it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0VclMrVUYAR-rPlSLsoMw"
  },
  "IZcHR6MOfMu8dcOGvp3d5w": {
    "date": "12/5/2017",
    "text": "First meal in London! There are a number of locations in London, but this one was a super convenient 6-minute walk from our hotel. We opted to sit at the bar to avoid the 15 minute wait for a table. Our first task was ordering cocktails. I chose the BL Burger Bellini (£9), which had strawberry, hibiscus, lemon, and fizz. A lovely drink even in the dead of early winter. My BF got the B&L does Gin & tonic (£9), a twist on a classic gin and tonic with peach, grapefruit, and cucumber tonic. We decided to get the B&L combo, which is a 1.26 lb lobster and a 5 oz burger for £36. If you're going to come to Burger & Lobster, how can you not order the two quintessential menu items that this restaurant specializes in? We chose the lobster to be grilled. It's also served with a salad and chips (French fries for us Americans). Both the burger and the lobster were phenomenal. Cooked to perfection, oozing with juices and melted butter. It was like a symphony exploded into song in my mouth. So mouth-wateringly delicious. Chatting a bit with our server/bartender, we found out that this is actually a small global chain. There are even a couple of locations in NYC. They get their beef from a farm in Nebraska, and the lobster is sourced from Nova Scotia. Excellent food and great service. We will have to try the ones in NYC next!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "Nr2nibp1Oya1MPsuAgqB9A"
  },
  "CPLrrthar7vEiPOt52Klhw": {
    "date": "5/7/2018",
    "text": "Amazing amazing lobster! Flown in weekly from Maine. Was really fresh! And the garlic butter with chives - omg I've never had any sauce this tasty before! The fries were perfect! Even the salad was good, and I'm not usually a big salad fan. Fresh greens, great balsamic dressing, tangy and slightly sweet. Sat at the bar, and the service was friendly and attentive but not overbearing. Will definitely be coming back!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7q7dO1NDYf4GQ0k-WnfGsw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7q7dO1NDYf4GQ0k-WnfGsw/o.jpg"
      }
    ],
    "user_id": "uH7Hcg39dXqzhyg6QurKYg"
  },
  "_42cGNFDGtlGcmlr1R-tfQ": {
    "date": "3/12/2018",
    "text": "Yum!! The place was packed so do make reservations. Our server was fun and friendly. We had hors d'oeuvres at our hotel, so asked if we could split the burger and lobster combo. Not only was that okay, but when we hesitated over steamed versus grilled lobster, our waitress said she could do half and half! So we were served half a grilled lobster, half a steamed lobster, an amazingly delicious burger, and fries and a salad. I can't wait to go to NYC to visit my daughter and try out the Burgers and Lobster there!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fU15Mepj0Se-4O3ejXmpbA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Just HALF of the combo plate.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fU15Mepj0Se-4O3ejXmpbA/o.jpg"
      }
    ],
    "user_id": "jsQrtbl5y4F68dD1AyQ6-A"
  },
  "cGBCOzdXInWifF9G4gFMhA": {
    "date": "1/9/2018",
    "text": "Located at the top floor of Harvey Nichols, this is a great place to grab some lunch while shopping here or in the area. Burger and Lobster is a chain that started in 2011 with 4 schoolmates on a rooftop in London wanted to create a place that specialized in 1-2 main ingredients. In a small Irish Pub in Mayfair is where the first Burger and Lobster was started. Now it has expanded to many locations worldwide. London has 9 locations. The menu is simple: 1. Starter -Croquette, calamari, prawn, or dip. 2. Pick a main course (comes with chips and salad)       Lobster (1 lb vs. 1.5 lb vs. Chili)        Roll - Singapore or Original        Burger - Original, California, or Lobster        Combo (5 oz Burger and 1 lb. Lobster )  3. Dessert- Cheesecake, brownie, or Sundae. *Get a cocktail- they are quiet good. The quality of the food is excellent, especially for a chain restaurant. Simple and delicious. Also, big portions. Ricky had to help me finish my meal.  Recommend for a solid lunch option.",
    "rating": 5.0,
    "rated": {
      "useful": 13,
      "funny": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "yR8-A4646jdmtkFqxETANQ"
  },
  "OmicVOv_Q0kH0UjN7rUdxQ": {
    "date": "7/23/2018",
    "text": "Brilliant food. I ordered a combo set with beef burger and lobster. The burger is big and delicious. Lobster tastes well too. Two people cost 87 pounds. We will come here next time.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BVBhXwutJ0T8XBItQD9_rg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BVBhXwutJ0T8XBItQD9_rg/o.jpg"
      },
      {
        "img_id": "j5wK7gPhlIIzxv1D53_qGw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j5wK7gPhlIIzxv1D53_qGw/o.jpg"
      }
    ],
    "user_id": "mgbdF09iLSOhbEedGeYzZQ"
  },
  "Yini3tFRPEb3GFbjYN_prw": {
    "date": "11/9/2018",
    "text": "Great lobster! Friendly staff! Please order the croquettes! You won't be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IMRQzKipfCtpLi7IVSaIcA"
  },
  "FIIYz9BE4_DwPqqid5CdbQ": {
    "date": "11/7/2018",
    "text": "Came here for the first time as a treat for my birthday, burgers and lobsters are two of my favourite food items, and it really didn't disappoint! The staff were friendly and didn't mind me asking for amendments.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zsFh2XaKH-oGLin_cvgssA"
  },
  "aQ7XmvpGpWVqNe0bVeljXw": {
    "date": "6/8/2017",
    "text": "You get just what the name says...burgers or lobster. Both are delicious. I could see why a local London friend recommended. The limited menu keeps the food moving swiftly, the ingredients are simple and high quality. The restaurant is boisterous and the bar was active when I was there. I'd definitely return.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HHBkyqhj5oUtEr5TXvi6UA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger and lobster combination",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HHBkyqhj5oUtEr5TXvi6UA/o.jpg"
      },
      {
        "img_id": "3aMY-s7h3ZzEp_IPJVnZUQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3aMY-s7h3ZzEp_IPJVnZUQ/o.jpg"
      }
    ],
    "user_id": "5xxI2JMKSyPNCLpXOgPaig"
  },
  "HuJKSo66896uEoxfl6qBCQ": {
    "date": "11/28/2017",
    "text": "We came to London for 5 days/4 nights, and we ate here THREE TIMES. Probably not the most touristy thing to do (like, why didn't we try more restaurants?!) but it was SO GOOD we just couldn't help it!We ended up there our first night in London because it had good reviews and was within walking distance of The Ritz, where we stayed. We sat at the bar because it was 5pm & convenient, but then learned that was the easiest place to get in for dinner. (There were lines out the door for tables the other two times we came in. Pro tip: get there before 5 to beat the work crowd; have a drink or two at the bar and then order dinner.)The first time, I ordered a lobster roll; the second time I had a burger (just to try it--DELICIOUS); and then I the last time I had another lobster roll. For me, I would probably go for the lobster roll because that's a little harder to get than a good cheeseburger where I live. BUT, you can't go wrong with anything on the menu, really.I wish I remembered our bartender's name from the first night; he made THE BEST old fashioneds and whiskey sours. The other ones we had weren't bad, but the first guy really finessed the drinks, and we could tell.UGH, my mouth is watering just thinking about this place...",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e4SbMdTklg2hk4tKrIx1bA"
  },
  "s6CpgAO2kg-20y58EYf-QQ": {
    "date": "3/27/2017",
    "text": "Burgers or Lobster that's it! Can't decide...get both! Came here for lunch while visiting London and  honestly there isn't much I can add that hasn't already been said in all the other Yelp reviews except beware of the sneaky service charge. I didn't mind because the food and service is great! I ordered the lobster roll since that's what the fuss seems to be all about.  My lobster was fresh and dressed well. The chips (fries) and salad that comes with it was also delicious. I sat at the bar and the service was attentive and prompt.  This place comes off as upscale because of the decor and price tag however the simplicity of the menu allows for a laid back and casual dining experience. It really is a kick back and enjoy yourself type vibe.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "b9r84Cxqbwd7YWpaoDE3yw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The famous Lobster Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b9r84Cxqbwd7YWpaoDE3yw/o.jpg"
      },
      {
        "img_id": "PewXv3vo-j1pRQYKcoZqeg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Awesome cider!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PewXv3vo-j1pRQYKcoZqeg/o.jpg"
      }
    ],
    "user_id": "8j_g5iy_pKiJgohWtXLzVA"
  },
  "gUtxh8Y4mp4HB7HUuYtvBw": {
    "date": "9/27/2017",
    "text": "I would give 1 star since the only thing I showed for wasn't available as the grill was down AND the service was surly upon our arrival at 20 minutes before but we walked around the blocks and get to hang out a decent coffee shop while people watching.I didn't notice this, even with the signage in the bathroom translated in a number of languages, the bestie picked up on this spot was heavily patronized by Asians. Nothing good nor bad - just a point of information. I'm used to it for crawfish in LA and even GA - they deep but I wonder if they have any complaints about the seasoning or taste of the seafood. Like the Vietnamese on the Westbank of New Orleans cook their shellfish like a true Louisianian - all spicy and muah. This was priced higher than I anticipated and wouldn't pay for what I had if I had to do it again. People please KNOW: I took a train ride from the airport. Black car to Buckingham. Walked from Buckingham to this location all with backpacks on our backs and couldn't be allowed to sit and wait for 20 minutes until they officially opened. Ok whatever, we waited at a coffee shop found two blocks over, tried to get a massage across the street from the restaurant and was told no one was on duty but they could get me tomorrow....Bestie said it was for men not for me. lolzEither way, returned 10 minutes after opening and the place was packed. Take it for what you need it to be. Again, I'm butt hurt the grill was on the fritz and no one seemed bothered by it all.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "lF_tYvWuDnfkj7ItMLdssg": {
    "date": "5/8/2017",
    "text": "Everything here is SO good!!! If you like lobster, you NEED to come to this place. Come and get a whole one pound lobster for less than 25 pounds! They also have an amazing lobster roll and omg their lobster burger is so good! All the things I love in this world were all packed in one burger - JUICY meat patty + flavorful lobster + Brie + truffle! Servers here are amazing too. Come here for great food, fun environment, and great service!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ElLhkAc3-iW_mCyQPf_MLg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ElLhkAc3-iW_mCyQPf_MLg/o.jpg"
      },
      {
        "img_id": "eGZWYNm2vzAZ4Q3osdO72Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster + burger combo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eGZWYNm2vzAZ4Q3osdO72Q/o.jpg"
      },
      {
        "img_id": "VJULs-uubcN_cHF1gHiubA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Signature lobster roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VJULs-uubcN_cHF1gHiubA/o.jpg"
      }
    ],
    "user_id": "fJTuckzbFBvjg-52Fc-oIg"
  },
  "fqZ2ugttRnYjX273Uv6Tog": {
    "date": "8/18/2018",
    "text": "Loved this place! A bit pricey but the service was wonderful and the food was delicious. I ordered the 1.75 lb lobster and it was huge and grilled perfectly. My wife got the burger and said it was the best one she had in all of London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTY7kZQ_6-ZSFJskd-kXSA"
  },
  "oYKJoFAEtx2Xe2U4NwecDQ": {
    "date": "10/1/2017",
    "text": "Lobster rolls are one of my favourite things, so I was more than happy to finally get to one of these after it being suggested to me. It's a chain, I famously rant about chains and try my best to stick to independents when I'm not with people who insist on ruddy Nando's (ugh!) and although the burgers are a little pricier to match the lobster I presume, the lobster is actually pretty cheap by lobster-y standard, and although I have had some amazing lobster in the past, this wasn't half bad at all. I plumped for the lobster burger, because I also love meat, and Brie and truffle, so all of those packed in with some nicely seasoned chips was pretty good. The staff were lovely, and I would rack this up as one of the less offensive chains.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PIqgaeMSEh7i0AmFgtCYOA"
  },
  "HXsx41YVonUeZKh-ZytmeQ": {
    "date": "2/12/2012",
    "text": "The year was 1992. Lieutenant Colonel Frank Slade (Al Pacino) takes Charlie Simms out to dinner to an upscale restaurant in New York (in the movie \"Scent of a woman\"). The burger cost $24. Who pays so much for a burger and where on earth do you get such expensive burgers ?Fast forward twenty years. The answer is \"Burger and Lobster\". This joint has been open for barely a couple of months I hear and is already a rage. I first attempted to visit last Thursday for dinner. My friend advised me to get there by six. What ! Anybody has dinner that early ? Enough people actually. When I reached at 6:15, there was already a two hour wait. Thankfully I slipped into the an extra chair with my friend as we converted a table for two to a three. If its a small group (four or less) and you want o be seated immediately, get here by six. If you are part of a larger group, then get here even earlier. They don't take reservations. The menu was limited. It's either burger, or lobster or lobster roll. They all cost the same ... £20. I went for the burger. It comes with cheese and bacon, if you so wish and one portion of chips and salad. You can ask for as many of the sides as you want for no extra cost. B&L have a very streamlined operational process and the food arrived very quickly (even before I got the drink). The burger was very big. The patty was made of tender, delicious meat and excellently cooked. The bacon was not too crisp and not too soggy, just perfect. It was more than enough to fill one person. The burger was great, but was it worth £20. I still wasn't sure ... and the crowd that we were seeing waiting at the bar ... was the burger the reason for this rage ? Must be the lobster, we decided. So I dropped in for a late lunch (2:15) two days later. It was crowded again, though slightly less so. At lunch they allow smaller groups to sit and order food from the bar, which is what I did ... The full lobster this time ... With molten lemon and garlic butter. The lobster was served steamed and cut open (they do provide a plier for the show). It was just divine. I was able to access parts of the animal which I have never been able to taste before (since its usually so difficult to handle). The meat was easy to scoop out and lobster to me has rarely tasted better. B&L won a promotion to 5 stars from 4 in my eyes. The chips here are not the very best (i.e, not as good as the ones at Hawksmoor), but pretty well done nevertheless. I finished the salad on both occasions ... so there isn't anything left to say about that except that it was good (the dressing was lovely). B&L have their drinks classified as being better with burger or lobster. But i ignored their classification and ordered the Gin fizz on my first visit. It's a cocktail that's not very common even in bar menus, let alone at restaurants. So I was pleasantly surprised to find that they had made it well. The next time I went for the Clarges Buck, a concoction made of Chivas Regal whiskey and several different kinds of fruit juices and syrups. It was tasty. The cocktails were priced at a reasonable £8-£9 range. For desserts you can get either the chocolate mocha mousse or the lemon mousse. I haven't tried them yet. One drink and food ends up costing around £32 here, which isn't very high. Coming here for a 6pm dinner might be difficult but I can foresee several Saturday lunches (they are closed on Sundays) here for me.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "rmOIuIROoX60AS7go0PYRA": {
    "date": "9/16/2012",
    "text": "Burger or Lobster?  Which is it and that's it.  This is perfect as I love burgers and this is on the list of places to visit in London. The burgers are big and look amazing but I was let down, the burger bun was some herb/seed induced annoyance which overpowered the meat, which was underwhelming.  Good service, busy, great vibe but ultimately it didn't satisfy me.  Change the bun, simple brioche bun, no herbs, no seeds then I'll come back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUKheMge-ONOb9_HwP-m-Q"
  },
  "-qUAD3oPZ5vP899TN2qHGw": {
    "date": "3/18/2015",
    "text": "the staff were very friendly and attentive, the wait was about an hour, which in my eyes wasnt really worth it, the food was average, but quite over priced, wouldnt really rate it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rbitb_oNoqxMcuPaEs-BmQ"
  },
  "HgJpN3YB3BiwGKboTRKU1Q": {
    "date": "5/14/2013",
    "text": "Good service,i didnt have to wait to be sitted-first time lucky i guess.no menu you get three choices!!so sit back and enjoy it!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pudOQDAO-iyPEEpVnqcZQ"
  },
  "7HtW3Pe7U_MOn2zbl519VQ": {
    "date": "12/25/2012",
    "text": "Disappointment. Lobster here is super value but was a bit overdone and uninspiring. They really pack in the tables, which is fine if you're after a raucous night out (as everyone else usually is). You'll probably find better burgers and lobsters elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eIehvAk7EpHjLbf3gCGRQQ"
  },
  "CU7YscA6moIFNQ6ocb6iRg": {
    "date": "3/29/2012",
    "text": "The concept itself is great, £20 for a grilled lobster. However the impression that lasts is the service and experience and the manager gave us probably the snootiest and rudest service we have ever experienced. A promise for a table 2 hour later turned out to be 3 hours and \"Actually I have no idea when you will get a table\". At his advice we waited at the bar and ordered our food so we could get started on our dinner so he decided without checking with us that we were no longer waiting for a table. His wait staff spilled hot butter all over our jacket which was fine as she was so apologetic, but he had no apology or offer to clean the jacket; instead told her off for trying to offer us some chips (afterall we had been waiting for 3 hours).   It was interesting to try but they better clean up their service else it's going downhill very quickly.  Wake up call: the no reservations policy doesn't work for a restaurant serving lobsters where people can take a long time to chew through. Burgers not worth having - go to Goodmans instead, nearly half the price and much better chips. How can the sister restaurant of Goodmans get it so wrong?  So far 8 of our friends have gone on 4 different occasions and we've agreed it's not worth the chaos and rude service.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3OBQXcE6lwfKNk9Sg9b8RA"
  },
  "GuSwiGtgjRUo2zJDy6K6pw": {
    "date": "1/28/2012",
    "text": "The BEST lobster place in London! Have not tried their burgers yet, so next time!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J1otPwOt4f79iEYdqm7p0Q"
  },
  "cQGdHabTcmmyITe3oBWvrg": {
    "date": "12/2/2013",
    "text": "I LOVE Burger and Lobster! This is a very straight forward place. All they serve is well burgers and lobster. When I first heard this I was a little disappointed. Don't let this get you down though. Because they only make 2 things, you better bet those 2 things are cooked to PERFECTION!! I ordered the burger. I have never had a burger that was so juicy and flavorful!! It came on a nice warm bun with delicious grilled onions, lettuce mix, and tomatoes!! Along with that it came with a side of skinny fries (or should I say chips), which were seasoned perfectly! I also believe it came with a small side salad, which amazingly was very delicious as well. My dad ordered the lobster, which was also juicy and melted in your mouth! Not only was the food scrumptious, but the service was pretty fabulous as well. Our server was very attentive and even gave us yanks some suggestions of what to do and see while in London. If you decide to go here I would suggest making a reservation, as this location is small and very popular. If you have to wait it is worth the wait!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_viFyBiq-9o0UHTTg7De8Q"
  },
  "N405Ee1T3L3JI-MTx8XiEg": {
    "date": "10/11/2012",
    "text": "This is definitely the place to come if you want to eat some decent lobster and feel like you've got yourself a bargain! £20 for a whole lobster is excellent value and it was tasty and cooked well! Really enjoyed the lobster.However, if you don't like lobster but are accompanying a friend/family that wants to eat lobster, you'll probably be quite disappointed by the burger that you get for £20. Good lobster, but I think that they should really lower the price of the burger!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6tXtj1rP4Fa3WcXZh4dSxg": {
    "date": "3/11/2012",
    "text": "Last night I found myself heading over to the recently opened Burger & Lobster, to see what the hype and queues were all about. From the team behind Goodman's Steakhouse (supposedly one of the best steaks in London), they've certainly stuck by the rules of keeping things simple. There's no food menu as such, except what has been scrawled on the chalk board, Burger or Lobster. Beef burger, whole lobster, or a lobster roll; all served with fries and salad for £20 a pop. For me, there was only one thing to order, and that was the Lobster. Grilled and served with a side of lemon-garlic butter. But for my friend, a self confessed lobster virgin, as he wasn't a fan of crab nor the idea of extracting his supper from the shells, opted for the Beef burger. With our Prosecco and delicious cocktail of Gin, Cucumber and Chamomile syrup in hand, our waiter swiftly brought out our meals on silver trays. My lobster definitely looked impressive. Taste-wise, the meat was sweet and perfectly grilled with a firm chunky texture. However, the accompanying lemon-garlic butter was lacking the lemon tang or the garlic flavour, and it probably could have done with a bit of salt, and a dash of tabasco sauce. My friends burger just looked OK, and probably not worth the money compared with the whole meaty lobster I had in front of me. I'm pretty sure he would have had food envy! Overall, the atmosphere was buzzy, and service was fairly swift once you get through the door, but I'm sitting on the fence with this, and still working out what the hype is about if I'm honest. Yes, it's definitely good value by London standards, especially for a whole lobster, but for the over-priced burger, the lobster roll (which I didn't see anyone eating and understand it's just the claw), and the slight attitude you get from the hostess at the door holding all the power via a clipboard, I'm not sure it's really worth the 1.5 hour wait?! For full review and pictures, please go to gourmetbelly.wordpress.c…x",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8TMw3lbWEAaHhzNp1Ke6fw": {
    "date": "6/7/2012",
    "text": "Top draw place.I'm pretty much a regular here, good food, great price, cool drinks and uber friendly waitresses. The food is served exceptionally quickly, I never feel rushed here. Ever.The main issue is the wait outside. However, the last time I did go I was seated in less than 1 minute. This really must be a record for the place.If you're going in a small group 3-4 people and everyone shows up on time its great, perfect place for couples but not so for a first date!Absolutely love the place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kIveqLmmrCBYIzFJabkP4w"
  },
  "AM4idfYres0gn6Q6OB-Dxw": {
    "date": "12/20/2011",
    "text": "Pics@Chopstix2Steakniveschopstix2steaknives.blog… London has been cold and dreary lately. With the chilliness in the air, my heart and body started craving for something warm like noodle soup. So it was with anticipation and excitement that I set a date to head to Brixton Village to try Mama Lan with SC. As it turned out, Brixton Village isn't open on a Tuesday night and Khao Sarn was full. I suggested Roti Chai and we ended up back on the tube heading towards central London instead. As we thought about where our hungry tummies were going to eat and where we should come out, we spotted Green Park on the tube line and began to wonder if there was anything around there. I turned to SC and said that I think there is a new place called Burger & Lobster that could be there but I wasn't sure, I only remembered that it was in the west. We looked at each other and thought, should we risk it? or head straight to Roti Chai. We decided to take a risk and hopped off at Green Park. A quick confirmation on google maps revealed that we indeed came out at the right stop and walked that few minutes to our destination. Even for a Tuesday night, the place was packed but we were lucky to get a seat without waiting. Burger & Lobster don't take reservations and do note that if your entire party hasn't arrive, you won't get your table. Burger & Lobster only serves two things, burger and lobster (apologies for the pun!). Have you check out their website? It shows two tables with one having lobster and the other a burger, it was simple yet punchy and hit the mark. SC and I ordered one of each and a bottle of wine. Our order took a while to arrive but our lovely waiter, Rihanna kept us informed of the status which was great. Since it's Christmas time, we were happy to wait while catching up and sipping our wines. Our lovely lobster and burger arrived and we proceeded to wear the bibs provided to us. On the first few bites, the burger stood out more. It was a good piece of meat patty, wonderfully seasoned and delicious. It is after all a Goodman burger as this is their latest opening. We ordered our lobster grilled and it came out with a good bouncy bite to it. As we continued our meal, the freshness of the lobster starts to hit you. I was hoping for the soft sweetness of fresh lobster which was not boldly evident in the first bite, but that might be because I ordered it to be grilled instead of just steamed, I'm not sure. Looks can also be deceiving as we nearly contemplated ordering three dishes instead of two like the table next to us. Thankfully, we did not as there was a whole lot of meat in that one lobster and it took me a good steady concentration of 30 minutes to extract all that juicy meat out. The accompanying garlic butter was fragrant and not overly rich which went well with the lobster. The lobster and burgers are definitely the stars of the dishes with the salad and chips playing a side role. SC and I thoroughly enjoyed our dinner and the place has a great relaxed and informal atmosphere to it. I also have to make a special mention to our lovely waitress, Rihanna who only made our experience so much better. She checks on us regularly to make sure that we were good and even showed us the tanks where the lobsters were kept. This was a tip that I got from the twitter-verse, thank you! The best part of Burger & Lobster is yet to come, both dishes are priced at £20! Decadence without breaking the bank, I love this place already and I can see myself coming back regularly. We need more places like this in London, places that serve delicious food at great value. Much to my surprise, a chat with Rihanna revealed that Burger & Lobster only opened its doors on Saturday so a random change of events and chance led us to dining here in its very first week. To Rihanna, thanks for taking such good care of us, the next time I am back, I am leaving a bigger tip!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mw-jPOu8N1Ilz8HLd0ih3w": {
    "date": "5/8/2012",
    "text": "It would be delightful to start this review saying \"Well, I've eaten a lot of lobster in my time and frankly my dear, this is the best\".  Sadly I haven't.  I've eaten it twice.  The first time was at Cote for my 25th birthday.  This was the second.  Unfortunately, both times hammered home the fact that I have expensive tastes.  If only I hated it.  If only I hated champagne and caviar.  I really need to get a new job.But here come Burger & Lobster to the rescue, catering to the unwashed masses by offering an entire lobster for £20.  They also offer a burger but who'd choose that?  Quite a few people, apparently, and bizarrely.  I saw several wafting past, and other reviewers have stated that they're delicious.  I'm sure they are, but you can get lovely burgers all over town for less than half the price so why on earth you'd queue for three hours and pay £20 for that, I do not know.It isn't actually as straightforward as \"lobster or burger\".  There's also a lobster roll, which I presume is aimed at prissy people who don't like getting their fingers dirty.  Foolish, since that's half the fun. If you go for the obvious choice, then you can choose between the 700g lobster for £20, or 900g for £30, or a table-sized beast for £80 that can apparently be shared between four people. We were in fact in a group of four but being possessive types, and knowing it would inspire an out-and-out catfight over the claws, we opted for our own.  You can then have it either steamed and grilled, or just steamed; and plain clarified butter, or butter with garlic and herbs.  I can't imagine any combination would disappoint.  My steamed lobster, with garlic and herb butter, was exquisite, and served with perfectly crunchy fries and a deliciously dressed salad.  Considering it was the smaller of the two individual sizes, I also felt on the pleasant side of too full afterwards, and I didn't even indulge in a pudding.The service was outstanding, both from our charming, friendly waitress and the very funny waiter on the door who had to contend with legions of hungry Londoners desperate to get a place on the all-important list.  Yes, you should get there several hours in advance.  Yes, you will queue regardless.  Yes, there are plenty of pubs around the corner where you can go for a pint or three to pass the time.  And yes, you should definitely do that; the drinks here are overpriced to make up for the relatively inexpensive seafood.  The house wine is £22.  When the cheapest plonk on the menu costs more than a bloody lobster, you know the world's gone mad.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "9TNeXaR5i4Mm9ZxpJEY9OA"
  },
  "n-S0a6kJWGI3gcLgXWttag": {
    "date": "10/11/2013",
    "text": "I've been to this location twice and the lobster and chips have been consistently good.    I usually sit at the bar and there's no issues with lines.  Wish we had one of these in the bay area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic1_OM9cBuCuBiQB7wrReg"
  },
  "kCZ6hwmYE0qN2HLCZJtkHw": {
    "date": "2/22/2012",
    "text": "I finally made it. I have been to exclusive London clubs, I have been to expensive London restaurants, but I have never felt a place to be so close and yet so far away from me. The monstrous waiting times (my first attempt at going was cut short when the lady at the door told us we'd have to go back 3 hours later - and that was at 8pm) and the fact that I have a full-time job meant that I would probably have to wait for weeks, maybe months, until I'd make it.Patience is a great virtue though, and so is willpower. Armed with these, and a good friend, we went, we put our names down, and headed to the pub. We were told we'd have to wait for at least an hour, so after two hours and two glasses of wine had passed without receiving the telephone call we were so desperate to get, we took our chances and headed over. Luckily, our table was just getting prepared for us, so we sat down straight away. There is no food menu; just one for drinks, with a good selection of cocktails, spirits and beers, and a rather limited selection of wines. I was a bit disappointed with the small choice we were given for wine, especially given Goodman's amazing wine list. You can only famously get 3 things once you're in - burger, lobster or lobster roll. We went for a lobster roll and cheeseburger, split in half. They were great. Good food makes me happy. I was happy once I started eating. The food also arrived very quickly, which kind of made up for the two hours wait. The burger was fantastic, although my bun was a little bit crunchy and I would have preferred it softer. The lobster roll was delicious and highly recommended. Looking back, I'd say go for the lobster or lobster roll. They feel a little bit more 'special', plus you can get good burgers in many places around London, with about a quarter of the waiting time.I really, really wish I could have given this place 5 stars. I WANTED to give this place 5 stars. However, despite the food (and atmosphere) being fantastic, waiting for two hours when we were diplomatically told 'at least one' was a bit frustrating. What was more frustrating, however, was that despite the service being excellent and our waitress being very friendly, we got the feeling we had to get the hell out of there as soon as we finished our meals or else we'd be getting kicked out. Pushy yet polite, our waitress gave us the dessert options and when we said we didn't want any she brought us the bill because our table was about to be given away. This meant we spent two hours waiting for one hour of dining, which was not disastrous but it made the experience feel a little bit less special, which is a shame. Was it worth the wait though? Definitely? Would I go again? Of course, but I'd give it another week. I need to hit the gym now.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "rfRroU_v9Cjx-ZnM4UuPPw"
  },
  "d9daMnRwcNOip_8m2Qfl_Q": {
    "date": "7/2/2013",
    "text": "The food was good but the staff could not be more rude, especially the hostess and the staff behind the bar. When we arrived there were no tables. We were told it would be a half hour wait for a table. So we said we were willing to sit at the bar. When a table opened up 5 minutes later we asked if we could move to it (there was no one else waiting for a table). After a lot of huffing and eye rolling from the hostess, she finally let us move. We had small children with us, so why she was so shocked we would rather sit at a table rather than the bar was strange. We especially wanted to move from the bar after the staff behind the bar ignored us at first, then got irritated that we asked for a menu (not knowing they didn't have one), only to have them chastise us for our drink order. This place is just not worth the bother.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcR_MOmdCnnbucVMygUTvA"
  },
  "X5tENxvCkYdPSmdl6NZ55Q": {
    "date": "1/19/2012",
    "text": "Nice concept. We arrived before six, so we were seated immediately. But it did start to fill up quite quickly so the no reservations policy might be quite irritating for later diners (especially considering the location i.e. quite dead).My dining partner and i both opted for the lobster roll. The Three dishes (whole lobster, burger or lobster roll) are all accompanied by fries and salad for £20. The cocktail was weak. The fries had a human hair in them (not good). We did not bring this to their attention though.The salad was missing lettuce. I do feel that certain salad leaves are very strong tasting and need the plain crispness of lettuce to mellow.The melted butter boat accompanying the lobster roll was very generous so be careful if pouring! I suggest you dip the roll in it rather than pour- better for the waist line and the heart i imagine!Only two mousses for dessert: the choc coffee and the lime. Both served in a small cardboard container. Both quite lovely.All in all, if its lobster you want, this is the place to go.We have decided to visit again to try the burger. All ten ounces of it! Will add that experience to my reviews.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPrEHeYY-Q1rMQ6LxmlzEQ"
  },
  "WQTp8w3cd2Q3XhDF7d6JtA": {
    "date": "3/1/2012",
    "text": "Burger and Lobster in Mayfair is truly a unique and tasty experience. Opened in the latter half of 2011 by Goodman, this restaurant has already had a big impact in the capital. As the name suggests, there is no menu but the choice of Burger or Lobster. To be more precise you can chose between a whole grilled or steamed Canadian Lobster (I recommend having it grilled), a Lobster Roll or a Burger with all the trimmings, each priced at £20. There are some great sides included, some lovely extra crispy french fries and yummy garlic and herb butter to dip your crustacean in. The side salad was ok, though a little drowned in dressing which made it a little soggy. There are also some impressive cocktails to keep you occupied while you wait for your food to arrive, they are quite pricey at £9 but they are of top quality and go down very well. If you are hoping to have dinner at The Burger and Lobster, I recommend you head down there before 6pm if you can, to guarantee a table. They do not except reservations and I have known of people waiting for over two hours for a table. Having said this, the staff are charming and if you only go once to this unusual place, you will find the food and atmosphere something you may never experience anywhere else in London and all for only £20! itsnosmallthing.weebly.c…",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jrgtwjgvHhskxMZTP_PmuQ"
  },
  "ZFozYpxOO1U1DVJjarorlg": {
    "date": "5/25/2012",
    "text": "Awesome little spot! Only has two main dishes a burger or a lobster. The lobter of my choice 900g with the lemon garlic butter, make that 2 lemon and garlic butters. I ate at the bar rather than wait for a table and got to people watch all the beautiful people coming and going!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SztWbeZIuXfhRq9vin3UKw"
  },
  "PeDRwjYfs2nXPhXMyu30QA": {
    "date": "12/26/2011",
    "text": "It's hard to express in words my excitement when first hearing about this place. I like burgers. I like lobster. Imagine a place that is a combination of both of these wonderful things and it's by the people behind Goodman, people who really know about burgers. As it happens I was ill on the opening day and had to wait to indulge myself. Luckily with the Monday off from work I set out in the downpour, not letting anything stand in my way of stuffing that lobster down my throat. A short walk from Green Park station the sign is quite low key and could possibly be missed if you were casually passing by. Inside the first thing you see is the lack of the 600 litre tank, the largest lobster tank in Europe apparently. If you're really curious then ask the staff and they will show you the vats which are a lot less impressive than you would imagine and btw, no, you can't point out which lobster you want for your meal. On to the menu. There are two things you can have, burger or lobster. Yes, that's it. But that's plenty. The options are all £20 each and now you might be wondering why a burger here is more than a burger at any of the Goodman branches? The answer is that it is bigger. Then there is the lobster, which comes as a whole lobster  grilled or steamed  or as a roll. Having heard good things about the roll and convincing myself that no matter how much I wanted there was no way I could fit both burger and lobster that day I went with the roll. When it arrived I initially regretted my choice. Instead of a massive burger or a whole lobster there was this tiny little roll in front of me  the looks were deceiving though, I was pretty full afterwards. My first bite into the roll made me wish I could have more than one roll. It was incredibly tasty. The lobster married perfectly with that pillowy, sweet brioche bun. In short, £20 for lobster is a great deal and Burger&Lobster really know how to cook them. Go now before they raise their price.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "o3BkP4283sz9irPSgfpA-A": {
    "date": "9/12/2013",
    "text": "This is my favourite restaurant in London and I live in Marylebone so spoilt for choice.Tried the 8lb 10oz monster and lost but had the luxury of grabbing a doggy bag and eating it for breakfast.Been in for drinks also and have had excellent service at the bar. I think I need to move to Mayfair and make it my local",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t7ijjCYnX8cogaivo--4kg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. River Monster",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t7ijjCYnX8cogaivo--4kg/o.jpg"
      }
    ],
    "user_id": "0Su3ExrErNN7E0bcGa9ZWg"
  },
  "NUKTmtAfc3iH-tKG623y6w": {
    "date": "11/6/2015",
    "text": "If I could give this zero I would! I live abroad now and wanted to meet up with a friend from school at this restaraunt. From 45 minutes of sitting down and eating they were trying to kick us out. The stages are listed below1. Constantly coming and checking our plates, then picking up anything that looked empty.2. The manager hovering past every 10 minutes and glancing at us3. This then gratuated to bringing the people our table was meant for after us, to our table, and letting them enjoy the show of us eating our meal. When I say bringing them to our table, I mean they were literally leaning on it!4. Then the manager passed by for a final time and said whilst glaring at us \"I dont know they were supposed to be out of here half an hour ago!\"5. And then finally serving us with a 10 pound service charge,  for being rushed and intimidated into leaving! I've been to higher end restaraunts than this and would gladly pay that, if it was deserved. I suggest you go to the soho one, this place is a disgrace,  I was expecting to sit down, enjoy my meal and catch up with my friend who I havent seen in years, friday night or not. I am after all paying for it, you get better service at kfc!",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P89uw9XBEkKulDg8puibNg"
  },
  "3siUtYThJ9Ya4O8tUd1tyw": {
    "date": "4/15/2016",
    "text": "Fantastic Mate! The food is so good. I ordered the lobster roll and hamburger. My son ordered an entire lobster. We ended up sharing the food and I must say, it was delicious! Love the garlic butter too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zq9uI-N5nrhbZt0Ktwl5cw"
  },
  "ZON_uivBf8I25WSv9kEq9g": {
    "date": "11/22/2015",
    "text": "So disappointing....we waited almost 50 min for a table- I had the burger, he had the lobster roll - both average. £20 for each was too much, I've had a better burger at a near by local pub. Place is a douchy bro spot - 5 drunk frat boys who interrupted the couple next to us during their dinner, wanker manager didn't do anything and left to poor waitress to escort out. You come here to be seen, not for the food or service. Not sure what the fuzz is about - too many other great food places!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6mLh_0HNHxQbgHO5dJJo1A"
  },
  "h-36A9Hrbwl3k20y8iGIuA": {
    "date": "3/24/2016",
    "text": "An unexpected disappointment. My wife and two adult children were really looking forward to our meal here on March 23rd. That's because a previous visit to another in London had been simply excellent. However we arrived and were told we would have to wait for about 45 minutes. That was ok with us despite it being a bit late because we were anxious to eat another great burger. An hour passed, then an hour and a half and despite numerous checks with the hostess we kept being told it would just be a few minutes. We finally got a table after about an hour and forty minutes!!Then the burger. Great anticipation. Great disappointment in that it was overcooked and dry despite our desire for medium (the same way we had ordered it on a previous visit). Not sure what the problems are with this location but would never return. A truly bad experience all around!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2OtUmR1JyW_8Grh1402GA"
  },
  "802bbdEywTnDiBVjOQTVlw": {
    "date": "12/20/2015",
    "text": "Amazing burger! Great service. Yes, the menu is simple but that's how I like it. In the mood for a burger or lobster? This is the place!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ejIiEKSTVgys3MeOcni-vw"
  },
  "3jh8Kb5cYRzDOOKYtPiUhA": {
    "date": "8/25/2014",
    "text": "They don't take reservations, so get there early, if you don't want to wait.  They have... Burger's & Lobster's.  GREAT Burger's & Lobster's.  I had an awesome Grilled Lobster and she had a delicious Lobster Roll.  Friendly service.  Very casual.  It's really a must try.  I can't wait til the Manhattan location opens up this fall.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kLyNiappj2-b8sortGTkLg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Delicious Lobster Roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kLyNiappj2-b8sortGTkLg/o.jpg"
      },
      {
        "img_id": "JY6avgJ5J8E8_YR07TEdGg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Awesome Grilled Lobster",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JY6avgJ5J8E8_YR07TEdGg/o.jpg"
      }
    ],
    "user_id": "HQS0j65kfkWgKhhuStJMkA"
  },
  "tEuE59hHPSFAp2wBFwWL0Q": {
    "date": "4/17/2012",
    "text": "It's no surprise that everyone in London wants to give this place a try - I don't know of any other restaurant that will serve you a whole lobster of £20! Went on a Monday night at 630pm and had no issues getting a table. They don't seat you until the entire party arrives so it's not exactly group friendly. I liked how the booze menu was separated into burger and lobster - nice touch! Service was a bit spotty I have to say, but mostly fine.Word of advice, it's not a place to go for a first date if you're planning on eating the whole lobster. I asked for mine to be steamed instead of grilled just because I find the lobster tends to be juicier! Once the monster-sized lobster arrived, the bib and handwipes came in handy because I kept getting lobster shells/juice/meat everywhere...not very attractive! It's so much fun to be able to pick the meat yourself - for those who would rather not deal with the mess, go for the lobster roll (marinated with a mayonnaise-ish sauce and served in a hot-dog brioche bun). The table beside us had the burger - looked the same in shape, size as the one at Goodman's (both places are owned by the same people). Just head to Maddox St, not worth paying an extra £7 for the same thing.Although I ate as fast as I could mostly because I felt bad with the number of people waiting at the bar, it was still a 2 hour dinner which could be why it takes so long to get a table. Go early, otherwise the chances of getting a table are slim - unless you don't mind eating at 1030pm just before closing!I would give it 5 stars...but the spotty service + oversalted and nearly inedible chips let the place down. It's worth going, but I definitely wouldn't wait for 3 hours.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "62LudGoZ7GgB9WUIfLVDGQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/62LudGoZ7GgB9WUIfLVDGQ/o.jpg"
      },
      {
        "img_id": "x5Hfd-EUkVu8yxKmb6Ky5Q",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x5Hfd-EUkVu8yxKmb6Ky5Q/o.jpg"
      }
    ],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "RTDcHr5HzR6w_Xj_AjF2nQ": {
    "date": "12/29/2015",
    "text": "Great food, great service but very crowded all the time. Expect a wait during rush time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFnwRWfNUkZExHwTFRhhbA"
  },
  "m_iPXp77FwIddKAxOBkUCA": {
    "date": "3/25/2015",
    "text": "My feelings are very mixed on Burger and Lobster, on the one hand it is usually a very enjoyable meal with a good atmosphere but on the other hand a burger or lobster roll is over priced at £20. Long queues to get a table can also be frustrating.A good venue for a group but often long waits for table don't make it an ideal place to meet (bookings are only taken for groups of 6-10). I still can't decide where I stand, so you'll just have to go and try it at least the once to make up your own minds.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Z-8EGSepvynyKif1friPg"
  },
  "EanfOzquJ9S1JYRxUyAiMQ": {
    "date": "2/18/2015",
    "text": "It serves lobster and burger only. No menu. Cosy environment and delicious food, but quit expensive...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jX7wxhafkOyXLgAnGUNmnA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jX7wxhafkOyXLgAnGUNmnA/o.jpg"
      }
    ],
    "user_id": "7BDa_FMAkH2uE0mImXTZxw"
  },
  "dC7qMc0bXgUZUQq2IEDyYg": {
    "date": "7/24/2014",
    "text": "well .... where do i start? .... DELICIOUS !! SCRUMPTIOUS!! MOUTH WATERING!!! ... Burger &Lobster is usually a busy place so we had to wait to be seated but dammit its totally worth it! ordered the whole lobster (grilled) with the butter and lemon sauce ... oh ... my .... sweet baby Jesus!! it was so damn delicious I was almost crying when the meal came to a premature ending!! I also had a grapefruit soda which was lovely!!! it wasnt as sweet as I liked so they gave me extra syrup ... basically the staff are great and the food is even better!! get there like NOW!!!!!!!! and maybe take me too ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ft8cn80hAJcOl_hRiVpP1Q"
  },
  "MJbIdyCzWysw3TX2tfVaiA": {
    "date": "2/26/2014",
    "text": "Absolutely love this place. There can be long queues, especially at popular dinner and lunch times, but totally worth it. I've tried both the burger and lobster roll, and have never been disappointed. The lobster roll is packed with lobster meat and served on a delicious buttered brioche roll (yes, that bun alone might be a heart attack, but lipsmacking good i say!). The burger almost seems expensive at 20 pounds compared to the lobster and lobster roll, which are all offered at the same price, but definitely one of the great burgers of London.This restaurant has been expanding around London, but I've only been to the Mayfair and Soho locations which are very different in terms of ambience (same amazing level of food). The Mayfair location is smaller and feels more intimate while the Soho location has more tables and feels more modern. These locations have different perks but you really can't go wrong when burger or lobster is involved!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uJX434DN-_mIPBVVxn9AQ"
  },
  "TCW4xwUXMYqpRYUVlR6JUQ": {
    "date": "7/27/2013",
    "text": "Been meaning to come here for a long time, especially given how close it is to my offices in Berkeley Square. Finally got around to it today. I arrived expecting to wait for an hour, but the wait on a Sunday at around 1230 is closer to thirty minutes. Not too bad. There were bar seats that were immediately available though. We decided to go halves on the burger and the lobster roll. I quenched mine with a gin, Earl Grey, watermelon juice iced tea, which was quite refreshing. Let's start off with the burger:The bun was not of the buttery brioche type variety, but was very clean, and good. The ratio of meat to bun was perfect, well balanced, very much like what you'd get at Patty and Bun or Meat Liquor. We ordered our patties medium rare, and they were delivered perfectly cooked, with a nice amount of pink in the centre of the patty. On a subsequent trip, the patty was over-done, so don't hesitate to send yours back if not cooked to perfection. You are paying 20£ for the burger, after all.As I took a ginormous bite out of it, the juiciness of the burger exploded in my mouth, and all the ingredients came together. Perfect. The lobster roll for me is the star of the show... it's so hard to find a decent lobster roll in this city, and this one if pretty f-ing decent. Not too much butter, the taste of the lobster comes through, and it's pretty loaded up. I kinda didn't want to share it.All in a all a great place, pricey, but definitely on my 'take people to' list in London.Go there.But bear in mind: the burgers are better in my mind at Patty and Bun or even Meat Liquor. But the lobsters... my goodness!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "JTxngs27ELvvzbrwWayVkA"
  },
  "o0mK5Z6Ws7YcSzJsZS-3xQ": {
    "date": "6/30/2014",
    "text": "Sat at the bar, shared the lobster roll, was fabulous. Dipping the bread in the melted butter or pouring it over the top, either way it was delicious. As other reviewers have mentioned the place is very busy. We found a seat at the bar right away and were served quickly. Drinks were just okay. This would of been 5 stars but the drink selection wasn't that great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Go4nGejERn4TJnDxKZbNBA"
  },
  "VduJm0BwSNfmlJESlOuwKg": {
    "date": "6/19/2013",
    "text": "Just a block from my flat, this place is SUPER DANGEROUS. Ok, I'll admit it, I am an American and my parents both were raised on the East Coast with all of the lobster. But all that really means is that I have very high standards for my lobster and burgers.Went for my first time tonight and I'm hooked. Yes, you will have to queue (I'm trying to use my British as much as possible!) if you are a bigger party, but the best kept secret is the bar seating with a full menu (all 3 options!). There was pretty consistently 2-3 seats together opening up, so if you don't mind sitting with other people that's your free pass on the wait.Had the lobster roll and it was terrific. The bread was well toasted with just the right amount of butter. The lobster was great, simple, light mayonaise only (I always order without onions) and the lobster was fresh with just the right amount of firmness.Add on-top some great chat with the staff behind the bar, this is a winning (but yes, pricey) spot and I fear it may become a regular spot for me.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "EeF53tGu6pyw3UIZs1ze8A"
  },
  "b-soV8p2NQa4R0L4dIn0gw": {
    "date": "8/1/2014",
    "text": "Big chunks of lobster, gorgeous roll. I'll definitely be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZX0nNK6v7L-HBU6e9Vd1AA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. So damn good. The fries too.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZX0nNK6v7L-HBU6e9Vd1AA/o.jpg"
      }
    ],
    "user_id": "jSxIvAYm63u9Of6R8xsXhA"
  },
  "q0yJbRscmXEzm4ob-nmfIQ": {
    "date": "11/6/2016",
    "text": "I was in London for a day and decided to eat here. I ate the burger and Lobster coincidentally and was not disappointed. the lobster roll is delicious with a burger and fries on the side. sounds like a lot of food but I was able to eat it all. and took some lobster off my girlfriends plate as well :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYfyitvzGNZHHa6qnqTWBA"
  },
  "j1WnzoyRaXFB3x0y7wDe4A": {
    "date": "1/21/2014",
    "text": "Finally on saturday I managed to visit this place for dinner. I have tried many times since is next door to my place, but never succeeded in getting a place on the list for dinner time. The place is cosy, not huge but not claustrophobic and noisy as other central places. The staff is very friendly and nice.They only serve 3 dishes as the name suggests: burger, lobster grilled or steamed and the lobster roll. All is served with french fries and salad. I went for the lobster roll, which was a sort of savoury brioche filled with delicious chopped lobster meat: great. The drinks list is also nice, with a lot of original cocktails designed to be served with each one of the available dishes. I took a beer, but my friends tries some lobster cocktails and they looked very good. The food is good and the price is very cheap (we paid £22.5 each), the only problem with this place is that they don't take reservations and the list for tables is always very long (at 8 there were 2.5 hours waiting time). Also, once you are in, they don't urge you to leave after dinner, so the people in the queue do not really have a sense of when they will be seated.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRAnL4nPczO2JvNvsTE8wg"
  },
  "XIJQndDNjxefS64pca2I6A": {
    "date": "12/30/2016",
    "text": "Awesome burger, chips don't match-up though - they should improve on these.  Place kinda suck so I took it home for a much better ambience.  Wish they find a way to pack desserts for take out too.  Nice/friendly staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-B2newOWVDG8BzkWLWKmQ"
  },
  "o4FpqrPTwQ8waE5s6IzKfg": {
    "date": "2/6/2013",
    "text": "We heard that the wait would be 1-2 hours and were expecting to grab a coffee, but when we arrived, they asked if we minded sitting at the bar and we were seated almost immediately. This was lunchtime on a Saturday.The food is great. It's hard to go wrong with grilled whole lobsters (slight smokey flavour on the outside and perfectly cooked meat with a bit of bite!), with garlic butter and really crispy fries that are soft on the inside. The service is pretty quick, and given the amount of people waiting, they are very patient and don't mind you hanging around a bit after your meal to finish your conversation. It's very comfortable and not pretentious at all. £20 for a good, filling meal in a relaxed setting, lives up to the hype. I've been there twice now, planning my third trip soon!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wUglOGOHWulhp8Wo9bb7Sw"
  },
  "aBlC-SbA3-0LjJf-C_lXKQ": {
    "date": "2/1/2015",
    "text": "Is it worth it? The answer is yes. Great vibe, the place is buzzing and food is fantastic. I loved the lobster roll, only comment is the brioche could be slightly less buttery, other than that perfection and lots of it. Chips were great, not too salty, add your own. Enjoyed the salad, party on. Cannot bring myself to give 5 stars, it's not a hidden gem. Would I come back? Maybe not. Would I bring a guest back, definitely. Would I ever be tempted to order the burger? Hell no !!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PMbeeaZGlzt2gMt6hOZK9w",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The table next to us. They look a little miserable. Not have their food yet, I guess !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PMbeeaZGlzt2gMt6hOZK9w/o.jpg"
      },
      {
        "img_id": "K2D2dB8NnvMKB8qsdwEn_g",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. There she is !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K2D2dB8NnvMKB8qsdwEn_g/o.jpg"
      },
      {
        "img_id": "L9NQgpCwkXJJHp4-xb3siA",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Place is jumping !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L9NQgpCwkXJJHp4-xb3siA/o.jpg"
      }
    ],
    "user_id": "q_ae2p8uyMDSm9zKqN6Btg"
  },
  "fLa5_z2V5Lp05dVpVBkSHQ": {
    "date": "5/25/2016",
    "text": "Delicious lobster roll and burger.  Three items Burger, Lobster and Lobster roll. All come with chips and salad and all are £20.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ERj9nLIE76CsdOhAZVFBpQ"
  },
  "09YUvreb1PSm17lNlOFS-A": {
    "date": "6/24/2015",
    "text": "Great location in SohoCocktails are great and above standard in restaurantGood to have only 3 options at the same price.If you're 2 and want to share they will slice it for youOnly downside is that it is very noisy so difficult to have a conversation",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3hN7XrGxvY0g4piibx9nLQ"
  },
  "1aEJOW6YVsdjQmLzOrTXvw": {
    "date": "6/23/2016",
    "text": "Great food and prompt service! The 2 lb. Lobster was nothing less than decitant. Our kids loved the burgers . Jamie was our waiter and he was perfection!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SdDQ-7yg83D0wIadLmcaTA"
  },
  "458UlExdI31hqbsUxL8AHQ": {
    "date": "6/17/2016",
    "text": "After waiting 30 minutes, we came back to check our status and were told we'd be seated next.  We watched as 3 groups after us got seated...so we ask again and were told those groups were able to be seated at the bar.  Seats at the bar were never offered to us and when we told them we didn't know it was an option, they continued to have us wait another 10 minutes.  40+ minutes from our initial arrival, we were finally being seated...& to save time, we told our server we were ready to order as they sat us...another fives minutes before someone comes to take our order.  £ 60 later...not worth it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5nPVg-TlMVb3dLQzie4mEw"
  },
  "OF1t_HI0_EHBEKpKqG8pCQ": {
    "date": "5/16/2015",
    "text": "Good lobster sandwich + fries + salad for £20. Should give it a try if you're never been in one of these nice lobster oriented restaurants! You can also decide to get a normal lobster, grilled or steamed, + fries + salad = £20.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mfZGBhQOVR851O6o1dQUMw",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Lobster sandwich + fries + salad = 20",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mfZGBhQOVR851O6o1dQUMw/o.jpg"
      }
    ],
    "user_id": "6XLy9FzbRpzjMN_nuyEGGQ"
  },
  "YFeLBd-NXSvklmT9_jM0qg": {
    "date": "5/26/2016",
    "text": "Um this place is amazing!!!! They only have 3 items to choose from for 20£ but you won't be disappointed! We're always so grateful to find these hidden gems off the beaten path.. Thank god for Yelp! It's come through on several occasions. The staff here is really good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CWo7dQh6PGYfnF6tjWSBwQ"
  },
  "o439SX6hCY9L9MHJCrA4pQ": {
    "date": "5/21/2015",
    "text": "Second time at this restaurant, but a different location. Food, drinks and service still the same: great. There are times when things would be different with the same restaurant chain, but it's not the case with them. They definitely had it down. We would come back again and again when we are in the London area. Thanks again for the pleasant experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MRZDZxyNNdT1YdDZhceryQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Grilled Lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MRZDZxyNNdT1YdDZhceryQ/o.jpg"
      }
    ],
    "user_id": "C1N4OGAHXW6lGusFUN72rg"
  },
  "KRQTDghQRoJGORiylyWyIQ": {
    "date": "4/3/2016",
    "text": "Went there with few friends after work and although we had to wait for the table it was well worth it. The staff made us very welcome from the start and the food was delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GzSGVZQS-zNGDgOQhNgSg"
  },
  "IUSg43MwnLOERdHYZDCmWQ": {
    "date": "10/25/2014",
    "text": "If you want a fantastic burger or lobster, this is the place to go.   Relaxed atmosphere, very nice staff, quick service and awesome food.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jjgPJwAYQfTPG9cfm6MVTQ",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. The lobster roll and burger, delucious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jjgPJwAYQfTPG9cfm6MVTQ/o.jpg"
      }
    ],
    "user_id": "s5qNGMd089tKj396Icbzrw"
  },
  "Z8-6eMGE9oMtWwPzRdfQRA": {
    "date": "6/30/2012",
    "text": "I love it when a restaurant lives up to the hype.  Yes, the wait was a bit longer than we'd like but always a plus if you like to drink and can squat at a pub for a few hours before.  I went with 3 other Americans and we ended up ordering 6 mains for the 4 of us... so we can each get half of all 3 items.  If we waited this long, we might as well get the full experience!  Here's how I'd rate them1) Lobster - Definitely my favorite of the 3.  It was fresh, perfectly cooked and comes with this amazing garlic butter that's really good dipping your fries in (and a friend slathered a bit on his burger!).2) Lobster roll - Yes, it is small but so tasty!  If that was the only thing I was having, I wish it was bigger but that night glad it wasn't.3) Burger - It was a really delicious (and HUGE) burger.  But I think for 20 quid, I'd probably stick to the lobster when I go back.  Oh and the fries - how do they make it so good?",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "AnPAdJKCw_xOBurWYHM0Fw": {
    "date": "6/6/2016",
    "text": "Tried this specialty restaurant in London.  Only three items on the menu... All £20 each.I tried the hamburger, medium rare. It was by far, the absolute best burger I have had in years!! The meat was delicious, but most impressive was how perfectly cooked it was.Recommend 100%....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Ef3Ydvrzk2nHMtndK_hsg"
  },
  "7Pyw6POAUd78jn_ltBY3iw": {
    "date": "1/31/2016",
    "text": "Absolutely amazing. We are from Dallas. Husband was craving a burger and I would never turn down a  lobster roll! Even the side salad was delish! Great find!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZcrvKrhCbOz2Y-_Y1czlw"
  },
  "i0li7u-pFOnUDZb6NHfZXw": {
    "date": "3/5/2012",
    "text": "Good burgersUHMAZING picklesgood saladUHMAZING chips/fries/frittesThe bar is stocked with really top shelf booze. The cocktails are greatBeer selection is teenyI arrived with a fellow Yelper Tirth who's name is too hard to pronounce and began calling him Timbuktu. That's neither here nor here. We were told it would be an hour wait for lunch on a saturday at 1pm, so we headed to the bar only to find a place for us. YAY! There are only 3 items on the menu, and I saw no one with a lobster roll on their table, so I went with the burger like the other 2 blokes I was with. I ordered mine Medium well and it was still really pink in the centre, not quite what I'm used to coming from the states, but it was OK. The burger had as smoky flavour and I'm not a fan of smoke. So it was OK, and I'm sure by gourmet standards it was divine. I am not a fan of making a burger gourmet.... its a BURGER, street food. I think it should be kept that way.   The pickles were the best part. Seriously, it was sweet and spicy and vinegary. Great. The fries were equally tasty and free-flowing (FREE REFILLS). Collectively we had about 5 orders of fries. over all.... good. but I would go again for the lobster roll and cocktails.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "PllkcyCN0GEf_yAvIoC1Hw": {
    "date": "4/12/2015",
    "text": "Love this place. Very popular with tourist as its highly reviewed,but quality has been maintained. Had lobster plate with garlic butter, fries and salad. Each component is well executed. Lobsters are from maine. Steamed then finished on the grill giving that extra oomph. Fries stayed crispy throughout. Salad perfectly dressed. Beer is good. Even the cappuccino is wonderful.Service is excellent and staff is very friendly. Strongly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JEQpPlaHVcOn5rl_ZlVWMA"
  },
  "DrWj8z7wBKVTaUZ2RAeGLA": {
    "date": "3/28/2012",
    "text": "There's not a lot I can add that hasn't already been said - except perhaps that if long wait times aren't your thing, Monday nights are the way to go. We walked in at 7pm and got a table pretty much straight away. I even overheard the maitre d' comment that on a Monday night, people tend to get in and out with lingering - so even if there is a wait, it doesn't tend to be as long. All that said, I've now been to Burger and Lobster three times and had all three things on the menu. (I've also managed to have the lobster roll at each sitting. It's THAT good). Lobster is definitely the main game here. A whole lobster for £20 is definitely tempting, but can I just mention again the lobster roll.... (can't decide? Get both - I do!)I'm a burger junkie, so I have broken into nervous sweats each time I skip past the burger here. I have now tried it and can confirm the burger is excellent - however it isn't really worth £20 (I wonder if that's what helps keeps the lobster prices so reasonable?). My tip - if it's just the burger you want, go to Goodman's Steak Restaurant (Burger and Lobster is a Goodman's venture). It's practically the same excellent burger at £14. Oh, and they take reservations.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "G-PpsrodzQUaaGFkJI9lVg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. My kind of menu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G-PpsrodzQUaaGFkJI9lVg/o.jpg"
      }
    ],
    "user_id": "NkYQ_wHWcBuOh7vlD3Wa2w"
  },
  "KV8IGC-nxzBS4ARjgIQZ2A": {
    "date": "1/13/2012",
    "text": "London's hottest restaurant serves just 3 items...lobster, lobster roll, and burger. But oh does it do those 3 things to perfection.The burger (with crispy bacon of course) was exceptional and came with a side of chips and a small mixed salad. A bit pricey at 20 pounds considering that also gets you a whole lobster, but I'd definitely get the burger again. My friend literally was drooling over his lobster roll which comes with it own gravy boat of melted butter. A perfect last meal before starting that low-cholesterol diet!Crowd was upscale though rather intoxicated/rowdy...clearly folks are drinking heavily while they wait 1-2 hours for a table. Which to be honest almost had me mark Burger & Lobster down a star---the adjacent table was too drunk too obnoxious, I felt bad for the waitress. In the end the food wins out.Burger & Lobster takes no reservations so get there early or be prepared to wait and wait and wait and wait and wait.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "693cepUYv5C_VE1faZFTgg",
        "caption": "Photo of Burger & Lobster - London, United Kingdom. Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/693cepUYv5C_VE1faZFTgg/o.jpg"
      }
    ],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "d2OkZt6aViU9iAg750_9iQ": {
    "date": "12/10/2015",
    "text": "Not much needs to be said. I've been to virtually every branch and this is as consistent as the rest. Service, food and atmosphere spot on. I have never got the burger and I never will as the Lobster is far to good a deal. The Lobster is just a dream of meal. I actually prefer it to the whole Lobster just cos it's so perfectly formed and less messy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "7BxK9VokkTMULDkF_dvYvw": {
    "date": "3/17/2015",
    "text": "Never had the burger but the lobster and lobster roll are delicious! Chips are great as well, noticeably good actually (i don't usually notice chips!). Not inexpensive, you don't get much lobster roll for £20 even if it is good!Had one incident with a staff member when they were less than friendly but aside from that all good. The queue is the thing that gets me though. You can't book so you either have to eat super early or wait in the queue for ages. What I have been able to do is hold a place in the queue with the person on the door and go for a drink nearby and they call you when your table is ready!Definitely a place to try, might be a one night only thing but worth a look.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MRrDF0rG0mcet58ppldPGQ"
  }
}