{
  "qWQyyrMBqmcvwx7IJLBDAg": {
    "date": "11/19/2008",
    "text": "Just along the canal from Camden is The Engineer, a beautiful pub / restaurant. Priced in the expensive end of the gastropub scale, the food aptly reflects the tags. Unlike so many gastro pubs where you pay restaurant prices and get fast food dishes, the engineer obviously has a very talented chef.Its a lovely stop off for the walk from camden to regent's park and if you smoke there is a terrace out the back. Ring ahead though, it gets very busy witht he rich Primrose Hill set!Never had a problem with service, as suggested above. Its a payday treat kind of place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tBibAlLGICyOlCCSuKV3VA": {
    "date": "3/21/2010",
    "text": "The Engineer is a nice, solid gastro pub.  The food isn't the culinary artistry of the Eagle or its ilk, and to be frank the sticky toffee pudding was a big disappointment, but the warm, professional service, the excellent wine list, and the big sunny garden made up for that.  We also really appreciated being able to book on Open Table!  If you're looking for a gastro pub experience in London and don't have the patience to wait for a table at the likes of the Gun et. al., consider a trip to the Engineer - while perhaps not the best pub food in London, but a really great place to spend a few hours having a quintessential London experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ll_T2A5pqCZU7TlJkUru1g"
  },
  "rD8ooD53O_06jSFvwjmKtw": {
    "date": "5/6/2010",
    "text": "A Primrose Hill institution, the Engineer can do little wrong for the regulars who flock there for favourites such as miso-marinated sea bass with bok choi. Despite the ample dining space, the bar area is on the small side, but there is respite in the form of a back garden, which is an ideal spot for long summer lunches.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ctQk1uIrqMljgqz0VD1T2Q": {
    "date": "4/29/2012",
    "text": "Had a very disappointing experience here. Had friends in town and wanted to treat them to a classic British sunday roast. We arrived and told the waitress (Antonia) we had booked a table she said she'd seat us and then promptly sat down at a table and started to talk to the patrons. I would later learn that this is her thing she does to try and ingratiate herself with customers while taking their money so as to ease the bitterness of paying her the \"discretionary\" 12.5% tip on the bill. After an awkward few minutes of the four of us staring at each other and wondering if she was going to get up and seat us we just walked in and sat ourselves. About 15 minutes later she came to take our orders. We ordered roasts and drinks and after waiting another ten or so minutes (the place was not packed) we asked someone else for our drinks. Soon we were playing a game of asking every person that walked by for our drinks and our food. Everyone we saw was looking frustrated and rolling their eyes at how long it was taking to get waited on, get drinks, etc. I'm always surprised given I believe these restaurants make so much of their money on the markup of alcohol when a place like this makes it so hard to get a drink. The food was exceptional with one exception. The potatoes that came with my roast pork were clearly many, many hours old. They tasted rubbery like when you reheat roast potatoes in the microwave the day after you make a roast. For the price we paid it is reasonable to expect some decent roast potatoes. I was actually shocked given all the positive reviews. Was very disppointed with our visit. Probably won't be going back anytime soon.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_SDcOq7hluk-TUJ9CyMR0g"
  },
  "hygi4fjLiLIofNSG9XMlXQ": {
    "date": "11/5/2008",
    "text": "The Engineer is one of the most beautiful pubs there is in London and it has been my favorite gastro-pub for a quite some time now. Or you could say it is more like a restaurant attached to a pub. The decoration is beautiful, but nothing too fancy. The food is modern British cuisine with a twist with a good selection of wines. So delicious. Unfortunately the word has spread around so you need to make a table reservation..The place gets busy but still manages to bee relaxed and service has always been good. There is a lovely beer garden during the summers as well.The pub is located on the beautiful Primrose Hill area ( Where Kate Moss lives) and is surrounded by these cute pastel colored houses. If you have some energy left then it might be worth climbing on top of the actual hill and you can have a view over the entire London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfEv9dd3pf3Diog86rus7A"
  },
  "QmWLWi2KdTj199UpbeurgQ": {
    "date": "7/9/2009",
    "text": "A beautiful pub with gorgeous outside space, but have to say that staff aren't that friendly and £9 for a glass of wine just seemed rather excessive! It was the first place my fiance told me that he loved me, but sadly I no longer love this place.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lMHB8_drCMxY8HEAJChHjw": {
    "date": "11/4/2009",
    "text": "Staff excellent, helpful and jollyFood was not ambitious but delivered what it said on the canVery nice space and handy parkingGood space",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hH379FDt2raWkFMVLzfrw"
  },
  "oXs5EWp06vXfnxamVHxpWQ": {
    "date": "11/20/2008",
    "text": "Beautiful pub that serves all the alcohol you could wish for along with gastro food with a slight twist. Try delicious winter warmers like miso cod on mash served with bok choi. Service is friendly and not in the too cool school.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DN5kSoUoP3cYzwkRrbNCRQ": {
    "date": "8/12/2008",
    "text": "A decent boozer in the famous primrose hill area. Decent selection of drinks, and although I didn't sample it the food looked amazingespecially the burgers. Next time",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JmzZImgAlAHMwKO4vrpCwA": {
    "date": "11/27/2008",
    "text": "I have had a number of very enjoyable meals at The Engineer, including one with the in-laws. The terrace area is a gorgeous place to eat during Summer (but you need to book). I agree with a previous reviewer that the chef at this gastropub knows what s/he is doing. A gem of a place!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZmNwfyNgIP35qDnQKfoQeQ": {
    "date": "5/18/2008",
    "text": "This gorgeous restaurant in the ever-delightful Primrose Hill is everything that gastro pubs should be. The food is top quality and you can get the best of everything you'd expect - fish and chips, sausages and mash - all the best British food. The restaurant itself is very comfy, set out on a few different levels so there are small rooms with just a couple of tables in them, so you can have a very private dining experience.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QVVy8uDR2oKGWtM0M-SFPA": {
    "date": "7/13/2008",
    "text": "I have had some good experiences of the engineer, from a boxing day feast, to a new years day lunch, the service is usually pretty sharp, and the food is excellent gastropub fayre. One of the few places in london where parking is fairly easy to find, and a nice local crowd free of the usual mash of tourists. You MUST book in advance if you want a table in the restaurant as it does get very busy, and the price does reflect the quality, so dont expect 'pub rates'.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vz1-fmL4hgFmQ-pHDEkbrw": {
    "date": "12/1/2008",
    "text": "I really like this pub - I think I could give it 4 stars as it has a great vibe, gorgeous look and good food and is perfect for a lazy newspaper day or a more dress-up proper dining day, but I don't get there enough to feel that much love yet... and I haven't had the pleasure of eating outside in the garden... and we once had a bit of a run-in with one of the waitresses (long story, but she was clearly not happy with our semi-leisurely lunch pace - or perhaps with life in general - and spent most of her service with rolled eyes, and when one of my friends kindly asked her to remove the optional service charge from the bill, she lost it).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "jy-V1oXY6Os_Gt1ZW8XvLA": {
    "date": "4/13/2010",
    "text": "I don't know why it took nearly two years of living in London to explore Primrose Hill, but now that I've found it I'm hooked! (To my wallet's dismay...)The Engineer was quaint, friendly, down-to-Earth and practically perfect in every way. I did not have a full meal so I'll need to go back to comment on anything more than pub nibbles, but I can honesty say this was the absolute best bloody Mary I've had here in London, perhaps in... dun dun dun.... the World!  This magical cocktail involved house infused rosemary and pepper Finlandia vodka, a homemade mix with tomatoes, mustard, and other spicy spices, and a veritable garden of fresh summer veg. I can't imagine a better hangover cure than one sip of this hellish tipple. It was absolutely divine, as was the staff that served it.  Stunning staff, cocktails and atmosphere - I can't wait to pop back by for a lazy Sunday lunch in the garden or upstairs venue!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "fJWFLPFnSG-oj2f67JPKOg": {
    "date": "11/28/2011",
    "text": "Dropped in late one sunday afternoon, nice contemporary interior good atmosphere and very friendly staff. It made a nice change to be able to take a late lunch on a busy Sunday afternoon and still be able to have the choice of the menu rather than picking over the scraps of what's left.The only slight drawback was the mains (wonderful beef) arrived a little too soon after the starters (the bread board) but the only issue this caused was where to position everything on the table. Sadly didn't spend enough time their or drink enough of the their ales or wines. Next time we're bringing reinforcements, arriving early and making a day of it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdMtUoSABD3ZO7ABlZPmrg"
  },
  "oJgEoWFt1y8GyS9ncLSWAg": {
    "date": "4/5/2014",
    "text": "Remember that high school guidance counsellor who wielded what little power she had to make students lives absolutely miserable? GUESS WHAT? She works here now!! As the hostess at the Engineer--beehive and lipstick on the teeth intact. Want to feel like a powerless youth again surrounded by incompetent and unrestrained authority? Want to be belittled and embarrassed in front of your friends and strangers? Come to the Engineer and ask for a table from this throwback! Picture it: Saturday at 6:15pm. We walk in to a nearly empty place and ask for a table. The bearded hipsters behind the bar advise us to speak to the hostess...that's when we see her---it's hipster Dolores Umbridge...'s daughter?!!  She repeats my question \"a table?...\"  *vacant stare* \"yes, could we be seated? I ask politely, wondering if I'm about to get told off for not raising my hand before speaking. She exhales deeply as if smelling a week old Scotch egg....exuding hatred....of us, her job...maybe herself? My repeated question is met with solid awkward silence...followed by the creepiest giggle you've ever heard...  \"Well, I dunno,\" she adds neither checking the bookings nor looking at available tables. We stare at each other for a solid 20-30 seconds, I turn to walk away. As if waking up that other ears are listening to this exchange she tauntingly yells \"we don't serve food for a whole 15 minutes,\" followed by another creepy as shit giggle. I look at the barkeeps who are polishing their glasses a little too well and keeping their heads down. I'm annoyed, surprised and most of all hungry. \"We'll wait,\" I say, utterly confused as to why this crazy has decided to take out her life frustrations on two people asking for a table. V spots an empty table and asks if it's available...Dolores rushes over to stand in front of nearly hysterically yelling \"someone may have reserved this! I don't know! I'd have to check but you probably can't sit her so it just won't work, will it?\" Followed by another Dolores giggle. \"Could you check?\" we request...",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXiBuewSITvIKJiCqIhUQQ"
  },
  "vhX7gVcU5zVkDazCWzWuMQ": {
    "date": "9/28/2013",
    "text": "Love this pub. And the best bit is the garden. Not many better places for dinner on a hot summer's night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukW5b68o3Z-bB5Y9EacpNQ"
  },
  "4NqB1mizZHiAAQAcDWy1rw": {
    "date": "5/10/2010",
    "text": "You're right, it is a solid gastro pub, but...I had high expectations having heard that it was 1. great, 2. pricey, and 3. kiddo friendly...Well the food was ok (hubby liked the fish cakes, and I thought that the timbale was quite good), but it wasn't amazing for the price that we paid. Minimum vego options.Kiddo friendly - *High chairs are available*If it's cold out and you haven't booked they may put you upstairs which is ok if you don't have to bring a pushchair/stroller up with you.*Not lots of kiddo food choices unless your child is into fish cakes or cheeseburgers",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "fMGxW5wUbYvvrZOaiLJeeA"
  },
  "9adqtiylcrPROnTIutpdgQ": {
    "date": "12/3/2008",
    "text": "I'm a little torn. This probably is one of the most stunning buildings I've ever seen a pub reside in; the function rooms upstairs have been kept in authentic style with original moldings, the decor downstairs is modern and chic against an imposing backdrop. The garden in the summer is a wonderful place to languish on a summer afternoon..However, I do find the staff a little unfriendly, and the food and waiter service is hit and miss depending I suppose on the kitchen staff and how busy they are. I've also heard they have problems dealing with groups over 6 people. Considering it's a rather pricey menu (main courses in the evening hover around the £15 mark) I would probably stick to keeping this as a drinking den.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cay8trL_q0dBd5Smm4mpdQ",
        "caption": "Photo of The Engineer - London, United Kingdom. 2nd function room",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cay8trL_q0dBd5Smm4mpdQ/o.jpg"
      },
      {
        "img_id": "nlWU4U0vHc7SEd4NFyOVjw",
        "caption": "Photo of The Engineer - London, United Kingdom. patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nlWU4U0vHc7SEd4NFyOVjw/o.jpg"
      },
      {
        "img_id": "_7IeV2nsbjuEQzMj7DyAYQ",
        "caption": "Photo of The Engineer - London, United Kingdom. function room",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_7IeV2nsbjuEQzMj7DyAYQ/o.jpg"
      }
    ],
    "user_id": "6ET2d9X8m-OdUOMCXCUp-g"
  },
  "IObVCg4NW30HaY0t3ew7ng": {
    "date": "9/29/2009",
    "text": "I always manage to choose the ONE wrong thing on the menu, especially on my birthday.  Why did I opt to get the spinach tortellini you ask?  Probably because I have frequent pregnant-women-esque cravings, which probably are inappropriate to follow through with at a pub in Primrose Hill (Sardo Canal across the road would've been a much better place to go pasta mental).Ultimately it was my bad I chose this dish that was underseasoned, undercooked, and contained sauteed Spinach which left too much of that squeaky feeling on the roof of your mouth.  Oh and the olives in the dish tasted canned as well, oopsie doopsie!3-stars for me though, based on the tastings I had of my friend's dishes.  The miso marinated seabass and roasted duck with a lovely polenta were delicious...and made me want to hide my tortellini under my seat out of pure embarrassment.  Sigh.Will definitely come back to sample the other things on the menu, as well as more of the awesome Cabernet S. that I had that evening...mmmm mm!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "X4RmwwxpRjAkjm50DYLmoA"
  },
  "51wC8YcDwMzPRcjgV9Yy9A": {
    "date": "1/3/2008",
    "text": "Excellent pub in leafy Primrose Hill that puts the 'gastro' in 'gastropub'. The food here does not disappoint. It's not overly cheap, but we had a lovely New Year's Day lunch starting with incredibly nice rillette of duck, followed by lamb wellington, roast duck and miso cod. All the mains were stunning, but the starters were even better I'd say. Well worth coming to eat and take a break from Camden when it gets a bit too full on, and a nice walk down the canal to get here. On the other side there's still a pub separated from the restaurant where you can get a pint of real ale too.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "6yptesZn-qzd8P9ZzsSsqQ",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6yptesZn-qzd8P9ZzsSsqQ/o.jpg"
      },
      {
        "img_id": "gLwDX6fIFe5QtpfkthWCyA",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gLwDX6fIFe5QtpfkthWCyA/o.jpg"
      }
    ],
    "user_id": null
  },
  "Hr8ddlTLVyLoctd3JOu6fw": {
    "date": "2/24/2010",
    "text": "Nice gastro pub. Its what everyone says and they are right. Ideal for passing away the entire weekend talking to friends and being bohemian (there's that word again).The food is nice and the atmosphere pleasant. During spring and summer the outside \"garden\" area is very nice to sit and eat im. So call to reserve garden seating.It is usually busy at is popular amongst the BCBGs (for any french speakers out there) Good for lunch and brunch. Haven't yet tried dinner. Will let you know when I have.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "q59vnLIaj0S0NbQDfAtORg"
  },
  "0VvBRmwNk17UGLg-xVPjGA": {
    "date": "10/27/2009",
    "text": "Just had dinner at the Engineer, lovely little gastro pub, the food was fantastic - quite pricey so not great for the Value part, but I guess if you live in Primrose hill you don't really need to think as much about Value ( it seems like great local restaurant/pub)I had vegetarian dish, stuffed courgette with brown rice and some kind of delicious sauce - looked and tasted amazing, fresh and crispy and my friend had sole with Thai spiced sauce, really yumI honestly think the food is good, don't expect great prices, but other than that is greatWould be back! :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XOHt6k0WiQoWcxzc6-ZEbg"
  },
  "TraJFcxpfYEIN-17x5iGGg": {
    "date": "7/31/2010",
    "text": "Absolute highlight of this place is the garden. Atmospheric, quaint and with quite good odds of getting a table, it really makes this pub stand out from the many options in this area. The food is good, but I feel over priced. The drinks and snacks are far more reasonable and I use it more to top and tail a night, rather than it being the focal point. Weekend brunch/lunch is a winner, and sometimes they have jazz in the back garden that is a big win. Go, celebrity watch, burn a few quid of a burger and you'll enjoy one of the nicest neighbourhoods in London - ok, I'm biased!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "In4s0llWX5zmz7KZQ1mJ9w": {
    "date": "8/10/2010",
    "text": "Great gastropub. Minuses: For as often as we want to visit, and do end up visiting, this pub for meals, I do wish they were priced just a tad bid less aggressively on my wallet. But that's not to say we don't still go on a regular basis. Pluses: The miso seabass is delectable. All food is well-sourced. The vegetarian options are less gastronomically satisfying but it's great there are any on offer. (Vegans may have difficulties sating their appetites.) The garden is cute. Brunch is aesthetically pleasing to view and yummy to devour. Wines are reasonably priced. The staff is friendly. The pub is dog friendly. Plus this stretch of Gloucester Avenue is lovely -- try the Primrose Bakery and Le Petit Poissonnerie, followed by a stroll in Primrose Hill.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "tLAGWiVZcjlLUufQo89c5w": {
    "date": "10/24/2009",
    "text": "This area of Primrose Hill is just lovely and we had ventured over to the Engineer on sunny, warm afternoon.  The two of us had the lunch special of celeriac & apple soup with salmon fish cakes.  The soup was absolutely amazing with fine slices of granny smith apple garnish.  I keep thinking about that tasty soup.  The fish cakes were adequate, unfortunately.   There are so many gastropubs in London that it has become a bit overwhelming.  But, I would put the Engineer at the top.  The decor is spectacular -- gorgeous wall paper, 70's lamp shades and old oak bar.  The waitstaff was delightful and very accommodating.  And the soup was spot on.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KXXJSONdaLamQFPcmFMsw"
  },
  "hEP1ZCT_BqNBldre98kuEw": {
    "date": "11/11/2009",
    "text": "The Engineer is a nice restaurant, with an unexpected roof terrace. The food had a really interesting taste, as the name of the restaurant, it seems that the menu was created by some engineer. You will be able to discover a new way to eat common food. FYI: Dinner Menu STARTERSsoup of the day beef carpaccio, venetian dressin smoked mackeral & potato salad, salsa verde cauliflower, watercress & goats cheese salad, pine nuts, raisins salmon tartar, pickled cucumber & horseradish creampork & herb terrine, beetroot chutney & toastpotato & onion jam filo tart, olives & rocket MAINS rolled landrace belly pork, puy lentils & bacon, granny smith puree spiced chicken breast, mashed potato, tomato & preserved lemon sauce 28 day, dry-aged sirloin steak, baker fries, caramelised onions & bernaise potato gnocchi, fricassee of mushrooms, spinache miso marinated sea bass, bok choy, mash, soy & sherry sauce baked organic salmon fillet, fennel mash, braised baby gem & clam butter saucestuffed round courgette, cracked wheat, halloumi, polenta croutons & red pepper sauceplease ask about today's specials SIDES baker friesrocket and parmesanleaf and herb saladsugar snapsbok choispinachcaesar salad",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cceDmGsM7a246AfMpPkMUQ": {
    "date": "5/24/2012",
    "text": "Nice pub but a bit pricy. I thought the food was good and atmosphere nice but you would expect a bit more at these prices",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3iOpcL9uM6z0fdfK1on3Vw": {
    "date": "12/3/2008",
    "text": "The Engineer serve a variety of modern British dishes including a full breakfast. The food looked really interesting but came really in real small proportions, and at £16 for a main,  its not value for money. Our table was facing the bar and I got to see the bar lady whoop up an excellent melon cocktail, and yes it was overpriced.To drink at the Engineer, you are paying above the odds just for the location.Inside, the Engineer actually looks like a local pub, but it takes itself far too seriously.  The food might be good, but the accompanying price tag is less appealing and coming here for a simple drink keeps this place a local favourite. Well over half the pub's space is devoted exclusively to eating and it is one of Londons fist Gastro pubs.I just love the location and the whole area and it is also a lovely looking building. Prepare to pay above the odds",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3tbiT99rP4J2J4RPbYBUQ"
  },
  "yIR8-nx0_L55vHQm4jOI9w": {
    "date": "12/27/2008",
    "text": "Probably my favourite place to get breakfast in the Camden/Primrose Hill area, and the only place I know of in London that serves up good American-style pancakes. At nearly £10, it's a bit pricey for breakfast, but they are nice and fluffy and come with the most amazing honey butter (never heard of such a thing before but now I don't know how I ever enjoyed pancakes without it!). The bacon is always nice and crispy, too. And they make a good cup of coffee. It's a pretty funky pub, too. Lots of crazy, colourful neo-Victorian wallpaper and a nice back garden with heaters. As far as drinks go, it's one of the best places to go for a quiet drink in the neighbourhood. There are always people there, but never so many that you can't find a table, though be prepared for a bit more craziness if you're looking to get lunch on the weekend. It's especially nice to stop by if you can work in a walk on Regent's Canal or over at Primrose Hill.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9NS3uKY_eI4PsEgpfExQLw": {
    "date": "2/12/2011",
    "text": "The Engineer is such a lovely pub, I wish it was my local.  It's bright, airy, well decorated and has a superb garden area.  Cosy in the winter and rocking in the summer. Great food, good wines and friendly staff.  What's not to like! If only we had an Engineer in SE London...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ys1NuGZhVT6Qbunk8V_JrA"
  },
  "fSkfWgu0M2LRmQSfGHn8fQ": {
    "date": "5/28/2008",
    "text": "Super gastropub in Primrose Hill. There's a small proper pub area in front with some choice ales. Behind (and upstairs) are about three or four rooms with tables for dining. It's a popular spot for a weekend brunch or a celebratory dinner, though they're open right from 9am every day for breakfast. Not cheap. The dinner mains are in the £13 to £15 range, with starters and desserts around £6 or £7. It's all exceptional food, though. I think the Engineer was one of the first on the gastropub trend. Certainly everything I've had here, from starter to pudding, has been top quality, both tasty and well-presented. It's definitely worth calling to book a table, as it's a north London favourite and can get extremely busy. You can book one of two rooms for events (no charge, but there is a minimum spend). They also have a small kids' menu. I have heard some people complain about the service here. I think this is down to two things: (1) it can get very busy, making it difficult for servers to be instantly attentive to everyone, and (2) it can be quite crowded, and so attempts to move/add chairs often result in requests to put them back because they block the way. In my experience these type of interactions have always been professionally handled.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FccglnZhRNkD1S-U7A8XRA": {
    "date": "7/19/2009",
    "text": "I was a little concerned with the reviews of the staff and their lack of friendliness, but I was desparate as all other gastrobpubs in NW3  were booked up at short notice - I had bugger alll choice...The menu read well and I heard great reports of the food from people who had been there - so, I went there ready to give them a telling off at the first sign of poor service and point them in the direction of these reviews if they messed up along the way...I have to say - they were wonderful. A great sense of humour - lovely staff - and the food was excellent to boot. I'd say that they've taken note of the reviews of poor service scattered about online and pulled their socks up.My *only* gripe was the state of their toilets - shoddy. Given the great effort that they put in to all other areas - it wouldn't take much to give the toilets a punchy makeover to put them in keeping with the high standards found outside of them.All in all - they've clearly gotten rid of the poor staff letting them down and the food was top notch.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7yrhTkGCYejk0J_iQJR4ZQ"
  },
  "fXXatjTs1No7kfstsPB8_w": {
    "date": "8/15/2016",
    "text": "We wandered around the area on a nice Sunday afternoon and were pleasantly surprised to find this pub had a BEAUTIFUL back garden. Unfortunately I cannot comment on the food, but it looked heavenly. It was a wonderful place to spend the afternoon under the sun enjoying a Pimms- and by the way, their Pimms was BRILLIANT! There is quite a bit of shaded seating and some open seating as well. Very relaxing. There were a lot of different rooms inside all uniquely decorated.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dYGZKXKiu2Ra_orkR_LnPg",
        "caption": "Photo of The Engineer - London, United Kingdom. A very good Pimms",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dYGZKXKiu2Ra_orkR_LnPg/o.jpg"
      },
      {
        "img_id": "oFJ7T3FGCUKofVJDvmkpYQ",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oFJ7T3FGCUKofVJDvmkpYQ/o.jpg"
      },
      {
        "img_id": "8MpR6a7Uy71fkJTYE3XjUQ",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8MpR6a7Uy71fkJTYE3XjUQ/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "ab7vN3B-iENBGA7yys-lcg": {
    "date": "12/29/2016",
    "text": "Below average pub food at best. The Scotch Egg which they claim is their specialty was pretty dry and the scallops were small and rubbery. I had rib eye which lacked flavour as well. But worst of all was when my husband ordered my first mixed cocktail and had to remind the bartender to add the alcohol when I ordered the second one I told the server it tasted different and I didn't believe it had alcohol in it to which the bartender came over with a shot and apologised saying he forgot to add it. Really??? While there seems to be good atmosphere and some cool private rooms upstairs there are too many good pubs in London to go back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q7naik8VS6sPsfI0E_fEKg"
  },
  "DrNReBQWcM_RxqO8ySeKFA": {
    "date": "9/19/2016",
    "text": "Great pub near Primrose hill and Camden market, the best part of course being it dog friendly. The pub is huge with a nice cozy bar area with comfy chairs; they have a large outdoor space as well for a  nice sunny day. The upstairs has a large room that caters for big gatherings/event with a long oak table across the room. It's a gastro pub so the food is amazing, the chargrilled lamb was definitely a good choice and the Ox cheek with wine sauce. He portions are big and they do Sunday roast as well. The staff are super friendly and relaxed, you can stay as long as you want and they even have classic games like Jenga, Connect Four, Guess who that guests can use. Definitely one of the best pubs I've been to and there's so much to do around the area!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ktgIzEcHvfNcTLJXs5n5Bw",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ktgIzEcHvfNcTLJXs5n5Bw/o.jpg"
      },
      {
        "img_id": "UlYVsosb3b5B4Tf3bcHZCQ",
        "caption": "Photo of The Engineer - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UlYVsosb3b5B4Tf3bcHZCQ/o.jpg"
      }
    ],
    "user_id": "UQpYD8Zu2u5CliKzclwwkA"
  },
  "WSbRPZjiUyib9h_Vv3x5hQ": {
    "date": "6/3/2017",
    "text": "Awful burger and they desperately need to clean their disgusting grill. Just bad. Tasted like cigarettes. The fish and chips was passable but way overpriced. But the pea mash had mint?  Not a good pick. Nice interior, though!  And good beer garden. But nothing saves it from terrible food.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nSVUlyHhsMbKufuGZpp2eA"
  },
  "Iyl2pE2PVzRrPenmCbEZLA": {
    "date": "12/1/2015",
    "text": "We were so excited to try lunch here in the hopes that we would find another pub in the area with good food - unfortunately that wasn't the case.We started off with padron peppers and calamari. The padron peppers were both soggy and burnt (not a great combo), totally unseasoned and did not seem at all fresh which was super disappointing as they are one of my favourite dishes. The calamari just plainly left a lot to be desired.The worst were the mains - my husband had a burger and I had sausages and mash. The burger had clearly been frozen - or was just really poor quality meat. The sausages were the same - although they were supposedly 'free range' they definitely tasted frozen/not fresh and were burnt on the outside and not as cooked as I would have liked on the inside - I couldn't even eat the majority of them.We had intended to order dessert initially, but after having a very unsatisfactory meal we decided against it. Such a shame, as I heard that the pub used to have great food when it was under previous ownership. We may come back here for a drink on the outdoor patio in the summer, but have been left with a bitter taste in our mouths and certainly won't be returning for a meal.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eqORtShPpFTVOTnqX0sr1w"
  },
  "T6AfJMXFaFwGcLNsd63Jiw": {
    "date": "10/2/2013",
    "text": "Epic place, let down only very slightly by the staff who are more than happy to walk on by when you're obviously waiting to order a pint... That is excusable though when everything else about The Engineer is so great.The food is the best pub food I've possibly ever had, the drinks selection is great, and the place itself is beautiful.I wish it was my local :(",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AKsXLoph77aYWIonxSICHw",
        "caption": "Photo of The Engineer - London, United Kingdom. Amazing Sunday lunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AKsXLoph77aYWIonxSICHw/o.jpg"
      }
    ],
    "user_id": "ODgGJVfwamUhWLKDmdPL4Q"
  },
  "UyzvCbw77C9E_MIV7HD8Yw": {
    "date": "3/10/2016",
    "text": "Again surprised I have never reviewed this place as it is in my hood.  I truly enjoy the engineer but for some reason it never is front of mind for local meals in primrose hill.  The breakfast is quite nice on a summer day in the garden and the wine list has some yummy choices (nice Malbec).  The wife and I decided to have a last minute date night here and enjoyed the use of their scrabble board and equally lovely cheese board (I won) which was fantastic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lSMJ15XRfcx_BNIBwD17Ww"
  },
  "jWLbPM5BHoO9iIylRNkv8w": {
    "date": "11/8/2010",
    "text": "I pop in here when visiting my friend who lives just up the street. The breakfasts are excellent. I am a fan of the baked eggs and spinach, the eggs with chorizo, and the pancakes are yummy and cute. Oh, the toast here is to die for. Amazing. The smoothies are great. I have also been in for a beer in the evening. There is a funny buzz in the room sometimes (I hear more people from the USA chatting over drinks here than at some of the other area pubs, but I am from Chicago). Just a nice place. The backyard patio is nice.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkWYdiLCzKXM0EcQjAySfA"
  },
  "U5uD-iaDle5D1eKO3ESj8Q": {
    "date": "8/9/2012",
    "text": "Deceptively big, this gastropub boasts two levels with plenty of TVs to get your Olympic viewing on. As it was conveniently just north of Regent's Park, I headed up here to meet a couple of friends and watch the opening ceremonies. We happily discovered it was part of the London Drink Deck (£7 if you spend £20 on food and drink) and even more happily ordered a round and some nibbles.The cocktails got good reviews from the girls and the double fried chips (my assumption) were excellent. Despite not wanting to eat much, I polished off the bowl. The scotch eggs looked alright but as my preference is for scotch sans egg I didn't try them myself.Extra points to the Engineer staff for regularly coming around and checking if we needed more drinks and food. It's rare to get table service on the slowest of nights when you are tucked away in an upstairs room, but during a busy time such as the opening ceremonies it's damn near unheard of.Other thoughts: They have a table tennis table somewhere on the upstairs floor as I heard it but didn't see it. Limited bathroom capacity means you're likely to have to wait, particularly for the ladies. Overall, a nice pub after a day (or night) in the Park if you happen to be in the area but not enough of a draw for the trek alone.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "nr15R0QkTtaBfgzQh74aMA": {
    "date": "11/2/2014",
    "text": "Great little neighbourhood pub, with a nice garden. Good wine and beer selection. Their burgers represent an upgrade on the art form.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0RLUaXmNx2whPa8hMrjoow"
  },
  "GO8HhomWMmDKOxpUXR7a3g": {
    "date": "6/16/2012",
    "text": "This definitely lives in the posh pub category--more restaurant like than pub like with so many different rooms.  The place is huge by the way.  Crowd wasn't too pub-like and certainly no blaring tvs with footie.I must say that the fish and chips were really tasty.  The batter was light and delicious and crispy.  So I'd say I'm a fan.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "xcVwR4ylPVwOTxIDNiXY2A": {
    "date": "8/2/2014",
    "text": "Great for their cocktails and a bit of celeb spotting. If you are here in the Summer they have a cute little beer garden in the back and if you are there in the Winter please try their Hot Buttered Rum, I didn't like the sound of this but it's amazing.. Like melted apple pie. All of the food I've tried has been delicious but the prices are as you would expect in Primrose Hill pricey for pub food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9lAJ2uDhmzysDfI8P9-TVw"
  },
  "9xVP7WXRldqVGfQbn9aesg": {
    "date": "7/7/2011",
    "text": "Oooo, now isn't this fancy. Posh ales, beers and ciders with a beautiful patio out back for drinking in summer. This cute little pub couldn't get any cuter, even the bar staff are dreamy.I came here on a rainy afternoon and enjoyed a few with friends, it's a good pub for that, not far from the park so it's a great place to dry off and warm up after an afternoon out. It's quintessentially English with tastefully floral decor... and yes there is such a thing.I need to go back and try the food. It's a bit out the way but from the look of their menu, it might be as dreamy as the staff.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "N7kN9vVQw1ky1eA8RMrQ8Q": {
    "date": "10/26/2013",
    "text": "Came to this spot for bunch and found extremely disorganized service and almost inedible food! One of us got the steak sandwich, which came cold and me, the cod cheek sandwich which was rubbery and disgusting. If you are not from the UK and have high expectations that a pub with such a high review might possibly have good food, please don't waste your time and grab some cheap and tastier eats at the Stables.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPuDqpNBfnVywHTuZhro_Q"
  },
  "3z4U_jvKlRqxM6_2LsSDgg": {
    "date": "2/13/2011",
    "text": "Was really impressed with The Engineer, great pub and the food was fantastic. We went here on a Saturday night and we were thankful we made a reservation since I can imagine it's difficult to get a table if you just show up. The place is surprisingly big since from the outside it looks rather quaint. While waiting for the table we were able to have a pint at the bar (they have a decent selection of beers on draft) and they gave me the WiFi password (currently it's \"letmeontheweb\").For food I had the beef and it was great. The pepper sauce it came with was very good and I thoroughly enjoyed the meal. The desserts were ridiculously good, so good in fact that we ordered another fudge after we had completed the first one. Would definitely be back here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GpZpKakwykH-Gsw-1LpLHg"
  },
  "ukmMhsctjVztMEu8t6UPnQ": {
    "date": "8/26/2010",
    "text": "What did I fall in love with first? The Primrose Hill location? The fact that on the way there, we witnessed a truly entertaining stand-off between the smallest puppy I've ever seen and Uli's dalmation-whippet cross (Laura and Elodie, let's see those videos!)? The rustic, industrial interior? The gorgeous gazebo-esque exterior with its generous parasols, extras of which were dished out to us when the inevitable torrential downpour hit? The adorable vintage floral teapots from which the Paris contingent supped their tasty leaves?Or perhaps it was the most tantalising Pimms cocktail, packed to the rafters with fresh mint, cucumber (in handy sticks for stirring too!), orange, lime, strawberry and a dash of lemonade I'd ever had the good fortune to sample? Could it have been those double-fried chips with garlic mayo?Add to that already stellar list the supreme company, a handful of gossip magazines and crossword puzzles and some great laughs and you've Engineered yourself one heck of a pleasant afternoon. Be sure to check it out if you're in this glorious area of London, it's a great spot to lazily unwind.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "S90cznhfdL29yMSEZ_EnJQ"
  },
  "nbVuESX7E4dJIPYFE06P2A": {
    "date": "11/4/2010",
    "text": "This place was exactly what five people with empty stomachs needed before venturing to Screen on the Green in Islington for a late night viewing of Evil Dead.  We were in the neighbourhood after showing a couple London visitors the view from Primrose Hill and, after a few drinks at a non-descript pub, decided to take our chances on dinner at Engineer.  As we walked, I was convinced we wouldn't find a table and would be stuck in the cold with no other plans, but when we walked in the door we saw an empty round table big enough for all of us.  It was a Halloween miracle.  I'm looking at the receipt as I type and, I have to say, we tasted a lot - in terms of food & booze - and the tab was £200 for 5 people including a £2.50 donation to The Hope Foundation and 12.5% service.  I usually stay away from cocktails because I turn into a crazy person, but the menu (pasted into a copy of 101 Dalmations) was too tasty to ignore.  I imbibed the English Autumn Cobbler (good, but tasted more like spring), and two Jack Brambles.  Yum.  My husband had a Black Velvet so he could drink out of a pewter mug (not really worth the £9) and our friend Danielle went for a few shots of Talisker.  If you're looking for beer or cider, they have that too, because the bill also includes quite a few Alddlestons, St Peters, and Bombardier pints.  The real star of the show, however, was the food.  Not one to order steak in the UK (always too thin and chewy), I went for it on the recommendation of the waitress.  I'm so glad I did.  It one of the top two steaks I've had since moving here over a year ago (the other being at the top floor of Smiths of Smithfield).   Thickly cut, on the bone, perfectly cooked...I'm drooling just thinking about it.  The chips were great too, but I was more interested in picking up the meat like a lollipop and gnawing at it as if I were a wild dog.  It didn't come cheap - £24 to be exactly - but in my mind it was worth every penny.  My husband had the spinach soup, which he loved and I agree was very tasty.  It wasn't overpowered with cream and had a nice bright green colour and taste to it.  Floating in the middle was a poached egg.  The only disappointment was the boring slice of bread served with it.  A few seconds on the grill would have made it worth dunking, but instead it was taken back to the kitchen with the empty plates.  One of my friends had the pie of the day, which was venison.  The top of the pie was puffed over the plate so perfectly that I think someone took a photo.  After piercing the pastry, the chunks of meat inside were meltingly soft.  Other things that were ordered, but I didn't try, were smoked haddock and the pasta of the day.  The only scrap of food left on any of the plates was that one piece of bread that came with the soup.   Do I see myself returning?  I can't wait.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "_w9BNCzpFBFSmji6QsSOew": {
    "date": "5/12/2011",
    "text": "This is too much a gastro pub (virtually a restaurant), not ideally a place to come and drink (especially at 3.80 a pint!). My pint of St Peters bitter was decent though. The toilets are upstairs, which is worth remembering. I saw a lot of people, including myself, struggling to find them. A lot of people below seem to really like this part of London but I just don't like it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "dvxn3M1l6wtj_46X8zzALw": {
    "date": "7/5/2011",
    "text": "You will pay premium prices for this pub as the food and decor are class. The garden is lovely and the staff professional.They have an interesting cocktail list and decent selection of wines.I come here when I feel like splasing out a little or for a couple of cocktails in the garden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "F2MmZxUZgolz-QFsOlUq_w": {
    "date": "6/29/2011",
    "text": "The Engineer has everything you would want from a pub. Great atmosphere, friendly staff, excellent food & drink choices. The best part about this place - the large outdoor terrace! I want to pick this place up and move it closer to me. My two friends and I all got on their wifi (\"letmeontheweb\") with our phones during dinner. What more can you ask for :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQEmuUvnfqAlU_Jg0m_SMA"
  }
}