{
  "7S8JLeNTYSPOSc8StF_4mA": {
    "date": "3/5/2012",
    "text": "Let me just say this - I don't like burgers. I eat one maybe once every two years. I barely eat beef at all.I went to Hache yesterday and ate a burger. (The Spanish one actually - goat cheese and red peppers.) And already I'm developing a craving for another one!Absolutely terrific. Sweet potato fries came out piping hot too. Friendly, prompt service. Also very cute decor!Go here!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uPfB2TY4XhhYoHe_Ol_lxA"
  },
  "W4Q5VmpIj8wZT7PJmeLFKw": {
    "date": "2/1/2010",
    "text": "Haché makes me happy!I usually try the specials whenever a new one comes on offer, including the scotch steak, with green peppercorn sauce and chunky chips.  This was a while ago and I still remember it and the arugula salad along with a glass of a well paired Libertad malbec/syrah, which was quite peppery.Also great, but quite the mouthful, is their holiday burger.  This is a turkey burger with patties made of stuffing on top, cranberry and a mint spread, sausage wrapped in bacon and some veg.  It really is a pile of a burger, a bit of a challenge to eat, but wonderful at the same time.I think I've made my way through about 75% of their regular menu by now.  On the latest trip I got the All Day Breakfast.  Beef burger with bacon, portobello mushroom and fried egg.  Add mature cheddar cheese. Nom, nom, nom.And the onion rings here?  YES PLEASE.  Big old honkers that are two rings thick and real wide.  With a light airy breading, and perfectly fried. Not quite enough salt in the breading, but with a good sauce to dip in not really noticeable. BTW, if you are a party bigger than four you'll definitely want to call in a res.  In fact if you're planning going during rush hours you should do so anyways otherwise you might be standing awhile.Haché makes me happy!.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8MZXYfhV9UzuSkmm74Ng"
  },
  "sWWxCIIxlwbJ9VHIuJby7g": {
    "date": "2/17/2013",
    "text": "As an American in London, I decided a hamburger to get over my jet lag.  Haché did not disappoint.  And you have to give props to using Silton and not generic blue cheese!  Onion rings were a happy find.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfQocN1FaaHzx0exlunv4A"
  },
  "ZM61K1x407-7nzOLCOpq1Q": {
    "date": "6/24/2009",
    "text": "A gourmet burger, dinner by fairylight, go on then! Despite being a burger bar, Haché is actually a really classy restaurant with soft lighting, lovely wooden floors, large mirrors and fairy lights dotted around. Very romantic, very un-Mc Donaldsy.They have a full menu of  steak, lamb, veggie and fish burgers but oddly no starters. Maybe because the burgers are so massive! And since you have to order fries, onion rings, veggie tempura on the side, you might be tempted to go overboard. Eyes bigger than my belly - guilty! Yum, love this place.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "D7dsu787KVsD0FMkRJPOJg": {
    "date": "5/2/2010",
    "text": "For me, this is a solid four star, but I'm going to give it a one-up as it currently reigns over my list of best burger joints in London. I love the staple burgers, the canadian, blue cheese, etc.. but for the more adventurous there's one with peanut butter (for real real), and a selection of veggie and fish for your friends that won't eat meat but you can't be bothered to give up your craving for a massive burger. BEST onion rings I've found in ages. That's a hands-down, it's the golden battered kind, not that odd crumbly dusted kind that comes in freezer bags. With charming lights and decor, this is a cute little stop for a comfort food indulgence which will keep you coming back for more until you've tried all of their burger range and then back a few more times to make sure you've picked the proper favorite.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "LOW3NbXyKb8kCCEfnFLX0A": {
    "date": "2/21/2012",
    "text": "The best burgers in Camden for sure- the choice is great and the service is good too. The restaurant is cozy and friendly...ooo and you can also get your burger in a brioche bun;) Yum.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fN9JJudVPYcSOCKEXj_kfw"
  },
  "tFXA4S11O-IhmEZ3Fdt3kA": {
    "date": "7/9/2010",
    "text": "2 Words... Onion Rings!  Maybe it is my former state fair worker inside but I love repeat love onion rings!  To my horror many restaurants here in London don't serve them and the ones that do aren't very good.  Thankfully my dear friend who knows my love of onion rings brought me to Hache.  Overall their veggie burgers are fine.  Not too bland or dry, but I've had better in other restaurants in London. The decor is nice service was fine but the onion rings are the best!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IhtATC36WJSuOXRXQbhQ1w"
  },
  "ZQL9V60IzxWqDnrqJVIn5A": {
    "date": "11/4/2009",
    "text": "So, I went to Hache after going to Church in Kentish Town (not bible-church, CHURCH-church...yelp it) so I have to say I can't reeeeemember a whole lot but there is one contribution I can make. They have honey mustard as a condiment. Not Dijon, but reaaaaal honey mustard. When I asked, I'd clearly forgotten where I was and what country I was in but when she showed up with my crispy frites and a small bowl of beautiful yellow sauce....I tell you, it was like a light was shining down. I heard a choir. It was one of the best dining moments ever. I'd go here and order fries and honey mustard anytime.AND...they had onion rings. Real, crispy, unhealthy onion rings that you can get in state fairs in Michigan (word, Thomas). Have never seen them around London town before. I wonder if I could order take out and just get onion rings and honey mustard....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "HI0jOPH6fBrabKcyAmsZqg": {
    "date": "6/18/2009",
    "text": "Went to Hache a few nights ago with some friends for dinner and I must say, I was very impressed. My burger was pretty good (Classique Anglais with cheddar added, I believe) and was also fairly huge and my friend's meals were also well received - between us we tried the duck burger (phenomenal reviews), the chicken moutarde sandwich (very good as well), and another burger (can't remember which). We also split some chips, wedges, onion rings, and another potato of sorts amongst the table. All were very good but it was far too much food. The only downside of the meal was the unexpected size of the bill - £73! My shock may be partly due to my foreign concept of how much things should cost (I'm from NYC) but it's not entirely.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J3pXjuQLVOMBFjqsviy2pw"
  },
  "fUxDsHKwgtwLnnX0GmpiUw": {
    "date": "11/12/2008",
    "text": "Haché has burgers to die for.  This restaurant is straight gourmet.  Also, if you're out with a vegetarian friend, there are lots of animal friendly dishes to choose from.  The décor in the restaurant is really warm and cozy.  The lighting is dim, there are mirrors surrounding the tables, the walls are brown and the candles are flickering.  If you want to seduce someone, taking them to this place would be the magic formula for getting jiggy.  It's not expensive either.  An entire meal including a glass of wine will set you back around £15.  So go.  This place is a winner.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "w5xIM9JIlWCd46gm2Q6O4g",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w5xIM9JIlWCd46gm2Q6O4g/o.jpg"
      }
    ],
    "user_id": "w7b1W-KHo7UUsnkg8ASo5Q"
  },
  "2UDMjQnfhKN57bjhmg5c_w": {
    "date": "1/9/2012",
    "text": "A firm favourite for burgers in London. Small and intimate, decorated with fairy lights- perfect for a casual date or catch up with friends. The burgers are juicy and have great flavour. My personal favorite is the blue cheese- but others have recommended the Catalan - with chorizo and chilli jam! Very reasonable prices. Located on Inverness street in the heart of Camden there are plenty of small bars along the same road where you can go for a post burger drink!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8lhOc2ALAqKdmidG7DLFDQ"
  },
  "MLatt95YI6AnVPh6hC86ug": {
    "date": "11/21/2010",
    "text": "Super cute place in the middle of camden town. Would recommend it for sure! I had a 'mexican' burger complete with salsa and guacamole!! The breakfast burger sounded delicious as did most of the veggie burgers! the only one that sounded a little odd was the  Louisiana burger, which was topped with peanut butter. Don't get me wrong, I love peanut butter, but i am not sure if peanut butter goes with a burger...maybe i will be adventurous enough next time to try it!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "99fpq_E-sUli_3hX16D4lg"
  },
  "I67T6Hd3E7XBHwiFO2DeuQ": {
    "date": "1/2/2009",
    "text": "So I've been dying to try Hache out for some time.  Time Out have claimed them to be 'Burger Restaurant of the Year'. I'm sorry, but it ain't.  Sure, the burgers are good - I had a beef burger with goats cheese and capsicum - the beef being really good quality, but for almost £9 a burger, not worth it at all.Staff were efficient, if not a little boring, and the chips (£2.50, ordered separately) were enough for two to share and pretty good.Overpriced, tasty but not amazing at all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "7xESC1UVfa0lePLAx_Zxog": {
    "date": "1/22/2010",
    "text": "This place uses really good ingredients for their burgers.  Their onion rings are really something that I crave. But ciabatta bread for the bun, I don't know, it doesn't do it for me. I would definitely go to this place on a date because it looks really nice and it is a classy way to get your burger on with a girl.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "4FKmGgsA-fPauaMuIWlwRw": {
    "date": "11/24/2008",
    "text": "The Hache classic is a really good burger, juicy and well seasoned. It's not really a burger as we know it i.e. made with mince but a chopped steak. The rocket adds a peppery flavour but if there is one restaurant out there that does not shove the obligatory raw onion ring on then let me know.There is a small outside space but I prefer sitting in under the bonsai fairy lights that adorn the walls. The restaurant has a cosy feel and I have always had good service. Hache is a bit more pricey that GBK and it hasn't done any major expansion yet so the quality has been consistent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwW0B3I_1QkbzQhaLFOqrQ"
  },
  "WbfZyBHKAtOoI-LORcV-ug": {
    "date": "5/24/2011",
    "text": "Staff is very friendly.  All the food was super yummy.  I had the falafel blue cheese burger and fries of course.  It was the perfect size and the fries were great.  Check out the shakes as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CgAHokw5IXhN13xn0BLrTQ"
  },
  "QqDlqorlmKePA_3dlxRiLA": {
    "date": "7/24/2010",
    "text": "These are the Best burgers I have encountered in London. It's pretty rare for me to go out looking for some beefy deliciousness these days, but when I do, I want something that will undoubtedly slake my carnivorous thirst for blood-red rare beef full of flavor and freshness.  Hache delivers this sensuous experience in spades, with a smile.  Walking around Camden, most people probably eat lunch in the booths around the river (which is fine), but on a particularly hot day in July, sitting in this cool, comfortable restaurant - just a bit out of the Sunday mobs, drinking an ice cold beverage and feasting on a Scotch Beef Steak Cheeseburger was an absolutely perfect respite to recharge our batteries for the afternoon.  Every aspect of the meal is prepared carefully and thoughtfully, from the rich ciabatta buns to the fresh and crisp dark green lettuce (no iceberg here).  The meal was wonderfully filling (especially considering the price) without being heavy or greasy.  We are going back tomorrow, and I have been looking forward to it all week!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-X201I12QzTxnwt9YJiGg"
  },
  "o4GH33V9jx6waAxFthduIA": {
    "date": "7/5/2011",
    "text": "Love the food, cool interiors and laid back atmosphere. Service is good too. We try to eat here whenever we are in Camden town. Very reasonably priced. You can either have your burger classic style in a bun or with a salad.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWUt-JZO-4N8NkoXrbAEDw"
  },
  "P57QImjljzfDbebuRntqAw": {
    "date": "11/6/2008",
    "text": "We fancied a good meal before heading in out in Camden and this place looked tempting, as it is much more cozy looking as the burger places generally are. They have beautiful lightnings and mirrors on the white walls, candle lights and nice soft music.I had the veggie burger that came with ciabatta bread. The fries had to be ordered separately so they don't do any meals. The veggie steak was thick, but tasteless and the burger was very dry and struggled to finish it because it was like eating wood. The food was not worth the money, you could dine in a proper restaurant with the same money. It is a shame because the restaurant is nice and the service was good. Please be more creative with your burgers!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfEv9dd3pf3Diog86rus7A"
  },
  "lpHpUmdHirz_OZdbNZXdog": {
    "date": "7/3/2016",
    "text": "Everything on this cute is true! Friendly staff, good food, relatively fast service and a fun atmosphere that fits the surroundings. Great little spot mostly tourists but it certainly doesn't seem like it. I would highly recommend and would possibly be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArIAsBaU7Hk12zBA0Byrvg"
  },
  "10f-Fy2XQ5Kkmirwodg7mA": {
    "date": "5/16/2013",
    "text": "I must say I was left underwhelmed by my recent visit to Haché.I really do have to give them an A for effort. I thought the staff were all great and I really enjoyed the atmosphere and decor of the place. Although, I half wonder how comfortable it would be eating here with a full restaurant considering how close the tables are to each other rather than the sparsely populated lunchtime experience that I had.I felt that the policy of just serving hamburger on its own is a little mean. No sides, no chips. At least somewhere like Honest Burger - yelp.co.uk/biz/honest-bu… provides all you need right they are on the plate for no additional cost. To be honest I would not put this place anywhere near the same league as Honest. I ordered two side dishes which were the fries and the onion rings. I really like the little frying baskets that they both come in, however I felt that they did not taste particularly good and the onion rings were overly oily... saturated, in fact.I particularly hate restaurants that adds service to the bottom of the bill. So much so, that the BBC even quoted an infamous Yelp Talk Thread I started. I don't like having my own mind made up for me as to how much I should tip, however I hasten to add I do not have any complaints in the service department for Haché. Not only do they have many different variations of the regular moo burger and they also have lamb, vegetarian and also fish too. I think that a lot of creativity has gone into the menu, however I do feel that a lot of the flavours seem to be better on paper than they actually are on the palate.I would probably give this place another shot but with Honest being equidistant from my place it's going to be a hard fight to get me back there.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "8GBlmhF_kTB8Osl2qaXxdQ": {
    "date": "2/18/2016",
    "text": "My husband and I went here on a Sunday evening - it was packed!  Luckily, we had a booking, so we were whisked away into the back corner (perfect table ;)) quickly.  We started with the nachos, and as Americans, these were great nachos!  Nothing special, but made us feel like home.  I had the goat cheese burger and my husband had the Steak Canadian burger. Mine was heavenly.  Super perfect!  The sauce paired with the goats cheese and the avocado was perfection!  My mouth is watering thinking about it again!  And my husband's was just ok.  Unfortunately, if you're going to be a burger place, you need to have the burgers cooked properly.  He asked for his to be prepared medium-rare, and it came out well done.  Other then that, the flavours were great, just would have wished for a nice juicy medium-rare burger.  We split a side of potato wedges and they were awesome!  The decor is really cute and simple.  It's a nice intimate spot tucked away in Camden.  I know they have other locations and look forward to checking them out.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "8xWLA9Ki65KXxi8PKPP_4Q": {
    "date": "10/26/2013",
    "text": "Burgers burgers burgers.This place has a small menu consisting of burgers, fries, and some composed salads.I thought it was tasty but a bit pricy. I would go again- the atmosphere was really nice the service was enough to make me want to slap the waiter.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "v9rmihk15ssK3hqqTKuRxQ"
  },
  "aPDbfDe69DIX4QzPUDp2sQ": {
    "date": "1/19/2014",
    "text": "The service and atmosphere here are lovely but I found my burger very bland and the onion rings really oily. I realise that onion rings are fried but I know they don't have to taste like they are oozing oil into my mouth. I had heard such good things about this place that I went twice. But I won't be choosing to go again. It's ok, just not worth it. Also, I've been spoilt by all the wonderful places with chili sauce on the tables, so I resent the lack of chili sauce here. I have the impression they charge for some sort of chili jam and I didn't get a chance to ask if they had any table bottles.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tDRkkuWzEbpBwo823eFqSg"
  },
  "mDcCg0a5ahWIpCWg7WVRew": {
    "date": "5/28/2015",
    "text": "Great food and service. Great burgers - lean, great flavor (we had the Mexican); excellent sweet potato fries - crisp; excellent pulled pork sandwich topped with bacon and an onion run; good shakes (I had the peanut butter banana).  Cool little place. Clean, friendly and easy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XaZzTsqO4BnOgVuKbkhnzw"
  },
  "Qm954pOFsRhHW1VHavOJ8g": {
    "date": "4/1/2013",
    "text": "Quite possibly the most junior management and staff with the maturity of 16 year olds.  Embarrassing.  So why 4 stars?  The burger was really good--I had the Bavarian burger which came with some ridiculously delicious smoked cheese.  It was juicy and flavorful and loved whatever was on and in that burger.  So come early, put your name in and they'll call you, ignore the snide and incompetent staff and enjoy the food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "FPlET5Yy5-uBhKxZdWNzZw": {
    "date": "5/19/2012",
    "text": "I was craving a burger and decided to make a trip over to Haché in Camden to get my fix. The restaurant is really small and there was a bit of a queue, but it wasn't too long before we were seated. The staff was amazingly friendly for how busy they were. I ordered the 'Steak Louisiana', which is topped with peanut butter and cheddar cheese. Yea, it's a weird combo but I have fond memories of a burger in New Orleans with PB dedicated to Elvis that tasted amazing so I figured I'd give it go here. I ordered my burger cooked medium and opted for a brioche bun over the ciabatta option and added some jalapeño for some spice. Also ordered some Hache Frites.My burger arrived looking sinful and tasted wickedly good. The burger was cooked perfectly and the meat was juicy. The bun was soft which helped to soak up the juices. The meat was not as tasty as the Goodman burger in Mayfair, but the crazy toppings created an interesting flavor combo: beefy, salty, sweet, spicy. The peanut butter made it really filling, in fact it's 9 hours later and I'm still really full. The fries were ok.I'm glad I made it over to Haché. I dig this place. Burgers are good with interesting flavor combinations, service is friendly and they play good music. Yup, I'll be back. Only, perhaps next time I'll try to swing by ~3pm when it's not so busy.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eiyWzIIJhbuoF7fYWb0zeQ"
  },
  "dp8oEBoYnC8Xuag-uEcBwg": {
    "date": "12/10/2012",
    "text": "I'm not really that impressed by this burger place. We came in on a weekday around 6pm and the waiter cramped us onto a tiny table crowded by two other tiny tables and their occupants. We asked if we could get a less cramped table ... as many were empty ... and were told that the rest of the place was reserved ... Really? All of them? In the end they offered a table at the front. Not sure what the problem was, but they made it look like the tables at the front are the worst in the house. They are not.Anyway we ordered our burgers ... they come with no sides dishes whatsoever ... this seems to be the new trend. I really don't like the look of one lonely burger on a plate. Give me some chips at least. The burger in itself was a great size and yummy. The side dish we ordered extra was also yummy. The bill at the end with the massive tip added wasn't that yummy. I really like to make my own decision when tipping, especially as the service wasn't that great. Not awful, mind you, but not worth 12% either.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWAOEhPe-us-ScMTSF6nSg"
  },
  "ByudFObGwQBauI85CD671Q": {
    "date": "5/9/2012",
    "text": "The burgers are...alright. I was once convinced (don't throw rocks) that England would never produce a burger that would satisfy my fat American tastebuds. However, MeatLiquor turned that on its head and Byron doesn't do so bad for a chain restaurant. I've enjoyed meals at Hache and the ambiance is cute. But the food is just...alright. Beers are tiny and overpriced and it feels as if they're trying to make their burgers fancy without really putting the quality into it. Still, if you're craving a burger, it's not a bad place to stop. I will give them two thumbs up for their veggie options, too. All of the veggie burgers I've had there have been delicious and interesting.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "oNQhXq9HIgLq82mqwB_3xg": {
    "date": "7/26/2011",
    "text": "Ok. I did it.What you ask? Well, I ordered the Louisiana Burger, of course.What is a Louisiana Burger you ask? Well.... Let me tell you! It is one of those things upon initial reading, everyone goes \"Eww! What?!?\"But then you think about it for a minute. Really think about it. Imagine-taste it... then you think....Hm.... maybe this could work?Burger + sharp cheddar + peanut butter = Louisiana BurgerSound like something Britney Spears might eat? Yea, probably. Ok, ok, but was it any good?It was good. Mostly novelty, probably wouldn't order it again (it is quite heavy), but *shrugs* not bad, and not nearly as weird as it sounds. One of the other reasons I like Haché (yes, I actually know how to make that little dash) is because of the variety of dips. You may not know this about me, but I am a dip fiend. Chilli/sour cream is a good combo, as is honey mustard. Mmmm, dips. Chips/onion rings = necessary DIP TRANSPORT AGENTS.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ieg1z6bc94U_RfS-OGxQ_A"
  },
  "PzIkrSNAJsNMzhnw3N2hOw": {
    "date": "8/1/2011",
    "text": "Others have said it before - incredible burgers. It's always a good sign, outside of the USA, when you're asked how you'd like your burger cooked. Why, medium-rare of course!Nice and relaxed in here. Not your typical burger joint. Fairy lights, wooden flooring, nice little open decking.And the onion rings are some of the best I've had in London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "r-PurVn3XVAwXxZYbbRh0w": {
    "date": "3/12/2012",
    "text": "What the hell am I doing eating hamburgers in London? I'm American after all, surely I couldn't possibly expect to get a decent burger across the Atlantic any more than a Brit could expect a decent cup of tea in the USA. Or so I'm reminded. But my fellow friends and countrymen, imagine my shock when I took my fellow Yelpers advice and learned that, yes, Virginia (or Massachusetts, California, Texas, etc.) there is a decent burger in London. In fact, this place could exist in Anytown, USA and do pretty well. So what blew my mind? Something called the Louisiana burger. Chunky peanut butter and cheddar cheese on a thick quarter pound burger on a brioche bun. I added bacon, because everything is better with bacon. If the owner/chef/whoever is reading this...believe me, this is amazing with bacon. Holy $#*@, it was so good...I think I may have squealed a little when I bit into it. I certainly inhaled that burger like a little piggy.As no burger is complete without some sort of traditional side, I also had thick cut fries and onion rings which were fried in light, cloud-like batter. Those were also a clear win, as good as any rings I've had in the US. Ryan got a duck burger he liked it, but lamented, rightfully that it is not truly a burger as burger should be ground...for a place that's called Haché, they really ought to reflect seriously on that point. Despite not getting ground duck, he seemed pretty pleased with it. So, the downside is seemingly as is the case with every burger I've had in the UK...the burger trended on the dry side. I don't know what that's about, but fortunately for Haché I'm giving them a pass and calling it a cultural thing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSdm_8nfHjHsgB2HpBdHvg"
  },
  "Jx0lGEifjILFZkhBl5QuUA": {
    "date": "12/8/2010",
    "text": "My fiancée took me to Haché burger on Halloween. I must say, I walked past it many times, on my way to her home, intrigued since I like gourmet burgers, but not necessarily chain restaurants.My experience was good, smiley and prompt service. I ordered the Mexican burger. As with more Gourmet burgers, I ate it in pieces, usually as two pieces of accompanying bread and the burger meat independently, rather than all together. We also ordered the yummy onion rings, which were VERY good.The Mexican burger was so so, but I guess that's what happens when you order unconventional fusion things off the menu that haven't been perfected by survival of the fittest Mexican burger competitive force due to lack of Mexican burger rivals.I think i'll go more classic next timeThe ambience was generally cosy and cute with the random fairy lights and low lighting as well as the random cute Halloween fixtures, including an electronic Vampire movie theme tune decoration that the staff found quite amusing to activate EVERYTIME they walked down the stairs towards the toilet. Amusing at first, but not when you're having a conversation.Whilst the food and environment was nice for enjoying a burger in a cosy, intimate environment, it was a bit pricey for what it was. I will return, one day, but not sure if I'd make a special trip just to go....",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "uhknG4-28gVrwTz9SU4qTA"
  },
  "J2Vu7p4ghNZT5MTW4Njabg": {
    "date": "3/27/2011",
    "text": "Yes I'm American, no I'm not an expert in burgers. But I do enjoy quality beef and this place has it.Ordered the basic and added bacon. Medium rare, tasty, even with the ciabatta bread. I think good meat needs a more substantial bread like that to keep it together. So no qualms from me on that subject. Moving on!Ordered the big \"skin-on\" chips. Tasty and served in a cute little fry basket! Should have read the yelps before I came and ordered onion rings. :( Next time I guess.Loved the atmosphere/decor. Super cute, low-lit, romantic. Ikea flower fairy lights all about. I also liked that there was a nice mix of casual and dressy people. Some fancy dresses, some hoodies, some trendy people. Hey, Camden, what can I say. The one thing that immediately sprung to mind from this experience. It's about the same price as gourmet burger kitchen with much nicer atmosphere. Go here instead!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "aSVTAoYbpjQiP4OTUnp2vQ"
  },
  "jZAg2_pcy3B64QKfuhAhwg": {
    "date": "7/27/2014",
    "text": "I consider myself something of a burger connoisseur, and although Haché seemed a little gimmicky, the restaurant when I visited was nearly empty (the market nearby was packed), and some of the reviews here were less than glowing. . .how could I resist a burger with cheddar and crunchy peanut butter? So weird it must be good, right?Unfortunately, although peanut butter and cheddar together will undoubtedly clog your arteries with the best of them, it just isn't a very flavorful combination; the dish really needs a sauce of some sort to make it interesting. If nothing else, \"Louisiana burger\" connotes cajun, creole, tastebud-popping zing, which makes my bland burger doubly puzzling. The beef patty itself was cooked perfectly rare (per my request), albeit rather small. The brioche bun ought to have been toasted more, and the wedges were adequate but could have used seasoning. There were no draught options, moreover, and the bottled beer selection was limited and disappointing. They have a better selection of red wine by the glass than you might expect, however, and my merlot did the trick. The service was efficient and friendly enough that I left a small tip despite the underwhelming food. £20 for a burger, wedges and a glass of wine isn't the end of the world as long as the food and overall experience holds its own. By this logic it's difficult to recommend Haché outright, though I'd give it a second chance if someone else was paying. A solid, on-the-fence 2.5.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7sooBT7tYeOqnrN0YqFJQ"
  },
  "6B42TCdrz1J0sIQuNJnOsg": {
    "date": "11/17/2013",
    "text": "Not a bad burger! I had a basic cheeseburger and it was pretty moist and the cheese had a great flavour. My friend went for the chicken burger which was also pretty well cooked.As burger chains go, I preferred this to Byron.Negative about this place was the staff. It was impossible to get their attention and when you did they were pretty rude.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qcVeWS0tk8K-GXRKtatNsg"
  },
  "LSWUKrVe6CtFjupfFcZkzA": {
    "date": "2/20/2014",
    "text": "Amazing service and food that is to die for. There are many restaurants in Camdentown but this is the only place I come back to over and over. I strongly recommend this restaurant next time you want to eat dinner after a long afternoon of bargaining and shopping around the stalls.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SoJNsY0WU3gwxl9qSitunw"
  },
  "muLzUZBax5hIr2D2alxEZQ": {
    "date": "12/10/2008",
    "text": "This place kicks the arse off all other burger places, hands down! We stopped-off here one sunny afternoon, we saw you could sit outside and fancied watching the world go by. My boyfriend is a meat eater, I'm a pescatarian, and there was something for both of us here (including a few nice veggie options).I ordered a gorgeously succulent tuna burger, perfectly cooked with salad and chunky chips. The burger was really out of this world, I can't complain. I loved sitting outside too in the sun, made the whole thing so much better. My boyfriend's burger looked awesome, fresh and pink in the middle, which is how he likes his beef (sounds a bit weird but you get what I mean!).Anyways, enough talk of pink beef, this place really rocked and I suggest you check it out, summer or winter, it really is worth the money!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JPUigkiDu5AsYrDfwVuKJQ",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JPUigkiDu5AsYrDfwVuKJQ/o.jpg"
      }
    ],
    "user_id": "diWrBDE2A-943HJJJsbiAA"
  },
  "chFwKwXQoA8Lk9zZeU7nUA": {
    "date": "12/19/2008",
    "text": "Shopping is tiring work, especially shopping with my friend who was looking for a particular army khaki jacket. Almost 4 hours later with very tired feet (and I was wearing my ultra comfy Uggs!) my friend had finally found the jacket. She was happy and I was absolutely starving and almost kissed the pavement when we stumbled across Hache. Just one look at the menu and I knew that hunger pains would soon be a distant memory.I had trouble trying to decide between the Catalan burger (chorizo. chilli and tomato jam), Canadian (sweet cure bacon and cheddar cheese) or the Sicilian (parma ham and mozarella cheese). I opted for the Catalan burger with chunky chips. The burger was a little pricy at almost £9 and the chips had to be ordered separately. I didn't mind paying though because the burger was fantastic and the service was brilliant. If you're calorie counting and steering away from carbs- you can have your burger with a green salad instead of the ciabatta bun. I will definately be returning to Hache- it's a shame there isn't one in Westbourne Parke!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "080AAUERFtaPLlSI4JJhIA",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/080AAUERFtaPLlSI4JJhIA/o.jpg"
      },
      {
        "img_id": "i3GLROMPLbP8xcxb7odfbg",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i3GLROMPLbP8xcxb7odfbg/o.jpg"
      },
      {
        "img_id": "pVLHEaZvpbc3LNwfXW3Jcg",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pVLHEaZvpbc3LNwfXW3Jcg/o.jpg"
      }
    ],
    "user_id": "ibGwYz5b6zO5FA03b2EBxA"
  },
  "4MQtXPFRFfpZTpNJNHE5Zg": {
    "date": "9/30/2018",
    "text": "Tried the goats cheese burger, which was fantastic. Fries were nice. Could improve their packing quality.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTELXD26gneRDZnP8m2xLQ"
  },
  "c2md-poSkH99DFYsWrVb7A": {
    "date": "10/11/2017",
    "text": "I was attracted to one of the \"specials\"...a burger called The Southerner.  How fitting, right?  It had pimento cheese on it, which is something I can't stop loving.  But this version was both different and good.  Also, it was too spicy for me.  Overall, the burger was really really good, for lack of better wording.  I do still think about it when I crave a burger, which is now.I also ordered the poutine frites, as an appetizer.  It was creamy -- not a bad thing, just a note. The portion was so large, on top of the fact that I just couldn't stop eating them, that I didn't really have enough room to finish my entree.  That perfect burger... This little restaurant is at the end of one of the side streets in Camden Town.  Not to be missed if you're craving burgers and fries.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "O_BtE3UYrvpFa-WnngpKDQ",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O_BtE3UYrvpFa-WnngpKDQ/o.jpg"
      }
    ],
    "user_id": "uf57PZhQWo8gAsQukDIXJA"
  },
  "TOr7wn87c1e9ULjqK2n8SA": {
    "date": "9/22/2017",
    "text": "This place is so good I finished my burger before I had a chance to take a picture of it! A definite recommendation for anyone looking for a great burger in London. Their menu has a wide variety of burger flavours to choose from (not as many cheese options though). My husband and I had the crispy squid, the Bavarian burger (added egg), the steak cheeseburger with guyrere cheese (added pickle), sweet potato fries, and regular fries with truffle sauce. ALL THE FOOD WAS THE BOMB!And, they also have a really good looking sweet potato burger that I am 100% trying the next time I'm here. What do you know... a burger bar that is vegetarian friendly!! Aside from the food, the vibe is far superior to the typical stuffy, unkept atmosphere that is all places British. Music was great, the service was excellent, and the decor was well done. I particularly enjoyed the pink glitter paint on the ladies bathroom door! If I had to offer any constructive criticism to the restaurant I would say add more cheese options and either get rid of the chair cushions or attach them to the seats! Every time one of us got up the cushion went flying to the floor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MG0XGCFAlYL6KkPdM6Q1Jg"
  },
  "bm9GHE_UZonnsIs87-1XNg": {
    "date": "9/3/2017",
    "text": "Great burger place with many different burgers. I had the rosemary lamb in a ciabatta bread (lamb shoulder with tzaziki sauce). It was cooked perfectly and very tasty. Friendly staff and reasonable prices for the quality you get.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QaPOcg1moWCKBHRON-zGTg",
        "caption": "Photo of Hache - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QaPOcg1moWCKBHRON-zGTg/o.jpg"
      }
    ],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  },
  "qdDLQ-Xzm6opmu76ojUK5A": {
    "date": "8/19/2016",
    "text": "Hatché offers an array of beautiful burgers to sink your teeth into. Located slightly away from the crowds of Camden, on a little side street only a five minute walk from the market, it's a nice spot to unwind away from the hustle and bustle. I opted for the Steak Le Triomphe des Truffes - a beef patty topped with homemade truffled Gruyère cheese, a sweet balsamic truffle glaze and pickled onions. BOOM! The waitress suggested I select the brioche bun (as opposed to the ciabatta) to keep the flavours light and bring out the truffle. I did as suggested and wasn't disappointed. The burger was juicy, succulent and full of that truffle flavour I was after. I also shared some sweet potato fries and corn fritters with the table. Both deliciously moreish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KiQkrDaFk-3vrrxt-WhOfw",
        "caption": "Photo of Hache - London, United Kingdom. Steak Le Triomphe Des Truffes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KiQkrDaFk-3vrrxt-WhOfw/o.jpg"
      },
      {
        "img_id": "d11y-T98IJtSFsyZSSWtJg",
        "caption": "Photo of Hache - London, United Kingdom. Sweetcorn fritters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d11y-T98IJtSFsyZSSWtJg/o.jpg"
      }
    ],
    "user_id": "iInbZ52gQCa9eXhlgTZN-A"
  },
  "ODF46N2o_10LYAuoDLHDzg": {
    "date": "3/8/2016",
    "text": "A bit more casual than some of the others of the chain, the restaurant is still fabulous.  The burgers are amazing with fabulous choices of toppings.  And you can't fault the sweet potato fries.  My friends who came along for the first time were thrilled with their options and enjoyed the glasses of wine that they chose.  This would be the place I'd take someone on a first date, in a small group outing or even to dine alone.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VMCHlekbDajH0W024np9xA",
        "caption": "Photo of Hache - London, United Kingdom. Dirty shake",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VMCHlekbDajH0W024np9xA/o.jpg"
      }
    ],
    "user_id": "5dgWqgYcJPeFmRPZ5bxiQQ"
  },
  "NDeOfFsDQphiDi1e3j30Fg": {
    "date": "8/27/2017",
    "text": "Super *ucking expensive for a burger place. 12.89 pounds for am just the burger, no fries or drink. Its the price for lobster in the US. Nothing special about the burgers either",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_TD-KhWRd7iXvcHwfnzMw"
  },
  "aES5ROxHZ7wDLLQY9xwE0w": {
    "date": "5/29/2015",
    "text": "They've stopped cooking their burgers rare - I ordered mine the closest I could (medium rare), and it came cooked through.Burgers are still tasty however, but £4 for a tiny coleslaw and a small basket of wedges was a bit of a rip off.In a capital swamped with burger joints, it's a tough crowd, and I'm afraid this visit wasn't consistent with my previous ones.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "SL0iw_7fIb8jzTLydIDH3w": {
    "date": "8/11/2015",
    "text": "We discovered this place by random when we saw their fancy billboard at the Camden Underground Station. It's located in a quiet alley (side arm of the market) next to a comic shop. As a vegetarian I ordered their falafel burger. Personally, I feel like there should always be the option to go with an actual veggie patty, but this wasn't too far off. They also had a Portobello Burger on the menu (if I recall correctly), but I don't care to have those between a pair of burger buns. The burger tasted pretty good, all ingredients were fresh and looked like a model burger (really tall- watch out for jaw lock). Had fries on the side which were served in a metal grill- looks good but rather unpractical as you'll end up getting salt all over the table.All in all, a nice place with good food and great atmosphere, though I'd recommend it more to meat-eaters. ;)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6iQcFCbPpuC5JzaXx8gFkg",
        "caption": "Photo of Hache - London, United Kingdom. Hache Falafel Burger, mineral water and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6iQcFCbPpuC5JzaXx8gFkg/o.jpg"
      },
      {
        "img_id": "_0xr3XvAK6MfJDrfjXI1CA",
        "caption": "Photo of Hache - London, United Kingdom. Hache Falafel Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_0xr3XvAK6MfJDrfjXI1CA/o.jpg"
      },
      {
        "img_id": "jORKwLwkhyRqXowktR_CKA",
        "caption": "Photo of Hache - London, United Kingdom. Hache Falafel Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jORKwLwkhyRqXowktR_CKA/o.jpg"
      }
    ],
    "user_id": "OAMO5MHuF1vMzllhRBsoSQ"
  },
  "1frlLjdHUTdutnTu14Axpg": {
    "date": "8/20/2016",
    "text": "Excelente!Great food, very tasty burgers and friendly service. Had the Bavarian and Lamb burgers and they were both excellent. Perfectly cooked, amazing flavors and good quality ingredients. I definitely recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfvVvKutdT3P306aqECkbA"
  },
  "tnBh8cXEii_hfXJKE7UCSg": {
    "date": "1/11/2016",
    "text": "Really lovely place to stay with friends. Nice atmosphere, dimmed lights, bling bling decor, sweet girls staff.Very very good burgers - had the goat cheese one.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MTgnt34ISlX3rEzPc3Vxw"
  },
  "oj9s_clyulADlJLHEAicCw": {
    "date": "12/6/2015",
    "text": "After spending sometime walking up and down Camden High street I seen a poster board for this place.Tucked up a side street the place was easy enough to find. I entered the restaurant at approx 7pm. If was very busy but I got seated. The menu is pretty straight forward offering gourmet burgers. I settled for a beef burger & sweet potato fries. The food arrived within a reasonable time for me, despite the restaurant being really busy. The flavours and combinations I. The burger were really tasty. The service was good, but being sat opposite the door - meant I had people standing staring at me while I ate. Next time I'll make a point of asking for a table out the back of the restaurant, there appeared to be a better atmosphere. Try this place out, you won't be disappointed",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pPswzmLMuZLYGbAL_mlQQw"
  },
  "KFRghXbJMBtCjY57B_EUsw": {
    "date": "4/10/2016",
    "text": "Great burgers! Simple yet sophisticated. Helpful  and kind  staff! Try the ginger beer. Also, you should order both the sweet potato fries and the garlic fries.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HLxqvrAnXbHwVHUNWRBUVQ",
        "caption": "Photo of Hache - London, United Kingdom. Burger. With sausages. Nuff said.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HLxqvrAnXbHwVHUNWRBUVQ/o.jpg"
      }
    ],
    "user_id": "woNehBDq8_xvyRZfvq7DIQ"
  },
  "DnGcLesuZENebdoqfivFgA": {
    "date": "7/11/2016",
    "text": "One of the best burgers I've ever had in London (and believe me, I had more than a few ;-)). I always go for the classic burger but you can choose the bread (brioche or ciabatta), the way you want your beef to be cooked, etc. The fries are good too, so is the salad. These burgers are amazing, especially after a long and tiring walk in Camden lock :p",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mbd96vav6U9NXenVrFtt5A"
  },
  "9iY2330tErJ6Du-xrZACsg": {
    "date": "6/27/2017",
    "text": "Honestly one of the best burgers I've ever had. Chose Steak Royale (grilled goat cheese, rosemary and caramelized garlic). Also had the truffle fondue fries, good but not awesome. For desert, we tried the homemade banoffee pie, delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2yD8LxLxpAFUBYwSF7LM6A"
  },
  "FtnFVr6xuqxO3e4tJm7BOQ": {
    "date": "12/23/2015",
    "text": "As an American, finding a good burger place was hard, but this place was good but a little hard to find. They have unique burgers and it tasted fresh and yum. I got the barvarian burger with sweet potato fries and an Oreo Nutella milkshakes. Needless to say, it was a great last meal in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "agkOVhjwtqNrlTbKL738pQ",
        "caption": "Photo of Hache - London, United Kingdom. Barvarian burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/agkOVhjwtqNrlTbKL738pQ/o.jpg"
      }
    ],
    "user_id": "jEhlGSfy6uMuLWLub8SrzQ"
  },
  "d74EEKbALdp-Q5_oyUPKfw": {
    "date": "4/8/2016",
    "text": "I am addicted to cheeseburgers so when I read all those 5 stars reviews I was really excited to try their burgers (and French fries)! I had the cheeseburger with French fries and my fiancé had the pulled pork one. Quite disappointing... The beef and cheese were ok but the brioche bun was way too dry, plus the special sauce they put in every burger is really bland. Icing on the cake the French fries are not better than the macdonald's ones.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yfW9H3NdSQvz1BQEyWGL2g"
  },
  "2FLc-8smNpUXEJ_RB2Cy_Q": {
    "date": "7/7/2016",
    "text": "Wonderful atmosphere and staff...burgers are good but it's sure hard to beat anything I can get back home in California :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zz61Rhq4wW4UNSCSvXjJJg"
  },
  "O7OuYNfuyftEDW3IXcGa4w": {
    "date": "9/10/2016",
    "text": "Delicious burgers and friendly, helpful staff! They had quite a variety of burgers, including a vegan option that sounded really good. I had the steak cheeseburger, and would say its probably one of the best burgers I have had!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wtchdsVEwZ86j4izVPRMhw"
  },
  "NTysiIOF-iVA5Ah0Vcb0yQ": {
    "date": "7/8/2015",
    "text": "Just awesome.Mediterranean burger based on lamb... One of the best I'd ever eaten.Sweat potatoes, first time too, excellent",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZpsyHGYbVOdppbf9GeMyuw",
        "caption": "Photo of Hache - London, United Kingdom. Lamb buger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZpsyHGYbVOdppbf9GeMyuw/o.jpg"
      }
    ],
    "user_id": "sAFnnUibU_qMw9SADKp2fA"
  }
}