{
  "jvcL5uBE5n5lyx7f_nLtrA": {
    "date": "3/26/2013",
    "text": "Really, really good Indian food for not a bad price. 2 Lassis, an order of Garlic Chili Naan, Chicken Tikka Masala, and Chicken Tikka Kurma was all just under 30 pounds for two people. Service was good, if not a little overbearing at times. Lovely decor. Definitely a good place to go for good Indian food in London!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NPH3GB1Oub00Beh7pcwM_Q"
  },
  "L8St1RObKsBWRjl-N4mqZg": {
    "date": "1/18/2009",
    "text": "Prepare to delight in finding tasty indian food in a street packed with many alternative eating destinations. Ignore the polite hawkers on Brick Lane with their promise of free booze with your meal, and continue on your pilgrimage to one of the gems of the East (End of London). Muhib manages to separate itself from the crowd by having a delicious attitude toward spicing, which means that each dish tastes different from the next. For veggies, prepare to enjoy the most fantastic Paneer Shaslik - that's not on the menu by the way, you'll have to ask. While it's certainly not the cheapest restaurant on the strip, Muhib offers good quality, well made dishes in decent portion sizes and a conversation-friendly environment. I'd recommend brightly-lit Muhib for group meals as opposed to romantic dinners, and get dishes for sharing to enjoy diverse curry flavours. Price: roughly around £20-£25 per person",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RLc1gawYNdyPyP02QAVHxg": {
    "date": "1/2/2017",
    "text": "Probably my most favorite Indian Restaurant that we came across during our trip to London. We missed the dinner rush so we had no wait. It wasn't as trendy as Dishoom but food was much better here and the atmosphere was still nice and clean.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kK-boyiP8XB9a_sTKgHQ1Q"
  },
  "GLKm2QWumvPQWiBgBYFIjA": {
    "date": "7/16/2016",
    "text": "Pretty good food at a very good price! Not the best indian i've had but was up there and delicious. Excellent value for money and really friendly, efficient service throughout.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgPRvlVyKjIw8EhV8NgZig"
  },
  "tg0o8gVz3Cc0HxvD-4zQxA": {
    "date": "8/31/2015",
    "text": "A friend and I decided to come in here on a Friday night when looking for a curry house on brick lane. Although we were a little torn between trying out one of the neighboring restaurants that were offering free wine and champagne, we decided to go with yelp recommendations, and we were glad we did. Muhib was pretty packed but they were able to sit us right away. The house red and white wine were 8.95 which was great if you are looking for somewhere cheap to eat and drink. We decided to share 4 veg dishes and had the popadom and dips to start. My oh my the dips were incredible, by far the best selection I have had in London. I have no idea what the different options were but all of them were tasty and incredible. By the time we got through those we were already full, but when the entrees came we managed to scarf those down as well.  We went with one of the lentil dishes which was good and incredibly garlicky, the alo gobi, which was a small portion but also good, the vegetable curry, which was also decent. The highlight of the meal was the vegetable korma which was incredible and I would go back solely for this dish. We ordered naan and mushroom rice to go with the veg dishes but really had wayyyyy to much food. All in all a tasty find on brick lane that I would definitely go back to, with more people, so that I don't feel physically ill upon departure.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ictxkjtvyiqePqAt4Deaow",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. incredible curry and veg dishes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ictxkjtvyiqePqAt4Deaow/o.jpg"
      }
    ],
    "user_id": "kgiN2z5AIvcMK5PIwFLrsA"
  },
  "Z5hiHzzOluzw69DjNxjnHQ": {
    "date": "10/23/2014",
    "text": "WowThey are really nice on the street til they get you in the door eh?This was actually a \"yelp find\".The veggie dishes were good. The service was ok---The chicken tikka masala and chicken korma I ordered were so sickeningly sweet I couldn't eat more than  bite or two.There was nothing wrong with the meat it was just terrible sugary and that is not how I like my food---regardless of what is considered authentic.I would not recommend Muhib to anybody nor would I return.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9rmihk15ssK3hqqTKuRxQ"
  },
  "jVn-wwciRJL363eWEch21w": {
    "date": "6/14/2014",
    "text": "Being an indian, I expected some solid curry after reading good reviews, but the experience was that of a stark contrast. It was by far the worst visit ever.Before i even get to the food, the service was impeccably bad. We had a reservation at 9pm, but had to wait atleast 20minutes to be seated. Then to top it off, our orders took a whopping 45minutes to arrive - which is unacceptable.When the orders did arrive (after reminding the waiter about 2 times), there was the wrong curry served. We order for a balti curry, and they served us chicken tikka masala (which they made extremely spicy - not the kind of spicy that appeals to the palate and has a sophisticated blend of flavours, but simply a downpour of chilli powder). The chicken korma felt like a Tesco Chicken Korma with a huge amount of sugar (now i would prefer the Tesco one anyday). This could go on, and on...but in a nutshell, the worst experience with service and food. Have you lost the plot, Muhib?",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hndG1hgPPXnWjyKoH_dVww"
  },
  "Yu3l_t10PXDMt_85JIeoGg": {
    "date": "5/18/2014",
    "text": "All review sites were raving about this place and they were spot on with the food! Loved every bite. As a meat eater I was surprised to like my friends veggie curry more than my chicken tikka masala. The service was nice, but it did seem rather rushed at times. Obvious moments of a desire to turn the tables. That said I'd still recommend going. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwMHtbaTYh7yt4yBpPpJgA"
  },
  "uHfrH-6uXzdsmqW3YTQ-nQ": {
    "date": "8/3/2014",
    "text": "Not being Indian, but having had great Indian food on past visits to London, found this place through Yelp. Loved the food, service and atmosphere. A couple at an adjacent table told me that they live in the area and , although sides of Brick Lane are lined with Indian restaurants, they always choose Muhib, as \"it's the best in this area of London\".",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDO_BxFC2Xa5nlLeBrwwOQ"
  },
  "wJG9NbC63rA6WWvj2QahIg": {
    "date": "9/23/2014",
    "text": "I am already a big fan of Balti/British Indian food, but this place is great. I have tried 2 other places on Brick lane and this one is my favourite! Authentic delicious food, friendly service and good value for money.Tip: Haggle with the guy at the door for free drinks or discounts on your meal!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7x2TTwj3p4pWBg3AAs33iw"
  },
  "VIBnf1c_w_RH42MJMgsC_Q": {
    "date": "11/6/2013",
    "text": "Seriously - one of the best chicken tikka masalas I have ever had - a little sweet with lots of interesting favors. We also had the butter chicken, which was also really tasty.Prompt service as well. Definitely would recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAwbE76V0V1tomze4TQG9g"
  },
  "elSDXpK9UdEvW4KixG4wyA": {
    "date": "7/29/2015",
    "text": "Really satisfied with quality, freshness and taste of food. Great service - just as it was mentioned on trip advisor - great food and service.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ii0NXGAHgmKtemgKaK79QQ"
  },
  "WAUaykbU7yOHI0M-R2nROA": {
    "date": "8/5/2015",
    "text": "Out of all of the choices on brick lane, the yelp reviews were the final factor for us. A quick table clear up meant they were able to sit the 5 of us quickly but unfortunately that was the quickest thing about the service that night. The food was great but hugely let down by the lack of response from the staff. Having to ask multiple times for water, drinks, cutlery & finally the bill soured our experience of this place. No apparent reason why but if you fancy a quick bite then maybe this isn't the place for you?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KlGiJ6EU2eupeBbthH3vA"
  },
  "Ntwsegri_npTa1PJaJhgfw": {
    "date": "8/21/2012",
    "text": "Food: The Food was the best Indian food we have ever tasted, and we have eaten indian food all over the world, including in India. The portions were plentiful, the flavours strong and were distinct to each dish. Decor: The restaurant has beautiful china ware, in a nice looking restaurant that is slowly showing its age (seats which were clearly expensive and custom made, are showing their age) is very pretty and made us feel like we were in a fancy indian restaurant. Service: our waiter was prompt, polite, helpful, and friendly. Entrance: they have a guy at the front who tries to woo you to come eat there (all the restaurants on Brick Lane have that person. This guy was the least 'pestering' of them all, but we should have negotiated more with him. We got one free round of drinks, we have heard of others getting that, a 20% discount, and a free entree. Perhaps at less busy times, or perhaps people who were less hungry. I didn't mind paying full pop for the food (minus the first round of drinks) as the service and food were so delicious. I would go back there every week, but regrettably I do not live in London. Note: Muhib is farther up Brick Lane than most of the Indian / Bengali restaurants, but I highly encourage you to pass the others by and give this place a try.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IkjwRXu3R-O09HMh-rSmFQ"
  },
  "f79l834BV-qCmxDBw3j5cw": {
    "date": "5/18/2016",
    "text": "Fantastic food. Chicken tikka misala was cooked to perfection. Service was great and we didn't wait long at all.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AZqBEx4YX-25AcHiyF-oQ"
  },
  "vHfjZcyb9lfnKpWQbdwoQA": {
    "date": "10/24/2012",
    "text": "Walking in Brick lane and choosing a good place to eat can sometimes be quite tricky as everybody seem to have a great deal on. We chose muhib which turned out to be very nice food vs. some other I had tried in the past. The lamb saag was delicious and the 2 other chicken dishes we picked tasted great. With a free beer and 20% I think off the bill it ended up £10 per head and full satisfied bellies.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bFf4I49phDEzZO0SPgVu6g",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bFf4I49phDEzZO0SPgVu6g/o.jpg"
      }
    ],
    "user_id": "WsXZSZ-Zxqo2HIdvh7b4hw"
  },
  "is1NYT6ZASTl1BxOkdHuzQ": {
    "date": "4/12/2014",
    "text": "Outstanding Indian food, and an amazing value! Chicken tikka masala was the best I've ever had",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAWKSVeVtDgy_Nay-J_VKQ"
  },
  "VvoqlwLfn8gTDRW-PO1Prg": {
    "date": "3/19/2014",
    "text": "I keep getting \"pulled\" into various curry restaurants on brick lane only to be pretty disappointed, but I decided to trust yelp on this one and give it a try and it was good! The food is excellent and they serve booze which is always a plus.  We tried to negotiate the prices and/or some free drinks, but I am bad at that, so all we got was 20% off, but that's okay - it was good, the service was average, not overly-annoying and attentive like some of the others and the guy outside pulling people in wasn't too pushy. Hope this helps!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99hWXPtbpzXXbsL43RYuKA"
  },
  "yltwxM9CUh8KpmrC5cT6DA": {
    "date": "10/4/2014",
    "text": "Solid curry in the middle of the lively Brick Lane. It was one of the few that didn't hustle me to come in. Staff was very friendly. The curry was good but I guess I had high expectations so wasn't blown away.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SpWwPtP1QZwoFIr6v0p7Kw"
  },
  "FobazHtqonDw4eIzWKKDgg": {
    "date": "8/31/2015",
    "text": "Excellent food. We don't eat Indian food much so we ordered a smattering of items that looked interesting and none dissapointed. Well worth a visit if you are from out of town looking to eat something other than English food, which gets old quickly.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TCg6qQ1EtuzrNxMGfTbxw"
  },
  "oqlQPXgiURStAS_G99RHmw": {
    "date": "3/11/2011",
    "text": "Hi everyone. Long time no Yelp! Muhib is a great little Brick Lane Indian who offered us two free rounds of drinks with our meal. The food was great but the service wasn't particularly. There must be hundreds of little curry houses up and down BL but if you're not sure which one to go to you're always safe @ Muhib. Enjoy!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GIINDja0rTy0UmdUxAOOWQ"
  },
  "hqGI-qQgkVoIDiZ-e4PUCA": {
    "date": "10/27/2015",
    "text": "Really good, well priced Indian food near Shoreditch. Highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YxXdVehsy6XWL8ih-LB_Dg"
  },
  "yaTu1Nky0uoLP2ytvk1Vjw": {
    "date": "8/20/2017",
    "text": "Very disappointed with the food at Muhib. The chutneys we had with papadam were full of sugar and bland. We had 3 curries, they were all fairly bland and the lamb vindaloo just tasted spicy and lacks all the complex flavors of a good vindaloo. The garlic naans were also quite sweet, while they really shouldn't be. However, the service was really good and people were really friendly and polite. Prices were also reasonable. Overall not a great place to have the best Indian curry.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVb4Ejr0b-iYno91UASzDw"
  },
  "ZgGXNRUo4z47_pVdcSZM0w": {
    "date": "6/24/2017",
    "text": "The first time I ever ate Indian food it was here, 17 years ago, as an American student working in London for the summer. I've been a passionate Indian food enthusiast ever since. Fast forward almost two decades and I came back on vacation with my similarly enthusiastic husband and two children and it was even BETTER than I remembered. Insanely delicious. Don't miss this one.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "auPku0yuQnpplhIgudS7UQ"
  },
  "N2mlgI7aUTLVgZLkS2qKAg": {
    "date": "11/1/2015",
    "text": "Haven't been to Brick Lane for a while so chose a place carefully from Help reviews and it turned out well.The poppadom course was week above average with five reasonable dips out whatever you'd call them.  We took a while to order so were relieved when it came really quickly, everything turned up within twenty seconds of each other, it was actually slightly overwhelming.  The service was really good at all points.The meat dishes definitely had a surprising depth of flavour, the butter chicken was unusually good for such a straightforward dish and the hotter lamb dishes as good as you would hope for.  We had a good pick of vegetable dishes and the bombay aloo was a stand out with big pieces of potato cooked perfectly.  Portion size was good, the only slight down point would be that the daal portion was very small of you wanted to share it.I will probably come here next time I am on Brick Lane.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g4v_NCyM1Cp3L5Aogz2Z7Q",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Bombay aloo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g4v_NCyM1Cp3L5Aogz2Z7Q/o.jpg"
      }
    ],
    "user_id": "FnvXE9uk-RR8it8A4U4_KQ"
  },
  "1sr4u4-mGdrHLzcj0IGwjg": {
    "date": "4/26/2016",
    "text": "We decided to go to this establishment due to their being part of the Gourmet Society dining card.We arrived as a party of three at approximately 5pm and were served quickly and efficiently. The food was of a very high quality and we all thoroughly enjoyed it. The house table wines were also excellent. Would definitely return and recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CbhO4t39ZvrR6TTzUoRsOw"
  },
  "1fgRrIOiuBJTTHcdpr-prQ": {
    "date": "5/7/2017",
    "text": "Well I had a lot better indian food in my life, for more resonable price with much faster service. But the food was kind of good and not sure you will find any better indian around (just had the chance to try out this one).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbrxnF9rNMU43AQglqnndw"
  },
  "9kPORxnyp6G6DAozf46zbQ": {
    "date": "4/16/2016",
    "text": "After a long walking tour of the East End, we were freezing cold and looking for somewhere cosy. This restaurant proved to be a great choice. Welcoming and warm, the service was quick and friendly. We had the Lamb Tikka Malaya with pineapple, Chicken Passanda and Chicken Kashmir with banana and litchi. All were very good, with good portions, especially the Malaya.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RPkuW3E72ZH1Lp2RXt9kkw"
  },
  "j3Z90pVhaitIZB_WuVlBng": {
    "date": "6/21/2016",
    "text": "This is the best place we've been too in London. The food was incredible, and the atmosphere was joyful and welcoming. The flavors are astounding. You won't be disappointed. They even bring you hot steamed towels at the end to clean your hands.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yQuGOqiqtMXlizwqMBwvjw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yQuGOqiqtMXlizwqMBwvjw/o.jpg"
      }
    ],
    "user_id": "eASm9nUSGFk_edIDUnFGiw"
  },
  "hMdewGJfv6qOL5hRA34B1w": {
    "date": "1/4/2016",
    "text": "Yes.............. We were sorely disappointed when going down the street the night before after just landing in the city so we did more research and found this place.  If inexpensive, flavorful, delicious Indian food is what you're after, this is where you want to be!  When we went in the evening (late Oct 2015) it was packed and food came out a tad on the slow side (but service was attentive).  I have to say that the food is definitely worth the wait.  YUM!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "8rph_A-q3xw-jLl4Q3w4Xg"
  },
  "IZyfSYcnz3dBnknHdSJTUA": {
    "date": "3/23/2017",
    "text": "Great food with a quality staff and quick service. The chicken and lamb are recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f2rgM6lw6ng32xA3Ggd06w"
  },
  "59iLF54JNRHQwsVvekRZiw": {
    "date": "2/23/2017",
    "text": "Hard to find the right place on Brick Lane. Save yourself the headache and come here. Great service, awesome food, and a nice, clean restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MiQCeKre6Z3DA6zohILvWQ"
  },
  "hKNbnPua-NjLZA9As8uO3Q": {
    "date": "5/2/2015",
    "text": "Really delicious Indian meal. All the standard dishes available,  plus a few we do not seen often. We had lamb hydrabadi and jeeera chicken  (cumin seeds). The taste was rich and deep. Not especially hot from a spice perspective. Served in a sizzling iron dish added to its appeal.  Even the vegetables were worthy of comment. Really tasty. Cost for two was £30 for food. Very highly recommended if you are looking for an authentic,  very delicious Indian meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XMHp8pB_98z3yh0iruioZA",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Main course of Hydrabadi lamb, Jeera chicken, mushroom bhaji and Sag Paneer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XMHp8pB_98z3yh0iruioZA/o.jpg"
      }
    ],
    "user_id": "v_bpwNUl4Cjc8PsxQK0_EQ"
  },
  "xKLzmVvP8b5TYjhPIcd8TQ": {
    "date": "3/5/2014",
    "text": "A great little Indian place on Curry Lane. Not as obtrusive as many of the places, even though they do have a barker out front trying to get folks in to dine, but so does every other place on Curry Lane.  Attractive china from Churchill's. Decor is silk tulips and old prints, but it's ok. Comfortable seating.  Music can be a little annoying, but you go there for their outstanding food.     Papadum is very good...try it for an appetizer because the dipping sauces are a great complement, going from a sweet chutney to a spicy onion. Terrific curry dishes and the tikka masala is amazing, and they serve large portions. The naan was cooked perfectly, with just the right amount of spice.  Beer goes perfectly with the food, especially Kingfisher, the Budweiser of India.Good wait service and pleasant folks. They offered us a complimentary drink, but after the beer, we declined.All in all, a great place. Give it a try if you're looking for authentic Indian food.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SAlUD3-3sJFSMwGwZzO-DA",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Dining room",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SAlUD3-3sJFSMwGwZzO-DA/o.jpg"
      }
    ],
    "user_id": "bwhkCDZUx9Tc204dgjCHqQ"
  },
  "GV1kALwM5Xxjfc3TB2wiMw": {
    "date": "10/31/2015",
    "text": "First time at brick lane and I found this spot with a friend - was exactly what I expected. Fine curry and attentive service. I had the lunch special and thoroughly enjoyed the chicken tikka masala. The naan was some of the best I've ever had. The lunch special includes an appetizer and main dish for £8. Nothing fancy - good food in good portions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysafjbp3KMfC5ok7vmK0GA"
  },
  "HTrZ6FiGS8rs07hxhTG2WA": {
    "date": "4/13/2017",
    "text": "This restaurant has pleasant decor and the staff were efficient and helpful.  I enjoyed the meal although I got lamb when I has asked for chicken  (I like both so it did not matter). The popadom relishes were unusual and very good.  I was disappointed by the bill as I was charged over £5 for a pint of lager. The value for money overall was not great although nothing extreme.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CoFG04IVs9Ugmuf3xbe2vw"
  },
  "8S7m5cdRvFY1U16Kul3DiA": {
    "date": "5/21/2016",
    "text": "Simply delicious, excellent service and fair prices.  This was my first time to visit Brick Lane and I didn't have a recommendation otherwise, so I went with the place who had the guy selling me on the street most effectively.  The entire street is filled with he delicious fragrance of Indian cuisine and I didn't go wrong choosing Muhib.  Loved it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_BD2cER7JZr4IdGjrK-IPA"
  },
  "Ufn90ErYbTXmixHz2mqPVQ": {
    "date": "5/15/2017",
    "text": "Was overwhelmed by the amount of touters trying to get you to come into the Indian restaurants along Brick Lane. Go to Muhib and enjoy the tandoori chicken and naan! Absolutely delicious. So glad we listened to Yelp reviews to pick a place. We did not need a reservation to get a table and were seated immediately.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAr0yI7IUszp6v04BC3TIA"
  },
  "SoW-UyB55u49_ofxSqwaqQ": {
    "date": "10/26/2016",
    "text": "If you've never been to Brick Lane, which is known for its Indian restaurants and where people try to entice you into each one with offers of 20% off and a free drink,  it can be tough to know which door to choose.  We ended up at Muhib, and were very happy we did.   Each dish was absolutely delicious, and the entrees were large portions. After appetizers,  in fact,  we realized we could have split our entrees. The staff was polite and attentive. We'll go back on our next London visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZFUiN8lj_S8s4mCZ-MeezQ"
  },
  "jnXaiKB1EPbtT5YiQYt_gg": {
    "date": "7/7/2016",
    "text": "Food and service were very good.  We liked the sizzling dish with chicken, tomatoes and onion the best. Garlic naan was good but I like a little more garlic. Butter chicken and chicken tikka masala were good but a little on the sweet side.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ajoYAYEvB6GdLcG2_GWeAQ"
  },
  "jrckVYl5sADME364pfHqdw": {
    "date": "7/25/2016",
    "text": "Great dinner with friends!  Spacious restaurant with AC.  Very accommodating and gracious staff!  One of our fav meals in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aUCHHX2TsS9xDUK5k-z1SQ"
  },
  "E8V5LpfP9cysy6YVoBAdAQ": {
    "date": "1/9/2015",
    "text": "My first 5 Star Indian - unfortunately it's not in gods county of manchester . But on the famous Brick Lane in London!So good I had to return the following night as I couldn't get over the quality ! Using a taste card ( upto six people I think ) you get 50% on the full food menu apart from fri and Saturday. And yes I know some of you are thinking I don't like Indian or curry or even spicy food! They do goregous mild curries or even 'English' dishes ! But then again why would you be on brick lane looking for fish and chips! Food was served promptly and portion size was plentiful . You left with that feeling I could fit in an extra mouthful but then realise you would probably pop!Drinks are at London prices so you have been warned ! Just a quick word of warning ! You will find curry hustlers on the street - come on come in they will chant and claim there chicken tikka is from a recipe that came from the great Lord tikka himself and all this gubbins ( mancunion for rubbish ) Worth a trip out !",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VXq3EIx60vW9_a7TOpx3Sg"
  },
  "rHLaK28fK2Uf0T3krY39bQ": {
    "date": "11/7/2018",
    "text": "Delicious place to eat. Had the lamb chops with coconut rice. My daughter had the vegetable masala.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D6N-JKct-BKj0ahSzZNc8g",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D6N-JKct-BKj0ahSzZNc8g/o.jpg"
      },
      {
        "img_id": "mFL9FTCwINQ5sc7H16fpEg",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mFL9FTCwINQ5sc7H16fpEg/o.jpg"
      },
      {
        "img_id": "SvqVBAvjiuEKvm94BnjChg",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SvqVBAvjiuEKvm94BnjChg/o.jpg"
      }
    ],
    "user_id": "_pWgy_8y9eSNK3ArKSBPfg"
  },
  "_3R-Mrj7IhHRbKCXoPgQ_g": {
    "date": "7/30/2018",
    "text": "a stroll down Brick Lane and every single restaurant advertises having the hottest/best/spiciest Indian food - it's a bit overwhelming. I did a quick Yelp check as well as checking the menus in the windows for a diversity of options, and settled on Muhib.everything was great. pappadoms with a variety of Indian condiments to start off, then moving on to lamb dansak - a playful yet mysterious dish of lamb and lentils in a slightly sour yet quite spicy sauce, and washed down with a large bottle of Kingfisher. the night was topped off with mango kulfi (Indian ice cream).prices were fair, pretty good portion size (and they didn't just give you a giant pile of rice, aka what I call the \"Indian restaurant sucker bet\") and service was great. I was a little confused as to why one waiter took my drink order, a second took my appetizer order, a third took my dinner, and a fourth offered me dessert, but on the plus side they were all friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "e4uo6fpZwZnaengTz-CM1Q",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Mango kulfi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e4uo6fpZwZnaengTz-CM1Q/o.jpg"
      },
      {
        "img_id": "C2VCNim1i9vcTFWqQAVKnQ",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Lamb and lentil dansak",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C2VCNim1i9vcTFWqQAVKnQ/o.jpg"
      }
    ],
    "user_id": "DHRupjFv4GyD0tEdj-QNjQ"
  },
  "ysSo0N6JGfknE0Sxv9-vCg": {
    "date": "7/19/2018",
    "text": "My friend and I had limited choices here because we weren't into very spicy food. Our orders were hit and miss.The curry was very good, mild and delicious. Even though we were warned that tikka masala would be sweet and creamy, it was actually sickeningly sweet (imagine dessert with meat, yikes). I couldn't eat any of the sauce. The mushroom rice and garlic naan were delicious, but the coconut rice was, again, sugary sweet.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nv3j64jzXreLow_S1G6nYQ"
  },
  "j_HUwyq6vQe3yBwMfbnJ4A": {
    "date": "10/13/2018",
    "text": "Good food and great service.wauter was politely helpful in choosing dishes and warning us when I ordered too much food. Ended up being the perfect amount. Very good. Would return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "joyPo_6qoGN2j8cF6dfPPg"
  },
  "kN2RHLuROVui4GT1v01A1Q": {
    "date": "12/7/2017",
    "text": "This is the \"Best Curry House on Brick Lane.\" In fact, so is its neighbor, and its neighbor, and its neighbor........clearly very reputable.I'm a huge fan on Indian food, but this was just subpar. First of all, there's a funky smell when you walk in, and not the kind that signals good Indian food. The food was edible, but that's about it. Not very flavorful, not very memorable. Service was also questionable. We had to ask three times for water, and after we ordered, they kept coming up to ask to ask if we ordered this or that. Weird.What really blew my mind, however, was that this was somehow a three-course meal. Everything came out piecemeal, and soooooo slowly. I just wanted some curry, jeeze.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SsxO4EJJUBleXPi-ly16Ew"
  },
  "EyAbciH9kzFGR_pWBzt8Dw": {
    "date": "10/19/2018",
    "text": "It has very good Indian food in such neighborhood full of Indian restaurants. The menu is overwhelming, a nice young waiter helped us to choose a lots of lamb dishes, breads and side dishes, indeed they were so good. Muhib might be the busiest one along street, you won't miss it. They may promise you 20% off by the guy outside.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZrxkI7VRXK8pB_fAm49cg"
  },
  "ZrO-KphPjlfytU9rWQky2A": {
    "date": "8/8/2018",
    "text": "We came here for just to sample some food since we already had dinner. The place was the most crowded one on the street. We ordered several curry but ended up order even more food because it was not bad. The waiter was pretty funny. They gave us 20% off because the in the front told us. Drawback is that guy smoking cigarettes by the door and smoke came in.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ekBDZnuO50973VsQ0BAGTA",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Aloo gobi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ekBDZnuO50973VsQ0BAGTA/o.jpg"
      },
      {
        "img_id": "2Q0ZwrXoSUrUnXhvNy5DEA",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Butter chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2Q0ZwrXoSUrUnXhvNy5DEA/o.jpg"
      },
      {
        "img_id": "Yk6sP3AcUh_p3EsTWDSAMw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Lamb tikka masala",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yk6sP3AcUh_p3EsTWDSAMw/o.jpg"
      }
    ],
    "user_id": "I9OdolvVoNc_bOwxLAdMvw"
  },
  "5BwkrvIySiwCVMjilikagw": {
    "date": "9/30/2017",
    "text": "Found Muhib while shopping at the Spitafields Market in London.  Great lunch special value, delicious, generous portions.We started with Lentil Chips accompanied by an assortment of 5 sauces - great value at 70 pence per large Lentil Chip.  The chips were light and crispy, the sauces added a great variety of flavors.  We had fun combining the different sauces on the Lentil Chips to achieve different interesting flavour combinations.Our party had the Mixed Biryani with Chicken, Lamb and Shrimp. Cauliflower Pakora, Chicken Tika Marsala and a Fish Curry.  The food was excellent.  The Mixed Biryani was accompanied by an extra portion of excellent Curry based sauce with a Stewed Vegetables.  The Biryani came with a Garlic Naan Bread which we enjoyed again with the 5 sauces that came with the Lentil Chips.Muhib is a great place to have a sit down lunch near Spitafields Market, London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u4twne8tKe0W-ydHG8nnhg",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. 5 sauces accompanying the Lentil Chips.  Also great with Naan Bread.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u4twne8tKe0W-ydHG8nnhg/o.jpg"
      },
      {
        "img_id": "a37LOdxkgkphlekN5-FQSw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Lentil Chips with  5 sauces - fun trying out each sauce and combinations.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a37LOdxkgkphlekN5-FQSw/o.jpg"
      },
      {
        "img_id": "yFKeCOLTuCfWgX1W6FDvIw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yFKeCOLTuCfWgX1W6FDvIw/o.jpg"
      }
    ],
    "user_id": "cwZ64E_XT92XesWkQh85YQ"
  },
  "noD7hgjjD14TZriX0aZrhg": {
    "date": "6/29/2018",
    "text": "Great brick lane classic.   We had naga lamb. Supper hot delicious.  Methi chicken and lamb chops.   All wonderful distinctive flavors.   The waitstaff were really helpful and nice.  We will be back again",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhoJL2BUGpuWtM9kn5B4Sw"
  },
  "d4NbWX8GK7uuP8ps-9DDKg": {
    "date": "11/24/2017",
    "text": "After a long day of sightseeing, an Indian takeaway meal was in order. Brick Lane can be intimidating with the shear number of Indian restaurant choices. I went to this restaurant after reading the high Yelp reviews and the food did not disappoint. The menu was overwhelming for an Indian food novice like me since there weren't descriptions or pictures of dishes. Good thing they had a set menu for 2. Everything that came with the set was absolutely fantastic.  I'd love to go back and try the entire menu. It's definitely on our next itinerary back to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GdiYTTiyltoW6R3EdG97pw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GdiYTTiyltoW6R3EdG97pw/o.jpg"
      },
      {
        "img_id": "lhVJ7zruP4NmTKR9arOwKg",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lhVJ7zruP4NmTKR9arOwKg/o.jpg"
      },
      {
        "img_id": "5wvcvtI6YbS-iaBnmhGgQw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5wvcvtI6YbS-iaBnmhGgQw/o.jpg"
      }
    ],
    "user_id": "rDQOTlTuNymE_Ya5dJK01A"
  },
  "kperyNHHXheTJrhIVvSNbw": {
    "date": "6/20/2016",
    "text": "When you walk along Brick Lane picking an Indian restaurant can be daunting because there are soooooo many! Which one do we choose!? Well, luckily my lovely husband did his research and picked Muhib because when we have to make spontaneous decisions we're quite rubbish at it. We walked into Muhib around dinnertime on Sunday, maybe it was a little earlier because almost no one was there, but we've discovered that that doesn't really mean anything. We were seated and had a terrible time deciding what to eat because there were so many options! Don't worry that's not a bad thing. Our server was nice and helped us make a decision- we went with the Prawn Spread and Veggie Samosas, and the Fish Curry and Veggie Thali. I loved the Veggie Thali because there were so many options! And they all tasted great and different. I've also become a fan of the prawn spread. It's these prawns in a nice tomato-y tikka sauce over a fried bread. Very nice and flavourful. They also have paratha which we had a go at but it's nothing terribly special- I'd go with the naan instead. The servers weren't very talkative and didn't really smile, but they were still really nice and helpful!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ks186rmnOpHO6WKTDtM2sQ",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Sauces",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ks186rmnOpHO6WKTDtM2sQ/o.jpg"
      },
      {
        "img_id": "9xcHpSTiVmFPgAonDz-R4w",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Prawn spread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9xcHpSTiVmFPgAonDz-R4w/o.jpg"
      },
      {
        "img_id": "f9clP-vFODYRJkhEdFMuXw",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Veggie samosas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f9clP-vFODYRJkhEdFMuXw/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "l3qUvT9r2FtJPoEpRe0_bQ": {
    "date": "5/31/2018",
    "text": "This is a very good place for authentic Indian cuisine. The lamb is well prepared and the curry sauce is flavorful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJDLAJnf6z2ABU3K-WjrAg"
  },
  "gJYEsH7uqJC_QB3LbLa9Lw": {
    "date": "7/31/2018",
    "text": "Awesome food and service. Very unique flavours and great host.  Wonderful way to end a long day!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zPBdQNstio7KqcDJI8WWg"
  },
  "A95CGl1bsdnOUDFNuEvnSA": {
    "date": "7/6/2018",
    "text": "Came here while on vacation in London. Every restaurant on Brick Lane looked similar, but this one had the friendliest door man so we came inside. Food was absolutely amazing. So good that during our week long visit we came here twice. The second time we visited the waiter and door man both remembered our names, where we were from, and the meal we most enjoyed during our first visit. Granted both trips here were within 4 days of each other, but considering the large volume of clients this venue encounters I was genuinely surprised by their ability to recall such detail. It felt like you were dining in with close friends. Everyone was so warm and welcoming. And did I mention the food?! Hands down our favorite meal we had while in England. I strongly recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DVtBh2sVAFFr36L6eWqYUQ"
  },
  "6xxDnOvo2gvNsu2VcYXFzA": {
    "date": "8/13/2015",
    "text": "Great Indian food on the infamous Brick Lane. I found Muhib primarily on Yelp, which was incredibly helpful because of the overwhelming nature of Brick Lane: curry hustlers, flashing lights, an onslaught of aromas. Which to choose? Interior (as most places on Brick Lane) is faux upscale. Cheesy in a polyester kind of way, but cheap and cheerful nonetheless. We went with the chicken tikka masala, lamb curry and garlic naan. Fresh flavours although probably a tad on the sweeter side for my liking. Still really, really enjoyed it. One small downer was the service - on the slow side. Took a long time for the food to arrive. On the upside, the wine was on the order of 3 pounds a glass. Thus began a night that ended at a diner at 4am. Thank you, Muhib.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "pEMWzZ8qWY1T_K0HUoKDIA"
  },
  "ijMjpUOU45QFWq4eu_Q8GQ": {
    "date": "5/22/2015",
    "text": "Whenever I am visiting London I aleays enjoy a good meal at a local Indian food restaurant. Today at the suggestion of a friend our group headed to Brick lane. The haggling that goes on the streets at just about every restaurant is silly but it was agrred that we would try this restaurant. I am glad we did. Our drink order was taken and we ordered simosa, butter chicken and their house special balti with lamb. The food took a little extra time but it was worth it. The food here is incredible and it would be my siggestion to try the house special balti. It was heavenly!The service here was very good and I half to day that this was the best Indian Restaurant I have been to in years. I am impressed.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2YT34RU3-_3nW8c4vmP0Fg",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2YT34RU3-_3nW8c4vmP0Fg/o.jpg"
      },
      {
        "img_id": "7ps_OroP5opsUQGAoEKxHA",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7ps_OroP5opsUQGAoEKxHA/o.jpg"
      },
      {
        "img_id": "cBUilkTCMSfLl-_KHzwJNQ",
        "caption": "Photo of Muhib Indian Cuisine - London, United Kingdom. Muhib special balti with lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cBUilkTCMSfLl-_KHzwJNQ/o.jpg"
      }
    ],
    "user_id": "3jZ7W7ZPXBCX7opq1IUdPw"
  },
  "6mDHBF367UlKIxIFzUT3-A": {
    "date": "10/30/2016",
    "text": "Came on recommendation of a friend. Waiters were friendly. Excited to see thaali on the menu along with chaat.Unfortunately, the sauces served with papadums were full of emulsifiers (ingredients that thicken and foods quickly, creating more volume and mouth feel), which I'm allergic to. They make me swell up. Not the restaurant's fault, but when you have a lot of emulsifiers, it means you're cutting corners on ingredients or using bottled sauces. The chaat was served hot, instead of cold with rice chips as traditional. The thaali was decent, but the basmati rice tasted stale and there were artificially colored rice in the mix. The raita was missing cucumber. While there's always regional variations in Indian food, the food just seemed too processed. If you have food sensitivities or are looking for Indian food like your friend's mother cooks, keep looking.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EXWOXFku5rCGD9QmG7YbQ"
  },
  "JGjxhUArz8l1P3Oo4vpxvw": {
    "date": "11/5/2016",
    "text": "With a week in London and a pretty insane amount of Indian food on Brick Lane alone, the fact that I spent one of those meals going back to Muhib a second time says a lot about how good it is. The lamb vindaloo here is for real- not punishing, but flavorful and just hot enough to be sweaty by the end. Prices are pretty reasonable, not the cheapest in town but certainly not the worst either. Service can be super slow and a little deadpan, but it honestly beats the more intense guys hawking the other restaurants on the block.As a curry junkie utterly spoiled by the wealth of good Indian food back home, I didn't know if London curry would be as good as what I can get delivered to my house. This is definitely on the itinerary for my next visit!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1f2tzeVpEJinyk_0m-mhPQ"
  },
  "lM8e3owm4YntJsvSVcihFQ": {
    "date": "10/30/2016",
    "text": "The food served here is for those who have no clue about Indian food. But if you've ever been to India, avoid the place, as you'll end up extremely disappointed. As one of previous reviews describes (which I haven't read before entering the restaurant), the dishes are very sweet, which is a strange concept for Indian food, isn't it? Also, an extensive choice of so many different dishes from almost all corners of Asia is suspicious too.Service is extremely polite though.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JwmAf-gVlWT_15VHBFxA9w"
  },
  "c3HIL91mVcHuGcb_hDyzjQ": {
    "date": "8/3/2017",
    "text": "In London on business and curry was on my bucket list so we headed to Brick Lane.  Saw reviews of this place so despite being hounded to enter into other indian establishments we stay the course and found our way to Muhib.   The interior was dated but in a good Graceland sort of way.  There were four of us so we ordered to share.  Lamb Vindaloo, Butter Chicken, Chicken Rezla, Lamb Curry,  Curry Chickpeas, Bombay potatoes, Naan.  Friendly and anxious to serve wait staff rushes your entire order on a cart that is rolled with purpose and notice.  The food was really terrific.  The Vindaloo was spicy but not too spicy.  In fact, we felt the Rezla and Chickpea Curry was more assaulting.  The meats were tender and all the dishes were flavorful with depth and lovely heat.  We left and all were glad we happened upon this little spot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKEDJqBIGd0WT_-qjN3MsA"
  }
}