{
  "jTp6vuAXzjlS7PHFH6hdVg": {
    "date": "8/30/2012",
    "text": "Definitely the best Italian in this area, and they're a chain too, so if you live near Croyden you can visit that one too. I am a COMPLETE foodie, and this place is really a brilliant one! Next time you're in the area, its a MUST!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Hr-m78-ZWMsv3nnSimcl7A": {
    "date": "7/20/2011",
    "text": "pizza was pretty good- the pasta not so much, especially for an italian specialty restaurant. tiramisu was so-so as well. wouldn't come back",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s04MTpW9dojD_f0MdgeWjw"
  },
  "a_5aI7VCUP47GLNRF8_rqA": {
    "date": "11/19/2008",
    "text": "Good food, good location and good prices! This is ideally situated for a meal before heading to the theatre or after a busy day in London. I had creamy pasta with bacon and chicken and it was amazing - plus, with a young person's railcard, you get 20% off food! They don't advertise it very well and we had to ask the waitress, who then went to ask her manager, but there was no problem and it saved us money on an already reasonable meal. I was also very impressed with the décor- it did not look like a chain restaurant, but was romantic and cosy with Italian music and candles in wine bottle on every table,which I thought was a nice touch.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JiZCh1t8F7dNl6qpEox6Rw": {
    "date": "4/8/2009",
    "text": "We went here for something to eat and just loved it. The service was excellent and the food was even better. My partner had an appetizer and I had a margherita pizza. It is very hard to make pizza incredible but somehow they managed to do just that. The crust was the best I have had in a very long time. Great job and I am sure to come again with other people.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dAW-FDisUqvtwNbj60BwhA": {
    "date": "12/12/2012",
    "text": "Good food. Service very good. Friendly staff. A small piece of italy in London. Coffee, wasn't up to par.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YeuLqypgtDiWsvVobCTmtg"
  },
  "FtB87TEk3dWCQ478Q_-JSw": {
    "date": "9/23/2009",
    "text": "Went here with a party of 8, half of us bleary eyed from our fresh arrival from the United States.  The food was decent at a reasonable price, and our server was very friendly and accommodating for our stupid American ways... like more than one ice cube per drink.  Maybe it's just that I'm happy to be back in London, but I thought the place was quaint.  Not going to be the first place I run to if I'm looking for another meal, but it worked for me.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1O638BDK_fWuxgTVJwff-A"
  },
  "egft-vghA0W3_HKopbYk1g": {
    "date": "2/7/2012",
    "text": "The food was great but the decoration is a little bit old fashion. Plates came fast and it's not really expensive.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "dPE81Cw8oNxzs761JOS1hQ",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dPE81Cw8oNxzs761JOS1hQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "ev-tCV9K54LDzofQRKo9Mw": {
    "date": "1/20/2010",
    "text": "Nice Restaurant with a Italian menu with british influence. The Food was good and not expensive. It came fast. Maybe a little to fast and I would say that at least my noodles and the sauce was precooked and reheatet. I mean Fussili with Mushroom-Chicken sauce in 4 minutes? NO Way But the atmosphere is nice and the people are from all ages. Nice wine menu :-)........ Service is very good and keeps attention. All in all a nice Restaurant and a good place to take a break from the busy Leicester Square.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ia0Q415txLl-ersRF-RCHQ"
  },
  "EXLipIQaHxXPquCQD0FXqw": {
    "date": "1/10/2009",
    "text": "This British equivalent of the American chain Olive Garden offers decent Italian food at reasonable prices. A perfect starter for sharing is a platter of Italian meats, buffalo mozzarella, tomatoes, roasted peppers, assorted olives, and artichokes with toasted ciabatta. They have some unusual pasta options, such as penne with duck sauteed with spring onions and sliced mushrooms in plum sauce and penne sauteed with goat cheese, cherry tomatoes, fresh spinach, and olive oil and sprinkled with toasted pine nuts. Chicken breast stuffed with mozzarella cheese is baked in a tomato sauce with smoked bacon, onions, and mushrooms and served with roast vegetables and new potatoes.This is one of many locations in the city and a good one if you're going to a performance at one of the nearby theatres or a film at the adjacent Odeon Leicester Square.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3x7Zrwu8ugUjCpU6AbJDEw"
  },
  "R2f51anZ8cSQ4GTUadfNAQ": {
    "date": "12/17/2008",
    "text": "I love this restaurant. It's like a little slice of Italy, right there in Leicester Square. Bella Italia is actually a chain, they even have two restaurants in Leicester Square alone. But despite that fact, I think very highly of them and their restaurants tend to be extremely good. I only had one bad experience here one night when it was busy and we were sat right by the bar (well not really a bar, but where they make the drinks) and we got awful service all night long, and I seem to recall a problem with my order. But I'm willing to forgive. I'm good like that. Because generally, this place is great right from the word Bruschetta or Ciabatta. Mmmmmmm, I'm hungry. Maybe I should stop reviewing and go grab an Italian. Anyways, where was I? Oh yeah. My review. This place is great!. I don't imagine Italian food to be too hard to get right, I mean, even I can make pasta. But these guys are good - and the restaurant has a lovely warm vibe to it, pleasant staff - and the clientele are usually void of morons, except of course when I visit. Also, I figure, if you sit by the window - you should be able to get a really good view of the Film Premieres; so you'll be able to look down on all the crazy people throwing themselves at Johnny Depp or whoever.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CpqbhptBIhSI9t0dukZdjQ"
  },
  "bDOSzvRu6GsMk6ZX9GDhYA": {
    "date": "1/30/2011",
    "text": "Anyone, who ever went to Italy, has to be insulted by that place. To call it Belly Italia is just... wrong. Call it... \"alright food\" and you know, what to expect. The service man did his job, he brought extra pepper, the food, the wine (Montepulciano, was alright), very fast.... forgot the smile though. You know, this reaction in the face,  making people feeling welcome. Caesers salad and Lasagne were ok, yet leaving hungry (portions are not very big) the extra Ciabatta (2,50) we ordered, came after we finished our meal and was not tasty by itself. Nice, that they ask, if you want extra pepper and parmesan. That is, what the extra point is for.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "60tRMVlxwEd3iW7HyUPyMw"
  },
  "sZwsPmJcxLr93R8_rYiO9g": {
    "date": "11/6/2009",
    "text": "Like the guy below me I'd have to say this is the British Olive Garden also. They have some great italian dishes the person I was with had some pasta stuff (sorry I should remember) and I had this Grilled chicken with cheese inside of it - definitely get that.It's relatively inexpensive and the portions are respectable. The cheesecake was pretty damn small which I was surprised at but I guess you get what you pay for. Service was great - I don't have any complaints about that. All in all a decent place for a god meal at an affordable price.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unjPBUYA7V8L7JI2rREu2Q"
  },
  "R5VW-pB-q2EKgTHvS-pEdA": {
    "date": "4/9/2009",
    "text": "I'm a pro-mystery shopper, I have eaten 100 times at Bella Italia, this particular branch due to it's 'tourist trap' location is below average. However, avoid the cranbourn st one off Leicster Square- it's poor.However, Bella Italia's commitment to having mystery shopping means that it's standards should be reasonable but don't expect authentic special care. If anything is slow, then try to lead the stages of the meal and call for waiter or you'll be in their for over an hour. I notice the 'date' tage below, this is only date territory if neither of you are paying ; )",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S8YSemTUrvD5h17ddJofFA"
  },
  "eXJL0GmW8sLdbBt8nX0SIw": {
    "date": "1/11/2011",
    "text": "Very nice atmosphere, friendly staff & food was on time and lovely.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7XLk6V0SxvzDjdZYmiIiQ"
  },
  "AvEA7KqNuCnpvJGT1sbFtQ": {
    "date": "11/27/2010",
    "text": "As far as Italian restaurant chains go, Bella Italia is one of the better ones in London. They are ubiquitous in Zone 1, with at least 4 locations within a walking distance of Piccadilly Circus.Bella Italia serves a decent full range of Italian dishes. I haven't tried the pizzas very frequently, but whenever i have, i have not been disappointed. My usual order is an antipasti for starter (which comes with some delicious mozzarella) or a plate of calamari. I really like the squid here ... quite soft.For my main course i usually select a pasta. I have had quite a few different ones, from penne, arabiata to the traditional spaghetti ... and bella italia always makes them well. Earlier they didn't have many risottos in their menu, but now they do ... so i have recently started ordering chicken risottos here.Although they serve pretty decent food, i have some issues with their service level. Once i needed to take a dish back, and they refused. The reason ostensibly was that they do not have disposable containers. Thats a pretty poor excuse if you ask me. The service can be atrociously slow at times. I have missed several minutes of a movie because they had made us wait for an inordinately long time at each stage ... seating, order, serving and getting the cheque.On the whole its a very nice chain to come to for cheap Italian meals (usually less than £15 per head) during an evening out ... but i wouldn't recommend it for special occasions or if you are in a hurry.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "OOICL7iAFCTDjyhN3Z3EdQ": {
    "date": "11/26/2013",
    "text": "Simple basic Italian cuisine with a friendly staff.  Great antipasto for openers.  With a glass of wine was just right after a day of sightseeing.  Our party had 3 different pastas - the Norma with roasted eggplant with a sweet sauce was very nice.  Pasta was bit over done but overall a very enjoyable dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YkIWnt5NZze--XBTEV21BA"
  },
  "sZEzcJY-BnEfmIWmxE9d-g": {
    "date": "1/13/2011",
    "text": "This is kind of the branch restaurant typical in the US.  The have the same menu in all their restaurants throughout London.  We went here before Les Miserables and it was nice.  We liked the decorations but that was most of the likes.  The food was ok, the service was ok and the price was ok.  SO it's ok.  I liked the fact that they accepted american express.  That's what got it's 3 starts.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zX_qQUGocOdbFL-k8U0VA"
  },
  "kpMKAc5jw6uMqesE8XnYFg": {
    "date": "5/26/2009",
    "text": "I am a keen Bella Italia visitor due to its ood ratio of snob value to price. Though, everytime I go, I am somewhat dissappointed, as I somehow feel I could have made the dishes better.I think then, what you are paying for is the atmosphere. The thought that you are in an italian restaurant surrounded by trinkets of yesteryear. Service is slow, and I dont see why. I think they are trying to give the impression your meal is being painstakingly crafted from scratch. This particular one is quite small and even feels cramped. Good but not GReat.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9sUYDERBAWPv3HXXoj3dsQ": {
    "date": "11/24/2008",
    "text": "This place is perfectly adequate for a lunch break when shopping nearby or a dinner with friends or lovers before a night out.Food is cosy, comfortable and warm with a sufficiently italian flavour which given the fact this place is a chain is no small feat.Service can leave you tearing your hair out, the timewe visited we had a particularly annoying waitress who was never around when required but always seemed to be there when there was no need. Decor leaves much to be desired although there is a certain quaint charm in the tacky retroesqueness of the 70's style decor. Prices are more than affordable it is possible for two people to have a three course lunch here plus a bottle of wine to share for well under £40 and considering the location that is nothing short of outstanding. I have eaten out at several branches of this popular chain and I would not hesitate to return, principally for the outstanding value of the restaurants.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nlHhuCxEPDvGMnsCO5LJ7A": {
    "date": "6/13/2008",
    "text": "This is a nice restaurant to go to if you enjoy having nice italian cuisine in a vibrant location.The Bella Italia is part of a chain, but it does not serve fast food, but yummy pizzas and lovely pastadishes. I would recommend to go to this place in the summer and sit outside. There you are basically sitting right next to Leicester Square and you can see everything that is going on there good for people watching;)The waiting stuff is really nice and i can recommen the Quattro Formaggi Pizza absolutley delicious.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-ycK905UDa2HlTvuO9TxMQ": {
    "date": "7/8/2010",
    "text": "Good value Italian (or non-Chinese variety) food for the West End/ Soho. Good for post-theatre.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urT_F8rJBduTM079fAfr0g"
  },
  "hFJOaS7qInk10aEe3TnjLw": {
    "date": "10/23/2010",
    "text": "A decent enough Italian, but the inside seating is sometimes mishandled by the staff - safer to get a seat outside",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "X-QmfQutiauwJEqoigAOYg",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X-QmfQutiauwJEqoigAOYg/o.jpg"
      }
    ],
    "user_id": null
  },
  "MEuZpoEw9F5KmO9f25namQ": {
    "date": "1/7/2009",
    "text": "My friends and I entered this place thinking it was a hidden gem. Then when we returned to our hotel, we found 2 other Bella Italias nearby! Doh! However that didn't lessen the experience. I remembered the pizzas tasting good if lacking a bit of cheese. The tables had candles all around which made the place seem romantic. The only con is the service - it was pretty slow when we ate here.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "RNN_UX2Q80pMF5XA3oHkyw"
  },
  "gTDfkr6pyusGT-g2ziePiA": {
    "date": "5/5/2009",
    "text": "Just find those reviews accidentally... Bella Italia is not just a chain, but one of worst chain in London. Been -accidentally- a couple of times, and still thinking is the worst restaurant ever. Tasteless food, horrible service and tiny uncomfortable tables. I did wonder how it could be so popular -there are say 15 in central London-.Has anyone ever been in Italy or a decent Italian restaurant?Only star: I asked both times for dinner menu. Hope rest of the menu is better.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vZG8A8h-fxPcZYABNJuPmw"
  },
  "W22fjc6qkhcljnnzwHZ-9g": {
    "date": "12/18/2013",
    "text": "The restaurant is very good and I think that 4 stars is just the right mount that I can offer without feeling too generous. Bella is an Italian place so we ordered some bread and after that, a variety of pasta meals. The bread was out of this earth; so delicious, warm and crunchy that I was afraid that I would fill up on it and won't be able to continue; so I put it aside. Continuing on to the pasta; it was delicious and quite rich in flavour actually. The generous portions were quite welcomed but I was already slightly full from the bread basket so I couldn't finish my meal. I loved the waiting staff, with their matching outfits and quirky attitude. The guys were really nice and generally, I loved the place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OX5X6i_oOy4DKMhYV-gVnQ"
  },
  "Zri0niCxi8vjsaZ0qQqdXA": {
    "date": "11/5/2015",
    "text": "I went here with my family and it was great Italian food, the service was quick, and servers were very friendly. We had the gnocchi and it was amazing! The pizzas were also really good. Great portions, and nice, fresh food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nkFGhzAI5-e5Fv4vHAoODA"
  },
  "e5RowzKYGEZjTGf1jPQ6KQ": {
    "date": "4/9/2013",
    "text": "Ate here while my man and I were in London for the Olympics. Conveniently located in Leicester Square and \"Theatreland\", right around the corner from the Underground, and a couple blocks from Trafalgar Square. During the 10 days we were in London, we ate at Bella Italia about four times. We mostly ate their spaghetti bolognese and pasta carbonara, which were excellent and tasted authentic. We also tried their pizza and loved that as well, but not as much as the pasta! The price was steep - we paid an average of $75 every time we ate there but it was well worth it, especially after eating the bland food found in most British restaurants and pubs. We sat outside every time we ate here, which provided a very European atmosphere and great people-watching. The staff was very friendly each time. On one of the nights we ate here, I noticed a world map with pins stuck in it on a wall inside, next to their bar area. I asked if the pins indicated where their customers were from and the waitress said yes and asked where we were from. I said Los Angeles and she excitedly (and shockingly) said they didn't have a pin in Los Angeles yet. So I got to put a pin in for L.A. and the staff gave me a free gelato for it!Eating here is one of my favorite memories of my trip to London. I'll definitely return to eat here on my next trip.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "Xs7Xq4q9hRYjg8Lmqda91Q"
  },
  "4KiTcSlh7fjkCUIue98Y7w": {
    "date": "6/19/2015",
    "text": "5 star food, family friendly, gluten free and inexpensive! Just had lunch there, had chief special gnocchi, GF penne with meatballs and 2 kids menu. The quality of food is absolute top, tender melting in your mouse gnocchi, crispy enough but tender veggies, gf pasta is freshly made and indistinguishable from semolina, even kids meal with ribs and soup/ garlic bread is the serious grown up quality Decor is beautiful and authentic and service is quick, friendly and efficient, our waitress was Italian. Tip- ask for lunch / dinner menus where you get an incredible deal. Kids menus is a great deal for your money too, plus they get some coloring kits that keep them occupied and us sipping our wine in peace.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CWvbd8igpRcY7CmResC2KQ"
  },
  "9CC22L4J3uZtgmD586-2Lw": {
    "date": "7/3/2011",
    "text": "It's okay. Not bad, not good.We got:- olives: really good- garlic flat bread: good but really greasy- calamari: typical- penne pesto with chicken: meh. the pesto was good, but the pasta itself lacked salt and flavour. a pretty flat tasting dish and i didnt think the tomatoes went well with the dish-cannelloni stuffed with ricotta cheese and spinach: not too bad, very cheesy tastingquantity is big, and the price is relatively okay in terms of london pricing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "2vYCBOp5qQw8quCgmcReJQ": {
    "date": "5/15/2015",
    "text": "Not great food. Decent drink prices. Excellent service. Typical London food. Go to Italy if you want a good Italian dish.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNPdhz-TZvtz2XJ8cZeGlw"
  },
  "6P7WadsyI_eHd8Os79gEtw": {
    "date": "11/17/2014",
    "text": "Chris, the waiter, was incredibly friendly to every table. He exuded warmth and attention, and as a single diner on business, I was able to marvel at how he made each table feel especially welcome. The food was lovely. The calamari was appropriately crisp, with a tang of lemon, the marinara on the side was delightful. The seabass with side of veggies was a nice meal that left me satisfied without being overwhelmed. I would recommend for food and service quality.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4DWd8f1Rtylo7owHEKLERg",
        "caption": "Photo of Bella Italia - London, United Kingdom. Seabass",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4DWd8f1Rtylo7owHEKLERg/o.jpg"
      }
    ],
    "user_id": "WKAaCKkHIJh6F5n3OrydfQ"
  },
  "H7V5rqznxSBqhd47yRUEcw": {
    "date": "8/28/2015",
    "text": "We had the sirloin steak, the Italian ribs and chicken wings. The wings were coated in spices but had not much flavour, the meat on the ribs fell off the bone but was coated in pure sugar. The chips were frozen supermarket chips deep fried. Paid 12 pounds for the wings and 18 pounds for the ribs. Wouldn't really go back I'm afraid. On the upside, service was great!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mRdikm7ElOYjBKQug_4pg"
  },
  "VPS_-wvKRhroFIi9tBce4Q": {
    "date": "3/2/2015",
    "text": "Dinner was nice. The most delicious part was the dessert. We had the tiramisu.  Excellent. Service was efficient as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKWmrG4FZs-l3ehQBL5tXw"
  },
  "P6yOoOunl-u9PsQyXvRb3g": {
    "date": "8/19/2012",
    "text": "Very late review, but I figured better late than never...I dined here while on a trip to London with friends last year.  I was waiting for my friends to finish their poker game at the Empire Casino and figured this place looked inviting.The service is great and friendly, but the food was... well, bland....I honestly feel like Olive Garden back at the states tastes better than here (which says a lot).I probably will not return if I was back on a trip in London craving Italian food.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l8VYH0fYgJ-vsr84WPhFOQ"
  },
  "SXgAptENLpXV8ndJzfTjdQ": {
    "date": "4/15/2015",
    "text": "This was a very pleasant surprise: I came here because I had a 20 percent off coupon. Honestly the food is really tastful. Both my mum and I took a calzone and with it you get extra sauce and a very very nice salad. The staff was very friendly as well and the food came quickly. Delicious and cheap, with a nice outside area, what more can you ask?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Xix_KTYnFWuBFoCq3jtng"
  },
  "w4ptrz8qkInxN3WKJoibUA": {
    "date": "12/28/2011",
    "text": "Home to possibly the best bread basket in London! Freshly baked and several different types of warm breads - do love!Unfortunately, I've always found the pasta dishes at Bella Italia to be a little.. bland. Though I do love a good pasta dish, I can't help but feel \"I could've made this better\" from the dishes I've tried there.Nevertheless, the portions are generous, and the prices very reasonable. Even better, the restaurant is open late, which is always handy if you've caught a show and looking around for somewhere which isn't already packed full. However, it can get quite noisy and crowded inside, so you may have to raise your voice to be heard!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "z0G-4DW_8r0Kz94JkFLj4A"
  },
  "PzQuOuVzIHFyfbvrGgJ91Q": {
    "date": "1/1/2015",
    "text": "Great place and very popular it seems like ... Had to wait a bit to be seated but the food made it for it ... Had some pasta and pizza with of course a bottle of wine .... Great portion size .... except for the calamari appetizer ... Pretty small to share .. Enjoy",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5x8YAOKyR33mSpC698gBQ"
  },
  "n9aO0rwE9-o2_QkEPgGYcQ": {
    "date": "1/2/2016",
    "text": "The pasta I got was cold and was clear that it had been sitting there for a while. It has been hard to find a good restaurant for us in London and we were happy to find a nice Italian restaurant, however this place did not live up to its expectations. The pasta is made with egg yolk noodles which do not go well with marinara sauce. I'd stick to the pubs and fish and chips during a trip to London. By war worst Italian food I've ever had. There were 5 of us that had different meals, in hopes that Italian food is hard to mess up and everyone did not like their meals. This place made Olive Garden look like a 5 star restaurant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xz6sD3uX1yiRAW9tYbpJaQ"
  },
  "ZEFL-kwWwGnRsHlff_RaHg": {
    "date": "12/19/2011",
    "text": "My family and I used to eat here a lot when I was younger and we spent more time in London. We wanted something relatively familiar for our first night so we ended up here... Well, we ended up at this one. I was aiming for a different location but got a big lost (blame the jetlag) and in getting all turned around, ended up here. Which is just fine, there's practically one on every major street. No, the food is not gourmet Italian food (it is, after all, a gigantic chain). That said, the food is well priced, consistent, and great for the value. Service was good and I've never been to a single one that wasn't packed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SgPGaiImKVcYYtWv4_OEqg",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SgPGaiImKVcYYtWv4_OEqg/o.jpg"
      },
      {
        "img_id": "hpYvhno7ELN7-XWROOxtJw",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hpYvhno7ELN7-XWROOxtJw/o.jpg"
      },
      {
        "img_id": "MCl8apTG_ykQsCrO-h6jkA",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MCl8apTG_ykQsCrO-h6jkA/o.jpg"
      }
    ],
    "user_id": "3CMiTAhq_o_GP1tLs-ihbg"
  },
  "VgbDN188RFNRZQYw2MMwOQ": {
    "date": "3/27/2013",
    "text": "honestly we went here because we kept seeing this restaurant everywhere and my dog's name is Bella. the fresh mozzarella was good. my pasta wasn't great though and it's definitely a chain place. my stomach was really hurting after also. wouldn't go here again if ever back in Europe.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3nzCdwExy2AneQ8itz4Yg"
  },
  "o7bLv6n3Ty6XDMKFGdKwXw": {
    "date": "12/17/2008",
    "text": "This is a great place to grab an Italian meal in Leicester Square. The quality of the food is really good, and the atmosphere is lovely and relaxing with lots of candles dripping in wine bottles. Initially I thought the chairs and tables were a bit too close to each other, but the place has a comfortable and relaxed trattoria feel that is entirely natural. The staff were very friendly, our food was prompt so no complaints there. I love the decor inside, there are some old posters that add charm to the atmosphere. Its a great place to come with a large group of people, in terms of ambiance and location, while the pizzas make for excellent sharing.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "q78Ew3pEcu4HYrDxht_XuQ",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/q78Ew3pEcu4HYrDxht_XuQ/o.jpg"
      }
    ],
    "user_id": "9BNZjcidByFi6Kaxg8pQow"
  },
  "Q2-zHgJG2RkWpPgQZKTLMQ": {
    "date": "6/10/2012",
    "text": "I don't care what other people might say, I absolutely loved this place.  During my five day stay in london a week ago, I went to Bella Italia four times-- yes, I thought it was that good!  I have celiac disease, so I can't speak for the majority of the food, which has gluten, but the gluten free pasta was a dream come true for me!  In America, it's so difficult to find good gluten free pasta out at a restaurant; it's usually either too mushy, or it tastes too strongly of corn or rice.  But Bella Italia's gluten free pasta (specifically the one with pesto and chicken and tomatoes which I think was called pollo genovese?) was by far the best I've had in my four years of being gluten free. Their gluten free menu was fairly extensive and offered a variety of options including pizza, and they even made me gluten free garlic bread one night!  The prices are extremely reasonable, and when you think about the quality of food you're getting, I think it's actually quite the deal.  Next time i'm in London, I know Bella Italia will be visited, and it's definitely an aspect of my trip that sticks out the most!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ogL-6zZ0Gf1Q-DKu8D19PA"
  },
  "vmFlwqdvZzxpQqMtxIrDfw": {
    "date": "2/25/2013",
    "text": "Food and atmosphere is great.  I see a good amount of reviews about bland food here.  Compared to elsewhere in London, this place was the best meal I had in three days there.  I ordered the meatballs and they were great.  I guess it's just a cultural thing in London to make the food a little blander than in the states.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u4XAUlmlZpZM6yHNVZjXjg"
  },
  "NFSU1CadU1BKKQVPRgBS_w": {
    "date": "11/19/2008",
    "text": "This place is part of a chain and certainly not haute cuisine. However, it is handy with its location in Leicester Square and very good value for money. Not a place to go if you want a quiet meal; calling the pace 'bustling' would be an understatement. The staff are very friendly and have to run around like hell. We had to wait a while, but not too long. Enjoyed a very pleasant creamy mushroom dish, followed by penne pasta with duck: a first for me. Incredibly rich and amusingly as if Leicester Square Italia meets its adjoining Chinatown. That lead to my only complaint - no grappa!! The decor is vintage Italian advertising which is fun to look at while you wait.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0fgreM0CkXEF_3i5gA2-A"
  },
  "h8uLHEnGiweWDE-eFXTK6Q": {
    "date": "6/10/2018",
    "text": "Food: No complaints. Had a kid's menu which was important to us.Cost: For Italian food, the price was appropriate.Service: Good service. Staff was very attentive.Decor: A bit cramped on the lower level, but there was extra seating upstairs.Overall: This was a nice place for Italian food the last night of our vacation. It's in a very good location to take a stroll around Leicester Square after dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eMEqFF5zB3YD__rC6p9etQ"
  },
  "UImBPBZSD0mJ5tQcGBHDTA": {
    "date": "10/14/2018",
    "text": "Sat for over an hour waiting for our food as I watched people who came in after us be served. I had to flag down a waitress to ask what is going on then our original waiter came and assured us his manager is bringing the food from the kitchen. 15 minutes later still waiting. Don't come here if you want good service.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjfJZmKuKmA4Sb6aCgP1dg"
  },
  "DyFvKZvKz4BS5Gw_yQ1haQ": {
    "date": "4/20/2018",
    "text": "Enjoyed the food. Quick and easy. Nuff said. I said Nuff said but evidently a nice and short review is not good enough any more. Why do I have to write a novel???Go to this place if you are in Leicester square and enjoy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HLuZ8uUL2h9LQC7XeU4TNw"
  },
  "cUsz8S59koeSKyqvsmgULQ": {
    "date": "6/16/2018",
    "text": "Love stopping here when I visit London! Feels like home. Staff in several locations has always been friendly for years. The food is always fresh. I'm so thankful for the staff because they really know the food and the menu and can answer any question about ingredients and taste. Big portions! Top it off with a glass of wine",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqv71YzFmhoTVhaLpCKYhQ"
  },
  "qBBtzbejtdZrPFUO0fA4cg": {
    "date": "3/20/2018",
    "text": "We stoped by here for dinner while visiting London. It was very close to our hotel and open quite late. I remember them having a great wine selection. The food was delicious and service was fast. The place is a little small but still cute. I def recommend if you are staying nearby.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ZtuFr9StmCibUZvPsjXXQ"
  },
  "SECo9B_g5L1gH_ft1AVM9g": {
    "date": "7/15/2018",
    "text": "With Italian good being a favorite for my family (we're from New Jersey, USA) we were very happy with our meals here, it felt like home.  Food was delicious and we highly recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHOtt41EW2s3T8dav2tTlA"
  },
  "BGJCjEQQjGPR2XF-xnGidQ": {
    "date": "10/3/2016",
    "text": "My bestie and I were looking for comfort food done right in the form of pizza.We had a pizza flatbread. It was a medium size thin crust. It came with our own cutter.None of our cuts were even as we purposely had fun with it and made our own cuts.Service was in a timely manner and our waiter was super friendly.The atmosphere was elegant yet chill, a welcoming medium for everyone.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtGqdDBvvBCjcu5dUqwfzA"
  },
  "AdkzUFtezI0pri2GiRvdTA": {
    "date": "1/20/2016",
    "text": "I believe this used to be a pub before with lots of games machines and always very crowded. To be honest I'm glad about the change. Bella Italia was one of my favourite chains when I lived in Norwich but I had not had the chance to go to one in London even if they are all over the place.I found the chance to visit it now however as I redeemed some Tesco points for meal vouchers there. The restaurant was a bit busy but we were given our menus and first drinks quickly, then left to look at the menu in detail. I went for a stew type dish while my boyfriend got a pizza and we also shared the whitebait starter. The dessert was very nice too but it took a while between for bushing our main and them coming and taking the next order so we had to finish in a hurry to go to the theatre.While I did enjoy all the food I think it was pretty standardised. It's tasty and filling but can be found in most places. If you are in the area and have dinner there you will not be disappointed but it's not really a must visit restaurant for me. At least not in London where there are so many alternatives when it comes to Italian food.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ThJdIGmi-EvVrFx3493Cbg",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ThJdIGmi-EvVrFx3493Cbg/o.jpg"
      },
      {
        "img_id": "L-f_N_hc2ryWvT71qF_DCQ",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L-f_N_hc2ryWvT71qF_DCQ/o.jpg"
      },
      {
        "img_id": "w9Z1iiL8U3HlRqssow2j5Q",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w9Z1iiL8U3HlRqssow2j5Q/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "v5OVFFraLgwQV3-dS7ArMg": {
    "date": "1/11/2017",
    "text": "Great place for a quick pasta or pizza right in Leicester square.  The upstairs was closed so it was a bit tight and stuffy but the food was great overall.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-44rGGwjvxQbWJP92epIog"
  },
  "jxACoWq7_0z22PTrsTvL9A": {
    "date": "11/30/2015",
    "text": "We came here needing a place for the seven of us to eat for lunch including teens and pre-teens. This fit the bill.It is standard chain Italian. Nothing bad about that, but it's just not very memorable.I had the lamb ragu. Enjoyed the pasta though it was a little dull on the spice factor. Was missing something like pepper or salt or some other flavoring.The kids enjoyed their meals and everything went fine. It's just hard to remember any details just two days later.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rqY0AQMUtoDQnfgxCNuKgw"
  },
  "ZhV9QISL71rp6GCVYdzTjA": {
    "date": "7/4/2016",
    "text": "When I arrived it took a while to be noticed by any of the staff. However in the end the customer service was good and my food was absolutely perfect. I will be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BXN-pk_xd36dtad9ThvnQA",
        "caption": "Photo of Bella Italia - London, United Kingdom. The salad was fresh, and salmon cooked to perfection",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BXN-pk_xd36dtad9ThvnQA/o.jpg"
      }
    ],
    "user_id": "krXZtPuOOjIXL-Fqh0uHrw"
  },
  "cvvKhcoljhYyUx00Df9OnQ": {
    "date": "7/30/2016",
    "text": "This was my first time at Bella Itália and what attracted me to it is my love for carbonara pasta but I'll get to that in a bit. I would like to share my views on the look of the place. I like the Italian feel not that I have been to Italy but I like the bottles on the tables with the candle wax on them but damn the tables are small. Menu is simple and made easy to choose what you want with clear descriptions of the dish. The lavatory is so small that I had my knees against the wall wile sitting down... wowI want to talk about the dish itself. I'm not a chef but the dish was too salty and not creamy almost as if the cream was been reheated rather than made fresh. Not sure it will be somewhere I'll go to again. Ohhhh the milkshake is brilliant tho.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b7zftfl238BocRfWokLVFg"
  },
  "BeTHhgV4O9_c8vAQEy3Wcg": {
    "date": "7/26/2016",
    "text": "Service was good, we went for lunch and the lunch menu was good.I dont give 5 stars because I dont think we will come back since it was not spectacular.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnTSCTTvI1TKSmuv0omw4Q"
  },
  "twySnMisuS_-c7izU3nwnA": {
    "date": "9/18/2014",
    "text": "I'm always late with reviews but here goes. Ate here on August 29th. Was very cozy and the food was good (loved the olive plate yumm!) our waitress who was Lithuanian was very pleasant and accommodating, loved her! Food wasn't phenomenal but was good enough. Their coffee was awesome but the tequila shots must of been tequila flavored water, that part was disappointing (no buzz lol) but overall decent experience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bwyKD6Hm6v6Z8jQX7EjJ1A",
        "caption": "Photo of Bella Italia - London, United Kingdom. Olive Plate at Bella Italia",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bwyKD6Hm6v6Z8jQX7EjJ1A/o.jpg"
      }
    ],
    "user_id": "3LlyBSDzbVbEoQ61i7s8gw"
  },
  "JY0glMfDj34Rc1tBKNL_5A": {
    "date": "11/17/2015",
    "text": "Great food at reasonable prices, what's not to like?  As well as traditional Italian food for lunch or dinner they do breakfast and as a bonus they have unlimited hot drinks with any breakfast purchase (although I could only manage two).  They also offer set lunch and dinner deals and there are always bonuses to be had every week with the various offers they have on their site.Service is friendly, sometimes could be a be more attentive but not bad.  The food is well presented and full of flavour and it's well located to Leicester Square.  There are plenty of tables inside with another floor below and some tables outside so it's not difficult to get a table here if you are looking for a quick bite to eat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw81aVQdsfiVXOq2Kgl8EQ"
  },
  "WeWqfKJbBpXWD7ZeQ4IFHg": {
    "date": "7/28/2015",
    "text": "I came here with 4 others on a Saturday evening and was seated promptly, though it was very busy. Manny, the waiter, made our experience a great one. He was professional, prompt, knowledgable and very welcoming. I can't say the same thing about the hostess that sat us. She was short, brief and was not accommodating when we asked her for a booth. The warm garlic bread that we had as an appetizer was absolutely delicious. I wish I could bottle the sauce that it came with and take it home with me. The bruschetta was just OK because it came on very large pieces of bread that made it difficult to share and that got soggy pretty quickly. My pesto chicken pasta was amazing. The portion was pretty generous so I was stuffed by the time that I left. It's obvious that whoever owns this place is Italian because the food is very athletic and very delicious. The prices are moderate and once again, we were very happy with the service so I definitely recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IMSjCE7Td8bgtSLB2-B8xA",
        "caption": "Photo of Bella Italia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IMSjCE7Td8bgtSLB2-B8xA/o.jpg"
      },
      {
        "img_id": "0QeRw8rJuW4mfICM2ljcuw",
        "caption": "Photo of Bella Italia - London, United Kingdom. Bruschetta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0QeRw8rJuW4mfICM2ljcuw/o.jpg"
      },
      {
        "img_id": "0BQQVt6dfwPZpiGuQG9d8Q",
        "caption": "Photo of Bella Italia - London, United Kingdom. Chicken pesto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0BQQVt6dfwPZpiGuQG9d8Q/o.jpg"
      }
    ],
    "user_id": "exAWpxarik6vghkh9h09yA"
  },
  "sf_pvp7yOf5xXwQ1E4p5sg": {
    "date": "1/16/2017",
    "text": "Steak was dry,cold and tastless. Found a long black hair in the icecream. Nice staff, they gave us a free round of drinks + desert. Waited 15 min to be seated and close to an hour for our food.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eYEsaTkzpO0eeIfJGv--yg"
  },
  "zIQVeTiXUVJj2qDU-lAdHQ": {
    "date": "11/26/2016",
    "text": "20 minutes in and out prior to a show. It was amazing food too. This was with so many places that were packed",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9IY05ekx8VsiJPUE8X56g"
  },
  "2Fe6OkrFVPxcYbKB4hCglA": {
    "date": "3/8/2014",
    "text": "It was totally fantastic!!  Went their for my birthday on feb 27th 2014I had the chicken in white sauce with pasta! And my aunt and uncle had the fish dish and as a chef I think it was great,The service was very good maybe a little more attentive But overall a very good evening!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQgiVU1qHvJNJwiHGZ8bhw"
  },
  "HHZ8BWXayPWA0jIIpUnpVQ": {
    "date": "1/17/2016",
    "text": "First time trying and definitely recommend. Amazing veggie options. Got to be back soon",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZDuIP2UJTt6YZt9MzDOpw"
  }
}