{
  "1YhvsoXT3Wgo5O7bkQt8Dg": {
    "date": "10/20/2008",
    "text": "The Woody Grill is always a favourite post gig nourish! Across the road from the Underworld (Worlds End) in the heart of Camden. Friendly staff, with tables and chairs to sit around. The doners are £4.30 and the shish kebabs are £5.30, the latter being my choice of munch.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "b75ApdqClI_bZKZzGST6pA": {
    "date": "1/14/2009",
    "text": "This is the perfect spot to grab some chow late night-  open till 4am- after an evening of trouble making.  Instead of serving the grub in pitta - they serve them in tortilla wraps - for your eating in or take away pleasure.  We took away our chicken and veggies, which my friend then spilled all over the blankets of her bed, as she devoured the delights.  Mmm...",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ey2Vgqbq2YeKRqLNo_c1nQ"
  },
  "8OS_qmcz3f3F0CrYJmkYDQ": {
    "date": "11/26/2012",
    "text": "Five star! It's a kebab shop that is clean, friendly and quick with your order. Lovely wrap, not some collapsing pitta bread in a tray. You just grab it with one hand and eat up while the other hand steadies you as you trapse up Camden Road. Costs more than an average kebab but well worth it. Not tried Hummus (the sister shop next door) the sign says 'the meat alternative' but it's not really is it! C'mon, doner is doner and there is no alternative, ha.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9chsyE3W4eMIRxWSTaZWzg"
  },
  "kabgIoRoaSM0tWnu81iNpQ": {
    "date": "2/12/2008",
    "text": "I concur. The lamb shish at woody is very nice indeed. They serve their kebabs in tortilla wraps, rather than pitta or naan as is customary... I put this down to Camden kitsch. My only complaint about this place is the price... the kebabs are smaller than their Mancunian counterparts and yet are a quid dearer... but then again, if you're in London you should already be accustomed to bending over and taking whatever you get given...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BtNq6EdzS8KyQDxZ66VJOg": {
    "date": "11/25/2008",
    "text": "Although I've eaten from here many a time after a couple of drinks this is only one of two that i will eat when sober. The other is on queensway in bayswater. excellent choice and it's good to see it's highly recommended.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QA-_APpIQGMKdAJkLwH_7w": {
    "date": "11/20/2008",
    "text": "The woody grill is a perfect cure for those late night hunger pangs after a night of alcohol induced joy. The selection of kebabs is good and they are all served in flat bread with your salad of choice, so that you don't get a pitta full of lettuce with your meat on top, neatly rolled and wrapped. The prices are reasonable for food and soft drinks and there is an eating area towards the rear. Be prepared to queue at kicking out time.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3abuCLexijOa1LOFAoOA2g": {
    "date": "11/16/2008",
    "text": "Woody grill rocks! Open till latevery late. God knows when they close. Ive been there around 3 or 4 am and they were still running. My favorite? The falafel with hummus. yummyMaybe a bit more pricey than your other kebab shop but it feels more quality. Recently the opened a new room at the back so there's space to sit down and enjoy your indulgent meal after a night out. apparently the owner spend 10 grand on the special wood that is all over the inside of Woody Grill. I don't really care, but it certainly looks and tastes good. Oh yeah and always gor for the garlic souse in big amounts! There is another branch in kilburn as well.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "00oeQa85FflTtWjMdwq5hw": {
    "date": "4/29/2009",
    "text": "i get that you want to close early but that doesn't mean you can slack off on the orders. one friend was missing the sauce. another was missing the peppers. what is going on? to top it off, your chicken kebab was quite dry and didn't taste like much. sorry woody. try harder.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BE4fE4R3TaVn8xy4sYYjbg"
  },
  "xnXpvyUjmtQS6rqISeEGdw": {
    "date": "2/13/2015",
    "text": "Banging chicken shish! Haven't tried anything else from here but you don't need to with chicken shish's like they do!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9kSt9w85DtOnG8lKa_pWw"
  },
  "j5gebRD0nvOmKfz4hvZ1Kg": {
    "date": "10/15/2013",
    "text": "The kebabs were ok - but with so many kebab places in this area, this one didn't give me any reason to come back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqOSpuFXffTisC1ahPbaWg"
  },
  "MiBTxcNDFWgkRFHfQYU7TQ": {
    "date": "5/20/2012",
    "text": "I call this my local 'posh kebab shop'. Yes it sells that post-night-out grub that most people frown upon, but it's some of the best there is in that category. If I'm ever on the way home from a heavy night, this is my port of call for a late dinner. The great thing is they also have plenty of room to eat in and it's more like a restaurant than the usual kebab shop. This means that you can consume your kebab on the premises so you don't have to face the evidence the next morning, when you are hungover.Go for the mixed kebab and chips and share with a friend. Yum.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qXcUi2fBbV18TNpOpfi-rw"
  },
  "H-PTUfJxr30rGVYGqSl96g": {
    "date": "1/21/2010",
    "text": "I guess Woody grill is so named due to the nice woody look to the place? Anyway the décor is nice and there a few tables you can sit down and enjoy your food at if you don't enjoy trying to eat your food and dodging pedestrians while trying to keep the front of your coat unblemished. It is a skill I do not have. I had a kebab with salad and chilli sauce here and it really was excellent. Nicely wrapped up so that although some of the sauce escapes it gets caught and your trousers remain unstained (are you spotting a theme here?). The chips were not really worth getting, this place is all about the kebab.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "gcATY4gEjkwnPOfqw4pItQ": {
    "date": "4/18/2013",
    "text": "They have such a great mixed special grill menu item, this place does proper kebab grilled meats.  Their dipping sauces are good, and the food is always quick as you would expect. The service is not always the best, some of their other stores have more of a sit down service meal but the experience and quantity of food seem to vary by the way you look or the number of people you are with even if the price for the mixed grill is fixed. I also have suspicions that they add water to the freshly squeezed orange juice, I guess we look like tourists! I go there a lot less often now that' I feel a bit cheated.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xoRjUUMOUj9cqkccJ1ULOQ"
  },
  "MQ0sL6e1uCb5-422xzsdjw": {
    "date": "7/23/2014",
    "text": "My favorite place to grab a doner kebab or shawarma at the end of a fine evening. The doner meat is great quality, salads are fresh, and a wrap will get you change back from your £5. It's not rocket science, it's just good ingredients and good practices combined for a tasty drunk time nosh.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0MxKlUCRO6RzAlK-3F9fA"
  },
  "N-CDH3eAFLeQN7VkW4U6Sg": {
    "date": "5/18/2014",
    "text": "Mixed donar with rice meat was far from juicy sauces were pretty much tasteless service was great though sadly the food was no were near 4 stars. But I guess most the people wrote the reviews while  intoxicated.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok2enORZm5JzXl2i7MSK5A"
  },
  "1aqWxJRe7ZjUiKI88NuhBQ": {
    "date": "9/23/2013",
    "text": "Best shawerma in Camden... Open late too which is great on the weekend!  Surprisingly real food, good ingredients, etc.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mspG9iGlLzA5p22DDLguuw"
  },
  "lcHmQ0qA7svhK9xnI6QMNw": {
    "date": "12/3/2008",
    "text": "The perfect antidote to a hard night on the tiles, Woody Grill is perfectly between the tube station and the buses north. Quiet a small space, it does have a seating area upstairs but this always seems to be closed late at night and so serves no purpose. The menu is your typical kebabs, thankfully their shish kebabs on the grill are very tasty though i could never try the elephant leg so couldn't comment on it. The chips are a bit cheap tasting but, then again, they actually are cheap so... The venue also sells some proper meals of lamb shanks and rice and some salads so there should be something for every drunk person that drifts in there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BmdrqQjUsN3WfJUSue6Dvw",
        "caption": "Photo of Woody Grill - London, United Kingdom. Woody Grill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BmdrqQjUsN3WfJUSue6Dvw/o.jpg"
      }
    ],
    "user_id": "RVsgs70SwiOVR6jjhVLHXw"
  },
  "KYQGgdAYPo5WVN1RO3rFwg": {
    "date": "7/27/2013",
    "text": "Woody's does the best chicken shish kebabs in Camden, maybe even in the whole of London  delicious in a wrap with salad and a generous helping of their garlic sauce. The shop is always very clean and the staff are really friendly. I dropped in for a takeaway late afternoon one Saturday and while I was waiting for my kebab to cook they sat me down in the restaurant section and gave me a complimentary cup of Turkish tea, great service!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "esLEbkeUWelYnnQMZ_UL4g"
  },
  "w4c7DATea1S5elOXG-eeZQ": {
    "date": "3/21/2014",
    "text": "Absolutely loved it... The best shawarma I've had in a LONG time - the vibe is great, the staff was awesome - I've been meaning to write this review for awhile, since I worked in London for a month in Sep 2013 - but, overall awesome food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UaXyKbYEVWkOIsGuRkV76A"
  },
  "95-WcD2m2LYjH3S3aFv6aw": {
    "date": "7/29/2010",
    "text": "*Note this review is for the Kilburn outlet* Top kebabs at this place. The Chicken Shish is one of the best I have had in London. Take away or sit in, kebabs are great. The take away kebabs are great, but I actually like to sit in and eat at this place. You get grilled chicken, served with salad, pitta bread, chilli sauce and delicous garlic youghurt sauce (the chicken shish). This place opens late (I think until 4am) too. Whether passing at 6.30/7pm and dropping in for some chicken and pitta bread, or drunk at 3pm these kebabs must be tried.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pryoJ1DPlbcLaf79Vypr2w"
  },
  "E3a7DAbRZedWMrlxFI0laA": {
    "date": "1/3/2008",
    "text": "I'm not sure if this is the best kebab shop in Camden Town, but if it isn't... the others must be out of this world. Woody Grill is an excellent place where I've enjoyed the fruits of the grill on many a night out. I once came here with Toucs and he actually ordered another kebab immediately after finishing the first as it was so nice. I can recommend the lamb shish - it really hits the spot.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "-creSYVsQWyAzuqN_CWDCA",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-creSYVsQWyAzuqN_CWDCA/o.jpg"
      },
      {
        "img_id": "edR60ZpRGrUsIPN1SE_IhQ",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/edR60ZpRGrUsIPN1SE_IhQ/o.jpg"
      },
      {
        "img_id": "l7E7Zu8cg-0SGBKeTuySRw",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l7E7Zu8cg-0SGBKeTuySRw/o.jpg"
      }
    ],
    "user_id": null
  },
  "uhGS2MBJbu1t55wmUGpwEw": {
    "date": "2/25/2010",
    "text": "Was recommended this as good after-gigging food stop and noticed they are now in Shepherds Bush, Kilburn AND Camden where I went recently.My food was served hot and filling with generous salad, with cutlery, serviette and polite service. I loved that the pitta bread was warm too.This was early evening so it wasn't too busy and because the seating area upstairs was open it probably added to the quality of the experience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cF7UUE2jEWCrb_X_7ffpRQ"
  },
  "8mf9mZXtG6d_y9hSBvOsnw": {
    "date": "12/12/2012",
    "text": "Absolutely top kebabs! It's my favorite take away by far! I know it's a chain with different branches but I usually go to the one in Acton as I live close by, but I heard they are all the same. Amazing quality proper grilled meat (no processed shit!) and very affordable. Portions are generous and always accompanied by fragrant rice, fresh and well dressed salad and a home cooked naan bread to die for! I would recommend it to anybody.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8N6Cq3cArI5eQp0iftZ5RA": {
    "date": "9/1/2012",
    "text": "Awesomest kebabs I have had in a while..  And the best part is that they are close to all the clubs and pubs in the area!  So a great place to grab a spicy bite once you have beer bottles down your belly and you are famished with dancing your guts out on the floor and you want to feel stuffed with good food!  The kebabs are so stuffed that me and my friends almost kept dropping half the chicken pieces on the floor (not because we wer drunk :p)... Would love to have a better seating arrangement though- something similar to their Kilburn shop maybe...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DafNTczOn1vr7EDqeFshw"
  },
  "-OjvE8XvYyTIEs3XTM8psw": {
    "date": "9/24/2012",
    "text": "After a long time renovating this place and another one just around the corner, it reopened a few months ago.  The price went down, so you can have a decent Shish kebab for £6 and you can eat in.  We had lamb and our friends had mixed kebab and Adana (?) kebab with yogurt.  All the Shish kebabs were cooked to perfection but my friend said Adana was way too heavy.  Their bread was warm but somehow tasted heavy & stale.  They need to get fresh better quality.  We liked their Chilli sauce.  Strangely it was empty on Sunday afternoon 1pm, but the service was very slow.  Still the best place to have Kebab in Camedn Town, particularly if you want to sit down.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU-ZbzQ-GLDoqOIzNTuT0A"
  },
  "wMql5te1KeJTBDMXzVbiHg": {
    "date": "9/17/2012",
    "text": "The best doner kebabs in the area. Surely the cleanest :) Good fast food, tasty and meaty. Give it a try.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wDsxXETUzn6hMkSpdxaMcA": {
    "date": "6/4/2008",
    "text": "Five years of living and working in Camden gave me ample time to sample the many delights of Woody Grill. To be honest, if this review is somewhat lacking in detail, that's because I undoubtedly frequented this cracking kebabery after a long fun-filled night. The staff are - and have to be - some of the most tolerant and helpful chaps you're ever like to slur at, and the tasty Turkish treats they serve up are substantial, well-cooked, and probably wasted on those who are wasted. Personally I'd say their kebabs are better than those in The Marathon near Chalk Farm Tube station (although the burgers are only 'OK') and I believe there is even seating upstairs.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mL-tD1oPICLUd1rgcLsY_A"
  },
  "14WYiQZpFlQWTKug9Cbi5g": {
    "date": "11/19/2008",
    "text": "Situated right at the beginning of Camden Road and in proximity to both the tube station and buses going in all directions, this Kebab place is a necessary evil for those who may need sustenance or something to soak up the nights alcohol. Whilst i could never eat anything off the rotating elephant legs they do seem popular but for me the range of shish kebabs, rice and other turkish dishes stand out. The venue has seats upstairs up to a certain hour, which i invariably miss, and a few seats downstairs for those that don't wish to eat on the go and the service is quick and friendly. Throughly recommended little takeaway for those in the area.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n5XwB46dk-216gz5NmrRDg": {
    "date": "3/21/2015",
    "text": "Good location. They try to make too much profit of the space by placing too many tables too close. It didn't help for us the fact that we got seats by the worst and loudest table neighbours ever.The service was a bit slow, and the place noise. There's a coffee station in the sitting area where they keep cleaning dishes quite loud.However, the food was great, and after we managed to order it came quite quickly.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C1onlGgLYyjakFaPtpz_dQ",
        "caption": "Photo of Woody Grill - London, United Kingdom. The wrap is hand made, well stuffed. Great flavor.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C1onlGgLYyjakFaPtpz_dQ/o.jpg"
      },
      {
        "img_id": "eKSqvsaxgohXZ7nqOCwv9g",
        "caption": "Photo of Woody Grill - London, United Kingdom. Falafel wrap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eKSqvsaxgohXZ7nqOCwv9g/o.jpg"
      },
      {
        "img_id": "hPm7SQ7-8KgqoUaOa-32wg",
        "caption": "Photo of Woody Grill - London, United Kingdom. Lamb doner wrap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hPm7SQ7-8KgqoUaOa-32wg/o.jpg"
      }
    ],
    "user_id": "ZPIyvL89Vf7euLs6AhGHEg"
  },
  "RSnjDr4FhAdqlkAD-YVsKw": {
    "date": "8/25/2015",
    "text": "Not your average kebab shop. Much more established and almost \"subway\" style where you pick out nice, fresh ingredients to go in. Was quite happy with mine, which I grabbed on my way to a gig down the road at the Electric Ballroom.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhVNG_1NOEyxfxudd6TSCg"
  },
  "3fo5wodI7NYtXAStrvRt5w": {
    "date": "5/29/2017",
    "text": "Excellent doner/swarma joint. Will be back next time in London. Quality meet and quality service. And somehow tastes better when consumed late at night. :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fxTJde_BU7reNJeOgAtEWw"
  },
  "F4S8gYz0jlpLkGp1XjIC0g": {
    "date": "6/1/2016",
    "text": "Located right outside Camden Town station, Woody Grill is a convenient place to grab a quick bite to eat. I picked up a falafel for takeaway and it was thoroughly enjoyable. The service is quick, as they prepare your food right in front of you. Not exactly friendly, the staff treat customers with a weariness borne of regularly serving post-pub Camdeners, but they expertly prepared my falafel and had me on my way in less than five minutes. I appreciate a good falafel and if I ever choose to eat in, the seating looks clean and inviting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "wyYmhkwW4dzri2URPo5l7Q": {
    "date": "5/17/2015",
    "text": "Once I was craving Woodys Grill so much after a night out, but the bank machine ate my card, so I had to go home without my favourite halloumi wrap. I almost cried. That's how good it is. Lamb shish is also really really good, love their chilli and garlic sauce. Much better than the average kebab shop.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UgIgjOWrQ-kmwvcHdLF-TQ"
  },
  "uJjLugBRx7aUZ6sal8tdig": {
    "date": "5/12/2016",
    "text": "Yum yum yum - what can I say if your looking for a kebab this is the place to be!! Both times I have been quite tipsy but both times I have felt the most amazing food! Quite and easy to order - they do have seats but sort of place you want a takeaway and it's always busy so that's good sign. First time I had meat and chips which was just what I needed but the second time I had a lamb wrap which was mouth watering delicious with a selection of salad and chilli's I will be back to try something new ...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQ_0QVxhbhbfHZj3qFO6Lw"
  },
  "OkTuPdni6OZYV0kWU9UzOw": {
    "date": "9/10/2016",
    "text": "Came here during lunch after a visit to Camden market and I absolutely loved the clean setting, friendly staff, and brilliant food! They have a number of locations and would highly recommending visiting one if you're craving meditarranean food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "37RD3A9xnkdzzIkTaHx7-Q",
        "caption": "Photo of Woody Grill - London, United Kingdom. Lamb kofte!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/37RD3A9xnkdzzIkTaHx7-Q/o.jpg"
      },
      {
        "img_id": "Is7TDgXUMu1DqRAk3HR5BA",
        "caption": "Photo of Woody Grill - London, United Kingdom. Mixed Kebab: Lamb kofte, chicken shish, lamb shish...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Is7TDgXUMu1DqRAk3HR5BA/o.jpg"
      },
      {
        "img_id": "wrt0Ch8Io_AumvYU8NoUoQ",
        "caption": "Photo of Woody Grill - London, United Kingdom. Turkish tea...mmm...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wrt0Ch8Io_AumvYU8NoUoQ/o.jpg"
      }
    ],
    "user_id": "2hSgM6yqFylYqgqWI6olQw"
  },
  "mKgKtHf6Ld73IAEZKbM18w": {
    "date": "4/23/2015",
    "text": "Lamb Doner was excellent. The falafel wrap has quality falafel, none of that grainy stuff. Food is reasonably priced.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7v1Ai9r1Knad53Srnu1sEA",
        "caption": "Photo of Woody Grill - London, United Kingdom. Lamb Doner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7v1Ai9r1Knad53Srnu1sEA/o.jpg"
      },
      {
        "img_id": "4L21k0Ts8QDWwfB8ucw1bw",
        "caption": "Photo of Woody Grill - London, United Kingdom. Falafel wrap",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4L21k0Ts8QDWwfB8ucw1bw/o.jpg"
      }
    ],
    "user_id": "3NLMcRoQJ-NwDeD-dinHOw"
  },
  "MaYig7x7OyezqkAL1dqrzw": {
    "date": "12/19/2013",
    "text": "Boy was I surprised with my first visit to the Woody Grill! I have been aware of some of the other branches of Woody Grill around town, but as yet I had never tried any of them.Thank goodness that the owner(s) of Woody Grill saw the gap in the market for this type of food, delivered in this way! Top quality kebab ingredients put together with fresh salads, tasty (and, by my reckoning, not too laden with artificial flavourings and colourings) with quality wraps and breads.The big difference to the flavour is the type of wood charcoal that they burn under the grills that really adds to the taste of the meat that they cook here. All of the pieces of meat I had were full of flavour, and satisfyingly juicy. The only thing I had to be aware of was not to get their delicious sauce run out of the wrap down my arm to my elbow!A real treat. I cannot wait for another opportunity to give the Woody Grill, another visit!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "RHiqvFk9ql_t7J18lfwphQ": {
    "date": "4/30/2014",
    "text": "Not earth shattering, but a decent falafel. They use a flour tortilla vs proper middle eastern flat bread, however the results are still pretty tasty.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nm_ZMuTuAEVfY17Ec539uw",
        "caption": "Photo of Woody Grill - London, United Kingdom. Falafel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nm_ZMuTuAEVfY17Ec539uw/o.jpg"
      },
      {
        "img_id": "HnTzBtLUYNLxFBvijDPReA",
        "caption": "Photo of Woody Grill - London, United Kingdom. Falafel w the hot sauce.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HnTzBtLUYNLxFBvijDPReA/o.jpg"
      }
    ],
    "user_id": "answ6V84iLiZSHxTlv87Hg"
  },
  "N-P2H-7AyLupwPsq-DCvvA": {
    "date": "11/2/2015",
    "text": "Above average kebab shop. Server was happy to tell me what was on the meat so that I knew I was safe to eat it with my allergies to gluten, dairy and egg. Great place to stop on the way back after a night out in Camden!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tr2I31H4Ux7DCbnGw02aRg"
  },
  "OWD0XoPLNJNyOGLqA9VB5w": {
    "date": "6/2/2015",
    "text": "Not what I thought it was going to be.  There are so many cheap kebab places in London. This place is inexpensive but the quality of the food is fantastic. Great flavors and super friendly staff. Be sure to check this place out. And they are open late!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYcUn0_rzoHhqLa0FvCr3w"
  },
  "0x82-UOL532MM4cT608xqg": {
    "date": "8/21/2015",
    "text": "I'm pretty confused about the rest of these reviews and wondering if maybe I came here on a bad night because honestly I thought the food was not worth stopping by for. My husband and I tried the wraps, each with a different sauce in it (one spicy, one not) but both tasted so bland as if they didn't put any sauce or flavor in it at all. They didn't taste bad by any means but they weren't good either. We are only in London for a few days and wish we'd have tried something else for dinner.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q19iCBA1QUEIdOz4BrE2jg"
  },
  "PW1E2_0qtcEENYQN1m4V5A": {
    "date": "4/15/2014",
    "text": "Very good meat and ingredients mean they can charge a bit more than your average kebab place and ot is well worth it for such good quality.It is clean and decor is nice, the slightly abrupt service means it just misses the 5th star.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "patjWcCve5DgaBnCe_OJBw"
  },
  "UfpodZ66-HnUHx2umghm4Q": {
    "date": "7/23/2013",
    "text": "I wasn't really hungry when I stopped in at around 1am. It was a brisk early morning in May. Scratch that, felt like winter. I was shocked by the weather in London! I'm used to humidity during the end of spring. Kinda hard to find a perfect blend of spring weather now a days. All I had packed was a cardi and a leather. Anyway some kid that I met at a Caribbean joint near my hotel decided he didn't want the food ordered from the spot I met him at. I had scarfed down my food. I paid for it so it will be eaten. I wasn't really hungry when he invited me out to this joint. I caved and decided to go and get something light. The pita was nice and warm. Just delightful. The orange juice was fresh and tasty. I really loved the falafel though! It was so delicious! Nice and hot on such a cold night. My only problem was that they had the doors opened. Why? It's -10 degrees out, seriously... They probably wanted us out. We didn't leave until 3 or 4am. I was pooped.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R5DQ7raOumDw_1Be5VRuew",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R5DQ7raOumDw_1Be5VRuew/o.jpg"
      },
      {
        "img_id": "vl69hmIXJCoL5Hrx_f_p7g",
        "caption": "Photo of Woody Grill - London, United Kingdom. Served with your meal",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vl69hmIXJCoL5Hrx_f_p7g/o.jpg"
      },
      {
        "img_id": "U2ilXOU90SEsEo3AGWawGQ",
        "caption": "Photo of Woody Grill - London, United Kingdom. Had me some falafel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U2ilXOU90SEsEo3AGWawGQ/o.jpg"
      }
    ],
    "user_id": "K7B3tFqLFbG8DSK7yLjCpQ"
  },
  "tN61V6C9TW_E8tHwHaIuCA": {
    "date": "10/6/2015",
    "text": "Yummy lamb or chicken wrap start from £5. I had a lamb roll - Hot, delicious, fast, fresh - highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G4zUE1H8JQ0gpao5O8XA5w"
  },
  "knEf6zcikFc6qDnc5PrElQ": {
    "date": "8/5/2015",
    "text": "A place for meatty! The place is not big. Better go for take away. Wraps are good as always~ in fact, turkish food seldom fails me",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRsGW6uaWkYKPXiroOomKA"
  },
  "rcoTcFyvVCD4xFUD1ew3cA": {
    "date": "7/20/2015",
    "text": "Mixed wrap..No drip,no mess, easiest unwrap ever! Flavoursome,additional touch after the cut. So fresh and the salad on top! Yummy ;)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DS40gVus5DRg8AFEjHP-w"
  },
  "wLw3Syh-k48_4ntohrqNnA": {
    "date": "10/29/2012",
    "text": "We always visit Woody's for their awesome falafel when we are down in London but this time I decided to try the Woody Special grill... wow. Brilliantly cooked, tastes amazing.Seriously, this place is great, pay a visit!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_1hchENqRt75i1wkAuC9Cw"
  },
  "lJrfiWTvgr_JeUG1eo9SFQ": {
    "date": "3/11/2013",
    "text": "Woody grill is the best kebab place in the area, and it's reflected on the price. The people there are so nice and the portions are humongous. The quality is good, and the place is clean, always a good sign.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eadxRIaTCxzREoqHpzstnw"
  },
  "u0bQq5PznwvDYBbwGbHWqQ": {
    "date": "10/24/2018",
    "text": "This is the best kebab I've had since leaving Turkey.  Can't find a decent kebab in California.The mixed doner chicken and lamb plate is wonderful.  Comes with delicious rice, red cabbage, onions, salad, tomatoes and cucumbers.The included humus, bread, and assorted fixings were very tasty.  It was an excellent meal and cost was very reasonable.This is an don't miss restaurant when in the Camden market area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZPGDHcKbO3R6otCFQgb3wQ"
  },
  "gGaW7Lf_ZbQkB5t2s58_xg": {
    "date": "9/30/2018",
    "text": "Very tasty. Went for the doner wrap and it was fantastic. Not too much seating available.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YTELXD26gneRDZnP8m2xLQ"
  },
  "f4O3LXKOzFStdeTnYW5bAg": {
    "date": "12/26/2016",
    "text": "Incredible service and food!!! This was my favorite middle eastern food outside Middle East. The best house made Ayran and chicken shish! Our service was also impeccable  super friendly and accommodating (our waitress gave us the best tips on what to order)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L2sVpx8-z3EY83agOxNVkg",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L2sVpx8-z3EY83agOxNVkg/o.jpg"
      }
    ],
    "user_id": "7NpGJMb1-HQFd_dsMqFvEw"
  },
  "xJyro8dJDViMMw-1vjDFUA": {
    "date": "7/24/2018",
    "text": "This was the number one rated yelp listing within the radius of this neighbourhood I had only been in once. It certainly doesn't disappoint. The food is delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZk18SnVR6AJUaD4y8cPDA"
  },
  "0lHZHVfvLO6SLUq6XDwDOA": {
    "date": "9/24/2017",
    "text": "Great food - great valueFirst rate Turkish food - fast and fresh and inexpensive and delicious.There's so much good food in London but we ended up coming back here repeatedly. Really nice folks at this location too.Wish they'd open NYC branches....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp86Y3HkFEiffc5ovaVDlw"
  },
  "yIQfLBHaKMSj5x-wmxWPZA": {
    "date": "7/4/2018",
    "text": "The food was delicious and fresh!!!  The service is amazing!!!  Do not miss this place!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fx2u3-XKClg3YEPmTwQeZg"
  },
  "J53D4I991vF8DV4-mKN3IA": {
    "date": "11/17/2017",
    "text": "Amazing food, try platter for two! So much yummy food, you will be rolling out of this place. Very reasonably priced! extremely nice and attentive staff! would recommend to any meat lover!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-v1pco8dB7ptDzlnI1l79A"
  },
  "myR8u9G21D-elmgTD6jmPw": {
    "date": "9/22/2015",
    "text": "London isn't known as being a cheap destination, but you can make it one!When you dine in, your order comes with a giant serving of Turkish bread and sauces, your main course, and hot Turkish tea to finish.£7.90 Chicken Kofte...delish!£5.90 Chicken Schwarma...delish!The food here is definitely legitimate as it seemed to full of locals and Turkish/Middle Eastern looking folks eating here. I'm only sorry I didn't get a chance to here a second time.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "DQ3TJp_pCFtef20G7rWE_Q",
        "caption": "Photo of Woody Grill - London, United Kingdom. 5.90 chicken schwarma",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DQ3TJp_pCFtef20G7rWE_Q/o.jpg"
      },
      {
        "img_id": "Eb48Y6yuTrwkELXmbSCqZg",
        "caption": "Photo of Woody Grill - London, United Kingdom. 7.90 chicken Kofte",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Eb48Y6yuTrwkELXmbSCqZg/o.jpg"
      },
      {
        "img_id": "S7LCW6kIrPCMHYfnnqo7rg",
        "caption": "Photo of Woody Grill - London, United Kingdom. FREE!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/S7LCW6kIrPCMHYfnnqo7rg/o.jpg"
      }
    ],
    "user_id": "IzJ36jX6V6ky5BtoN-Agng"
  },
  "_tkhEgb3tl2-kHn7cDdHLw": {
    "date": "6/3/2017",
    "text": "Highly recommend! I had the lamb doner and it was absolutely delicious. It came with a fresh salad and rice. I wish the rice was more tasty but the lamb & salad absolutely made up for it. When my friends and I came in for dinner, delicious bread & hummus & olives were immediately provided for us. We were very grateful because we were starving and we could snack while waiting for our entrees. Service was good and the staff was very kind. Price was very reasonable. Paid around 10 pounds w/ tip. Will try to come again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4HeGhcJviGEECwqnCTAcA"
  },
  "rmj34ZDModnXQ3-_ZYHJlA": {
    "date": "8/22/2016",
    "text": "5 stars for hours, friendliness of staff, speed, and price; 3 stars for taste.Stopped by at about 2:30 am early Sunday morning after a night out on the way back to my friend's apartment, and ordered a combination (chicken and lamb) shawarma wrap with all the toppings. The flavors were all good, and it was surprisingly not messy to eat (they really wrapped that thing well - and I loved how they immediately ripped off the top half of the paper so you could dig right in!), but I kept getting hard bits in the chicken - not bones, it was just way overcooked and dry. Should have just ordered the lamb. For a fast, hot meal at that time of day, though, it was great!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "59BPS4Arbd2cMrXQzP0LPw"
  },
  "VjqS12TeYmnS13YWRE6glQ": {
    "date": "1/28/2016",
    "text": "With so many take-away's in the area Woody's has a lot of competition. However the bright interior and food options, do call to me... I also love the salad they give you, it's so crisp, it makes the wrap and that's important to me!Prices are reasonable and I find the falafel moister than King of Falafel across the road. The shish's are on the more expensive side, but they make them quite quickly and the meat is pretty juicy.A recommendation is to eat in the restaurant (if it's not late they are usually open), the bread is much better, you get some better sauces and accompaniments, and it's nice to have a more relaxed meal. Also the price isn't much more than the take-away.Although I really didn't like the iskender when I recently visited, which was Lamb donner style rather than shish. I love this dish usually, but in the future would avoid it here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "8YRsiEgSY2XrREyGpwQ6iA": {
    "date": "1/14/2017",
    "text": "Woody Grill was recommended to me by my professor and it's one of her favorite places to eat in Camden! My professor definitely knows her food and I trust her taste so of course I thought to check it out myself. There is a very comfortable environment in Woody Grill that is great for conversing with friends over a meal. The service was relatively fast and the portion sizes were large and definitely worth the money spent (each person spent about 10 pounds and left full and satisfied). Additionally, grilled flatbread with hummus (appetizer) and Turkish delight (dessert) were complementary as we waited for our food to be prepared and as we were about to leave. I ordered a lamb doner plate and it was nicely presented with a generous serving of lamb doner over rice and a side salad---it was delicious and I would definitely recommend! Overall, great dining experience with great food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "20j4SmQU2x0_f-3jFy7PtA",
        "caption": "Photo of Woody Grill - London, United Kingdom. Lamb Doner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/20j4SmQU2x0_f-3jFy7PtA/o.jpg"
      },
      {
        "img_id": "MyfyKyNZ0Mqn6d6S_dOhcQ",
        "caption": "Photo of Woody Grill - London, United Kingdom. Assorted kebabs (shish, doner, and kofte)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MyfyKyNZ0Mqn6d6S_dOhcQ/o.jpg"
      },
      {
        "img_id": "UjN4K1xlqr6zkRMUtKqwsA",
        "caption": "Photo of Woody Grill - London, United Kingdom. Outside view of Woody Grill",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UjN4K1xlqr6zkRMUtKqwsA/o.jpg"
      }
    ],
    "user_id": "gK5-pyCw7d3CYUYYXl9OBQ"
  },
  "C-0upneN9qo6XoEKgjNL6Q": {
    "date": "5/6/2017",
    "text": "THIS PLACE IS THE RUDEST PLACE. My friend made a mistake with their order and they refused to let her reorder with her money. DO NOT GO HERE. THEY TREAT CUSTOMERS LIKE SHIT. GO TO THE OTHER PLACES ON THE HIGH STREET. I brought it how they were treating my friend and they were so rude to me and my friends. We had paid money and weren't rowdy or loud. I just brought up how rude they were treating my friend and they weren't nice at all. And weren't even busy enough to warrant being rude.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "31rokeEQR33A6LoD0FUZFQ"
  },
  "NnO6CrYWU_LY563CcOMhfA": {
    "date": "12/15/2015",
    "text": "very appropriate for quick eating alone! tasty!!This is a chicken stew 6.5£ with a good taste.I wanna try the wraps next time!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "x_SQ8_puVFjsugYP0vEskg",
        "caption": "Photo of Woody Grill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x_SQ8_puVFjsugYP0vEskg/o.jpg"
      }
    ],
    "user_id": "Y1-3sAw5L9Ew3voNGrB9wA"
  },
  "VPRxLlbnt2ZktBehh0yZGg": {
    "date": "3/16/2016",
    "text": "If you like lamb you will like Woody's. If you dislike bread you won't like Woody's. If you are vegetarian, you may need to get creative with the menu. Lebanese food does have lots of veggie options. Sadly they don't feature much on the menu which is why I subtracted a star. Update 16/3: had a quick combo falafel/hallumi wrap which was tasty and filling and not expensive. A win/win in the increasingly expensive Camden area",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZgjYZRMkFNBJIuSh5oR82Q"
  },
  "fnQROKpkmQJc67jBhcyGZA": {
    "date": "2/19/2016",
    "text": "I love this place!!!! Plus the never ending queues outside the \"take-away\" area prove that I am not the only one. The food is SOOOO good that it's always very hard for me to resist that additional bite (well should I say bites) after I am already full. The small restaurant just to the site is a fantastic idea. Very useful if you are with a friend/friends and looking for a quick bite to eat. And their sharing platter is always the way to go....there is enough food on it to feed an army :) It will definitely make you to unleash your inner carnivore!!!! However I am also a big fan of their falafel.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EikFPn5ONsNY8RnIJqzVsg"
  },
  "0feXUKzywDtjwMby5mV-YQ": {
    "date": "2/19/2016",
    "text": "Really really good doner or shish. I always seem to end up this way as my bus is literally outside. It's always quite crowded which is a good sigh but this kebab place appears from the outside very new (it's not) and is very clean.The food is fresh and you wait a bit which is a good sign by me. Good arouma too, but it's really tasty food so there is not much more I can say. Classy place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "jEF_3CfUeCpI2AGC9iDTZQ": {
    "date": "1/10/2016",
    "text": "How this got 4 stars is beyond me. Mediocre food at best!The service is terrible- no smiles and you have to flag the waitresses down each time for anything.The food was equally bad- rice was not cooked fully, garlic sauce was sour, meat was tasteless and weird foreign objects coming out of the lamb shwarma!Don't even bother ordering the Ayran yogurt drink that they have their name on- no salt at all- bland and gross. Won't go back!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IgEdAmni9jmgcumUcO2O3g"
  },
  "8oLU86CZcdCrK1Nd0mb5VQ": {
    "date": "9/25/2015",
    "text": "Based on the takeaway service I would give this place 5*. Excellent wraps and swift service. I did however recently pop in for lunch and had a sit down service which was shabby to say the least. As with most Turkish restaurants in London your brought over warm bread and a small array of mixed salad, garlic and Chilli sauce. I noticed a guy was just finishing up and pay when we arrived and the waitress was clearing his table. Thinking no one was looking, she collected the leftovers from the basket of bread along with dips and brought them round to the serving area round the other side which I thought was strange as you could see her taking the dirty plates down stairs which I assumed to be cleaned. I decided investigate and went round the corner to the serving area only to see a different waitress putting the left over bread back on the hot stone to re-heat and serve to another unsuspecting customer! They where just topping up the dips with more sauce and giving to the next person though the doors without a thought for hygiene or the fact that that stuff had been from table to table person to person. This was a firm favourite of mine but having seen this has really put me off going there. I guess if your eating a wrap takeaway there isn't much for them to do with that and its prepared in front of you.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HyY8TLoHnlNUljGJjCLOYw"
  },
  "yCub-Isl_mZoKCuIg5mQjg": {
    "date": "7/16/2015",
    "text": "Camden Town is great, so if you find yourself in this neck of the woods please enjoy the one part of London that definitely looks like Austin, TX. That being said, this place was good. They have a good amount of food on the menu and i decided to get the lamb and fries. I wasn't exactly sure how it came, but i figured it couldn't be that bad. They serve it as lamb over fries, literally. They put fries in a tray (if you ask for it to go) and put a whole bunch of freshly sliced lamb on top with chili sauce and white sauce, and if you want veges you can get that stuff. One thing you will notice though is that they give you a TON of food. Being from NYC, I know a little bit (read A LOT) about delicious halal food and this place is pretty darn good and pretty good bang for your buck. Stop in if your in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iyuo4SJ_wMZ7rcbJzexCVQ"
  }
}