{
  "glTe2_WwvHSZ1w82yzuu8Q": {
    "date": "7/17/2008",
    "text": "had dinner yesterday. The place was ok and clean. The waiters were nice. Some of food like fried baby squid or black pepper chicken were delicious. However the crab with garlic (?) was tasteless. I probably will return to try the lobster noodle.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nEID-HR2FBQPjMPkaWTSdA": {
    "date": "11/29/2014",
    "text": "I have been coming to Mandarin Kitchen for years and when I visit London on business or vacation.As a Trinidadian, we love Chinese food and their Aromatic Duck and the Lobster and noodles are absolutely divine and to our taste.Highly recommend them and the service is great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjOtsf02k81q4NPrDiIf6Q"
  },
  "KZnxY-wUG5uylNyh71NeBQ": {
    "date": "5/4/2016",
    "text": "good food, good location. we used to go to royal china across the street when one day we went there and it was being renovated. we saw this place across the street and went there instead. i have NEVER been back to royal china. this place has all the classics which are delicious, but are most famous for their lobster noodle which is especially delicious. definitely recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XNOcDXMxdmCH0g6T1uT4AA"
  },
  "m4E6968d2dDGHai3xpTz6A": {
    "date": "5/30/2015",
    "text": "I stayed a block away from this place when on a trip. I wasn't sure about it at first because it doesn't look like much from the outside, and it's on a pretty touristy street, but after looking up reviews we decided to give it a shot. Also, the place was packed on a Wednesday afternoon for lunch which was a great sign. We ordered hot and sour soup, which is a favorite of mine, and theirs did not disappoint. We also got two beef dishes, crispy fried, and some other sweet and tangy kind and both were delicious. My friend ordered an eel dish and loved her entree. Definitely a must if you are in the area. I could have ordered the whole menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CUC_epS783_2eyYtLXv4tw"
  },
  "_Ho__ejntgOXJnMC0j40iw": {
    "date": "4/24/2015",
    "text": "Excellent lobster noodles... Best I've ever had. Other cuisines are also delicious. Prices fairly reasonable and the attitude of waiters way better than Chinatown. So far my favourite Chinese restaurant in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RyP2Q15xJclR0_rizUXqIg"
  },
  "KCeer0OFt9A6jk9Hh-ADeg": {
    "date": "2/6/2010",
    "text": "I'm glad that my friends from Sin took me to Mandarin Kitchens for dinner and is my first visit to Chinese Seafood Restaurant. I strongly recommended the Lobster Noodles, is the biggest lobster i've had in London, very tasty and the sauce was perfect ! After that, we had Almond Fruit Curd and Red Bean Pancakes as a dessert.  The Red Bean Pancakes was just alright for me as i'm not a red bean fan. I love Almond Curd not too sweet just my taste.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "FKMd049FGU74cu28OipFpQ",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Lobster Noodles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FKMd049FGU74cu28OipFpQ/o.jpg"
      }
    ],
    "user_id": "fpnfqG_yVsST5itrc0-nlA"
  },
  "9alvbOKPEuVHJOAEXyukrw": {
    "date": "1/19/2014",
    "text": "Mmmmmmmmmmm. We came here and ordered an absolute feast! My favourite were the chilli prawns and squid and toffee apple and pancakes for dessert!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "hWq3nCnwHAKdlr93NTUQaQ": {
    "date": "7/11/2011",
    "text": "I was unfortunately very disappointed with the restaurant, regardless of the fact that the food on everyone else's table looked excellent!  All the dishes had that gooey, gelatinous texture that I absolutely can't stand.  The Chicken Friend Noodle was tiny ramen noodles, half of which were fried, the other half were undercooked, as was the chicken itself.  I had one bite of this dish and pushed it aside.  Gross.What is cool is how there is a while part of the menu for Lobster, Crab and Dover Sole, cooked in a variety of ways.  We had the Sole steamed in a garlic and spring onion sauce which we loved - very healthy and tasty while still keeping the full taste of the fish in tact.  Only thing is that when we asked what the dish was more exactly, it was descripbed completely differently - I guess I don't speak Chinese which is a downside here.I think this could be a good place, but the service is rude and the menu needs far more explanation.Maybe I'll be back, but probably not.  Too bad Royal China was closed last night.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "ylmjDSByX2QspinsUzHLzw": {
    "date": "8/14/2012",
    "text": "The 'Mandarin Kitchen' is opposite my favourite Chinese restaurant in the area, 'Royal China'.I think BOTH are among the best in London and easily surpass the many others in Queensway.The Seafood is the reason to go here instead of 'Royal China' in my opinion. I have had lobster on a number of occasions and have always been impressed.The service is good, the ambience is generally busy. If you are in the area and are in the mood for chinese seafood this is a great option.HIGHLY RECOMMENDED!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7pJgfg5g5q3R4IHf_dqlw"
  },
  "b6ysTPAJ3bLDlFPy40mJfQ": {
    "date": "1/22/2012",
    "text": "I'd like to echo the praises for the lobster noodles. Just really delicious. We also had one of the beancurd dishes (forget which one), the kai-lan, the red snapper with ginger and the Cantonese fried roasted chicken, all of which were very good. The beancurd in particular was great, very silky. The portions are fairly substantial, don't let your eyes get too greedy, which was our mistake. We all had to waddle out the door by the time we were through.We went there for a dinner the weekend of Chinese New Year and just be warned that for busy nights like that their reservations will only be for an hour and a half. Not that the staff were hovering and being very strict about the time limit by any means but just something to keep in mind.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYMJ7duJTByjSfjuNhLQ7g"
  },
  "nfyHI5Sf1jDeBsPOZ-HDjw": {
    "date": "5/5/2010",
    "text": "The best Chinese seafood in London. Which isn't that grand a claim, since there's not much competition. The lobster noodles are probably the best thing on offer here, though recently it seems they're using less ginger. This upsets me. You literally cannot have enough ginger in any dish involving either noodles or lobster. With a dish consisting entirely of noodles and lobster it would take the entire ginger output of a small nation to reach the optimal amount in my eyes, so possibly take this advice with a pinch of salt.The small scallops are masterful, the larger scallops less so but worth eating if they're claiming to have run out of the wee ones. They haven't, they're just hoarding them for the staff to eat when the place closes. I'M ONTO THEM.The drunken chicken is also worth a mention.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "kK7nWVah2ozvorxwlKxj7w"
  },
  "V12M5kh4pbGc_4q5Sxp1lQ": {
    "date": "7/21/2009",
    "text": "Enter a realm of superior seafood, where lobster and other shellfish of exquisite freshness and expert preparation will boldly take you to worlds where no humans have gone before!After 4+ miles of fun-filled sightseeing and urban hiking from the London Eye, we were so glad to see our destination: dinner!  We love seafood and were like sweet-toothed kids in Willy Wonka's Chocolate Factory!  The heavenly and varied selection of crustaceans, bivalves, mollusks (sea cucumber, abalone), and fish made us uncharacteristically indecisive--but in a good way.Our server recommended the lobster, and after seeing a neighboring couple savor it, we were sold!  Normally, we enjoy our seafood as pure and simple as possible, so we were considering to have it raw or just steamed.  Our server seemed a bit more than suggestive in getting us to order it with ginger, scallion, and noodles--a popular choice--which we were really glad we did :-DTo start, we had Phoenix Prawns with Chili and Scallions.  At first, it was a sight to behold: each prawn was BIGGER than most lobster tails!  The accompanying sauce appeared to be strong, but served to complement the incredibly flavorful crustacean.Then, the lobster arrived and we were stunned by how incredibly flavorful it was: totally superior, cleaner, and more succulent than any of its Maine relatives served at $$$$+ restaurants!The ginger and scallions complemented the meat incredibly well, and the noodles were just perfect texture and seasoning as a complementary component for the star crustacean.Not only could you taste the pristine freshness, it was clearly visible as the meat was plump in every crevice right down to the tiny swimmerets.  Another point that stuck was how easy it was to extract the meat from the shells.When we asked our server how the lobster was so tasty and so fresh, he pointed out that they get them straight from the Scottish Sea and the chef is an expert in carving up the lobster so that all of the pieces cook perfectly and the patrons have an easy time eating their meal.By that time, we were quite satisfied but curious to try dessert.  Since our server was perfect so far, we asked him to select our dessert: a hearty and palate balancing red bean pancake.All in all, this was a seafoodie's dream.  I understand how the service can be perceived as brusque to efficient (the bus persons are a bit blunt), but showing an earnest interest in the restaurant and having a great server made for a wonderful evening of food and service.When we stayed in London, the currency exchange rate was far more disadvantageous for Americans--everything seemed to cost double.  The exceptions to the rule were with Starbucks (everything was half the quids as supposed dollars, and their sandwiches were amazing!) and Mandarin Kitchen, which proved to be a relative value for such a memorable experience (~47 quid for 3 amazing courses).I just wish I could teleport to Mandarin Kitchen every now and then :-P",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "u6Yp3GybflRBDnR2FYJLXw"
  },
  "VOuThM23m-wJ3o1F8KIEGw": {
    "date": "2/22/2010",
    "text": "One thing I missed about London: the lobster noodle from this place! Generous portion of lobster, and its meat is juicy and fresh.I have been to many places in the US,UK, Hong Kong, China, yet have never tasted anything better than their lobster noodle and this is not an exaggeration.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fJQXqs7fHezPi9pebVc9sg"
  },
  "qgB9gacfSTBcGnrDzalJdg": {
    "date": "1/22/2009",
    "text": "By the end of my three week trip to Europe I actually had a yearning for Chinese food. The only other Chinese meal I had in the previous three weeks was at Crispy Duck on my second night in London. So here I was back in London on my final night, and my cousin suggested Mandarin Kitchens. I was told that Mandarin Kitchens is one of the higher end Chinese restuarants in London with its white tablecloths. I soon found out they charge pretty high end as well. For our party of three we had a Fish Soup, Steamed Seabass, and Lobster Noodles. The soup was flavorful yet pretty standard, the steamed seabass was good, and you'd be hard pressed to screw up a dish that's laced with a whole lobster. While I know we may have ordered some of the higher price items on the menu, I never would have thought three items would cost 65 bucks. Oh waaaait, it was 65 quid. And back then that equated to $130. So there ya go, $130 for a three item meal for three.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "d-5gWThyELEJZdFKUx5Pzg"
  },
  "Yuj7m8zLtFBvQquAEP46fw": {
    "date": "3/8/2010",
    "text": "Full post and photos @ thecattylife.com  Our mission for the night: lobster noodle. But we first indulged in some traditional starters (which do not frequent my little Chinese palate nearly as often as I would like): jellyfish with cucumber (and a not-too-heavy sprinkling of sesame oil), sliced pork knuckle, and deep fried baby squid in garlic & chilli (incredibly tender, in a light and peppery batter). The starters were followed by another recommended dish: shredded duck with hoisin sauce, cucumber and shallots, wrapped in a light floury pancake. The duck  moist, crispy, very fresh  was tasty but at this point I was a bit like, dude, lobster. I came for lobster! My vibes must have sent a little pin-prick pulse straight into the waitress's behind because suddenly there she was and lo' and behold because we love food, because we're greedy, and most of all because it was lobster, we ordered twice as much as any normal person would  two enormous lobsters to be shared between the five of us, atop a five tonne plate of egg noodles. Ok not five tonnes, but definitely two big red lobsters. Nom nom nom! Having been presented with plates of lobster-heaven, our conversation hit an abrupt stop as we all literally threw our faces into the goodness. What can I say? The lobsters were big, meaty, soft, sweet and with roe ~ quite simply orgasmic ~ and the perfectly cooked noodles were coated in a not-too-sticky gravy containing a good hearty decent amount of shallots. Because here at the catty life there is no such thing as too much shallots. Two lobsters really hit the spot. We toyed with the idea of fighting over da-bao (take-out) if we couldn't finish, but really, who are we kidding here? Lock, stock, barrel and all of the gravy, inhaled within five solid minutes of gastro-induced conversation strike. It really wasn't like there was anything in this world that could have followed up the amazing lobster meal, but the troopers that we are, we gave it a go. On the dessert menu was red bean pancakes (fresh, crispy edges and packed full of red bean paste), toffee banana (too cute as individual banana balls) and almond jelly (great solid texture, not the soft crumbly stuff) but what impressed me most of all was the complimentary fruit platter which was OMG not just oranges, but a pseudo fruit salad of strawberries, kiwi fruit, melon, pineapple and well, oranges. Big thumbs up to Mandarin Kitchen!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6E5NwtFPhKS9zQAlKUnM5w": {
    "date": "1/9/2009",
    "text": "Delicious seafood, fresh soups, and perfectly cooked noodles are just a few of the pros about Mandarin Kitchen.  The service is quick and efficient, but seems to be more of a team effort and it can become difficult to know exactly which one of the employees is your server.  I feel like we had 10 different people bringing things to the table and such.  A good meal very close to the tube station.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1gO_eI8Jh_FDvnCvJDRYg"
  },
  "fqO3-9ngow1_hlgyRJK5Jg": {
    "date": "1/13/2013",
    "text": "Very very Disappointing. Got prawn noodles. Totally bland. I mean, honestly. Is this really the best Chinese in London? How sad. I'm a former new yorker, now living in zurich, and recently returned from Beijing. This is among the blandest Chinese I've ever eaten.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lDuNTlLNfxiRUr-7Sdp2g"
  },
  "jqBdZcQUI2sLt_smnxwCRg": {
    "date": "11/1/2007",
    "text": "This is a specialist seafood restaurant with an extensive menu and good value for money. The restaurant is decorated very simply but the atmosphere (evening-time) was buzzing. The main focus of the menu was the lobster, which was offered in a variety of ways, such as cooked with ginger and chilli, or you can even request for any sauce. The other shellfish on offer was also extremely tasty and the food was all imbeccably presented and some of the dishes looked like works of art. The prices may seem a little higher than the other Chinese restaurants in Queensway, but it is good value for money as the food is perfectly cooked and there are so many new things to try. This restaurant is perfect for a get-together with friends, or even for a business lunch/dinner as the food is perfect for ordering big amounts and sharing between everyone.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ceBhARbGCT_57yrBpzxXCQ": {
    "date": "6/20/2012",
    "text": "This place is famous for their Lobster Noodles.  It's just really delicious. A must try!  Their scallops aren't too bad neither.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyyXISpOlSDIfmYIa4NCdQ"
  },
  "roCKe9GP0ACYAVAAdRqtpg": {
    "date": "2/8/2011",
    "text": "Unfortunately I did not have the lobster noodles as I just stumbled onto this place when my girlfriend was dragging me, severely hung over down queensway.  I would not recommend the bloody mary, because it was just tomato juice, and a splash of vodka for ten quid.  The shrimp starter was delicious, and I washed them down with two tiger beers.  the roast duck was waaaay fatty.  Fattier than any chinese roasted duck should be.  It's a classy place and all, but chinese food in the UK is junk food, and should never cost the same amount a meal at a fine french restaurant might.  I would stop by just to try the lobster noodles, maybe, I don't know, we might, we'll see.  There's so much more down queensway that...nah I probably won't, weeeellll, maybe, people seem pretty keen on them.  Yeah, I probably will the next time I stay over by the park.  But I'll tell you one thing:  I won't be ordering a bloody mary!  harumph!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vj4kIp8SR4Kn5AdTt8B69Q"
  },
  "5lz5B6Mzken6RIl-pnUf0Q": {
    "date": "1/15/2008",
    "text": "This place is hopping any day of the week - and with good reason! The menu contains Chinese staples and a great selection of seafood that will tempt even the most discerning and adventurous of Chinese food lovers. The lobster noodles are divine and worth the journey to Queensway. The decor is minimalist, but you hardly notice your surroundings when confronted by one colourful and delicious dish after another. The service is excellent, though hurried.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TifqLt_GWjsrUZXeRRhYqQ": {
    "date": "5/25/2018",
    "text": "I have to thank author Kevin Kwan for getting me to this place, because I literally was reading the sequel to Crazy Rich Asians on my flight the day before - and that's where I first heard of Mandarin Kitchen. In the book, the lobster noodles here are described as one of the \"trifecta\" of Chinese restaurants in London (the others being roast duck from Four Seasons and...I forget the last one, whoops). So we walked to the restaurant and I already knew what we were getting - we also ordered a salt and pepper chicken wing appetizer just to add to the meal. The lobster tasted SO good (I'd say fresh, but I'm not a seafood expert so not sure if that's the right term; the noodles were fine but the lobster really made the dish). They serve it in front of you and give you a pick, as well as plates for the shells and lemon water (I hope for washing your hands, because that's what I used it for...) The chicken wings were also delicious - perfect amount of crunchiness and a great contrast to the tossed noodles. If you're looking through the menu and can't find lobster noodles, that's because (I learned from the receipt) it's actually the lobster with ginger / scallion + noodles. One star off because the serving staff made me feel somewhat intimidated (not sure if I was projecting after reading a book about rich Asians frequenting the restaurant) - I was actually kind of scared to ask what the lemon water was for and just copied another table. Awesome food though!",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "bqRY3Gl1PpRyghkv06MSPA",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bqRY3Gl1PpRyghkv06MSPA/o.jpg"
      },
      {
        "img_id": "V55GMaHXi0bCpZmHQbpq0g",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V55GMaHXi0bCpZmHQbpq0g/o.jpg"
      }
    ],
    "user_id": "Z6UZvxZDgDsFn-f54QDzpQ"
  },
  "GPwHDhhtL-XRWiwiMu6vOA": {
    "date": "11/6/2018",
    "text": "One of my favourite restaurants in Queensway. The lobsters in noodles is delicious, along with the family favourites such as roast/crispy pork. Not the cheapest but certainly worth it. Good service but I recommended booking ahead as it gets busy! My go to place when catching up with friends!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gp5osOxsjWK7lhUAY40msg"
  },
  "WG6RueTgDP-Ee3No-tvJcg": {
    "date": "9/14/2018",
    "text": "Tried to dine here on our first night in London after seeing reviews. Went in around 5:30 and were immediately asked if we had booked a table. We said no and the gentleman began looking at his res list. I pointed out to him that there was ONE table seated, and no reservations for about 1-1.5 hours. I mentioned we didn't take that long to eat! Again he slowly looks at list. So slowly. I said to the man, never mind we will go somewhere else.  Gee, I hope all those reservations showed up. We went a few doors down and had AMAZING Chinese food and service from the entire staff!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zApC24TWfsTfAs8FEZzH8w"
  },
  "v2kKOBoILhGSzTfSY7ij9g": {
    "date": "9/11/2018",
    "text": "It didn't look much from outside.  But the inside was quite nice.  The food was great.  I especially liked the jellyfish and smoked chicken.  It was refreshing and tasty.  The asparagus with mixed seafood in XO sauce was lighter flavor.  But the hot pot eel in chili sauce was yummy.  The eel wasn't fishy and it was very flavorful.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SDromdQ48LC4qAYCkM-AEw",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Eel in chili sauce in a hot pot",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SDromdQ48LC4qAYCkM-AEw/o.jpg"
      },
      {
        "img_id": "xHDPqHCw3X3BKqAC6fXdfQ",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Asparagus with mixed seafood",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xHDPqHCw3X3BKqAC6fXdfQ/o.jpg"
      },
      {
        "img_id": "4iLMwVa_MtCmLNe9Zx6HIA",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Jellyfish with smoked chicken.  Comes two pieces",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4iLMwVa_MtCmLNe9Zx6HIA/o.jpg"
      }
    ],
    "user_id": "_ELaxdbRJVFOGSgXPq8JTA"
  },
  "ERIb8sExwRfV42guBo1Y0A": {
    "date": "8/31/2017",
    "text": "I went for dinner with friends and had a fab time. We ordered crispy duck, lobster noodles, mafo tofu and string beans. Everything was solid and flavourful, with my favourites being the lobster noodles and string beans. Whilst the crispy duck was great, it wasn't too different from other roast or pecking duck I had had. Mafo tofu was good too, but not spicy or strongly flavoured as I would have liked. Service was okay, but when it got busy, we found it very difficult to get anyone's attention. Otherwise, interactions with staff were very limited (not surprising for a Chinese restaurant). Ambience was spacious and clean, but nothing fancy or sophisticated. Great to have a casual meal or even celebrate an occasion, but don't expect anything too decorative.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "yPaNyewl6Km-aGsxo1PEhQ",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yPaNyewl6Km-aGsxo1PEhQ/o.jpg"
      }
    ],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "QBCUchVKFOcPm8Q7yT7Yng": {
    "date": "8/11/2018",
    "text": "Visited here with 4 more colleagues Saturday evening. Ordered Beijing duck, lobster on the rice, and so many. Those two signatures were excellent, brilliant and impressive. I would love to come back again soon.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HgrrrmeFe7BZD2PukH7Zmg",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HgrrrmeFe7BZD2PukH7Zmg/o.jpg"
      },
      {
        "img_id": "RAPZBXQ3jBgj7ce8Ru0sew",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RAPZBXQ3jBgj7ce8Ru0sew/o.jpg"
      }
    ],
    "user_id": "OGMgJ3P6-5UHT1jHrFArdQ"
  },
  "HItKq_O-jNnfsDU5jpLBxg": {
    "date": "3/23/2018",
    "text": "The food was on par with this establishment's overall rating, but wow: I've never felt invisible like this.  The wait staff simply exhibited zero interest in selling me anything after my initial order.  They appear to be efficient at moving food from kitchen to table, but it stops there.  Dining should be pleasurable, not a bland participation in food distribution.  Eye contact?   Not happening. There are too many other options in the neighborhood for me to return here.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPbKMXUxxceHJ8ktgJtk3A"
  },
  "2mhmKOiv6MvpfabJC3hFSQ": {
    "date": "7/11/2018",
    "text": "This is one of the worst Chinese restaurants I have ever been to! I have been told that this is English Chinese food, and if that is the case, English Chinese food is horrible! This place has ok service and nice, comfortable Ambience, which is the reason I gave it 2 stars instead of 1. The fried rice tasted off, and the chicken was not good! I do not recommend this place if you live in the United States and are not used to this kind of Chinese food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Csdh4gSc5AykRQKDwbPUOQ"
  },
  "dqWlpQsQXxkvOZNhUXwnPQ": {
    "date": "7/6/2018",
    "text": "Fantastic Chinese! If you love traditionally Chinese, go!!! We wandered in and will keep wandering in. Make a reservation if you are coming in the evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VL52SNzNF4sKsbU2J-uALA"
  },
  "c02cwvbr6c66idN3_9dOFw": {
    "date": "5/20/2017",
    "text": "Sometimes I do not want to write a long story as some would prefer to see what's delicious instead of knowing that I just arrived from Paris and was looking forward to seeing my friend from college and her husbad for dinner as they recommended this place. Lobster noods and the duck! Those were delicious. And, shark fin soup, too!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "zIvkDDPco0JMtKxnAIb2vw",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zIvkDDPco0JMtKxnAIb2vw/o.jpg"
      },
      {
        "img_id": "NYCMkc7MNgs8lomJav1ekQ",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Lobster noods.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NYCMkc7MNgs8lomJav1ekQ/o.jpg"
      }
    ],
    "user_id": "9y5NZGmt8fzE7AqEDuNhFg"
  },
  "DWtPwLyv6hIg1B1zhXkEhw": {
    "date": "9/26/2016",
    "text": "It was an amazing dinner. Not too formal but well organized and operated suitable for business occasion as well. Very high cost performance.Looking forward to visiting next time!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jd66F9BkbjH9YcUdr42GHA",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. Lobster noodle was amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jd66F9BkbjH9YcUdr42GHA/o.jpg"
      }
    ],
    "user_id": "kuj_7nE9tR9abdSu1NCNcg"
  },
  "QUWx_eLWF2W2Cn7DuAiOmQ": {
    "date": "2/7/2018",
    "text": "Great food, its wery tasty.The service personel is wery friendly and helpfull. Wery recomended",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Y-oN-jHc5ZxD-WlH3XORA"
  },
  "t6abjKKLjpQsVqDvk-hawA": {
    "date": "10/16/2016",
    "text": "Our group of 7 had a great meal, to celebrate my sis-in-law's birthday. We started with the aromatic duck, which required the server to slowly shred the flesh. Meat was moist and placed in a wrapper, with hoisin sauce, small slices of cucumber and scallions. The sauce was a bit sweet, and if you like it spicy, add some chilli sauce. Roll the wrapper, and enjoy. We followed up with their signature lobster noodle, which was superb. The lobster was fresh, and the noodle sauce was slot on. We then had a number of dishes - pork slices with chillies, chicken, mushroom and tofu, fried rice. We would highly recommend if you would like a great Chinese dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d3VIDOotfddzGqC6SuHqRQ",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. The shredded duck.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d3VIDOotfddzGqC6SuHqRQ/o.jpg"
      },
      {
        "img_id": "vjGreOae2pvR7I-EHl7Tnw",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom. The aromatic whole duck.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vjGreOae2pvR7I-EHl7Tnw/o.jpg"
      }
    ],
    "user_id": "ieSvkyHAR-evpUIeyVT-hA"
  },
  "wdh7Td0FMp6rS0y8gZYDTw": {
    "date": "6/13/2017",
    "text": "Went here for dinner last night after being yelled at by the rude waiter across the street at New Fortune Cookie.  We were greeted and seated promptly.  Our server was a young make and he was great.  We started out with the hot and sour shrimp soup.  Delicious!  Next we had the seafood lettuce wraps.  Delicious!  For our entrees,  we had the pork in chili, beef with Chinese broccoli and the chicken with soft noodles.  The pork in the chili was outstanding.  A nice spicy dish!  The beef and broccoli was really good also.  The noodles were a bit bland, but I added chili sauce and it really made the dish good.  Again  our server was great.  He was very personable and made good recommendations.  Will definitely be back when in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2yeX23ur10TihyCSx2cxw"
  },
  "EVkDyPJONVdFHG76L-NKHA": {
    "date": "7/4/2017",
    "text": "The Mandarin Kitchen falls victim to false advertising. The food advertised is not the food I received. The only upside for this establishment is the location.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zm3P2BeayM5PKrdgT80uw"
  },
  "_v4-dbjT0HCI63ivYLbY7A": {
    "date": "1/24/2016",
    "text": "The food is good ~~but wirhout good service~~go to The other restaurant is the same~~",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4iV-Ql5yfM4nE8hr58xnNA",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4iV-Ql5yfM4nE8hr58xnNA/o.jpg"
      },
      {
        "img_id": "_yjjAi1FJkjepxOL_4l9eA",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_yjjAi1FJkjepxOL_4l9eA/o.jpg"
      },
      {
        "img_id": "aJUwXVbKFRGFyped7fm84w",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aJUwXVbKFRGFyped7fm84w/o.jpg"
      }
    ],
    "user_id": "8mIEPnB9aiUPucPUQP-YcQ"
  },
  "HNr1P7qFLxCcJGowEXBwng": {
    "date": "5/13/2017",
    "text": "very bad service.i was told to wait for 45 mins. but was ignored. no service after 1 hours. no apology. very rude.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C6JSNhoeVwuYgFTrZnuqAw",
        "caption": "Photo of Mandarin Kitchen - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C6JSNhoeVwuYgFTrZnuqAw/o.jpg"
      }
    ],
    "user_id": "sY6HKIPD7Pyojr2INtDuKw"
  },
  "_xFZu5xeoXhXnh4coznSuQ": {
    "date": "5/22/2016",
    "text": "Good Chinese seafood restaurant. Service is also good. However, price is a little high.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rc3GbS19Sf_bEmRV4yWWng"
  },
  "O0WyoTiL3nMsoJWLt07ClA": {
    "date": "11/21/2014",
    "text": "I have been coming to this restaurant since 1994, this place is truly amazing the Lobster with noodles is to die for and the scallops are amazing.  Definitely worth the money.  I will definitely visit this place again when I am in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlIRI4PWY5uhOBdObYsscA"
  },
  "ccShj9G0loHb-5jDalwG7w": {
    "date": "8/18/2016",
    "text": "Another restaurant that has gone down. I used to go there quite a lot. The lobster noodles (signature dish) have become gelatinous. Service used to be efficient if not particularly friendly. Now waiters are a bunch of students who hang out there, trying to look cool. Result: 1h15 for lunch. Very disappointing.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zW_xejj0XrVX9aBCzeHxFg"
  }
}