{
  "rdrNclt1XUMGkCDnnfQOGg": {
    "date": "9/6/2011",
    "text": "The Dovetail, like its sister bar The Dove in hackney, is just fantastic. The food is interesting, delicious and not at all expensive. The Belgium beer menu reads like a book and the staff know all about the beer they serve, which is great cz. it means I can risk trying something different. Its a small hidden gemso don't tell everyone otherwise it will spoil it for those in the know!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3pi3xb9bbjV9wNZsdPrxKQ": {
    "date": "5/27/2011",
    "text": "Went in afterwork on a Friday, was completely packed. Pretty average place, good selection of beers but nothing to write home about.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IiwWfpJaTnOExaP8JdAQ5Q": {
    "date": "5/7/2008",
    "text": "Hidden away in a tiny ally at the back of Clerkenwell Green is this great little Belgian bar. Of the two menus the one with the beer in is the most impressive, far better than you would think possible with the size of the bar but test the staff if you dare; I've never managed to find anything out of stock. The food menu is what you would expect, the mussels are excellent and the other standard fare (sausage and mash, burgers) is above average. This pub pulls into 4 stars territory though when you compare it with its competition, it knocks Beirodrome and the like for six in almost every category. The only exception being if you are looking for a more lively venue with more space.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3qjjx48q6tYhUckNijwiSQ": {
    "date": "5/26/2011",
    "text": "friendly place only been a couple of times but always a good night out =) thanks guys.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "d511STntk93muP0uTv3f5g": {
    "date": "10/1/2010",
    "text": "This is a fabulous little bar. But I'm blaming them for my accidental hangover. It's one of the only times I've thought that alcohol percentages should be properly displayed. I had two or three drinks there earlier this week. Only little tiny beers. By the time we reached our next destination I was trollied. I can actually hold my beer better than most girly girls, so this was a bit of a shock. Until I discovered I was drinking an 8.5% beer and had no idea. Hehe! Fun though. And it's done nothing to quash my like of the place. It was busy, but cosy rather than rammed. The food was good (well, the chips were, we found ourselves looking longingly at the plates of mussels at the next table). A round is cheap, at £14 for four drinks. I like like like all of these things. Staff aren't hugely helpful because there's so many beers and so much choice. Asking for a beer is complicated, but they do have menus. Unfortunately beer menus aren't ever as comprehensive as wine menus and I could be ordering anything. Like an 8.5% beer. But I like it. It's a great little bar and I'm pleased I've tried a new venue in Clerkenwell. I'll be back here. I'll eat all of their food and get accidentally drunk and be accidentally hungover the next day. And I'll probably enjoy every single minute of it. Again. Yay.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xSbicNx_0pgtzyl4IeWwTA": {
    "date": "1/30/2013",
    "text": "Great wild boar burger!This was one of the best meals I had during a work trip to London!  The food I have in London was overall, underwhelming.  The fish and chips were excellent and you can find lots of good ones (I went with the yelp recommendations ^_-).  Indian food was average though sweet, even in Brick Lane... but then again I live by Edison, NJ which has such a highly concentrated population of Indians they know about it in Mumbai.The place is pretty much located in an alley but the beer was good and the staff friendly.  Couldn't ask for anything more!  Don't know about evenings but weekday lunchtime it was empty except for 1 table besides us.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SWp85hHlYoS_0URr_UfsCg"
  },
  "_SGJ3aDuu-SmeMbhIRAj1w": {
    "date": "1/29/2011",
    "text": "I went here for a quick lunch with a few work colleagues during a lunch break to celebrate an end of season before everyone went away on their xmas holidays. We got into the place where we'd booked a table as were a fair large group and seated at the back in this little conservatory add on, it was december and thus freezing however the thought of putting the heating on was not thought of until prompted. The place was empty apart from us so the staff clearly didn't have much to do, though getting their attention was possibly the hardest thing in the world. I was promised the burgers were great, so i decided on a buffalo burger the order for which was (agreeing with gibbon here) reluctantly taken and half an hour later my food arrived. The burger was fine, nothing wrong with it but nothing spectacular and ended up being pretty expensive for what it was. The place was ok, the staff could have been a bit more enthusiastic especially seeing as at the beginning we were the only people in the place! Don't think i'll be returning.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cuGDWqfQBXe3tjU6PGeCmg": {
    "date": "12/15/2011",
    "text": "I recently went to Dovetail for lunch two days in a row, and it's leapt to the top of my list of Clerkenwell lunch spots. For a tenner you can score a delicious bison burger and chips. Judging from the unusually benign expressions of my colleagues, sausages and moules are similarly well-crafted. Nestled in the charming Jerusalem passage, the place has a pleasantly independent feel, so you're sure to gain kudos if you take anyone there.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vL6heQTlr_y54IgvzGVD5Q"
  },
  "Podp2LIw59cz9mjDWEut-g": {
    "date": "11/22/2012",
    "text": "Lovely little pub/bar down a quaint alley in Clerkenwell. It has an excellent selection of beers, knowledgeable staff, delicious food. There was a good mix of people and a nice atmosphere. It got busier as the evening went on but we arrived just after six on a Wednesday and easily found a table.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jl_QpWks9qO6DZMd8iBpIw"
  },
  "IYvJJqGTXYm0IAd73AWqVw": {
    "date": "9/20/2011",
    "text": "Perfect idea of a pub, Belgian or otherwise.  Staff was brilliant.  Although I was a bit disappointed that they were out of my favorite beer, Hoegaarden, our waiter recommended an alternative white ale that complimented my moules frites perfectly.  My partner had a beef carponnade that he enjoyed as well.  The one thing that prevents me from giving the fifth star was a rather disappointing waffle dessert that was served cold.  I'm used to the warm Belgian waffles.  But that said, my partner liked his so to each his own.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qxiGACgVO_9R49R6DSUO0g"
  },
  "vNR_VAlHl2JTj826OOffZQ": {
    "date": "8/26/2013",
    "text": "my tastes are very simple. i love Belgian beer and i love sausages so this place is heaven.  they also have my 2 favorites beers St. Bernardus Abt 12 and Trappistes Rochefort 10.  London needs more bars like this promoting world class beer!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hocMbHWc5r3hIMcXaSNdYw"
  },
  "upaWKVUWVnaFYuNHZ5OQyA": {
    "date": "9/27/2009",
    "text": "Great selection of Belgian beers, though some are a little hard to see behind the counter and the 'beer menu' huge! Well worth asking the bar staff for a recommendation if you've not tried them before. Food was pretty good, though we didn't try the burgers. We visited on a Saturday evening and had no problem finding a table - the bar itself wasn't packed, but there were enough people here to create some atmosphere. There was a charge for using a debit card though, so well worth stopping at an ATM on the way there!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QXqYBacpcpiluvSVFWhW0w": {
    "date": "9/21/2009",
    "text": "One of my favourite bars. I love Belgian beer and the Dovetail has a very good range. The staff are ace! As well as a variety of draught beers they also do bottled Trappist beers, Kriek and other fruit beers, blondes, dunkels and the list goes on. Their food is also very nice. I'm not a fan of mussels but their burgers and chips are large and tasty.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lB2ncHNCQMTZenr9WujuFQ": {
    "date": "7/24/2009",
    "text": "Great beer - a massive selection of fine belgian ales like its sister pub the Dove. Not quite in the same class though unfortunately. The bar is little so you can't view the array of beers properly. It also lacks a little bit in decor, its sparse and a little cramped and the seating isn't the most comfortable in the world. Its still my flavour of the week every second Friday - check out the Three Kings if you're in the area and seeking an alternative.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jjPwnk5KFHkwMs8TdWrs1w"
  },
  "itEL3TC9zCuXsOfMyAiHsw": {
    "date": "12/2/2008",
    "text": "I went to a Pukklepop Festival in Belgium a couple of summers ago (it literally means Pop and Spot in Flemish 'cos it's a yoof festival and young people have spots, ya!). Anyway I went with my girlfriend and she loves belgian beer - Hoegaarden is her beer of choice, so she kind of tends to burp quite a lot in public. She's got a sweet tooth and developed a love for Belgian fruit beer while we were there which is why we ended up at the Dovetail. She calls it her local even though we live a good 25 minutes away. They sell all the fruit beers you could ever possibly want - mango, peach, cherry, apple - everything! Which is great if you like sort of thing. They also sell any belgian beer you could think of - I can't think of many. They do also sell cider which isn't very Belgian at all. I bought some chips there and they came in a glass  - that's apparently the Belgian way. You get a lot of \"city types\" because it's so close to the square mile but they're not too stuck up, I managed to a use only coppers to pay for a drink.So, go! There's not much seat space but loads of Belgian booze...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9p_cITa30ZvlxBltHWrpCQ"
  },
  "Czk7WqrXM_5oLJa1-nZatA": {
    "date": "12/11/2008",
    "text": "Aside from the burgers (which are excellent), the portions are quite lean. Don't bother with starters. Great beer, very noisy, friendly service. always worth booking ahead since it's rammed on week nights.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "nuu4kIFIsmN6vXtgOYvnVQ": {
    "date": "10/3/2007",
    "text": "The Dovetail Bar is a small Belgian bar near Farringdon Station. For people who like me, only like fruity beers, they serve krieks, frülis, and other beers made with bananas, chocolate or mangoes... They also serve food. If you like mussels and chips, Dovetail is the place to go to. An advice: If you want a place to sit, you have to come around 4 pm otherwise you will have to stand outside, which is not so bad either when the weather is good ;-)",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZLcrv95GXj9R2RBXFkynlA": {
    "date": "6/16/2008",
    "text": "There are so many awesome pubs in Clerkenwell; so, to say this is one of the best in the area is really saying a lot. They've got Fruli on tap, Kwak, a long list of krieks, lambics and all sorts of other specialist Belgian beers. If you don't know what Fruli, Kwak, krieks, or lambics are, Dovetail's a brilliant place for the uninitiated to sample some of the best brews that Belgium has to offer. For those in the know, this is probably the best pub in town for Belgian beer. And its dark cavernous setting and walls lined with Tin-Tin posters creates the right Belgian vibe for a night of drinking. The food's good too  and really hearty. The chips are gorgeous, and the burgers exceptionally tasty (and impossible to eat with just your hands).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "nhy_u2m4lxBxILW0TBVOGA": {
    "date": "11/15/2008",
    "text": "The Dovetail is one of my favourite bars to visit, namely because it's almost hidden away, and the fact that they serve a great selection of Belgian beers with their great food. During the day, the area at the back of the bar is fantastically lit up with a skylight, while during the week is often standing room only since all the tables get taken up. Being the sister pub to The Dove (on broadway market) they also serve amazing sets of food, or if you want something lighter, a decent selection of finger foods. The frites and mayo go down particularly well with a drinking audience. Sometimes they run out of the beers for the week, but with well over a hundred to choose from, you are sure to find something new and interesting to try.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cXsBYeo0dv0UMlWadR8eGw": {
    "date": "6/21/2008",
    "text": "Ah, this is a GREAT bar - one of my favourites. It has all the ingredients which make a bar great in my opinion. 1. The drinks - the Dovetail has an EXTENSIVE drinks menu - I'm getting thirsty just writing this. There must be ten pages of amazing belgian beers, from the fruit beers to the golden beers, from the wheat beers to the trappist and abbey ales they are all here! They're not ultra cheap, but they're not too expensive, and they pack a punch! 2. The food - there's a great selection of delicious, classic food, at low prices. Really nice belgian style chips, good chicken burger, it's all very nice. 3 The service - the barstaff are professional, knowledgeable, and nice. 4. The place itself - it's really nicely decorated, nice wooden tables, a few little alcoves, and a nice size - quite cosy. So basically, the dovetail is the bar to go to for belgian beer in london. It completely kicks Bierodrome's ass, and does it with style.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WlRP4_SadMUmPMsdw_Cy4w": {
    "date": "11/29/2008",
    "text": "A great bar. The range of beers is excellent (with a leather bound menu to select from.) The food is also very good and is served quickly. I like the fact the bar is hidden away - but even this doesn't stop the crowds from descending. Try to get in early if you want a table.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MneTg16R_rTqT5nkU9aNcg": {
    "date": "11/25/2008",
    "text": "The Dovetail is one of my favourite bars in London. I'm not a big drinker, but for those who are they have around 200 different varieties of beer. For me, the food is what makes the Dovetail so memorable. They have a lovely menu specialising in seafood, but they also have a lovely sausage and mash and Belgian burger section to the menu. The burgers are traditional Flemish burgers and are particularly delicious - the highlight being the wild boar burger. Unfortunately they have recently changed the relish they offer which isn't as good as it was before, but that aside this is one of the best places in London to eat. Don't leave without trying a pint of fries, which is their delicious home made chips served in a pint glass. The Dovetail is easy to miss, which is one of the reasons why it is such a nice little place. It's hidden away in a dark passage in Clerkenwell, but it's worth seeking out. It has a very rustic feel to it - it's almost like you're eating in an old dark cellar - albeit one that has been immaculately decorated with a tiled floor and pictures of Tintin adorning the walls. Not only does this place serve great food and drink, but it has character and personality. It's a true hidden gem. I'd avoid on a Friday night though as it's full of the Clerkenwell crowd just out of work, and there's nowhere to stand, let alone sit. Go at a lunchtime, an evening early in the week, or at a weekend and you'll be richly rewarded with great food, friendly staff and a truly memorable experience.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RT1zdLrOJbtDAidYXRWL5w": {
    "date": "3/29/2010",
    "text": "We hit a list of very good pubs in London and this was a cut above the rest. Beer selection was outstanding and the food was such a surprise. Had the Fisherman's pie (mash potatoes, prawns and halibut  mixed together) and it blew me away. I searched for something like this and it delivered. Enjoy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNj7YnJW5vjWwQvCJZ9kAQ"
  },
  "y_cex9MKJhQJBy13bQrXUA": {
    "date": "7/11/2010",
    "text": "This gibbon is averse to excess grease. Therefore I was offended by the food put in front of me here. It was swimming in the stuff. A food order had been reluctantly taken, then slowly delivered. When it arrived I feared heart attack. But, as a Hungry Gibbon, I ate it anyway. The Belgian beers are nice if you're a time traveller from the 1990s and still think beers from the continent are exotic.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pyusHjB0vzSzglj6qsic1Q": {
    "date": "12/5/2011",
    "text": "The Dovetail may be my idea of heaven.  In fact, I'm a little peeved that this little slice of heaven sits about 6,000 miles away from where I actually live.  Heaven can wait, I suppose.We hit the 'tail on a Friday evening at about 6:00pm.  One hour later, the place was almost completely full, and we were already slurring our speech from the fine Belgian ale.  (Say no to the Belges Brune, say yes to the Straffe Hendrik!)  At that point, it was clear we were going to eat our dinner here either in liquid form or with a fork and knife.  We ultimately opted for both.I had the moules frites, a colleague had the fish and chips, and yet another colleague had some kind of a sausage affair.  I can't vouch for the others, but I loved my moules (better even than the moules I had two days previously in Belgium itself).We were a besotted mess by the time we left, but it was a five-star experience, through and through.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Qd5GyT45vcCydR2mM9dcmg"
  },
  "BJHRF81H4yF_WlzCmma_jg": {
    "date": "12/3/2011",
    "text": "Belgian beer is evil!! Ok, it's not but it is potent and gets me all squiffy very quickly.Popped in with some lovely Yelp colleagues for a couple of after work bevvies. Was quite happily supping my wine and watching the fellas get all bleary eyed on 11% Belgian beer and then had my arm twisted by 'he who shall not be named' (not Voldermort of course, just a naughty beer-monster) to try some of their 8% brew.In all fairness I am not a beer drinker but this was some tasty stuff! I had a couple. Kind of fizzy and with less of a bitter taste. The remainder of the evening is slightly blurry but I know beyond all doubt that I had a great time. We all did!The Dovetail is a gorgeous little pub tucked away down an alley. It was pouring down outside and The Dovetail was a warm, cosy den from the miserable November rain. We didn't manage to snag a table but it wasn't so packed that we were too much in the way, standing by the bar.The staff were so friendly and everyone in the bar seemed happy...or maybe it was just the euphoric beer-glow that left me feeling that way.I'll definitely be popping back to The Dovetail soon, most probably with the same crowd, as despite the yucky tired hangover the day after, I know we'd still do it all again in a heartbeat. Nothing like a bit of office bonding!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Vic2v-GTODbFpxq3-2iTqQ",
        "caption": "Photo of The Dovetail - London, United Kingdom. Bison burger with spicy tomato relish.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Vic2v-GTODbFpxq3-2iTqQ/o.jpg"
      }
    ],
    "user_id": "mvTskNQt0CMx8oTH1ku7-w"
  },
  "1c7mCKyLNp1FqgQyxGjaWQ": {
    "date": "5/1/2015",
    "text": "I came here on a Friday after work and it was jam packed but the beer selection is awesome and offers something different to the usual pub. Also they have great Tin Tin posters on the wall",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bd9630GE1c42zNRq7Q8GAg"
  },
  "1KkO8EEssImpJfMem2XGzA": {
    "date": "2/24/2015",
    "text": "I really, really like the Dovetail. Partly because they have great Belgian beer selection, but mostly because their food is really scrumptious (and not even \"for a pub\"). Although it can be quite busy Thursday/Friday, it's worth a visit any day of the week. My recommendations food-wise include the spicy wild boar and chorizo burger (yuuuuuuummmy) and the kilo pot of mussels. I invite people to visit me, specifically so that I can peer pressure them in to ordering both of those things and sharing between us. I've had both fondue dishes, and they're great...but the burger/mussels combo is so good I'll still take those any day of the week. Scrumptious (have I said that already?) and awesome!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blE5H2ulkYpOTR4qcOoC4g"
  },
  "ePPWH4-oDsfoR6Lm-1o3Vg": {
    "date": "9/7/2013",
    "text": "Four stars for the drinks & service, a definite 2.5 stars for the food.Not that the food is bad. It's good. Or, it should be. Sourdough buns. Boar and/or Bison burgers, both done properly and well. Beef stew that's basically gravy with beef wodges simmered in it until it's falling apart. All good. Chips: indifferent. Seriously, people. Belgians are serious about their chips. And mayonnaise. And bread. And other things. just... just stop letting yourself down. Beers & service: fabulous. Bloody expensive, but, eh, nice work if you can get it, and a fabulous selection, including the lucky dip -- for the adventerous. Definitely go here. Just mind what you order. I want to give this place five stars, and I also am tempted to give it three. Sort the bloody food out.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "QJWCG2rlMPet_n8yL6715w": {
    "date": "7/22/2015",
    "text": "Everything here is so delicious! I had an amazing baked Camembert and wild boar sausage which was the perfect thing to pair with a crisp Belgian beer. I'm usually not a huge beer lover but Belgian wheats are an exception. Loved all the fruit beer options as well for the summer months. Cute little bar right off clerkenwell with a little bit of outdoor seating; can't wait to make this place a regular haunt.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAGi7lXY4HsqfRKpuRPzPQ"
  },
  "P8kBity9ZdI0ZKUSbcIYxQ": {
    "date": "3/19/2013",
    "text": "GREAT Place! What?!?! A Belgian beer bar in London, YES! Fantastic selection of beer and the owner was nice enough to stop and chat with us despite the night coming to an end. We ordered fish & chips, the traditional burger, and steak sandwich. I was excited to try the chocolate fondue dessert, but alas we forgot to order before the kitchen closed. No worries, that just gives us an excuse to revisit the Dovetail. All in all, this is a great place. Nothing pretentious about it but at the same time the atmosphere is cozy. Pair that with good food and a great beer selection and I love love this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cfaBCSAtecfv-oBvOfeUdw"
  },
  "Ru_FsGVgKi6sZ1fdsUtN0w": {
    "date": "10/16/2012",
    "text": "The Dovetail boasts an excellent range of Belgian beer, cosy interior, faithfully Belgian food, plenty of Belgian memorabilia but also a few quirks that stop it from attaining 5 star status.The beer range is impressive. Probably not quite up to Belgo's, but a very good effort, rather pleasingly including the likes of Delerium next to the usuals (e.g. Kwak, Duvel, Floris, Leffe, Tripel Karmaleit). On other hand, and unlike the tip-top of craft beer places (e.g. the Craft Beer Company bars) there's no guide to the beers in the beer menu, simply the names and prices, so you're effectively buying blind.The food is decent: tasty, authentically Belgian and good value. It'd be better if the waffles were made on the spot though rather than bought in and heated up.And the interior is cosy: candles, framed posters of Tintin covers and other mock-ups of Belgian beers to set the mood. The friendly and quick service rounds everything off.I can see why this is such a Yelp favourite!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "SBLENVByGAnzrC0g3LpgkA": {
    "date": "6/12/2012",
    "text": "It's a great little bar in a quiet location in a lovely part of the city.The range of bottled beers is great with a few regulars on tap.Go there with a appetite and have a bison burger with spicy relish. Wash it down with a Palm or Chrystal and you'll be a happy customer for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zMFceTTVMZ-A0TmPYEBldw"
  },
  "0WCnyyi9kUUAR5KGB3Hbvg": {
    "date": "12/15/2011",
    "text": "Within the span of ten or fifteen minutes (which is roughly the length of time I had to wait to obtain a drink at the bar), I witnessed the following: - one bartender shattered a beer glass- another bartender knocked a widget off one of the taps- a third bartender standing around looking bemused... while a growing queue of thirsty patrons waited for the staff to get themselves sorted.----All that said, you might be wondering why the better-than-just-okay star rating, right? Well, there are a couple of factors involved. In no particular order...- After staking out a 'reserved' table for an hour or two, we were allowed to stay for dinner because whoever reserved it decided to no-show. Their loss.- A bottle of Straffe Hendrik doesn't cost £15 (or whatever obscene price that Craft Beer Co. is charging for a pint of the same thing).- The servers are genuinely spunky and fun. I can forgive some butterfingers action and some glazed stares if you make me laugh and have a ready smile. Being cute doesn't hurt.- The fish 'n' chips are legitimately respectable. We're not talking about the same delightfulness you can score in Edinburgh, but hey... not all kitchens can be Scottish.NB: The above experience is a recollection (however fuzzy) of events after -literally- imbibing to the point where we were told they were utterly out of stock of the beer we were enjoying.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "RmXIjppHNtVveguN10iO1g"
  },
  "wv-HA5DQkl3Ps41cE9BMfQ": {
    "date": "3/19/2012",
    "text": "The Dovetail is the Devil, it draws you in off the street, feeds off your weakness for Belgian beer, plays to the suppressed need to forget the day at work and turns you inside out within an hour of crossing the threshold.Go in there for 'a drink' at your peril, those 11 percenters will get the better of you, make no mistake about it, and you will wake up a day later and suffer flashbacks from hell of the night before of you trying to get dinner and being turned away from every establishment as you fail the sobriety test by walking head first into the glass front door.I love Belgian beer, but I hate the Dovetail like I hate Cadbury's chocolate fingers: I always want them but I know I can't just have one, I have to gorge myself and that just leads to an upset stomach and feeling of self-loathing.To this day, I have still not learned my lesson...My name is Elliot, and I'm a Dovetaholic",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "7X08OrpWTjSuUJvPCBJPJQ"
  },
  "m3DPWVrcTM1GvTf55IiHsg": {
    "date": "12/24/2011",
    "text": "On tap Delirium, what more did you want? Actually, just on tap ERRTHANG. Having had my appetite whetted after being rejected from the Dovetail on a prior occasion due to overcrowded-ness, I forced a friend to come here at an obscenely early hour for dinner and was extremely pleased with the results.My friend had the boar sausage (SO GOOD SO GOOD) and I had the moules frites (also delicious). After washing it all down with some Belgian beer, I was ready to negotiate a standing reservation. It was kind of amusing as everyone else at the restaurant seemed to be on a date but I guess during quieter times, this would make for a great date place. Better make a reservation to be safe!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "I-HRQskIplOJlFLlN3eE9A"
  },
  "ks0Z1KiQAdO-wYXwbRrllw": {
    "date": "1/20/2012",
    "text": "The Dovetail, oh how I love thee, let me count the ways!In my experience of drinking (and I'm not a spring chicken anymore) there are few places / drinks that I can say get me wasted in so few drinks. A heavyweight drinker I am not, but I think that slurring your words within an hour of being in a pub, is a bad sign.I 'thought' I was pretty hardcore after drinking my first blonde Belgian beauty, was feeling reasonable okay, 'I can handle this stuff, not sure what all the fuss is about.' Pahh, unbeknown to me I was slowly but surely unravelling, I just didn't know it!After my second glass of light coloured beer, I was feeling pretty good, however everything inside me said 'go home, go home!' Of course I didn't listen, and there I was half cut writing this review at 23:30 on the Victoria line home. Sad, but very true!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Pyha-8xF-Bfx27lPT1yofA"
  },
  "mb9GbNZy4aJidjh1V338FQ": {
    "date": "2/10/2011",
    "text": "Yummm, moules frites!  I'm not a big beer drinker, but if I were, this is the place I'd hit regularly.  It's a casual place in a small alley with over 100 beers to choose from.  With a very knowledgeable staff, this place is more impressive than most pubs in London.  The main downside is that it isn't a pub.  As a restaurant, I'd say the food is okay, but Belgium food isn't really my deal, however, if I were to eat a venison burger, this might be the place and they source their meat from sustainable, traceable farmers.  A group of 4 of us shared the fondue starter -- not a hit.  The cheese wasn't creamy or thick enough and there wasn't enough food to be dipped so we had to ask for bread to soup up the rest of the fondue.The mussels were a hit though and come in both traditionally and tomato style.  My friend had the veggie burger and it was YUMMY, but don't burger normally come on a bun instead of cibatta?  Anyway, good none the less.This place has no frills, but the beer selection is what will bring me back here any day of the week ... or at least when my dad is in town as he's the only person I know who loves his brews so much that we'd travel across town for it.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "eLWjynu1SVZcw8ZCWMmCgw": {
    "date": "2/25/2011",
    "text": "So the issue with reviewing a date venue is that your date might actually read it. So I say this; this is a review of the pub not you fella!I'm a fan of the Dove on Broadway Market. It's an extension of my house, being that it's just opposite and the fact that everyone is a 'jolly nice chap' in there. It's pretty similar here, just further away from my doorstep. I came on a quite Saturday early evening to find a lovely pub hidden down a side street that serves up a wonderful selection of beers. This might think this seems a stupid thing to say if you know me well, as you'll also know that I don't drink beer, full stop. I do however enjoy a refreshing cider - The Dovetail has a selection of three rather lovely ciders.This place does get busy, as the night went on groups of friends and families thrust themselves around the large tables with buggies full of babies in tow.I came here and I drank. I didn't eat, although the food at the other tables did look wonderful. I'll be back.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "tIeJX3E9DH5XTrd8U968ug": {
    "date": "10/19/2013",
    "text": "Not bad at all. Superb selection. Have yet to try to food here.Price is definitely not cheap. Came here with my co-workers and the boss expensed everything. Probably wouldn't come here on my own dime. But, when drinking what amounts to the best beer in the world (i.e Belgian monk-made ales), prices like these should be expected.Just a warning for the Belgian ale newbies -- do not, I repeat, DO NOT drink Belgian beer as though you were drinking a regular pint. Belgian beer alcohol percentage ranges from 8-12%. Treat this drinking experience as though you're drinking wine. Drink slowly, savor the flavor, and keep it down to 2-3 max -- unless you want to end up like me. Praying to the porcelian gods the next day at work.Otherwise, it's a good ol time",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CtgqXBzYCK0XJE9_EUDdVg"
  },
  "QSEZ1M9-jflUtAfQ0Hxtow": {
    "date": "8/22/2010",
    "text": "Yesterday I had a craving for moules frites that demanded satisfaction.  When I told my husband it was necessary for that to be my dinner, he suggested The Dovetail.  A short walk later, we found ourselves standing at the bar, menus in hand.  I asked the bartender if they were still serving food and he responded, \"Yes, although we are out of mussels.\"  A dagger in my heart!  I would have left right then and there if I wasn't such a lover of Belgian beers.  I consoled my stomach with a bottle of Leffe Radieuse and turn turned my attention back to food.   I decided on the boar burger and, although it was not the moule-y goodness I desired, it was delicious.  The patty was massive and served on a focaccia roll with lettuce, tomatoes and a spicy tomato relish.  The side of chips were crispy, although much thicker than the frites I was expecting, and I indulgently dunked them in mayo before every bite.  My husband went for the fish and chips.  The Leffe Blond battered cod loin was very bland and we both agreed I had the winning meal.  The bowl of minted mushy peas were quickly rejected from the plate and the fresh tartare was so lacking in taste that my husband ate all of it.  He usually hates tartare sauce.  In conclusion, the staff were friendly and offer more Belgian beer than any other place I've seen in London.  My burger rocked, but the fish and chips were disappointing and how does a Belgian restaurant run out of mussels by 4pm on a Saturday?  I want to give this place four stars because it feels so comfortable and welcoming, but I just can't.  Maybe when I return for moules frites I can award that extra star.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "WUL2i9eyzwYG-NBXFE6kjw": {
    "date": "1/4/2011",
    "text": "I am delighted to have found this Belgian bar, tucked away in Clerkenwell. The place looks really cool and that's before you even come on to the drinks. The drinks list is so extensive. There are dark beers, light beers, fruity beers, sour beers. I could go on for a while. They boast over 101 types. Most of these will be in bottle but they have some beers on tap (such as the dangerous but lovely 'kwak'). These are a bit too expensive to want to drink here too often, but they are no higher than you would expect, given the specialist nature of the venue. Food looks quite good too. More than I would normally spend, but again it isn't exactly normal fare. You can get the classic moules frites if that kind of thing is to your taste. Personally I had one moule, once a long time agoand you will thank me for not describing the aftermath.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "c_rVdwX6lHFafyaO_9JNNg": {
    "date": "8/24/2013",
    "text": "Great little pub, with a fantastic selection of Belgian beers. Good knowledgeable staff, recommended some lovely beers for us, friendly and happy to help.I'll definitely visit again in the future.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AlBoilRiKVTW9B0qr6wt6w"
  },
  "KMW27dgf9IEzrL2rn9SQew": {
    "date": "11/29/2009",
    "text": "I would say this my favourite pub in London. It is a proper Belgium beerhuis. It's the closest we have to my favourite pub ever; In De Wildemann in Amsterdam. Open Mon to Fri and for Sunday lunch in the heart of the City just a short walk from Farringdon Tube and an easy walk to Holborn and the West End. It's set in a little alleyway off Clarkenwell opposite St John's Castle. The area is steeped in history and has a variety of other bars, restaurants and night clubs.The beer here is fantastic and again the Brugse Zot is the winner. Good selection on tap and plenty of bottled beers for tasting. Plenty of indoor seating plus a terrace outside where most people stand and drink. The food here is the best with proper Belgian style chips with ketchup and mayo. Good sized portions with a daily special. Home made burgers and sausages for the meat eaters, veggie's can have a carrot or something!Prices here are reasonable considering the quality.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ql_IjW6MBtkPvmz8f7FV1A"
  },
  "76lQQOYrxpuy1EilqP-cwg": {
    "date": "11/27/2015",
    "text": "This is a Belgian pub and restaurant with a hugely extensive list of beers, and an amazing menu. We went on a Friday lunch time and thank goodness we reserved. It was full. Most people were ordering burgers; they looked amazing, especially the veggie burger. But whenever there are mussels on the menu I have to have them. They were delicious. Big portion, great sauce, and good quality mussels. They come served with fries and fresh bread. That's a lot of food when you have to go back to your desk in the afternoon! The rest of the menu looked great; plenty of delicious veggie options too. Service was good and efficient, despite the lunch hour crowd. Definitely want to come on an evening to check out the atmosphere.Will definitely be coming back here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1v2-TcNnww0dIEOm6Chtxg"
  },
  "KShIWkquBd5doquFT2330w": {
    "date": "12/13/2017",
    "text": "Fun Belgian beer bar with a very crowded, lively atmosphere. The bottle and draft list, though, skews heavily towards mainstream Belgian beers, many of them macro brands. So there were not many beers of interest to your beer enthusiast. I went with a class, Saison Dupont, which tasted a bit anesthetic and the glass format was smaller than I expected (12oz instead of 16oz). So overall, it felt a bit gimmicky to me and would really need to improve its beer situation to get 4-stars.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SUAFCKtkx8RrQ6EgJQIVrw"
  },
  "sl5exMJ9MXbwRnjx-lcjhg": {
    "date": "5/9/2017",
    "text": "There's a lot of Yelp Love for this pub giving it a grand 4 star.  Much love coming from those in my 'respected Yelpers' category however, I'm unable to share as much.  This maybe that I don't have any real love (or hate) for Belgium beer and this maybe where you have to be to appreciate the Dovetail.I always find myself spending much time flicking through their extensive beer menu.  This is definitely the focus and they serve tap and bottle amongst the list.  It difficult, and a little exciting to order if, like me, you have no idea.  What you could possibly end up drinking, in what shaped glass is the surprise! That underway, you can very much get into the vibe.  Good seating areas available and my recommendation is to grab one of those and settle in.  Then comes the challenge of food.  I like my food and when out, I like to eat.  The food menu is rather less extensive and the fare being average at best.  It is 'pub' food without much airs and graces and it feels like it there largely to soak up the various beers and this is OK if you know what you are going for.Waiting staff are friendly and helpful when deciding even offering tasters from the tap should you wish for more help.Vibe is generally good here so worth dropping by if Belgium Beer is you desire.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hh8yDWUP9-hqRZZu_Xbf2Q"
  },
  "-ParK7rE72fhrTYQjlauvw": {
    "date": "3/4/2018",
    "text": "A nice cosy place to hang out after work. Best pub food you can have. A great choice of besy beers.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZcmjvpMIwRGaFCr6zvYGWg"
  },
  "rX6hIVlkzo4tdgezJSzoDw": {
    "date": "9/22/2015",
    "text": "The definition of Dovetail: \"fit or cause to fit together easily and conveniently.\"And, indeed it is just this. The Dovetail and I, we just fit together...and conveniently, it's located fairly close to my office, but even if it weren't, I'd find my way back here. The Belgian siren song is fierce, my friends. So let's see, my most recent outing involved a Duvel, a few Saisons, some blonde beers, maybe a Leffe? Wow, now that I think about it -- I lost count. Which probably explains the drunk dial to my mum on the walk home and waking up snuggled with the dog on the sofa at 3am. Guess there are worse outcomes eh!? I guess I had some fun. Make a booking! We lucked out on a recent Thursday night but unless you'd like to hang outside in the lovely old Jerusalem Passage (it really is quite nice), call ahead to book a spot, particularly for the eats. The menu is pretty heavy (cheese fondue? deep fried avocado? anyone anyone?) -- but there are some light bites to be had for those that want them (the miso glazed salmon was pretty spot on), and even a few veg-friendly plates. BUT THE BEER. Man, it will punch you in the face if you aren't careful. Read your labels (or don't), and pace yourselves. 3x I've been, the service has been pretty great given the fact that its usually pretty busy with folks clammoring for more of those face punchers. A fun night out with pals, after work spot, a festive spot to kick back and enjoy a few. Don't say I didn't warn you though, you'll be hooked. Belgians do it up right in the beer department.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "74cJqHOuncQ3KwkLn48L8Q",
        "caption": "Photo of The Dovetail - London, United Kingdom. Salmon miso",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/74cJqHOuncQ3KwkLn48L8Q/o.jpg"
      },
      {
        "img_id": "HWd-G-r2GbBPSSD-ZeGhHg",
        "caption": "Photo of The Dovetail - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HWd-G-r2GbBPSSD-ZeGhHg/o.jpg"
      }
    ],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "WK0qc1M2E2WY5421MHVi9g": {
    "date": "10/8/2015",
    "text": "Oooh, it's a squeeze in here alright! But that's what I love about British pubs. The whole place feels like a nook of some other place, and whilst we're talking on that -- cheers to the table service meaning we didn't have to scooch (sp?) to the bar at all. In fact, double that, as our waitress was amazing and tolerated many \"just one more\" orders. Fair play.Smokers get to hang out and hang easy in the cool alleyway out front. Next to the bins, sure, but that's what we deserve. (Love hate relationship with the cigs.) The range of beers is huge and I was not careful to remember which individual tipples I tried -- to be fair, I started out on a lager around 4.5 percent (because, can't drink on an empty stomach) then my steadfast refusal for the tougher stuff waned and I ordered something crafty at 6 percent ish. Either way, all the sips are sound.Sadly, they'd run out of beef burgers, so I had the bison. It was really good -- sturdy, huge, trimmed well, but alas, a little too gamey to finish. Solid chips. Decent array of eats. My friend had a cauliflower burger, which you might sniff at, but seriously -- I made the wrong choice. I think cauli is the new brussels sprout, lads.Anyway -- love this spot. It's happening, it's friendly, it's got great options, and it's only a short run to the tube. I'm into it.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "itw5t-iHS_gB-LjmHwx1MQ"
  },
  "4vFM_vA3s-7t5RR5RJdGQQ": {
    "date": "9/22/2015",
    "text": "Really really liked this little bar/pub. Somewhere definitely not on my radar before with it being situated just up Jerusalem Passage, but somewhere I really want to get back to in the not too distant future. Basically these guys sell awesome beer, amazing Belgian beer, loads of awesome amazing Belgian beer in fact! Heading off here for afterwork drinks on a Thursday we were lucky to get a table with it being pretty busy by 6 and a lot reserved for later (book ahead peeps) but from this point we were nicely settled in and made it into quite the epic evening. The food was fairly rustic Belgian fair, I enjoyed digging into the cheese fondue as a starter and the steak baguette was good for a main - but I wish I'd spent more time looking at the menu (as opposed to gabbing away with my friends first off...) as there looked to be some pretty interesting things going on there. Fun conversations with friends mixed with tasty Belgian IPA, white Chimay and lots of random stubby bottles with foreign names scribbled on them made this a super fun night.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "2bRIapzEHNx8XsXE1UwUCQ",
        "caption": "Photo of The Dovetail - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2bRIapzEHNx8XsXE1UwUCQ/o.jpg"
      },
      {
        "img_id": "p5uECQnSzUwTJnBKiFGSPg",
        "caption": "Photo of The Dovetail - London, United Kingdom. Fondue starter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p5uECQnSzUwTJnBKiFGSPg/o.jpg"
      }
    ],
    "user_id": "SdyaF3_mFMdCig_25qW7TQ"
  },
  "PUK-8JTOSRPq3jkolAlYvg": {
    "date": "3/23/2016",
    "text": "I walk by this place everyday to work and everytime I pass by I feel like getting in for a quick gulp of some delicious Belgian beer, irrespective of the time of the day. Not to mention, their Belgian cuisine which includes some authentic ones such as Antwerp fish stew.  They also have daily employee recommendations on a blackboard inside. The whole pub also has a Belgian pub lane feel to it, kind of like the famous Delirium of Grote Markt in Brussels. There are also some trappist murals on the pub wall if I remember correctly. This place is quite packed on most evenings, and unlike most London pubs, even if the pub is full, you can drink beer on the lane outside. For history buffs (which I also happen to be!), this place is located on a street (or more of a passage) called Jerusalem passage (zythophile.co.uk/2010/02…) with a plaque dedicated to 'Thomas Britton, the musical coalman'. There is also the chic St Johns square next to it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5PF_yvtzL1S03srYdu_eTg",
        "caption": "Photo of The Dovetail - London, United Kingdom. Delectable Liege Pie!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5PF_yvtzL1S03srYdu_eTg/o.jpg"
      },
      {
        "img_id": "w9BV4yx93cJwL8EBCBthJg",
        "caption": "Photo of The Dovetail - London, United Kingdom. Sweet fruity Delirium.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w9BV4yx93cJwL8EBCBthJg/o.jpg"
      },
      {
        "img_id": "gcSXE2KNJEfwUJen9yUd6Q",
        "caption": "Photo of The Dovetail - London, United Kingdom. Delirium Red!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gcSXE2KNJEfwUJen9yUd6Q/o.jpg"
      }
    ],
    "user_id": "MjtunSaNKuqhL-45t_M_yg"
  },
  "MBwlTnURbqkTc5nUxMmlfw": {
    "date": "7/3/2016",
    "text": "Very good selection of Belgium beers Worth almost 5 stars for that! But I'm sorry the food is really bad. It's typical pub food, unspecial and tasteless. Worth 1 start for that. so now you know why you are going to this place!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDhqGhklny_7VlUu3A-SOQ"
  },
  "xSrl5SAaVTy_9q0jG_zozQ": {
    "date": "3/11/2015",
    "text": "The Dovetail is one of those magical bars that beckons you in off the street and the longer you stay the harder it is to leave. Their wide range of strong lager and simple but effective food may be responsible for this magic formula.They have more fruit beer on offer than many bars have normal beer. I feel that this is part of the draw of The Dovetail. Every time you go to the often packed bar you can come back with something different. Try the apple beer, the name escapes me (not because I was drunk) but ask the chatty bar staff who will be able to assist you on your quest. We had grub at The Dovetail. Some of our group are locals and weren't aware that The Dovetail did food but I can assure you that it does food well. For main I had a hotdog wrapped in Parma ham and feta. The meal was excellent, served with real pace and eaten even quicker. I was a fan of The Dovetail as you can probably tell. It harvested an extremely relaxed, casual atmosphere and is the perfect post work destination.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qVC8HtVH9IQ0MMRbdi_qXQ",
        "caption": "Photo of The Dovetail - London, United Kingdom. Beer and Cheese Fondu! My 3 favourite words",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qVC8HtVH9IQ0MMRbdi_qXQ/o.jpg"
      },
      {
        "img_id": "uLurFEb7B3bZvP8Fp_0_qQ",
        "caption": "Photo of The Dovetail - London, United Kingdom. Meat wrapped in meat is always a winner",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uLurFEb7B3bZvP8Fp_0_qQ/o.jpg"
      }
    ],
    "user_id": "AeRuFuddgPh9pxmBVFIUaw"
  },
  "AEifkgsMNAAXXUDhqcASRA": {
    "date": "1/12/2016",
    "text": "Went there for a quick afterwork beer with a fellow belgian yesterday evening. Posters of Tintin on the walls, vintage \"Westmalle\" drink menus, these details clearly made me think of an old \"bistrot\" as we call them back home. The amount of draught and bottled beers is pretty amazing as well. The place is pretty big and monday isn't specifically the busiest nights, and so it kind of felt \"cold\"..so I'll have to come back later during the week (or this might just be a good excuse :) Location is very convenient though, and I guess it's just nice to know that whenever I feel homesick, I can come here and drown my sorrows in a good old belgian triple ! Hips.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "4Qzu3MooyeO_vB-tNiQ1RQ"
  },
  "mLoH2-6BYNpbShf3ks0LGQ": {
    "date": "2/1/2016",
    "text": "The 3 stars are JUST for the quality of the beer! Really tasty beers.HORRIBLE service. We waited about 10 minutes for the guy to serve one beer to person before us.Very slow and not very interested in serving, in talking and generally in life itself...Oh and make sure you know the name of what you are ordering cause their menus are scrambled up and you might end up getting a glass of rose wine for no reason",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZCZkRw5nNRcvOPnh6hNWpw"
  },
  "0jrrAPZqI-q8XVdKPLSryA": {
    "date": "2/29/2016",
    "text": "Hidden gem in London! We only found this place as it was close to our dinner venue hidden along a little alleyway. What a find - dozens of Belgian ales and they even have Delirium on tap! Fantastic staff who are happy to make recommendations (just be careful you don't end up with something at 12%!) Really lovely atmosphere too and the two times we popped in over the weekend we managed to find a table as well. Can't fault the place - will definitely be recommending it to people for a while!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dc4dkAVxHD5aBXCB5V0oxA",
        "caption": "Photo of The Dovetail - London, United Kingdom. Delirium on tap!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dc4dkAVxHD5aBXCB5V0oxA/o.jpg"
      }
    ],
    "user_id": "5s111UbIqEkbc3wclj8wQg"
  },
  "zl5PAlCZwxFahvuZ6buyRw": {
    "date": "3/14/2016",
    "text": "Chorizo burger and frites were just ok. Service was attentive and the beer list was great. Pricing was as expected, and ambiance was exactly what I wanted for a solo trip to Belgian beer heaven.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r0xpw6r9YeJDYdob9ibhLQ",
        "caption": "Photo of The Dovetail - London, United Kingdom. Great beer list!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r0xpw6r9YeJDYdob9ibhLQ/o.jpg"
      }
    ],
    "user_id": "8tXHM0mQ20S5pxkxRPGbJA"
  },
  "YnZeZhCITI7u3AQ4uVAHkQ": {
    "date": "4/5/2012",
    "text": "Dovetail, you're dangerous. A mere mention of you among my mates and they wordlessly shudder trying to recall past events which've occurred on your premises but ended in a blur.Dovetail, it was with you I discovered Straffe Hendrik - a gorgeous Belgian brew with a ridiculously high alc/vol. I can't enter your doors without wanting a bottle. And after two. . .(see point above about you being dangerous.)Dovetail, you're one of the best bars in Clerkenwell and I've never left your premises without having had a bloody good time.Dovetail, you're a little slice of Belgium right here in EC1. We should count ourselves lucky (and your frites aren't half bad either!)Dovetail, when I look back on my life in London from afar, you'll be on my shortlist of pubs I'll likely always miss (but my body will rejoice when you're no longer a few minutes walk away, if I'm honest.)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hGprx8ugr1o3rGiWhDV3lA",
        "caption": "Photo of The Dovetail - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hGprx8ugr1o3rGiWhDV3lA/o.jpg"
      }
    ],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "-TbkXSqboilVWd9JNivooQ": {
    "date": "3/8/2015",
    "text": "Twice have I visited and stuck to the meatballs.What a find, this place. I do enjoy its relative quiet on weekday lunch times, ideal for catching up with colleagues over very decent grub.The ambiance is that of a low key gastropub but furnished with what looks like salvaged abbey bench seats. The low ceiling gives it a cave-like vibe.The Dovetail can be quite a zoo after office hours, and the smallish bar means patrons will have to exercise a bit of patience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YCOwZztY3w6KbmlETuHm4A"
  },
  "iFFKCS5xOEC-fv4EEp3nxA": {
    "date": "2/21/2014",
    "text": "Stumbled across this cute little pub in Clerkenwell last week with some girlfriends...This pub is pretty cosy so fills up quickly after work hours!!...I have to be honest I am not a massive beer drinker but for those who are-  this place specialises in Belgian beers, they have quite an extensive beer selection and hold tastings here on a regular basis!The food is \"gastropub style\" with Classic French bistro options like Moules Frites and of course no pub menu would be complete without burgers.. I ordered the bison burger with spicy tomato & rodenbach relish (£10.95) The menu said the meat was \"naturally 97% fat free and 40% more protein than a beef burger\" definitely in keeping with my \"weekday\" diet. You real foodies will not appreciate this but...I also swapped up the brioche bun and chips for seasonal vegetables and salad, which they surprisingly had no problem with! Verdit? It's a pretty damn good burger despite the lack of carbs to pack it out (the picture proves that the healthier alternative still looks appetising!!)Overall a low key chilled pub, non invasive service to let us get on with gossiping and generous portions of food including alternatives for the health conscious! But next time I really should try some of the beers!Bonus: The Zetter townhouse is also just round the corner if the beers just aren't hitting the spot...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4jrbEDxPB7yl3EiIBnpmoQ",
        "caption": "Photo of The Dovetail - London, United Kingdom. My bunless bison burger!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4jrbEDxPB7yl3EiIBnpmoQ/o.jpg"
      },
      {
        "img_id": "8pCWYHYQUY_nA_ufbWM4tg",
        "caption": "Photo of The Dovetail - London, United Kingdom. The beer cabinet!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8pCWYHYQUY_nA_ufbWM4tg/o.jpg"
      }
    ],
    "user_id": "NjT5S1XcmmEWTjxCthhW9Q"
  },
  "hLBo0cAlYN0Fheeetk98jA": {
    "date": "5/14/2016",
    "text": "Fantastic food and serviceOrdered the braised steak and beef stew, which were recommended by our server and were outstanding Had a tasty white beer and a sour strawberry and raspberryWould absolutely recommend this pub",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q39Nkx_h6GNUDF5Vm-lvfw"
  },
  "BNJylhL--3x0sS0bHzRuHA": {
    "date": "12/5/2014",
    "text": "An absolute beer drinkers dream. I mean there's a full 7-page beer menu. It's a Belgian inspired little gem with an impressive bar and some delights on the food menu. Tucked away in a small alley in Clerkenwell this beauty gets nice and busy most of the time but it's all good fun and has an excellent post-work drink atmosphere. I've only drank here a few times and although the food looks incredible it still remains firmly on my to do list. I've slowly made my way through the variety of drinks and the fruit beer options they have here are excellent. Real hard to beat anywhere else. Some nice table seating in the back and really worth a visit. Great atmosphere and yes the beer works well...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FYqdClyfBa5mzh2kotOCwg"
  },
  "Es8Q0WAeqW5-AAsbobyNDw": {
    "date": "5/5/2016",
    "text": "Had a lunch here today with colleagues. Friendly service and good food - although the steak baguette seemed pretty challenging to eat. I don't drink so can't speak for the beer selection but it was indeed vast. Definitely a nice spot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0fv3Gd3D8fe25K4YeES0w"
  }
}