{
  "B-sk7eveHjHqPBOzuTUjwA": {
    "date": "10/4/2010",
    "text": "Best Vietnamese food I've had in London? Maybe. I really liked it here ... a lot. Portions are massive. Service is quick (although there may be a bit of a wait to actually be seated - I suppose the popularity of Cafe East is a testament to how yummy its menu is). Prices are reasonable. They've got rainbow ice and other funky looking desserts and drinks too. Yay for this. If you go but don't know what to order, I rec the pho tai (rare beef with flat rice noodles, £6.50) and maybe an order of yummy summer rolls as a starter. And if weird desserts might be your thing, the che ba mau (special three-coloured drink made with red kidney bean, green jelly and topped with coconut cream over crushed ice, £3) is definitely a treat!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XOybpF-Spum0Q6MwkHvukw"
  },
  "eF6jWyVwe0X3fs4cDOcdNA": {
    "date": "10/27/2012",
    "text": "This is a very busy restaurant.  We got there right before 1pm on a weekend, and the line already started to form.  Being in London for just less than a month, I was so excited after reading the reviews about this Vietnamese restaurant on Yelp.  Once again, Yelp  didn't let me down.  The food was excellent and the price was reasonable!   And the service was superb!  As a frequent Vietnamese restaurant visitor, I knew the dishes that should be on the menu and they have all the items from red bean jelly drink to pho/vermicelli.  The fried spring roll was my favorite for the appetizer.  Vermicelli wrapped inside gave it a soft and tasty touch.  Steak and brisket pho was good, but I found the noodle to be a little bit too soft.  This pho is still the best I had so far in London, so I am not complaining.  I forgot to mention, the portion or the size of the bowl was BIG!  Pork vermicelli is just like how I remembered it.  The sauce (sweet and little sour with few chili-like pieces) was on the side and you can pour it in the vermicelli.  Mix it up, it looks like a huge bowl of salad.  I highly recommended this place, definitely worth going.  If you are overstuffed at the restaurants, there is a super Tesco nearby!  A great place to have a walk, how convenient!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "03rssT12PEeaYyoHq-kNaw"
  },
  "gYZKtVklLlsKGgeXPnSYag": {
    "date": "4/6/2012",
    "text": "Yes, Cafe East, you're in the middle of nowhere. No, you don't serve any alcohol, and no, you won't let me bring any. And nope, you won't offer me tripe, or any other interesting cuts of meat with my Pho... But I dream of your Banh Cuon, your Cha Gio and your beautiful beautiful Pho so often, that I'm willing to head to a car-park, go without tripe and beer just to eat those 3 dishes. Cafe East you just get better and better!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FHDLnvulXX6JtkH2PgVE_Q"
  },
  "KtLdlOt8gmUqchXRKG6npA": {
    "date": "10/28/2011",
    "text": "ok ok - so i wrote a harsh review back in June 2010. I was telling a friend about Cafe East and they said that to do the place justice, i should really eat in. The eat in experience was a world away from the take away experience. The food was delicious, fresh, fragrant and great value. Had the house special spring rolls with the fried onions on top and some summer rolls... Fabulous. The fishy chilli dip and the soy sauce were great accompaniments to the dishes. Moans: Lack of bottled or tap water (why?!) and a lack of any booze on the menu so bring a hip flask and some water wit hyou if you dare!  Would also be nice if they accepted cards. Highly recommended and great service.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xdUA5VrnRlYKhuB053KcrQ"
  },
  "dD3pvrOjYt9PF9YnEHSyxA": {
    "date": "12/12/2011",
    "text": "My favourite place for pho is still Cafe East. Whether it is a cold wintry day or just when you are craving some broth based noodles, the pho from here always hits the spot. It is still the best that I've had in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "Adxn2eIs7yy0EMeC9QpQkg": {
    "date": "6/11/2012",
    "text": "Best Vietnamese in London. Their pho is authentic and nuanced. Their com ga (crispy chicken) is laudable too. Comfort food, South East Asian style.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SzHDUZ0lgCJsF7ECRyjzhQ"
  },
  "exODO-cUiVEJN0J93MDpXw": {
    "date": "7/16/2013",
    "text": "Nice restaurant but the pho was a little disappointing.  Particularly the pho base.  However quick service and polite staff made up for that.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnsGj5_AuzMITN_GyTNsNw"
  },
  "aWZjWkLxOE3dcFX1o8AiTw": {
    "date": "3/15/2010",
    "text": "Pho close to Canary Wharf? It is possible.  This place makes a decent pho and serves up some good banh cuon.  Whenever Im in the mood for pho and I am heading home from work, a quick stop at Canada Water does the job.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "YraJh78pcpdI2RSoUfxosg": {
    "date": "9/1/2010",
    "text": "Fantastic Vietnamese food here. The menu is simple and the theme is basic. If coming here the 3coloured drink they do is a must. The only problem i find about this place now is how busy it gets. It's a very loud restaurant and I wouldn't recommend it if your after a relaxed meal. The tables in my opinion are too closely pacted. You literally hear every word from the table besides you. If planning to visit here from far, I suggest you call in advance to check if they are open as they seem to be closed frequently for holidays ect ect.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XtzJpUFRz5Nd7w_ysTpOdQ": {
    "date": "12/18/2008",
    "text": "Ok first off, I'm quite reluctant to write a review for this place as It's the type of gem you want to keep to yourself. For me this is undoubtedly the best Vietnamese restaurent in London and I have been to a fair few. It's menu may be limited for some but what they do offer is the best you can get -Fresh ingrediants and authentic tasting dishes. Service is always prompt and freindly. Dishes are well prices and portions are generous. You may find when you go that there is a cue outside the door, don't be surprised as this is the norm and you'll prob have to wait a while before getting a seat. But it's well worth it! When you enter you'll likey see loads of people slurping away on their steaming hot bowls of 'Pho' (highly recommended). If you read this and go, please let me know what you think on here. And if you don't go well perhaps that's a good thing, as maybe I'll be able to find a seat. I've changed the address as Cafe east has finally moved to a bigger and better location! The old Place has now become MAMA PHO. Review coming soon!!!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "t-ku9U_uLMszu3xK_wckGw": {
    "date": "10/27/2011",
    "text": "Canada Water.... so out of the way but yep I've been there many times and walked for 15 minutes in the cold weather just for you...Bahn cuon (entree), Bun Bo Hue (spicy beef noodle soup), Pho or Vermicelli no 1 (with spring rolls) with the red bean dessert/drink to finish. Always. You never failed to disappoint. I still think you're the best (Viet in London anyway) .. not Song Que, not Bahn Mi Bay, not Cay Tre, not Viet Grill.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "h0WtY-wfWtFiuOl1go_xFA"
  },
  "aQcCGCjts_Tz5Gi6rT-JCQ": {
    "date": "4/15/2011",
    "text": "Definitely one of the best Vietnamese in London! Coming from a Vietnamese background and haven eaten Vietnamese food all my life from Vietnam and Australia, i would say that these flavours are very authentic. This restaurant is definitely worth the trek. If your going on a Friday night, then expect a queue around dinner time. This place packs out. So i suggest going on a weekday sine chances are you won't have to wait around. Service is quick here and staff don't like to wait around, just like in Vietnam! It's all about food and getting out as quickly as possible. For entree, i suggest having their banh cuon. I think this would probably be their signature dish. It is rice pastry roll filled with minced pork and mushroom, with fish sauce poured on top - delicious! The summer rolls are nice and fat with lots of filling! But i don't like it when my rolls get cut into halves. The peanut sauce is tasty too but i prefer a richer Hoi Sin sauce which I don't expect to have in restaurants since most Vietnamese restaurants like to dilute their sauces.  For mains,  I noticed a lot of people enjoying their Pho, But I enjoy selecting anything with vermicelli noodles and i would say the bun bo xao (lemongrass beef) is my favourite here. The portions are huge and sometimes enough to share between 2 people (dependent on how hungry you are) :). So make sure you dont fill up on too many entrees.For dessert, the che bau mau with selection of green jelly, red beans, and coconut milk over ice is one of the best desserts! I would dare to say one of the best che bau mau's I've had ever!In terms of the atmosphere, yes it can get loud, but that's what eating at a Vietnamese restaurant is all about! Overall, I love eating at Cafe East, definitely my local go to Vietnamese restaurant. If you love great tasting food, cheap prices in a casual lively environment, then i highly recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "rcNJ8WK_JUfAAjpY2okU4A"
  },
  "qJaeDhZJ4emrrwrTrqidXw": {
    "date": "4/7/2014",
    "text": "My brother took me here a few weeks back and now I can't get enough of it. However BE WARNED: even if you think you can handle spice this place cranks it up to the max. Even a little spice can have you gasping for water. They don't serve tap water (since they don't sell alcohol) but if you get some jasmine tea you'll be fine. Get some spring rolls and a pho if it's your first time. You will be back in a flash! Enjoy",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D-Vs3RHxnpQ9DcRdo4gv4w"
  },
  "vlfx7qLx7i5i0YWHvkyZsg": {
    "date": "5/2/2011",
    "text": "My favourite pub was closed for a function so I moseyed on down to Cafe East for some of the best Vietnamese food I've ever had. This is flavour at it's finest. I had never been to it in it's original form but from all the accounts I've had it appears to have survived its expansion with the food still just as perfect.Service is efficient, although not amazingly friendly. If you go to good asian restaurants a lot it's a style of service that you'll recognise. I think it helps to give the impression that the focus is really on the food. You're not left waiting long before ordering. The outside of the restaurant also doesn't betray what's inside, looking like a tacky pub in the middle of a leisure park.The menu is split into starters and mains, but in the typically haphazard service style you'll probably get your main before you've finished your starter. It's kinda nice just mixing all the dishes up. Each dish is spiced to order. Hot isn't incredibly hot and is probably what I would recommend. You don't really find more authentic Vietnamese food than this and is the kind of place that should tempt North Londoners South of the river.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tV2ZQSVYo-AiKSrUaLXTIg"
  },
  "_uzZy-Jihy54OZ64bDgUig": {
    "date": "11/10/2010",
    "text": "Better than the Kingsland Road Vietnamese restaurants??This is the best Vietnamese in London, in my opinion. They don't have a huge menu, just one page of Pho dishes, one of other dishes (and pictures), and a back page of drinks.  The drinks aren't to my taste (yet), but I have had the coconut juice, with pieces of real coconut meat floating in the delicious liquid.The decor is fairly unassuming.  In fact, the walls are completely undecorated. What you immediately notice here is that 95% of the people eating and in the queue are Vietnamese.  I will go out on a limb and say that people come from miles around to eat here. Be prepared to take a number and queue, but the turnover is fairly quick, so it's never too long. And the service is very fast, friendly, and efficient.Even though I live near Shoreditch and the Kingsland Rd. stretch of restaurants, I will gladly make the pilgrimage to Surrey Quays for this mecca of Pho!!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "5XsVXyHr95m8A07IVrqG7Q"
  },
  "Qz-COojZP9Ud3ERDT0wAxw": {
    "date": "2/21/2011",
    "text": "Car Park Pho!Decent and very popular Vietnamese at the back of the Surrey Quays car park. Cafe East have moved over from their Deptford corner shop to this big barn-style space which not only has ample parking but has a outside eating area for warm nights. Inside it's a big warm room with white walls and absolutely no decor, just many tables. They have some flowers by the door but nothing else. Bland.Service was pretty good, prices were great (CASH ONLY) and the place was packed even as early as 6pm on a Sunday (people waiting for seats). Crucially the masses of diners were Vietnamese and Chinese families... a good sign.Food is fully four star. The menu is a picture book of only a few dishes, but all the usual Vietnamese are there (except Banh Mi). We tried a few dishes which were not really outstanding but at least very generously portioned (i.e. massive). The dessert drink of red bean, coconut milk and green jelly was better than any of the equivalents I've had in LA.What I really wanted to test was the Pho... still searching London for a 5 star bowl. This was nearly there. The large porcelain bowl was a good start. The fresh coriander, chillis, Thai basil and other herbs was good too. Lime was sadly replaced by lemon, but at least I managed to ask for a side bowl of Sriracha and Hoi Sin. So that just leaves the two final points:The Broth - AMAZING The Beef - TOO CHEWYSo easily would be 5-stars if they had better beef including tripe, a menu with more choice, some simple decorations and took cards.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "FbbaJpeJVEsuO5px2BLXSQ": {
    "date": "1/8/2014",
    "text": "Great pho and if you are a spicy food fan, you should try the spicy pho. The broth is really tasty especially add with extra chili and burst of lemon. The spring roll is excellent for its mouthwatering sauce on the side. Their iced soya milk is also good, not to sweet. I will definitely go back for the rice dishes.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cU3XCh3O5lJwZv-nC-AOHQ"
  },
  "bPivPLkSGwkJvjuqYe9iKA": {
    "date": "6/17/2011",
    "text": "You're paying an average of £7 to get your meal. £7. Really.The restaurant is housed in a very docklands type building. So, first impressions are - wow, cool, intriguing; then you walk in and it looks like a bad cafetaria in a community college. You'll be disappointed. Just remember, £7.The food is not too bad. You can get Soupy or Dry Noodles and the same dishes on rice. Not too spicy, hence good for the spice uninitiated. The food looks fresh. Crispy chicken is crispy, not soggy. Grated carrots and mooly are freshly grated. All the broth and sauces taste good. Something is still missing but hey, £7. Good deal. Service is good, for London standards. No attitude from the waiters. No endless waiting for your order. You might have to shout out aloud if you're trying to get their attention once your order has arrived, but that's OK - right? Remember? £7.I don't like the drinks or desert, but that's just me. Everyone I'm with seems to enjoy them. But if you ask me, avoid. Stick to the appetizers and mains.I live in Canada Water. I have to give it 3 stars, at the very least. I owe it to my neighbourhood.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsZ-9xcfubD8j0dUR7ke5Q"
  },
  "zkkAJtgFZisZpdVNJ2UcaA": {
    "date": "3/6/2011",
    "text": "I loved the food and the drink that qualified as a full on dessert!The broth my noodles came in was incredibly tasteful and hot!the drink was made from coconut milk, tapioca balls and some stuff Im not familar with but could have been some kind of bean paste all on ice. Not sure it was a type of bubble tea anyway - so delicious and no need for dessert after. Definitely try the drinks!Despite the great food this place deserves to lose a a star in my review for the brutal  plasterboard savagery in its interior design. From the outside it is a beautiful ex industrial type of brick building and i would have loved to have seen some of the original features exposed on the inside. Sorry Cafe East despite your incredible food the building deserves some better use, a big shame :(",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Ab6t3mmUauabPJwW0LZow"
  },
  "cUOIbQ5yDnTeADqecRix_A": {
    "date": "12/12/2011",
    "text": "Pics@Chopstix2Steakniveschopstix2steaknives.blog…My favourite place for pho is still Cafe East. Whether it is a cold wintry day or just when you are craving some broth based noodles, the pho from here always hits the spot. It is still the best that I've had in London.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PuDyYiw5BujBAokE9H_KZw": {
    "date": "3/18/2014",
    "text": "Great food at reasonable prices, simple menu and good choice of sweet Asian tea drinks. However only takes cash and does not serve tap water.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWXqt07KOaETLPxodkmlmA"
  },
  "So0e_R0yitoBc3_y5QqxJA": {
    "date": "2/26/2012",
    "text": "The verdict: it's good but I'm still looking for great. My Vietnamese friends brought me here because I bemoaned about the lack of good Vietnamese restaurants in London and upon entering Café East, I thought this could be 'the one'. With a canteen like interior and a colourful image filled laminated menu cards, I was impressed with the many synergies with local establishments in Sydney's Cabramatta. The pho disappointingly, was slightly bland and not piping hot as it should be, it was extremely busy so I do forgive them and will return for hopefully, a more authentic experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q1NewRtQLqMJwnyC4TEXyg",
        "caption": "Photo of Cafe East - London, United Kingdom. com suon bi cha - 6.50",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q1NewRtQLqMJwnyC4TEXyg/o.jpg"
      },
      {
        "img_id": "Kvm5X1EgVA7sryjTDDWubw",
        "caption": "Photo of Cafe East - London, United Kingdom. bun bo hue - 6.50",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Kvm5X1EgVA7sryjTDDWubw/o.jpg"
      },
      {
        "img_id": "sipr1dJXyzm21RygwrXD9w",
        "caption": "Photo of Cafe East - London, United Kingdom. pho tai - 6.50",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sipr1dJXyzm21RygwrXD9w/o.jpg"
      }
    ],
    "user_id": "qb6oMH-SIzuOHmnBXIzncA"
  },
  "771esCOh41bgctgEbwXoSw": {
    "date": "7/14/2011",
    "text": "Cafe East is a real treat  Vietnamese food rocks.I'll spare you an extensive account of the menu  previous reviews have covered this and made recommendations on what to try. Suffice it to say, you won't be disappointed. The portions are huge so it might be best to order one starter between two, or opt for a starter each and a ligher main course. Either way, prices are shockingly cheap given the quality and amount of food one gets here.Cafe East's popularity is underscored by your having to queue on arrival. It does get very busy here. But service is always good-natured, never clumsy, and there is a general sense of order and cleanliness about this family-run business. Go, you won't be disappointed; you'll be delighted you did go.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tVMLxovuKxzxHfYr7ul7Ug"
  },
  "XPrhkuCT9eShwyqfa45y7A": {
    "date": "7/24/2009",
    "text": "Full review with pictures here: cheap-eat-london.com/200…  Based in Surrey Quays and conveniently located next to the Odeon and Hollywood Bowl complex (the parking is grrrreat!), this place is bigger, badder and a little bit better than it's previous incarnation when they were based in Deptford. They can probably seat around 100 or so people and as a result of the expansion, they have headed into 'Noodle Bar' territory and as a result have lost a little bit of the charm that was the old Cafe East (which seated around 25), but quick and nasty oriental food this most definitely is not! I am absolutely astounded by how consistently good everything is and this is a testament to how well the restaurant is managed. Cafe East is always busy yet spotlessly clean; the service you receive is quick, efficient and friendly; the food looks good and importantly, looks exactly like it does on the menu! Regardless of how the food tastes, Cafe East should be commended on providing something that a hell of a lot of SE / East Asian places fail to do, and that is provide a good service. I'm glad to say that the food doesn't let it down and once those big white plates and of food is hits your table, your eyes will lead, your hands will follow and your tummy will be ever so grateful. The Pho stock could be improved with a bit of added cinnamon and star anise but it may be I'm just a little too picky and particular (so I've been told) but apart from that, the beef pho comes highly recommended as does this mixed one with added chicken and prawns. The chicken curry is sublime and probably my favourite and even if the chicken is cooked off the bone, it's prepared long enough to absorb that lovely coconutty curry, yet still retain a soft moist bite. The banh cuon resembles the Chinese cheung fun which is made from steamed rice paper but the Vietnamese version is lighter, translucent and filled with a season ground pork filling. I love it. My friends love it. My kids love it. You will too. The Bun Ga Nuong which is chicken on a bed of thin rice noodles was deliciously sweet and crispy that I suspect the chicken was deep fried rather than grilled, but when it tastes this addictive, I promised myself I'll run it off later. In their new locale in the strange commercial new build environs of Surrey Quays, Cafe East have made themselves even more accessible and on that basis, if you've been hankering to taste what the fuss is about, then you really don't have an excuse. £4-5 for a starter, £6-7.50 for a main. They also have a great selection of soft drinks such as coconut juice, sweetened soya and traditional bean dessert drinks but they don't serve alcohol. Also be aware they only take cash.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "r0Hd4DQDO3YBDeqLH29g_w",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r0Hd4DQDO3YBDeqLH29g_w/o.jpg"
      },
      {
        "img_id": "7UwNDjUE8GuHFWknWd0qRA",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7UwNDjUE8GuHFWknWd0qRA/o.jpg"
      }
    ],
    "user_id": null
  },
  "4my-W0iPiBLSohJOcpmASg": {
    "date": "1/21/2010",
    "text": "My first yelp review back in London - and for a good while! - so forgive me if I'm a bit rusty. Thought I'd start with Cafe East as 1) I went there most recently, 2) noone wants to read yet another review of Pizza Express or how wonderful the national Theatre is, 3) I have many things to compare it to so I might even be objective! Result. So, it's not often I venture over to Canada Water, but now my friend lives there it's difficult to avoid. After a somewhat odd experience in the Hollywood Bowl (odd because I was painfully aware I wasn't 15), we ventured to Cafe east for some grub. It is often that I venture to Kingsland Road, so I was interested to see how it would compare. Very favourably, is the answer. The food was absolutely delicious. It all tasted extremely fresh, with lots of fresh herbs (coriander-tastes-like-soap-disciples, tread carefully), and a spciy kick to knock your socks off. I asked for medium, and was downing green tea towards the end of the meal to soothe by tongue, so watch out! The menu has a few usual starters, spring rolls and the like, and then a dozen or so main courses. I had the pho with everything - don't ask me what it was actually called! - my friend had bun cha which was wonderful. The phos come with the soup on the side so you can choose how to eat it. Portions sizes are huge - the boy was defeated by his - and we left only a tenner poorer. The space is nice, nothing special but comfortable enough. You probably wouldn't be spending long here anyway - our food arrived within ten minutes. If I'm in this area, I'll eat here for sure. But I think my heart still belongs to Kingsland Road. I'm spiritually a North londoner.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 5,
      "cool": 5
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "h7JzXr3MHsC8TCWbgTGnlQ": {
    "date": "1/10/2010",
    "text": "One of our favourite local eateries and much easier to get to for us, now that it has moved to Redriff Road. Simple, but delicious Vietnamese food at reasonable prices. We always have the spring rolls and cheung fun, followed by soup noodles. Don't order spicy unless you're well prepared for a good cry! The food is always freshly prepared with noodles served steaming hot. Cafe East is always a favourite for a quick and enjoyable meal. We have brought all of our friends and family here.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "bof36DzRtPknHxP_CNTJ2A"
  },
  "pi57WiMqvm-9fEelzZKHrg": {
    "date": "7/20/2013",
    "text": "The first time I came here is about more than 1 year ago and the food is quite good, however this time when I came back to UK the food is far to compared with last time. I had the vermicelli with beef and the meat is far too sweet. Maybe because they are too busy to get the food right but really disappointed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BJMs1uanIiSHdB73vjUb_A"
  },
  "QKb0arCeKvQpa58d7uiUGg": {
    "date": "12/25/2012",
    "text": "Absolutely love this place. Has the best pho with deep flavourful soup and zingy herbs. Room is light and clean. Service generally prompt and efficient. Even when you wait in line it is not for too long. Definitely recommended. However, beware that it is closed on Tuesdays oddly and completely shut for holidays mid-Dec to mid-Jan.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eIehvAk7EpHjLbf3gCGRQQ"
  },
  "b3zlThG6JLZpa90dgrzNWg": {
    "date": "5/4/2012",
    "text": "Very good food. Service and decor isn't the best, but the food is worth a visit. Best Pho in London yet.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "012_hfMATnh0nUEi9OYLug"
  },
  "AtmXnoDtgJpQZtTcG3Jeww": {
    "date": "6/7/2013",
    "text": "Half of your staff did not know more than \"Hi\" and \"Bye\" in English, I had to repeat at least 4 times before they figured out what my order was",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsgFvCdWQ91wEHyG3nnv4g"
  },
  "fWK0u9NNUqiDyZqNitgJoQ": {
    "date": "12/24/2015",
    "text": "It's very famous in SE London. I think the main reason is good and big Vietnamese dish with cheap price. The noodle with soup is great in winter time. But it's a bit hard to find cause no public transport can get there directly.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "85-B22-77bM1QMht9OstxQ"
  },
  "2zFMXLE0lCMlGP-hw7sQgQ": {
    "date": "8/7/2015",
    "text": "This place is unbelievably good. Tucked away behind the cinema literally in the middle of nowhere, you would find it hard to believe that it would be any good. The dishes I had were probably the most fragrant and fresh dishes I've had in a long time. A great looking menu overall so I hope to come back to try more. And the best bit is that it's really cheap, £8-£9 for a main, you can't complain. (Visit - 05/11/2014 Lunch)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W3QkozspSmuLnqHf6ZyFsg"
  },
  "Gc_xCuH3ErOiLvw0E9U92A": {
    "date": "5/17/2015",
    "text": "Very good food- authentic. Service was very fast and we only waited about five minutes to get seated. I would recommend number 16 and 20.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mbc9Et9Ro-lofE0n9aPpyA"
  },
  "Uho8NjV-MoPPym66mh16eg": {
    "date": "7/23/2013",
    "text": "The drinks frighten and intrigue me. I'm very British when it comes to drink consumption so to have a drink that looks edible just confuses me. Conversely, Vietnamese spring rolls are so transparent that they look like a vodka and soda with lime. Stop messing with head Cafe East!That said, everything here is delicious. The food is fresh and vibrant with well-combined flavours. It's like the food equivalent of one of those zesty revitalising shower gels that give you a minty morning kick. Except that this tastes nice and isn't poisonous.The only qualm I have is the decor. It looks like a canteen. The benches are kind of uncomfortable after a while. The lighting is far too bright and glaring.It is however, absolutely worth it for the food and the price. While I may have been a little on the sore side by the time I left, I would definitely go there again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Q0VOtDU5gQPLYsCR3V-X1w"
  },
  "q_78vNbZLtXtW97KwEfRsQ": {
    "date": "9/21/2016",
    "text": "Being away from home where we have amazing pho restaurants, I wanted to find a place in London to cure my pho craving. Hearing that this is supposedly the best place in town, I made the trek from Central London. Once I ordered, I was highly disappointed that they do not offer jalopenos nor basil, a must for pho. Their one saving grace is that the broth has some flavor to it, but there was hardly any in the bowl. Will be back if this is the only place in town, but doesn't feel authentic.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6noK3fYYJE6fUF-N_EXGgg"
  },
  "rO2SPVJ9Dv-PNtzT2m_Mrg": {
    "date": "1/23/2014",
    "text": "Ordered: Pho, Rolls, Price: £20 total per head MAXReview: WOW the portions are BIG!! Slightly inconvenient place without a car I guess, but the place is FILLED with people of Asian descent - uhum ie me....but that is a good sign!! An Asian restaurant filled with Asian foodies...You know you got the Right Cafe East..get it...Right and East are pointing in the same direction?? Lame?? Ok - great food, great price, great portions! (Don't expect michelin star service).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxDOuSJm1uZIMAnEL__juQ"
  },
  "E2l0c-s-zvWJ9TQ42G8s1w": {
    "date": "9/6/2013",
    "text": "Cafe East has always been on the radar, mainly because when I went mama pho, in deptford, it's literally down the road. Like with most after yelp dinners, we arrived quite late and they seemed really flustered, for a Wednesday evening at least. there's only 5 of us!  Anyways, I got for the usual, summer rolls and beef Pho. What can I say, I'm a simple girl. Pho was lovely, not the best I've had, but great depth and great flavour, I could not finish the summer rolls, I was like carrying my food baby out already.  also had a red bean and green jelly drink! I LOVED IT. and the food took so long to come out, I already ate-drank most of it! If you're in the area, definitely check it out, it's a really nice different option to your usual retail part fast food fare!TIP: they don't serve tap water? I don't even know why.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "LaDBTCVsbu4zsRT4gAA9aA": {
    "date": "5/1/2013",
    "text": "Came in without any expectations, a Californian eating Vietnamese food in England... Hm. This'll be interesting.So, location.  Is it just me or is this located in a really random spot, near a bowling alley?  Know what, I am totally cool with that, I love hole-in-the-wall joints.  But this place is totally NOT  a hole-in-the-wall establishment.  The restaurant itself looks very nice and even has outside seating.  The inside is very modern and sleek looking, definitely not used to that for a vietnamese restaurant.  But there were a lot of Vietnamese families inside, and the place was bustling, so I was looking forward to this meal.  And the voice levels weren't too bad considering there were moms & dads with their little babies having a meal.  Tap water is not served here.  We started out with the shrimp spring rolls, which seemed to filled quite a bit with veggies.  But I was really surprised that they served Banh cuon here!  Which is basically a rice noodle roll served with pork cake, definitely delicious!  And as for my main, I had the Bun Bo Hue, I was so excited for this dish.  But it was just so salty and full of MSG!  And the water bottle that I had ordered was tiny, so I drank an ocean when I got back home.  But my other Pho Phriends really enjoyed their meals!  Some had also ordered the vermicelli noodle dish, and it looked quite delicious as well.  So I think it's the Bun Bo Hue that you've got to stay away from.For those who haven't tried Vietnamese cuisine, I think this is a safe place to start.  With it's more modern decor, you're not too far away from what you're used to, and you can easily ease yourself into really interesting dishes!   But for those with some experience, this is an alright place.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wq9YJt-k2o7ILJBSMKAxPg"
  },
  "uEi-AquqDkWA_VmTSnFYmQ": {
    "date": "9/5/2015",
    "text": "Food is great,authentic but it seems that the size of the portions has been reduced while the prices increasing",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SHYBlvE38Zk47I5cKL4Ww"
  },
  "51pDMvlkZctbmiOAeEGVAA": {
    "date": "8/3/2015",
    "text": "No frills Vietnamese. Everything is freshly made and delicious. Hidden gem in SE London. Some of the best Vietnamese I have had.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_e9Ll0fCwwaM0K7Z0FUoQ"
  },
  "SstwGDHS9o77FFMWvDkg0A": {
    "date": "1/29/2013",
    "text": "Friend: \"Do you have anything vegetarian?\"Waiter: \"Yes, the prawn rolls\"Friend: \"Vegetarian, no meat\"Waiter: \"Oh yes, prawn rolls\"Friend: \"It has fish. I don't eat fish!\"Waiter: \"Okay one order of prawn rolls?\"Clearly not the most herbivore friendly (no tofu substitutes) and the only other vegetarian dish was a vegetarian Com Ga with spring roll.  But luckily I love meat.  Oh so very much.  I've been on a hunt for good pho ever since I arrived here, in search for pho as good as the ones I had growing up, going to Vietnamese restaurants amidst the Tung Kee knockoffs (holla, Californians).So many people recommended Cafe East upon hearing of my noodle hankering, so I resolutely came to the deceptive corner restaurant (have you ever seen a brick Vietnamese restaurant with a neon sign, on the edge of a parking lot of a bowling alley? It IS deceptive, I say).  The lunchtime crowd at 12 pm on a Saturday was light compared to the insanely packed line at 8 pm on a Sunday night.Ordered the £4.80 Bahn Cuon, a steamed rice roll with mushroom and minced pork.  It was so scrumptious, I couldn't stop eating as it was addictive dipping the little rolls into the sauce.  The £5 Bi Cuon was also very good.Ordered the £7.50 Pho Dac Biet, a huge bowl of prawn, chicken, and lots of unidentifiable beef bits (tripe lovers 4ever) and asked for it to be spicy.  The broth was nicely seasoned, the meat was plentiful, but I wish the noodles were thinner as they use a thicker rice noodle than I would normally have.  Do order the delicious drinks.  Che Ba Mau is a jelly drink (really should be dessert) and Sam Bo Leung is an herbal drink with longan and pitted red dates.All in all, I liked the place but I'm sure there is better pho out there.  And I will find you, you can't hide...",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "DI0O0S49J3_Z2eg_FhNHaA": {
    "date": "9/4/2013",
    "text": "Okay, so this is on my doorstep and I've walked passed it many times dismissing it as a greasy spoon.  Turns out it's a Vietnamese restaurant!  How deceiving covers can be.  Much more glamorous than a greasy spoon!Oh how I was to be disappointed!  The decor was so spare and uninspring is was unnerving, essentially a box with tables, chairs and glaring light. So we sit down and get our menus - second disappointment - no alcohol on the menu!The atmosphere was hectic and chaotic, the staff seemed harried, harrassed and distracted.  Turns out it they had reopened that day after a month's break.  Then we order.  The waiting staff took a while to get to us and take our order and I don't think anyone was able to order without changing it as the kitchen was out of stock on a lot of the menu options due to it being the first day of reopening.  It was all very confusing.We were waiting a while for the food to arrive too and at one point it looked like one of our party was not going to get a meal.  Once the food arrived, however, it was delicious!  I was so full afterwards, I felt I could be rolled home.One final thing, payments are cash only.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "ptkl9EyCwZK_1JZApwZf6A": {
    "date": "6/12/2016",
    "text": "Excellent food, good value for money, the best Vietnamese restaurant I have tried so far in London. Easy parking.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8TL6qd7xu2ogQkrVK345Ww"
  },
  "K5Z_VD5E92wvA4ioktUJVA": {
    "date": "2/25/2014",
    "text": "Tasty, reasonably-priced Vietnamese food. It is bustling on the weekend and makes for quite a different brunch experience - something very comforting about the atmosphere and a bowl of hot pho. Service is efficient if a little brusque.One point though - NO TAP WATER served. Quite scandalous really and tarnished my enjoyment really. Tip - order the Vietnamese ice coffee (SO GOOD) and wait for the ice to  melt. Or secretly sip bottled water from your bag.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0QLe8QU6_OUmdRzv4zsuRw"
  },
  "brlmmSfshH0uC80KbD2fxA": {
    "date": "2/3/2014",
    "text": "I am not a huge fan of Vietnamese food (and Japanese cuisine) but Cafe East came as a surprise. The spring rolls with chilli sauce are yum and prawn soup is definitely something I would go back for. I would not recommend the crispy chicken - too fried and a bit dry.Overall 4 stars and as another review says, dont expect 5-star service. Go there for food.And yes, they have recently started accepting credit cards as well (earlier it was only cash)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_zG4b8DkqrSsSr9hEJV7BQ"
  },
  "EQNGCbaP1mNFCfl4vJoBdA": {
    "date": "3/27/2016",
    "text": "The chicken and beef broth in the pho,  didn't taste like chicken or beef.  Tasted more like salt and sugar..  Wasn't impressed, maybe it was a off night?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X6Q-ivm9-pKZ7i41VEZSLA"
  },
  "0HSVouPNmHYuOu_dLapagA": {
    "date": "7/8/2012",
    "text": "Another gem found through Yelp! Yay! We really enjoyed the scrumptious food here but because of its not so central location, noisy and plain ambiance and for not accepting credit/debit cards as form of payment, therefore, I will only give it 4 stars. For our food, we had Banh Cuon (a pastry with savory meat filling) which was just satisfying to our belly.  For our main, my husband had the Pho Dac Biet, which is a combination of meat and shrimp soup. As far as he can remember, he never had it before so I assured him it is as good as it can be. The broth in that soup was fresh and definitely not artificially flavoured from cube/mix. It was flawless to my taste buds: not too salty or fatty. The noodle was not mushy or over cooked, it was just cooked right comparable to \"al dente\" in italian. As for my main course, I had the Com Soun Bi Cha which is a combination of lemon grass marinated pork chop, meat pie, rice and shredded pork skin. The food was tasty, flavourful and made of high quality ingredients. I cant really seem to fault it. Not to forget the excellent dipping fish sauce they have to go along with all the food there. Hmmmm just yummy to our tummy. We will definitely go back here for more good Vietnamese food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EVMw1XqELLm2Mg-rj2uhww"
  },
  "DaBJj8Q1JYW8nBiBok9bLQ": {
    "date": "7/17/2009",
    "text": "this used to be a small cafe on evelyn street in deptford and seating only 25 or so people.but it's cult following resulted in long queues and culminated in this new location which can accommodate more than 100 people in one seating!when i went for dinner tonight it was packed!and the tables turned over a couple of times whilst we were still enjoying our dinner.unpretentious vietnamese food served with the freshest ingredients.the menu is deliberately limited so as to deliver on fast and good staple vietnamese cuisine.we had 2 starters.firstly the banh cuon, which was vietnamese steamed pastry(cheung fun like) filled with chinese mushrooms and minced pork, topped with vietnamese meat loaf, poached bean sprouts and fried shallots, with a homemade dipping sauce.the pastry was thin and soft whilst the bean sprouts and shallots added a crunchy texture to the dish.nice woody mushroom tasting pork filling balanced delicately with the slightly sweet fish sauce.the other starter was goi cuon, fresh summer roll, with prawn, pork, herb salad and vermicelli rice noodles plus a well proportioned peanut, hoisin and chilli dipping sauce.a prawn and pork combination with fresh herby undertones.the dipping sauce pushed it over the edge with it's kick!as for the main, i went with the bun bo xao.a warm vermicelli salad with herb, pickled carrot, bean sprouts, fried shallots and peanuts mixed with stir fried beef and homemade fish sauce.as flawless in authenticity and as generous in portion as it can be!we also had their iced coffee which was strong and sweet but without the normal dripping apparatus.dessert for me was an icy coconut cream mixture with sweet upsized red bean and chewy green jelly.service was efficient and prices were very affordable.the owner is very hands on and a real perfectionist at work.ample free parking pretty much tipped in favour of this viet joint over those on kingsland road!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gGpLSP9TLXrf4WLiZEhhqQ",
        "caption": "Photo of Cafe East - London, United Kingdom. the building exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gGpLSP9TLXrf4WLiZEhhqQ/o.jpg"
      }
    ],
    "user_id": "2jTqpqHAQnIzIfwHdaOiqQ"
  },
  "ubfCYV3RVpEjUOql5PrD1g": {
    "date": "12/2/2012",
    "text": "Best Pho in London? That was the presumption I carried with me when I arrived into the restaurant. I'm giving a three-star here because I've had better Pho.Let's start with the good stuff. The atmosphere inside the restaurant is really clean and nice - makes you feel like in a slightly more expensive restaurant. The food prices are reasonable. And I find the choices of Vietnamese spring roll amazing and they looked and tasted good. The Bo Bun we ordered tasted really good. Portion wise, it's good value as well. Bad stuff - CASH ONLY! And does not serve tap water (well, I guess it forces you to taste some nice drinks then.)In overall, I think I enjoyed trying this restaurant. It's certainly more authentic than commercial Vietnamese restaurants found in Central London. And the waiter and waitresses whom I think are all Vietnamese made the atmosphere even more Vietnamese. Recommended to those in London who want to try Vietnamese food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NLXgUbUvcFczHWV4cYvSpQ"
  },
  "XufSq01KNm6qtRAN74mU0A": {
    "date": "7/16/2014",
    "text": "Good Vietnamese food in Canada Water area. Efficient service and great food. Would give 5 stars if they upgraded their decor. Felt like a school cafeteria inside instead of a restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIJp5Ayzo9Ve0EOHU-n0kg"
  },
  "7rLHokFEKb88J5v-A8oIaA": {
    "date": "6/22/2017",
    "text": "My friends who housed me during a trip to London are regulars here so off we went for some pho. It's definitely a legit place, no doubt. And the prices are great. I had a spicy pho (not even going to bother figuring out which) and it was excellent. We also shared spring rolls and egg rolls which were great. Very happy with my experience there!Just a warning, there may be a wait but it won't be long and is definitely worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "IzYYPQhr6ylBiBlm8M41xg",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IzYYPQhr6ylBiBlm8M41xg/o.jpg"
      },
      {
        "img_id": "FaUDHIPG92vy0fRy3aDVgg",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FaUDHIPG92vy0fRy3aDVgg/o.jpg"
      },
      {
        "img_id": "7uoivnLezO-ync9m5PpYxQ",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7uoivnLezO-ync9m5PpYxQ/o.jpg"
      }
    ],
    "user_id": "LYOvyedhKD3eqs4dJrp6yQ"
  },
  "Q58fvMfyGIiT4PWl5_TUkg": {
    "date": "10/25/2018",
    "text": "The Vietnamese food is pretty good (probably would've given 4 stars), but I couldn't get over the fact that they refuse to offer tap water to drink. Personally I'd even be willing to pay a small fee for a glass or pitcher of drinking water, but I cannot bring myself to order water in a plastic bottle for absolutely no reason. They have a sign notifying patrons that tap water is not served, and there's a defensive message on the menu to the effect that they are not required to offer complementary water because they do not sell alcohol, but I also am not required to recommend them to friends or ever return to eat.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-MVblqxkRBfsxa4hoEloJw"
  },
  "0sy3nAU7WnCeLAqtwsZ8UQ": {
    "date": "5/25/2016",
    "text": "This is definitely a favourite of mine, authentic and inexpensive.I still think this is the best place for Vietnamese pho in London, having tried several others around London, and good value as the dishes are a substantial size, and feels bottomless.  I have been coming here regularly, especially for their summer roll, it's the best too, with the slightly chili, peanut/plum sauce to dip into, heaven!   Although, it's a pity their size seems to have slightly shrunk in recent years, but I have not found anywhere that does this particular sauce, so have to come back again and again, because the sauce is the right tangy-ness, and not fish oil like other places uses, nor plum sauce that is use for Peking Duck, or aromatic duck. I also especially love the mix of lean rare beef and well done marbled beef with the pho, which comes with a piping hot soup, note \"piping\" hot as so many places seems not to understand the word \"piping\".  Even the cup of hot water or pot of green tea comes so hot that it almost burns your tongue, like a good cup of coffee or tea, which is just short of burning your tongue.  The green tea is also good here as it is flavoured with roasted rice.Another dish that is always good is the vermicelli noodles with sweet stir-fried beef served with a refreshing salad. The taste of the hot and the cold is sublime. I miss their Vietnamese sliced sausages which they do not do anymore.I love the simple, no decor, cream painted walls dining room.  It is just one big room, and tables laid out canteen style. The tables are higher than most normal tables, which is probably what a child feels sitting at an adult table, but I like that, as you do not have to stoop so low to eat from the bowls.  In the summer when they throw open the floor to ceiling windows, and the soft white curtains billowing gently in the wind, it is so romantic and dreamy.A fair walk from Surrey Quays DLR or Canada Waters Tube Station as it is located at the far end of Surrey Quays Shopping Centre, but well worth traipsing all the way down into South London.  There is ample free parking if driving.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "qBvn-ejsExbqV3b8JOxppQ",
        "caption": "Photo of Cafe East - London, United Kingdom. Vermicelli noodles with sweet stir-fried beef and refreshing salad with spicy sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qBvn-ejsExbqV3b8JOxppQ/o.jpg"
      },
      {
        "img_id": "colyhguIkESEvAir6EVzaw",
        "caption": "Photo of Cafe East - London, United Kingdom. Piping hot bowl of lean rare beef and marbled beef with pho and bean sprouts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/colyhguIkESEvAir6EVzaw/o.jpg"
      }
    ],
    "user_id": "NcGrzF4ygFZEOhWIkLdOVQ"
  },
  "1wCYSfUKT2UHxKdhXGCDqw": {
    "date": "10/4/2017",
    "text": "I have to admit that this is the best Vietnamese restaurant I've been to. Reasonable price,  comfortable surrounding, big portion of food, authentic dishes...But today you really disappointed us... we arrived at around 6:50pm and we didn't wait too long to get our seats, which was rare to be honest. Then we had to wait for over five minutes to order our food since there're apparently not enough staffs at that moment, which can be understood.Then we waited for OVER 40 MINUTES to get our main dishes. Even those who came later than us can get their main dishes before us, and amazingly we ordered the same dishes but they got them before us, how come?We've been here for a lot of times even though we live in north London. We're so hungry just because we can't believe the long time we're forced to wait for and this discriminative treating. I don't think we'll come here ever again.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iD-Uo55viR0JIoSkvXdqZQ"
  },
  "VXrpxWrhWyFGgQsh3jkbwA": {
    "date": "10/30/2016",
    "text": "Ended up coming here after an event at Customs House with some friends. One of my friends is Vietnamese and has really high standards when it comes to Viet food.. With good reason! This place however, is not bad at all! According to him, it's pretty decent authenticity wise, although they are missing certain herbs or flavours that he feels should be in there.That being said, it's run by Vietnamese people so as far as that goes it's pretty authentic! The portion size of the noodle dishes are worth it for the price you pay. I had the chicken pho and it was super tasty! I couldn't stop drinking the broth.I just wish they didn't make you pay for water...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYhuZMo5N2EgnMqRL8VeHg"
  },
  "HzqQ6Gxcl5dpZZwByf5_9g": {
    "date": "4/3/2015",
    "text": "This used to be a regular spot for me back in my young days, after bowling or cinema. this was place to eat. It is not so much now, probably because first there has been a huge increase in the number of vietnamese restaurants and second, there was always a long queue and it didnt accept card. So I came back last night, pre bowling dinner, just before the queue started to build up, which was about 6.30pm Thursday. (Glad I did)The service was quick I thought, plenty of staff, and the food came quick. Starters I ordered was my favourite the steam roll pastry 'Bahn Cuon' but it was disappointing, they have reduce the portion size. I can see the price hasnt changed much and there is only one variety still, it was ok, not much filling, and not as presentable as the photo in the menu. Next the main, tried the Pho Kho Cay, which is spicy noodle served dry, topped with chicken and beef This dish wasnt too bad, they have upped the spice level, but loved it more now. Friend's dishes was also good, glad to see they still put the same effort in their mains. However whats with the extra dried fried shallots?, I understand it gives the extra crunch and texture, but the real flavours are there with or without them. The drink 'Che Ba Mau' drink is a must have guys, I think all the tables around me, ordered this drink, its a sweet drink made with red kidney beans, and green jelly with coconut milk over crushed ice - and it looks pretty. I have tried many vietnamese restaurants, and these guys have the right formula. Cafe East is probably how it was many years ago, there maybe some minor changes, but I wouldnt worry about them, its not like they will be short of customers anytime soon. Decor is light and airy, they have a nice terrace for the summer, and have plenty of car park spacing, food is decent, not completely downhill, but I am guessing they didnt need to up their game, they accept card now, but minum spend is £10. prices may have gone up slightly, but so has bowling and cinema prices. Its called 'Inflation' Had my 'Yelp Hat' on and initially was going to give an A-OK, but nope after sleeping on it, I am still a fan of Cafe east. Four stars.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "HXoC5eJ8pueKhG-3AFkMOw"
  },
  "R13s06MQr4dL6tEiviRV_Q": {
    "date": "4/21/2016",
    "text": "Probably the best Vietnamese restaurant in the UK and probably best one outside Vietnam.I was lucky that I moved in to Rotherhithe otherwise maybe I would read somewhere about it but never would bother to visit. It's hard to find this gem. The location is rather hidden for someone that is not from the area. It's basically a building on a huge Odeon Cinema and bowling parking. You either walk here if you are a local, drive, come by bus from London Bridge or take the tube to Canada Water and walk again.So I have been coming here over the years when it just opened here. You can still see most of the original staff working here which is a good sign. The place is closed on Tuesdays and just until recently you could only pay cash and there was just one cash machine around which sometimes was empty. These days they accept cards so a big plus and makes my life easier. The place does not look much, more of a cafeteria then some of these Asian hipster paces in central London or Shoreditch.It gets busy! So arrive early as the queues are long or arrive late as usually after 9PM you can find places. Once I had to wait 40 min for a seat, but believe me it's worth it! The service is quick the card is short divided into starters, pho based soups, noodle dishes or rice dishes. There is no alcohol being served. The starters are wonderful, I love their spring rolls with meat loaf on top and crispy onion. For the mains I do usually go for the rice and pork chop with shredded pork skin which is just simply amazing!!! The other option is Vietnamese curry with chicken. Great stuff! Pho is always my favourite during winter, clear rich broth with tender beef.To summarize you want find a better simple Vietnamese food in London. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zzoO7r15Fav-J4Rxb224RQ",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zzoO7r15Fav-J4Rxb224RQ/o.jpg"
      },
      {
        "img_id": "pAUyYgj23LOoPzrw0VSMtA",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pAUyYgj23LOoPzrw0VSMtA/o.jpg"
      },
      {
        "img_id": "mbwcWc2_y76ImnCirroqVg",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mbwcWc2_y76ImnCirroqVg/o.jpg"
      }
    ],
    "user_id": "f1jLrVvmYTXUDPugauZkwg"
  },
  "Kd8wQRTCHutFBtIpfzljJQ": {
    "date": "3/16/2017",
    "text": "My husband and I love this restaurant.  We have been eating here for many years.  I love the consistency of this place and the food is delicious with generous portions.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WsPTESjrAJfDD4SbjPvkgA"
  },
  "5jmeqU5DYi7bw1-wBJAaJg": {
    "date": "3/10/2015",
    "text": "I love Vietnamese cuisine. Cafe East has fantastic Vietnamese cuisine.It's not really a place where you would imagine finding great Vietnamese food but if you get out of Canada Water, walk past the shopping centre to the theatre, you will find in a corner plaza, an adorable cottage looking establishment that sells delicious Bahn Cuon and Pho.Regardless of whether you prefer dry rice noodles, broken rice, or a good bowl of pho, please make sure that you get the Bahn Cuon - it is the best I have ever tried between San Jose, Paris, and London (it's quite unfortunate I've yet to visit Vietnam for real deliciousness). For the main, I got the pho with the cooked fatty beef (mmmm my favourite). Unfortunately, when they asked me if I wanted it spicy, without much thought I had said yes (no one has asked me if i wanted my pho spicy before). It turns out that they had this spicy oil to the soup, which completely changes the flavour. The flavour is still good, but I gave my friend's bowl of pho a try, and he has the right original and I have a heavily modified version. However, with some added lemon and other garnishes, it turned out to be quite good anyway. Next time I definitely will stick with the raw chili for spiciness.Some stuff i'm not completely used to:1. They don't serve basil with your pho - they do all the other garnishes but just not the basil2. There was no sriracha or seafood sauce, which i usually eat with the beef3. I was not thirsty after the meal4. The iced coffee did not come with a vietnamese drip filter. It was premade and poured on ice with plenty of condensed milk.One serving of bahn cuon, two servings of pho, one bottled water, and one iced coffee totalled £28.30. They take credit card for amounts over £10 . The interior is clean and bright. Service was not bad and really rapid but we also came on the off-hour at around 3pm on a Saturday. They don't open between lunch and dinner time on weekdays.I'm so happy this place is not far from me so I can come often :D*EDIT: 22/03/2015 - Came here again and tried the bun and and the broken rice with lemongrass pork chop. The dry vermicelli was great and the pork was really good, but they skimped on the meat and noodle and has mostly salad. The porkchop was not very good. They also don't serve tap water and charges 2.30 for bottle only. I am dropping this from Five star to Four. I still love the banh cuon, the pho, and the coffee, but the rest is kinda meh.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "HyXK2GNR9i4SWpLQGOqQYQ"
  },
  "4ny_Srd5cp6FXcZqFz_7-g": {
    "date": "4/10/2015",
    "text": "Best pho I've ever had in London. Very down to earth ambience and solid food. 1) Broth was quite authentic 2) The well-done briskets of beef were perfectly cooked 3) Chilli peppers were genuinely spicy and added a kick to the overall flavour of the broth4) Portions were great Service was also good -- prompt and efficient. They seemed to accept cards too which was a surprise, because I had read reviews that they don't. It's a bit in the middle of nowhere location-wise, but it's worth the 10min walk from the Canada Water station for a great pho experience!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "ndVVi21EPfS7Zszir7uSXg": {
    "date": "5/12/2015",
    "text": "A good Vietnamese noodle! If you dare to try hot stuff (not just spicy) they have some good selections. Long que.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RznAPPzGZbtlNXJuh-yxTg",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RznAPPzGZbtlNXJuh-yxTg/o.jpg"
      }
    ],
    "user_id": "jOoSIHM97tRGWe_DxiKmZQ"
  },
  "HaWe1YU_5vb0wqBhmL6csA": {
    "date": "5/23/2014",
    "text": "Menu No. 1 item Bahn Cuon is must-order!!Original Pho quite nice, probably the best pho in neighborhood.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "vHKfz7XqYdDPvk_wyxi9AA"
  },
  "k8pzqTCmQ6yE1i79qgrAtA": {
    "date": "11/9/2013",
    "text": "Cafe East. Very properly named since it's WAYYYY east. I got out of the station at Surrey Quays and started following my maps to Cafe East. For a second I thought I was back in America. What is this? A parking lot?! Oh. My. God. It was a legit parking lot. Like you know, where you could park like a lot of cars. Whoa. That's how far East I was...Anyway, Cafe East is all the way in the corner. Away from the big building. It took me a while to find it. When we finally got in there, I was surprised. This was like some secret Asian hideout. The restaurant was full of Asians! And you know what that means... this place was legit. The menu was limited to pho, a few appetizers, and a few rice dishes. I ordered pho and I have to say that it was the best pho I've had all year in London. It still doesn't hold a torch to the pho in Cali, but it was pretty damn close. Service is just what you'd expect from a traditional Asian restaurant. They'll ignore you until you flag one down. It's a bit of a trek to get there from Central London, but if you're looking for pho that's the real deal, Cafe East is the place to go.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "LsubCN_NhucLShb9m69VLA",
        "caption": "Photo of Cafe East - London, United Kingdom. Spring Rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LsubCN_NhucLShb9m69VLA/o.jpg"
      },
      {
        "img_id": "3ofGcyEj1iF4YR3jWEW8OQ",
        "caption": "Photo of Cafe East - London, United Kingdom. Pho Tai Chin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3ofGcyEj1iF4YR3jWEW8OQ/o.jpg"
      }
    ],
    "user_id": "3jjiY5D7oIlKeiCIZGHQew"
  },
  "d8zbeAkqGwCs98xJtio40A": {
    "date": "6/4/2014",
    "text": "Went to cafe east for a quick late Saturday night meal.  Since my last visit of over a year ago the standard of the food has declined and portion sizes reduced.  We both chose the combination Pho consisting of a few pieces of tough boiler chicken, 2 prawns and a few scraps of beef.  The beef broth did not taste of beef at all it just tasted sweet as if vast amounts of sugar had been used for the soup!  Both the spicy and non-spicy versions tasted sweet!  The noodles were rehydrated dried noodles, cafe east used to serve fresh noodles.  Sadly the quality of ingredients seems to have deteriorated to achieve cost savings.For decent Pho and better customer service go to Mama Pho in Surrey Quays at least they do not charge for takeaway containers and the menu is virtually identical.One improvement at cafe east is that they now accept credit cards for transactions above £10.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fVdVzQl1hHSHkgnoEROl8w",
        "caption": "Photo of Cafe East - London, United Kingdom. Chinese herbal drink",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fVdVzQl1hHSHkgnoEROl8w/o.jpg"
      },
      {
        "img_id": "XPt81nosVpGGY62JfAfUZg",
        "caption": "Photo of Cafe East - London, United Kingdom. Spicy Combination pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XPt81nosVpGGY62JfAfUZg/o.jpg"
      },
      {
        "img_id": "HMCMHDlS8mnrni-3wIECXg",
        "caption": "Photo of Cafe East - London, United Kingdom. Combination pho non-spicy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HMCMHDlS8mnrni-3wIECXg/o.jpg"
      }
    ],
    "user_id": "5Px3GyYgFyhXwsejZrdfMQ"
  },
  "FJtlq1v3YLAglANhMQdn9Q": {
    "date": "9/15/2014",
    "text": "(Jan 2015) I had originally given Cafe East a rating of 5 stars in September but my recent experience has left me astounded and feeling the need to have to update my review. I was in a group of 8 people and although we were seated within around 10mins of arriving (which is not bad compared to my past experiences of waiting for a table at Cafe East), upon ordering our food we were forced to wait over 30mins for any starters to arrive, whilst everyone around us (even those who had arrived later) received their food (including what we had ordered). The only explanations our hungry table could fathom is that either our waitress hated our guts or they had lost our order. Mindless of their crimes, when we had asked multiple other waiters where our order was the reply was that they were busy and that our starter is hard to make (despite how we had clearly seen many other tables being served the starter we had ordered. Also during this visit, it seemed as though they were being stingy with the portion of pork in their vietnamese rolls and my pork chop was far too dry. A very many somethings has gone wrong here.(Sep 2014) Authentic Vietnamese food; neither lavish nor basic, Cafe East has all you could hope for with regards to Vietnamese cuisine. The menu is self-explanatory and accompanied by mouth-watering photos. The dishes are certainly bursting with flavours; bringing together fragrances such as lemongrass, vegetables such as parley and other untold spices to make impressive bombshells to your tastebuds within a meal. The portions are generous and even the starters well filled with attention to detail. The only qualm I have about Cafe East is that its name does not do it justice and it only has one option by way of desserts, but then Eastern restaurateurs has never really excelled at these 2 factors anyway. Beware that Cafe East always has a queue so reserve beforehand and visit on an empty stomach so that you can fully capitalise on and enjoy the masterful food presented to you.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "26UhRvQRzFtz0QvdTm0flQ",
        "caption": "Photo of Cafe East - London, United Kingdom. Com Suon Bi Cha. Lemongrass pork chop, meat pie and shredded pork skin, served with boiled rice, cucumber, pickles, fish sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/26UhRvQRzFtz0QvdTm0flQ/o.jpg"
      },
      {
        "img_id": "xca7Ab2BPYUCcFRZmeJROg",
        "caption": "Photo of Cafe East - London, United Kingdom. Starter number 1, which apparently is difficult to prepare and they can take a long while to make it",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xca7Ab2BPYUCcFRZmeJROg/o.jpg"
      },
      {
        "img_id": "fFdFs70R6wjgq7y5KJSHqQ",
        "caption": "Photo of Cafe East - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fFdFs70R6wjgq7y5KJSHqQ/o.jpg"
      }
    ],
    "user_id": "gFxXMw3jn_gc-D-aY6mrMg"
  },
  "1dyVecJvV4OazeEIpEFrvw": {
    "date": "3/30/2014",
    "text": "I can't love this place.There is no sauce on the tables and I can't take a pho place that does not offer tripe/tendon seriously. Pho dac biet should never be beef, chicken, shrimp. The banh cuon was good, and probably the only reason to come here over another Vietnamese place. I also had the bun thit nuong cha gio and it was fairly standard. I wish there was a bottle of sriracha on the table because I love turning my vermicelli red.A trek to get out to, but walking through the parking lot of a dead strip mall is pretty cool.I'd rather get my pho fixin' at Song Que.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VjeFy7ZMWJV6d3v1f-A2Yw",
        "caption": "Photo of Cafe East - London, United Kingdom. bun thit nuong cha gio",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VjeFy7ZMWJV6d3v1f-A2Yw/o.jpg"
      },
      {
        "img_id": "5bqlWZiqnopWLuLW1VFHtA",
        "caption": "Photo of Cafe East - London, United Kingdom. banh cuon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5bqlWZiqnopWLuLW1VFHtA/o.jpg"
      }
    ],
    "user_id": "6hXxFDDcIVrYUWKkYpOnUw"
  },
  "SKvthpVS5QD5fuO47me7iA": {
    "date": "10/15/2013",
    "text": "I came here for dinner with three friends. We collectively ordered:- BAHN CUONSteamed dough, filled with minced pork and mushrooms, £5.50- PHO TAILean rare beef with flat rice noodles in a delicate soup, £7.00- PHO GASpicy chicken with flat rice noodles in chicken stock, £7.00- COM KHAULemongrass pork chop, served with boiled rice, fish sauce, and cucumber, £7.50Portions were good sized, prices were affordable, and the food came out fast. Also on the plus side, the place was full of people, many of whom were Asian, which tells me the food must be good. Despite it being very full, we were able to get a table for four with no wait (on a Wednesday night around 8pm).On the down side, tea is £1.50 per person. (But they will refill your hot water for free.) Also a downer, the \"spicy\" option for my chicken pho was not spicy. (But it was still delicious.) Also, the service was spotty. Lastly, I'm lactose intolerant, and when I asked if I could order the coconut and bean dessert which says it contains \"coconut cream\", the waiter couldn't tell me if it actually has cream in it or not, even after visiting the kitchen. But I was too full for dessert anyway, so that worked out ;)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IDCVIPzpUCuT8Vwxct9jYw"
  },
  "WBEoHWo1bUT715_VVhImvw": {
    "date": "2/28/2014",
    "text": "Cafe East, sooo yummy.When you hear people talk about Vietnamese food in East London, they will inevitably say, 1) Mama Pho or 2) Cafe East. Why? Because it tastes so nice, it's easy to get to (close to Canada Water and Surrey Quays station), it has parking outside, and it's close to other shopping places and a bowling alley and a cinema. Really???The menu doesn't change much. Not seen any seasonal offerings, so you know exactly what you are going to get here.My favourite dish is the Bun Ga Nuong - Fine vermicelli noodles topped with crispy chicken. Served with cucumber, herb salad, pickled carrots, molly, peanuts and fish sauce. It looks like it's going to be dry noodles, but it really isn't. You have delicious sauce to pour over it, and have fun mixing the ingredients and it tastes just amazing.Order a sweet drink in the form of Sam Bo Luong and I guarantee you will come back again.The lesser aspect is the queuing. If you come here around 7pm at night it will be packed. If you come here a the weekend it will be packed and you will have to wait. Phone reception is funny inside and sometimes you will not get any. The portions have also gotten slightly smaller in recent years and the prices more expensive. Oh well, it still tastes good!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fKWn0J0eTeSQRkOlqlFgPA",
        "caption": "Photo of Cafe East - London, United Kingdom. Bun Ga Nuong- Vermicelli noodles with crispy chicken + cucumber, herb salad, pickled carrots, molly, peanuts and fish sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fKWn0J0eTeSQRkOlqlFgPA/o.jpg"
      },
      {
        "img_id": "F2H9DwLVFmTmRoiZr0C66A",
        "caption": "Photo of Cafe East - London, United Kingdom. Sam Bo Luong - Traditional Chinese herbal tea drink. Deliciously sweet with refreshing fruits and jelly.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F2H9DwLVFmTmRoiZr0C66A/o.jpg"
      }
    ],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "3FeioOFw2exHvzpzLcnhow": {
    "date": "11/7/2011",
    "text": "Great for...Large parties, Generous portions! Quick service.But best of all.... Really good food!  For good food I will put up with the curt snappy servers because that's ok I know that's just part of your efficient asian nature.  Slightly stereotyping but I'm allowed. =PBest Pho in London thus far, fast and Hot!  Lovin' it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FPhdmqyxIDuKzaQ4bjhj0w",
        "caption": "Photo of Cafe East - London, United Kingdom. Generous portions",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FPhdmqyxIDuKzaQ4bjhj0w/o.jpg"
      },
      {
        "img_id": "SrjSP--T5wp9bmWAUrSNAg",
        "caption": "Photo of Cafe East - London, United Kingdom. Great pho broth",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SrjSP--T5wp9bmWAUrSNAg/o.jpg"
      },
      {
        "img_id": "8g3dmyIlyhX3D5aGw9U0-Q",
        "caption": "Photo of Cafe East - London, United Kingdom. Meatloaf?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8g3dmyIlyhX3D5aGw9U0-Q/o.jpg"
      }
    ],
    "user_id": "dsu43n2DOR_pB07P1sOOZg"
  },
  "_eOt6qFQpAlS3cGGvSF7RA": {
    "date": "6/6/2013",
    "text": "A really random location, but the pho is delicious, and the portions are extremely generous! If you're ordering a bowl of noodles each, you can order a starter to share between two.Be aware though that no cards are accepted, only cash. They don't take reservations for tables below 6 people, and this place fills up quickly, so you might have to wait.They do excellent drinks - coconut water with the coconut flesh is my favourite, and also an \"ice kacang\" style drink.Difficult to get to by tube/public transport, but if you're driving there's a massive free parking lot next door.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  }
}