{
  "Qf_oyH52tebm2SVf3d8l3Q": {
    "date": "4/30/2009",
    "text": "A must for me whenever I'm in London. This family-run Italian restaurant makes you feel like one of the family. Inside can get a little noisy, so sit outside on their tented back patio. The twinkly lights there make it feel like it's a special occasion no matter when you go. I love everything there, from the grissini and (real!) butter they place on your table instead of bread to the fried zucchini to their homemade pastas.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-LEHwdDxloo4OA1I2IrbQ"
  },
  "D6bOrWjdP0mgRYKaH59iVg": {
    "date": "10/6/2010",
    "text": "Very authentic Italian restaurant. Italian staff and amazing Italian food at a very affordable price. Cannot recommend enough.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "scEF9KSMNbikT7HoDLAobg": {
    "date": "9/26/2007",
    "text": "Lovely family run italian restaurant. Starter, main course, dessert, wine = £40",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UNXUJJZf5IH6rKiwA_qPrQ": {
    "date": "9/6/2010",
    "text": "HORRIBLE STAFF ATTITUDE - good food Booked by phone, hostess insisted abou 5 times that I give my surname rather then first name. Only when she saw that I might change my mind and take another restaurant, she accepted the booking.Arrived at 8pm on a Saturday evening. Cute restaurant, nice atmosphere though half empty on a Saturday night in the heart of Chelsea, atmosphere looked promising. Been sat on a nice table, not too close to the neighbour, breadbasked on the table already. Bread dry and not definitely not home made, grissini sticks nice touch and the olive butter heavenly. Only when the menus arrived we saw that the breadbasked was £ 1.80 per person. Don't mind paying for it, but in this case I felt cheated.Good menu with promising dishes. Food was excellently prepared. Description of the wine was lousy, did not reach to the expectations.Waiters were something between 30 and 60 yo. Normally you'd expect a great service from people that age (like the guys in La Brasserie in South Ken), but there was no interaction at all, most of them looked horribly grumpy.For main I ordered grilled Sardines and after having had in Italy many times grilled Sardines, I expected small fish with soft bones, where bones were no problem. The waiter took the order without any comment. Fish arrived, 3 big fish, about 15 to 20 cm. Full of bones, very difficult to eat. After giving it a go with the first fish, I gave up and called the waiter. Explained to him that these fish are impossible to eat. In a very friendly tone. He took a snotty look at me, said he will call his colleague. An old gentleman came, asked me what the problem was. I explained, he kept interrupting me, told me that I am wrong, I didn't have Sardines in Italy, their way is the only way to prepare Sardines. He didn't want to have my feedback and I insisted that he takes the fish back as even after filleting it correcly myself it was still inedible. Again a snotty look and he took the plate away without so much as a sorry. The attitude of the hostess, the snotty waiter, the attitude of that old guy who wasn't able at all to handle complaints completely spoiled the dinner for me. We wanted to have desserts and as usual coffees after dinner but after this poor experience we just paid the bill (2 starters, 2 mains, breadbasket, water, half bottle wine £ 67) and left. Of course, they did not remove the fish (£ 10) from the bill.What a shame. Good food, nice decor but we will certainly no go back and this is due to the attitude of the staff. The restaurant is around for already 40 years but it was half empty on a Saturday night.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8EvSl0RDGOUCCMZ99UO45w": {
    "date": "7/5/2012",
    "text": "Excellent food, big portions, and not too expensive!  What more can you ask for?  Very authentic Italian with a modern flair.  Do not sit in the back room if you are over 30...you won't be able to hear yourself think!  Front room is very nice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "04GjMhZhhYTnIcpS2YoP2A"
  },
  "nYylTibbsFkphilDi6aOiQ": {
    "date": "7/4/2014",
    "text": "Great service, good pasta dishes.   Kids welcomed.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gHKBc2JxwRrXP4IDDDjhg"
  },
  "E0UdkRY1PEuNOyVvx5aKtg": {
    "date": "2/20/2010",
    "text": "This is one of the best Italian Restaurants in London.  The place is very tight and the service is a bit \"Italian\" but overall it is excellent.  It is in Chelsea so a black cab home can be a bit difficult, but I am finding that there are some privates around...Fried Calamari is excellentGreat Traditional Dishes... Recommend...NOT FOR KIDS REALLY....",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "84kmMEVDmMWWmTVe959p4w"
  },
  "VrJVDC4vgLRVfAbVbQrYHg": {
    "date": "2/3/2009",
    "text": "Who doesn't love the pleasures of eating good Italian food? This London restaurant specializes in Tuscan delights, such as amazing risotto al tartufo, mouth-watering polentas and the Florentine-favorite trippa alla Fiorentina. The fiori di zucca will send you over the moon. The typically ubiquitous Tiramisu is anything but prosaic here! The wait staff is really from Italy and delightfully flirty and very attentive. It is a charming location for a date, or to celebrate an anniversary, birthday or graduation...  as for me, I go because it is FABULOUS!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LemDESTKgAfeTiHOaE08jg"
  },
  "lfNV0e437wC18Z5w-lXS_w": {
    "date": "1/11/2010",
    "text": "My most favourite restaurant, and a Chelsea institution. I order something different every time- and it is always delicious- right down to the olive oil.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AWjs2HFQtN39tCJuL9W3dg": {
    "date": "9/27/2009",
    "text": "Been delighting diners for years. A little bit of Tuscany in Chelsea. The food is memorable.The service is excellent (I left a huge tip)The desert trolley is worth saving space for. Not the cheapest of Italian meals, but certainly one you'll remember for a very long time.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kLTJiHPUb2FGoEJwKayDJQ": {
    "date": "4/17/2013",
    "text": "great, authentic italian food and reasonably priced.  deserts were stunning.  if you get a table, get it at the front of the restaurant - the back lacks a nice atmosphere",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtc-_ItNFE7GCddADBR34Q"
  },
  "pbkg8OqmAjZFtMDmt5-Kqg": {
    "date": "2/9/2010",
    "text": "A lovely place for dinner. Excellent food and service. I love the place. Ideal for a date!Staff was perfect in finding the right balance between discretion, advice and doing their work. For less than £60 for an excellent dinner with dessert and wine, totally worth the experience.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "LInGEhUs3xKIJ1qK-kr5uw": {
    "date": "5/23/2009",
    "text": "A nice cosy Italian restaurant that offers an excellent selection of top quality seasonal meals. Their mushroom risotto was certainly among the best I ever had and the seafood starters I tried were all excellent as well. The duck flavoured with the delicious sweet sauce for the main was also outstanding. There is generally a good variety of pasta and other meat dishes on offer too. And the tiramisu for desert was truly exceptional, producing sweet overtones at just the right level. And while the general setting is fairly simple, as one would often find in family run Italian restaurants, the quality of the food and the attitude of the very friendly staff generate a very pleasant atmosphere. Overall, this place is probably among the best one can find for high class authentic Italian cuisine.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bENmL9LGkr7uXPeo4-mtqQ": {
    "date": "6/23/2011",
    "text": "Great fun, busy restaurant with good food in a nice area.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NnCC-giq7QsWZZsmFPTZfA": {
    "date": "9/17/2007",
    "text": "Probably one of my favourite Italians in Chelsea/Kensington; wonderful traditional food, mostly from Tuscany.Pasta is usually divine, and La Famiglia does a fantastic rabbit. If it is on the menu, go for it.Also try the risotto, and the heart-warming soups. Best go with a large group of people - so you can taste as many dishes as possible.Leave room for desert if you can. Only one word of caution: can get a bit expensive.Book - it does get quite busy. It is also a favourite with a number of celebrities.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EqYp_oRURS4rOpUyoxTohw": {
    "date": "3/15/2011",
    "text": "La Famiglia is lovely, but you do get the feeling that the regulars get the Rolls Royce treatment, and everyone else gets Skoda. Allocation of tables is just one example where I suspect this happens. The food is expensive but it's good. And you really do feel like you've been transported to Tuscany when you go there.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I8spdaRYd324MDi_LAafcQ": {
    "date": "5/19/2008",
    "text": "Best Italian in town I love it.Great with kids, great for a romantic meal. Fab staff",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aX3X4zujLzLefOAunl9krQ": {
    "date": "10/29/2009",
    "text": "I've been going to this restaurant for 20 years but I won't be going anymore. Perhaps it's because I had terrible service - bordering on rude - despite having been a faithful customer. Perhaps it's because the food used to be so much better. Or, more to the point, I've recently discovered a fantastic neighbourhood restaurant that's everything that La Famiglia used to be in its heyday and more... but I'll keep that little gem to myself, so as to make sure I can get myself a table ;)",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wtQ6CEe8i1OtxKZBft7kiQ"
  },
  "9PFPSGlOKk1y84XyufkR5g": {
    "date": "6/9/2010",
    "text": "Tucked on a nondescript side street off the King's Road in the no-man's land between Chelesa and Fulham, this well-regarded Tuscan restaurant has been serving the neighborhood (and beyond) for over 40 years.  The decor is warm and inviting (but unpretentious) and in the summer time, tents are mounted in the back to accomodate more diners.  As for the food, a number of items are excellent, and some others are more so-so.  I would highly recommend the papa al pomodoro, pappardelle al cinghiale, nodino di vitello al porcini.  Some of the other items I've tried have been inconsistent.  Antipasti will run from £5-10, primis from £8-13, and secondis from £12-20.  Definitely worth checking out.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kE-0CmhkXRnpD1NZDawBfQ"
  },
  "3womWb1sKdDT-2A6-ViSGw": {
    "date": "1/21/2010",
    "text": "Probably one of the best Italian in London, great food, excellent service. Very traditional menu, mainly influenced by disches from Tuscany. A great place for romantic dinner.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-86LFVjqIGteiwz-d4AiCQ": {
    "date": "5/26/2008",
    "text": "One of my favourite restaurants in London. It's classic Chelsea with a Tuscan tradition that is - and feels - genuine. We are greeted with a smile, taken to a table even without a booking and from then everything goes well, great service, nice table, nice traditionnal decor with pictures of the Family hung on the white walls all in white and blue tones, and fantastic food. The menu is classic Italian Trattoria (no pizza) with strong influence from Tuscany: great pasta (I recommend the wild boar pappardelle), meat (rabbit is great) and fish (sea bass). This is a wonderful place for a family lunch over the weekend, particularly if you have young children - they will be very welcome and feel at home. In the summer they have a great terrasse at the back which feels like being away in the South. Not exactly cheap but fair for the food and location (lunch for 2 plus 2 children was £100). Good for a romantic evening or a dinner with another couple of friends too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "op_vXsGFx0v0NLhDJwyV0g",
        "caption": "Photo of La Famiglia - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/op_vXsGFx0v0NLhDJwyV0g/o.jpg"
      },
      {
        "img_id": "TwffvC8oIZutGj6lbMGlGg",
        "caption": "Photo of La Famiglia - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TwffvC8oIZutGj6lbMGlGg/o.jpg"
      }
    ],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "ckpPDChKEos0p_DGhFa6DQ": {
    "date": "9/16/2007",
    "text": "A West London institution, renowned for many years as providing great traditional Italian food. Based on the classic trattoria approach, the menu is positively brimming with virtuallly every type of Italian dish - be it Antipasti, Primi, Secondi or Dolci courses. In fact my one criticism is there's too much choice - the menu is too crowded. Anyway, being based in Chelsea its invariably a bit pricey, but not too much. Panzanella Salad, Risotto, Seabass, Mackerel & Lamb dishes all come well recommended. Plus joy of joys they have a sweet trolley!! Service is attentive and the staff are friendly too,",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TutYYbNz8KEmduPO7LC7lw": {
    "date": "11/15/2008",
    "text": "A part of Italy in Fulham, this really fels like an italian trattoria transplanted to Fulham,Real wholesome Italian food, attentive waiters, no pretentiousness, I felt like I was in Tuscany, and sensible prices, i believe the've been there 20 years and you can understand why, And the Angel hair pasta in truffle sauce was heavenly, Go and enjoy",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oT_cqCvNo0wKPkyLxlgFUQ": {
    "date": "2/18/2011",
    "text": "My favourite restaurant in London. The staff are charming and attentive so I cannot understand the bad reviews of this very traditional Tuscan establishment, but what I can say is that if you don't like garlic then ask for the dishes without it or don't go to an Italian restaurant. The beef tagliata and the grilled tuna are my favourite dishes - absolutely delicious and if you don't want to spend a lot of money of wine then the house wine is very good. Will go back again and again...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fbN5tMZ1PTHihH9hOucUww": {
    "date": "7/12/2018",
    "text": "My first trip to Europe , first time to London, first time trying real delicious Italian food. I must say the people who work here are very kind very professional and also know how to make you feel like family. Our waiter was a very kind young male who served us delicious dishes and had great conversation and service. I ended up trying the Carbonara and it was out of this world. They also had delicious bread sticks and an amazing Olive spread . I give this place 10/10 on food, service and just being hands down delightful. Thank you guys for being so welcoming to me and my family . Salutes from Los Angeles, California.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HuT_dRk4c_1BrQPMaOMf3w",
        "caption": "Photo of La Famiglia - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HuT_dRk4c_1BrQPMaOMf3w/o.jpg"
      }
    ],
    "user_id": "oyCEf3t1_oThPmjW-J1IyA"
  },
  "vMOTxi2w_HpcwzhjtDBd9w": {
    "date": "7/11/2018",
    "text": "Delicious Italian food, in a quiet outdoor patio.  No specific gluten-free menu, but gluten-free bread and pasta were available for many entrees.  Good wine menu, as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bz523N1yVdbNSIm1Icc8QQ"
  },
  "NwAIUVVIvr2XhmVNrFfvLQ": {
    "date": "6/19/2018",
    "text": "La Famiglia was recommended to me and I was surprised to realise I lived right around the corner. I wasn't expecting much from an Italian resteraunt in London but it surprised me. We have come back many times and the food is always excellent. I have tried numerous dishes and I'm always pleased. That said the portions could be a little larger and the service a bit better but you could say that about many places in Chelsea. We will continue to come back particularly in the summer when you can enjoy the garden seating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PLK00Nh6VWpSWU32u-fVQ"
  },
  "PjUdpo43KMDlwZdpHQJznw": {
    "date": "11/8/2015",
    "text": "So you know that feeling that you get when you're on a euro holiday and you have to stop at the closest restaurant because the person that you are travelling with is getting hangry (angry because they are hungry) and this particular restaurant that you have stopped at just happens to be on 'grand place' tourist trap rip off danger zone? Well that's how I felt going to this place. First WARNING sign: there are no prices on the online menu. Second WARNING sign: there are bread sticks in plastic packets.Third WARNING sign: they offer you sparkling water only and you must INSIST on tap water. fourth WARNING sign: The menu is soooooooooo long. Fifth WARNING sign: oh yes we do corkage. BANG. £25. and last and final WARNING: £1.95 per person cover charge. Weird.Also I have a bit of a thing against white table cloths. And it's full of the things. The staff are pretty attentive but in a weird sleazy way. We got told about the affair that our waiter is having with a married woman. Then he proceeded to undress my friend with his eyes. Seriously.The menu offers you pretty much all of the items you can think of when you close your eyes and think of Italy. The pasta in a 'large' size is not really that large and will set you back around £14-16. It's well cooked and flavoursome but lack some serious colour/herbs/anything green. The risotto was nice. Actually everything was nice. But nice in a cafe on a high street way, not in a fine dining way and you are paying borderline fine dining prices. Meal highlight: we got a whole bowl of cheap packet parmesan to sprinkle as we please over our meals. To be fair, the wine list does offer a lot of wines between £20-25, but they a little on the pub wine style of things. Meanwhile, they have a dessert cart.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onJgko2C3WB5XLqYHqD2MQ"
  },
  "zRKckinWjXSRU1K2cg412A": {
    "date": "6/29/2014",
    "text": "This place looks good from the outside but I have to say our experience left much to be deserved - we were seated in the \"tented garden\" section at the back where the temperature varied (wasn't a warm night even in June) and the noise level was high.The sardines did not seem fresh to us with no aroma and no flavour although the sea bass was very good if a tad cold on the plate (always better to have cooked food placed on warm plates).The big issue was unfortunately it took an hour to get our main courses (by then we were willing to leave without eating) apparently because they were busy, but the chef who came to apologise (as did the waiter & the manager) advised the ticket fell on the floor & got lost.So they tried to recover the situation but we will not be returning....",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDm_mrM67g-U-TxfFdrLew"
  },
  "uCC9ylVE_qHf4yLFs2LdRg": {
    "date": "11/27/2014",
    "text": "I have been coming to this restaurant since I was a baby. I am now 35 and have eaten 100s of times at La Famiglia. It's great in every way and never changes... long may it stay exactly as it is!The food is superb, staff always friendly. A good atmosphere, lots of locals which I like. However big and trendy London gets, this part of Chelsea still retains a local atmosphere, which reminds me of my childhood. La Famiglia is especially great for this along with some other places such as PJ's on the Fulham Road, another Chelsea institution.La Famiglia is simple and uncomplicated. Does what one would expect and does it very well.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAUoruIY3TyBATcPQ2-sgQ"
  },
  "j641YeZFxus90AgbjV6Fgg": {
    "date": "12/19/2015",
    "text": "An affordable restaurant in Chelsea. No, you read that correctly. It's not science fiction. Fine Tuscan food. I particularly enjoyed the lamb. The dessert cart is stunning. But what sets this restaurant apart is the exceptional, friendly, and fun service. There were three children of various ages in our party, and they were treated with respect and warmth. (I saw children in other parties treated similarly.) I recommend this convivial, modestly priced eatery.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xr9YUm5EQkTBi8dFGDm3hQ"
  },
  "Y3SVmFwDAVM3C2Q0VdkP8g": {
    "date": "8/10/2015",
    "text": "I love this restaurant. Located on a quiet street in Chelsea. Authentic Italian cuisine, wonderful food, and warm, down home service.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LoUz5xXiV4mlSMFctjCUtw"
  },
  "gc7AnqjOSNOl1az68SGlzw": {
    "date": "1/25/2016",
    "text": "A very  warm  and friendly place full of Italian atmosfhere providing deliciuos food ! I was there several times in different years and each time It was Superb! Just looking  forward to going back asap!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VE8liyd_IU3c9hr8kQE3mQ"
  },
  "2RYv-fstn_Hc2PahXvnf6A": {
    "date": "6/27/2014",
    "text": "La Famiglia strikes me as a place that was once a London hot spot. It has the charm of an authentic / cheesy Italian restaurant, and the servers all have an incredible amount of character and couldn't be nicer!As for the food, we got two dishes, spicy tomato penne and pappardelle with wild boar sauce - both were fine, but not impressive. The black olive spread served with the bread was delicious, but the bread was a bit boring.Another knock was the cover charge that showed up on our bill - I can never understand why I am paying a cover when we are paying for our meal. One other plus in addition to the service was that they do offer a few gluten-free pasta options.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uZ_y3gL63fJ843L53UW_XA"
  },
  "nt_uq_UbI2_hf9iNLcmTJQ": {
    "date": "11/24/2013",
    "text": "I like La Famiglia far more than I should. They have 2 'rooms'.  One, a normal if slightly tired front space, and the other, a heated tent.  The front is reserved for regulars and the ghosts of celebrities who used to frequent many many years ago, but whose legacy is rememberd freshly by the staff (who behave as if it is still a haunt of these long dead, long forgotten celebs).Food is really quite excellent for a neighbourhood Italian, and if the plating and presentation were improved perhaps would be fine enough to be served somewhere 'good'.  However, the tent room is a dump and the servers are utter assholes.  It's reasonably cheap, and the food is good.Go, but expect to be treated like shit, and if you're anything like me, be a complete prick back to them, and enjoy the animosity (and the very good food).",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "p6DJPyp-2wnO3BH_Nh4vOQ": {
    "date": "9/16/2011",
    "text": "I've never ever in all my experiences had a server as accommodating who went above and beyond, and also the food was really very good. I dined with my aunt who is allergic to both Garlic and Onions, which makes it close to impossible to find dishes without either so there's always some sort of negotiating that has to happen. That being said, she's pretty flexible. But I digress, she ordered a salad and didn't like some of the ingredients which came up to about 1/3 of the salad. The waiter came by noticed she hadn't eaten all her salad and offered to bring her more greens and more of what she liked. Then our starters came out. I had the boar pasta which was divine. It tasted like a dish someones grandmother spent all day preparing. I then split the boar meat dish with my hubby. I wasn't wild about it, but it was cooked perfectly and it the accompanying side dish was lovely. By then I was in boar overload and he ate most of it. Also, I did have a glass of the house red and it was pretty good too.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "VFKcICva1TX6gHKt7q80xw": {
    "date": "2/19/2013",
    "text": "I have very mixed feelings. Positive: - The people are typical (as far as I am concerned) Italians. I quite like that. they were really nice and I think the service is good. They seemed a bit stressed but it was Valentine's Day so I am guessing they had a lot to do.- The restaurant itself is nice. It is not too posh and we felt really comfortable. - Desert (Canoli) was delicious.Negative- Table is really small- Portions were really small- They charge for all the stuff they put on the table (bread, olive paste, and they include a service charge, per person)Just FYI: For two mains a bottle of wine (middle range) one starter and one desert we paid £81. Food was alright but not special. I am not going back there. Too expensive for what it is.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BK8lKbxXo_8IxA-O7s0xSg"
  },
  "17ZHwCRN55v61s6seoP8rg": {
    "date": "11/15/2010",
    "text": "It's been said on the grapevine that this is the best Italian restaurant in London. Since I haven't tried them all, I'm going to withhold judgement. Even so, it's a pity that I don't live in Chelsea so that I can call La Famiglia my second kitchen. It's delightfully Italian, warm and inviting inside. It offers simple and classic dishes but there's not need to embellish a good thing. It definitely gets crowded in the evenings, so booking is advised. La Famiglia is tucked slightly away from the main street so you'll need to keep your eyes open for it. The pastas are good, the red wines are perfect but the best part is the dessert cart Oh my, the sweets! If you're looking for a cosy, charming, and inviting Italian place for a relaxing Sunday dinner with friends full of good friend and drink, come to La Famiglia.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "jQEmuUvnfqAlU_Jg0m_SMA"
  },
  "pqEH-1x6bCL4Qx4EpctTqQ": {
    "date": "10/30/2012",
    "text": "La famiglia is a gem. I was taken here for a business lunch having no idea there was a perfectly quaint Italian restaurant tucked just off the Kings road. The menu is fresh, seasonal yet extensive. Everyone will find something that suits their taste, and walk away replete and satisfied. I highly recommend their specials, and dinning in the patio in the summer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "5GWbpi7GUwB2UUdZUnc8DQ": {
    "date": "5/27/2010",
    "text": "My bf has been coming here with his family since he was a toddler, and is a huge fan of this place. So when he finally took me I was really impressed with the quality of the food, the friendly service, and atmosphere. On a nice sunny day, its perfect to sit outside underneath the blue/white striped umbrellas. Most of the customers are from the Chelsea neighborhood, so you won't find any tourists here!The service really reminds me of my time in Italy - just very personable and friendly guys who are all related to eachother somehow. Some highlights - lobster pasta, fried battered mozaarella, sea bass (very fresh!!), and pretty much all the dessert. I also like the olive tapenade that they give you in the beginning with your bread and bread sticks. Great place for a nice Sunday lunch in the sun =)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "lxvVnNWEqR4bV5ZGuQiRkw"
  },
  "2OwQPCre9yE5SHOI_2chAQ": {
    "date": "10/16/2010",
    "text": "This is a very local and charming restaurant, complete with Italian staff. I had a great squid-ink risotto. Creamy, delicious, simple, lots of squid. I am making myself hungry thinking about it now. The portion was gigantic. I was too full to order any dessert. My dining companions also thoroughly enjoyed their meals. I'll be back.Gluten-free notes: From time to time, this place has gluten-free pasta. Maybe call ahead to check, if you're interested. The staff knows all about gluten and are happy to advise you.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "j86ldOOnhofpR8J7Vi8WZA": {
    "date": "11/11/2008",
    "text": "It's nice to see that some things never change. La Famiglia is one of them. It really does feel like a family run place and everyone makes you feel very welcome.Not too busy on a Tuesday lunchtime, so no need to book (or is this the first sign of the recession biting).The food was a little bit too rich & salty for my liking (melanzane, followed by grilled chicken with mustard sauce), my own fault for not opting for the risotto. The dessert trolley is a killer - I would love to come back for afternoon tea and try some of their cakes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "H3W9yHAKy2mxP7amnonvDw": {
    "date": "5/14/2010",
    "text": "The best Trattoria outside of Italy. Family run restaurant with friendly, attentive service and wonderful Tuscan specialties. The Gramigna all Montanina pasta dish is exceptional, their dessert trolley a real treat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PAFlpDtI9gwR8gyt1kB5jA"
  },
  "ybijrzo3QQVRH5HKxGIyFw": {
    "date": "8/15/2009",
    "text": "Two things prompted me to think La Famiglia would be an amazing restaurant before I even got to the table:1. The friend I was meeting for dinner, who has lived in Rome and knows all the best places declared this \"better than most of the restaurants you will find in Italy\".2.  When I gave the cab driver the street address, he knew right away that I was going to La Famiglia \"that's the only reason anyone goes to Langton street - it's the best Italian in the city.\"He could be right.  We sat outside on the charming back patio and drank a bottle of Tuscan wine, followed by fried zucchini and angel hair pasta with fresh shaved truffles.  It was melt in your mouth delicious, the kind where it's so good you don't even notice that you've eaten it all until it's gone.  I had calf's liver in sage sauce while my friend had scallops wrapped in bacon - both were fantastic. After I left I knew this place was a gem because part of me didn't want to Yelp it - too good to share.  But it would be criminal not to tell other foodies about this place.  Just save me a seat on the patio.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "J4MNbfV-Ohi05U6zCT059Q"
  }
}