{
  "tXyiRK0jw6Ux4Eeqy6mLkA": {
    "date": "9/17/2008",
    "text": "This pub certainly has character. It's a tiny building tucked around the back of the Royal Courts of Justice, with a comedy resident black cat who, bizarrely, seems usually to be wearing a ruff. The landlady and staff certainly have strong characters - which is a great thing if you manage to strike up a rapport with them, and potentially less of a great thing if you get off on the wrong foot. Our visit went reasonably well, but this may have been due to our possession of perhaps the ultimate ice-breaker: a crochet banana carried by one of the group (it was a Let's all go down the Strand-themed pub crawl, so there were several bunches of bananas being carried). I've not eaten here (we'd had enough bananas to keep us going by this point) so can't comment on the food, but they had a good selection of beers last time I visited. One other factor that stuck in the mind was the toilet - facilities are limited and not that great (one unit upstairs, right next to the kitchen). The stairs up to it are quite steep, so p'raps don't wait until after pint number 5 to go you might see rather more than seven stars if you come a cropper on the way down.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "McDw83szwq-FTFxMqyA7aQ": {
    "date": "8/14/2008",
    "text": "This tiny pub is tucked in behind the High Courts and one of the few pubs in the area that are open seven days a week. With a resident cat, Tom Paine, space for 7 tables and a nightmarishly steep staircase to the bathrooms, this pub is quaint in every sense of the word. The landlady is an excellent cook and the pub lunches are definitely worth a try. There is a good selection of ale on tap and ever-friendly staff to keep the service swift. It does get VERY full after work and at lunches, but its worth the squeeze!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gKj-cBsRack3LATtR2JHpg": {
    "date": "1/29/2010",
    "text": "Absolutely tiny pub that is full to the brim on week nights, mostly with lawyers, but also with a range of other people from the area.  Nice selection of real ales on tap, busy, vibrant atmosphere, and a pub cat to top things off makes this a good option in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZGTn42PI10nzs0Amg-7qg"
  },
  "rLWxtyDSE2shTKidLsBIAw": {
    "date": "4/10/2011",
    "text": "We stopped by for a beer after dinner on the way back to the hotel. Great ambiance inside, though given the good weather, we enjoyed standing on the sidewalk with our pints. The location across from the Royal Courts of Justice lends a great atmosphere and plenty of history. Maybe next time we'll have to try the food in addition to the drink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wwrAC3b_2N86GZPCaWTCjA"
  },
  "aG0B5cFwbQHr_yIoSMWmXA": {
    "date": "11/19/2008",
    "text": "There isn't a better pub in the area. This place is the definition of eccentric, but all the better for it: tiny, a resident cat, film-related decor (from Hollywood's heyday), and wonderful, engaging staff. The fact it's always packed is a good indication of how well regarded it is by punters with plenty of other options a stones-throw away (including the gigantic Knights Templar where it would be much easier to get a seat). As a free-house it's got the huge advantage of being able to sell a range of top quality beers (often from micro-breweries) and not force-feed its customers the usual tied-pub chemical rubbish. Its food is unpretentious, appetising, and excellently priced; its beers also come in at very reasonably cost, and it does well with spirits. If only more pubs could be like this",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "32uJx0vodQNH3dmvprwrYQ": {
    "date": "11/29/2007",
    "text": "I instantly fell in love with this pub as we walked in. It's small and cosy with one narrow and low-ceilinged room and an even smaller adjacent room, and extremely chilled out. There is wooden flooring and the walls are decorated with a mix of old black and white photographs, old ads and posters and some rather bizarre pictures. And there, on the bar counter, sat a big and very distinguished-looking black cat, Mr Tom Paine. (He looked like he might open his little cat mouth and speak at any moment - he reminded me of the talking cat in the Master and Margarita, who's the devil's assistant.) Anyway. They have a pretty good selection of beers, too, so I thought we were on to a winner here. But there are some crucial flaws - the beer is unnecessarily pricey, and the food, which was mediocre at best, is seriously overpriced. I hate it when they try and make the menu sound all posh and trendy, and then when the food arrive you realise you could have done a better job yourself. Oh well. I'd give it five stars for the pub itself, but three or even two for the food.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-DY5_LACS_30NzyFBVc5iA": {
    "date": "2/27/2010",
    "text": "This pub is a gem. A tiny gem, but a gem nonetheless. Fabulous service and really friendly staff, but the true star of the show is resident cat Tom Paine, who struts about the place without a care in the world, commanding respect. And respect he is duly given. Sit at the bar, banter with the staff, and drink the night away. And perhaps try and get Tom Paine to purr for you - he's a tough nut to crack!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GbsHsfD0Q8id8FLvzX7AqQ": {
    "date": "9/7/2010",
    "text": "Great pub, great pints and great atmosphere. didnt see much of the cat but he did pop his round at last orders",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RmEXVwJfse4EPawqbmW_lA": {
    "date": "3/17/2010",
    "text": "i will go anywhere that has a kitty. especially if that kitty is wearing clothing. it's a cosy pub with real ales hidden down  a back ally, it doesn't get cuter than that, but unfortunately other ppl love it too, and it is rather tiny so it does have a tendency to fill up with drunken lawyers, but if you don't mind being crowded in or standing outside then you should def take a trip to this lil historic bar. if not for the beer then do it for the kitty!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "j00c4P8Bm-5nQUzBew3OIw": {
    "date": "11/24/2008",
    "text": "A pleasant, small hidden place with an oldfashioned atmosphere of it's own.Some interesting and peculiar pieces of decoration. In the window a lawyer's head, complete with a wig looks at you. (It's at the back of the Law Courts.)The people behind the bar are quite friendly, but seem to prefer regulars they know.It looks as if you really still get served by the landlord (or manager) and his wife and not some careless youngsters. That's good and quite unusual nowadays. For real-ale drinker 3 handpumps are working.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sVce0HA6veN7X4uM_kPVeA": {
    "date": "11/15/2008",
    "text": "A wonderful pub just a block off Fleet St, behind the Royal Courts of Justice, it boasts a nice array of ales and a wonderful menu (the owner is the author of her own cookbook). Due to its location in the business/court area, this is delightfully uncrowded on weekends. The Seven Stars looks the part of a four hundred year old pub, complete with a ridiculously narrow staircase that leads up to the toilets. After a few ales, beware the trip back down!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n6xTX5lfHhT16T3M5pWTIg": {
    "date": "11/20/2007",
    "text": "A very small pub hidden in the corner of the street. They have a good selection of lagers and ales. The place is quite small and it's a bit pricey but you can always escape the crowd to find your own space on the pavement or steps outdoors. Something to die for in summer. Staff are quite keen and helpful but could get stroppy sometimes when it's very busy",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GaAxwODL4bWAQIcTUYZyJg": {
    "date": "1/19/2008",
    "text": "This pub is full of character, despite the small space and rather cramped seating arrangements. It is quite eccentric, if you like to drink in a pub that is more than your average weatherspoons. Have to say though, very rude staff who seem to want to deter customers rather than attract them, well, I guess thats all part of the charm!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OW_WqoQWa3F3PvMydLZ6Vw": {
    "date": "11/28/2008",
    "text": "One of those absolute gems that you congrtualte yourself for finding. Oozing charm, this place behind the Royal Courts of Justice is packed every day after work. Quality ales and lagers from all over the place and a true character of a landlady (and cat, of course). Look out for the daily changes on the chalkboard outside, where the day's rules or ruminations are displayed for everyone's pleasure.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6Bnl8A1iDwWHfM15fXFcag": {
    "date": "12/2/2011",
    "text": "They've got a real life cat!  but I'll get back to that in a sec.I love this great little pub!  It oozes character as soon as you walk in the door.  It's a tight squeeze, mind you.  The place is the size of a thimble.  But instead of feeling clausterphobic, it feels cozy and intimate.  We were greeted heartily by the man and woman behind the bar, and felt like we were old friends instead of random passers-by.  The menu on the wall is short and sweet...and impressive.  The options were definitely up a notch or two (or three!) from your normal pub fare.  And the food ended up tasting as nice as it sounded on the board.  The portions were HUGE.  I couldn't finish mine, no matter how hard I tried, and I'm no skinny minny.  The staff were keen to know if we were happy with everything, and were very chit-chatty which we liked.  Great service.After we ordered our food and went over to take our seat near a window, my friend said...Look! A Cat!  For a moment, we weren't sure if it was real or not, to be honest.  It was sleeping on a window box and looked a bit like it was on display, in part because it was wearing a little ruff around its neck.  After we sat down, we saw it's tail flick and we realized it was the real deal.  We immediately gave it a stroke, which it studiously ignored as a kitty that clearly gets a lot of excited people wanting to give it some loving.  It was an incredibly well mannered feline...when our food came, it got up, stretched, and sat watching us eat, but never tried to beg for a bit, and eventually wandered off entirely.  Yay for kitties!  (Even if it did give me the sneezes...I'm allergic.  If you are too, keep this in mind before visiting)The ONLY reason why I took a star away from this sweet little pub was because of the stairs up to the toilet.  My friend had warned me that it was a steep walk up and back, and I thought she was exaggerating...but she was certainly NOT.  I thought they must be joking when they directed me up the stairs to go to the loo.  I seriously feared for my life as someone with mobility issues, and dreaded the trip back down again the whole time.  I managed it, but I did wonder how someone who'd had too much to drink would manage...and of course someone with more mobility issues than myself would never be able to stay here for long.  It's all part of the character, and I still adore this place, but for marathon drinking sessions, I can't stay here because I'll be too afraid to go up those stairs again.  Even so, I WILL be back for dinner or a quick drink.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S1vSKO0xWt16WpA-YQCEjg"
  },
  "THJ178275j4zijkkW0SBuQ": {
    "date": "7/18/2011",
    "text": "All I can speak for are the beer and the atmosphere, and I'm giving it four stars, even without the cat dressed in a ruff, which apparently has been sick and recently returned home.  I thought Tom was the owner, since the sign out front announced that \"Tom is back!\" and then a woman came into the bar inquiring about Tom's health, leading me to believe a human was gravely ill.  Lovely that a cat has so many dedicated fans.The bar is fabulous, except for the PVC toilet drain pipe that runs down and under where I happened to be drinking.  Every time someone went to the bathroom upstairs I heard their poop running past.  So don't eat in that spot.  So I loved the bar, but one star is lost to potential poop.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "LkJSvJy7KaxVBPpWBFJe6g"
  },
  "9IcaUO1iok5aTfx8sdBcbg": {
    "date": "3/4/2011",
    "text": "This is a great pub just behind the Royal Courts of Justice.  It's a perfect after work drinks place when the weather cooperates - there are usually twice as many people outside as inside the pub.  You'll often find Tom Paine (the black cat) sitting on the bar, eyeing the comings and goings.  Roxy Beaujoulais (the manageress) usually has four ales (Adanams is the house ale) and a selection of European beers on tap.The food board looks inviting, and I keep reminding myself to eat here some time.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "LqZDskGLo9WbCls2RLHUUA"
  },
  "8rLP7FfEXV-HHxnXRnfH5A": {
    "date": "11/10/2008",
    "text": "The Seven Stars pub is a little off the beaten track, between two university libraries  and in the middle of the 'legal area' area of London. Consequently, whilst not themed in any trite way, the Seven Stars is popular with lawyers. It is a pretty small place with a bar and seats spread across the ground floor. There is a good selection of beer and wine there and the food is very well done. A perfect place if you're looking for a fairly economical boozy lunch.More exciting though is that they have cat who walks about wearing a ruff.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dx_0ebRrYpuDK4F9GRAqhg",
        "caption": "Photo of Seven Stars - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dx_0ebRrYpuDK4F9GRAqhg/o.jpg"
      }
    ],
    "user_id": "lHjrUujYLS-cOu--fnXCJQ"
  },
  "7EmXjGNT_ehmkbvfAV15EQ": {
    "date": "9/15/2011",
    "text": "Great, back street pub, that you have to know is there. Food is good, bit on the expensive side, and very meat orientated.Can get very busy, large amounts of people resort to drinking on the street.I like to take dates here",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "soLNlGGnv38vRlbnlOlVtg": {
    "date": "3/6/2013",
    "text": "This place had me at \"resident cat\". It might not be the best place for cat allergy sufferers to fraternize after a long day at the office, but if you like a friendly feline with your pint or glass of wine, then you should definitely head over to The Seven Stars. Hidden away behind fleet street, this old little haunt can be easy to miss, but if you do happen to be walking by, you'd certainly notice its quaint charm and wonky exterior (one of the oldest pubs in London i'm told). Roxy, the manager, is a little kooky  - often sporting strange hair styles and colors  -- but she's as friendly as they get and is always happy to serve ice cold beers to the throngs of thirsty patrons that visit (just don't diss cats...that'll get you kicked out!). What I love most about this place is the odd mix of clientele..everyone from upper-crust bankers and barristers to toothless wanderers and smelly students can be found in here...it's this eclectic crowd which gives it such a lovely vibe. And don't forget to check out the resident cat during your visit. The friendly moggy can often be found passed out in an arm chair or flirting with patrons whilst wearing an Elizabethan-style collar -- no, i'm not kidding. All in all, if you're in central and fancy a fuss-free (but not necessarily fur free drink), stop by The Seven Stars and relish in all its quirky splendor!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "A6V3MgvjZKu2ZAnOAat86w"
  },
  "PK1x65qxPl_1rxFGs-SvCw": {
    "date": "3/17/2010",
    "text": "Quite simply one of the best pubs in central London.There are generally two or three real ales available and the beer is beautifully kept. It's often completely rammed, but that adds to the occasion of being in such a fabulous little pub. A mention has to go to a very cute little pub cat too, called Tom Paine.Useful to note as others have mentioned that it's open on weekends unlike other pubs in the area, when it's lovely and quiet!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QUy07NDS9YZkgzYyzM75iA"
  },
  "SMAr6qosgNAh7i8APaXWXA": {
    "date": "9/25/2011",
    "text": "This is a lovely, hidden gem of a pub. We popped in for a drink prior to seeing a show and it was well worth the search behind the Royal Justice Courts to find it.We didn't see the cat but we did get a table in the old wig shop area. The food looked excellent but we had to dash off. Friendly bar staff too.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "U57R1SUFkQgkNtQ8GmsMJQ": {
    "date": "2/12/2010",
    "text": "Tiny cosy little pub.  Seriously, it's tiny.  If someone made a pub out of welded together caravans, it would be like this.Tucked behind the Royal Courts of Justice, this place feels like your very own clever find, and the sense of history and general wow-factor of the surroundings reminded me of the cobbled backstreets of Canterbury or Cambridge (no cobbles here though I'm afraid, CobbleFans).  I echo the Yelper below who says that this place is cosy and ye olde without being hideously themed.If you are a fan of people watching, the supercleverwellpaid young lawyers are a lot of fun.Only complaint - when I spotted the bartender plopping a lemon slice in my G&T I asked (in a very friendly and self deprecating way) if he would mind giving me lime instead please.  He scoffed in a very mean way and told me, as if I was a moron, that there they didn't have limes.  I did an automatic 'ohohoho silly me' giggle and said 'oh, that's ok', but actually, I was ANGRY.  No limes?  In a pub?  I like my Gin with LIME!!!!!!!!   Hear me ROARRRRRRR (I said in my head).However, the gin did its magic in about 2 mins, and the charm of this place was hardly dented by the mean man and his poor citrus selection.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "-LDyNtk9BsfCq15lrijISA"
  },
  "vzXvGH6-_i-mDQ-MB8e-sw": {
    "date": "1/14/2010",
    "text": "A wee little establishment snugly fitted into the legal quarters of London, this place is a surprisingly nice place to visit on a weekend evening when the neighborhood is dead. About 12 of us landed up in the area on a Sunday evening, intending to park ourselves in the Knights Templar and we ended up here because KT was shut. This tiny, ancient pub from ye olde days certainly did not disappoint. The seating area is certainly very cosy and our party took up a significant portion of the space. There was a varied selection of lagers and ales at the bar and the service fairly quick. The pheasant was quite nicely done and the mushroom preparation looked quite appetising too. The place has character, perhaps best appreciated when tottering up a very narrow staircase to get to the toilets. Unpretentious and friendly atmosphere, but the word is that it's a madhouse on weekdays, with people spilling right out onto the pavements, and thusly I hesitate to give it a 4-star...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8OPx1EO2EF8DjV5SQDOwQ"
  },
  "NOE8GLWp10B_lAOqXuImtQ": {
    "date": "4/5/2013",
    "text": "A nice place to spend a night out. Even though it's kind of small It has a nice atmosphere. The staff were friendly and chatty and the food was really tasty. Did I mention the resident cat wearing clothes ? Really cute, you should definitely go.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5QQehn4aNUHDc2EnsPnPnw": {
    "date": "2/28/2011",
    "text": "Ok a cat that wears a pink ruffle is the star attraction at this classy establishment but so what? Mr.Tom Paine made an appearance so we were honoured. To be honest cat stuff pops up everywhere. I can already hear the gruff din of doggy folk grumbling away but let's put aside our feline indifferences for now. A little glass display case has a selection of intriguing objects, including the two cats feedhere.posterous.com . This pub is a gem, tucked away behind the Royal Courts of Justice. It's very popular and has a local feel about it. Stylish checked green and white oilcloths adorn the tables, and the pub has a warm welcoming feel. You could be mistaken for thinking your in a small country pub in France at times. That may be a little too much considering the occasional banter between the barrister types. Seats are hard to come by but if you can snaffle one it's a bonus. Good ale is served a broadside and Adnams satisfied the ale aficionados amongst us. They also have guest ales and also a good list of wines by the glass. It was the food that really intrigued. Little food gems that reflect a warm promise of spring don't punctuate every visit to the pub. This was strictly a drinking visit but thankfully a friend ordered some food at the bar. Cured herring with potato salad was great utilising simple strong flavours. The fish was served ceviche style. Roxy Beaujolais is the landlady so the good food shouldn't really of come as a surprise. We will definitely be returning to have a proper meal. Seven stars would be too many but definitely worth at least four.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pqorV-961UbguCC5uhWa4A": {
    "date": "2/25/2013",
    "text": "Nice little cozy pub :) I love to go there with a friend or two for a private casual conversation. The service is great, always fast and polite people. Also, I love how they greet you and welcome you to the perfect little pub. Thank you, guys, for many wonderful evenings.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Sx-yimdLGMzQIO26fF6oSw": {
    "date": "1/22/2010",
    "text": "This is a great little pub tucked away on a back street near the Royal Courts of Justice.  Unsurprisingly, the lawyers that frequent the Seven Stars are often joined by the owner's cat, Tom Paine, who is often dressed as a barrister!It has a quiet, cosy atmosphere with a great selection of draughts and good cheese boards as well.  The owners are warm and funny, and will make you feel right at home.  The Seven Stars is one of my favorite pubs in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tz_OgtimAKIShlRgNien3Q"
  },
  "uJjimv13QehFjpiGD-Ibow": {
    "date": "8/8/2013",
    "text": "not bad! it's not much to look at, a tiny a sort of ragged place, but it was the only pub open on a Sunday in the city (yelp is a big fat liar about what's open on weekends) so we gave it a try. though the chef was downstairs when we came in and openly expressed her displeasure at having to go up and prepare our meals, they were pretty tasty and filling in the end. And our fellow diners looked pretty satisfied too--that cheeseburger was enormous!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDBbaacIo-kfZKNOpCiDcg"
  },
  "FqkgbxNKVhXEnxAs9OHDZg": {
    "date": "1/1/2011",
    "text": "Lovely, tiny pub, just behind the London School of Economics, and surrounded by the law courts and Gray's Inn. Mostly filled with barristers and solicitors during the week, it has a charming wood-panelled vibe that feels authentic, and unforced. Various old movie posters are scattered on the walls, for when this pub was used as a backdrop for various films from the 30s, 40s, and 50s. Good selection of ales on tap, and you'll get a decent GT, but don't expect modern fancy bar service. My favorite pub in the area. Be nice to Tom Paine the Cat!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-KqJs1MDCT5eqbmgnEvRQ"
  },
  "euqBgLiKJ7gIn7P4xgVP0Q": {
    "date": "8/27/2009",
    "text": "Well-kept and chosen beer, and enough people behind the tiny bar to keep a streetful of drinkers supplied during the long Summer evenings. Somehow they've crammed a kitchen upstairs, but I've never eaten there.The ambience harks back to the older public house, where you were really a guest in another's home - opera and classical music keeping the kitchen staff entertained while the cat eats its biscuits off the bar. Arrive early if you want a seat, and if you're drinking outside don't forget to take your glass back to the bar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drCcvitMVoMSM2V2nEiZ1A"
  },
  "tIhV6jMs4VE5Slj2_GoRQg": {
    "date": "8/29/2009",
    "text": "A lovely little pub to escape the bustle of the city. Good beer (Usually Adnams and Black Star) and a nice friendly atmosphere. The decor is interesting, and the toilets are basically in the flat above the pub up a tiny staircase. Not tried the food. This place has character, in a good way.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "53BwYFE_Tp64VX-zda4rTQ": {
    "date": "10/19/2014",
    "text": "This place is the very essence of what I think of as an English pub. It has the patina that only great age can provide. It's funky and idiosyncratic and dusty in the corners and I wouldn't have it any other way. And yes ... the cat. He's real. I've been here several times on trips to London over a span of 25 years, most recently this month. It hasn't changed one iota and thank the gods for that. If you come on a weekday it will be packed with lawyers, on a weekend you will be one of only a few patrons...choose your experience. Sometimes the staff is brusque when the place is busy but they have always treated me well at off hours, and I'm an annoying American. The food is traditional and consistently good with a changing menu. Sometimes it rises to the level of truly exceptional if you order the right thing on the right day. If you want something modern and gleaming, go elsewhere ... and don't bother going to Europe at all, just stay in Indiana. I adore pubs, they are to my mind the best thing about the UK, and this is my all time favorite. The real &$%@# thing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tshrEQSsSpqzlFEwuYjjfw"
  },
  "og61tuGXvRdJyaR2DjJNQw": {
    "date": "3/30/2009",
    "text": "When people think of gastro pubs, they ought to be thinking of Seven Stars. A tiny little pub just off Lincoln's Inn Fields is home to some of the best pub food and food full stop in London. Where else can you get a meat loaf with slices of apples baked in, tagliatelle with chicken meat balls or a cheesy risotto while a black cat wearing a Jacobian ruff curls up by your feet?It can get a little busy on Saturdays, but it's generally pretty quiet and a nice place to sit and chat with friends. Or you can just drop in for a pint and give the kitty Tom Paine a scratch behind the ears.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Itjk4R-Amr7hhTtXILoRYQ": {
    "date": "4/19/2016",
    "text": "I love pussy.  Cats.  Cats.  This spot has the cutest pussy cat, anywhere.  He rolls with a \"Jacobean ruff\".  I had to inquire as to the reason.  I ain't sayin shit...you gotta go yourself.  Props to William Shakes for his wardrobe.This pub is located behind the London court house (aka Royal Courts of Justice) but I didn't peep any Barrister wigs in the pub...must be illegal.The pub exterior and interior are London-traditional.  It has the vibe of a pub that's been in existence for more than a century.  Charming and dope.The pub standing room, dining area and bar space are really comfy (i.e., small) but you can, as in other London pubs, stand outside and get your pints on.  Dope.The array of ales are aplenty...and the post-work Londoners put that shit away like no other.The pub fare is deelish. I tore up the roast beef and horseradish sauce, with a side of potato salad.  Dope.The bartender and servers were quick, funny and sarcastic (cheeky bastards).  They are so unlike american bartenders (scrub mixologists).  Dope.Oh Imma hit this spot again and again.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "Yjer78RnYr7OCzirgdcOaw"
  },
  "-mq-bnO8cvmhWArbC8LOdg": {
    "date": "7/10/2016",
    "text": "I came here mainly for the cat, and he was hiding upstairs somewhere. Boo. Well, that's a cat for you. Just be prepared not to see him and you'll be okay.If you want food, you order at the bar, and then the pleasant staff will bring out your meal. Seven Stars has a few seating areas surrounding the bar but isn't especially large. The two single bathrooms are upstairs; you'll have to brave the teeny staircase. It was the late afternoon/early evening, so Seven Stars wasn't very crowded. We both ordered the lamb meatballs and penne which was richer and more filling than we'd expected, perhaps a tiny bit oily. I forgot the exact price, but it was around £11. Very satisfying after a lot of walking around the city.I'm glad I was able to check out this old pub, which according to Wikipedia, dates back to the 1600s!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-YekuWywEvMijuAKE_G6hw",
        "caption": "Photo of Seven Stars - London, United Kingdom. Lamb meatballs and penne",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-YekuWywEvMijuAKE_G6hw/o.jpg"
      }
    ],
    "user_id": "De8koO26NgVx9GkII-bgwg"
  },
  "lWbEXvTM6f2aNM4m-3eZ0g": {
    "date": "11/27/2017",
    "text": "Very old pub with an interesting beer selection, friendly staff, and a cat. I have not tried the food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JS6nI6JVHkVgEidnUvcRtg"
  },
  "7ph7sLKpDXDIdExpA1u24w": {
    "date": "7/29/2015",
    "text": "A truly terrific little boozer tucked quietly behind the impressive Royal Courts of Justice (so when it's sunny expect to see numerous barrister-types stood outside with a pint - or more likely a sizeable bottle of Champers).Standing room in front of the bar is very limited as it's only dinky inside. That said, they've given room behind the counter to a good number of real ales from both larger and smaller breweries. You can also get wine by the glass here.A few tables covered with green and white checked cloths can be found in the room to the side; it makes that area resemble a bit of a greasy spoon 'caff' if I'm honest, but otherwise I loved the place immensely. Enjoyable spot for post-work pintage.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "R9tJS1I0BtaLEKZQjO7R4w"
  },
  "v8XBUzBRqtAoyTgOn0Ro_g": {
    "date": "8/1/2016",
    "text": "This is a fantastic place - the food is excellent quality too.  Beautiful part of town near the Law Courts and Lincolns Inn.  Marvellous!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "f6d4b_B5_0ESNif8eL8yuA"
  },
  "Sggs-Jc4S00W9Pk3wzSZlA": {
    "date": "10/13/2013",
    "text": "Greeted by a friendly cat (but aloof, of course, it is a cat after all) in a ruff, I immediately fell in love with this quintessential British pub. The space is rather cozy, meaning small, so coming in a large group of 6-8 people meant standing around in typical British pub fashion for a great while before we could find tables to accommodate us. No upstairs. We went about 3PM on a Saturday and it stayed crowded until about 5, when it mysteriously emptied out for the next hour. Peak traffic and noise around 4PM. Pint of Aspall cider for 4 pounds-ish, if I remember correctly. Ended up ordering the paprika chicken dish for dinner and it was yummy (not spicy or even with \"the heat of spice\" per se as advertised to me) but flavorful and filling. Comes with a great bitter slaw and rice. Looked more diversified than my friend's dish, the goose breast, which was a ton of meat in squares around a giant dollop of mashed potatoes with a hunk of purple cabbage, as well. Dishes seemed to range in price from 9.5 - 12.5 pounds. Looks like they had sausage/mash, mutton or chicken stew, and a whole host of other classic pub dishes. Since it's right behind LSE (I always end up on Carey Street when trying to find Lincoln's Inn Fields anyways; terrible sense of direction), I'll definitely be coming back for me.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xz8ur-uRQYc1jv_PVeFIwQ",
        "caption": "Photo of Seven Stars - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xz8ur-uRQYc1jv_PVeFIwQ/o.jpg"
      },
      {
        "img_id": "GhhHYyZWXUcsUcH2eP2oYQ",
        "caption": "Photo of Seven Stars - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GhhHYyZWXUcsUcH2eP2oYQ/o.jpg"
      }
    ],
    "user_id": "nAuQZcGovK7e11oELfITDw"
  },
  "JpvlPyMpWFQkqcAHj9VrMA": {
    "date": "4/17/2014",
    "text": "I love this little pub! It's tucked back away from the craziness behind the Royal Courts of Justice. On a nice day, you can see people lining up across the street with wine, beer, etc. just enjoying the fresh air and conversation. Such a good scene. But there's more. You go inside, and there are tables. And there's a cat. That wears a Jacobean ruff (as others have mentioned). It's freaking incredible. The staff is really sweet, as they didn't seem annoyed at all when we were the last ones to leave at closing time. If you're looking for lager, you're not going to be spoiled for choice. But there are plenty of ales available if that's your thing. I haven't tried the food and there were conflicting reports from our table. One person said their food is really good, while another said it was good but that he got sick after eating it. I'm going to go ahead and rule it safe since my husband eats there often with colleagues and he's still alive.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "HAdn0hEzrgZ09-UpkJ8hbQ": {
    "date": "2/23/2015",
    "text": "Best pub in old London Town ... FACTGreat building, great location, great ales. The food is tidy and the trip to the toilet a real adventure.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOui7A-4S9DoMC85nLj8zA"
  },
  "auliCmqJBSfL5ECkgjsFPQ": {
    "date": "3/14/2013",
    "text": "Very, very nice!I had a superb Sausage Linguine and a pint of Adnams Southwold Bitter in the Seven Stars, near the Justice Courts. Small and oldy worldy. Friendly staff. Bit pricey at £14.50 but well worth it.I'll definitely come back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7Nn9sHHEHYY0pmLj9Rs1kQ",
        "caption": "Photo of Seven Stars - London, United Kingdom. The Seven Stars",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Nn9sHHEHYY0pmLj9Rs1kQ/o.jpg"
      },
      {
        "img_id": "HvZzUadWXW2vbSE1p7tuEw",
        "caption": "Photo of Seven Stars - London, United Kingdom. The bar (minus the cat)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HvZzUadWXW2vbSE1p7tuEw/o.jpg"
      }
    ],
    "user_id": "TTtSQ6EeCvwueBj1Ol5BCA"
  },
  "mjlqRGrFv4fP1Ok43eTTng": {
    "date": "1/21/2016",
    "text": "One of my favorites. Quiet, with a traditional pub atmosphere. Food is very good and wait staff is friendly. Good selection of ales, including a few real ales.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jr82O3MqS7ntrod9zPgjTg"
  },
  "Axl_cViol51w4pi8eM5TrA": {
    "date": "3/3/2014",
    "text": "This place is fantastic, amazing food.. the meatloaf was well seasoned with the right amount of potatoes. Fun staff and really quirky decor, plus a cat on the bar... Sunday was busy but it was perfect for a late lunch.  Roxy was hilarious! recommended",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WtD4UGyz4lQDyIxhIuDVGQ",
        "caption": "Photo of Seven Stars - London, United Kingdom. Hops over the windows",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WtD4UGyz4lQDyIxhIuDVGQ/o.jpg"
      },
      {
        "img_id": "3SR14vd9UwNiyWFmUYYaag",
        "caption": "Photo of Seven Stars - London, United Kingdom. Lovely lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3SR14vd9UwNiyWFmUYYaag/o.jpg"
      }
    ],
    "user_id": "h8Sgxq6Z7bJuJscBa__h5Q"
  },
  "__heJSKIuzhnc7A3umI3Tw": {
    "date": "2/26/2014",
    "text": "Quick glance:+ resident cat!+ hearty pub grub+ tasty foodFull review:Okay, if you are allergic to cats, then you will probably hate this pub. It's not a very big pub and the resident cat roams around freely, but if you love cats (or at least don't mind them) then do go to Seven Stars for a meal, or at least a pint. The cat may seem like a gimmick, but actually the venue is fantastic for lunch. It serves hearty pub grub - good value and big portion. Most importantly, the ingredients are tasty. At my last visit, I had the Italian sausage and mash with red cabbage. They are the most plump (plumpest!) and tastiest sausages I've had ever. The pub isn't fancy, it's a bit cramped, but staff is friendly (especially if you are friendly with the cat) and it's quiet - perfect place for a catch up.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "PBTvvBl27vSyZ6ytqKdThQ": {
    "date": "3/27/2013",
    "text": "Nice pub with odd food and a cat.Hidden away in the wilds around Grey's Inn, Chancery Lane, and the LSE is this gem. This pub is what all the tatty twee pubs are like. Decent enough -- and well-kept ales -- at reasonable prices for a pub to which I can stumble from work in minutes.Bonuses: wigs and legal humour.Knockbacks: Not sure how I feel about the bowl of cat food next to the peanuts. What if they mix them up?Teeny tiny and feels full even when empty.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "0Q9FocQFj1dNuiIAs8EdBQ": {
    "date": "10/13/2013",
    "text": "I am SO glad I'm studying at LSE now, if only for the cat in the ruff! We were immediately greeted by him (by greeted I mean he was sitting there acting like he didn't care one bit about us) when we walked in - I heard about the resident cat but wasn't sure if he'd be out and about when there's loads of people around, but crowds don't seem to phase him much!There's a decent selection of drinks, along with a good number of real ales. Aspall was £4.10, which is about average for the area. We were served really quickly even when it got busier, which it only did for about a half hour, then emptied out quickly. For a Saturday afternoon, that made me pretty happy. There isn't all that much seating though so you have to scoop up available seats quickly!The food looked really good and after a couple friends' plates arrived I wished I hadn't eaten a snack before I came! Although it's more expensive than the LSE bars, because of the atmosphere and the lovely cat I'd have to say I really hope this becomes the local for my classmates and I.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "nxfrdvxdux5hTkKswroqIg": {
    "date": "2/8/2015",
    "text": "Not nice. Not sure why Yelp says 10:30. Stopped in at at 945 and they were rude, said they're not responsible for Yelp (obviously). Not helpful not welcoming in the least.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7f_iTi0d81r0U47VTFfXA"
  },
  "4ezMIWrSnboztF4_MwvdHA": {
    "date": "1/13/2011",
    "text": "The Seven Stars is an amazing little pub tucked away behind the Royal Courts of Justice. It's full of character and the owner and staff are so friendly. I went here on the 18th December when it snowed quite heavily in London, and sat in a wonderfully old pub while it was snowing outside only a week before Christmas it felt so magical, almost Dickensian!Unfortunately there was sign of the resident cat, Tom Paine, but I hope to meet him on my next visit.Update: The last couple of times I've been here Mr Tom Paine has been in residence, parading up and down the bar and stopping occasionally to let you tickle his ears.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "esLEbkeUWelYnnQMZ_UL4g"
  },
  "JQx1gRMbWsRUCbpCvjMLhQ": {
    "date": "3/12/2014",
    "text": "I love the atmosphere/quirky decor of this pub. As Alex has already described in his review, the decorations are truly unique! The bartenders are friendly and there's good beer on tap. The reason I'm not giving it full marks is the food that my bf and I ordered was not that impressive. Good but not anything special, and I expected better since it's a bit pricier than other pubs in this area. I'd come back for the booze but probably not for the food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8JIDyRkzWPIW91_6Vco7A"
  },
  "Rc2Ib8iPuNyP6poAVl3SKA": {
    "date": "12/6/2012",
    "text": "What a blinding place. Pretty tiny, very old, very quirky and just wonderful to be in. From the giant plates of home cooked food, to the two old boys describing someone as a bunch of bloody Guardian readers, to the collar wearing cat. Barking mad, friendly and definitely worth a visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FUMqRwr4CmLxZqHIgOVNlA",
        "caption": "Photo of Seven Stars - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FUMqRwr4CmLxZqHIgOVNlA/o.jpg"
      }
    ],
    "user_id": "JD5sVV3sARkuaHupEfGfSw"
  },
  "OvqlfM50bgf8F-uUMqHHPw": {
    "date": "1/16/2014",
    "text": "This place gets 1 point for the cat in a white ruff, and 3 points for a damn good chicken and pheasant pie. As others have said, the pub is microscopic with a vertigo-inducing crazy staircase to the upstairs bathroom; it gets crowded; but it has a lot of charm, and frankly, the food is better than it has any right to be.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-nkhPY3vgSTmJu6T7cG6JQ"
  },
  "A6FVtDL0Z7oEXr7eIfUe1Q": {
    "date": "5/12/2014",
    "text": "Who hasn't heard of the famous sir Tom Paine the Cat. He is the proud mascot of the Seven Stars so be nice to him as he strolls around. Kudos to the staff for coming up with such a great idea - to let a cat freely into the pub and the lovable thing would melt your heart if it happens to come by your table. Apart from you host, sir Tom, the food offered are quite the traditional pub offerings, all of them being really delicious and nicely presented. There's also a nice range of ales at the bar so you can drink up freely.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hrYQQEO2M-mrzU_QTEqq4Q"
  }
}