{
  "fA8yMJ9CnY3vbE2yoVuYGw": {
    "date": "7/26/2009",
    "text": "Tapas is always a good idea in my estimation.  What's not to like about lots of small plates filled with tasty goodness?  London has no shortage of Tapas restaurants - Iberica, Brandisa, Barrafina to name a few. So why go to Dehesa?  Well for starters you can make a reservation which you can't do for the last two on that list.  The atmosphere is also great - dark and intimate but loud and alive.  And last but not least, the food is consistently amazing.  This week we had the goat cheese special (a trio of goat cheese with rosemary honey), the Spanish chacuterie plate (there are Spanish and Italian options), squid with mint and chickpeas, and minature peppers stuffed with pine nuts and spinach, among other things.  The fact that I can remember the meal in such detail several days later sort of says it all.A warning: I put Dehesa in the Special Occasion category because it is not the cheapest tapas place in town.  Quite the opposite, and that extends to its wine list - which is not that extensive but ridiculously priced.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "J4MNbfV-Ohi05U6zCT059Q"
  },
  "Th1TjF28YTIEby9tAHRoHA": {
    "date": "4/21/2009",
    "text": "Came here for Belinis and Tapas tonight.  It was hectic and despite having called ahead, we had to wait for a while to be seated, unfortunately in the \"sharing table\" section.  The results was that we had to shout at each other to actually hear anything since the accoustics wasn't so good, music was pretty loud etc.  Not so good when one of us has cracked ribs and the other a sore throat.So talking aside, we had a pretty good meal as usual.  I personally loved the croquetas, corgette flowers and duck although others found the meat balls delicious (i found them dry and had a bit of tendon stuck in my mouth for a while).Ended with a yummy chocolate cake, everyone happy.The service left a little to be desired for as always, but there is no question that the food here is AMAZING for the amount they charge.I would recommend getting seating at the back of the restaurants or in the bay windows though, because you can actually hear what each other is saying then!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "yBvTTA0p7ZoRNl-7N1mB1w"
  },
  "YYQyAS1Y92M95rgWkPQMzg": {
    "date": "2/18/2010",
    "text": "There is no need for me to go on and on about the food.  There are enough reviews already on it. Although, if you don't try the pork belly, you are definitely missing out. The reason I absolutely love this place is the customer service / management.  My friends and I tried to reserve space a few days ahead of time and the place was booked.  We decided to show up on the night and try our luck.  The manager told us it would be very hard to fit us in; he suggested that we sit at the bar across the way and wait.  Within 30 minutes, he walked over to the bar and said that they had a cancellation and he would fit us in.  I was shocked. It's pretty rare to have any restaurant seek you out in this city.  I'm now a fan and even enjoy their Salt Yard location.  In fact, I ran into the same manager at Salt Yard and let him know how wonderful he was.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2KXXJSONdaLamQFPcmFMsw"
  },
  "qSbyVOTOi6dejPY6UDaZrA": {
    "date": "2/9/2012",
    "text": "For really good affordable tapas you really can't go past Salt Yard (Goodge St Tube). It is an award-winning bar and restaurant serving modern tapas inspired by the flavours and produce of Spain and Italy. The tapas are complemented by charcuterie and cheese boards. But if you find yourself more central, head to it's lovely sister restaurant- Dehesa- in Ganton Street, Soho. Dehesa is the unique woodland area in Spain which is home to the black-footed Iberico pigs- said to produce the best ham in the world.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LSNO6g0jcmgmffbzK-uvQQ"
  },
  "mv7OGVAAZxCXbnS-MXAbuA": {
    "date": "7/7/2010",
    "text": "We were on the hunt for a good tapas place in this area came across Dehesa.  It turned out to be great and just what we were looking for.  It's located in the bustling pedestrian shopping area of Carnaby St.  A bit touristy due to the location, but we had a great meal nonetheless.   For 3 people, we had: salt cod croquetas, rabbit confit, lamb, pork belly w/sage cannellni beans, mini-artichokes, quail, tuna carpaccio, chorizo, chocolate cake, pana cotta Everything was delicious and we would be back if in the area again!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5vIBambONbnPpZysS8W1fA"
  },
  "e1SPGnkrWDfkSOFblI7XBg": {
    "date": "5/11/2010",
    "text": "Being there for a sort of pre dinner aperitif with a friend.Lovely atmosphere, 6:30 pm wasn't so busy or noisy, very nice ambience, friendly staff. Around 8 pm started to get busy but we were about to live at that time.Liked the chargrilled bread with olive oil (£2.50), enjoyed the charcuterie plate and some fried cod to go with 2 glasses of wine.A bit pricy (£ 30.00 in total) but I think I'll go back for a quick snack or an aperitif.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DZyyn6PfjFSWUGVNum5WPQ": {
    "date": "11/16/2009",
    "text": "Yum, tapas! We came here on a Saturday night and had to wait about 15 minutes for a table. I had a peach bellini while waiting for my food and it was delicious. We ordered their cured meats platter, prawns that came with cilantro and beans, lamb with gnocchi and mushrooms, and deep-fried duck egg. Everything was pretty delicious with the exception of the deep fried duck egg, which tasted a little bit like tonkatsu breading but needed a bit more salt. I would definitely come back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UDkX3Vmm8wYcFDDxc9uWwg"
  },
  "g3GKVYjvKfU3cv88KC5Vzg": {
    "date": "7/4/2010",
    "text": "what a great tapas bar right in the heart of carnarby street!my friend and i were wandering here the other day and stumbled across this place and what a find it was! especially considering we were considering some other very run of the mill options.we sat right in the window which was great for people watching and made us feel like we were outside even though there were no outside tables available at the time we arrived.we shared the following:salt cod croquettes - pretty good. didn't think i would like them but definitely a pleasant surprise.tomato/peach salad - delish - perfect summer combo.ridichhio pear salad - a little too much dressing but otherwise good.chorizo - cooked to greasy perfection.patatas bravas - delish.couldn't say more good things about this place, especially for the location. will be back for sure.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fsXOO_f6mCywKFowLFQxrQ"
  },
  "mB4hPdAeBgvcFvnSO9ouvw": {
    "date": "4/18/2010",
    "text": "Stopped in here one night last week where I shared a lovely bottle of wine and a few plates of delicious food. We sat at the bar and the barman advised us on the perfect wine and tapas to go with it. The prawns were awesome! I'm not a meat eater but my two buddies were raving about a super special ham which they devoured. Its actually a great place for a first date I thought to myself...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Eo7hgGIlkGrRTCZ4eM-NBg"
  },
  "SazI41gPNEftcgw4tItt-w": {
    "date": "11/21/2008",
    "text": "I'm not a huge fan of Spanish food, but this is one of my favourite restaurants in London.  I'm guessing I love the food so much because it has a heavy Italian influence (while still maintaining a few classic Spanish staples that I do really enjoy - i.e. jamón iberico, croquetas (their salt cod ones are incredible) and manchego cheese).. Be sure to order the grilled sourdough bread with aioli as an accompaniment to anything.  Or, for the perfect snack to begin your feast - have the bread along with the jamon iberico, a bit of cheese and quails eggs.For the tapas, you really can't go wrong.  The combination of flavours in each small dish is perfectly inspired.  They periodically change up the dishes (usually just by altering the accompanying sauce/veg/herb etc) but a very recent visit there yielded 2 new favourites:  sliced guinea fowl with spinach gnocchi and truffle vinaigrette and a butternut squash with chanterelle mushrooms and rocket.  They always seem to have the pork belly on the menu as well which is the best I've had anywhere.The dining area is quite cramped but the atmosphere is lively - it's a great spot to meet up with a friend (or three, but no more) for a fun and stomach-pleasing dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wns9scTp_gmTiQkS0Ju3Ag",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wns9scTp_gmTiQkS0Ju3Ag/o.jpg"
      }
    ],
    "user_id": "1uGNqM57Fa7QhCDDuTxLHg"
  },
  "PoGIQJtLdy5bDKpUznjPwQ": {
    "date": "11/18/2008",
    "text": "If you are looking for a true culinary experience I highly recommend this tapas bar. They have the most inventive tapas I've tried, like the courgette flowers stuffed with goats-cheese and drizzled with honey, this is a great dish, super fresh and really an award winning combination. They also have a personal favorite, Jamon Iberico, which is so delicious if you combine it with some of the selection of cheeses they have. Also the wine list is pretty good and varied. The place itself is beautiful and invites to savor and enjoy the good food they serve. Service is attentive and knowledgeable.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z5TeHzETxdf2Eaf7wdyBTw",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z5TeHzETxdf2Eaf7wdyBTw/o.jpg"
      },
      {
        "img_id": "pKfhBOvPlxIp1NpoVEBaCg",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pKfhBOvPlxIp1NpoVEBaCg/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "FDqW9zoneiVORgjwr8MXXA": {
    "date": "9/29/2008",
    "text": "Steer clear of this place - it looks lovely, but the quality of the ingredients were not great (our fish & beef dishes were just of poor quality & consistency, and to be honest, didn;t taste great). On the expensive side, and nowhere near as good as Barrafina. Even the desserts were not great.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AjyMBHaIytIG-Y3_WXT0qQ": {
    "date": "12/19/2008",
    "text": "I ate in the private room downstairs with a group of friends to celebrate a birthday. We were a party of 10 and the room is lovely. It felt really private. Ample room. A great space.The service was very efficient and pleasant. Alos because it's tapas they call by the room often.Now we did have four or five bottles of wine and the wine was very good. However, the meal was an awesome £75 per head and, to be honest, this left a bit of a nasty taste in the mouth. The charges for coffees, teas are very steep. And to me this was not a £75 meal. it was ok. It was tapas. But not £75.Enjoy the quaint building. Sit upstairs and watch the world go by. Order a few dishes.But if you're in the party room do a deal beforehand on the whole bill  or you'll be stung!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IoU_sjflF6N0OkmD9Nykuw": {
    "date": "1/5/2010",
    "text": "Dehesa is a great place to stop for a glass of wine and a few small plates with friends.  They have an excellent selection of cheeses, and it's fun to sit at one of the outdoor tables and people-watch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tz_OgtimAKIShlRgNien3Q"
  },
  "aK4emhAQzFOECgwGhomVCw": {
    "date": "6/30/2010",
    "text": "Had walked past this place so many times but never been in, so recently on a rare occasion when my wife and I were in town together we decided to pop in for lunch. Took the last 2 seats (at the bar) and settled into a delicious meal. Ok, this isn't the tapas of some grungy-but-authentic-little-place in the backstreets of Madrid. It's very much London tapas. But it's great. A note on the service. In theory good service is about flawlessness. In practice I find good service is actually about how you recover from the mistakes that will inevitably be made. And there were a few. A dish that was delivered but not ordered. Another dish that was ordered but not delivered. But the recovery was great - the unordered dish stayed, free. The late dish was rustled up, free. A 20% discount was applied to the lot, and some sherry appeared from nowhere just before coffee. I'm sure the business manager of this place might have winced at all this, but it sure made a good impression on us. We'll be back.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "S_9HEVns6k7dodHkPIEKGg": {
    "date": "2/11/2008",
    "text": "Dehesa is a quaint little restaurant perched on the corner of Ganton street and Kingly street not far from world famous Liberty's store. This Spanish style restaurant is a more up market version of the Salt Yard in Goodge street and offers an excellent combination Spanish- Italian wines, cured meats, cheeses and small dishes which are more elaborate than the conventional tapas in some Spanish restaurants. I was dining there with a few friends a few weeks ago and it was quite busy. Although they don't take bookings we managed to find ourselves a nice out of the way table near a bay window. The seating in the main restaurant consists of rows of high bar stools, but if you get in early then a some proper tables are available. The menu is quite extensive with a huge choice from the meat, fish and vegetable tapas. I have eaten here a few times and on this occasion I decided to start with salt cod croquette accompanied with deep fried courgette flowers stuffed with Monte Enebro cheese with a drizzle of honey. For the main course I went for the lamb chops served with a pleasing hot mint sauce and the meat was I admit served at just the right temperature. The main dish was accompanied with polenta cakes with gorgonzola,braised Swiss Chard done in a tomato sauce garnished with a perfect poached egg. I finished off with an unusual dessert consisting of fresh figs roasted in sherry served with wafer thin biscuits and burnt lemon ice cream which had a pleasing texture brought out by the tangy citrus juices which had been caramelized in a subtle fashion without showing any traces of being burnt. All the sherries,wines ports were chosen well to accompany the main meal. A meal for two with wine would be around 75 pounds and well worth for a special occasion.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "TLJb4IaqhXnfEgxrbjEV_g",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TLJb4IaqhXnfEgxrbjEV_g/o.jpg"
      }
    ],
    "user_id": null
  },
  "cIF3r3i6mCCUeg5hnyWd5A": {
    "date": "9/4/2014",
    "text": "Went there on a late Sunday afternoon:- located - it is a venue that's stylish and pleasant but fully focused on the plate and in the glass- Dehesa is a charcuterie and tapas bar inspired by the cuisine of Spain and Italy- sat outside, not very busy at that time- there is also a private dining room available (which can be booked for lunch and dinner); reservation recommended during busy times (online booking)- capable and friendly staff- they offer tapas, pudding, charcuterie as well as bar snacks- the back of the menue is a paean to the pig, in Spanish and Italian derivations, offering hams on and off the bone, including an entry-level, acorn-fed jamon iberico; few cheeses, too- however, we found most pleasure in the tapas menue: Confit Octopus with Pink Fir Potatoes and Sautéed Sprouting Broccoli (9 GBP), Grilled Scallop with Crispy Morcilla, Sweetcorn Purée and Salsa (5.5 GBP), Classic Tortilla (5 GBP) and Pimientos de Padron; fish dishes were very small, tortilla and pimientos larger portions; all dishes very yummyConclusion: Delicious tapas, nice seating outside, friendly service!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3BHeHTGNZcaEi8woqGy2kA"
  },
  "UBrUypTUxK063DhtIsiCZA": {
    "date": "9/29/2011",
    "text": "I've eaten here several times. Excellent tapas style dishes. High quality ingredients, well designed combinations of flavours and textures. Executed to a high and consistent standard.The menu looks like it changes with the season and has a selection of vegetable, fish and meat dishes. You need about 3 dishes per person so it's a good way to try out different items. Personal favourites include the pork belly with canellini beans (really tender and really crispy skin) with just the right level of rosemary coming through. Other reviewers also mention this one!  The mackerel with bean and pepper salad was great as well as the stuffed courgette flowers.On a previous visit they had the most wonderful variation on bread pudding which was simultaneously soft, light and crispy but doesn't seem to be on the menu any more. Deserts on my most recent visit weren't quite as good as last time.It's a small den of a place with a cosy feel on the corner of Kingly St and Ganton St. so a good place to stop by in the centre of town. Perfect for two, you can sit at the bar or for 3 people they have a few tiny booth tables that are just big enough. Not good for a crowd. Gets crowded even on a Monday when I visited last.Service is straightforward and the prices are fairly high but it's made up for by the excellent food.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "DOrX1xl0hGFIpF2x_T5mHw": {
    "date": "10/22/2011",
    "text": "This place is great, its tiny tho, you will be sat right next to other people.  But the wine was very good, the food excellent and the location and ambiance fantastic.Despite looking like there was no where to sit the manager got us space on a shared table faster than he said he would and the waiters were fast and attentive.The tapas selection was perhaps a little limited but this was offset by the speed of service and the high quality of the food.  I loved the quails eggs inparticular.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ccvsx686SA2CgHQz5-GDTQ"
  },
  "jzEGrIILboZIRh5mjSNHIA": {
    "date": "11/5/2011",
    "text": "Just behind Regent Street, Dehesa is located near a number of pubs and restaurants that are swarmed by young professionals after work until late at night. I have been here several times and I recommend booking a table, or putting your name down before you go grab a few drinks elsewhere. Dehesa is cozy and intimate, a perfect place for a date or catch up with friends. I have been there 3 times and this last time was my favorite yet, my mom and I had the following:Fish Tapas:stone bass carpaccio, it was fresh and reminded me of Peruvian ceviche I have had. The smoked mackerel was particularly good as well. Meat:Their Iberico ham is excellent, you cannot go wrong with this choice, along with some bread, it is a great way to start or end the meal.The pork belly was cooked to perfection, crunchy on the outside and extremely flavorful, accompanied with cannellini beans, it was a perfect combination and very filling. My absolute favorite part of the meal was the Padron Peppers. They seemed to be slightly grilled and sprinkled with sea salt. We got two servings of them because they were just that good, I could have eaten a hundred of them. We washed all of this down with one of the three beers they serve (we weren't in the mood for wine, but they have a good selection) The beer was called Alhambra Reserva, It was recommended by the bar tender, and it was particularly good, i was expecting your run of the mill lager, but it had a golden color, with a aromatic hopyness to it and a malty finish. For \"dessert\" we had the courgette flowers which were filled with goats' milk cheese with honey drizzled over. I say dessert because it's actually a vegetable tapas dish, but cheese and honey says dessert to me. I didn't try their actual desserts, but maybe next time I'll save some room.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZIfa9lbXUJBndotCJkbyQ"
  },
  "Mqy9de6Hszwo9K-gVuKXwA": {
    "date": "8/20/2014",
    "text": "For some reason, I think restaurants near Carnaby Street are mostly catered to tourists. Then I found out that Dehesa is actually a sister restaurant of Salt Yard, which I really like. So I decided to give it a go. The place is quite cozy, so it is quite perfect for smaller groups. I took two friends from out of town there. We focused mostly on catching up, so just ordered a cheese board a charcuterie board and a couple of hot dishes. It is definitely not a tourist trap, as the food was quite delicious and I especially like the stuffed courgette flower. However, the prices are definitely for tourists. And the services weren't that great. I will go back again to try more hot dishes and the desserts, as they sound quite enticing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "XNmSs0fdsZuOPDxrn4Qyaw": {
    "date": "10/20/2011",
    "text": "Somewhat expensive Spanish tapas bar situated behind Regent St. Food is good but don't go here if you've been on a boys night out and are absolutely starving.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Li1HVGOQVAre8YgiTLra6w"
  },
  "SrxJqiC_jBFMphlBBOKRHA": {
    "date": "7/9/2011",
    "text": "On our visit to London, my friend took us to Carnaby St.  We had so much fun there that we decided to go try more restaurants around the area on or third night in London.  After a whole day of doing tourist things, we decided to walk around the area and settled at Dehesa for some yummy tapas and wine!  We tried a lot of food there. They have a great selection of cheese and a big variety of their tapas menu!  I highly recommend their pork belly!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PuGxtXXW4Obfip1Ysc2o4g",
        "caption": "Photo of Dehesa - London, United Kingdom. Quail eggs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PuGxtXXW4Obfip1Ysc2o4g/o.jpg"
      },
      {
        "img_id": "VUTuhqitzP2Ze8RH82HiBw",
        "caption": "Photo of Dehesa - London, United Kingdom. Beef and pork belly",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VUTuhqitzP2Ze8RH82HiBw/o.jpg"
      },
      {
        "img_id": "-l32AUt4HTIADqd4pYpbVQ",
        "caption": "Photo of Dehesa - London, United Kingdom. Polenta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-l32AUt4HTIADqd4pYpbVQ/o.jpg"
      }
    ],
    "user_id": "rtTpEZSTIDSurdw12xZK1Q"
  },
  "X3qHjPceVVaJg4T6dPthSA": {
    "date": "5/22/2011",
    "text": "I came here on a stag do and was not disappointed! Every course was heavenly, the wine surprisingly good and the private room we had very classy. Service was attentive and the dimly lit rooms gave the restaurant a very cosy atmosphere. Particularly noteworthy was the option we had to provide our own soundtrack, allowing us to chow down on fine tapas to the music of Queen, Delphic and Basement Jaxx, just as the Spanish do on a daily basis I'm sure! The only negative was that it was fairly pricey. Not offensively so, or sufficient in any way to stop me from coming back, more something to be aware of. I haven't been to Barrafina so can't comment on how the two compare. Indeed, as Barrafina doesn't take bookings, it wasn't an option on this occasion.In all, Dehesa is definitely worth a try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "N2HC7DRVH_vEUAg8Ss3mzQ": {
    "date": "10/5/2013",
    "text": "Dehasa is one of my favorite tapas restaurants in London.  Every dish we had was delicious and there's nothing I can fault about this restaurant.  It's slightly pricey but I think it's well worth it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtc-_ItNFE7GCddADBR34Q"
  },
  "c_dJldxqKShX2vK7iFYjUA": {
    "date": "1/11/2012",
    "text": "Buenisimo!My friend and I shared 5 tapas dishes that I would, for the most part, wholeheartedly recommend. As a London who lived for 4 years in in Madrid, and now reside in LA, whenever I'm back here I seek out the best Spanish restos, since they're non-existent in Los Angeles (every supposed tapas place there is staffed by Mexicans, just like every supposed Mexican restaurant in London is staffed by Spaniards).The highlights of our meal were the pork belly on creamy mashed potato (the pork skin crispy to perfection), the braised oxtail on polenta, and hake with a chorizo paste that was out of this world (is there a more common food cliche? Sorry).The tortilla was outstanding too with an unexpected creamy delicious center.The prawns were just good, not worth mentioning (unlike the perfect ones at Barrafina on Firth).The macchiatto was perfectly brewed; a lovely way to cap the eve.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4u3PoZDdM6acNRaosz6ylQ"
  },
  "2a_V53w2gTBVdHv72sSWOg": {
    "date": "7/18/2010",
    "text": "There I said it: I just came home from Europe, and my decadent, food-loving soul barely emerged while on foreign soil. Why? Because I visited England and France, not Spain and Italy. Don't get me wrong: I weep at the prevalence of chorizo and charcuterie plates in every butcher shop, excellently simple chevre and lardon baguettes, and chocolate macarons. Not to mention five-course dinners at French weddings, or the peasant appeal of an English breakfast, with just-charred tomatoes, thick rashers of bacon, and a puddle of beans and egg yolk all sopped up with toast.Even so, my culinary heart has always been torn between, and so found a double home in, Spain and Italy. The simplicity of fresh and bold ingredients, the reverence for and tradition of elemental cooking, the spice and depth of the wine....So it comes as no surprise that my one meal to plan and anticipate, salivating, would be at Dehesa.And so my heart was satiated over and over, and the evening became one of such loveliness, such delight over the wine and the new little plate on the bar, such smiles of pure delight....Grilled squid and chorizo salad, just vinegary with pickled onions and spicy with pimenton. Asparagus spears topped with shavings of black truffles. Crispy-seared pork belly nested on a simple layer of cannellini beans, dotted and flavored with bits of pungent rosemary. Three kinds of ivory and golden manchego cheese, surrounding a tiny block of membrillo. Sea bream, grilled with tender mushrooms. Three shot glasses of red, green, and orange gazpachos, accompanied by slivery-thin shavings of salty ham.And...two wands of courgette flowers. Bathed and crisped in honey. And stuffed with creamy, delicate goat cheese. Sweet, and lovely, and those few slow and savoring bites will stay in my mind as one of my vivid food memories, so perfectly contrasted and united in both theory and execution.Without a reservation, you can eat at the bar or the communal table, and bask in the warmth and energy, and look with pleasure at the hocks of Iberico ham resting on the counter behind you, and swirl your glass of wine, and simply delight. So in my little way, I happily come home from Spain and Italy too, by way of Soho (and also of France, through the bartender Pepe). Wildly smiling still, of course....",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "MNeCv2lwx_iujQFUsNKLgg"
  },
  "lRafNGW9zfdjmRzkgHsTwA": {
    "date": "4/21/2014",
    "text": "Great tapas bar. Loved the wild boar, and also enjoyed the asparagus and octopus. Interesting food selection that was topped off with a solid atmosphere. Not as amazing of a beer selection as you'd expect in London, but the pubs nearby have that covered.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fL35Nuk-Nde5BJfOD0W_EQ"
  },
  "8zCoAwSyybkfLHxOjbsISw": {
    "date": "9/16/2010",
    "text": "Goodness, I love traveling for business! I get to try all the good foods that the world has to offer. The downside is that I have no one to break bread with plus I never know where to eat. So I always opt for places that are crowded enough so people don't notice the loner loser all by herself!!!This time however I had a friend with me and we stumbled upon Dehesa. Perhaps it was all the legs of pork in the window (see photos) that drew us in. A tapas joint - perfect! More food to share. Everything we ordered is exceptional:Pan fried duck breast with truffle!Grilled squid and chorizo saladprosciutto di Parma (OMG this stuff MELTS in your mouth!)Spanish collection of cheese...all this and then some along with a  bottle of Chardonnay. Bill came out to 150...why do tapas have to be so expensive? They are just small plates! But then again....I love traveling for business!Side note: dining space is small so it is best to keep groups down to a minimum. And you can sit & eat at the bar.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XQU46gFfVmgSjTOTvc5Jew"
  },
  "Izg5fYLsjfoXydLZ1EJkRg": {
    "date": "7/15/2010",
    "text": "Summary: Pretty good, but not great, tapas.  Small portions.  Expensive.  Bad service. Probably won't come here again as Barrafina is much much much much much much much better.I like Dehasa's ambiance and decor, but that's about it.  The food tries very hard to be a \"different\" style of tapas (and it certainly isn't your normal spanish tapas) but none of the dishes made me want to have more.  Nothing stood out as inventive (although they sound like they might be on the menu), or very tasty (again, tastes good, but nothing special).  The portions are excruciatingly small for the amount you pay.We had (between 2):1. peach and tomato salad -interesting, but not that interesting2. rabbit wrapped in parma ham and paella -sounds interesting, tasted very ordinary.  the paella was actually very good, but too bad they only heaped two small spoonfuls of it on the plate.  3. grilled bream -again, sounded very tasty on the menu, but tasted like a normal grilled fish with some lemon and herbs4. prawns and saffron potato -extremely ordinary tasting5. patatas fritas -actually, the only thing that was very good (and that is sad)Service was not wonderful either.  We had to flag our waitress down every time (took ages...and the restaurant wasn't that full or busy either).  She never smiled at us ONCE until of course, at the end when we were paying our bill and giving tips.  While I was paying, I didn't tell her to put in a tip on my debit card, but she took the liberty of putting the \"optional\" tip in anyways.  I didn't want to deal with having to tell her that I actually wanted to pay less, so I just paid the god damn bill and left.  Again, I'm a spoiled San Francisco resident who's used to tons of great tapas places at good prices, both traditional Spanish style & more modern style (Mission district...enough said).  The more I eat out in London, the more disappointed I am with the food scene.  I can understand why Londoners would rate this place higher---they are not used to having very good restaurants at affordable prices.  Had this place been more generous with the portions or priced less per dish, I would have given it 3-3.5 stars.  Dehasa is incredibly overrated.  I was still hungry afterwards, and had to eat something more at home.  I would suggest to anyone coming here to head over to Barrafina instead where the service is superb, the prices reasonable, the portions filling, and the food delicious.  I won't be coming back to Dehasa.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vUimuuObOODnXe614ViuAw"
  },
  "LkJoo9XfCygHGRA56lZcrw": {
    "date": "11/20/2010",
    "text": "Good ambiance, good food, good service.We ordered jamon iberico de bellota (go for the slight splurge...it's tasty), salt cod croquettas, tortilla, pan fried duck breast, and 3 manchegos.  I usually love patatas bravas but the ones here looked more like french fries so we opted out.  I also normally love jamon croquettas, which were not on the menu so I slightly hesitantly ordered the salt cod.  To my pleasant surprise, they did the trick--yum!  The tortilla is pretty standard.  I didn't love the duck--couldn't really taste the jamon & truffle sauce. The charcuterie and cheese were standard as well -- yuuummmmm.  Our waiter was ok, but he kept speaking to my guy friend who I dined with, rather than explaining things to both of us--found that rather annoying.  I would give it 3.5 stars.  Decent but didn't blow my mind.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AIIhlzbU2o4NkiJZd2sUTQ"
  },
  "s2DXtzMdygP5aCk99m61zw": {
    "date": "5/12/2013",
    "text": "Yum yum yum. A great corner for people watching if you get seated outside (weather permitting), Dehasa is located off of Carnaby Street close to Liberty's and is the perfect lazy afternoon hangout. We had delicious grilled bread, olives, fried courgette flowers stuffed with goat's cheese, ham on cheesey toast and a bottle of red. The food was tasty and our server was attentive, quick and cheerful. I will definitely be coming back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I-HRQskIplOJlFLlN3eE9A"
  },
  "_6bmnajVMtMk9r0fwfeXbw": {
    "date": "12/13/2010",
    "text": "It's a cute little place near Carnaby Street. A sister restaurant to Salt Yard in Fitzrovia, I found it less charming and appealing. The food is good, if a bit on the pricey side. Come here on a corporate card and you'll be sure to enjoy it more. Dinner can be extremely crowded. Come early for lunch if you want a seat.Overall impression: decent and worth a try if you're in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQEmuUvnfqAlU_Jg0m_SMA"
  },
  "XnNlZ3D06KUJ9Q2aZFxuGg": {
    "date": "3/2/2010",
    "text": "Tried to get into Polpo for an early Weds night dinner with a couple of friends.  We were told (at 6.30!) that it would be an hour's wait, and if we left the restaurant our name would come off the list immediately.   So we went round the corner to Dehesa who were far more accommodating.Were told there it would also be an hour's wait, but they took our number so we could go for a drink next door and they called us within 30 mins to seat us at the communal table.Great food - am a fan of Salt Yard anyway, so a few familiar favourites.   Ate loads, with a bottle of wine, for 25 GBP a head and a great buzzy atmosphere - will definitely return.Beautifully done interior which makes the most of the small space - looks totally different to the caff that used to be there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k-F5O90KPnz4Bj0nzEcoww"
  },
  "gSEcmiwGC6IV2BPB_4_-tQ": {
    "date": "7/1/2013",
    "text": "Popped in for quick nibbles and sodas.  Strange greeting - I think they are used to people wanting to come solely for a drink and they are only licensed to sell food.  That was fine by us but they didn't seem to want to serve us at first.Plenty of high quality tapas available.  Pata Negra Jamon carved in front of you.  Good cheeses, good olives.  Bit breezy, as the wind whipped through the doors, but nice location",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y67kqyVsehXk_IIbPoKwzA"
  },
  "nqMj__y0dv73cTvladn9Vw": {
    "date": "4/14/2010",
    "text": "Mmmm...tapas...Went here for a friend's dinner party.  We had the table downstairs and a set menu with something like 10 courses of tapas.  I was impressed with the quality of the food, the course planning, and the setting - such a cool vibe.And the wine - I love Spanish wine...especially a good red...and there was lots of it.  Great place for a dinner party or small birthday.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B4s5hZXip1X19eLWsKt79A"
  },
  "Kfbm4tzyF98NF2ojpZY_lQ": {
    "date": "5/13/2018",
    "text": "A great place in the heart of Carnaby.Dropped by to rest my feet and grab a bite. I was definitely impressed. I ordered a sparkling water to start followed by one of their signature Gin & Tonic's which was very good.Keeping it light I ordered their Italian Charcuterie and Italian Cheeses. These were by far some of the best I've had before.They stopped over to offer a house appetizer which was quite good as well and a generous portion too!Beautiful view, great food and drink. What more could you want? We'll the service of course and I can confidently say it was the cherry on top of this restaurant and what made this memory for me.Thank you!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EilQGoXDIrQ7DB4Q89-f2A",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EilQGoXDIrQ7DB4Q89-f2A/o.jpg"
      },
      {
        "img_id": "SYBeioeek_pUDf_Q-JnQKA",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SYBeioeek_pUDf_Q-JnQKA/o.jpg"
      }
    ],
    "user_id": "CrYiOSdOKjZsyNCZ4s9N1g"
  },
  "IIJcF00gLWLzJbA7RoRHPg": {
    "date": "11/7/2018",
    "text": "I love tapas and a good wine. On a busy Saturday night all other places were packed and I was only able to get a table outside here. Our server was extremely attentive and had some great recommendations. Every dish was amazing. We shared a couple of vegetarian dishes, a couple seafood dishes and a couple of meats. The wine (Brindisi) was my favourite. Order anything from the menu, you won't regret it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ptUCEl3w3ScVOaN-3lDIw",
        "caption": "Photo of Dehesa - London, United Kingdom. Patatas bravas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0ptUCEl3w3ScVOaN-3lDIw/o.jpg"
      },
      {
        "img_id": "PiKcDqpM2pOv0PYkMXqeGQ",
        "caption": "Photo of Dehesa - London, United Kingdom. Flat iron",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PiKcDqpM2pOv0PYkMXqeGQ/o.jpg"
      },
      {
        "img_id": "tRVuujfHWcWLtGmnVL_7ig",
        "caption": "Photo of Dehesa - London, United Kingdom. Risotto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tRVuujfHWcWLtGmnVL_7ig/o.jpg"
      }
    ],
    "user_id": "TSvlDgCiGv1Tv0nfBBR6Eg"
  },
  "qlhFP_apfEiU0jHqubKKUw": {
    "date": "10/21/2017",
    "text": "Packed little tapas restaurant in the Carnaby area of London.  We sat at the bar where Lawrence serviced us.  He was the best.  Good-looking, good recommendations, and good conversationalist.  I can't remember the dishes we tried, but my chicken was better than the shrimp.  It was our lunch, and it was nice.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "NGRO6Hwlkwx4diFf5M8MxQ",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NGRO6Hwlkwx4diFf5M8MxQ/o.jpg"
      },
      {
        "img_id": "8tf8E_O8AhE3NUEnmosNWQ",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8tf8E_O8AhE3NUEnmosNWQ/o.jpg"
      }
    ],
    "user_id": "uf57PZhQWo8gAsQukDIXJA"
  },
  "AVZc4rTkbZJ8iSx1TqEkcQ": {
    "date": "12/10/2017",
    "text": "I'm generally not a fan of tapas, due to generally being overpriced and not filling enough. However, occasionally I will find that my decision is forced, as it was this night after wandering around for an hour at 9:30pm trying to find somewhere...anywhere to eat...that didn't have 1-2 hour long waits. London - what the HELLAnyway, we found ourselves desperate and starving in this little place, and I don't regret it one bit. The ambience was cozy, and our waiter was polite and patient, even though some of the people in my party were clearly getting unreasonable and hangry. We started off sampling the charcuterie, which was marvelous - the cuts were not overly salty like so many charcuteries, and had just the right amount of fat to make the meat feel ever so tender in the mouth. For our tapas, we had the squid, the belly pork, and the duck. The squid was by far the best - cooked to perfection in a spicy tomato sauce with chickpeas. The duck and pork belly were tasty as well, with marvelous crackling over the pork. Overall, the food was a solid 4 - not mind blowing, but quite excellent all around. In terms of pricing, we probably ordered a little too much food (9 tapas + charcuterie for 3 people), but we ended up paying around 40 pounds a person, including drinks and food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n84ezbfLhfV2gIp_eE7lRg"
  },
  "hYdN4TMTGfbhAe0sxNdggA": {
    "date": "6/9/2018",
    "text": "Such an excellent find on the crowded and ever popular Ganton Street.  If you're in the mood for Spanish tapas, the food here is as authentic as any restaurant in Barcelona!  Flat iron steak perfectly seasoned with amazing olive oil, sea salt, sautéed spinach and spices. Paired with mussels in the most amazing creamy wine reduction sauce and the perfectly baked flat bread, this might as well have been dinner instead of a quick tapas and beer stop.  Oh yes, the beer!  Recommended by our waiter, it was the evolved version of the Spanish beer, Estrella that was formulated by a multiple star Michelin chef.  Hilariously, the most popular beer was the first one on the menu and not this amazing drink of the Gods. Simply amazing!  Definitely the highlight of the day, especially with the friendly service and trendy decor.  Too bad all the food was gone by the time I thought to take photos....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UoBtNjsKfJMMDZ3VqymR8w"
  },
  "CfOy0bzMzhmQByZqES3P8Q": {
    "date": "8/14/2015",
    "text": "If you're strolling around Carnaby Street in the middle of Soho on a weekday evening (any day after Tuesday) and are looking for a spot to eat without a reservation, you're in trouble! We found ourselves in that very spot on a busy summer Wednesday evening. It was drizzling, but the streets were packed with tourists, office goers and everyone else just looking to have a good time. We love Tapas and took a chance and asked Dehesa if they had room for 2. First they told us it was an hour wait and then when we asked if we could hang out at the bar, the host took us to table at the back & said we could use it, if we promised to vacate within an hour (he had another reservation past that). With neck to neck tables, and barely any place to go squeeze in and out between tables, Dehesa  really is a test of your ego!! We quickly ordered our tapas - Sauteed Prawns with Riso di Venere, Manzanilla Sherry & Toasted Walnuts and the Trofie pasta with Aubergine, Fig, Pine Nuts, Mozzarella and Tomato Sauce. It all sounded very fancy, but looked quite ordinary when it arrived! Not blown away with either of the two plates - the pasta dish was too tomato-y and that overpowered everything else. The prawns were slightly chewy and lacked any real flavors. Prices range between 7-9 GBP as an average.Overall my verdict would be that this is a decent place to grab a few drinks and then move on to someplace else for the food. As an aside, they had a great cheese selection, so might be worthwhile to try it.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "OFMRkigNjGBraNPKVk0MZg",
        "caption": "Photo of Dehesa - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OFMRkigNjGBraNPKVk0MZg/o.jpg"
      },
      {
        "img_id": "p2M41yo150_YJSRs9uNRbA",
        "caption": "Photo of Dehesa - London, United Kingdom. The pasta tapas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p2M41yo150_YJSRs9uNRbA/o.jpg"
      },
      {
        "img_id": "BkzF71YmPhrJFH8xSMdVjA",
        "caption": "Photo of Dehesa - London, United Kingdom. 4 prawns for 9 pounds; definitely overpriced",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BkzF71YmPhrJFH8xSMdVjA/o.jpg"
      }
    ],
    "user_id": "3pmKsT46qo91FL4A7NVShQ"
  },
  "VMkXE9LB2rfaMsGj4EfPyQ": {
    "date": "9/29/2016",
    "text": "Great Spanish style tapas bar with several options for drinks including beers, wines and cocktails (specializing in gin and tonics). The GTs come in a large wine glass and are delicious! It comes with a whole bottle of tonic so be sure to taste as you pour so not to dilute your gin too much. Service was good and there is great outdoor seating for nice weather. We also tried a few tapas:***padron peppers - so excited to see this on the menu as this was one of my favorite tapas in Spain! This was a popular order and I saw it on most tables***italian charcuterie plate - great for sharing***quail eggs with dried pepper dip",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kamYd0yguQlwpkW7M9CmRQ"
  },
  "pbpx7dc15GCGqpp3Iyjuhw": {
    "date": "5/22/2015",
    "text": "Carnaby street is a huge shopping destination so I often forget about all the lovely little bars and restaurants in the area. Dehesa is one of those places, a lovely little tapas bar at the corner of Ganton Street, great for a glass of wine after shopping or work. You can also select a few tapas dishes to share between your group or if you are quite hungry you can pick the set menu and sample lots of different flavours. I particularly enjoyed the chorizo, the trout and the aubergine as well as the deserts that were all great! If you would like to book the place for a professional occasion you should consider the downstairs dining room that fits about 15 people. We booked it for a company dinner and were all very satisfied with it. The staff were all very attentive and were always trying to make sure everything was ok, while topping up our water and wine.In general everyone had a lovely time, enjoyed the food and drinks and we were also able to have a great discussion without the music being overpowering. I would definitely recommend the place and will have it in mind for future events in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GgEs56GgDmhWb2Uh8Lq9Pw",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GgEs56GgDmhWb2Uh8Lq9Pw/o.jpg"
      },
      {
        "img_id": "GNyn1TJL2Zr73Tl9sxdlqQ",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GNyn1TJL2Zr73Tl9sxdlqQ/o.jpg"
      },
      {
        "img_id": "swLdbO4nN6cjUkWgAO-drQ",
        "caption": "Photo of Dehesa - London, United Kingdom. Aubergine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/swLdbO4nN6cjUkWgAO-drQ/o.jpg"
      }
    ],
    "user_id": "YvDd_HOaHJGYUYMq_H2imw"
  },
  "myuqxadyUkfUYs10M1TrqQ": {
    "date": "1/12/2016",
    "text": "the scallops were OFF!!! Not need to say anything else, when told the waiter took the scallops and left didn't say anything? nobody came back to the table to ask if everything was ok?...mediocre service dreadful food! Wont be back!! was here 2 weeks agoawful food disgusting service!!won't be back!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MscC6razp5uKYQL4p0erQ"
  },
  "KdbVzG1Iyri1ulJu038Syg": {
    "date": "5/27/2014",
    "text": "Food: We ordered the bread, jamon serrano, padron peppers, prawns, beef and patatas fritas.  Everything was very good. Drinks: We ordered two glasses of red wine.Price: For two people we paid 61.88 GBP. Ambiance: The restaurant has a very easy vibe about it and was comfortable. Service: The service was great.  Our server was very nice, attentive and helpful. Would I go back?  Yes, if I was in the neighborhood and in the mood for tapas.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR6guAvsmsMX27bfFJ_Kzg"
  },
  "tE0Hdfrvl_DzFh7nQ4Klsw": {
    "date": "6/1/2015",
    "text": "Dehesa is a longtime favorite. My latest visit was late on a Saturday afternoon for a glass of wine and some nibbles. The outdoor seating area is first come, first served so we missed out on that. We were able to be seated in the main (read: intimate) area and there's also communal seating in the bar.The service was friendly and reasonably efficient. The Sangiovese wine by the glass was nice. Hubby and I ordered the Spanish cheese plate and the Italian charcuterie plate, both of which were outstanding. We also ordered extra bread, which was amazingly delicious. It was the perfect late-day refueling stop. A tip: book ahead if you're visiting for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7ocG8UaRA4CJ8iUlgmldA"
  },
  "xWYlK3S6ugpCoA9ko6M6CA": {
    "date": "12/13/2015",
    "text": "I ended up at Dehesa on Friday evening, after my friend and I tried to go to Dishoom in Carnaby at 9 PM, only to hear that there was a 45 minute wait even at that hour. Dehesa is right next door and it is a sister restaurant of Opera Tavern, which I went to a few months ago and had a great time. We didn't have to wait long for seats at a sharing table, which is essentially a long table with groups of 2 seated across from each other in a row (this is similar to Ottolenghi Islington's arrangement). We ordered 2 of the croquettes, the pork belly, braised ox cheeks, crab gnocchi, and grilled portobello mushrooms. The croquettes were great, but the main dishes were marred by the fact that they were served either lukewarm or cold. We sent back the crab gnocchi after my friend asked the waiter if it was meant to be served cold. They brought back another version and it was still partially cold. The food also took an exceptionally long time to come out. And there was no apology on the part of the restaurant. This may have just been a problem with the staffing of the restaurant on that day, or something overlooked by our server, but I was very disappointed with the service. Dehesa is part of a well known group of restaurants and I had high hopes for it, but unfortunately on this occasion it did not deliver.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "GDDIs_N5r28s16HYEBHgFw": {
    "date": "4/29/2015",
    "text": "Further to the previous comment try the Apricot and Frangipane Tart os small but to die for .... Enjoy that pice of Heaven.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbK1H8xKxxs4AHRheU5CsQ"
  },
  "FKDOhQY_1pJTs2k9wseihg": {
    "date": "11/24/2014",
    "text": "A great place to get tapas! I recommend the pork with truffles and the octopus! There's a good selection of Spanish and Italian wine. And the location is very nice, it's nearby carnaby street.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4PdDFK8OYTx3UY-dQxOtJg",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4PdDFK8OYTx3UY-dQxOtJg/o.jpg"
      }
    ],
    "user_id": "b_lkssJL-ckT2D9vhjW_cA"
  },
  "3EXj1zJG6K0hFEWVtHRWZw": {
    "date": "10/7/2012",
    "text": "Really creative tapas, with Italian, French, and English influences put to good use. Come here if you want some interesting alternatives to regular tapas. The prices are reasonable, the portions are decent. The only downside is that its such a tight squeeze inside, and the service didn't seem up to par for the 12.5% service charge.Review by The London Insider",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "XP7WKmCfmejpyYWIfWpddQ": {
    "date": "1/12/2015",
    "text": "Can be very crowded on weekends, but great when visited during off peak hours (eg 3pm). Food is great, albeit the narrow range. But nothing beats their bread! It's what keeps me coming back for more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mtbxQRghUytJivUBcOkroQ",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mtbxQRghUytJivUBcOkroQ/o.jpg"
      },
      {
        "img_id": "MbATKsTRprcwlsPB6ovAuA",
        "caption": "Photo of Dehesa - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MbATKsTRprcwlsPB6ovAuA/o.jpg"
      }
    ],
    "user_id": "IEPd59cOzfWx_3BmwsHOCQ"
  },
  "4_TN4-Zjy5Wgt5hrg6Nw9w": {
    "date": "2/20/2014",
    "text": "Hmmm, once upon a time, it was a great venue. Now, I think the food quality has dramatically gone down... I had to send backs few dishes and nothing is right... Some too salty, some burned, some with not enough flavours.... The best thing there, cold cuts and toast :-)I am not sure if people can taste what they are eating... If you are in the area and craving for Spanish, try to go to barrafina or brindisa. They are much better.. Even coffee is not great... I think the price is quite moderate considering the location..  Don't be fooled - you would be much better going elsewhere. Such a shame considering how good the venue once was and also strange considering it is a part of the group which owns many other Spanish place in town.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "1CTuyNbZwC93UsXJdlnVjA": {
    "date": "1/12/2012",
    "text": "I've been here a handful of times, maybe four or five. The little piquillo peppers, when they have them, are fantastic. It's tiny, and seating is crowded and generally in group-dining style. It's often very difficult to get seated, though once you do, it's worth it. Excellent wine list, with many great Riojas.It has a staircase to the bathroom that may give you vertigo, and often there's a pig's leg propped up on some cutting apparatus in the front right corner. If you're lucky, you can fetch the seat right below it. Because who doesn't want to eat with a pig's hoof dangling above your head.All in all, great tapas, highly recommended. And if the wait is too long, there's never a wait at the Thai restaurant next door. It's not that great, but hey, for an immediate backup, what do you want? It's probably not fair to attribute that to Dehesa, but I don't care, I'm doing it! You gonna stop me?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ZhcB8kduDlsC3j70GYAOg"
  },
  "vOlGG3k7kSlEhWr1oEF6zw": {
    "date": "8/28/2016",
    "text": "This was a nice alternative on our trip to London. The tapas were very tasty, and there was a very nice and varied selection. We went on a Saturday night, and it was quite lively. You might not expect it, but this was a good choice for families. The staff were nice and very helpful. The location is of course great. Super fun area to walk around. The chicken was particularly delish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jtFXw_-QIZ-cxfrxZVy9jA"
  },
  "xdQC_7suHYZDhSFuJYpVhw": {
    "date": "7/17/2016",
    "text": "Amazing tapas spot in the heart of soho - all of our dishes were extremely flavorful and would absolutely recommend if you find yourself in the area and craving tapas. Especially good dishes were the: risotto with crab, gnocchi with asparagus, and roasted chicken",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhcmTF0o-IyBDXqrpeY7ww"
  }
}