{
  "aCCpXrG4-U2xuCDZ5uau3g": {
    "date": "12/19/2008",
    "text": "Friday night, 3 October 2008Monto Water Rats Theatre, Kings Cross, London Venue: The venue is warm and inviting, frequented by a cool crowd covering a wide age-range, who seem relaxed and at home here, allowing you in to their secret hideout without much more than a casual backward glance, as you squeeze past them and make your way to the Sound Stage.themonto.com  I arrived in time to see Mirrorkicks start up. My first reaction was to put my fingers into my ears and soften the deafening sound that I've managed to somehow become unaccustomed to in the very short while that has elapsed since seeing my last loud! live band. It didn't last long  before the 3rd line of the first song, I was starting to enjoy the noise, and realize I was just exactly where I most wanted to be profile.myspace.com/inde…  The 2nd act was called In the Annexe. My first thought on them was: Professional. They come off like a band that you feel you should've paid a lot more to come see. They are polished, well-presented, slick. Strong, unique-sounding vocals. It's Britpop with a distinct fusion of electronic sound that has a New Wave feel. They call it Indie-Rock.myspace.com/intheannexe  Finishing up it was Slummin Angels, a trio of youths comprised of 2 girls: lead & base guitars also covering lead and back-up vocals, and a shirtless male drummer. The drummer's wet chest was a distraction  he started sweating almost as soon as they started to play, and just grew in wetness till he looked more like a body-builder ready for a photo-shoot than a serious drummer, but I guess that's all part of the act. It's Indie-Rock/Punk. Pleading vocals with that slightly off-key punk sound.profile.myspace.com/inde…",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AQgRPu2-pg3ZGu37pk-ufQ": {
    "date": "11/7/2014",
    "text": "Amazing restaurant. The service is outstanding. I recommend to anyone looking for quality fish and chips.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Az0enqHEyOSTk3c8bT8g2w"
  },
  "LAqLU-5rpJfdxL6TLj50Wg": {
    "date": "1/25/2013",
    "text": "Great little place off busy Tottenham court road. The fish and chips was fresh and delicious. Not greasy, mushy or overlooked like so many places. Perfect place for a low key not expensive meal. The Greek/Cypriot food looked good too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7rgejUKaM1KGmWd3O5ZX_g"
  },
  "pdamqO7ekpFXG5gwm7UkMA": {
    "date": "12/23/2008",
    "text": "I did not appreciate this place enough when it was my local fish and chip shop. I don't ever remember bad chips from here, not even on a busy friday when i've noticed that a lot of places undercook their chips in a rush to meet the demand.Great chips and the eat in section always looked nice, even though I never took advantage.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "3UsOoqq-uKCyOW9U7qNusA": {
    "date": "7/20/2009",
    "text": "This venue is where I first heard Jack Savoretti and Cassette. A warm and welcoming pub/theatre that offers the very best in live music.Missed an opportunity to see Cassette play last week but got my tickets to see Dawn Landes play in August (highly recommended). easy to get to from the North too. Just 2 mins walk from KX. Genius!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "c49lhlp0DyDcBgA9SGFMrw": {
    "date": "6/20/2008",
    "text": "Wow, I discovered this place at lunchtime and it was frankly brilliant. I can't claim it was my idea to go, but I'm full up and very happy right now. The chips were yummy, my sausage in batter was perfectly coated in the crispiest batter ever and the curry sauce was very perfect. What shocked me was the price. It was only £3.20 for all of this! And it was a jumbo sausage! Those of you who know the area will know that if you venture onto Charlotte Street it's not cheap. Would anyone forgive me for using the term 'cheap as chips'? no. Thought not. This place has made me happy. It's also made us all very sleepy and our office still smells of grease and curry sauce three hours later. It's brilliant.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vu6biJNnI9QFMWk7cjjltA": {
    "date": "7/17/2011",
    "text": "The food was great and the service was wonderful. There was 6 of us and we all received everything that we ordered the way we ordered it. Perfect place for students and young couples. Very good looking restaurant too. I have been to many restaurants, but this one really impressed me. The prices are not fast-food low, but they are pretty low for the quality and the quantity that you are getting. I had a salad, lamb and chicken plate with, again, salad on the side and fries, two drinks and I paid about £15.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4sGg7KBlNPdr7nerru8kg"
  },
  "iDzB5eBx2o3Tql7cwU-pXQ": {
    "date": "7/22/2009",
    "text": "I was at the venue for the first time yesterday to see the marvellous Carina Round. I had never heard of the venue before booking my ticket (ticketweb handle the booking for the venue) but it seemed, judging by the walls of well recognisable faces, that many before me had! The place itself was very easy to find and coming from someone that has no sense of direction whatsoever that is saying something! Out of Kings Cross, grays inn road is clearly signposted and the venue is but a short walk down the road on the left handside. It is worth noting, before I forget, that there is a cashpoint @ a bank handily placed next door to it so no worries about running out of money. I never tried to pay by card so not sure if they accept it so forgive that oversight on my part! Once you are in the venue you are met with a bar to your left handside. The layout here looks like any other random camden-esque pub out there but walk to the closed off area and you find another room where the magic happens. The space itself is intimate and can accomodate about 150+ comfortably. The sound system was serious and my hears were crying from the moment I stepped into the space. There is a TV feed in the main pub area so you can see what is happening in the gig area. Not sure if you could just come in for a drink and just watch the gig whilst having a drinkyes, another oversight on my part (makes me feel like phoning up to clarify all these loose ends!) They have the usual fare on tap and the guinness was nice and cold but drinks were served in those faux glasses, which to me is worse than plastic because it tries so hard to pretend it is not. Yes, I need to get out more The toilets (ladies) were adequate. Not the best I have ever seen but most definitely not the worst. There were about 4 cubicles which meant slight queues forming during sounchecks and band changeovers but I guess that is to be expected anywhere. I enjoyed seeing the pics on the wall of some of the people that have played there in the past and my fave was of Skin of Skunk Anansie fame (wow can't believe I recalled her name just like that) What else2 lemonades were just over £3 and 2 half pint of guinness came to just over £5. Staff seemed nice and chilled and there was no troubled sorts hanging about. I didn't notice any security about so I figure it must be a pretty sound place at the best of times. I would return for sure and with its great location next to mainline public transport, its not an hassle to get home after 11pm.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Zj3q4lccPhTFNH00waUoOg": {
    "date": "12/26/2008",
    "text": "Beautifully unhealthy this fish and chip shop are true to the, dare I say cuisine. Eat in and a take away service with friendliness enough to make you want to come back, the chips are a real pick up. A typical to try out is the fish and chips roasted in your sight and soaked either in vinegar or ketchup.  one portion of chips is really large enough for two to share at £4.00 including the choice of fish from haddock or cod.  Also little known for its kebabs, munch away on a wrap of lamb or chicken.......ummph its devilish with garlic and onions. Keep in mind you need a proper mouth clean after this type of meal. Its got the perfect boyish tough cockney charm that comes with borderline charm. hahaha",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AmgGjiGtZKY9_UDbIwuEBg"
  },
  "3e6R_b9_XxTSHGuJmsG3Rw": {
    "date": "9/30/2009",
    "text": "I saw Mirrorkicks that night and they were good but their last gig I went to a couple of days ago was amazing! Their cover of Bleeding Love rocks! I'm listening out for them on XFM as I reckon they will be a big band coming",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OZ_gkVfHUCXMe0PpCMKl2w": {
    "date": "6/18/2008",
    "text": "Wow great food and real value for money in the West End. They have a very cosy resturant at the back which not really visable from the outside but what a find. The fish and chips are quality and the kebabs that are cooked on real charcol are brill. Highly recommend.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "snNd-O5MvfU3IZlVFlGbpQ": {
    "date": "8/4/2010",
    "text": "gigs fish bar used to be a nice place.now i think chinease they took over the shop.i ate chips ,they wasnt nice.staff was so miserable.i will never go there again.staff asked me ,wht u want ,so aggressiviley.i wouldnt recommened this place to anybody.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AgIjHt8xtEyAfv-GY1iXQA": {
    "date": "8/24/2015",
    "text": "Very mediocre fish and chips - gave this place two tries, eat in and takeaway, both disappointed! Chips  tasted microwaved and fish was soggy. Way better fish and chips elsewhere in the area!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gKV1U78NbGrIy4JHBx6THA"
  },
  "DqctZ5Deud47YcthQ7pwkw": {
    "date": "3/5/2013",
    "text": "Aah Gig's! How I miss working nearby...As others have said, Fish & Chips AND Kebabs!The décor in Gig's is so old it's now back in fashion. I can imagine all the Shoreditch hipsters decorating their dining rooms this way. It's got character but don't come here for a romantic date lol :)Anyway, you get huge portions of good food here for a decent price. It's worth a visit if you want to try fish and chips, but for kebabs I'd recommend other places over this one (but they are still the best kebabs in the area).",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cue1uXN_0nIQGX-4J7b_BQ"
  },
  "LPQFNHB0TgxIC_Shl9CuJg": {
    "date": "4/23/2011",
    "text": "I like this place! Aristos & Chris who runit & their team of amazing staff are whatmakes me go back for more ...... that &the best fish ever. Great on a hot day tosit round & chat too. They are generousfunny & care about us locals ...It gives me pleasure to recommend them!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xm8pVNsiaO1x_34eRusc9w",
        "caption": "Photo of Gigs - London, United Kingdom. Aristos inside Gig's",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xm8pVNsiaO1x_34eRusc9w/o.jpg"
      },
      {
        "img_id": "Jqe9c4L8L75CrpylLlMLcg",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jqe9c4L8L75CrpylLlMLcg/o.jpg"
      },
      {
        "img_id": "K7_EcdVWJBnJTujxbF5eNQ",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K7_EcdVWJBnJTujxbF5eNQ/o.jpg"
      }
    ],
    "user_id": "5yuHp8kydkGAu9WctLlCBQ"
  },
  "_ij5tOazjIcRy-EZaiVYZQ": {
    "date": "1/16/2012",
    "text": "I entered the restaurant through the front door, which to be honest, is not much different to how I enter most restaurants. Occasionally I try to enter through a back entrance, or perhaps through the window, but when I do; people tend to look at me funny.After I entered the restaurant, I sat down and had some food and after it was all over I left. From what I have written so far you would assume it was a normal food-eating experience. But, you see, it wasn't, it was superior to that. That's what you want when you go to a restaurant. You don't just want nice food and to leave, you want to feel GOOD. You want to think YES, THESE PEOPLE CARE ABOUT THE FOOD, AND CARE ABOUT THE CLIENTELE.I apologise for the capital letters; but it's not my fault, I didn't invent them.The menu was simple yet, at the same time, had a good selection. And the food was great. I thought that and so did everyone else. And by everyone else I mean EVERYONE else; you see, we took over the whole restaurant because it was a birthday party and there were a heap of us. The staff were so accommodating. The boss was happy and in a great mood. So often they fake it, you know what I mean? They put on a smile to earn your tip. But this guy loved it. He was there with us. You can't beat service like that. I should, at this juncture, add in a small point which perhaps does mean I have some bias: I fell a little in love with the waitress. Not a LOT in love, just a little, to the point where I kept forgetting where my mouth was when trying to eat food. I was hoping that she was falling in love with me too, and thought at one point that maybe she was. My evidence? She ignored me all night. This is what women do when they want you. Actually, towards the end of the night, she did talk to me, but only because wine had been dropped all down my top and she came over to give me some tissues and to shoot me a look which can only be described as a 'boy, you're retarded' look. I had Calamari for starters, and Lamb Shish for the main; although someone did steal most of my pitta bread, although I can't blame the restaurant for this but only members of my family. The food was great, and everyone else thought so too -- many ate the fish, in fact, I heard two people say it was the best fish they've had in years. The night ended on a sad note for me, disappearing into the night and leaving the wonderful waitress behind, even though we were evidently 'meant to be' -- and by the way, she looked quite a lot like Ellen Page from 'Juno', to the point where I almost asked if they were related --- I would have asked her if in fact I was capable of talking to pretty women but unfortunately all I can do is drop lamb shish on the floor while looking bemused and awkward. Check this place out, it's a great London secret!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 10,
      "cool": 1
    },
    "photos": [],
    "user_id": "CpqbhptBIhSI9t0dukZdjQ"
  },
  "PLHU7EaJX_Y7XlXGxaMxMQ": {
    "date": "10/31/2014",
    "text": "Beautiful fish, proper, fat chips. Reminds me of the seaside. Very good quality and reasonably priced. There's even a lunch deal for £4.99. If you're in the area, I really recommend checking it out.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "rjhFD6WeT0bCHGMwf4NMVw": {
    "date": "3/13/2015",
    "text": "Worst fish and chips I've ever had. Ate in at the restaurant and they don't fry their fish and chips fresh to order. Um what? They came out so quick and when we asked the waiter he said 'oh it's a busy place so we fry all day..' So basically we got fish and chips that were previously fried and had been sitting in the window for however long. The batter on the fish wasn't crisp and the chips were the worst I've ever had. The mushy peas were disgusting and none of the food had seen a grain of salt. So bland. When we asked the waiter why the fish and chips aren't cooked to order he argued with us. 1 star because he took my order of fish and chips off the bill because I hardly touched it however I won't be coming back",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M-JjPASfNIqtpR9MF9Xsaw"
  },
  "otHLM7StYzHfm6kbVvTXAg": {
    "date": "6/12/2012",
    "text": "An excellent place for take-out lunch.Like most other places, the falafel wrap comes with a greek salad medley together with garlic and chilli sauces (at your option).  Unlike many other places, the salad and the sauce work very nicely to complement the falafel.  Rather than tasting like filler designed to bring the wrap up to fighting weight, the salad actually plays an important role in their wrap.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoIo3hT6LOW0GCLbsiSBCg"
  },
  "UrEL_Uqx_l4YWq-cWxsdqg": {
    "date": "9/26/2010",
    "text": "Nice dining area and full on a Thursday lunchtime. I had the recommended special of roast lamb knuckle, served with roast potatoes and salad, which was indeed very good.Fast service, catering to the lunchtime business crowd.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0C_wfnd3v2DpowgGN51TNQ",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0C_wfnd3v2DpowgGN51TNQ/o.jpg"
      }
    ],
    "user_id": "GFkDRbR4n-TstOIuFn25Og"
  },
  "jHrEylKoQrhZ4pNbIWSRoQ": {
    "date": "11/5/2012",
    "text": "This little fish and chips restaurant is very nice, the actual eat in area itself is small, but it has a downstairs area, but the actual restaurant is just attached onto the takeaway section., they have music playing through a stereo, which is run off a USB prepared playlist. The food itself was great, they give very big and very generous portions. I had the cod and chips, the fish was so fresh, I could not believe how nice it was. The sauce they give you is just wow! Atmosphere, wasn't really much apart from the people I went with, as it was empty. But I can imagine on a busy day at a decent time, would be very good. I do like this place, a lot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcpS6c--QNJvU7VYhDO_zA"
  },
  "JGCsGmRx-5Mkm4gRJhfi2A": {
    "date": "8/1/2014",
    "text": "Very good fish and chips but slightly over priced! Only tried take away so cant comment on eating in",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQ_0QVxhbhbfHZj3qFO6Lw"
  },
  "YuhOiMHRZWUinGFaKYkMyQ": {
    "date": "2/3/2015",
    "text": "I had fish and chips for a takeaway from here. The service was so quick i could hardly could get my wallet out in time. The portion was a good healthy large one and very tastey - £7 - pricey-ish for a takeaway but very tastey.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WemV7dLpu4n5GqQpLXJPPQ"
  },
  "0Z1a_qzvqnpM0ptKOy5KCQ": {
    "date": "11/19/2014",
    "text": "Tried this place because it was down the street and I'm pretty new to London so I decided to give it a shot. Ordered some mixed grills that came with a salad and fries. The meat was pretty lackluster -- and the shwarma (which I usually love) was just plain gross. Fries were also terrible (frozen kind). Unattentive (but polite) service as well.Wouldn't go back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yo91IX-9pcwz_yTQLx9VPQ"
  },
  "GMU7j9NCMT8Qk4kN0Zhlow": {
    "date": "6/4/2013",
    "text": "My wife and I had high hopes heading to Gig's last night to introduce an American friend to proper British fish and chips.  Unfortunately, we walked away disappointed.  The restaurant itself was nice, and the service was good.  The fish was actually quite good--all three of us thoroughly enjoyed the meal.  The chips, however, were just awful.  Soft, squishy, pale yellow--as if they were intended to be double-fried and forgot the second frying.  Too bad really, given the fish was so good.  Fish was 4 stars (and very generous), chips were 1 star.  With mushy peas as a side (what?) and a rather uninspired beer list, I'll round down to two stars.  I hope my experience was the exception, but I'll be going elsewhere in the future.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49oc-E2obqE7f9fo10kBnw"
  },
  "dqK3wn_6-8CewY_pYKaGgQ": {
    "date": "7/28/2012",
    "text": "'Gigs' went through an extensive refurbishment and  re-opened in their new \"upmarket\" form late 2009. The bunch who run it now have been doing so for about 7 years as of April 2012, so they are not the same guys whose kebabs are so fondly remembered from the 1980's. The place is very clean and inviting and has more of a sit down feel to how I imagine it was before. The staff were all very welcoming and friendly and the atmosphere was nice and relaxing compared to the rest of the busy W1 area.I ordered a medium Lamb Donner at £6.90 for a sit down plated offering which included Chips.The presentation was good. A main plate of the Lamb strips with a truly artistic salad of shredded lettuce, red cabbage, onions, cucumber, finely chopped tomatoes as well as small cubes of Feta cheese, some black olives, a few whole cherry tomatoes, herbs and a pickled chilli pepper all seasoned with lemon juice.The chips came in a separate small bowl plus a basket of pita bread. A ramekin of Chilli sauce arrived on request.The meat was a real letdown. The Lamb Donner had very little taste and even IF it was spiced more it would remain dry and below average. The amount of meat also seemed small but it is hard to tell because I usually have it inside the bread.The Chilli Sauce was a tomatoey ketchup styled one, which I am not keen on, but of its type it was not too sweet so acceptable. The chips were strangely pale in colour but cooked through and better tasting than my local chip shop does.The sliced pita bread was warm and fresh but was a little soggy, maybe they steamed it instead of toasting/grilling?The salad was GOOD in the Greek style; the one chilli was vinegary and hot!The service could not be faulted. A warm greeting on arrival and a cheery goodbye on departure, prompt table service throughout AND a willingness to entertain my questions.I only wish I could compliment the actual quality of the Lamb Donner. In conclusion, never mind the shop refit - the MEAT is in dire need of an upgrade.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7pJgfg5g5q3R4IHf_dqlw"
  },
  "4GLWtvxLv3ya4WCmXHuiBw": {
    "date": "6/3/2011",
    "text": "The scampi appetizers were very good here. I actually liked them more than the main dish. I wish they gave more of them, but it is just an appetizer I suppose.The cod was huge. Along with the chips, it was enough for two people to share.The service was a little slow, but easy enough to wave down for what we wanted.One odd tip: the bathroom sink is a bit weird. To turn it on and off, turn the base of the faucet. If you look at the faucet, you'll see the base of it is separated into two small square blocks, turn the top one to get the water flowing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_v90uIthZQa_xdNbUclTcw",
        "caption": "Photo of Gigs - London, United Kingdom. The scampi (calamari or fried shrimp to Americans). It was better than the fish and chips, but not as filling.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_v90uIthZQa_xdNbUclTcw/o.jpg"
      },
      {
        "img_id": "RrA12W1MA9UMwmAqY9mnXw",
        "caption": "Photo of Gigs - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RrA12W1MA9UMwmAqY9mnXw/o.jpg"
      }
    ],
    "user_id": "SDNOcTf_iepqRywwG2EqEQ"
  },
  "FTwjEv4K2ED7X_kty071aQ": {
    "date": "12/19/2008",
    "text": "MMMMMMMM  MMMMMMMMMM, this - my dear friends - is a bit of the biz.  It's so close to Goodge Street tube.  Come out, ignore the Scientologists and run come find this place.  If you're hungry, it's just were to come round here.  It's delightfully simple - a good chip shop.  But there's two really tip-top things about the chips, and here they are:-At number one, they're delicious.  Properly soggy, chunky just cooked to perfection.  And clearly off the potato, so none of your McCain lets make everything look the same kind of chip, nope, these came off the potato and whoever cooks them knows how to do it right,And at number two, they're so cheap.  I went in with an assortment of coins.  \"How much are your chips mate?\" - \"One pound fifty\".  Just like that.  And they'll wrap them up in a massive cone.  And there's salt, vinegar, ketchup and mayonnaise on site so you can do it how you like.  I'm afraid that's all I got here.  A cone of chips.  But it was so worth it, and I have a theory that the further south you get in the UK, the worse the chips get.  And Gig's bucks the trend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r8_9qVF3AYeB_v7m7c-Dfg",
        "caption": "Photo of Gigs - London, United Kingdom. exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r8_9qVF3AYeB_v7m7c-Dfg/o.jpg"
      }
    ],
    "user_id": "9p_cITa30ZvlxBltHWrpCQ"
  },
  "a_lUqWS2tlvOP-ErmHTo-w": {
    "date": "9/12/2013",
    "text": "My friend professed \"a massive craving for fish and chips all day\". \"But we're in central London\" I cried, \"no where near Poppies.\" I asked about, and a colleague suggested Gigs.By 6.45pm my friend and I were plotted up at a table for two, marveling at the varied and interesting clientele and smiling at the table of old people next to us. Honestly, it's like being transported to Eastbourne (in a good way). It's a dated, cafe style set up with laminated menus, lots of mirrors and kitch pine. But I think that's necessary to make sure it retains its status as a chippy. My friend had fish and chips and enjoyed it immensely. I don't know what else to say really. Decent fish and chips from a chippy - it's as simple as that. Proper chip shop chips and a battered cod as long as your arm.I had the chicken souvlaki which was a little disappointing to be honest. It was nice enough but more of a satay skewer than a shish skewer you get in most kebab shops. I have no one to blame but myself... I shouldn't have gone off piste. And I was happy enough with the chips anyway.It's got a real family feel, and the staff are just lovely, falling over themselves to make sure you're happy and comfortable. Service how it should be. Service the Greek way no doubt. And a healthy dose of banter too. If you're in the area looking for somewhere quick and easy for lunch, or you have a craving for fish and chips that needs to be settled you could do a lot worse than Gigs. I wish I'd known it was there when I worked on Newman Street.  I'll definitely be back soon.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NhoSFyZKpfOH0XC3BTP6hg"
  },
  "Wht4dkBD-tTNpgpn_DRhlw": {
    "date": "5/15/2015",
    "text": "The fish was too greasy and it was almost impossible to eat it from the takeaway paper bag. Moreover, the oil leaked out of the paper and soiled my jacket. It was awful!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gonhuksninPRXO2_sj6q8w"
  },
  "-stHNF3nrDYENq3FNXkUIQ": {
    "date": "4/1/2010",
    "text": "Although 'established in 1958' this place just opened after what seems like a massive renovation to the interior. I have to say they did a good job - dark wood tables, clean bathrooms downstairs, nice atmosphere for a chip shop (that also serves greek food, apparently). However, the food was pretty meh. We split the fish and chips with cod and it was ok at best for around 9 pounds. The fish was fresh which was good, but the chips were blah and served with packets of heintz tartar sauce. The mushy peas were beyond mushy, more like blended pea sauce. We shared some hummos which was ok, and some fried greek cheese which was on the extremely salty side. No beer on tap but they did have a cool Greek beer variety called KEO which was different. They've only been open for 2 weeks, so there is room and time to improve, but I can't say I'll be running back yet.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9m9adcWg9h8mRX9idm9Qw"
  },
  "oEQLrtyssOdCz96A7QkDkg": {
    "date": "3/5/2013",
    "text": "Wow!  I always have an idea of what I want fish and chips to taste like... Sadly, it usually disappointing with gummy breading or swimming in grease or tasteless chips.  This was such a surprise for the taste buds.  Perfectly breaded and cooked cod: flaky moist, fresh and delicious.    Chips were also delightfully cooked and flavorful.  Quite generous portions, so delicious that I finished the whole plate, when perhaps I should have stopped around halfway :)    My friend had the grilled chicken kebabs, which were also a fresh and tasty meal option.    Thanks Yelp! for the recommendation... I'm actually getting hungry again just from writing about this!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCB4QtQylxEwlZ0fuZiXdg"
  },
  "jI_-sxIReDe3LFcEPYXRQA": {
    "date": "8/8/2018",
    "text": "Friendly staff, clean atmosphere, accommodating. Excellent fish and chips! Light, airy, not greasy cod. We shared a platter and it was the perfect amount. The fish is so fresh and lovely!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tGTX8DPGgyG06UwLULuzOw",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tGTX8DPGgyG06UwLULuzOw/o.jpg"
      },
      {
        "img_id": "BPIrWb-MDyZ5AylHtIFnCA",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BPIrWb-MDyZ5AylHtIFnCA/o.jpg"
      },
      {
        "img_id": "OG-XogZntOzKHwlgz259yg",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OG-XogZntOzKHwlgz259yg/o.jpg"
      }
    ],
    "user_id": "xTSGTIOABjvcQ49YedeJYQ"
  },
  "zZ996jRldm-j0d7XAu8FJQ": {
    "date": "6/17/2017",
    "text": "Gigs was my first fish and chips experience in London and it was a disappointing one. My friends and I came in on a Monday afternoon after our first choice for fish and chips was closed. So we decided to come here since it was on my friend's list of food places to try.On the way in, we saw a few people who were seated outside, eating the fish and chips. It looked very promising - the fish looked like it was fried to golden perfection. Thanks to them, we saw that the portion was huge, so we ended up getting two plates to share amongst four people. We ordered the cod and the haddock. They both tasted pretty similar, but one was slightly less fishy than the other (I believe it was the cod). Overall, there wasn't much flavor to it but luckily, the tartar sauce helped that a little bit. The fish was fried to the perfect consistency but the chips were not. I'm not sure they even fried those because they looked like they were take straight from the freezer.Would recommend going elsewhere for good fish and chips. But if you want okay fish and bad chips, then Gigs is for you.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aE6KAhY8nnUUyMC2hj66PQ",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aE6KAhY8nnUUyMC2hj66PQ/o.jpg"
      }
    ],
    "user_id": "hwSSM8Jn29dXRW4ym-roDQ"
  },
  "aoEwxL1c2tKxuyCkcBS2jA": {
    "date": "6/26/2017",
    "text": "Lunch at 11:45 am. We were the first ones on property. We ordered cod and haddock, both with chips. Shared an order of mashed peas. Both the cod and haddock come with skin on, and both were prepared very well. Fish was moist, batter good and not too oily. The chips were good - not great. The mashed peas were better than many I've had. Prices are pretty good compared to other places you can get fish and chips. The service was friendly but really slow and inattentive. We had to wait a LONG time to pay our bill, even after I asked for it. Return? Maybe, but we will be in search of other fish options in the area as this one did not close the deal for me.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_oVqcNNlYq8rEBPNn3Fbdg",
        "caption": "Photo of Gigs - London, United Kingdom. Cod and chips 12 pounds",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_oVqcNNlYq8rEBPNn3Fbdg/o.jpg"
      }
    ],
    "user_id": "EJ6_42rw8W73rxm_R4aQ2w"
  },
  "8VcZBcWk_BXT3SBbJZxZUA": {
    "date": "8/8/2016",
    "text": "This is mostly a take-out/take-away serving fresh Fish & Chips. £4.99 Lunch special until 4 pm--that was my choice.Tasty and fresh.Will return when in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vRmWDVoKlXAdG7J1slilvg",
        "caption": "Photo of Gigs - London, United Kingdom. Cod and Chips with soda Lunch Special",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vRmWDVoKlXAdG7J1slilvg/o.jpg"
      }
    ],
    "user_id": "DKulUOOXpLnY8hb-gmlxIQ"
  },
  "yl6l8XiNxmDEtvls9v4xTA": {
    "date": "7/28/2018",
    "text": "One of the best meals I've had this trip to London. Got the Cypriot kebab and nearly died from pleasure. The salad was fresh and balanced the guilty chips nicely. This place should be busier. Great service!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "guR11PPPXBx_n6Qx4M1jDw"
  },
  "e0K5TjuRdTssp9NuS4tcWg": {
    "date": "4/20/2017",
    "text": "My friends and I came here to try authentic British fish and chips and we're utterly disappointed. Like most of the British food we've had here, the cod and chips had no seasoning. I couldn't even finish the meal, eating less than half of the fish and some of the fries. Definitely not coming back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Du8505bNFN0UBORysdnVLA"
  },
  "zO-J-zB4Vkje5PuX9pty6Q": {
    "date": "5/10/2018",
    "text": "I had a large fried haddock, my wife had broiled salmon. Both dishes were excellent. Mushy peas were superb. Service was attentive. There's a lot more to the menu than is on Yelp or their website. Meat eaters won't feel left out. Very cozy setting and clean bathrooms. Great place if you have a fish and chips jones.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WNlPY4bCqc5wOucAurx65A"
  },
  "_hnCY3zvfWlObhPR-6lkmw": {
    "date": "10/13/2017",
    "text": "Seems expensive for fish&chips (£12, 2017), but it's really worth it. Cod wasn't oily and chips british style. Service was friendly and attentive. Nothing to complain.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "727lcfgQwze9IcYgKfurbw"
  },
  "JaLpcb-8iUPFoy2Znh-xMw": {
    "date": "10/31/2012",
    "text": "Fish 'n Chips AND Kebabs! And grilled fish. It's so much more than a greasy spot...so c'mon over and have a listen/read. A group of 4 event-weary (read: all wine, no food), nearing 9ish on a Tuesday...in search of a hearty, filling meal? Gig it over to Gig's! The Yelp app to the rescue. Good for takeaway and sit down service, as it turns out. During our meal (sitdown) I witnessed a variety of people entering/exiting to the Gig's takeaway counter, which is actually quite nicely separated from the restaurant seating area....no disturbance and everyone gets their fish 'n chips the way they like 'em! My three compadres opted for the cod and chips, I took a BIT healthier route (begrudgingly) and did the grilled sea bass with veggies and a Greek Salad. Theirs looked DIVINE. MMMMMs were uttered by all. The appetizers lean Greek and were OK, nothing amazing (the haloumi pretty small, the calamari super deep fried and a bit chewy)...the real star here is the fish 'n chips (and perhaps the kebabs, I'll be back to try). My grilled fish was 15quid...a good price for a whole fish and skewer of vegetables. And healthy, to boot. The small side Greek salad was sans dressing and lacked sass...but fresh nonetheless. Our service was fairly prompt and she was pretty nice to us. Drinks arrived quickly. Dinner for four (with tip) under 60quid, good showing. I'll surely be back and it seems to be a gem for takeaway. Noted.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "mISOi2ata5zJE9oMoMcliQ",
        "caption": "Photo of Gigs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mISOi2ata5zJE9oMoMcliQ/o.jpg"
      }
    ],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "M9sGqeG8r5NX4G40D8JIwA": {
    "date": "4/11/2014",
    "text": "I came here by following a recommendation of a friend who work near by and fell in love with their amazing kebabs... and he was totally right!!Their are mostly known for fish and chips but in fact this is a very Cypriot place with lot of Mediterranean flavors on their plates.The restaurant offers both take away and table service.They also make a very very nice garlic sauce!!!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UEXCmm_mV14zsE6XVUigBw",
        "caption": "Photo of Gigs - London, United Kingdom. Lamb doner salad on a plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UEXCmm_mV14zsE6XVUigBw/o.jpg"
      },
      {
        "img_id": "g5333EXzS5fOANnpngrZgQ",
        "caption": "Photo of Gigs - London, United Kingdom. Fish & chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g5333EXzS5fOANnpngrZgQ/o.jpg"
      },
      {
        "img_id": "ELCD-mJWbfFS6lgnN9VMUQ",
        "caption": "Photo of Gigs - London, United Kingdom. Lamb Shish",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ELCD-mJWbfFS6lgnN9VMUQ/o.jpg"
      }
    ],
    "user_id": "dd7QdaHSu-y85OS0fRB27w"
  },
  "GkM9_4DcJFbJHGtcbBT71g": {
    "date": "4/20/2015",
    "text": "Spent my meat free monday here - didn't go well. Sausage kebabs, with extra side of.....sausage.......But hey it was delicious and the fish and chips are most def on point. Good take away and nice fellas that work there. Not recommended for meat free monday...but then again I don't recommend meat free mondays anyway.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFHCTS_0ITw69_lULhHavw"
  },
  "RgucgtpXd4Fcoa4xAE657w": {
    "date": "6/13/2015",
    "text": "How all fish n chip shops should be. They obviously take a great deal of pride in what they do and make sure every portion they serve up is just right - crispy, piping hot chips with fresh fish battered to perfection. I've only ever had takeaway but the restaurant looks nice enough to sit in. Expect queues out the door at lunch-time but they're very efficient and you won't be waiting long.This being right in central London, they obviously have to charge a little more (eg £2 for a bag of small chips) due to high rents but that's no big deal. Recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M9ZTlN5V717HtPiwT8DEWg"
  },
  "EGvsMFulqINqHCvkdkUsLg": {
    "date": "8/2/2012",
    "text": "On our first night in London we went to the concierge in the hotel and ask where a nice fish and chips place within walking distance would be.  He highlight Charlotte street in the Fitzrovia area, which is about a 15 minute walk from out hotel.  As we were walking we came across Gigs Fish and Chips first.  We didn't want to enter the first restaurant we saw, so we bypassed it and proceeded to follow what the concierge had told us.  When we arrived at Charlotte street though we didn't find any fish and chip place that looked appealing and decided to come back to Gigs.At first glance this place is a small restaurant that looked cozy.  They place music on an ipod speaker and the place is a bit dim.  We finally went in and the place was so nice! they seated us promptly and gave us our menus.  The menu is much bigger than just fish and chips, but as a tourist we wanted to try the famed fish and chips.  They had a large variety.  Cod, Salmon etc that was very fresh!  My brother and I ordered the common Cod Fish and Chips (£9.40) and asked the waiter to recommend a side.  He told us the Onion rings(£2.95) are super fresh and so we obliged by ordering them.  We also ordered still bottled water (£1.90).The water was promptly brought to us along with a cup of ice and  lemon slice.  The waiter was super nice to pour my water for me.  Afterwards ketchup and their tartar sauce.  Their tartar sauce was very savory and flavorful.  The fish and chips and onion rings came out shortly after.  My brother and I were amazed at the size of the fish.  It was a huge piece of cod and the crispy outter layer or batter was perfect and delicious!!! It makes me water to think about it now.  I was ravished at that time so I dug in and ate the whole fish with the tartar sauce.  I wasn't able to make it to the chips and the onion rings were only half eaten just because the fish was SO HUGE!  The waiter was very attentive and kind to us.  He made us feel welcomed and even joked with us here and there. This place is a nice casual place to get fish and chips and did a great job with the atmosphere and ambience.  I whole heartly recommend anybody to give this place a try.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L6vXFBkO2hVf3HiBnH9K6A",
        "caption": "Photo of Gigs - London, United Kingdom. Cod fish and chips with fresh union rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L6vXFBkO2hVf3HiBnH9K6A/o.jpg"
      },
      {
        "img_id": "qciB4ouHXPIH0UILXrmAbw",
        "caption": "Photo of Gigs - London, United Kingdom. The menu at gigs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qciB4ouHXPIH0UILXrmAbw/o.jpg"
      }
    ],
    "user_id": "3Ie74uznJAlAwPPGT7HR2g"
  },
  "UO3kFAK4xVreAYituve76A": {
    "date": "12/23/2015",
    "text": "Went here the other night for what was a very nice and relatively ungreasy fish and chips. My friends insisted on going to the sit down, the higher price for which deducted greatly from what was overall a fine dining experience. Four stars for the takeaway, three for the sit-down.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e3xXqCayE5Oo_xpgQifWWQ"
  },
  "vwm2gganSEubV79eh-_UUw": {
    "date": "2/11/2015",
    "text": "Best fish-and-chips style chips I've had since being back in Devon. I only ordered the cheesy chips, so cannot comment on the rest (looked good though!) - huge portion, perfectly cooked, and cheap (sub £3; small was sub £2)! I will be back. Many, many times.EDIT 1: Had a jumbo battered sausage here now. Perfect.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evMRPv4Xw2IchjnxR-7mIw"
  },
  "_CqNzwGE8hb7FeyJkT9nEA": {
    "date": "1/27/2014",
    "text": "I really enjoyed this place. We went here this Sat and came out pretty happy and full on delicious food. I say food because I don't really know how to classify the restaurant - they have the standard fish and chips option, in addition to loads of Greek food and kebabs. I liked the variety as there was something for everyone. We went with some grilled mushrooms and halloumi as an appetizer - we were not yet aware that it was just the beginning of a wonderful dinner. We ordered up some drinks and I chose the traditional lamb kebab as a main. The meat was very tender and well-cooked considering lamb is quite hard to prepare. It was nicely seasoned, with a lot of flavour to it. There was even some side Greek salad which was not really my thing. Service was fast and prompt and the prices are more than reasonable for the amount of food we had. Clearly, the restaurant deserves some attention with its great food and staff.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "OX5X6i_oOy4DKMhYV-gVnQ"
  },
  "cxbQAHd_PHMXPyB2GOGW1Q": {
    "date": "3/14/2014",
    "text": "Had a fish and chips craving while waiting for the sleeper out of Euston, asked Yelp for guidance, found Gig's.  GJ, Yelp.Fish: very fresh, nicely fried, ample portion.Chips: chips.Mushy peas: deserve special mention because I usually find them flavorless and perfunctory.  These were rich and smoky and also tasted like peas.  Is this how they're supposed to be?  I liked them.Service: very friendly and very efficient -- every table was taken when I got there, but they took my order while I waited and I was seated and eating inside of five minutes.  Dayum.GJ, Gig's.  I'll keep you in mind next time I'm in town.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kL-M7e4dBDe3nTr4qLvE_Q"
  },
  "w9MXR8t8al8UDgMkFpd_PQ": {
    "date": "5/13/2015",
    "text": "A delicious fish and chipsy treat for a sunny afternoon. The lunch box special for £4.99 is a bargain and great for a cheeky mid-week lunch break. Nice fish, nice chips - pretty good all round.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "q8i88aes8vg0rDvE-kAgxQ"
  },
  "ZNHxsbZE4ccqzayqCBCdEg": {
    "date": "6/21/2013",
    "text": "Gig's (to date) has given me the worst fish and chips I've ever eaten in the UK.I was apprehensive when I saw they do Fish and Chips AND something else (in this case Cypriot food). My experience with places like that is that they just don't know how to do the Fish and Chips properly. Maybe I should have had a kebab. To be fair, one of our party did order something else, and it did look nice and he claims it tasted good.So the fish. Mine had bones. It also had an incredibly thick batter. Like super thick. Which made it incredibly chewy. Kind of like cardboard. Even the incredible amount of malt vinegar I poured on it (which is standard for me) didn't improve things. It wasn't just like chewing on cardboard, it was like chewing on grease-soaked cardboard. How does that make a delicious fish and chips? (And given that they had a sign in the window saying that they were in the top ten fish and chips places in London, I'm shocked.) I don't want to eat a grease-soaked chewy bit of fish.So the mushy peas. They weren't mushy so much as a puree. It was a pea puree. There was no texture AT ALL. It was kind of gross to be honest.So the chips. They were molten hot. And soggy. Soggy chips = greasy chips. British people claim they should be soggy, but I disagree. I like a nice crispiness and a fluffy center. If I want them a bit soggy, I pour malt vinegar on them (which again, I do, I like malt vinegar).Three wrongs don't make a right. Unfortunately for me the fish and chips at Gig's is just not worth it. They may do a better job with everything else, but avoid this place for Fish and Chips. (Especially since there's ANOTHER chippy nearby that was infinitely better and cheaper).It's disappointing because my theory to date is that even the worst fish and chips in the UK is better than the fish and chips in the US, but Gig's has managed to prove me wrong on that point.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "FR8pVJoccnaKWgqjwBV5Eg": {
    "date": "11/15/2013",
    "text": "I am full of hope for every fish & chip but sadly Gig's didn't deliver the height if fried perfection I was hoping for. High point: the golden batter on my haddock was crispy and delicious and the fish inside wasn't overdone, as happens all too often and the plate came out shockingly fast, like 2 minutes after ordering, which was good cos i was in a hurry. Low points: everything else. It's significantly more expensive than is really reasonable (£10 for a standard fish&chip), although I'm sure it goes toward maintaining a comfortable step-up-from-takeaway space. Overly greasy overall (seriously, I KNOW it doesnt have to be that way) and the chips were a huge disappointment-- underdone and soggy and unsalted although at least that last bit was rectifiable. Another London fish&chippy down... When will I find one to return to?",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpH-6A8PxsFkxfJMivdk5g"
  }
}