{
  "PMFhXsfpL9akgKqWlSAq-g": {
    "date": "5/17/2014",
    "text": "I was recently a solo traveler in London. I happened on this restaurant and thought I would try it. They were very busy but found me a table. The problem was that they then did everything they could to rush me out of there. They kept coming over and asking me if I were done and told me there were people waiting. Even if the food was good (which it was not) I would have left with a very bad taste in my mouth.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8b2QKbnNkh37iP22sqOc-w"
  },
  "pBinl2YqbeCrN-UzCmADYA": {
    "date": "9/10/2011",
    "text": "I'll have to differ with the most glowing of Halepi's reviewers, while still maintaining that it's a solid restaurant.Our food (taramosalata, spanakopita, kleftikon) was prepared very quickly. The taramosalata was very good (but that's essentially just a dip); the spanakopita was somewhat lacking, tasting a bit rubbery and perhaps overfried. The kleftikon, however, was delicious and tender, definitely one of the culinary highlights of this trip to London. Overall, I'd have to say that I'll make an effort to visit Halepi on future visits to the UK, but it doesn't especially stand out in comparison to Greek restaurants I patronise in the states, or any average restaurant you'd run across in Greece itself. In the bleak gastronomic scene of London, however, it's quite good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aplmTo9kZYka6p1sHf9JEg"
  },
  "rd0k_WMRNVj2AqC6Dasjew": {
    "date": "1/7/2011",
    "text": "Excellent Greek food, super staff, exceedingly friendly and mediterranean atmosphere. My best choice for hearty food. The lamb is just delicious. A must visit",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MRN1W_nvjAUo057LHHjWRA": {
    "date": "11/25/2012",
    "text": "For me, Halepi is simply an 'institution' in London. Obviously, my passion for both London and Greek islands may be playing a role in this judgment... but I know I am one of many estimators of this small (and always full) Greek restaurant in the Bayswater area.The atmosphere is cozy and friendly, with rows of tables, set-up in 'old' Greek style, where both couples and groups of friends sit next to each other - and sometimes even socialize during dinner...Coming to food, there is a wide selection of typical starters such as tzatziki, melizanosalata (sauce with aubergines), taramasalata (never understood what's exactly in it, but it's fish and it's very good...) All to be shared, along with the typical 'pita' bread. By the way, for those who don't know, Greek cuisine shares a lot with Middle Eastern food tradition. But make sure you leave enough space for the main courses! My favourites:- Dolmades: typical wine leaves stuffed with rice and meat- Souvla: 'best lamb on spit' - as defined in the Halepi menu :)- Klefticon, a slow-cooked lamb served with spices: large enough to fill you up alone...I am not passionate about Greek desserts, so I always rather conclude my dinner with a good ouzo...Finally, the staff is super-friendly. A special mention for Ben the waiter, who always remembers me and my friends everytime we go back there, even after years!Prices are on 'London average', i.e. 30 to 40 pounds for a full dinner. But I never left Halepi hungry or unhappy about the quality, and often I skipped breakfast the morning after...Five stars widely deserved!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Aulx3P4oleZ7IrboBmz3A"
  },
  "5LL3hM-o4ODQyfvFKMjI4g": {
    "date": "6/8/2014",
    "text": "Great atmosphere, small place was fully packed with people. Food was very nice and the service was good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i3kUesgUc9B0GMfMzPe4kQ"
  },
  "ryDyjoi6eUvMFK9JzCalDw": {
    "date": "4/16/2013",
    "text": "Yelpers have really let me down on this one, and this is not the first time this has happened in London. But after this, I think I might stop trusting London Yelp altogether.The food is NOT 4- or 5-star. Maybe it once was, but not anymore. My friend and I had some questions about the menu, because nothing has descriptions and we are not familiar with Greek food. After maybe our third inquiry, the waitress literally told us to come with her so she could show us the food in the display case because, quote \"this is clearly your first time in a Greek restaurant.\" Really rude. You're served olives, pita bread, and a plate of raw radishes, scallions, and jalapeno peppers. Not seasoned or anything, just as they are. I'm all for scallions, but raw? And I don't tend to eat jalapeno peppers whole either. Or radishes for that matter. So when our main meal came, the same waitress asked if she could take the plate away because, quote, \"you barely touched it.\" Again, rude and unnecessary comment. The eggplant and the tabouli dipping sauces were both good. But the mousaka (even I, in my DEEP ignorance, know that this is a Greek staple) was so, so lacking. Orange grease everywhere, not very flavorful, and unappealing texture. The veggies, also, were dredged in the orange grease. My friend's quail looked pretty dry, and the waitress got all defensive when she had simply commented on how tiny it was. I tried eating as much as I could, but, just as I had feared, no joke, the good ol' waitress returned and said \"I must be honest with you ladies, you are really not good eaters! Was it ok?\" I should not have to apologize for not finishing a mediocre meal, but I did apologize, and told her that it WAS mediocre. She didn't care. And then at the table next to us, I overheard a woman making a complaint about her meal, and the same waitress told her \"this is the best dish on the menu.\" Nope, that's not how you take a customer's complaint.Literally to prove to her that we could finish a dish, we ordered dessert. The pastry that wasn't baklava. It was really pretty bad. In sum, food and service definitely not worth the price.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fccVgyOlrANyVLr_ny0EXQ"
  },
  "9b5kowOYsf7L376BDneq2w": {
    "date": "10/6/2009",
    "text": "I still salivate when I remember the lamb. Yip, it fell off the bone and straight into my mouth. (These days I don't eat as much meat, but will make an exception for Halepi's lamb.) The decor is trapped in a time warp - no updating done here. It's legendary amongst the locals and has been going for ages so that's always a good sign. It can get very busy and so booking may be advised on traditionally busy nights. There's a friendly and exuberant vibe and staff greeted regulars warmly. I liked the thick curtain in front of the door which kept the place cosy and the bowl of oranges near the door was a nice touch too.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BsuBJTp67uG7ApJ95wwGYA": {
    "date": "7/27/2011",
    "text": "We came here for lunch, and had the entire place almost entirely to ourselves.  I loved the Greek salad and the beets, served with olives and excellent, hot pita.  Potatoes were also good, but we were underwhelmed by the chicken kebabs, which were bland.  Pricey, but overall good food; I recommend assembling a vegetable-heavy meal from appetizers and vegetable sides.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bx6xZWWZPEF5nPc_Iq6TzQ"
  },
  "fJN8JjOZ1lvIvUm89aEBBA": {
    "date": "11/27/2013",
    "text": "A simply fantastic Greek family restaurant.  Salads, grilled and roasted lamb are succulent and delicious.  Our waitress, Sophia, made us feel right at home.  Highly recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YkIWnt5NZze--XBTEV21BA"
  },
  "DD5icZgEgb2K8ZyWuH4orQ": {
    "date": "1/20/2010",
    "text": "This family run restaurant is unintentionally kitsch. The food is extremely fresh, you can see live lobsters in the display fridge greeting customers walking to a snug seat in this comfortably cramped environment. Ive never tasted better hummus and aubergine, and the grilled halloumi cheese with tomatoes is a must. Also, you can order practically any drink and theyll have the liquor, even three different types of irish coffee ( how greek is that??) .Dont forget to leave space for Yiayia's baklava.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "VWpASgdwc5hbinnG6LW32A"
  },
  "SkDa_5d1FCp2HAxP1Vs2jw": {
    "date": "11/15/2007",
    "text": "This restaurant is tucked away in a quiet area and from the outside it looks warm, friendly, and cosy. Once inside, it is exactly that. The staff are very friendly. They are mostly Greek which add to the authenticity of the restaurant and also means that they can recommend the best dishes. The restaurant is small and slightly cramped, but once the food arrives, you forget about that as you savour the delicious Greek cuisine. They have a variety of dishes and there is guaranteed to be something for everyone. The prices are reasonable as the food is of a very high quality. This is a great lively place to go for a meal if you're after good food and a great atmosphere.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fs-TC7uPtSKxQq-oOtntNA": {
    "date": "6/2/2009",
    "text": "The ambiance is great in this restaurant.  Food is decent and the owner is such a great guy.  Open late & you can get alcohol here AFTER the pubs close at 11.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2RnoPDtsyDNnC9B68RTGjA"
  },
  "uXyXS065U-4-61L2LsSuww": {
    "date": "9/5/2012",
    "text": "Food was nice, but a very claustrophobic atmosphere.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3gp6zVqdoFMSm_NgeObjVw": {
    "date": "9/29/2009",
    "text": "A great 'local' restaurant. Even when they are full, which seems to be most of the time, they can always squeeze you in. Great food and wine and really nice people. One of my favorites.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_SNTy1xJs33SzcO2cac3rQ"
  },
  "qU9xCo3T8k-DA-MxU68DSw": {
    "date": "9/30/2007",
    "text": "A small but excellent small Greek restaurant between Bayswater and Paddington. The place is almost always packed as people come here to get some of the best Greek and Mediterranean food one can find in London. The room is small and the atmosphere always very warm and buzzy. If you live around there you can also get some excellent take-away.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HMe7MW1M-4A1iEhySt4wpA"
  },
  "p-GcByFdMb71dnIKx46l7g": {
    "date": "8/4/2009",
    "text": "Table for 2 at 8pm last night. Busy place with that happy buzz that good places have. Ordered houmous, salad, fried calamari, halloumi, klefticon. Houmous ok, pittas delicious, salad fresh and with good leaves/tomatoes, meditarranean cucumber and soft tangy feta. Calamari were fresh with that real taste of the sea (horrid cliche, apologies, but true all the same!) and light non-oily batter. Klefticon was flavoursome meat, seasoned/spiced delicately (for meditarranean cooking) and cooked so that it could be taken off the bone with a fork & spoon. I love this restaurant: it doeswhat a restaurant is supposed to do for me. It's comfortable, congenial, the decor is dated/tiredbut comfortable (we had a large table so not squashed). The food is simple possibly staple Greek dishes and some English 70s classics (think Simon Hopkinsons 'The Prawn Cocktail Years'). For me, it's no bad thing not knowing how old the olive oil is and who baked the bread. I love it, and long may it continue to do what it's doing.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jZ0bBuDwaXLhnRK-l5mhcQ": {
    "date": "5/25/2009",
    "text": "Exactly what the previous comments have said. The interior is small and intimate but homely and welcoming. Halepi gave excellent and friendly service. We were immediately greeted and made to feel at home. Food was superb. We were given olives once we were seated, and our basket of warmed pitta bread was topped up automatically once consumed. I ordered the Special lamb kebab and my other half ordered the Baby lamb shanks both with rice. Food was cooked to absolute perfection- and generous portions at that! Tender and juicy on the shanks and rustic beautiful grilled flavours of the kebab. For dessert we ordered the Greek coffee (which comes served in an espresso sized cup) and one slice of baklava to share (by this point we were far too full to have our own dessert each- generous portion again), but before we ordered our dessert, we were given a complimentary small dish of turkish delight. I don't normally like Turkish delight as I find it is perfume flavoured, but this particular one was scrumptious and not perfumed at all! The bill came to £57 between the two of us. Service charge included.Reasonably priced considering the quality of food and service! All in all, a rare gem hidden away in Central London. Will definitely go back since it's yards away from us!(They do Takeaways too!!)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hPFWoU_hVMZ2BYwpWeRjQw": {
    "date": "12/27/2010",
    "text": "After many years of wonderful meals at Halepi we were shocked at the change when we returned for dinner at 6:00 PM on Sunday, December 12, 2010.-- the pita was hard and stale;-- the hummus was watery and tasteless;-- the potatoes with the klefticon were cold;-- the mousaka was thin, the béchamel lumpy and the lamb unspiced;-- our waiter, one of five, was brusque and officious;-- our wine was slopped into the glasses as fast as possible;-- the male waiters argued among themselves about who was the manager;-- the female bartender told them to shut up;-- one waiter decided to go home, put on his coat, and left;-- one member of the kitchen staff gathered up his tools and walked out.We left shortly afterwards and will never return. Too bad  Halepi WAS a great place to eat. Obviously something happened to change that but there are too many great restaurants in London to mourn over one that went sour.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dKg4W9I9CPgJoD1HmoAL2Q": {
    "date": "9/25/2010",
    "text": "We went to Halepi on Friday evening, had a starters and main meals for 4 people + beers and wine. The quality of the restaurant is quite poor comparing to its prices. It's an average kebab place, but with prices of a fairly good restaurant in Central London (i.e. £35  £40 per person). The most disappointment moment was when they asked us to leave while we were finishing tea and coffee, even though there were no other people waiting to get in. Of course we will never come back.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gUwAEj9mTqHVsTxjZ6ROuQ": {
    "date": "3/24/2016",
    "text": "Stuffed, but great athmosphere. Very good food indeed. The lamb was very tender and highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e8fz_kERl6Xi_5-J-uejLQ"
  },
  "jh1btLcHWpLlbbFpfGXbzg": {
    "date": "10/19/2012",
    "text": "Yeah. So this is 5 stars in the local family-run ethnic food category. It's not fancy or fussy, but it is delicious.You will come here for the Klefticon, the fall-off-the-bone, slow-cooked lamb that Greek food is famous for. You'll press lightly on the meat with the back of the fork and notice it squish softly onto the side of the plate. You'll cut a piece of roasted potato, and drive it around your plate into the meat drippings, picking up a few bits of roasted onion and fat. It will be delicious but so huge you can't even finish. You'll want to save the rest for breakfast.Before that, you will have feasted on big and juicy olives, both black and green. You will have cleansed your palette with radishes, green onions, and peppers. You'll order a bottle of wine and ask, \"What part of Greece is it from?\" The answer: \"I have no idea. The good part.\" After ordering it, you'll accept that, yes, wherever it was, it was from the good part.On your way out, as you gush to the owner about the lamb, he will proudly show you the dusty celebrity photos of London's famous who come here for a fantastic and fuss-free meal. Gluten-free notes: Most Greek food is naturally gluten-free. You will eat very well with few restrictions. Beware the moussaka -- the traditional recipe calls for flour.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "6CbH7ii4sPkdgzPxs7DpOQ": {
    "date": "4/11/2015",
    "text": "It is hands down the best Greek food I have had. It is always fresh and cooked to perfection, super delicious! Service was great as well! I currently live in California but my visit to London is never complete without a stop at Halepi! Great job guys!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T285htD7htp-EGOUhKsOeA"
  },
  "9fx_mwr4ele9kp9PbGk_ew": {
    "date": "8/7/2014",
    "text": "Do not patronize this establishment! We had a horrible experience here! The food was decent, although I have had better Greek food, but the service was shameful!!! The restaurant is authentic Greek, but a drunk man sitting next to us totally ruined our meal by sticking his fingers into my plate as I was eating to taste my food!!! The manager/owner chose to protect the drunkard, I can only assume it is because we were American, and made us pay for our meal in full while the drunkard didn't even have enough money to pay for his own! The restaurant chased us out so that we didn't make a scene but they allowed the drunk man to stay quietly!!! I was midway through my meal when the incident occurred and I wanted to leave immediately because I was so disgusted, but the restaurant packed my food to go and didn't even comp my meal!!!",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gco-dgYWuze4kNafDF9gTw"
  },
  "hElmpS78rIt7Qxi58o9Z5A": {
    "date": "2/27/2012",
    "text": "Go hungry! This will be the only meal you'll need or want for the day. The food from starters, mains and dessert are all incredibly flavorful and the portions generous, so you're going to want to be hungry enough to try a little of everything! A couple of Greek friends recommended this restaurant and my husband and I were very excited to meet them for lunch yesterday as it's always a good idea to follow where the natives eat  After yesterday, I don't think I could eat Greek food anywhere else in London. This is THE place to go for an authentic Greek meal. The Kazolides family have been running the restaurant since 1966 and I can see why they have been so successful through the decades! They gained a new loyal fan - I'm hooked.Food is simple, fresh and perfectly seasoned and prepared. We ordered a wide variety of starters and grilled meats - everything was top quality. Needless to say, we were all stuffed and were grateful to the server for wrapping up the kebabs we didn't quite finish to take home. A few favorites that I highly recommend include: - Greek Sausages (Loukanika): This was my first time trying these and loved the mix of spices and slightly smoky taste. - Tzatziki: I've had this cool, creamy & tangy cucumber dish before, but this was the best version I've had. They nailed the balance of flavors. Very addicting and was especially good with the chicken kebabs later in the meal.  - Saganaki (Pan fried Greek cheese): It's hard to resist a fried cheese dish! No idea what kind of cheese they used, but its crispy pan fried outside and melty center was yum! - Lamb on Spit: I ordered the Chicken Kebabs as they are my usual favorite and they were wonderful, but after a bite of this lamb cooked on the spit, I think it might be my new favorite (at least here anyway). Wow, no clue how they get the lamb so tender and the slight charred bites from the spit add an amazing meaty flavor. - Galaktoboureko (Custard in Phyllo Dough): I was going to order the baklava but my friends encouraged me to try this one since I've never had it. Again, their recommendation was right on. Cool custard inside a flaky phyllo dough drizzled with a light honey syrup - dee-licious!- Greek wine: Selected a Greek red, which was a nice pairing. I'll need to keep an eye out for Greek wines in the future. Atmosphere is intimate and casual with closely placed tables and brightly colored table covers. It can be quite crowded and hard to move around, but I think it's part of the charm - it feels and tastes like a family owned and operated restaurant. Service was speedy and friendly. Overall a remarkable experience!Note: Be sure to make a booking ahead to ensure you get a table. Or, they also have takeaway service if you can't get a spot :)",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "eiyWzIIJhbuoF7fYWb0zeQ"
  },
  "4SjWrynSQhW3TpcWNM6dew": {
    "date": "5/1/2012",
    "text": "For a great price, Halepi offers huge portions of very tasty food. In addition, it appears to be undiscovered by tourists, and thus has a wonderful, warm, neighborhood feel to it!Four of us ordered:- Hallumi (oh my goodness! I am still craving this! It's a very simple appetizer, but, as my cousin said, how can you go wrong with salty, grilled cheese? Would do multiple orders of this)- Hummus with pita and vegetables (hot peppers, radishes, etc.)- Greek Salad- 3 orders of Baby Lamb (which literally came out as a beautiful piece of meat on the bone - a very large portion)That feast + 2 bottles of fantastic wine (Boutari Grand Reserve, I think) + coffee / tea = 150GBP for four people (unheard of in London)! :)I get the impression that reservations are strongly recommended :) - this place was bustling!Would definitely return (perhaps for a second meal this week)!** Hi Alison / Dan! :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WzpS9g-sbaXfEqoaYLgPfw"
  },
  "1z-R0ACr4IeO_4KNeN80JQ": {
    "date": "1/13/2015",
    "text": "Great service and very generous portions. We were 10 people, of which 8 took the klafticon. We all thought it was great and only half of us managed to clear the plate.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntQYNptM-x6Ik0wo0zKJvQ"
  },
  "Q7HpqeOQTEvSwwrbiFdkcw": {
    "date": "2/26/2014",
    "text": "Nice clean inviting atmosphere.  They were clearly proud of their food. I am a fan of Greek food, but am no fan of their fare.  We ordered with great expectations. My wife and I both ate a rank tasting lamb dish served up in a pita. Not good.  I remain in the dog house.  No, not at my wife's insistence, but under the curse and demands of several thousand very unhappy taste buds. We shall not return. The meat was either old before the \"lamb\" lost its life, or the meat was aged far too long after the lamb perished. Either one, it doesn't matter. The meat was terrible. I'd give them 1.5 stars because I think they tried (and will round up to 2 stars).  Their intent notwithstanding, they failed.  Tip for the owner: Get a new butcher, buy better meat, and/or use the meat before it goes bad.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JjBQ0UR3TjkEWPvTvnEQRQ"
  },
  "_UThYpidwgUAMlIxxIRURA": {
    "date": "1/8/2012",
    "text": "Pros: Wonderful ambiance, close to the Bayswater tube station, a 5-minute walk from Hyde Park, and great service.  The owner is this adorable little Greek man that circulated the room and made us feel like we were eating in his home.  We had the hummus and it was absolutely outstanding.  They also brought out an array of olives, fresh radishes, peppers, and hot pita that you could make a meal out of on it's own.  Lamb was pretty good, although not the best I've had in London.  They brought out these unusual jelly desserts at the end that were very tasty.  Some tasted like lemon, and another one tasted like rose water.  Very interesting.  My husband and I still talk about those little jellies!  Cons: house wine.  Not the best I've ever had.  Kinda disappointing in a Greek restaurant.   Basically, the pros far outweigh the cons.  Give this place a try! We loved it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fd-NpLo7XleUj9GbFr2LRg"
  },
  "cLlJdQ7Z_UcbRlnkomqWGA": {
    "date": "2/28/2013",
    "text": "Nice authentic  little spot. I had the Greek sausage to start which I didn't enjoy at all. It was really hard and hurt my mouth. The lamb kleftico was fantastic. Huge portion that was cooked perfectly. They serve you a huge array of radishes, pita bread,olives, pickled peppers and fresh spring onions that could be a meal by itself. One thing I found strange was the £1 cover charge they add to the bill besides the tip. Go check it out.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7EK23G_1Kdv0-v0Lzgsrbw",
        "caption": "Photo of Halepi - London, United Kingdom. Lamb Klefticon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7EK23G_1Kdv0-v0Lzgsrbw/o.jpg"
      },
      {
        "img_id": "PwpDnmU5o6IsSuuLaBqc5Q",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PwpDnmU5o6IsSuuLaBqc5Q/o.jpg"
      }
    ],
    "user_id": "fPlvRCDbmMCr5egyn_82Xg"
  },
  "t77DEdAvoIZRo-qekllang": {
    "date": "5/11/2014",
    "text": "Solid spot, something of a local institution. It's a cramped restaurant where. Some of the staff is friendly, some is surly - that's just the way it is here, and people seem to love it. The food is good, nothing too spectacular but decent quality. Pretty average prices. A good local option.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqKT4a7h3HFwhIc9lyg1Ow"
  },
  "4j6aQFOd_eKpuhYGGCmejA": {
    "date": "7/16/2012",
    "text": "Amazing food, generous portions, and decent prices.  Octopus Salad - AMAZING  Souvla - AMAZING - Best lamb on a spit I have ever eaten.  Klefticon - AMAZING - Think of the moistest turkey drumstick, but made of bone in lamb shank, and slow cooked.  Mousaka - AMAZING - Tasted like lamb parmigiana.  Tons of olives and pita to start your meal.  The best meal I ate while was on vacation in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0JuTV8C8i-Ej4t_oBwHaLQ"
  },
  "vG0O_dfBfb8qXdAdbBWQbQ": {
    "date": "4/20/2014",
    "text": "I have been there twice with my parents: first time in 2010 and last time 6 months ago. I must say I had a lovely time there. The place is not so spacious but you feel like you're escaping from London to a genuine Greek atmosphere. The food is just delicious and the staff very nice, speaking in our language when they found out we were French, which is always a nice mark of attention when you're abroad. If you feel like eating Greek in a prestigious district, do not hesitate!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z0v1E6o0IN4Avt4DLY0nqQ"
  },
  "1cvlA3Fd1fhS99YKsHwVTQ": {
    "date": "5/22/2013",
    "text": "Such a delightful experience I must say. Excellent food, atmosphere and service.  Would highly recommend!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5EWDjG0J3HveUlROq3UXnQ"
  },
  "t1X7jEdNxkAmgZ2i2br0Gw": {
    "date": "8/25/2010",
    "text": "There is a good vibe to this place.I was shocked at first when I walked in to the place (I was invited and thought it will look like all restaurants i have been to)... it was crowded and tables were have hardly any space between them. The table cloths are so colourful and there is barely room to move in, but you find people enjoying the time, staff that smile and accomodate you- and to my surprise many celebrities and officials from all over the world, choose this restaurant as the place to eat couple of times a week. The service is immaculate and food is absolutely fresh and delicious. in total I enjoyed my time there and will recommed it to everyone I know...",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6kIHG6LSUp-Ubqe9zbayzA"
  },
  "5iQob7iiteMe1-eqoaV7ug": {
    "date": "6/22/2011",
    "text": "The best Greek restaurant in london. No doubt at all. And has been for decades. Heaving every night, very bustling, fantastic fresh food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CbDqSWUuD5w3WL1cZlYrtg",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CbDqSWUuD5w3WL1cZlYrtg/o.jpg"
      },
      {
        "img_id": "ial6LpRG9hCeYHOks6gO3g",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ial6LpRG9hCeYHOks6gO3g/o.jpg"
      }
    ],
    "user_id": "bCCU5mUZIN5pGTKL7rUSEA"
  },
  "5q84rpkXHcElSvD3lydlKg": {
    "date": "2/11/2013",
    "text": "Not much for vegetarians that you can't find else where... sadly... but the good news is that the baklava is really lovely.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eHNP_CtIPjp_pZeh6DtukA"
  },
  "0jR9nKT68DYW1tPRfN06uQ": {
    "date": "3/28/2012",
    "text": "this is our go-to greek restaurant.  i think everyone's reviews hit it right on the nose.  so aside from mentioning the kleftiko again (get it!), i'll just emphasize how cozy the place is...my husband and i like to people watch and yes, we talk to each other, too, during dinner.  we particularly like to watch people on dates, especially those who are still in the shy phase (date 1 or 2?).  halepi's is not the place to take a first date because we would be the couple next to you, nearly sitting in your lap, listening to your conversation.  plus, who actually eats a ton on a first date?  -you're going to want to eat everything at halepi's.halepi's is a great place for families and folks who love yummo food...and who don't mind loosening the belt after dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "na0x5t_2EztnJZCqx1bpBA": {
    "date": "6/6/2013",
    "text": "This place was awesome.  The food was great and brought out efficiently.  The only reason I didn't give it five stars was they forgot to bring out the sausage appetizer along with the spanakopita.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l73PI7ij8L-AOD0b8huSNg"
  },
  "cDLvauH9D0eaWjhA98GePA": {
    "date": "9/15/2013",
    "text": "We have been to this place for lunch on a Sunday and had Klefticon and Dolmades. The lamb was ok but nothing special and the Dolmades where watery and almost only rice  very little meat  over all not nice.We love Greek food and have been to many greek restaurants but this is one we will not come again.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "wr9j1gKe_d9nHIqizE5dzg": {
    "date": "9/25/2015",
    "text": "The place was packed on a Saturday night, full of families enjoying themselves. Halepi is a traditional Greek restaurant. I think the trick is to order the right dish, so ask the server what's good or look around you to see what others have ordered. If you can get a reservation, do it. Halepi provides a number of complimentary appetizers like pita, olives, shallots, and radishes that tasted great with the hummus we ordered. We loved the moussaka and the fresh squeezed orange juice was to die for, but the lamb roast wasn't to our taste as it was quite salty. I would definitely come back to Halepi.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "mNWAh7mlLRSIR8vrsBsN-g"
  },
  "OXSxZ0p6IauU0YkpH9dyig": {
    "date": "10/21/2015",
    "text": "Hadn't been here for years, returning from the rugby in Cardiff and staying with friends who live very close.We were looking for a late Sunday evening dinner. We had tarmasalata Pitts and veggies to start, tarmasalata being well know in this establishment.For mains we had a chicken kebab, a beef kebab, a kleftikon, and a grilled quail to share.Meat quality across the board was excellent, the quail was particularly good.Friendly efficient service, great people watching, if you are in the area give it a try",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAZLZfj-FfkuhypKYUOW2g"
  },
  "Wm_5UZEFuDHrb8pj3ClA-A": {
    "date": "10/10/2017",
    "text": "Small place with a quaint atmosphere. Off the food : The mixed grill was so delicious. All of the meats were cooked and seasoned to perfection. I couldn't even finish the dish because they gave so much!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XXbJ9r4futHfZKFeholztg"
  },
  "Kpr4sqlqDxUKAWkj9X4R2A": {
    "date": "7/22/2017",
    "text": "I have been here a few of times with friends for dinner and the restaurant is always busy with people reflecting the fact that the food is good and the atmosphere is cosy...maybe a little too cosy since it is a little bunched up and hence the 4 stars. Simply because if you are expecting a bit of privacy then this is not the place as it is pretty much like sitting with lots of people on one large table as the tables are very very close together. They have a great variety of food and the food is homemade and tastes very authentic. They have been established for a long time and the owners work there and that is why it has retained a high value as they care about their restaurant and customers. Their desserts are not great but the mains and starters are good and very generous in portions. I wouldn't recommend their creme caramel despite them thinking it is one of their specialties unfortunately the flavour is not great at all. But I always have fun at this place and the time flies as it is always enjoyable here.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VQEdwKix6XPfwh-Q4GLM6w"
  },
  "8itpa00XUKCtlXTACS5fQQ": {
    "date": "12/13/2015",
    "text": "Great food. Good prices. The Lamb Musaka is very good. The humous is also incredible.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "2xQ9DC4KWZTj2F4EvXhkYQ",
        "caption": "Photo of Halepi - London, United Kingdom. Lamb Musaka",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2xQ9DC4KWZTj2F4EvXhkYQ/o.jpg"
      }
    ],
    "user_id": "1n3lXm9hjOTRobmP3ODKgQ"
  },
  "hIVrF3VoM9kIKgi4NkmShA": {
    "date": "10/20/2015",
    "text": "Four of us had dinner here recently. We were all very happy with out meals. As mentioned in other reviews Halepi has a family feel to it. It is a bit crowded but that adds to the Greek taverna atmosphere. Service was personal and friendly.  We were not very original with three of us ordering moussaka but it was very good. Looking at some of the other tables of those who appeared to be regulars, I wish there would have been some explanation of some of the options. The place fills up quickly but they do take reservations. Halepi is a nice change from the restaurants nearby on Queens Way. I would return.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RWRnPmqiXq64aW6bQb9Ydg"
  },
  "3bDODinSQ1DkGwxjOjVk6g": {
    "date": "1/31/2017",
    "text": "I've been coming here for over 15 years celebrated many birthdays, graduations, anniversaries and remembered lost loved ones. This Resturant is consistently good and feels like my second home. The Kelfticon, the giant prawns, the milk fed leg of lamb, are almost always whats on order for me!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7p2jcoaUm5Q3oh68s6Lm2w"
  },
  "oWi3C1pDrEnA1h5hkn_N3g": {
    "date": "12/29/2014",
    "text": "Extremely mediocre in more ways than one...service was shockingly poor if you are not a regular customer. Based on my observation however, service could be phenomenally amazing if you are a regular customer! Additionally disappointing, the food was extraordinarily subpar: for example, I tasted the driest chicken kabob imaginable...the spanakopita was extremely dry and chewy!  The lamb casserole tasted overcooked. The pita bread was packaged, and we sent it back in the hopes that it didn't go to waste. The service was extremely lacking. I mentioned to a waiter that we found them through YELP, and they responded that while the owner reads the Yelp reviews, he doesn't give much notice,  as he is already extremely busy and successful. I could never recommend this restaurant to anyone!",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dqXnIDr6XMr2aMbA02sSRw"
  },
  "tVtnhu5vYPYRjZMEWhODlw": {
    "date": "12/14/2014",
    "text": "I came here with a new friend and was surprised at how quirky and homely it felt for a place in central london. The owners seem to be a family who've been there for generations - I absolutely loved that they had pics of themselves with famous people (Robert Pattinson, David Cameron and even ancient ones like Princess Diana!)It's true there isn't a ton of veggie choices but we mixed up some starters. I personally found the hummous bland - but the tzatiki and spanakopita were fabulous. We were given ample bread and salad to munch on while we waited for our food. It was disappointing to see we were charged cover for it, and also for the water which I'd requested as tap. Ho hum, it definitely is an expensive place, but charming, and it was very busy so I think it has a loyal clientele. Not sure I'd return but you could do worse!",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "RRmmo-EYK54oj7EArplJ2A": {
    "date": "4/15/2013",
    "text": "4* Service3* FoodI ordered the Klefticon and a side of spinach. I have to say what impressed me the most is the service. The main server was very friendly to everyone. Had made sure my water is refilled.I couldn't finish my Klefticon, when the server came to take it away, he asked \"Was it too much food or was it bad food?\"The Klefticon was indeed fall-off-the bone lamb and had none of the gaminess or smell of lamb. But having a big slab of meat with dry rice wasn't appealing to me (that day).Wish they had a side salad instead of having a \"small\" salad.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SheHuUOhNJbhDi6K8tAkLA",
        "caption": "Photo of Halepi - London, United Kingdom. Halepi~",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SheHuUOhNJbhDi6K8tAkLA/o.jpg"
      }
    ],
    "user_id": "8ReoSLJLCRtJx-JaFdUNSw"
  },
  "sQJ5ioImBmSUMuDVpuXACQ": {
    "date": "2/5/2015",
    "text": "The food was good one star for that!The guy who i think was owner was very friendly another star for that! The place was very dirty you could see stains on table covers, there was nothing under forks and knives and they were touching the table.If i was not hungry i would probably leave and find a cleaner place that is what a group that came around same time ad me did after seeing the menu i guess price was high for their level of serviceOwner told me card reader is not working (previous customer waited 20 minutes until it worked for him)  or may be he wanted me pay in cash.So if your credit card is not from uk prepare to pay cash !I was charged extra 1 pound for a some sort of service fee (not tax) that i didn't see it on",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGh2jQHiTU4ZZOnN8Zew8A"
  },
  "qxo_wKAWA32BdoO3ePc8TA": {
    "date": "3/21/2016",
    "text": "Warning! You will want to return there every night!!! Authentic. Tasty. Welcoming. Attentive. Cozy. If in no rush (and don't go there if you're in rush) you'll make new friends, too. Guaranteed!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOnWzCC5J7easqVbRYHj4g"
  },
  "RwQtCKqXMKfKjKz1kCVEUw": {
    "date": "11/9/2014",
    "text": "The service was terrible. The way the waitress treated us made us feel like we owned them money...The food was pricy and was not tasteful...",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J9lFzAKVHvrgm-A3EaNyJA"
  },
  "isvPUhjJFNu0icmAP6lqsA": {
    "date": "4/1/2014",
    "text": "Have to say, I was not impressed, especially given its reputation.I had the lamb kebab. It was pretty blah and needed a sauce or something to spice it up. I ate it with my friend's tzatziki sauce and it improved the taste, but not by much. The pita wasn't very fresh tasting as well. Service was weak, menu was overpriced. I wouldn't go back.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tNuRaOD8qXD3KYstnqyAIA"
  },
  "yvIgVwKh0IbFgn4CyoXYNA": {
    "date": "6/12/2014",
    "text": "The slow cooked lamb is really the best thing that I could order at Halepi. However, the course is quite massive and I would recommend it only if you're in for a gala dinner, with time to spare. The meat was cooked to perfection and I am not exaggerating as I know how hard it is to cook lamb properly. All the food is presented in this authentic greet plates that I frankly, don't find very inviting but surely helped build a nice atmosphere. I really felt like I was not in London at all. My friend ordered the moussaka which seemed quite delicious and mouth-watering. On trying, it tasted even better, I liked the burst of flavours that intruded my mouth. All was good and the place for me is a solid 5-star restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R24Tu1z6ck1M3LdE7eVbKg"
  },
  "5KTm0v7MmvQuXqW6hP7HNA": {
    "date": "3/1/2014",
    "text": "The best restaurant - EVER!  Been going there since I was six months old and it never fails to arouse a sense of euphoria mixed with a mild runner's high.  You could order dirt if they served it, and you would take some home and serve it to your mother.  I will never visit London and not go to this place.  Try anything on the menu and you will not be disappointed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GZznlA8fRoCKqZGJUMZ-Xw"
  },
  "m5lt1xPWr6rgJiXNjTbkyw": {
    "date": "10/17/2016",
    "text": "I ate here four years ago but forgot the name so I have been looking for it every time I come to London. I stumbled across it by chance this afternoon and had another amazing meal. The lamb shank is great. I can imagine everything else is too. Don't come here just to eat salad and olives.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGe3O9ZWuvmRXG2EOL_zDg"
  },
  "IG82VUXZf_U6s7xY8bqIUw": {
    "date": "5/18/2015",
    "text": "This is the Greek meal I've been waiting for, for a while. I live in San Francisco and there really aren't the Greek or Greek-owned \"diners\" like in NY which serve Greek specialties.I started out withe spanakopita  (spinach pie) which I'd been craving for MONTHS. Perfect ratio of spinach to cheese and nicely spiced. Had the moussaka which was put together quite nicely with an extra sprinkling of cheese on top & accompanied by sauteed FRESH broccoli, carrots and narrow string beans. The bechamel stood up to the other ingredients in the moussaka and was subtly seasoned just right.Someone in another review complained about the \"cover.\" It was just 1 pound. And I got SO MUCH I didn't expect: an assortment of black and green olives, radishes, green onions, some hot peppers, bread (nicely warmed) plus at the end this marvelous rose flavored delight/gel dusted in confectioners sugar (which I'd never had before but really put me in a state of ecstasy). Also though not on the menu, I was able to get retsina by the glass (priced just like the house white/red).The meal was perfectly timed, there was no rushing me out, and the service was friendly (even though I'd not been there before ).At the table next to me they were having mixed mezze including two kinds of calamari and they got a sharing plate of grilled meats and seafood, which looked perfectly tender and cooked (I was watching a regular table wear knife EASILY cut into the lamb.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R3JEnXxlFd4PgL6SSFbJ8g"
  },
  "vYfD2xOMkkTOGifRJKXokQ": {
    "date": "7/26/2011",
    "text": "Halepi is without a doubt the most authentic Greek restaurant I've ever been to, but my experience was a bit of a unique one, so I'll go ahead and explain.Primarily, other reviews had said that Halepi had a vegetarian menu, and as I was going out to eat with two vegetarians, I went as far as to call ahead to make sure that this was the case.  However, even though I was assured over the phone that there was in fact a vegetarian menu, upon arriving I was told by two different waiters that there were only two vegetarian options available.  This was disappointing to say the least.That having been said, the food was absolutely excellent.  While a bit on the pricey side (you're paying for the authentic atmosphere here), the pitas were the best I've ever had, and the portion sizes were acceptable and the service was truly sensational.However, after having only been seated for a little over an hour, our party was confronted by a man who appeared to be the owner and was told that we had to leave in order to make room for another party.  This truly put a stain on the evening, and I left Halepi with a bit of a sour taste in my mouth.Overall, my experience may have been rare, and I must reinforce that Halepi is both authentic, friendly and tasty, but being told to leave was truly disappointing.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKX-V5j_qfuOebeHeWGrHg"
  },
  "KtvqK57UorgoF2AZsDJxVQ": {
    "date": "2/20/2013",
    "text": "It doesn't get any more Greek than this...outside of Greece. From the guy doing the accounting near the kitchen, to the boss of the restaurant and the shepherd barn style wooden interior. It was packed when we arrived without a reservation, but the boss managed to squeeze us in.Another review mentioned you needed to be hungry before coming to Halepi and she wasn't kidding. Serious portions. Go for the mixed appetizer (one portion for two will suffice) which is a mix of dips. And then for the shoulder of lamb. So soft and tender it falls off the bone. Didn't have any place left for dessert.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q8siUorJ25iorp3t-1f4Fg"
  },
  "VR063jsZ3_bNZ3aNdwt_4g": {
    "date": "7/14/2018",
    "text": "I was quite surprised by this restaurant. I entered and it was moderately busy and I was the only white man in the restaurant. It was inhabited solely by Arabs and that is all that followed. The food was good. It was as if I were eating in Amman with a splash of Athens. I recommend this restaurant. I ordered the lamb kebab plate and it was quite good. I added a side of tzaziki, because life is just better that way.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0oM5Bsotb_ARd15g3wkEpQ"
  },
  "90adgCdXkAPhVhp2PED5qg": {
    "date": "3/16/2017",
    "text": "This is hands down some of the best Greek food I've had. They provide an interesting starter which I've not had in any Greek restaurant my home country (USA).  Fresh radishes and raw green onions.  My husband joked I wasn't supposed to eat the table decorations.  There are also pita bread slices, salty olives and pickled peppers on the table.  It's a very cozy narrow restaurant with limited seating.  I like the decor.  The dark walls with oil paintings and low ceiling creates an intimate homey atmosphere.  The kitchen is visible.  It's also audible.  This is definitely a family restaurant with loud raucous laughter and chatter.  A stern looking grandmother kept an eye on the chef and wait staff.  The waiters are gregarious.  They treat you like family.  Opa! We had the lamb casserole ( loved it!), grilled lamb kebab, quail kebab, moussaka (creamy goodness!) and a Greek salad.  If that wasn't enough we had the baklava which had a refreshing citrus/lemon finish to it.  I would definitely come back here the next time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7hZSizpq2EsWH8xuz9v53w",
        "caption": "Photo of Halepi - London, United Kingdom. Starters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7hZSizpq2EsWH8xuz9v53w/o.jpg"
      },
      {
        "img_id": "EAyr4Q04q0nqNG6wn5OG6Q",
        "caption": "Photo of Halepi - London, United Kingdom. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EAyr4Q04q0nqNG6wn5OG6Q/o.jpg"
      },
      {
        "img_id": "oWFWlm4A4ahhjal1iabrmQ",
        "caption": "Photo of Halepi - London, United Kingdom. Menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oWFWlm4A4ahhjal1iabrmQ/o.jpg"
      }
    ],
    "user_id": "1l38erk8d0t7TI5svyTQtQ"
  },
  "9gfrxu62MA_qfhzrb8QgyQ": {
    "date": "5/11/2018",
    "text": "Today we had lunch at Halepi, and we enjoyed it. The waitress was accommodating and attentive, the restaurant itself is very quaint and decorative. I ordered the baby lamb which was so tender it was literally falling off of the bone and my husband had the spring chicken which was nicely seasoned. My favorite part of the meal was the pita bread and hummus. This small restaurant is definitely a must visit in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V8Zo5TxzHygJ68_WIu_UIQ",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V8Zo5TxzHygJ68_WIu_UIQ/o.jpg"
      },
      {
        "img_id": "-RLqBHGPPa9r4vC0gU26aw",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-RLqBHGPPa9r4vC0gU26aw/o.jpg"
      }
    ],
    "user_id": "rKbiJGuRfcImTSQIFKJdZQ"
  },
  "iVupTWyh-Cu7gUWtgdpmtw": {
    "date": "6/18/2018",
    "text": "Love lamb so this place wins on their preparation and seasonings. The moussaka was very flavorful. The portion sizes are good and the ambiance is pretty authentic. My only caution is that the staff is really good at updates so the check was steep. Oh yeah, lastly...skip the dessert. Not as good as authentic (from Greece) pretty dry and almost stale flavor. Had both the baklava and glactobarouki... glactobarouki was the better of the two.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TModcFCt_hRZBU23FUMrjg"
  },
  "1QTPWOn9dY7om4FTX9Gj5A": {
    "date": "8/3/2018",
    "text": "Great and affordable food, just went in for a lamb sandwich which was amazing. Line was long but it didn't take more than 10 mins for my sandwich to be ready",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jN2BUFlGHOHaVUTNzEJ-xw"
  },
  "Tt3qITP-DBDE7d4n2XlKag": {
    "date": "6/23/2018",
    "text": "I can't speak for the rest of the menu. I came in just for dessert and the baklava was kind of dry and mediocre.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPTwqLnmlJuRXIh2t-2uRA"
  },
  "UjEwHmaIv4j4mmUG8yKyhQ": {
    "date": "1/4/2018",
    "text": "This place is AMAIZING!!!! The food is DELICIOUS!!!!!Its a small place and not easily noticeable, however definitely worth stopping in. The food is delicious and reasonably priced. They accept credit cards and staff is very friendly. Its a nice place to eat after a very nice walk in the Hyde park. If I am ever back in London, I am definitely going back!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tXLeQeaa_SExwOMnsf37Nw"
  },
  "WzTXRN9GsslAn90hHp9emw": {
    "date": "12/10/2017",
    "text": "Great local restaurant We were seated immediately Service Very attentive; they took the time to walk us through the menu and provide suggestions FoodLarge portions and well seasoned The food came out relatively fastEnvironment The have music playing in the background This restaurant is a great setting for large groupsDefinitely recommend is you are in the area and want to try something new!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iF_Z_URL3O5eEAcTPv3IgA"
  },
  "oByvjcF00Ctv504A2zE76A": {
    "date": "5/19/2018",
    "text": "Absolutely amazing food! We came in late and were luckily to get a seat. My friend and I ordered the Meze dish and it was phenomenal. The dishes were so simple and flavorful. Apparently a few famous people have eaten here too. Definitely worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJcH5UNzLCXk-pxHnwAi9g"
  },
  "cYcRfAWgPG_VMZxRMnpZvw": {
    "date": "7/8/2017",
    "text": "This is one of the best Greek restaurants I have ever been too, the food was amazing!  We ordered the Greek Meze to share for two and there was so much food it was more than enough for four! It included a great range of dips, seafood, kebabs and so much more. I also went for a bottle of Greek red wine and that was as good as the food. The staff were all really friendly and helpful, we hadn't booked a table and when we got there it was full, but it didn't take them long to try to squeeze us in and it was well worth the 5 minute wait we had. I would highly recommend this place and if I'm ever in the area would definitely go back again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k03iYsJZtTK6muIobY90NA",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k03iYsJZtTK6muIobY90NA/o.jpg"
      },
      {
        "img_id": "letWfOtNqmtyIrmPrPOjxg",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/letWfOtNqmtyIrmPrPOjxg/o.jpg"
      },
      {
        "img_id": "gXvPzBm1uzezlMjzvl5Aqg",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gXvPzBm1uzezlMjzvl5Aqg/o.jpg"
      }
    ],
    "user_id": "uk6KzngiZI_6419AhnoNzQ"
  },
  "FoFCL8hEcGLB4tuWjWFrbg": {
    "date": "7/4/2017",
    "text": "Best Greek food I have ever had! This place has a very cozy atmosphere and a great family owned, these are all a loving mother's recipes vibe to it. We got humus as an appetizer, which was excellent, then when placing our order for the main courses the waiter challenged me to get one of the Greek specialties in the menu and I'm glad he did. The Klefticon is fantastic! Probably one of our favorite dinner spots from our entire time in London. If you want a table to yourself you will need to make a reservation, but the communal tables in the middle of the restaurant are great too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMhyF9hIlcOqo9sDp3Qoxg"
  },
  "0hXgeYmCyZucYA0vxqtsfg": {
    "date": "1/17/2018",
    "text": "Just passing by here and this has to be one of my favorite places to eat ever! Cozy environment, AMAZING food, super service and so on! I got a salad and some lamb and it was the beeessst lamb that I have ever eaten! Everything was very fresh!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUd0gswKSKBic9BOQreYGg"
  },
  "_GSaOIu6sZSe5SWPTod1ig": {
    "date": "7/12/2017",
    "text": "This is hands down one of the best Greek restaurants I've been to. I live in the area so it's my go-to spot for taking out of town guests or people who appreciate good food in general. The inside is a cozy, homey environment, and the service is great (the waiters are very personable which definitely adds to the experience).  They provide a few free starters which includes an assortment of vegetables, olives, pita. For mains, I never come here without ordering the grilled calamari - such good flavour and the texture is perfect. Other favourites are the Klefticon (Lamb shank), Moussaka, Mixed Grill, and of course the Greek Salad. Portions are sizable so come hungry.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LuycthIHjsdlJ6emo8faCA"
  },
  "9TsYueflUpNiT5e1yxNJuQ": {
    "date": "6/7/2017",
    "text": "We went because it was really close to our hotel - we'd come back for the food and the service. The waiters are so personable and fun that it made the whole experience worth it. Our table had the spanakopita (8/10 and is a really big portion!), the Greek salad (9/10 really refreshing and has fresh ingredients), the kleftikon (8/10 HUGE portion that comes with sides of fries/potatoes), lamb kebab (8/10 another huge portion).The food was pretty good, nothing that was out-of-this-world-oh-my-god amazing but it was a great time and the service was really 10/10",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69iz-wtaVfFcbCMuQcJmCA"
  },
  "Jrj-NFMu4FCVG9fLBqhocw": {
    "date": "11/25/2017",
    "text": "We've been to this restaurant four times during various stays in London. What does that tell you? We keep coming back because the food is so good. We love that it's family-owned and the second time we walked in we were recognized and treated like royalty. It's also nice to come back a few years later and see the same people working there. The food is authentic and therein lies it strength as a restaurant. The hummus is a must order to accompany the pita and veggies/olives that they give you soon after you sit down. The hummus is so smooth and silky. We also keep ordering the fantastic octopus salad. The grilled calamari is very good. Any lamb dish here will be a treat. The servings are very generous. Over tonight's dinner, we struck up a conversation with a nearby table mate who is Greek. He came to school in London and stayed on. He's been coming to Halepi for 20+ years. In order to fully enjoy yourself here, you have to realize that it's like dining in a family house. The wait staff can be welcome and warming one minute and abrupt the next. The decor is simple. Staff sometimes bump your chair as they negotiate the narrow aisles. But in the end, it just feels like you're eating authentic, traditional food in someone's dining room in the Greek countryside.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "73Cx3UEWcmmErEJB3xNbkw"
  },
  "_RllNYRwhwY4AmVtSi37IQ": {
    "date": "2/17/2017",
    "text": "Absolutely amazing!We were immediately struck by the warmth of the service and the restaurant itself - it's comfortable, snug, and friendly. You start out with some veggies and olives as snacks/palate cleansers - they're great. We opted for the meze (selection of greek dishes) -- it came with a procession of appetizers and 2 main courses. Man, was it good! Freshly baked pita, delicious hummus, tzatziki, eggplant, tabbouleh, and halloumi for starters. Then the calamari, prawn, stuffed grape leaves, lamb, chicken, and greek salad... it was a lot of food but all very very good. You could taste the freshness especially with the prawn, calamari, and tabbouleh. All closed with a few Turkish delights. Delicious foods, comfortable and unpretentious surrounds, and great service. It's not surprisingly cheap, but it's not surprisingly expensive either. Well worth a visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iyriIXeFsEWheQCPvf6jwA"
  },
  "ptPyIYNodCF7lsk1mlFizA": {
    "date": "8/23/2016",
    "text": "A down to earth interior, ambiance and staff. A high to skies food, service and specialty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Gyi-Se3uLhREWQ8NCYOMWw",
        "caption": "Photo of Halepi - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gyi-Se3uLhREWQ8NCYOMWw/o.jpg"
      }
    ],
    "user_id": "0kzj9bsoT7uYsO55QQEMiQ"
  },
  "sd_FNiPnmzLb-iEVTjtZTA": {
    "date": "1/14/2017",
    "text": "I almost feel guilty exposing these amazing local finds on yelp. If you are a lamb fan, you dont want to miss Klefticon here. One of the best lamb i ever had. Very friendly staff. We just walked in one saturday evening and seats were available immediately.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vAd0nmkuhnQIPkOivIbbow",
        "caption": "Photo of Halepi - London, United Kingdom. Klefticon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vAd0nmkuhnQIPkOivIbbow/o.jpg"
      }
    ],
    "user_id": "eV1ox_DFjghD82s1AYhBeg"
  },
  "VvoSY6xLLuRJ4kjbLNoNkQ": {
    "date": "10/1/2017",
    "text": "Went with the family. Had to wait quite long to get a seat. The only thing we liked was the calamari. The taste of other dishes that we ordered was wayy off. The waiter said the portion would be 1:1 but any of us could barwly finish half of our dishes. If we had known, we would have ordered less. Really expensive and very noisy. Would go with friends but never with family again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LC1-h542s1k1OxNs7QzwNA"
  },
  "-zOEq0sf-f6Q2AgDMnsy9A": {
    "date": "4/20/2018",
    "text": "Had a Kebab urge while in London, and this definitely hit the spot! Will be back the next time I am in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "97R6VG7G6EbzZHgGsVtXqg"
  }
}