{
  "vy_9273OzoSKYEkEhYop-g": {
    "date": "2/21/2009",
    "text": "This has got to be the best Won Ton Noodle Soup in London! A tasty broth, is host to meaty savory dumplings, alongside slithers of roasted pork and sliced king prawns. I usually order that and some of the amazing water spinach and I am in heaven! The salt and pepper quid is cooked to perfection and the summer rolls are beautiful. I would definitely rate both of them. The other soups on the menu are lovely too, I would recommend popping there for soup if that is mostly what you are craving. I have had other things, which are lovely but I always finding myself wanting soup when there. Especially when most soup is under 8 quid for a massive bowl that will leave you full up until the next day. Restaurants like Viet Grill, restore faith that you can have an amazing feast, cheaply in the middle of the credit crunch. It's also got such a relaxed atmosphere that you can go with a date or with friends and still find you have a wonderful evening, in sleek surroundings.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GDEKb9InUurIaVUAF2zNcw": {
    "date": "5/13/2011",
    "text": "Best Vietnamese I've had in London, largely courtesy of the starters which were gorgeous. The dumplings, soft rolls and calamari were all perfect - fresh, filling and delicious. In comparison the mains were a slight disappointment: beef brisket a little dull in flavour, chicken royale just chicken with a slightly bland sauce. The sitting duck curry was much better, but I wish I'd ordered the mackerel which apparently is really great.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ljGiPcuKKkjSpvXgJ-hz0g": {
    "date": "11/17/2008",
    "text": "For an authentic Vietnamese meal this probably isn't the best place to go i.e. there are slight western influences in the food which included for example rocket in the salad. Not a bad thing at all though but jsut wanted to point this out. The springrolls are quite nice but a bit overpriced, and the pork included in my rice dish was quite dry. Food arrived in dribs and drabs so a member of our group of eight got his dish after everyone else had finished. Overall if you're ok with rushed service for reasonably priced but average vietnamese food you should give it a go.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_P4QuJVnDh9W35S7nKo4hw"
  },
  "R2lSiFiam0gpWIKljtR8Cw": {
    "date": "8/15/2008",
    "text": "Vietnamese is by far my favourite Asian food, yet it is one of the Asian sub-types hardest to find in the capital. Viet Grill proves why their food is so good and makes it more accessible. The food is fresh, healthy and well-made. The flavours and combinations used are unusual but fun and blend well together. The service is unobtrusive (which is best!). The interior is nothing special, but very neutral and well-styled. It does mean the atmosphere is a little subdued, but for a quiet evening out, ideal.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "z5GVaJdQtZN8xe4koUCUaw": {
    "date": "4/19/2010",
    "text": "Sister restaurant to Cay Tre, this place serves basically the same menu.  The food was generally delicious, the beef in the  bo kho (beef stew) could have been a bit more softer.  Only gripe is that sometimes service can be slow here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxrjSqyZe2IjDZwXxIT9rA"
  },
  "R5EzNzAHItfzprLVwjyOLw": {
    "date": "8/27/2008",
    "text": "Yummy posh Vietnamese. My favourite on Kingsland Rd Bit more expensive than some of the others but the portions are massive and the food rocks (...so much so it often doesn't touch the sides on the way down). Some dishes can be a bit fatty (one plate comes with huge, actual slabs off the stuff) so avoid them if it's not your thing. Tons of choice and a big range of tasty specials that really are particular to the restaurant.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cwh2V0ymG85UntjvBIBemQ": {
    "date": "9/4/2009",
    "text": "The best Vietnamese in London by a country mile. The ingredients are fresh, the portions generous and the dishes simply delicious. If you don't know what to choose, go for the smiley faces on the menu and you can't go wrong. I had a frogs starter (almost my duty when in an english group being french and all that) and the tiger chicken and tried a dozen other dishes from the party: all fantastic. Now I want to go back for a soup session.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yT3I0S844exv5Tefx77e1w": {
    "date": "6/12/2008",
    "text": "Awarded as one of the best cheapies in town, with a dozen of positive reviews posted on the main door, I couldn't refrain from popping into this 2 storied vietnamese restaurant on a lazy Sunday evening and checking on me what the buzz was about. Straight after ordering our drinks, opting for some traditional jazmyn tea, we dive into the quite wide menu, that offers basically a long list of soups and evoking main courses. I felt sort of lost and decided to ask our waiter for the most convenient choices, that turned out to be a small size soup and any kind of roast- duck, pork, beef or chicken to name a few-. He recklessly suggested a big bowl of soup for starter, which would be a mistake as the portions are massive; honestly I reckon a large bowl can hold a liter of those succulent soups!. This is not necessarily bad but I have always had a soft spot for finishing my meal, difficult task to accomplish if your starter call fill up a mammothThe main courses were also abundant, tasty and beautifuly presented, and, what is most, healthy enough to get your less lenient doctor approval. Say goodbye to mixed feelings after a heavy and rich meal out.. I also admit that the service was very considered and on the spot all the time, matching our standards with no problem.To round everything up when the bill arrived on the table we were surprised for good, way under 30 pounds all together, making that place a one to definitely keep in mind.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yq8Ls4AQdvXYVPm9s-a6ZA": {
    "date": "9/30/2008",
    "text": "One of the most posh vietnamese restaurants on Kingsland Road, so prices are a couple of pounds higher, but then you get to dine with nice fish tanks and swanky tables. I saw some very large groups dining on a Friday night and they all looked very happy. I'd recommend booking ahead if you'd like to eat at 8pm, as the restaurant filled to capacity between 8 and 8:30. It got very loud, as the interior is all hard wood. I wouldn't come here for the pho or the bun, I've had better elsewhere. It's better if you branch out, try the curries or the sizzling beef. Service is the usual madcap rush typical of a very busy restaurant. We had 3 people offer to take our drink orders after we'd already ordered drinks. Two of our mains were served, then the rest of the meal trickled in, including our starters. At the end they asked us, politely, to vacate so that other diners could be accomodated. But that was only after we'd chosen not to order dessert or coffee. So if you know what to expect, it can be a very pleasant dining experience.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "s9Yti2D21q_r_NtLzea-DA": {
    "date": "5/2/2011",
    "text": "go the quail curry! although i've had better pho in other countries, ive yet to find a better pho in london. we usually get the quail curry main, and the 'recession menu' - go either pho or lemongrass pork/chicken vermicelli and the calamari for entree. yum!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOoFZlv2kDLyHBJ4nneWnA"
  },
  "ch1O7NwoxPaLayQalZo4qA": {
    "date": "11/19/2008",
    "text": "This place does the best Vietnamese food. Always lively and attracts diners from all over London. There are a large range of dishes to choose from on the menu, and so always hard to decide what to eat! The prices are very reasonable and you'll leave the restaurant very full!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "o7dXvbcfSraJjN54Tjl1FA": {
    "date": "4/7/2012",
    "text": "The food was excellent. Just the waiters were way too present and we felt watched all dinner long.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sz56DbuDSP5Rdd3b1rC0Bg"
  },
  "oxISoNmKLMRRR0Duc9wo3Q": {
    "date": "11/24/2010",
    "text": "I am ashamed to say that I used to live in these neck of the woods and not once in the year or so, did i venture to the Vietnamese restaurants around Shoreditch. Boy did i miss out!I went last Thursday for a long overdue catchup with a dear foodie friend. Her original choice was Cay Tre and I had booked us a table but unfortunately we were late and they gave our table away. By the time we got there, there were queues outside of the door with a waiting time of at least 20 mins. Luckily a friend was just leaving who advised us to go to Viet Grill as it was run by the same people and had the same menu. (we were famished by this point!) So we walked down and found that seating was plentiful and got a table right away. (i would still advise booking though as they tend to get very busy) Viet Grill was definitely more spacious with a tasteful bar at one end and lovely vibrant green decor - giving it more of a restaurant feel than Cay Tre (which was more like a cafe). The staff were super attentive and made sure we had our drinks and a menu straight away. We ordered an immense amount of food as the aromas were mouthwatering when we walked in. We had the king prawn summer rolls, Crispy Hanoi dumplings and chilli salt & pepper squid to start - yes we were piggies! - and then each had a \"Bun\" (one bowl meal) to follow with a veggie side. The food arrived really quickly, which was suprising given they were so busy. I couldn't wait to tuck in.The dumplings were super crispy and amplesized. The prawn rolls were light with juicy prawns inside, complimented by lovely vietnamese herbs. The squid was cooked perfectly with a light crispy batter (I would have preferred a little more golden but I wasn't being picky that night!). By the time the Buns came, my friend and i were 90% stuffed already but we soldiered on... My Bun was like a spring roll special (i love Vietnamese spring rolls). Rice noodles, salad, spring rolls (prawn & imperial) and little meat parcels all topped off with herbs. Yummy!! I thought the noodles were a little on the soggy and watery side, but aside from that i couldn't complain. Again the portion size was really generous. I loved all the flavours of the herbs used in Vietnamese cooking and of course i am a chilli addict! So all in all, I would highly recommend this place for a casual dinner with friends or a quickie bite if you're in the area. It's great value for money, excellent food and friendly efficient staff. Definitely going back there soon with the boyfriend i think!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6vuIyZRXQLfVOdzBE1TgA"
  },
  "y7K-78dyQuNpOqw4ZN783w": {
    "date": "2/9/2011",
    "text": "I hate to be the one person to tear this place down, but really-- I had a terrible experience there last night. Friends had recommended it, making it all the more disappointing. To start off, the menu we were given once we sat down did not correspond with the one posted outside the main entrance. The prices were higher and the \"recession deals\" were absent. When I enquired, I was simply told, quite brusquely, that yes, the menu had changed. OK, but not even an admission that they'd been thoughtless in not updating their outside menu? No kind of recognition that it was misleading to customers? Secondly, a friend and I ordered tap water, only to be looked at disgruntledly The two waiters kept hovering and repeatedly asking if we didn't want any drinks. We weren't being cheap-- we just only wanted water! Two other friends ordered beers, but clearly this was not good enough. Thirdly, and most irritatingly, we ordered as an appetiser a seafood house platter priced at £8.50 to share between four of us. We were then told that the minimum order for this dish was two, something not indicated in the menu. We thought \"what the hell\" and agreed to order two. Well, what we were presented with was one-- yes, one-- rectangular plate containing about six deep-fried king prawns, a pile of deep-fried squid strips, a bit of salad garnish and one small-ish deep-fried crab. Huh? I thought we'd ordered TWO platters! So basically we paid £17 for a few nibbles each of a very poor seafood selection (and all of it deep-fried... probably to obscure the fact that it wasn't fresh). Any good points? Well, my friend's catfish was tasty and tender, and my friend's chicken was decent. My wanton soup on the other hand was mediocre, and I paid £8.50 for a \"large\" portion (i.e. the same portion you pay £6 for in any other standard Vietnamese restaurant). Add to this the fact that mains do not come inclusive of rice and/or noodles, and our bill skyrocketed. Don't be fooled by the fact that this restaurant has fancy decor and is always rammed. Go somewhere else on Kingsland Road or elsewhere; the service is bound to be friendlier and they won't trick you into paying loads for merely passable fare.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1eq4cwnEhfeJdURUyvB_sw": {
    "date": "4/17/2011",
    "text": "The best vietnamese in London, if vietnamese is not Pho. First of all, this place, no matter how busy they are, they have never turned me away because I haven't made a prior booking ! I've tried most of the dishes here in Viet Grill. Rule of thumb, i'd avoid all the dishes which sound like a variant of chinese stir-fried, as they would taste exactly that (boring). in other words, if you are familiar with chinese food, avoid the ones which you recognise on the menu :D If i could only order 2 things of the menu, they will be :- the oven-baked mackerel, which is so well done to the right level of moisture, crispiness, flavour- cassava vermicelli which is cooked with a special herb which renders the dish an unique flavour ! For pho, i'd prefer this other place in south london ....",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3DDhnSMIwCY0qrad6XizdQ": {
    "date": "8/18/2010",
    "text": "For pictures please refer tohungryinlondon.com/2010/…  Sunday lunch time and I was craving Vietnamese food. Viet Grill seemed the right place to go to as it had received loads of raving reviews and I expected a meal full of culinary delight. But I was bitterly disappointed. Without doubt, Viet Grill is  compared to the other Vietnamese restaurants in and around Kingsland Road  incredibly upmarket regarding its decor while still being relatively cheap. It is managed by the same people who also do the substantially less stylish Cay Tre in Hoxton; I had however the much better food at Cay Tre. I resisted my urge to order the fresh summer rolls (I have some Pavlov reaction whenever I enter a Vietnamese restaurant to order the same things) and decided on the Pho cuon (5). The description was: 'Steamed 'Pho' paper roll filled with pickle and wafer thin tender beef served with sweet chilli sauce'. So maybe there is some communication problem between Vietnam and Austria here but I did not expect the beef to be minced (?). It was quite nice anyway but relatively heavy and it did not impress with the fresh flavours that I associate Vietnamese food with. I absolutely love Vietnamese salads so I was intrigued by the Mango Salad with dried squid (7) on their menu. It was ok, but again lacked depth of flavour. No competition at all to my favourite Vietnamese salad, the papaya salad at Song Que. Then one of my favourite dishes of all time, Bun Sa (7)  a one bowl dish with rice vermicelli, chicken, lemongrass and bean sprouts. This was really quite good at Viet Grill and we happily finished it. I could however have done with some more fresh Vietnamese herbs which would have raised the dish to a higher level. They were in general a bit stingy with their herbs I have to say. Then we made the big mistake to order Muc Xao Lan Viet Grill Squid (7.50). I had the best squid dishes ever in Vietnam and have been searching up, down and around Kingsland Road for something similar ever since. Just to let you know, I have not been successful yet, but the Viet Grill version was the lowest point on my quest for the perfect Vietnamese squid. The squid was basically inedible. Chewy, though and bland. They promised us 'fresh vine tomatoes'  but the tomatoes in the dish clearly resembled rather the Dutch greenhouse version, pale and tasteless and not even properly cleaned off the the middle green bit. Apart from the inferior ingredients the dish also did not impress tastewise  the flavours did not work together very well and we hardly touched it. I mean me not finishing food! that's rare, believe me It might really be that I was just very unlucky, but I have had far better Vietnamese at Song Que, Cay Tre and Que Viet. Such a shame really, as Viet Grill has without doubt has the nicest atmosphere and you could imagine bringing e.g. a date there or your parents.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "_r4mCiPurn8ub43sXk1zJA": {
    "date": "4/6/2009",
    "text": "Missing my local Vietnamese haunt back in Orlando, I decided to find a suitable replacement for my summer-roll-and-peanut-sauce habit.  Having found Viet Grill on Yelp with 4.5 stars and compared it with its other Kingsland Road compatriots, I picked it for its more formal dining atmosphere.  You see, as much as I can appreciate canteen-style dining, all I really want on a Sunday afternoon is a leisurely dining space.Viet Grill provided in terms of style, but it broke the cardinal rule of dining when it chose this over substance.  What good is some shiny fleur-de-lis-inspired wallpaper and a fully stocked bar when the listless flavours in my noodle bowl had me wondering if I might find some sri racha to spice things up?There was nothing WRONG with the food.  Contrarily, the chefs executed everything adequately, with appealing presentation and all.  But the exceedingly bland flavours had me eating to live not living to eat.  And if that's what I wanted to do I would have mixed myself some porridge oats and water at home.  I kept waiting for some pungent lemongrass, some zingy basil and above all some vinegary, fish saucy sauce (I do love some fish saucy sauce).  But, alas, none.  Nothing about my food sung.  The languid rice vermicelli sat nestled in what seemed like water peppered with . . . water, taunting me in all its 1000% cost markup glory. Husbatron munched along contentedly, usually satisfied with whatever is served to him, blaming my discerning palate on heightened American expectations (I won't settle for bland food!), despite admitting he had had much better Vietnamese food previously with me in Viet Town in Orlando.  When the culinary feats of an unexceptional town not know for its cuisine surpasses that of a cultural centre like London, you know you have a problem.  The fact that restaurants like Viet Grill can afford to persist in London boggles the mind.So, in the end, did I leave completely stuffed full having finished the towering bowl full of food desperately seeking the familiar flavours I convinced myself must be somewhere below? Yes.  Did I leave feeling I had a particularly Vietnamese dining experience? No.  Was I disappointed?  Absolutely.I am tired of watered-down Asian food in this city.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "TS5UNjN5Fo1rtNCmhds3HA",
        "caption": "Photo of Viet Grill - London, United Kingdom. Sadly, the uninspiring summer rolls were the highlight of the meal.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TS5UNjN5Fo1rtNCmhds3HA/o.jpg"
      },
      {
        "img_id": "mBVMO4BmZVH1qThYGvDewQ",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mBVMO4BmZVH1qThYGvDewQ/o.jpg"
      },
      {
        "img_id": "NUqvpyWz3q44j-SDuMgB9g",
        "caption": "Photo of Viet Grill - London, United Kingdom. Little glasses mean big money made on refills",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NUqvpyWz3q44j-SDuMgB9g/o.jpg"
      }
    ],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "pNqzy0q3kDZQgwds3f_PnA": {
    "date": "10/11/2010",
    "text": "I love this place so much that I've been to eat here on consecutive days... Everything is so fresh and zesty; there's nothing else to hold a candle to it on Kingsland Road. The menu is huge, and the dishes are very affordable, so you can make a pig of yourself without repetition. More than that, it's utterly utterly delicious. I wish I was there right now. I always, always, always get the 'Feudal Roasted Beef'. And then argue with my other half about whether or not it's better than the Beef Vinh (I think it is). The only reason I can't give it five stars is the wine - it's a well considered list, but dramatically overpriced. They need a couple of house wines in the £12-£13 bracket really.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V54_tYTc316sWaafMGgOmg"
  },
  "6PCzUXNrXDP-iu2CdQu6DQ": {
    "date": "3/9/2011",
    "text": "First time I went here I loved the Pho and we were all happy. But I think they give a good service when they are EMPTY! I was meant to go to The Breakfast Club, but it was so packed and I was too hungry to wait. I figured I could do with some Pho. This time it was a little busy, but it was early afternoon, so they weren't rushed off their feet. The service was appalling. I've noticed this trend with some restaurants, where unless you are Caucasian or from the same country of origin as the workers they will not give you the time of day (I'm from the Far East too, but obviously not their kind). This time round the Pho was less than mundane and my friends chicken was still bloody, real nice(!). I ordered jasmine tea and what I got was a pot of extra, extra, extremely strong old tea. Ya know the kind where they just reuse the same pot of tea over and over, topping it up with a few leaves. I can usually drink quite strong tea, but it was unbearable. I rarely make complaints in restaurants as I don' t like to make a fuss. I asked for the tea to be changed as I could not drink it. The first challenge is to try capture the attention of one of the waiters. Obviously this is a difficult task even when they pass you and look at you,  but you are still ignored. I had I raise my voice a little, which isn't something you want to do in a restaurant as it draws attention and I feel uncomfortable. I had to ask where my tea was as I was left waiting a while. I figured they were changing it as a whole. When I finally got it back they had just topped it up with a little more water. YUCK! It was interesting watching the waiters attend so attentively to the group of viets next to my table. A friend has also commented on how the staff can be quite rude. I believe a good experiance come from good service. I too am a paying customer and I would expect the same service as the other people there, but obviously I was wrong.",
    "rating": 1.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "79XSuNZbSJBYX6bllIPqoQ"
  },
  "hdac-VmWjOXEl0tqwibJrg": {
    "date": "2/22/2009",
    "text": "Viet Grill is a bit more upmarket than most of the other cafe-style Vietnamese places on Kingsland Road. All serve fantastic food, I've no doubt, but this one feels just a little more like a 'proper' restaurant (whatever that means). No rushed service, and you can't hear the screams from the kitchen. Anyway, I loved it. First of all I have a love - nay, addiction - of interactive food. Brought on by my trip to Japan, where they have at least 6 distinct different kinds of interactive food (grill it, boil it, mix it, waggle it in broth, set fire to it.... and so on, all at the comfort of your own table), if I see anything remotely DIY about something on a menu, I have to have it. We had the rice rolls to start, and out came a gas fired hotplate dome thing (that's the technical term), raw beef, and 6 different kinds of additional filling. Plus hot water for the rice sheets. Some might think it's a right kerfuffle but I love it. It helped that whatever you, even quite cack-handedly produce at the end tastes bloody brilliant. There's some pickled cabbagey stuff and chilli sauce which could probably make even cindered beef taste good. Then the main courses are great, because they tasted like nothing I'd ever tasted before. My boyfriend had a fish dish which was a completely new flavour experience, and I had pork which was seriously declicious, and we got proper crispy noodles. Anyway, the point is, this restaurant has so many good points:- interactive food- new foreign beer to try- new foreign food to try- GOOD food- good value- a fish tank in the basement- fancy chairsThe last one is clutching at straws somewhat, but anyway - 5 stars.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 4
    },
    "photos": [],
    "user_id": "EdMcp1ncZ18DMdX4vx5ZrA"
  },
  "aBp4m8zEfQUZPuMPYlvo7w": {
    "date": "2/20/2011",
    "text": "Sometimes you need more than a roast dinner on a Sunday... I've spent most of February dreary craving the clean spicy notes of South East Asian cuisine. Partly because I've been a bit ill, partly due to a (slightly unusual) craving for healthier food and mainly because when done really well it's bloody lovely. All things considered then, it was inevitable I was going to end up on the bottom end of Kingsland Road at some point. Home to a concentrated community of Vietnamese expats along with the shops and particularly the restaurants that support them. For me, I've had some great times at Song Que, abrupt perfunctory service and canteen style decor aside. One of the other gems on the street is the Viet Grill, sister to popular Cay Tre in Old Street. There are another 4 or 5 that I've been recommended to over time too, it's almost enough to make you hug a hipster and spend more time in the East End.It's more designed than many of the cheaper cafe options along the road, fishtanks built into the walls upstairs and down, a well designed bar area and rather garish wallpaper. The tables are plain dark wood, bottles of chilli sauce stood waiting, kept clean by constant turnover. Don't get me wrong, it's not as canteen-like as Song Que, but it's definitely not somewhere you can linger over a coffee.We went for the Cà tím nng and the Ph cun to start (all of the menu items have the original Vietnamese authentically written alongside, though you won't hear many of the slim jeaned trendies who mainly fill the place these days parlaying the ting Vit). In translation, a silken steaming pile of slowly braised aromatic aubergine topped with spicy, caramelised minced pork and thin noodle wraps with strips of beef steak and herbs. The porky aubergine was revelatory. One of the tastiest things I've eaten this year so far.Our mains were more of a mixed call, though more of choice and judgement than quality of the food. My partner went for the Pho. Hot, spicy and packed full of rice noodles and fragrant broth, it's the dish that keeps going. I went for the Tamworth pork belly, served in a caramelised coconut juice with a side of jasmine rice. Pleasant enough, with the subtle more-ish heat of star anise and a chilli kick in the coconut juice, the texture wasn't doing it for me. Fat braised down, skin of gelatine, maybe it's my expectation of pork belly. One or two of the quivering cubes served with a crunchy salad and side (some of the veg percolating in the pho would have done the trick), but as it was, it was a lonely single texture, and rather a lot of it. one to be avoided unless you're dining with a group.Worth a note that there's a pre-six o'clock and lunch menu, great value at £6 for a large bowl of pho. That being said, a small bowl will do most people, and free you up for other choices on a menu of spicy delight.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "lz0dZ0SuLSQA041IFxFPrw": {
    "date": "2/9/2010",
    "text": "Viet Grill - Pics at The London Foodie(thelondonfoodie.co.uk ) Vietnam has one of the most sophisticated cuisines in the world and is one of the few countries I keep returning to particularly for its food. Closer to home, I have been heading to Kingsland Road for my fix of Vietnamese food and have become Song Que's indisputably Number 1 Fan in the last few years. I had resigned myself to its scary plastic lobsters and unfriendly service. If only I could taste its magnificent pho soup - all would be forgiven. It is all about the food, and although I do not believe Asian cooking should necessarily be cheap, I certainly do not want to pay a premium for the sake of trendier decor. I have thus viewed the recent smartening up of some of the restaurants on Kingsland Road with a little caution. It was with these thoughts in mind that Dr G and I went to the newly re-opened Viet Grill on Kingsland Road. Despite getting a complimentary meal offered by its PR machine, I feared I might dislike this restaurant. It was a Friday evening at 8pm when we arrived and the restaurant was buzzing. Despite the long queue of customers, we were soon shown to our table. First impressions were good  front-of-house staff were friendly and polite, the restaurant had been painted with a beautiful design of banana leaves and decorated with some nice touches like wooden bird cages, a beautiful aquarium and some modern but discreet lighting. Tables were positioned very close together and we soon struck up a conversation with a delightful couple Olivia and Moosa who were sitting next to us. They were regulars at Viet Grill and were very positive about the food despite being a bit weary of the high density of diners the restaurant catered for at any one time. Our starters did not take long to come; these included Mango Salad (sun-dried squid, Viet mint, peanuts, mango) @ £7. I was delighted by this, and loved the flavour and unusual consistency of the sun-dried squid. It was a deliciously refreshing salad with some interesting flavours and started the evening on a good note. The Piggy Grilled Aubergine (spring onions, minced pork in tangy sweet and sour sauce) @ £5.50 was the next starter and, in my opinion, was one of the best dishes of the evening. I love aubergines, and the addition of spring onions and pork to a rather delicate and well-balanced sweet and sour sauce made for a very good dish. This was followed by the Feudal Roasted Beef @ £9, a Saigon speciality, this tasted as good and fresh as the ones I remember having in Ho Chi Min City. A Mixed House Platter @ £7 per person was served next containing Mango Salad, Imperial Spring Rolls, Fresh Soft Rolls or Goi Cuon, Beef Wrapped in Betel Leaves & Chilli Salt and Peppered Squid. I always order goi cuon and beef in betel leaves whenever eating at Vietnamese restaurants, and Viet Grill's did not disappoint. The Fresh Rolls had just the right amount of vermicelli, herbs and prawns, and were fresh and delicious. This is one of the simplest dishes on any decent Vietnamese menu, and can be prepared well in advance. If prepared too early and not stored, it can smell and taste of the refrigerator. This was not a problem at Viet Grill. Fresh Rolls are also great to be made at home and served as canapes if you can master the softening and wrapping of rice paper sheets. I would recommend practicing it thoroughly before your guests arrive! The first main dish was Viet Quail Curry (with aubergine, crunchy okra, coconut and spicy curry sauce) @ £8. This was unusually spicy for a Vietnamese dish but had some interesting flavours and textures coming through from the crunchy okra and quail meat. It was not an easy dish to share as the quail was served whole and on the bone. The other main dish was Slow Cooked Mekong Catfish (poached in caramelised fish sauce, simmered in a clay pot and finished with cracked pepper and fresh chilli) @ £7.50. Viet Grill's description which I quote above in brackets was very apt but it does not do justice to this fantastic dish  the sauce was deliciously sweet and salty and gave the dish a richness I had not yet tasted, complementing the fish perfectly. By far the best main of the evening and one I will make sure to order again. I love having my food prejudices challenged in this way, and this time, I am pleased to admit that Viet Grill came up trumps. Most dishes on the menu were more sophisticated and authentically Vietnamese than other restaurants in the area with very friendly and helpful service. Verdict  Delicious Vietnamese food served in beautiful surroundings by some very friendly staff. Viet Grill has certainly raised its game and I hope it will become a standard setter for other Vietnamese restaurants in the area. Highly recommended.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v8Y4yqE3vbo0Adj25IJLpg": {
    "date": "12/13/2010",
    "text": "i went here a bit ago with a large group of work peeps on a sunday night. we had the foresight to give them a heads up, so they had a table ready to accommodate us. being hospitality folk ourselves, we like to think that we dont do all those annoying things large groups in restaurants do. right. sure. we tried, hows that.i organized starters for the table, getting way too much food, naturally. we each got a main and some rice and side noddles, and a couple bottles of wine.while the service was a bit disorganized and the food came out way disjointed, it was super tasty. even though there was way more food then needed, we managed to finish off most of it. and the best part: between 10 of us, the bill came to 30 quid each. including tax and extra tip.  boom chicka.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "I3URSVRu24EaGWpvZB0cuA"
  },
  "1Cl3oMto_GpSnmSI42Mgsw": {
    "date": "2/19/2010",
    "text": "Recently I was asked to review Viet Grill, so I dutifully trekked across town to Shoreditch of a Friday evening, in the hope that Viet Grill would woo me with its fine Vietnamese Cuisine. If wooing is what went on that night, then I should marry this restaurant and not Monsieur. The recent refurb of this bastion of Vietnamese food on Kingsland Road has turned it into a chic eatery with jungle walls, intimate lighting and unisex loos. As we sat chatting to our waiter about his recommendations, I spotted the shrine behind the bar. This was a 21st century shrine  all glowing with the help of red neon lighting, and the wine bottles stood to attention in seriously regimented rows. In my closet-obsessive way I like that sort of attention to detail, with all labels facing forwards. So with such an organised and ueber cool interior, could the food possibly be up to scratch? I'm happy to say yes, yes and then some. Monsieur had been to Viet Grill at Christmas last year and although he enjoyed his Chicken Royale, he said that some of the party found their selections to be a bit underwhelming. But under the guidance of our kindly waiter, we were to experience near-perfection. If you decide to give Viet Grill a chance to woo you, here are the dishes that made our mouths water each time we remembered them for some days afterwards: The Lotus Salad, crispy and fresh with spliced king prawns and the softest pieces of pork; Beef Vinh  a skewer of beef pieces so tender they almost dissolve in your mouth; whole oven-baked mackerel served with banana leaf and lemongrass  this dish will make any fish-lover sing all the way home; succulent Chicken Royale made golden by a delicate soy broth; wash it all down with a bottle of Gewuerztraminer, which matches this selection surprisingly well, and keep your head by diluting your blood/alcohol levels with a trendy cylinder of Artesian OSS water all the way from Norway. Definitely book ahead, especially if you visit Viet Grill on a Friday night, as we did  the place was pumping, filled to the brim with happy diners and showed little sign of slowing down when we left at 10.30pm.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1dZLKhLWSK0dyAUHWqSDkQ": {
    "date": "3/6/2011",
    "text": "The places wasn't all the bad, however, my friends (that I loving refer to as my Asian Invasion) have been on a Pho kick to find the best in the city.  On this quest, we stopped at this place to see how the Pho was.It wasn't.It was a little bland.  They didn't give you a lot of extra things to add into the Pho, such as limes and sauces.  Pretty much, I've had better Pho.  I'm not sure about the rest of the items on the menu.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OwuaDy7quaKRHrton4G9Q"
  },
  "7Jpb4p6lar8Hu2Y7FdeX3A": {
    "date": "1/13/2011",
    "text": "Agreed with the blandness.Excellent presentation and nice lighting/design, but as a pho lover, I found the pho bo depressingly small in quantity and not particularly tasty.  My lemons and bean sprouts were far from fresh.  I've found street vendors with better pho.Having said that, a 'large' bowl of pho only costs 6 pounds before 6 pm, which is pretty cheap fare for LondonAlso, typical of London restaurants, the waiters here took ages to bring the bill even when there are few customers",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Co5d1DpCkZKVWt80mUJOKw"
  },
  "7NPrSrfBMaQ_MG_UdnHa9w": {
    "date": "11/25/2011",
    "text": "I wasn't impressed at all with my plate of \"Sizzling Seafood\". The word \"sizzling\" was entirely inappropriate. It was bland. The bottles of wine were painfully overpriced too. I wouldn't go here again.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LGnEuQigg11xYzl1HSjlwQ"
  },
  "D4vwN_L0YHvz4C1mpvGCWA": {
    "date": "1/19/2012",
    "text": "A friend of mine once said \"Viet Grill is where East London goes to get fed.\"It couldn't be more true. While it's smart, modern, airy decor may put off some looking for a more \"authentic\" Kingsland Road Vietnamese experience, it is about as well run and well appointed a restaurant as I've ever known. It's beyond reasonably priced, the food is very good, and the wine goes beautifully with the food and is served in big beautiful and varietal-appropriate glasses. While I was living in London I used to come here at least once (sometimes twice, sometimes three times) a week to \"get fed\". Personal favourites include the Pho, the Duck Curry (heaven), and the Spring Bowl.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nQeW-6DmDHpNeVRxgtfthA"
  },
  "78DmXK5RnKb6F7z3wfflBw": {
    "date": "7/10/2010",
    "text": "reserve on Toptable. get points. and eat good food here! this was the first Asian restaurant I've been to where the prices are fair (for london) and the food tastes good. Unfortunately, I didn't order the typical Vietnamese food (like beef noodle soup, vermicelli w/ meat, or rice plate with meat) so it's tough to measure how this restaurant compares to the usual Vietnamese restaurants I eat in California. I ended ordering a seafood and rice plate, imperial roll, and shaking beef. For those dishes, I thought they tasted delicious. I recommend the seafood and rice -- it's worth your money.If you want some good Vietnamese/Chinese type of food, it's worth giving this restaurant a try. Better yet, reserve it on Toptable (UK version of OpenTable + Poor man's version of Yelp). You can't afford to not use Toptable if you plan to be in London for a week (or more).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Eny1SN0Xqgc3ripURAC_sQ"
  },
  "ZGl1VADAWlGK_KEYPy0Eew": {
    "date": "3/5/2009",
    "text": "So far this is my favourite Vietnamese in London and I have tried a few. Located in the Vietnamese restaurant ghetto that is Kingsland road Viet Grill is a bit classier than your average no frill Vietnamese restaurant. It also has a decent enough (although basic) wine list which is also a surprise. We loved the salt and pepper squid but next time I will order one of the beef meals that you cook at your table in your own little hot grill.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QLTzajxMVJGksxL2WxXLjQ": {
    "date": "4/28/2011",
    "text": "I only had the one dish which was the spring bowl but I thought it was extremely tasty and with lots of nice fresh herbs. My dining partner ahd the seafood on jasmine rice and wasn't as impressed she thought the squid was rubbery and the scallops tasted old. But forget the homeamde lemonade it is mostly ice! Still I like this place best out of the ones I have tried on kingsland road, it has the tastiest food and the best decor.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "_md9kT-JPe3p92U5n7Vezg": {
    "date": "9/28/2012",
    "text": "This surely isn't the most authentic vietnamese restaurant in London. We first went there to try the Pho, this was quite a disappointment, it was small and the favors were just not there; My friends kept pushing and praising the Viet Grill so we decided to give it another try. This time we didn't go for the classic, but we went for some more \"fusion\" like dishes. And I have to say it was excellent. We had some monkfish and some barbecued pork and both dishes as well as the starters were very good. I only give it three stars for it's vietnamese cuisine, but for the fusion aspects it would rather deserve four...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TeU6dzfC8En5cn19QaYQxA",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TeU6dzfC8En5cn19QaYQxA/o.jpg"
      }
    ],
    "user_id": "012_hfMATnh0nUEi9OYLug"
  },
  "gFXA87J_5iXhDNQb9QzxfQ": {
    "date": "2/26/2012",
    "text": "I was quite keen to try Viet Grill as reading so many good reviews.It was disappointing. The food was overpriced for what it was. Yes nice decor but a case of style over substance. The service was haphazard and it was not even busy. The braised pork belly was good - tender and juicy.  The stir-fried duck was a real letdown - greasy.Plenty other Vietnamese places in Hackney and Shoreditch to go for, Viet Grill ain't seeing me again.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tW50LVGSciU1A4OEQdm63Q"
  },
  "zM_UfcBvfl9RVoZFauRKDw": {
    "date": "2/4/2012",
    "text": "The food was ok and in a big quantity, so i guess it was ok for the money spent. The staff was nice too. We sorta fooled around with a friend of ours who had gone to the toilet, meanwhile we were exchanging tables, just for the heck of seeing her reaction when finding the previous empty table, and throughout all that mess the waiters smiled or looked puzzled, but let us do our thing without spoiling the game or telling us we were not supposed to do that in their restaurant...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QM_Aq6hQksSIqWHFU9v_3A"
  },
  "m1vbsoABvm5YX5f-LCbSVw": {
    "date": "3/3/2015",
    "text": "The food is good. The atmosphere is nice compared to other Vietnamese places. A nice buzzy vibe and pleasant surroundings. The food is loaded with msg so be warned. I love the salt and pepper squid and you can see those big splinter-like crystals glistening all over the surface.  Portions seem to have become smaller.  There are better choices for value. This place is a crowd pleaser so I usually take friends here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOxvXx-3ks1HkExJFB-kEw"
  },
  "PSVSH2n-ye0KQ7NvewTd7g": {
    "date": "9/13/2012",
    "text": "This seems to be a happening place in Shoreditch. The ambiance is young and modern, with an efficient friendly staff. If you are not expecting an authentic Vietnamese food experience, this might serve the purpose for a date or a simple dinner. Unfortunately I ordered Pho... and was disappointed that they gave me the wrong noodles! My friend ordered a rice noodle dish, but it was way too bland. Don't think I'll be back given the number of other restaurants in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kg49IgzsS7-C7d2AaY-c9A"
  },
  "YQM-hE64M48DDCvX3ODMpQ": {
    "date": "5/23/2014",
    "text": "I was brought here by a friend who lives in the area, and who mistakenly made a booking for a neighbouring Vietnamese place on Kingsland Road. He had the prawn bun xa, which looked great. I had the mushroom photo, which was also very good. I added an egg yolk, because I am a big egg-in-soup fan, but £1.50 is a bit much of a markup, in my opinion. Nevertheless, everything was delicious, and I might even go out of my way to come here again. Service was friendly and quick, and we got out before the Friday night rush of diners.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cD2te7Lsf85xYYYrsijs6Q"
  },
  "cHNxiW-z9y1F_uJ6V5v9iQ": {
    "date": "5/21/2011",
    "text": "While the service leaves a lot to be desired the buns and pho are pretty good. The BBQ pork and the Spring Buns are particularly delicious. The pho is fresh, healthy and flavorful. But seriously, don't bother going in for lunch if you are short on time.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rO91mq7YrMbsz73Ufjt3tg"
  },
  "ezqJT3uS4yopeEfvorOocw": {
    "date": "3/1/2011",
    "text": "I don't know why people complain when they have crabs. I like crabs. I wish I had crabs right now, deep fried in chili spice that is. I've found my food, and it's Vietnamese. You know this has happened when you can actually taste the difference between the same dish in different places. Here at Viet Grill they do lovely food, it's just not a patch on the others I have tried down the street.So as I was saying, I love the soft shell crab they serve up on a Vietnamese menu. It's what I look forward to, along with the frogs legs and the chicken bun noodles, but here at Viet Grill I was so disappointed. The crab tasted a little to fishy and apart from that the only flavour I could pick up was oil. Considering how popular these guys are, I was so disappointed. The other dishes were nice but again not up to the standard of the other places I have tried. The summer rolls were a little dry and the oyster sauce was quite salty. Saying that, I went on a Friday night, for dinner, and the place has queues out the door.They were really busy but I still didn't expect the quality to slip quite so much. Saying that, I do like this place. It's BYOB, with a small corkage charge, it has a brilliant atmosphere and is perfect for a date or party. They have loads of long tables which are great for seating large groups of people. It's also really good value for money. It's a real east London experience eating, it's just a little disappointing too.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "rNZiXCtEra2h-MWYnD7YIw": {
    "date": "3/8/2011",
    "text": "\"Rich\" was the word of the day. We went here because this restaurant was supposed to be more authentic and more \"street\" (well, we *are* in East London after all). It's true that their menu diverges a bit from your regular pho mile offerings. The ambience was modern, casual and more than cosy (though roomier downstairs). My friend deemed it kitschy. Perhaps because it was a Friday night but service was negligent, painful for us starving gits. Never mind that our order was placed more than half an hour after arriving, though it appeared from the kitchen quickly enough. They didn't waste time on the bottle of wine that we requested, however! We ordered the square-shaped Crab Nem Royal rolls, which were pleasingly crispy but chewy on the outside and quite savoury on the inside - wood ear mushrooms, vermicelli noodles and crab. Of course, it was good- there was crab!! The more modest spring rolls were quite tasty as well. The first dish was the Seafood on Jasmine Rice. it was prepared well and they were not stingy with the seafood ...but it was too bland. My friend ordered the Sitting Duck Curry. The sauce was quite rich with a refreshing hint of lemongrass and made me green with envy. Another friend ordered the Coconut Red Sea Prawns, also rich but this time tangy as well. The prawns were large and many. Sense of injustice increased.For dessert we shared a tapioca and durian cake with coconut ice cream, sprinkled with peanut bits. The cake was pleasantly chewy and...errr, musty. But that's why one dines at Vietnamese restaurants, right? It would not have been complete without Vietnamese coffee. It was everything you've heard about Vietnamese coffee - RICH, creamy, even aromatic. It's served in a French press and on this occasion patience was well rewarded. Intense!Service was very good but handicapped that night because it was Friday. We had to ask for water at least 4 times. The pitcher finally arrived at the end with dessert. I will definitely return, especially to try the monkfish. Unfortunately, there is a minimum order of 2 and neither of my friends was as intrigued as I was. Anybody want to try the monkfish with me?",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "em-8Pfkvqx-eVOc_6x0TkQ"
  },
  "EZ6ljJ0LtSWsHOmfxX8bKw": {
    "date": "12/12/2011",
    "text": "We all gave out a laugh when we saw a little square on the side of the menu that said 'Recession proof meal'. That was a 2 course for £10 and why not so we went ahead and ordered that. From the appetisers, you get a choice of either the Grand Imperial spring roll, chilli squid or lotus stem salad.With the mains, you get to pick one from their main dishes and we all went with the vermicelli salad.At this price, you get a decent and tasty fare that you can't complain about.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sAVIGAjScXWJ9ViXeJZW6Q"
  },
  "HRosTqwS-EaSohLcp9Gzuw": {
    "date": "3/14/2011",
    "text": "I was running some Sunday afternoon errands and, because I was a short walk from Kingsland Road, I decided pho was going to be dinner.  My husband and I chose Viet Grill because it had more than one pho option and he felt like trying something slightly different.  People have already commented on the space, so I'll leave you with their descriptions.  We were flanked by a hipster couple to our left and two very bitter hipster girls to our right.  One of the girls ordered her veg & tofu soup with no tofu and kept telling the waiter very slowly that she didn't like tofu.  \"Nnnnoooo ttoooofffuuuu.\"  I'm surprised he didn't slap her.  I definitely wanted to.  Speaking of waiters, the service was amazing, but that probably had to do with the fact that we were having an early dinner on a Sunday which meant there were eight servers and only six customers. The menu looked interesting, but I have a one track mind when I'm somewhere that serves pho.  Start me off with some summer rolls then give me the rare beef option and set me up with the required sauces and I'll remain quiet until all of the broth has been slurped.  The summer rolls were some of the best I've had on the pho mile.  There were at least three prawns crammed inside and each bite had the fresh minty taste I love so much.  Like many others, I found the pho a bit bland and I always get a bit prickly when I'm served a lemon with my soup instead of a lime.  I understand they are both citrus fruits, but come on.  The husband had the Bun Bo Hue, which the menu described as \"Pho of Hue, the imperial city. Lemongrass, whole chillies, round noodle served with either beef, chicken, king prawns or special crab cake.\"  What they left out is, \"and a whole lotta fish sauce\" because that was the predominant flavour in the bowl.  All in all, it wasn't a total letdown like Hanoi Cafe, but if I'm going to Kingsland Road for pho I'll probably stick with Song Que so the husband can enjoy some tripe.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "FyflFkuXf0AifcBB5UEmWg": {
    "date": "8/5/2012",
    "text": "Food, delicious vietnamese food!We sat at the bar which was a little quieter than the tables, and nibbled on the delicious dried Jack fruit. Cocktails were nice, food delicious. We had tasty squid, delicious beef vinh, refreshing prawn summer rolls and creamy fried aubergines on rice.Ice cream was slightly dissapointing though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsXZSZ-Zxqo2HIdvh7b4hw"
  },
  "usJTlmNZzrtnZaBDoZxFFw": {
    "date": "10/3/2010",
    "text": "Being from Little Saigon in California can be a curse when trying out Vietnamese restaurants in London. Viet Grill looked too fancy to be good at first glance. They have tastefully dark wood decor, a bar on the ground level and another bar at the lower ground level. Everything looked too good and too neat to be authentic but I was so so wrong. First, their lotus stem salad is fantastic. The \"nuoc mam\" was perfectly flavoured and everything went well together. Second, their \"imperial spring rolls\" are possibly one of the best egg roll/spring roll I've eaten on both sides of the Atlantic. I've only tried their \"bun\" dishes and, frankly, their \"nuoc mam\" is good so just about every dish came out perfect. The prices are good also. A large bowl of pho for £5 if you get there before 5pm, and £7 anytime afterwards. I went back with a friend. This time we ordered the grilled lemongrass mackerel. A must try, it's fabulous! We also had the banh xeo (good but not spectacular) and the ca kho to (pretty close to Mom's home-made dish). If you're looking for good, quality Vietnamese food in London, this is the place to go.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jQEmuUvnfqAlU_Jg0m_SMA"
  },
  "UCSQeFfQPsVXW0bTQrQgvQ": {
    "date": "12/3/2008",
    "text": "Kingsland Road is the place for Vietnamese lovers what Bircklane is to curry fanatics. If you wander down Kingsland Road as a Vietnamese virgin, I recommend to go to the Viet Grill. This is how I started to explore the area. There I had my best beef soup ever and could not find it at any other Vietnamese place since. Vietnamese is well known for their noodle dishes which come with fresh vegetables and greens on the side.The scenery is a bit more grown up. The atmosphere is much more quiet, no drunken students but attentive staff. Unlike to the other Vietnamese restaurants where you can bring your own bottle of wine, they pride themselves with an extensive well-chosen wine list. You also pay a reasonable amount for it. Red wine goes very well with their food.At Viet Grill you will not be ushered out immediately after finishing your meal. The quality of service, staff and food is excellent. However, it will also reflect in the price, but it will not be over £30 per person - that is easily achieved in central London with less quality food.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "AubvODB8QSLbiags4fwjnQ",
        "caption": "Photo of Viet Grill - London, United Kingdom. Viet Grill in the dark",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AubvODB8QSLbiags4fwjnQ/o.jpg"
      }
    ],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "CmtwNvDiUsdhgaT6tQLNkw": {
    "date": "10/30/2010",
    "text": "Quick glance:+ value for money+ big portion, good for sharing+ good for groups+ takes American Express (as of October 2010)- booking recommendedI came here with a group of friends after a colleague's recommendation. I was surprised they took reservations, which turned out to be a good move because it was very popular and we saw a long queue of hungry diners as we tucked into our main course as the evening roll on.I was craving for a big bowl of pho but was tempted by a selection of other Vietnamese dishes instead. The five of us shared our starters and mains, which all came in generous portion sizes so, in retrospect, one dish between two is more than adequate. I recommend the Bò tùng xeo (Feudal Roasted Beef) to start -a large piece of marinated steak tenderly cooked. There is a large selection of starters, mains, and one-dish meal all with enticing descriptions which made choosing difficult, but consequently it is great for large group and have a few dishes for everyone to try. The tables are large so that it can accommodate a few dishes on the table and still leave enough space for you to have a bowl or plate before you to eat off of. Given the portion sizes and sharing concept, you get great value for money as each dish isn't eye-wateringly expensive.The nice surprise was that the venue accepts American Express as payment, which is unusual for most southeast Asian restaurants. The staff was pleasant - some had thicker accents than others but most were friendly enough.Overall, I recommend this place for good Vietnamese food to share with friends especially when you are looking for a filling and inexpensive meal. Booking is highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "FysTdcdPlluPShBiZt_MZg": {
    "date": "8/21/2011",
    "text": "Delicious food, fast service, yummy cocktails, nice decor. We picked this place at total random for a pre-hen night meal. It was exactly what we were looking for. Really just all around delicious. It was really busy on the Saturday night that we were there, but the service was amazingly quick and competent. It was quite noisy, but that absolutely worked for us, since we were in a fairly rambunctious mood ourselves. I would definitely recommend the Viet Grill.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PRFdJTg3E5N6xKpeBBgy0A"
  },
  "sz5vz9wcCLTsueUEqUdCFw": {
    "date": "12/12/2011",
    "text": "Pics@Chopstix2Steakniveschopstix2steaknives.blog…We all gave out a laugh when we saw a little square on the side of the menu that said 'Recession proof meal'. That was a 2 course for £10 and why not so we went ahead and ordered that. From the appetisers, you get a choice of either the Grand Imperial spring roll, chilli squid or lotus stem salad.With the mains, you get to pick one from their main dishes and we all went with the vermicelli salad.At this price, you get a decent and tasty fare that you can't complain about.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lLvYHoOl3U8b_oXeH1hYXQ": {
    "date": "7/13/2011",
    "text": "Had an awesome Friday night meal here, but the service could use a bit of a boost. -Feudal roast beef - Ridiculously tasty-Summer rolls - Light n fresh-Pillow Dumplings - Wrapped in seaweed and not very tasty-Saigon sate pho - Absolutely amazing. Perfect kick and nice n nutty-Bananas Flambe & Coconut ice cream - Very very yum! Only complaint would be that one of the people at our table has a peanut allergy so we specifically requested no peanuts for starters and his dish, yet everything still came with peanuts and we had to send things back. Also, getting the bill was a 20 minute mission. But overall lovely dining!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dNwjr46I_ImeMgIR8ljqA"
  },
  "MP8akHFWhO38nej7t1KMmQ": {
    "date": "1/9/2013",
    "text": "After a long walk from street art site seeing around the merry ol' Shoreditch hood, we ended the expedition by having some Pho for lunch. Mind you it was drizzling all day and it was rather cold, a good remedy back home for such weather was a big ol' bowl of Pho Tai! I ordered the Pho classic and it definitely wasn't the same as the broth back at home, but I actually didn't mind it. The broth here was clear and tasted simplistic which with a richness in flavor. The only complaint I had was the vermicelli since it was soggy, but it wasn't enough to deter me from enjoying the broth.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c9jfg3BP2O9zQGOvLz-lhw"
  },
  "eNCVEZv9hUbZrzXBRZPTdw": {
    "date": "3/10/2010",
    "text": "Yes, 5 stars. I have tried several of the other Vietnamese restaurants on Kingsland Road and they don't compare at all in terms of food and atmosphere. Order the set dinner menu, you get to try a few of the starters and the salads are fresh and lovely! We went on a non-rainy Thursday night and so the neighbourhood was bustling and so was the restaurant. We had a short wait which was absolutely fine since the service was attentive and speedy. In terms of atmosphere it was so much nicer than the other spartan slop and serve restaurants on the street so maybe for slightly more you actually have an amazing night out!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CWi51DrVHskbowxoiroe7Q"
  },
  "FI2W7db3BqwgTKMoJJTYaw": {
    "date": "11/16/2017",
    "text": "Anyone that knows me know that I'm a SOUP ADDICT. Or you can call it SOUP ENTHUSIAST if you wanna be fancy. I've eaten in almost all Pho places where I live so I had to try Viet Grill while in London. It's fancier and nicer than typical Vietnamese restaurant.Pros:Great pho brothIt was VERY abundant with the meats (rare stake, flank, and I ordered extra tendon)Good service Cute place Cons: Small bowl (not as big as the usual pho)Pricier than a regular Vietnamese place but justified by the service and decorI think this place should have better reviews/more stars",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tw2dqqGQ0EL3dFcUu0Waxw",
        "caption": "Photo of Viet Grill - London, United Kingdom. Interior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Tw2dqqGQ0EL3dFcUu0Waxw/o.jpg"
      },
      {
        "img_id": "2Q6hdTT8LrdTx9OVFkt38w",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2Q6hdTT8LrdTx9OVFkt38w/o.jpg"
      },
      {
        "img_id": "ayfY-YDjPA0taLLTzW-e5w",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ayfY-YDjPA0taLLTzW-e5w/o.jpg"
      }
    ],
    "user_id": "HXBKypbEUHUySFEbvsRqeQ"
  },
  "KkYZBpmNMmtv9p0MN4NSoA": {
    "date": "4/30/2018",
    "text": "We were seated and were literally the only customers there. Waited 15 minutes while three girls who worked there at the bar chatted and sipped on tea. Tried to capture their attention with no luck and walked out. Confusing menu.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nbZ1BfnLz-oJHI-Mjn9JRg"
  },
  "OAEdhl_FQu4Z9C0kH1SX3w": {
    "date": "8/12/2015",
    "text": "Fantastic food, every single time! PandaPay ran a trial at Viet Grill last night & the entire table was very impressed, person's comment was: \"this food is actually authentic Vietnamese food! I feel like I'm back at home.\". Viet Grill is buzz, fun and energetic. The service was flawless and extremely friendly. I had the Classic Chicken Pho. The ingredient was fresh and full of flavour. Not so good for a serious business meeting though it is the perfect place for group of friends, dates and after work dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwyoesEO2egqrny-21DMwA"
  },
  "jSRuK4G9j6ZOGIEEJfUCBg": {
    "date": "4/26/2015",
    "text": "Overall I was a bit disappointed with Viet Grill.As others have said it's a great looking restaurant with plenty of room for groups. However, our group had dishes arrive at totally different times, and one had to be sent back because it was wrong meaning I had finished by the time she got here. Not impressive or nice when you're hungry and want to enjoy a meal together - always awkward as to whether to wait and let the food get hold, or be unsociable and eat separately. There was no real apology for this and nothing came off the bill.I ordered the monkfish noodle signature dish and made the fatal mistake of not squeezing the lemon over it. Once I did this, about 80% of the way through, the flavours all came together. Before that, it was pretty tasteless. The massive piggy aubergine side I got was also pretty bland.I would be interested to try some else of what is on offer here, as the menu is very appealing with a lot of interesting dishes (although I suspect if they narrowed it down they might improve in quality and service), but I won't rush back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iP9NCp6If6YnlOc2QeDqeQ"
  },
  "r-RwTPM-16jvlloT_zADfw": {
    "date": "4/12/2015",
    "text": "Another night of Vietnamese dinner, and I really liked it. Pho wasn't as authentic as Cafe East, but it was still neatly done. The summer rolls were more fresh, I felt, and better presented. We also ordered the beef with wraps and kimchi where you can grill your own meet (like Korean bbq) and make into summer rolls of sort. I thought this was a really creative and solidly executed idea -- I loved every bit of it. Ambience was semi-western bar and semi-Vietnamese. I quite enjoyed it as very few Vietnamese places I had been to had this type of posh ambience. Service was okay, though a bit disorganised. It got busy, so we had to remind them to top up our water a few times before it was done. Still, it could have been worse, and I'm not complaining. Try to come at a less busy time if you can.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "DWnmx3wV7VAfbGzEm_22RQ": {
    "date": "7/6/2016",
    "text": "Had a wonderful meal here.  The place was seriously buzzing when we arrived.  Each dish was excellent,  could hardly fault one, and several reached lofty heights.  Service was excellent.  Brisk, efficient and most affable.  Recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HdkX0fbHM0mL5J5YO0W2Ig",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HdkX0fbHM0mL5J5YO0W2Ig/o.jpg"
      },
      {
        "img_id": "tyiBKiCpaFBjqpEAAY78yQ",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tyiBKiCpaFBjqpEAAY78yQ/o.jpg"
      },
      {
        "img_id": "JMKH_sX5NxqVdRQFa5JOuQ",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JMKH_sX5NxqVdRQFa5JOuQ/o.jpg"
      }
    ],
    "user_id": "k6yHivLHlkhkbjWhx3h29Q"
  },
  "a6DqwsI5D9NI5xbMCOtPpg": {
    "date": "7/24/2012",
    "text": "Fast, friendly, and efficient with generous portions of fresh and tasty food. Although nothing like Vietnamese food in California, this is the closest thing to it I have found in London. The spring rolls were interesting as they did not have a traditional wrapper but were similar to like a rice cracker wrapper which gave it a really nice crunch. The bun bo hue was good but lacked the traditional bun bo hue veggies. Instead it came with the veggies they give you for pho. The broth was rich, flavorful, and spicy!All in all it was a good meal and we will be back.Pork and Mushroom Crispy Vietnamese Spring Rolls BBQ Pork Loin with Rice Vermicelli Bún Ch Hà ni grilled lemongrass marinated pork tenderloin & crispy pork spring rollsBun Bo Hue Bún Bò Hu  The spicy version of Pho from Hue, the old imperial city. Flavoured with lemongrass, whole chilies, served with Beef and Pork Hock",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zRqfclf2OJWbbSqycc7jsA",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zRqfclf2OJWbbSqycc7jsA/o.jpg"
      },
      {
        "img_id": "plGDg5pJzbsDUEbwggaGwA",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/plGDg5pJzbsDUEbwggaGwA/o.jpg"
      },
      {
        "img_id": "cZuHPwPgJMt8T1nz2nkgSA",
        "caption": "Photo of Viet Grill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cZuHPwPgJMt8T1nz2nkgSA/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "69zQDbZ7hWpnRe3MFicCuA": {
    "date": "8/25/2015",
    "text": "We popped in here on a Friday evening around 6:45pm, just before it got rather busy. We were seated right away and had several different servers, all nice, but one of whom was particularly personable -- so that was nice.I ordered Saigon Saté Pho at £11 (hanger steak poached in a robust chilli broth, Thai basil & smashed nuts) and my girlfriend, the Saigon Pho at £10.5 with steak, brisket, fatty flank, and skirt flank in a beef broth. I was pretty excited about having some spicy pho (I'm not happy unless my nose is running), and the waiter warned me multiple times that \"it's very spicy\" and we joked about how I can take it and he seemed dubious.Look, it totally wasn't spicy. Not even remotely close to anything called spicy. I laugh in the face of their spicy. Also, it wasn't topped with smashed nuts, the broth itself seemed to be more of a peanut broth, which I wasn't really that into, so my girlfriend and I swapped pho. I liked mine alright, it just wasn't what I was after and she seemed more into it than I, so it all worked out. I also added a metric ton of Sriracha to her pho after the switch.It was around  £40 once we added in the Banh Xeo starter (vietnamese pancake with prawn and chicken) and a couple fancy sodas. The atmosphere was nice and the service decent, so I'd go again, but I think there are better pho spots in town.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eH5cPO1SV9hTVktzenjYgw"
  },
  "SXCZUn1FYS12Dx7-omNgVQ": {
    "date": "2/26/2014",
    "text": "There at lots of Vietnamese restaurants on Kingsland Road, and I am in no doubt (after having eaten in all of them several times) that the Viet Grill is the best. I mostly go there at lunch time and their special lunch menu is excellent value. I normally go for the two courses for £10 deal, and have sampled most of the combinations.Strangely, the one thing I don't totally rate Viet Grill for is the Pho.  I sometimes find the meat has too much stringy fat and the stock is better in places like Song Que.  My favourite dishes are probably the grilled piggy aubergine, the BBQ pork with vermicelli, the saigon stewed pork and the various curries (esp the soft shall crab).Services can be a little sketchy at times, but this is the same with many of the other restaurants in the area.Viet Grill is owned by The Vietnamese Kitchen, who also own Cay Tre on Old Street, which is almost as good but lacks some of the atmosphere, and Keu! on Old Street, which serves excellent Banh Mi.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h76LlzDkYI80cC54PkVPmQ",
        "caption": "Photo of Viet Grill - London, United Kingdom. Bun sa with beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h76LlzDkYI80cC54PkVPmQ/o.jpg"
      }
    ],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "yAEUvHvGkZ_swc-Y9TTKYw": {
    "date": "4/25/2015",
    "text": "I ordered the chicken pho and got mediocre chicken soup. Broth was bad but the management took it off the bill which pleased me very much.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "5qe-fnVRwj0P8GvtcwrNKg": {
    "date": "11/5/2016",
    "text": "Had a disappointing meal here. The service was very very slow. The starters were great but the mains not so much. More of a flashy cocktail place then a genuine Vietnamese spot.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raJuDUTiUsR8K0b1UDMVUg"
  },
  "SA9ktoa-eYMuHYBxfYTuTg": {
    "date": "5/15/2015",
    "text": "As of March 2015 visit:Pros:Saw Robert Pattinson and FKA Twigs arrive under cloak and hat to get a table.Went about 9pm. No queue and good friendly service.Great ambience.Cons:The ultimate Pho. I didn't think much of the meat at all. Not very tender which was really disappointing. The broth was good which I'd expect but not fatty enough If I'm being super critical.Since the refurb I'm not sure if they've changed staff but based on this latest visit I'd come back only to have my usual starters and other mains. Shame as on previous visits I've loved it. Pho for me is a tough thing to get right on all accounts.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "Om1EwLQcCyrrpqOT9hxbYA": {
    "date": "3/22/2013",
    "text": "Staff on the door were difficult even though I had rung fifteen minutes earlier. I had two starters, a crab roll, and a soft shell crab, both were let down by less than fresh oil in the fryer. Shame.Went for the spicier pho as main, and it was fine, fresh vegetables and herbs, the pho itself was a little insipid, relying on chilli oil for the heat, a little disappointing.Staff brought two wrong orders to my table, it might be very trendy, but it is a case of style over substance.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QAZLZfj-FfkuhypKYUOW2g"
  },
  "VEloTjFQD2nOO_kWN-BBmA": {
    "date": "1/30/2015",
    "text": "Out of all the Vietnamese spots on Kingsland Road, Viet Grill is my number one (at the moment anyways). The broth in their beef pho is perfectly full flavoured, and their spicy crab curry always leaves me wanting more. And let me tell you about their summer rolls - best summer rolls I've ever had. And I've had a ton. The restaurant itself also has more of an ambiance than the others on this stretch, with a bit of mood lighting and leafy wallpaper. Viet Grill isn't BYO, however their punches to share definitely make up for it - especially the one listed on the menu as having \"a lot of alcohol\". And it's taste is certainly superior to that bottle of wine you would find at the offie down the road - am I right?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YgGitxw83IQLfrI-CwIaw"
  },
  "LVZHa_zsXCG8YfLbFm-68A": {
    "date": "5/5/2015",
    "text": "There are lots of Vietnamese restaurants to choose from on Kingsland Road but I really like Viet Grill. I like the restaurant decor, it's really colourful and usually always busy so there's a good atmosphere. I've often been able to bring my own bottle of wine as well. The starters are really tasty, especially the summer rolls and although I've had better Pho it's still authentic, full flavoured and filling. It's defintiely one of the better Vietnamese restaurants in London. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YWwWLHjdS69wTKobZHVTzw"
  },
  "22vUXj0Z9EWsAADJzZV80A": {
    "date": "5/24/2014",
    "text": "Summary: +Great food +Nice and modern ambience +Best among other competitors in the area +Shrimp summer roll: Fresh+Beef pho: YummyOverall:I paid a visit to one of my favourite establishments in East London. Viet Grill is an unassuming gem of Vietnamese restaurant on Hackney Street. Surrounded by five or so other Vietnamese restaurants on the same side of the street, Viet Grill stands out in both food and ambience. I went in at 11:30 for an early lunch before a meeting in that area of London to catch them just opening the restaurant. I was shown into a window seat in the well-lit roomy dining space that is decorated with modern wooden floor. From a quick glance, this place could be easily mistaken to a nice French café apart from the large paintings of bamboo in warm pastel colours that decorates the walls and lively discussions in what sounds like Vietnamese from the kitchen. The staffs were all amiable and helpful. Since it was my first Vietnamese meal in a long time, I decided to go with the classics. Beef pho for the main and prawn summer rolls as a side. The waitress pointed out that those dishes happen to be included in the lunch combo, so I could have them for only £10. Nice. The service was very quick. The summer rolls were served within five minutes. In another 5 minutes or so, I had my bowl of pho noodle. This suggests they had a stack of summer rolls ready before the busy lunchtime war. They clearly know what they are doing. I like that. Food:The summer roll was packed with fresh salad, rice vermicelli and thin slices of shrimps all wrapped tightly in a soft rice paper. As I bite into one of the rolls, the flavour of mint and coriander filled my mouth. I liked the way they sliced the shrimps into smaller pieces so they don't make big lumps inside the wrap. The peanut sauce on the side has a typical South East Asian mix of rich sweetness and spiciness. The beef pho was a true delight.  The beef-based broth was rich and yet not too fatty. The sweetness from roasted onion and subtle flavour of coriander adds another dimension to the taste of broth. As in any Vietnamese restaurant, the pho was served with a set of herbs that enhances the taste of broth. There are variations to this flavour booster kit but it usually consists of thai basil, bean sprouts, a slice of lemon or lime and sometimes chopped red chilli peppers. I like to have first couple of sips without the boosters and appreciate the richness of naked broth. As usual, I threw in the herbs and lemon juice half way into the meal. The change in the broth is both pleasant and dramatic. The once sweet broth now has edgy sourness and bitterness to it. I always find the flat rice noodle hard to eat without making a mess. But I think it's more about my clumsy chopstick skills than the dish itself.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "64D3nLEEEyoSTkUBQu-1EA",
        "caption": "Photo of Viet Grill - London, United Kingdom. Restaurant",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/64D3nLEEEyoSTkUBQu-1EA/o.jpg"
      },
      {
        "img_id": "9hjrFQNf7F8RelvnR7PNug",
        "caption": "Photo of Viet Grill - London, United Kingdom. beef pho closeup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9hjrFQNf7F8RelvnR7PNug/o.jpg"
      },
      {
        "img_id": "00le8ZHgbValqq_395wT5g",
        "caption": "Photo of Viet Grill - London, United Kingdom. Beef pho",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/00le8ZHgbValqq_395wT5g/o.jpg"
      }
    ],
    "user_id": "kBcnyWp2LIv2q0Q8WkFkJA"
  },
  "tESDbrfIdfHt5io1580Vww": {
    "date": "12/5/2011",
    "text": "I quite like Viet Grill... the food was pretty decent (at least better than some of the previous reviews seem to think)Here's my food ratings in order of how much I thought Mmmmmm:**** Cognac 'luc lac' beef (at least I think that's what it was called!!) was succulent and gorgeous**** The grilled beef was delish'. They cook it at your table (so you can choose how rare you'd like it) then you add daikon, noodles, salad herbs and kimchi before wrapping it in rice paper.**** Crab nem rolls were really nice too... mushroom crabby goodness.*** The catfish was okay...it was a little gelatinous at the edges, but yummy in the middle*** Goi con: The same as anywhere really...** Pho: Not bad...but I've had better at Cafe EastSooo...It was good, but not amazing (once you count the fact that it can be hard to flag down a waitress.)",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "TtWAmdfclnjeGrLAeL2TkA": {
    "date": "12/8/2013",
    "text": "Well this was a case of hunger and an exciting vegan noodle soup won out over going up the road to the well reviewed Vietnamese restaurants I made a list of from Yelp. NEVER AGAIN.We didn't have staff problems like others (although they forgot our drinks and one side dish never even turned up).While grateful for a couple of interesting  veggie options, everything was just kind of flavourless. The soup was barebones, no fresh herbs or veggies to mix in. Just noodles and tofu in a spicy broth that had no sort if umami flavour. Even our spring rolls were blah. How can fried food not be delicious? I don't know, my friends.Sorry Viet Grill.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "e9_flvOItqXH0z9nPGR3hA": {
    "date": "6/12/2011",
    "text": "My friends and I used to come here all the time, and so I thought it was worth a re-visit on my trip. I usually order the chicken royale, which has well-cooked, tender, and juicy chicken. This time though I went with the pork belly, and it was delicious. The meat tasted good, and the fat just melts in your mouth. Having a plate all to yourself can get a bit much, although two friends and I all managed a plate each in the end. I also got the choy greens dish, cooked with garlic, and it was crunchy and flavorful.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LvUBYDh1C7bQOeDYIMPZ-g",
        "caption": "Photo of Viet Grill - London, United Kingdom. pork belly",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LvUBYDh1C7bQOeDYIMPZ-g/o.jpg"
      }
    ],
    "user_id": "nQjgUGEBOu-jsCQlp43WGA"
  },
  "kL488gyLhIJJbZjngmSW0g": {
    "date": "4/24/2015",
    "text": "for appetiser we tried spring rolls it was fresh and beautiful looking! and for main dish we tried mekong fish in claypot ( i think this is their popular dish) and pork with aubergine , both are very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RZB-ZikWwq4faEFggsH4DA",
        "caption": "Photo of Viet Grill - London, United Kingdom. top: mekong fish in claypot bottom: pork and aubergine",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RZB-ZikWwq4faEFggsH4DA/o.jpg"
      }
    ],
    "user_id": "jfzqKKkVmKWXL1MquTa6dQ"
  }
}