{
  "8ZPCS0gs3Phrzc-GE53IEw": {
    "date": "1/16/2015",
    "text": "What a small pub but a great atmosphere. Lovely staff and brilliant music. Would certainly recommend it and if you love guinness its the pub to be in.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X45rUKFO1i5_Y7YaNSWc9A"
  },
  "d5Rak7qkKQydfwBbhBtewA": {
    "date": "2/18/2012",
    "text": "Very small, cramped, bit of a dive, but a great place to have a few pints of Guinness - like being in some hole-in-the-wall dank cellar-type Edgar Allan Poe may have based a murder on someone in here sort of place if it was in MacDougal Alley in New York.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8eQ7LmOK6KeSRXq_o8KaAw"
  },
  "auxkvrVBs9bNFn4jLuQzkA": {
    "date": "2/14/2009",
    "text": "The Toucan is the metaphysical bricks and mortar extension to a pint of Guinness. The pub itself is dark, thick and aromatic from the basement up to the bubbly beige sky above Soho Square. Inside it's typically viscous with people ebbing and flowing like the micro-currents in Ireland's famous stout, and there's more than just a little of Dublin packed in.As with a good Guinness, the Toucan refreshes best on a warm summer day, where the black stuff froths over the top and spills out onto the sun-baked pavements nearby. You'll find me here in the spills, evaporating my beverages through my solar-powered thirst.(you'd barely know it, but they do Magners and a few other drinks too)",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "t4RWtNepjjiX101z1wisfw": {
    "date": "8/5/2010",
    "text": "Great Guinness, as everyone else has rightly pointed out. You will pay through the nose for the pleasure of drinking the best pint of it available in London though. If that's what flicks your switch, then dive in and enjoy. Downstairs in the winter is great, no windows, and a real sense of escape from the real world upstairs at street level. The food is stuff from a cardboard box, warmed up in a microwave, and some of the staff aren't interested in giving you the time of day if Suggs in in the bar, I guess the £4+ he pays for his pint is better than mine. Still a great pub, just a shame about the price.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XWoh7dugBCpThFeggC-OPQ"
  },
  "OYe3-jWFZknXXbdNnFQYxw": {
    "date": "1/8/2009",
    "text": "My all time favorite pub in London. My first time here was in 1998. I was on my first trip to England and my London Irish pal said this place had the best Guinness and that we had to go there. He was right! Since '98 every time I've gone back I take other people and they are blown away! When I lived in London in '01 it was my meeting spot as I worked in Soho Square at the FA. I miss you tiny Toucan! Nothing in Chicago compares to your warm, welcoming space and friendly people.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Zugsx2_hjeDzbgwUTsvSlg"
  },
  "J6Q-mf4Z59ApVcO4o3ZcUg": {
    "date": "9/4/2012",
    "text": "This was by far my favorite pub during my recent trip to London. Guinness in the US is kinda gross when compared to the real stuff overseas - and their Guinness was as good as anything I've had in Dublin. Most of its patrons drink outside which leaves a pretty empty pub inside to take a seat and enjoy all of the Guinness decor. My wife and I spent nearly every night of our recent trip here and I miss it already. If I ever travel to London again, The Toucan will be my first stop.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "EfPp4l-3ptONCS3YLysZ4w"
  },
  "fI-9G2wqEcg6MzT63pwVGg": {
    "date": "12/3/2008",
    "text": "Whenever my Irish parents come to London we have to ensure my dad gets at least one pint of the black stuff at this tiny but great little pub.Quite dark inside, the small venue has great appeal and is always popular.  There is a downstairs area with food available though best to either sit at the upstairs bar and chat to the friendly barman or, if the weathers good, get your drink in a plastic glass and take it onto the street or into Soho Square.Expect lots of cute Irish guys and lots of good banter; great place that's really recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVsgs70SwiOVR6jjhVLHXw"
  },
  "0ybH4u6dHtq6-qo7RTf0DQ": {
    "date": "8/18/2011",
    "text": "Cosy little place with great Guinness. It's a great place for the craic. Toilet leaves a lot to be desired though.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OzL9jjZYKpTOakUGXeUAvw": {
    "date": "4/11/2008",
    "text": "Having already reviewed the nearby Nellie Dean, it seemed only fair to give the Toucan a little airplay. Like the Nellie, the Toucan is tiny. If you were flat-hunting and walked into the Toucan with the words and here's the living room echoing in your ears, you and yours would exeunt flat stage centre, pausing only to hoof the teenage letting agent in the gonads. Barely room to swing a hamster. And, much like the Nellie, the Toucan's a summer boozer. If you're lucky enough to wander in and find a stool to perch yourself on, fine, but it's busiest in the warm weather when the patrons can all spill out onto Carlisle Street and the neighbouring Soho Square. It's very much an Irish pub: good draught Guinness, Harp on tap if that's your thing, and - last time I was there - plenty of lunches based around stew and colcannon. You know the sort of thing. Nice pub for summer. A bit sardine-tin for the rest of the year.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Iams0oKHep7pr5HSjL_BCQ": {
    "date": "8/17/2008",
    "text": "The Toucan is a little Soho legend. Just off Soho Square, this very small pub is spread across two floors (ground and basement) and erthe street outside. It's not the smoking ban that has driven the drinkers of the Toucan out onto the street - its the fact that it seats about 40 and yet any night from Wednesday onwards it usually has about 200 people trying to get a drink. But don't let that put you off - it's a great place for a very good pint of guiness and has a very nice relaxed atmosphere to it. As has already been written - its probably at its best on a quiet afternoon or early week night when you can just sit and enjoy the atmosphere of the place, but its good fun at any time. Price is pretty much your usual Soho. The food when I've had it has been fine both taste and price - pretty simple stuff though. The toilets are not the bestbut the decor and the fact that this is a real irish pub not a theme one make up for the little issues.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-ClHw59vA4zMvgL2529eJw": {
    "date": "11/22/2008",
    "text": "Charming Irish pub that's a million miles better than the plastic paddy Irish chains such as O'Neill's. Its walls are adorned with a lot of old Guinness ads and other Irish paraphernalia. The upstairs is quite small but there is a larger seating area downstairs.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FzYVv5C7gCukk_-djBRZWw": {
    "date": "2/18/2009",
    "text": "Guinness afficionados will know that for the last few years, all the Guinness you buy is brewed in Dublin. They're very careful to say in Dublin, since St James's Gate, the current brewery for Guinness, is about to be closed down and used for housing or shopping or something, and the brewing of the black stuff will be taken to a big purpose-built metal shed somewhere in the outskirts. However, because The Toucan gets through so much of the stuff, it's always very fresh. And herein lies the secret why Guinness from The Toucan tastes better than any other Guinness you'll ever drink anywhere else in London. The pub's tiny. So you'll probably end up either perched next to the casks of Guinness which are piled up in the pub itself (see what I mean about then going through loads); or you'll be outside, drinking the black stuff* from a plastic glass which'll be freezing your hand off. I didn't know it did food before reading the other reviews. It does sell Irish crisps, though - the Tayto brand, which, fact fans, were the first crisps ever to work out how to flavour their crisps in more than one flavour. I've been many times, but only once have managed to sit inside. Most of the time it's full. Which is because it's very good at pouring Guinness. I'd recommend it. If you like Guinness. If you don't - I'd go somewhere else, in all honesty. It's actually dark brown. Hold it up to the light.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ps4HFgI5HwTJCoAM-SBgiQ": {
    "date": "8/16/2008",
    "text": "You will not be suprised to know that the Toucan serves a rather good pint of Guiness, the famous Irish drink has its regalia all over the place. In many ways the Guiness would have a lot to live up to with so much expectation, luckily there are no problems. the Toucan is not a place enjoyed at busy hours, rush hour and weekends tend to simply lead the masses on to the streets near Soho square. The beauty of the Toucan is its intimacy and there are few better places to have a drink alone or with AN Other during the day or on a quiet tuesday evening. The Toucan may well be a bit shabby, the toilets vile, occasionally some silly tourists come in order cokes, wine and half a Guiness for the Dad to stare at and take pictures. The ancient stereo invariably spends a good few hours skipping about before anyone realises and a few potty mouthed celebrities often prop up the bar. None of this should detract from a very charming little place, very small but with a heart as wide as the Thames. One of very few oasis in Soho.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NaU8a0NoTgVLrWqAkfuseg": {
    "date": "3/12/2009",
    "text": "Yup - the best pint of Guinness in London!  Atmosphere is great - caught the 1st half of the Liverpool match, but wasnt surrounded be meatheads shouting at every play.  Stellar whiskey selection and the bartender was happy to chat and recommend some ones I've never heard of.  Played good tunes too.Would have gotten 5 stars if they had a few more actual tables rather than the lower, coffee table style ones we sat at.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "cr47nQjVnXRfyTR4IQLgFw"
  },
  "1mnpQYehnIYDu25KtDYi4A": {
    "date": "3/11/2009",
    "text": "I've had a few Guiness pints around London, and I do agree that the Toucan serves up the best in town.  Stopped into this intimate pub for a few pints and a taste of some class Irish Whiskey.  Friendly atmosphere with a tv downstairs to watch the football match.  Great selection of Whiskeys and solid choice of music by the bartender. Will definitely be returning to the Toucan.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "003VskSkYJAF3ytFJ6rH-A"
  },
  "SCsYSgjrIjOBSdYdA0Pqgw": {
    "date": "3/28/2011",
    "text": "Great pint but I felt I was intruding regulars' private party.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NZq2oNB9aqKpd69GdsXYdA"
  },
  "rXKe-KkjEIxddsAux_2X7w": {
    "date": "12/8/2008",
    "text": "I have only ever been here on sunny summer days, which probably explains why I am a fan. It is always entertaining to see people leaning up against the expensive looking cars parked outside the pub, then jumping out of the way as irate owners come back to rescue their vehicles. My Irish friend informs me that this place does the best Guinness outside of Ireland, which I am inclined to believe since I don't really drink the stuff. Though I am not usually a fan of Soho, I will make an exception for the Toucan.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KqezDS1a_tyB7VKzKdIJSQ"
  },
  "--b2q88nmkq6Pd6WyrH9gQ": {
    "date": "1/28/2009",
    "text": "As soon as my friend said this place served the best pint of guiness in London I had to put his word to the test so 1 phone call and a tube ride later we were cramped up at the bar (which oddly added to the atmosphere rather than annoyed me) awaiting two pints of the black stuff. I haven't tasted all the guiness in londn but i would be very surprised if there is better around. Its as close as you'll get to the proper irish stuff.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3OneCKAau3ypPFy3N834yg": {
    "date": "5/26/2009",
    "text": "The Toucan is a nice friendly pub that has a good selection of food and drinks.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "iT1sxFYRDdcsVW_OUh8bfw": {
    "date": "9/29/2015",
    "text": "This place is as authentic as it gets. Easily the best Guinness I've had in London, and one of the best pints of beer I've had in my life. The pub is very tiny, and is lined with hundreds of Guinness posters and Irish decorations. They have the standard Guinness branded pint glasses, but for the first time that I've seen they even had the similar Guinness branded half-pint glasses.The sign caught my eye when I walked past, it read \"Great Guinness, Good Food,\" capturing a funny attitude that their beer is incredible but the food is just decent.It is busy even on weeknights, but the attentive bar staff was friendly and fast. They were also laid back and took frequent smoke breaks leaving a casually unmanned bar. They accepted card with no minimum, and a pint of Guinness was £4.80. That's a bit more than the average pint here, but once you try it you'll understand the difference is absolutely worth it, plus it is still 25% cheaper than an average Guinness back home in NYC (which comparatively tastes terrible)!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "w-4M-5qSC2-f94F0rtBdKQ",
        "caption": "Photo of The Toucan - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w-4M-5qSC2-f94F0rtBdKQ/o.jpg"
      },
      {
        "img_id": "K8tbzID45OUlH1sLQXH3Ug",
        "caption": "Photo of The Toucan - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/K8tbzID45OUlH1sLQXH3Ug/o.jpg"
      },
      {
        "img_id": "IcwiWcFx0jZTJWPN15Mzwg",
        "caption": "Photo of The Toucan - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IcwiWcFx0jZTJWPN15Mzwg/o.jpg"
      }
    ],
    "user_id": "HlvolKtO9f29ViF1n5-T8A"
  },
  "1OSNYYRHJzzsK_TEtYSBRg": {
    "date": "12/4/2016",
    "text": "The Guinness Bar. Irish vibe pub with Guinness classic, extra cold and the new 13 all on drafts at decent prices. Feels a bit overrun and all but still friendly and good place for a quick beer in the area. This place as a good vibe and i sometimes bring friends there to get a drink. I like also that it is close to lots of other good places and busy streets. For beer go for the Project 13, it is the new blond guiness and it is quite good. I am always getting itwhen I can. Guiness extra cold is also a very good beer if into this kind of beer. Only problem is that it goes down too easily ;-) cheers",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqTSNQ1fPtfq1vAgFdZJGg"
  },
  "uQtZkGjkXkWJsH66ADK-4A": {
    "date": "12/14/2017",
    "text": "This is exactly what I was looking for - a place to grab a great pint and was wowed by the bonus of an amazing bowl of Irish stew. This will be my local when in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SN2glLO9xcP-TQuGMd1mdA"
  },
  "tubd6ex24lsnGPhW5Mflnw": {
    "date": "7/31/2017",
    "text": "An authentic, fine pub to frequent after work.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ljYFgyaSseOnw8I7ayNUNw"
  },
  "IWX8hCEUliLjxWtyQZi9FQ": {
    "date": "6/14/2015",
    "text": "Decided to stop by here with my guy as we strolled along the road. We didn't interact much with the patrons or bartenders. An order was placed for two Guinness beers. There's a lovely display of parrots on the ceiling. If you're too busy looking out the door or somewhere else.. you might miss the display.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1YGxxo3SZZGxDNGuIyh-NQ",
        "caption": "Photo of The Toucan - London, United Kingdom. The interior ceiling",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1YGxxo3SZZGxDNGuIyh-NQ/o.jpg"
      },
      {
        "img_id": "ImPbgLa7LElzjygp1CH9cQ",
        "caption": "Photo of The Toucan - London, United Kingdom. The establishment",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ImPbgLa7LElzjygp1CH9cQ/o.jpg"
      },
      {
        "img_id": "Z8YsmPud3qVPX8lhplQIQA",
        "caption": "Photo of The Toucan - London, United Kingdom. Our Guinness beers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z8YsmPud3qVPX8lhplQIQA/o.jpg"
      }
    ],
    "user_id": "6fk6v5PFmR1YEzY0ZP6Z3A"
  },
  "5NVO9-DSl9o8jxEdaKkx4g": {
    "date": "3/3/2015",
    "text": "3/1/15I was there in Feb of 1995 with Kenny Costello, JoAnne, her sister, and a rowdy bunch of friends. Kevin was tending bar. Kenny and I were the Americans. In the pic, I'm on the right and Kenny is the laughing man just to the lower left. I think we fit in well. Best pints, not just in London, but in most everywhere. Kenny has passed on, but I'm still here to yelp about that 20-year old night of fun.Stay toasty,PK, NYC, USA",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "mceNI_QQfzr-WZqKfzEuyQ",
        "caption": "Photo of The Toucan - London, United Kingdom. 3/1/15  The best time of my life was photographed at the Toucan.  20 years ago. Hope I have more pints to go...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mceNI_QQfzr-WZqKfzEuyQ/o.jpg"
      }
    ],
    "user_id": "qx3GeQfjEfQ1vegw4LGSsQ"
  },
  "HLj43KRuwFDYYptmau9mwQ": {
    "date": "3/18/2016",
    "text": "Good pub for a Guinness which it is famed for. And they pour it right. Not much to look at though what I love is street drinking and you can like most London pubs stand outside with your pint which most do.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "sPXAvmC738-hnYOoseiKVw": {
    "date": "10/13/2012",
    "text": "5.0+++.  Indescribably awesome but I will give it my best shot.  The Toucan is the greatest dive bar I have ever had the privilege of visiting. Why?1) They add credibility to the claim that Guinness is a far superior product in Europe than it is in the States (hell, even the Guinness cocktails here are fantastic).  2) The owner Colin is the equivalent in knowledge about his crafts of choice (Guinness and Irish whiskey) as old man Jiro is about sushi.  Sitting at the bar and getting a free education is a stellar reason to visit this bar.  3) They have a hot redhead waitress albeit not from Ireland.  Staff turnover is obviously possible, but hey, it is a current positive.  4) The people that go here are fun, knowledgeable, and worldly.  Many of the girls that come in here are surprisingly photogenic despite the fact that this is an unapologetic dive bar.  All of the guys here were nice enough and weren't annoying at all.  Why do people like this not exist in the States?!?!5) The decor is immensely interesting.  I was particularly fond of all the open letters describing the fervor certain historically famous people have had for Guinness.I have pretty much given up completely on dive bars - or any bars for that matter - as a place to meet people in the entire United States.  This bar pretty much confirmed exactly what I already knew I was missing back home.  When a bar has the power to make you decide to write off an entire country's set of bars, it must be pretty damn good, right?  Right?!?!Thank you Toucan for teaching me that bars have the capacity not to suck.  This place should serve as the paragon to every other place that has the audacity to call itself a dive bar.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 7,
      "cool": 6
    },
    "photos": [],
    "user_id": "K7thO1n-vZ9PFYiC7nTR2w"
  },
  "VWknwZnS-AY4ztD-NPZVhA": {
    "date": "6/1/2012",
    "text": "I love divey establishments. This place manages to be divey without being creepy. The bathrooms aren't the best, but who goes to a pub for their toilets? If you're a Guinness drinker, there is no better spot. And it's nice to duck in here to get away from some of the annoying Soho crowds. I have fantasies about being invited to wild Soho basement parties with intelligent and hilarious people (in my mind, they're all smoking, though in reality that would make my eyes water and I'd have to go home early like a loser), and this place lets me pretend that I'm hip for, well, as long as it takes me to drink a few pints on that particular day.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "LiPb8poxuGRMRRJGDNxxAQ"
  },
  "JRiXRl2QweF406drg5u-fA": {
    "date": "1/28/2013",
    "text": "This place is tiny, but it was worth the trip. Ordered a pint of Guiness, although it is not my beer of choice, and was surprised how good it actually is. Maybe it is how they do it here, I am not sure, but it was easy drinking. A few locals on a Monday night, everyone talking about movies and a few jokes made it even better. Yay! I'm a fan.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0AyZxS5C--WySnbW_Q8yQ"
  },
  "MKLbpa1LBzg0QMGUxnLzYw": {
    "date": "8/16/2011",
    "text": "I loved this place  esp with matesin the cosy bar downstairs in winter.This is where Jimi Hendrix played hisfirst London gig.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9M6ZLpMkx3CjI5EloYHbNA",
        "caption": "Photo of The Toucan - London, United Kingdom. .",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9M6ZLpMkx3CjI5EloYHbNA/o.jpg"
      }
    ],
    "user_id": "5yuHp8kydkGAu9WctLlCBQ"
  },
  "FAGiiQrkeZjRMMB3qgHnHw": {
    "date": "8/28/2014",
    "text": "Simply the best Guinness in town... plus the fact that Hendrix played there.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xMBFAVx8D71livzEgFnA7A"
  },
  "1hS_iMwuAjxJ6fXbJZabCQ": {
    "date": "11/20/2012",
    "text": "Not only the best Guinness I've ever had, the best pint of beer.I was never a fan of Guinness back in the states. Even living in London, at the everyday pubs. But the beer here is to die for. They have the Extra Cold as well, my preference (1 deg C lower temp). The kegs are obviously meticulously cared for in terms of temperature, exposure etc.You pay for this pleasure, though- 4.40/pint.Dinked them one star because of an occasional Irish locals-only vibe.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tu3CE4a-QVqBhO7fVXn1w"
  },
  "5Fcvw5iuCIE0Oz5QWCPmuQ": {
    "date": "11/17/2012",
    "text": "The first time I went was great all around, but I went with \"locals and I wasn't the one doing the ordering\" The second time I went service was shitty and also I was forbidden to take a photo inside the place. Made the experience kinda sour. I mean, it's not like there were any other people in it at the time (we went early before the crowds hit and pour out onto the street).... so yeah... The third time I went with friends the bartender made fun of me because I tipped him. He educated me that tipping is not customary in the UK unlike in America... he did thank me at least, so that's why I didn't ask for it back... but he could have just thanked me without making fun.Not sure there'll be a fourth time...Gets 3 stars because of the outstanding Guinness... and I am not even a beer drinker, but love the beer here! Also, the 3 stars represents the average of my previous 3 visits.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BLC7_VCzg2bchA6XD_BWNQ"
  },
  "gbfrim5C-cvKO0yqpcDFPQ": {
    "date": "4/9/2010",
    "text": "6 Guinness taps on the ground floor bar and another 6 downstairs.... There isn't a bar in Ireland that has this many Guinness taps and oh my but the Guinness is like midnight nectar..... Top spot, great music on the ipod/CDs behind the bar and the owner is happy to take requests. Prepare yourself for sing songs, random dancing sessions etc. Great atmosphere and probably the best pint of the black stuff in London.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VD4mPVTFWbnUexjxsjxAIA": {
    "date": "6/28/2014",
    "text": "Despite being super busy all time, this place always brings a smile to my face. The crowds spilling out onto the streets only adds to the vibe and of course one of the best pints of Guiness you can get in soho.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INVx3MKlgB_uMR4KmuYAgA"
  },
  "lqDcxFXws7m68765v4g01A": {
    "date": "12/20/2008",
    "text": "What an amazing place, I've heard of places that do a good Guinness, but this is really something else. Located in Soho, it really is a little piece of Ireland in London.There are about 6 Guinness taps and only a couple of taps reserved for other (obviously less important) beers. Usually it is the other way around, but not here. Even most places in Ireland aren't like that.The place is really dark and kind of feels like a cave. You could really forget about the outside world for a while if you wanted too stay there for a few hours.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6FQ5SxdVE9IaTYoWi7S58w",
        "caption": "Photo of The Toucan - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6FQ5SxdVE9IaTYoWi7S58w/o.jpg"
      }
    ],
    "user_id": "WXP9hhQKPItddmjB_5nTLQ"
  },
  "r6GQu4_YPdnX0RCJtEhFRA": {
    "date": "9/7/2013",
    "text": "If you were a hardcore Guiness-nerd, this would be the first check box on your bucket list.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqi3755IgHGt0uhrhkePmw"
  },
  "KkemYi-ltCRp0dJn7ZLrkA": {
    "date": "1/7/2012",
    "text": "Oh golly I just love this place. Sort of a dive-pub, crappy/excellent atmosphere, cheap guiness (expertly handled) and all sorts hanging around out front. If you're looking to woo a picky out of towner with a sam smith's style classical pub, stay away. If you're looking for a chilled out, cool, london-via-brooklyn evening, this is your starting place. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vh-z4u73KV3GhP1KOL36uA"
  },
  "9dw87GB1vb9UdazApLU8Kw": {
    "date": "7/2/2009",
    "text": "Imagine ..... soft, silky, black ........ gently and smoothly caressing your throat at each sip .... mmmmmm! Now get your mind out of the gutter! Im talking about the Guinness. The Toucan was my local for 5 years and we used to go most nights. The place is small! and the toilets leave something to be desired .. but then you take a sip of the heavenly black stuff and all those small points fade into oblivion.I still go when I can and it will always have a place in my heart!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 7,
      "cool": 8
    },
    "photos": [],
    "user_id": "5j0QmE-ktdY2wfEYX2YStA"
  }
}