{
  "Fxu5H56Pjk3NC6TpgH-SRg": {
    "date": "8/31/2009",
    "text": "Right in the heart of the busy Seven Dials area, Souk Medina is like a rabbit's warren, a haven of tranquillity amongst the mad shoppers. The seductive, incensed entrance does look creepy/inviting depending on your level of bravery but on sunny days, it's so nice to step out of the bright sunshine into the cool, dark interiorThe food is billed as north African but is a mixture of typical Mediterranean meze type dishes and coucous and tagines. The food is well seasoned and tasty.It is quite a hypnotic place with a lovely ambiance and candle light and you may not want to rejoin the hurly burly going on outside",
    "rating": 4.0,
    "rated": {
      "useful": 10,
      "funny": 3,
      "cool": 10
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "SNb3g9v4U9kTtdsyoJIMLQ": {
    "date": "1/3/2012",
    "text": "I'm not that familiar with African/Moroccan food and was very pleasantly surprised to see that I reallllllly enjoy it! We went here for New Years Eve and had their 3 course set menu and had a great time for several reasons:1) Great foodThe 3 course set menu started off with a glass of champagne quickly followed by appetizers for each of us, including (ignore my spelling) lamb kubeeh, chicken briouat, hummous, falafel zaalouk and yoghurt. Then we each selected a different main from the set menu. I ordered the lamb mechoui cous cous (I think it was lamb shoulder) which came with a chick pea sauce for the cous cous. I also got to sample my fellow guests' dishes: the stuffed chicken tagine with halloumi and baked seabass tagine. All delicious!!! We ended our meal with a selection of baklava (a bit too sweet for my taste but the others loved it) and a large espresso. 2) Great serviceThroughout dinner the manager of the restaurant stopped by to ask how our meal was going and we also had very attentive waiters. 3) AmbianceFrom walking through the big wooden doors, you're transported from the cobblestone streets of Covent Garden. The deep red and gold colors run throughout the restaurant, from the walkway from the door to the maitre d stand, and then through the bar area and into another room decorated with big cushions, large wooden tables and soft lighting throughout. It's perfect if you're looking for a different kind of night out. One small note: a couple of my guests were about 6ft tall so they found the chairs at the table a bit too low to be very comfortable but the other ladies and myself were quite cozy on the cushions.After watching the NYE fireworks and doing a bit of bar-hopping aroung Seven Dials, we came back to Souk Medina as the manager had invited us back for a bit of belly dancer entertainment but found that the restaurant was cleaning up. The staff still happily let us in, poured us all complimentary glasses of bubbly, and we all commenced to a short but energetic dance party. Random, yes, but a great way to end the night.Souk Medina showed us a great time and I'd happily return again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vkeDTW5XhrwFysmUnTuFA"
  },
  "vrSEu6X2aNsvIU1zdqkp8A": {
    "date": "2/1/2013",
    "text": "This place has a cool atmosphere, ok food and terrible service.Price wise the food is very reasonable if you use the taste card. Issues we (2 ppl) experienced whilst dining here on a Friday night:- sat very close to other diners when restaurant not full- very slow with drinks and took them to the wrong table twice- offered a takeaway container for leftover food then told this was not allowed on Friday (what a waste) we then saw other diners having their food put into takeaway containers- given wrong bill- correct bill did not have taste card discount- reluctant to apply discount- paid in notes and coins and told the waitress to be careful with the coins  she returned minutes later claiming we were £4 short. We protested. We then saw her picking up coins off the floor around the corner. As we were leaving we were approached by another waitress stating we still owed £2. We refused to pay and left. If they can't find it they can take it off the ridiculous service charge!! Saving grace here is the cool decor/atmosphere Don't expect much else",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "j52eDhbDVs-EQd8hJo5CAA": {
    "date": "8/30/2009",
    "text": "I'm intrigued by Souk Medina. I really wasn't expecting much from the narrow dark opening at the front, but it's unlike anywhere else I've been once inside. In a good way.It's all candle lights and relaxation, comfy chairs and soothing music. Belly dancers entertain as you sip on a cocktail (for £5.95 - not bad) or share a platter of delicious Moroccan cuisine.I've only been for drinks but I definitely want to go back to try their great-looking menu. It's quite an enchanting atmosphere and I like it!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "5vD1hK-oG4tKgnLKZCGRhw"
  },
  "HzNeujgnP5n4o2i-xJvBAw": {
    "date": "11/20/2010",
    "text": "Lovely deco and friendly staff but was a bit disappointed with the food. Just been there once but dont plan to go back.The food was just ok, and was expecting something much better for the price I paid.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbtoMV4A1bENkdu9mo9s2g"
  },
  "O_ieiqCUQXL89hfHaVUSeA": {
    "date": "2/28/2010",
    "text": "It looks like a hole in the wall, but that's just the entrance, the tip of the iceberg. Souk medina is this amazing secret little place with low light, low seats, wooden decorated tables and chairs, red and purple draperies, gold-embroidered pillows... The works!It's a little corner of an arabian tent come to life in the middle of London. The food is plentiful, possibly too much so. After the mezze (for two, shared by three) i barely had half of my couscous dish!Also, they honour the tastelondon card. Recommended!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "08wap-DlpBJQVTBr9Jzs1g": {
    "date": "2/11/2012",
    "text": "I had a nice vegetarian meal here, the place has a really nice atmosphere and looks fantastic inside. I liked the mint tea and baklava very much. I'm not sure if the belly dancing with painfully loud music is on every day but I made a rapid exit as soon as it started and would rather not have the floor show. I thought it was an interesting and atmospheric place to eat and I hope I can remember to give it another try in the future.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GPGuZZduZxfRL3BuBp-l5g": {
    "date": "6/2/2011",
    "text": "Yes! whoohoo! I felt like I was in Morroco, the food was unreal, the chicken is probably the best I've ever eaten, the baklava and mint tea that come at the end of your meal, the amazing decor, the personal service.....but best of all....was the belly dancer....who got me up to dance with her! she was beautiful and amazing at it! I was so flabbergasted! 'Twas a total experience rather than just a meal!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "gD0cOI8XM2Z9huEqt8q_rg": {
    "date": "2/14/2011",
    "text": "The ambience does not make up for the lack of good food. Really, the decor is great.. even the toilets have fancy tiles...We ordered the set lunch. The service was prompt and friendly but the food was luke warm at best. The pitas had been re-heated a few times and were exceptionally dry. The food itself lacked flavour and was literally bland. The mint tea was really nice and came in a fancy pot. One final note on the decor - the room way in the back is kinda covered with a dark red cloth as a false ceiling. It creates this unique darkish ambience. It is a nice touch but when you look closely, that cloth is just filthy. Not sure if I would go back ever again! 2 stars coz the tea was nice and the service is prompt and friendly. At this price, I can surely have a better experience.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRWAgAsFhtXbhy8GoSt-TQ"
  },
  "D2cNZPPy4K-XKXUq-WNqIQ": {
    "date": "7/3/2009",
    "text": "This place is great.  Very nice ambience - candle lit rooms, you sit on a couch, with a \"coffee table\" style of table, and Moroccan art.  During our dinner, a belly dancer put on a performance, further spicing up the Moroccan flavor of this place.  And the food...  it was GREAT.  I had not had Moroccan food before, and was thrilled at how delectable the food is.I would definitely recommend this place.  I wish they had one where I live, in California!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_uSe94nOZLPK8Eub3qK3ew"
  },
  "xgNXlk99v8UDM0zqXt7_vQ": {
    "date": "7/5/2010",
    "text": "Dinner at Souk Medina is a completely new dining experience for me (even though I've visited North Africa twice!)The restaurant starts at a narrow hallway and walking a few feet into it the smell of mint tea and fresh food hits you - and on an empty belly can really make you salivate. Apart from the smell of food also walk into a North African oasis - it's really amazing! The atmosphere and food of Souk Medina is really traditional - décor is exclusively Moroccan, warm/soft lighting, Arabesque music in the background, beautiful food - it really brings an authentic Morocco feel to anyone who visits. Although being in the heart of London this place will take you far-away.On the main level it was quite busy with people sitting and people at the bar. We were seated though having a slightly large group - beware the tables for starters is quite small and having plates on your lap is advised! The starters were good; hommous, stuffed vine leaves and batata harra (spicy potatoes) - all very yum. After starters you are taken to the top level overlooking the bottom level. Seats are comfy if you're lucky enough to get on the couch seats otherwise you'll be on chairs. The mains were amazing especially the fruity lamb tangine. So so good -for this alone I would go back. Cous cous was nice and I usually do not like cous cous. Service was probably one of the best I've had in London - very patient and helpful - plus with a big group we were somewhat annoying I have to admit hehe and they remained patient and attentive. Desserts were nice - baklava and mint tea. Baklava is not as sticky and sweet as the Turkish kind so I enjoyed it very much. But at the end of the meal I couldn't think about having more than one. The price range is roughly £30 per person including service charge and drinks. Ooh, one thing I didn't like about Souk Medina was the small cocktails! At around £7 you get a tumbler full of ice and a small amount of the good stuff. Although it was tasty I wish there was a bit more in there for me to enjoy. This is my first time going to a Moroccan restaurant and I was not disappointed. Recommended for a once in a while/special occasion dinner.Oh and did I mention there was a belly dancer? A lot of fun !",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "VD0jfC6UZqg2VN1ocaB5kw"
  },
  "xKIpwGCXo7sdFiYha5pYfw": {
    "date": "12/31/2008",
    "text": "I pop into this Moroccan oasis for lunch all the time.  It's the most atmospheric place I know for a bite of mezzes and some delicious harrira soup (though for some reason, it's not nearly as delicious as it was about a year ago...)The ambiance is fantastic.  Low tables of decoratively pressed brass and ornately carved wood, rows of vibrant cushions, stuccoed walls... walk inside, and boom, you're in Marrakech.Even though this place definitely sees quite a bit of the Soho pack... what I really like is that it's never too crowded here in the afternoon.  It's very calm, and there's WiFi, which makes it the perfect retreat to get some work done.Don't miss the mint tea, so delicious and refreshing, and *exactly* like what I've tasted in the Middle East.One caveat: I don't recommend this Souk for dinner - I've had pretty poor service, and in the evening I think there's a cooler cavernous atmosphere to be had at their Litchfield branch.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7WdbmNVYcxns-2r3NcJhA"
  },
  "KK0qsGWWMfCly9v--h7PIA": {
    "date": "5/29/2011",
    "text": "Visted Souk Medina on a hen night weekend with a group of 8 or 9 others, found the tables too short to sit comfortably at (ended up with backache for several days afterwards). The lighting was so dark that I couldn't read any of the menus; food or drink. The set menu at £19.95 was way below average quality, I found myself happy that I'd eaten enough of the humous and pitta bread for starter so as not to be left starving. Of the main course the lamb was so over-cooked it was falling to pieces and so soggy that the prunes the lamb was cooked with were being mistaken by all of us for pieces of lamb, never mind that the rest of this dish consisted of apricots. The rest of the main course dishes were barely edible, the couscous was like mashed potatoes, everything else was dripping with oil, the item in vine leaves was probably the nicest thing on offer except there were enough pieces there for just one for each of us... Too many of the dishes were laced with fruit which really didn't appeal to me. The service was decent enough but not worth them adding 12% to the bill automatically, especially for the standard of food. Oh yes, there was also a belly dancer who appeared near our table for 2 minutes or so. Eating at Souk Medina was an experience all right but not one that I plan to repeat. If you like North African cuisine this might suit you but beware, it's almost impossible to have dinner conversation as the \"authentic\" music is just too loud and if you're taller than 5'4 you might find it very difficult to get comfy at any of the tables!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qv6u837teDKMhfAnj7LKLg"
  },
  "hkv6PQYbzIWAJwVM7vGZcg": {
    "date": "11/30/2008",
    "text": "I've been here a couple of times. The first time, it was okay. Not the best Moroccan food out there, but a nice atmosphere. Dark with candles. However the staff were a bit grumpy. There is a good selection of beers and the menu is interesting. The second time was awful, and we had to actually walk out because it was dirty. Again the staff had been rude and practically ignored us. It was a shame, because my parents were down from Birmingham and I was trying to introduce them to the delights of exotic cuisines. Sadly this has put them off for life!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xPJSOgA1A9-PSG3bhZREnA": {
    "date": "9/19/2009",
    "text": "dark, intimate candle lit space with delish food, and affordable wine, amazing music, that unfortunately noone moves to with quaint quarters allowing room for couples and groups to enjoy alike.the seabass panfried and served with grilled eggplant and side salad was YU-MMY!!! the salad is not memorable, but the seabass fillet, truly delighful.the plate of mixed veggies which came in a clay dish, was curry spiced and very light.babaghanush came in a good-size portion, but less than sufficient amount of eggplant in the mix. tasty nonetheless.the dessert plate (baklava)? PASSthe hot mint-tea pot? GETbottle of cabernet for 14 gbp? GETall in all about 63 gbp aint so bad for a savory night out with amazing music and fun friends :))DEF will be back!!!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "na3UYTLl5dFNrHrOurmM6g"
  },
  "1dZF31KfVinpsPD_5b-cog": {
    "date": "2/25/2013",
    "text": "We went as a large work group. The booth upstairs we were given didnt accomodate everyone without us being really squished together. To the point that plates didnt fit on the table & some of us ate on our laps! I don't know if this was the restaurants fault, or if our group was booked as 2 seperate bookings that wanted to sit together. They didnt have a larger table available though. The atmosphere is very dark, Moroccan & reminds me of an actual souk. It certainly didnt feel like central London after stepping inside. We opted with a set menu for 3/4 of the group & some grilled mains- which worked out ample. The falafel & homous was tasty & the cous cous so light & fluffy. The grilled meats were delicious too. This was followed by baklava & mint tea. The music was ramped up & a belly dancer came around all the tables. A few laughs for a few minutes, but otherwise I wouldnt have minded if she wasnt there. The thing that made our night was the waitress. An Italian girl that was so funny, accomodating & friendly. If she had been dull & boring, I'd give it 3 stars. Food & drinks were prompt & the order was spot on. I'd go again, but would be checking we could actually all fit on the table.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0Ab2vQuVWUZPEnh6i4CEoA": {
    "date": "5/30/2010",
    "text": "I am very much enjoying my Capuccino in the lounge like setting. (I'd like to have had an \"Arabic Coffee\" but that was said not to be the spiced Mokka I'd expect). Very friendly service, and I enjoy the tinkling of the bells on her skirt whenever she passes by. For an ear-person this really is an auditory treat :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6HiEaWqssFZD9W20s7lDw"
  },
  "ONMDwcJmO4hu9WqHVO199Q": {
    "date": "6/15/2008",
    "text": "A friend of mine was celebrating her upcoming wedding here, and we were a very big group of people. The Souk Medina is very cosily decorated - I really loved all the intimate compartments and the North African style furniture, every time I go to a place like that I just wonder why us Europeans sit at high and uncomfortable tables! Isn't it so much nicer to be surrounded by the comfort of cushions? - So the ambiente was a great plus. The food was good too, although my Algerian friend thought it was too expensive for what they offered. Personally, I didn't agree, it was great food - the couscous was especially fluffy and light and tasted wonderfully sweet (it was served with raisins, something I had never tried before but having a sweet tooth, I instantly liked it!), and the chicken was heavenly spiced. The lamb was a bit dry, but also expertly spiced. The pita bread was maybe also a bit hard, but the various sauces and the wine leavesoh the wine leaves! They were delicious.The only big, big drawback was that it got really hot in there, and really really crowded. I was sitting on a pile of two leather cushions and found it very hard to move them (as they would simply fall over one another) - and there were people all around me. But altogether - very nice place for a slightly exotic dinner!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ArWz7BNqqATm1XgK1JggOA"
  },
  "I4-dB6TBAUcmMoNUKSF4Ww": {
    "date": "2/27/2007",
    "text": "If you are missing the atmosphere and food of Morocco, then Souk will cheer you up. A bit frayed at the edges but fun, atmospheric restaurant with good couscous and belly dancingreasonably priced.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2mYT3iy-p2VyR08cgJLKMQ": {
    "date": "3/20/2014",
    "text": "My friend has been telling me about this place for ages so one night we finally got around to coming. I wouldn't have been fussed but it's on Tastecard so thought I may as well!The food is good but not amazing. I wouldn't pay full price for it but I'd go back with the tastecard. The selling point has to be the atmosphere!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gW0JtOzGqh09bKDJjPrLkQ"
  },
  "CcC-gWx67vbb2GKkTyXc5g": {
    "date": "10/13/2011",
    "text": "Thanks to a personal recc, we came here for dinner on our last night in London visiting a friend, and had an excellent meal. The atmosphere is really cool (dark, cozy, low tables, cushions, curtains), and the space seems to go on forever with a main level, an upstairs hideaway, and an entire lower level (where we sat). We started off with some delicious cocktails, some type of mojito with rose and something with brown sugar, plus a whiskey sour, all of which were delicious. For food, 2 of us got the set menu, while the third got an entree (duck with cinnamon). The set menu is excellent and quite a deal, everything we had was delicious and there was a great bit of variety and sooooo much food (we couldn't finish half of it). It seemed to just keep coming... hummus and hot pita, grape leaves, chickpeas and spinach, couscous, chickpea sauce, spicy potatoes, chicken and lamb with prunes, baklava, mint tea... I was loving every bite and cursing the fact that we don't have anything similar in Boston (set menus = awesome value + awesome variety). My dining companions were similarly pleased with everything.Definitely recommended for good food at a good value, for a change of pace or special occasion (this would be great for a date!).",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Y0zsJSfWLkfDylH0X1yNQ"
  },
  "1FE7VXBotn0s6rvZU2gqFg": {
    "date": "4/1/2015",
    "text": "The ambiance is great in this place. Tiled floor, sofas, cushions, very relaxed feel. The service was speedy but almost too quick - we felt a little hurried - like they wanted us to leave as soon as possible. The humous and falafel dishes were nice starters. I had the aubergine moussaka, which was tasty. Overall it was an average meal, nothing too incredible, but not too bad either.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KwkZrrrL6ruec5wnjkaPvA"
  },
  "OFLHM6BrUOYf8TT6_4xJpw": {
    "date": "3/11/2013",
    "text": "I went to souk medina on sat evening was the first time I've ever been to a Moroccan restaurant. And I would 100% go back. The atmosphere was everything u want in a restaurant. Very buzzy lots of people. But the lighting makes the place feel very relaxed! The food was cooked to perfection. I had a lamb dish the meat was gorgeous and great flavours! There was a belly dancer who danced around the restaurant, so if your not eating you might have to get up and dance, this might put people off, but it was brilliant, it added to The whole experience. I would definitely recommend anyone to go here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "recjEAWItcVMwDU1M3Cu4w"
  },
  "u60McXPek-VuecFPaoXkFw": {
    "date": "6/3/2012",
    "text": "I came to Souk for lunch.  Upon entering, it was unclear as to whether they were open for business or not.  Once we were finally greeted, we were led to a back room where there was one other table with people.  The decor was nice, but the chairs and benches were so short that my fellow diner, who is on the taller side, was quite uncomfortable in the seating.The server we had was new - I think it was her first day.  She was doing her best, but was clearly not trained up enough.  There was a lack of knowledge of the menu and ingredients, which is not ideal for when you are serving Moroccan first timers.We ordered the appetizer platter royal, which was barely noteworthy.  It was a collection of falafel, a fried chicken item, some hummus, etc, and nothing really stood out.  Our main dishes, the lamb and chicken tagines, were better, but still not amazing.  Overall, I'd be disappointed if I paid full price for this meal as it was a bit pricey.  However, they were running a 50% deal if you filled out a survey.  All in all, there are better options in the same price range in the area.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8pO7fbeFK-gUzn2eXrB2Q"
  },
  "NmrMordiTW8NTUDoFNhwSA": {
    "date": "8/14/2013",
    "text": "This place is one of my regulars stops for - well, let's be honest here - the atmosphere. Don't get me wrong, the food is good, but the interior is so much better! Especially the downstairs and corner sitting areas scream 'MOROCCAN!'. So yeah, very authentically looking place, delicious cocktails (at least the non-alcoholic ones I tried), fresh mint tea, great service. In terms of the menu both, the selection and presentation are very traditional. I would recommend ALL their starters, including grilled haloumi, and hummus and as a main I cannot adore enough lamb stone dish. So tender, proper slow cook meal with veg, filling, comforting, making smile on ones face. Yet, the portions are very good size.On the other hand, you can go really wrong if you feel like experiment. I tried moroccan pasta (shaped as tiny little balls) in a tomato sauce of sort, the meal didn't talk to me or make sense - the texture or anything hooked me in. Dessert = baklawa could use at least tiny little innovation, but with lunch menu of 2 courses (big main course, peppermint tea, baklawa) for £12 or so who could say a word. Besides, as stated above - this place's charm is authenticity and tradition...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-DLyf0EB5WYbt8lRR0vCKQ"
  },
  "soGTM_7sMXx_N1PaL5PBrg": {
    "date": "2/4/2012",
    "text": "Tried this place on a recent business trip to London.   Food was great.  Love that it's \"authentic\" with the low seating, but it isn't that comfortable if you are there for long periods of time.  And I do realize that having a bellydancer is part of the authenticity as well, but I'm not a huge fan of half-dressed women dancing around my table while I'm eating--no offense to anyone else.  We tried a large variety of apps and main dishes and it was all very good.  I would go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MclxC0tuFnbwgATniWu66A"
  },
  "548FMDugjJfHo8bTj_BsMw": {
    "date": "10/10/2015",
    "text": "Very bad service. They take forever to take your order and then forget to bring it but still charge you for it",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuusz-_fCKDRsGJUKoxySQ"
  },
  "NNngexVHPnF8B3pmgSKhQg": {
    "date": "3/14/2014",
    "text": "Their Lamb Tagine is fantastic! I would highly recommend. I would also recommend the chicken cous cous.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MUyWhQK3lbc4DF-Nqhnuw"
  },
  "S5wQaFH7sxDnhKAiod8PHQ": {
    "date": "6/20/2011",
    "text": "YUM!!!!! What a treat! We went here on Friday, we hadnt booked and they fit us in. From the moment we walked through the door the staff made us feel very welcome. The atmosphere was ace ( apart form the table of spoilt girls next to us who seemed to have no respect for anyone other than themselves ..... playing crap chart music on their phones while we were eating ... Punch in the face!)I loved the decor, the low tables, candles, bellydancing. so much fun! We had the set menu ... more than enough food, just delish!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5j0QmE-ktdY2wfEYX2YStA"
  },
  "_vKVhGfjyWW18kdIpLD4ig": {
    "date": "3/3/2011",
    "text": "I quickly realized after siting down in this place that I had no idea how to sit in the low and very sinky chairs.  Do I try to cross my legs?  Do I go for the straddle?  Good thing I wore trousers!  My dining partner couldn't take it with a bad back, and thank goodness they found a spot for us at the only banquette in the house!We all went for the set menu, and were served a delicious array of yumminess! Highlights for me were the saffron chicken tagine and the little tray of baklava - who knew of all the variations on baklava??We were entertained midway by the best belly dancer I have ever seen (okay, I haven't seen many, but still!), and the whole crowd was really into it!  Very fun and lively.My only regret - and it's a big one - was that I didn't eat like a pig.  My dining partners were particularly conservative with their eating, and like the girl I am, I didn't want to look like the piggy face.  I really should have eaten more.  Next time I will go with some boys.Pros:  great food, fun atmosphere, a place where you want to linger if you can handle the chairsCons: crowded, loud, pricey if you eat like a girl",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W1azlMWpfu8jiCRxG14ocg"
  },
  "jCeqrcYwjR8ZeX3b6siQ8g": {
    "date": "7/12/2011",
    "text": "Ahhh, Souk Medina. I've been back on innumerable occasions so they must be doing something right. This is a Taste London restaurant - 50% off the food (except Fridays and Saturdays) and you don't have to call and book, which already scores a few brownie points. Without the discount it's still reasonably priced - £7 or so for cocktails, wines starting at about £16 a bottle, the set menu at £20 a head.I've had the set menu a few times - the potato starter and the lamb tagine are amazing, but the rest is a bit 'eh'. Once the waiter recommended ordering the set menu for half the table and choosing other dishes from the a la carte to get more variety - a good choice. The tables are LOW, and if you're in the downstairs lounge sometimes you'll end up with a big birthday group (at which point they'll play this crazy 'HAPPY BIRTHDAY TO YOOOOUUU' song which is great if you're the birthday table, not so great otherwise). So my recommendation is to sit upstairs as the idiots do seem to congregate in the lounge.But I'm bitching about a place that otherwise I really like - a nice little oasis off Covent Garden that's well worth a visit.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0JKtP0gYYT9tEAvJYUxAZA"
  },
  "hmOFvlieByH7UB5cNqkcSQ": {
    "date": "2/5/2014",
    "text": "Visited with a group of 8 and we opted for the set meals. We used the tastecard so therefore all food was 1/2 price, and to be fare this would have been about right! We had wine with our meals and these were a bit pricy, but I guess only what you expect in London. The food was warm but lacked depth in flavour. The Chicken tagine seemed a bit bland and the Lamb had fatty bits, not what you want. Not the best north African food I've ever had but okay! The surroundings where very traditional and they'd made an effort to make the atmosphere good with a resident belly dancer etc.... Nevertheless I expected a bit more from the food and it really seemed to be a bit 'all fur coat' and well.... you know what!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AXCr1vYrf8tQ1UOyJP4pw"
  },
  "NrOYIIy_YZP9meY04HuaUQ": {
    "date": "7/16/2010",
    "text": "Great are the perils of harbouring mighty expectations! Disappointment is but guaranteed. Anticipation is the death of all goodness in restaurants, I deem hereforth.Alright, enough with wielding my poetic licence then.I had been looking forward to checking out the Souk Medina for the longest of times. On several occasions, I had lovingly browsed through their well-done website and planned and plotted on what I would like to savour when I'm there (yes, I can be quite pathetic like that, sometimes :P) but several plans at the venue fell through, much to my consternation.I /finally/ made it to the venue quite unexpectedly at an acquaintance's birthday do, without much of an appetite to speak of. I would have preferred to just have a quick drink and dash, and come back for a proper meal to savour the much-promised goodness of their menu. But the seating arrangement is such that to seat yourself, you have to inconvenience everyone and sidle up the edges and I decided to be polite and have a quick bite. However, the way the set menus work is thus - if everyone orders the set menu, there is a free flow of food to the table, but if people hmm and haw and go for ala carte, the table might face impositions on the free flow. Call it peer pressure or whatever you will, I ordered the set menu after all. It might have been that I felt a degree of coercion or that I didn't have much of an appetite. Or it could have been the brisk treatment by the waiter who did not seem keen to elucidate the various options available to guests. But I wasn't pleased. The food was probably not bad at all, but it didn't overwhelm me positively enough for me to overlook the general lackadaisical service. The only thing that stands out in my mind from that meal was this succulent lamb dish flavoured with whole plums - I liked, despite the grouchy mood I'd fallen into.For the moment, I shall reserve my judgment on the food and rate this place on the service which deserves no more than the 2 measly stars I shall spare.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "E8OPx1EO2EF8DjV5SQDOwQ"
  },
  "b5Pl-Z2iQc1i6s44vl-osg": {
    "date": "7/10/2010",
    "text": "I had never had Moroccan food before, so I wasn't totally sure what to expect of this place. The interior was amazing, and the atmosphere was really chill, exotic, and laid back - so my first impressions were good. And then they brought out the Casablanca beer, and I was head-over-heels in love with this place. The beer, plus a delicious Mezze platter and a plate of grilled holoumi later, and I wanted to propose. At this point I was already full and ready for a nap, but I soldiered on and had the chicken, feta and spinach Tangine for my main and GOOD LORD was it good. I'm kind of a wuss and usually shy away from any meal where the meat is still attached to the bone (*shudder*) but the way the meat was cooked caused it to be so tender that it literally fell of the bone when touched. It was, needless to say, delicious. This place has excellent cocktails, food, and atmosphere, so it's the perfect place for a big group party, or a quiet date for two. Plus, the staff are incredibly knowledgeable and can know the menu like the back of their hand and will recommend something if you're stuck, or unfamiliar with the food on the menu.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "9piOzBr_kgd_sMf6PqONtg"
  },
  "6NDp5bw6_UEnILHM_Xlm8A": {
    "date": "12/2/2011",
    "text": "This restaurant is a favourite of my girlfriends who has been with friends a few times before. Unfortunately for that reason i have had to put up with visiting twice now.Didnt like it the first time, the seats are too low, too worn, too cramped, i get the concept of laid back morrocan dining but they dont execute it well and so you just feel really uncomfortable. Food was ok, nothing special in my opinion and didnt make up for the dark cramped conditions i had to endure.Its only my opinion but i cant see the fuss and have let my girlfriend know there is no need to invite me next time she decides to go to souk medina",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xb9vEda-12Cygx3LsKDe5A": {
    "date": "6/13/2010",
    "text": "Well what can I say? For 30 nuggets you can have one of the most, fun and unique eating experiences in London. Having wondered past a few times I insisted that we check it out for my friend's birthday. thankfully it didn't disappoint. Upon arrival you are greeted by attractive staff. I know this is shallow, but the woman and the guy that welcomed us were both smoking hot. Immediately I knew I was going to enjoy this place. We were led downstairs into a dimly lit parlour area. It was like a Moroccan dream. Like I had stepped onto the set of Aladdin, sans magic carpets. I was already aware of the what the score was, but for your information I shall divulge details. For 30 of your English pounds you will receive starters consisting of hummus, pita bread and a spicy sausage and potato thing which they will keep bringing to your table until you bleed. Once you decide that you've had enough they will then bring out the main courses. The two main ones you should concern yourself with are the slow cooked beef and chicken. Both are let in the mouth unreal. Eat and then eat some more. The food won't stop coming until you beg for them to stop. If you're hungry you can really get your fill. During the course of the evening you will also be treated to a belly dance. I found it a little awkward. Don't ask me why. I guess it's a sort of weird lapdance. However, a bottle of wine each (this is covered in the 30 nuggets) and some delicious, super buttery baklawa and you'll be living the dream. Need an excuse to got into the tourist nightmare that is Covent Garden? You've found it.  Sexy Rob",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9idqYuy59hz49LS9yEPIqw"
  },
  "D9hpZhGuy89KBWAwIKNYBA": {
    "date": "6/8/2013",
    "text": "Great food great service great environment. i ordered the set meal which came with a small appetizer and chicken and lamb entrees with some baklava desert and tea. pretty good if you ask me and it was 20£. the chicken was amazing. it was cooked in some curry and just tasted great. the meal comes with tons of pita bread a hummus so thats always good to snack on. i wasnt a fan of the lamb so much compared to the chicken. the appetizers are forgettable as they are small and fairly pointless. you only get like one piece. the mint tea is amazing and a perfect ending to a great meal. the service was on point as well, dealing with my groups hassle. we were very time consuming and impatient and full of questions.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FMr5EmLJKQvjpVH47HCi8g"
  },
  "0h0n9iFiGjrt330gSk3bug": {
    "date": "12/19/2008",
    "text": "I had no idea this even existed in Convent Garden until we went with a group of friends. I've heard it can be really busy on the weekends but we booked in during the week and although the waiters still seemed rushed I kind of liked the hustle and bustle, as it did very much feel like a Medina. Having spent a number of months in Morocco I can tell you that the decoration and the caves lent themselves very well to feeling like you'd been transported to the middle of Fez! I love the low lighting, cushions and hanging lamps.The food too was a lot better than I had expected. There are of course a whole range of delicious tagines as well as other meat and fish dishes such as Lamb cutlets and Seabass. The spices appear to have been mixed to perfection but be warned - Moroccan cuisine is about subtle flavours not burn-your-mouth-off flavours so if you want a real curry then perhaps you'll be disappointed. Everything was wonderfully presented - make sure you order a mint tea with baklava for dessert, they'll bring it to you on the traditional embellished tray.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z50I_fe4meUVlZKnPh9Pbw",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Z50I_fe4meUVlZKnPh9Pbw/o.jpg"
      },
      {
        "img_id": "ynKp2X0asusKvkefZfCrAw",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ynKp2X0asusKvkefZfCrAw/o.jpg"
      },
      {
        "img_id": "l7q6t7mlub5FGNxxYW0qNw",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/l7q6t7mlub5FGNxxYW0qNw/o.jpg"
      }
    ],
    "user_id": "6ET2d9X8m-OdUOMCXCUp-g"
  },
  "43ImBlkKptjKL2UfmkbVZw": {
    "date": "2/1/2010",
    "text": "'Meh'-roccan food.Souk Medina serves a mixture of North African and Mediterranean dishes. The food's not bad, per se, but I've had better for cheaper. Similarly, the tatty paper menus with a staple through the corner also seemed a bit at odds with the digits printed on them. The service was precisely average. I just didn't feel there was anything special about this place.In summary: Meh.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lPW814AfoF6pWKJ8InbjKg"
  },
  "IOzQBzDlUMxxAlOl2gys8w": {
    "date": "8/15/2016",
    "text": "I've visited Souk Medina Four times both with local friends and international friends when I visit London. I always recommend this place to friends visiting London as well, it's a little hidden Gem. Entering through a curtain doorway down a small alley way you would think you were in Morrocco, the decor is down to a T from floor to ceiling and with wooden carvings, dark wood tables and the aroma of spiced food and mint tea. It's on two floors and always busy in the evenings so best to book a table. I always order the Mezze or a type of stew or if I'm with friends we order the set menu and there's always plenty of food to go round. The Moroccan tea and cocktails also worth a try. On most Saturday evenings there is a belly dancer downstairs so always good fun. Although I don't smoke shisha I believe there is a room for this Worth a visit if your in Covent Garden",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "82aZMRMsuOjw1Z_hxMEb0Q",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/82aZMRMsuOjw1Z_hxMEb0Q/o.jpg"
      },
      {
        "img_id": "mVzR0E-TFWJqlGzhlfg-Uw",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mVzR0E-TFWJqlGzhlfg-Uw/o.jpg"
      },
      {
        "img_id": "290gdn-ZNsgk6xIqvEVQdg",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/290gdn-ZNsgk6xIqvEVQdg/o.jpg"
      }
    ],
    "user_id": "rF7SZOieiEv9S7fQtf71PA"
  },
  "pFXmc8xOV0S6zTvH9BZpQg": {
    "date": "10/8/2017",
    "text": "i booked in advance and sent 2 emails asking for a quiet table and mentioned that my boyfriend and i are vegan. No reply. We were seated in the most crowded place in the restaurant. Felt like a sardine and could literally be a part of the conversation of the couple seated next to us. If i wanted to yell loud enough to overcome the music that is. Nice decoration but so over the top that it felt the furthest from an authentic experience. Was loud and unpleasant. We couldn't carry out a conversation. Food came quickly but was not hot and the dishes were very small. Drinks came with the main dish instead of before the food. We came to London from Vienna for a weekend and chose to spend our night out in this restaurant. Will not happen again.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnNVnu0GzAoFVECO9WbDkQ"
  },
  "hZsYgxcNGbLprigfdkadEg": {
    "date": "12/31/2017",
    "text": "Delicious falafel...in fact the best in London. And the belly dancers are amazing, especially Leilah Isaac who danced on New Years Eve...she bought so much energy to the atmosphere!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mc01Cl8T77F-g2-DqTdt6A"
  },
  "JZqPhFlEZT91mrP5SWQmzw": {
    "date": "11/1/2017",
    "text": "Great place to enjoy Marocco taste which is really nice flavours. Accommodative and friendly staff with good service.Had a variation of course dishes so we spent a couple hours enjoying with the local beer. The interior takes you a bit to North Africa as the style is really interesting. Cozy and nice seating around small pleasant areas. We sure enjoyed this place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "omk4Ashv2h1AI3GLzdrvKw"
  },
  "iL6GVhdYMCR7YUKy9Ls_tw": {
    "date": "12/14/2015",
    "text": "I visited on Saturday 12th December for our annual Christmas lunch get together. I booked at Souk Bazaar, having visited before. We turned up to find they were closed for lunch, despite making a booking there. Never fear, we were sent to their other restaurant 'Souk Medina' which was about 5 minutes walk away. I'm so glad we did because I had the best lunch ever.We opted for a lot of tapas style dishes and just shared everything. All the food was amazing, from calamari, humous to little soft cheese and feta parcels. The best, however, was the aubergine dip. So much so, we ordered a second! We noticed others around us smoking shish, so after our meal, we asked to move to the comfy sofas to have one as well. We created own flavour we named 'Grint' - grape and mint! The pipe was electronic, like vaper cigarettes. Above all, I'd like to say a special thank you to our waitress, Laura, who made our meal so enjoyable! Her service was phenomenal! We were laughing the whole way through. So thank you! And we will be back next Christmas!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9K032uCbfE5zP1IN52Zr6A",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9K032uCbfE5zP1IN52Zr6A/o.jpg"
      },
      {
        "img_id": "A20MehmJXx1IihqRJUyjBA",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A20MehmJXx1IihqRJUyjBA/o.jpg"
      },
      {
        "img_id": "7DhGSp-sdP7B6dgGxzBYrA",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7DhGSp-sdP7B6dgGxzBYrA/o.jpg"
      }
    ],
    "user_id": "7OKoooX9YB2YnOoODa9jxg"
  },
  "3IYgqfc2i8xENUYpXYfN8A": {
    "date": "1/5/2015",
    "text": "Very much a Moroccan hideout in the centre of London, Souk Medina is certainly an intriguing place to eat. Stepping into this restaurant feels like entering an exotic maze as there is noone beckoning you in or ushering you to a seat but instead there are many nooks and crannies in which you can lounge at leisure and many exits or entrances to escape or emerge from. The food is wholesome; pleasant to look at and satisfying to eat. However, although there is a good variety of ingredients, the overall flavour was surprisingly lack-lustre (not absent but not quite igniting the taste buds as you might expect from Moroccan cuisine). Nevertheless, Souk Medina serves up a hearty meal amongst an atmospheric cove in the heart of London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M2Mn_AridPbEMh8lzGnA6g",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M2Mn_AridPbEMh8lzGnA6g/o.jpg"
      },
      {
        "img_id": "Cp70U4rj_JH2CTgXOvQHKQ",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cp70U4rj_JH2CTgXOvQHKQ/o.jpg"
      }
    ],
    "user_id": "gFxXMw3jn_gc-D-aY6mrMg"
  },
  "MrA0wTVj_UFzLtsOqOS53g": {
    "date": "4/28/2015",
    "text": "Been here twice now and the service is terrible. First time I was there, it was crowded so I was quite forgiving with the bad service but today it was quite and we still had to wait nearly an hour for our main.My grilled sea bass was over grilled and it was dry. I ordered a fresh mixed fruit smoothies, which wasn't freshly made as it came from a bottle.  3 stars for the decor as it was the best thing about this place.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6kkbcOBcr5oQTZH-BYjR1w",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6kkbcOBcr5oQTZH-BYjR1w/o.jpg"
      }
    ],
    "user_id": "_obGEh0dUdfRSZscN4UV4g"
  },
  "3ObNoLF3PHGfC2g9uV0u2Q": {
    "date": "5/29/2016",
    "text": "Reasonably priced, good food and belly dancing. I'm glad we made a reservation as it was packed on Saturday night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ac2QFgkaMVNIDjWK5exryg",
        "caption": "Photo of Souk Medina - London, United Kingdom. Shake it!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ac2QFgkaMVNIDjWK5exryg/o.jpg"
      }
    ],
    "user_id": "Ff8hG_00h6SO5unNTXPFQQ"
  },
  "hOmFUbhwR9kTI6Acto6CLg": {
    "date": "8/31/2016",
    "text": "A great place to come for a casual, authentic dinner with friends. They do belly dancing shows in the back room if you want entertainment while you dine",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5XzWzBiF8LVh-WrN6xPdOw",
        "caption": "Photo of Souk Medina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5XzWzBiF8LVh-WrN6xPdOw/o.jpg"
      }
    ],
    "user_id": "A-Ik_Lv_k8RSITOEvGiUUg"
  },
  "6K59hI10rkcb7PL6dp2gbw": {
    "date": "11/12/2014",
    "text": "Should have gone with my gut and ordered what drew me into this place, but no. . .I ordered the more decadent and rich moussaka instead.  I think I would have enjoyed couscous with root vegetables much more. Now that I'm writing this, it makes me want to go back for a do over and try the couscous and vegetables. It's hard for me to imagine root vegetables could go wrong.If I had to do it all over again, I would just come for tea and company. Super colorful and cozy place with very skilled and warm belly dancer.At some points the music was too loud for conversation, which I always find annoying because I'm not the best at shouting.A pleasant experience nonetheless. Very friendly and fun staff.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "0G-bcpdR48tfZy6koGUiTQ"
  },
  "phkBO6Or9V7ZaxbCjNujmQ": {
    "date": "9/21/2014",
    "text": "Souk Medina is a real tardis of a place in Covent Garden. We stumbled upon it when trying to find somewhere to eat after a yelp event and brilliantly, they accept tastecard.Because we got 50% off, we took full advantage of the more expensive A la carte menu. Ordering 3 meat dishes and a vegetarian one - just for some variety as we were sharing anyway. My favourite way to eat. They also said, we could ask for more meat if we desired, but we were all totally stuffed!Sweet mint tea and baklava to finish off was a lovely treat!Really relaxed, comfortable atmosphere, although there were times when I wasn't sure what I was eating because of how dark it was.Midweek meal with a tastecard, doesn't get much better.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xXbKIkVZzpj0VZbPnPLFIw",
        "caption": "Photo of Souk Medina - London, United Kingdom. Look at how amazing this teapot and handle-cosy-thingy is!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xXbKIkVZzpj0VZbPnPLFIw/o.jpg"
      }
    ],
    "user_id": "eoeLf2_93YxLGk4PRU2Dfw"
  },
  "yZmwqlLDIunhWWsc_43ALg": {
    "date": "12/6/2015",
    "text": "A must visit in the heart of Covent Garden!My girlfriend and I went last night and had a fabulous evening. The atmosphere was traditionally Moroccan with all the sights and smells you would expect.The customer service was outstanding- in particular, the Italian waitress who was hilarious and fun!We had the set menu and all the meals were delicious- special mention to the chicken tagine which literally fell off the bone. Absolutely brilliant!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pi_ZxkauMTYvD-oHyTxnKQ"
  },
  "BRrUdlPDa0BwI9yeJN6mtA": {
    "date": "9/26/2014",
    "text": "Located in Seven Dials this is a hidden gem in tourist central.We only came across it when looking at nearby restaurants where we could use a tastecard. The entrance is quite small and you could easily walk past and not be impressed by the look of the restaurant.It's deceptive though, as the place is pretty large inside, with an upstairs dining area too. We opted for one of their meal deal type menus. £25 each for starters, all you can eat meat mains and an array of baklava for dessert washed down with sweet mint tea.I wouldn't pay the full £25 to eat here but with 50% with a tastecard it made it a worthwhile deal.Starters included pitta, dips, falafel and vine leaves.Mains were lamb tagine, a slow cooked chicken (on the bone) dish, a chickpea dish and we also opted for a veggie moussaka. The chicken was delicious and fell off the bone and the lamb was tasty too. Perhaps a little bit too salty (and I like salt!) but still very nice.We thought we'd take advantage of the 'order as much meat as you'd like' offer but found we were full and didn't even finish all of our food, let alone order more!It was a fun, easy, very filling, sharing type meal. I enjoyed it, especially at a good price but we did find the restaurant so dark that it was hard to read the menus or see the food when it arrived! It came to £15 each inc. service, with no drinks. Not bad at all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yd8iyIZ9afDGYLRK1DaSBQ",
        "caption": "Photo of Souk Medina - London, United Kingdom. Whilst you can barely see the food you can see how dark it was in there!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yd8iyIZ9afDGYLRK1DaSBQ/o.jpg"
      }
    ],
    "user_id": "t9LzSA-PN9FF0hiUwCafVg"
  },
  "flnUe6clonGHuBf8y5JO8Q": {
    "date": "4/5/2017",
    "text": "we just stumbled across Souk Medina and decided to give it a try.  We were extremely pleased by the chicken and lamb - great meal !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "koaxJUGtmI4rXeUIHBNiWg"
  },
  "-GYnAG4mG4YZTJqjcp1QEQ": {
    "date": "12/28/2016",
    "text": "Had a really lovely time. Friendly service, great prices. Nice atmosphere. Harrira was delicious. Bathrooms could have been a bit nicer. Cocktails were delicious. Nice place for small bites!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QglM7AeLGNWDvKi_-8728g"
  },
  "hypMkIV4jPh2sbLpFWol2Q": {
    "date": "9/24/2015",
    "text": "I really enjoyed this place, maybe more so than most of the other reviews. I went here as part of a Christmas party, the mint tea and the food were amazing. The #1 reason I have reviewed it as a 5, is the set menu, whichever one you order, you will get an endless supply of the foods, so I had an endless supply of lamb, once I ate it, I was given a new one. This was coupled with the fact, they take Tastecard so I had amazing food, ever lasting at half price. Plus Covent Garden is a lovely area to walk around before and after.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4MPHYYKWmnPJbfUlJxGrg"
  },
  "dDDgy6GUVHlgZB9DvoQyKQ": {
    "date": "7/27/2016",
    "text": "This is a lovely restaurant with an authentic feel and interior. The cold orange walls make you feel like you are actually in Morocco but the hanging decorations soften it all up a bit. I popped in for drinks with a group of colleagues and although I was drinking wine I had serious drink-envy of everyone's cocktails. I think it was a Moroccan Mash - a gin and juice combo - that I tried a slurp of... And boy, will I be back for some of those! We didn't eat but we had some pitta and a trio of humus and dips which were delicious, we reordered a few times because it was disappearing quite quickly between the 5 of us! The food looked delicious and people around us seemed to be really enjoying everything about the place. I will be returning soon for a meal!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgk6QQyK1_4JYW5_nYDUtA"
  },
  "az6X_2wOgwiN3x91mM30Cw": {
    "date": "9/20/2014",
    "text": "I went for dinner at Souk Medina about 4 years ago with a big group of friends. It was fun as we sat on the floor on cushions so it seemed more authentic, the food was really tasty and there was a belly dancer providing entertainment. So, when a couple of fellow yelpers asked if my friend and I fancied getting some food somewhere after a yelp event and they found Souk Medina nearby with a taste card offer I was definitely up for going again.It's just off Seven Dials but a bit of a hidden gem. It looks like it's a tiny little place but really cute and full of Moroccan treasures, furnishings and art. It looked pretty empty when we got there but once we were through the entrance it opened up and it was pretty busy. We were seated upstairs and strangely I ended up sitting in the exact place I did 4 years ago. It has changed a little though as it now has tables with benches and chairs rather than cushions on the floor. It's really nicely decorated and does make you feel like you're far from the streets of London but it was a little too dark for my liking. It would have been great to see our food better! We were offered the choice of two set menus and as we were hungry we went for the more expensive one. It would normally be £25 per person but it was 50% off with the taste card.With the set menu, you get all of the starters listed, then you choose vegetarian, meat or fish for the mains and you get all of those. We went for three meats and then a veggie one too. The meal comes out and is shared so you all get a bit of everything. I really love this kind of dining. We were also told that the meat was unlimited so we could ask for a top up at any time - WOW!The starters were houmous, tatziki, falafel, something with lamb, halloumi, stuffed vine leaves and bread. The main was veggie moussaka, lamb in chickpeas, chicken, couscous and more chickpeas. It was all nicely flavoured, although I would have preferred a little more spice, the meat was really tender and when I picked up a bit of chicken it was so good that the meat instantly fell off the bone!We really wanted to order extra meat just because we could but we were really full and couldn't eat any more...until the baklava came out with mint tea that is!The mint tea was very sweet but I like it that way. It might be too sweet for others, especially when combined with the ultra sweet baklava.I'd probably pay £20 for the meal we had, do it really did feel like a bargain when it was £12.50 each with the taste card offer. There was a 12.5% service charge added on top for the full price it should have been so that added a bit but overall I'd highly recommend it.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "djbrXe5gUUaVDWIEqGrq9w"
  },
  "283pOJPumWmr3UUm5Bjdzg": {
    "date": "4/12/2016",
    "text": "I have visited Souk Meidna many times but the portion sizes are getting ridiculous. I like the food but with the chicken skewers there is practically nothing on the plate. It is supposed to be a main yet it is tiny. Plus the salad with it is tiny what a waste. They used to give a good portion.They need to give two skewers and add more salad and veg. Will not be getting that again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RDDWXfebOOy_wBnGTlXyOw"
  },
  "7Dx8m8hkaI0Jyt7UyFcwUQ": {
    "date": "8/22/2015",
    "text": "Just a few steps from Seven Dials and near Covent Garden, this Moroccan gem offers a lovely menu and atmosphere.  With three visits under my belt with three different groups of friends, the Marrakech and Casablanca menus go down well.  Between sweet and savoury dishes, visitors will experience a treat that's embellished by a friendly staff, belly dancers and the option for an after dinner sheesha in one of the many side areas of Souk Medina that make one feel right at home.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQbmltQwZqiNpHlnp6QxRA"
  }
}