{
  "MoU7vvCkWwifmhTRq6ORrA": {
    "date": "11/5/2010",
    "text": "Looks like a pizza joint, not upscale, but it produces a very good dinner at a modest price.  I had salmone ala griglia, nicely done with tasty veggies.  My friends had the grilled lamb cutlets, also very tasty & a pasta dish.  Total with a bottle of chianti and beers was £22 a head.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bEMVYiflSnsfgM2xevRfmg"
  },
  "67gWvGBLwF7QgiY0rmO-NQ": {
    "date": "5/14/2011",
    "text": "Very friendly service, delicious authentic italian food at a reasonable price, possibility to dine outside. Great decoration. Definitely recommend the place!!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "R6o5TkKceZX6AT1Q8VNxpQ": {
    "date": "8/12/2016",
    "text": "I went to the restuarant It's good food and good services and I found neither . I order too much food for the party of four but I was not pleased especially from the service which was so bad that you need to wait at least half an hour to get your the waiter and there are many of them and the place is not that big or crouded. The food is not that good compare to the price. Make it short it doesn't worth it.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BwGDm56b9UljUFv_nN7UZw"
  },
  "CbNJgVCBfcJtpnrcP6Q0jA": {
    "date": "8/23/2012",
    "text": "We moved to London 3 months ago and this was our first restaurant for dinner (we were living in South Kensington) at that time.  The staff were attentive and the atmosphere was lovely.  We started with bruschetta, had Tagliatelle Carbonara and pizza.  All were authentic Italian flavors and preparations--thin crust pizza with just the right amount of sauce, cheese and toppings.  The kids LOVED the profiteroles for dessert.  I don't know what David F ordered but there is NO way a dinner for 2 would be 200 USD. My husband and I had a bottle of rose and we were a table of 4 and didn't even come close to 100 pounds.  My kids asked to go back there almost every day for a week, but being new to London, I insisted on trying new places.  We did go back 3 weeks later before we moved to St Johns Wood--it didn't disappoint.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pQY0ucZG1HO2PPOnhYosBg"
  },
  "eGkSHf8oW6G-dWOGXg3UdA": {
    "date": "9/30/2012",
    "text": "I got a spinach ravioli with a cream and tomato based sauce tossed with smoked salmon which was pretty good (if a bit heavy on the cream). But my friends' pizzas were just sad. Super thin crust that had pockets of black burns on the bottom and skimpy toppings sprinkled with blobs of half melted mozzarella... Really disappointed. AND they brought my pasta out at least 5 minutes before the pizzas. So irritating. So to be polite I had to sit and watch my food get cold because they can't time cooking times? Lame!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M2Bdj6qgYurSVTrb1MmQXg"
  },
  "1pWGSBxAx7g_5Kht3wtSjg": {
    "date": "3/23/2015",
    "text": "Crammed and cold setting for Italian. I can cook better dishes one handed. Compare any of the pizza, soups, starters etc with a real Italian chain (zizzi, spaghetti house come to mind), you'll get twice as good cooking.Only good thing is the portions are huge.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SE9AF5Vxmg7lmlKlYDsAMg"
  },
  "1oLeZQS2GWzYDeH3z7osVQ": {
    "date": "11/25/2013",
    "text": "Awesome pizza..muscles... n squid ink pasta. I wish to eat there everyday!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZQ8Mc6f2E7X7lLldtn4Vw"
  },
  "U8_b12JhGorMcptSvagx2A": {
    "date": "10/24/2014",
    "text": "Went twice on recent visit to london.  Why?  The food is great and it's a super value. It's loud, the service is shaky (but very friendly) , tables are close and it was jammed both nights.  But that tells it all right there.  Locals of all kinds, and visitors packed together enjoying homemade authentic Italian food.  Homemade pasta was the highlight (yes pappardella) with lamb ragu, or shrimp scampi.  Great salads pizza some fish gnocchi and veal.   We'll worth the noise and crowd.   There are plenty of empty restaurants all over Kensington earls court and london in general.  This place packs them in for a reason.   Will go back for sure",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JHGXUr-m839Wu4UrfK98qQ"
  },
  "izV_3I97tuaU3l6dS2XSug": {
    "date": "6/22/2014",
    "text": "Our meal got started on the right foot, salad was good, and they quickly brought out our children's food.  Then we waited, and waited, and waited, until our children went postal.  Our waitress ate her dinner had a smoke and another waitress came to our table and asked us if we wanted desert.  We explained to them we wanted our dinner before we had dessert.  For our inconvenience they graciously gave us three lollipops.  On a positive note they were delicious",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3yR6xRVsUylSWHbMKTMbA"
  },
  "IgihWo2cQ2s4GHb6mF5GDw": {
    "date": "11/25/2012",
    "text": "Amazing place, went there after checking out ratings on Yelp and was not disappointed it was affordable, delicious, big portions and excellent service! A must do if you are in the area!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-iYyBxCEJYQfpJEcKXXdHA",
        "caption": "Photo of La Pappardella - London, United Kingdom. Mmmm again",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-iYyBxCEJYQfpJEcKXXdHA/o.jpg"
      },
      {
        "img_id": "C5ko22G72qwfFdBvpF7Y4A",
        "caption": "Photo of La Pappardella - London, United Kingdom. Bargain lobster",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C5ko22G72qwfFdBvpF7Y4A/o.jpg"
      },
      {
        "img_id": "pg9aFq5BNMVuTNFKcnCcCg",
        "caption": "Photo of La Pappardella - London, United Kingdom. Mmmmm lamb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pg9aFq5BNMVuTNFKcnCcCg/o.jpg"
      }
    ],
    "user_id": "WsXZSZ-Zxqo2HIdvh7b4hw"
  },
  "gcSXWGYEXajhE4NtAb0syA": {
    "date": "11/21/2010",
    "text": "I thought this place was just fine. I had a steak with mushrooms. I thought it was well-enough executed, though not particularly memorable. Gluten-free notes: There are a decent number of gluten-free options on the menu, though not the pizza. One time I went by the restaurant, the waitress mentioned that while they do not have gluten-free pasta, they would probably be willing to cook some for you if you brought your own. I haven't tried this yet.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "Mja7HGgRDjDsMLIpW_dV7w": {
    "date": "9/2/2011",
    "text": "This is not fine dining but it is a great neighbourhood joint.  I live closeby and eat here a few times a month. Most dishes are good enough for a quick weekday supper, be they pizza, pasta or the meat mains. Many of my Italian friends also regularly dine here  As the other reviews have mentioned, it's pretty good value.Gets my vote!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0x1bkKr058NHXTPMA4-qA"
  },
  "emnKlmoF9KGyzZay211E4A": {
    "date": "12/16/2012",
    "text": "Quattro stagioni pizza - 8/10Cookie ice cream - 8/10",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S6RUcwwLAM8obPpR7nbcnQ"
  },
  "puMV_mVvrPHB16zOYsNTYQ": {
    "date": "2/16/2014",
    "text": "I give them solid 4+ stars. Its inexpensive non-pretentious place, large portions tasty Italian food. We usually go for pasta and avocado/tomato salad. Good stuff.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8rCcckCSezSkZsigSTMQYA"
  },
  "xvOjFvgS_Po2Zv7Revplxw": {
    "date": "9/19/2012",
    "text": "Great Italian food with massive portions, decent prices and a huge selection of pizzas, pastas, gnocchi, dessert, wine, etc.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hiNTcufLrudnG8lXKWeW3w"
  },
  "d4w_DJhybdCtkP-bGfpygg": {
    "date": "2/24/2013",
    "text": "Great food, great service, friendly wait staff, large portions, decent prices, warm Italian atmosphere. We had salmon, gnocchi and penne with sausage and all were delicious. No bread or salad included to start (maybe we just do that in US) so we had room for dessert which was also delicious. Very nice evening out!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdPueJ4cR9OTg6gGauKldw"
  },
  "yYv3V53w72l3UtlauP3tNw": {
    "date": "1/16/2013",
    "text": "Just ate at papardella late on sunday night. We just got to our hotel from the airport and were starving at 11pm. We found this place at about 11:30 and they were about to close but they were nice enough to let us sit and order. We ordered a vegetarian and a margarita pizza. our order arrived within minutes and the food was amazing....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v5dANn77YxBWj2QYcj9low"
  },
  "FEEjolmDd73sqO9Nkuo_hA": {
    "date": "3/8/2013",
    "text": "If you like good old fashion, traditional Italian fare then look not further. From the huge personal pizzas to the outrageous calzone you will not be disappointed by the specialities here. Pasta with fresh seafood or a vegetarian option all promise to remind you of strolling the cobbles in Naples. Try the brownie and ice cream dessert if you have any room. Molto Bene!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6WGW2D2g_NzOjFvUwA22vg": {
    "date": "6/5/2010",
    "text": "My favourite Italian restaurant! Forget Jamie's Italian and Carluccio's eat the authentic Italian food cooked and served by real Italians.The taste of the food is everything - it takes me straight to Italy - it is delicious, the portions are generous and the service is......almost always good but sometimes suffers an authentic Italian 'blip'!The pizza is great, really Italian, and the pasta has great depths of flavours. Go for one of their specials and you will not be disappointed. I have gone back again and again and it has always been great - and certainly cheaper than the air fare to Italy. If you love real Italian food you will love this restaurant. Lastly, there are always lots of Italians eating here - that means something!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Kn4pKpa4RYQbyWpotKV2Bg": {
    "date": "4/19/2011",
    "text": "We paid this restaurant a visit last weekend ,We only wanted a quick bite and a bottle of wine and were very happy with our meals and the ambience of the restaurant. So much so that we returned on our first night from holiday,There were four of us this time and we had a couple of starters, a main each, 2 bottles of wine, water and a dessert. The food was wonderful, full of flavour and fresh. On this occassion we were also offered a complementary bruchetta before our mains . We found the staff to be extreamly friendly and welcoming.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wxzLfuKgAX2sAjbDzyH2Gw"
  },
  "jBUPw2qIzRyrswTole6v1Q": {
    "date": "9/24/2009",
    "text": "The category of this restaurant is Pizza, but it is so much more and from what I could tell of the pizza (limp crust, poor toppings) it might dissappoint.  But this eatery in the crowded Earls Court area is really worth a visit if you are out and about west London. I would put the pricing as moderate, though dinner for two is easily over 200 USD if you are going to have wine (I had Pinot Grigio that was excellent, dry and crisp with none of the fruity aftertaste of the PGs in the states). The service is very friendly, big open italian smiles, and just plain nice. Here is what I had: the Insalati di Mare (very light, just the right portion, the clams and shrimp where a bit tough, but overall a nice intro to the meal), followed by the scallopina porcini which was recommended by the waitress.  This veal came in a wine porcini mushroom sauce that was fantastic. Also came with a spinach \"cake\" that was merely steamed spinach formed in a round cake shape.  Still good but underdelivered my expectations. I had the cheese assortment for dessert and take home fare. Overall, I loved the place. The atmosphere was big city, that is you were up against tables on each side with about 10 in of room between tables. Not NY \"close\", but still close enough to eavesdrop on several conversations in English and Italian. Ver entertaining.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c1LmkHeWbwIoLgW6a63UiQ"
  },
  "s_tha7JJ855DSs6-Ah95eg": {
    "date": "8/29/2010",
    "text": "I agree, this place is so much more than pizza.  I was pleasantly surprised with the quality of the food after seeing the chain-like menu.  The portions are large, even the starters and salads.  My favorite is the tuna and white bean salad.  The bruschetta is full of ripe tomatoes and garlic.  The limited outside seating is a prime spot if you can score a table.  The service is friendly and swift.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B8jMM7vimBE-PlZkxqonfw"
  },
  "eLTq2fFmgCJrIBnZWoNoZg": {
    "date": "9/25/2015",
    "text": "Great neighborhood spot!  Just a few outdoor seats and a cozy interior makes you feel like you're in Italy.  I had the broccoli pasta and was blown away with the portion size.  I made 2 FULL meals out of it.  The noodles were perfectly el dente' and the sauce was light and refreshing.  My husband had a pizza in which he was very satisfied with.  Again, HUGE portion!  He was able to stretch his pizza to 2 meals as well.  I think their prices are super reasonable for what you get.  Lucky for us, it's right down the street so we'll be back many times!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "MiSm1KR7hKSM1lhNOCkIwg": {
    "date": "1/10/2017",
    "text": "My wife and I arrived in London late, and were looking for a place to eat. Found this little gem, and gave it a try. We had a prosciutto pizza, and it was delicious. Paired it with an Italian beer they had, and it made for a pleasant meal. Feels very cozy, the staff was nice, and definitely worth the time and money spent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJnP0JUWpcnCn5tA8feCRQ"
  },
  "OCKjfDEZAwLOqBvMCBpYgg": {
    "date": "7/4/2014",
    "text": "This little Kensington neighborhood Italian restaurant is a gem.  We were fortunate enough to dine on multiple evenings and tried many different items on the menu.  The pappardelle pasta with seafood was superb as well as the artichoke and spinach pizza. Both were right out of central and southern Italy. The spaghetti bolognese was strong and appropriately balanced. The desserts are something that is very surprising.  Simple, but elegant - vanilla or hazelnut gelato with amaretto or Nutella. I know what you're thinking -- doesn't sound that impressive. Read: this is reason enough to go here! Spectacular! We finished every meal with a delicious lemoncello that was the perfect digestive. Another absolutely awesome part if this experience was the staff. Attentive and polite --- great reason to have dinner here for a special occasion. So why not 5 stars? Well the minestrone soup was slightly weak and under salted.  One veal dish was slightly dry and would have benefitted from a sauce. But don't let these two things take away from this Kensington star. You will not be disappointed.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hEWk7DcU3bbSG8xhHGdD-w",
        "caption": "Photo of La Pappardella - London, United Kingdom. Amaretto affogato",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hEWk7DcU3bbSG8xhHGdD-w/o.jpg"
      },
      {
        "img_id": "HLuMBBeItgdbc1ZILbgirw",
        "caption": "Photo of La Pappardella - London, United Kingdom. Nutella Affogato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HLuMBBeItgdbc1ZILbgirw/o.jpg"
      },
      {
        "img_id": "TTrmuL_TgHNnCF1YncheNw",
        "caption": "Photo of La Pappardella - London, United Kingdom. Pappardelle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TTrmuL_TgHNnCF1YncheNw/o.jpg"
      }
    ],
    "user_id": "JY2lt9NNb7P3ngiMPpojBw"
  },
  "Pv7LaCkTKqT0W3fb5uUfhA": {
    "date": "6/2/2014",
    "text": "The first time I came here I quite enjoyed the pizza. The meat that was ordered (veal with mushrooms and another veal dish) were completely terrible with bad cuts of meat and over cooked mushy mushrooms and tough meat. I thought to myself, people must only come here for the pizza.Upon my next visit... I was even more upset when I left. A friend and I ordered two different pizzas, we waited a very long time for anything to come out even though everyone else around us was being served very quickly. When food did arrive it was a pizza cut in half on two separate plates. We informed the manager that this was not our order. He came back three times to confirm what the correct orders where and we waited. The food then arrived about 15 mins later. One pizza was what was ordered but the other was the same two sides of the pizza COLD and just placed together on the plate. He was upset when I requested a fresh pizza. Unacceptable.When the new pizza did arrive half of it didn't have any cheese on it and it was under cooked yet burnt at the same time. I am very sad to say that I actually paid for this meal although I ate hardly any of it. The corner shop supplied the rest of my dinner. I want to like this place, as I live about 1 min away. But alas it was not meant to be. Seeing as there are so many Italian places on this street, I would steer clear and go somewhere else.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdTzsZcoyzKdSz21SX_YyQ"
  },
  "ktuRnMityskbCe85AOYwEw": {
    "date": "10/19/2016",
    "text": "Delicious food, exceptional service. The staff was very attentive, especially considering how busy the restaurant got. We ordered the pollo pappardelle, four-cheese gnocchi and a pizza. The food was fresh and the portions were hearty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XzUEeS8r0ERRKVMj9lG3RA"
  },
  "er1OhFScMoO2xTA5QNJwWA": {
    "date": "4/4/2015",
    "text": "I came here last night and was quite satisfied with the whole experience. I had a pizza, which was quite good, so I can't comment on other dishes. The pizzas are huge, so I'm glad I skipped appetizers. Even though the place wasn't that full, they asked if I had a reservation. I had made one a few hours prior. Along with the pizza being good, service was prompt and friendly. I would definitely come back when I'm in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uakgOcR6tbBQXxCuKSjfw"
  },
  "jzRJa5E9sXhTgSy12F4TVg": {
    "date": "6/25/2016",
    "text": "I thought this place was average. Nothing special about it, big portions. It didn't seem like a place where regulars frequent.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNvMxd67OgkARAAeDWu0qA"
  },
  "kg-xmj4p0OMfjBCynCSUyQ": {
    "date": "4/7/2015",
    "text": "Used to come here often when my girlfriend lived nearby and really liked the food. Well, things change. The girlfriend is now my wife and La Pappadella is now not so good.  Id chalk it up to a one time failure but it was an ingredients issue more than preparation. The cheese on the pizza was of such poor and tasteless quality that neither myself nor my wife enjoyed our pizzas whatsoever. I'd give 1 star but I didn't throw up.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "NQgOwPcpchVNoTLjICaIUw": {
    "date": "12/7/2013",
    "text": "It's a friendly place with good service but the fettucini I had was undercooked and the sauce was uninspiring.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "b-fP5XcqMMI4dhp4bAxRrA"
  },
  "UftQRAb4OAvfL4d7h0DfHw": {
    "date": "8/11/2016",
    "text": "The loudest service I ever seen. Italian normally have smile faces except this waiter whom I think their boss . He is stupid. He thinks he is the best but he forgot that most of London is Italian restaurants. Food is ok not the best and price IA lit bit high. In general I do not recommend it since there are a lot better food and service with same price. The owner should be aware about the negative reviews if care about improving income.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xQjfCc1DknT3gOx9DlCvJw"
  },
  "bFfzbjHHpKw1M3-v-VgM0A": {
    "date": "8/2/2014",
    "text": "Upon a recommendation from the concierge my girl and I walked a few miles to check it out. It's a cute small cafe style with maybe 15 tables . The wine list was nice and we picked a barbera for 23$ . Started off with the antipasti misto which was also tasty. Moved on to the carbonara which we split . It was filling and the pasta was al dente and the sauce was sticky ( in a good way) then it was pizza time and the crust was thin and perfect and the sauce was tasty . Well we couldn't stop there so we ordered some gelato with limoncello , a panna cotta, and a cappuccino. We devoured them like children and was now stuffed . The owner brought us  some limoncello shots afterwards and it capped off our first night in London.  Laura was our server and she was fantastic but all the girls were pretty helpful and teamwork was inspiring.  next time in London we will be back !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-vVpP4wiusRl02Dvnf-9MQ",
        "caption": "Photo of La Pappardella - London, United Kingdom. Delicious pizza!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-vVpP4wiusRl02Dvnf-9MQ/o.jpg"
      }
    ],
    "user_id": "03wL-2E7_xPX2D5DrQM9TQ"
  },
  "RRzQdxoMmsoYfg3B_BHUog": {
    "date": "6/18/2014",
    "text": "Oh my god that is the most amazing beat some of our heart it's so delicious if you got here try the Hawaiian pizza Jeffrey my friend pepperoni spicy pepperoni pizza with bacon my other Tony Best Buy Best Buy in like the motorcycle Michael had the margarita pizza he loves it isn't that trailer is touching themselves and appropriately after you eat the pizza",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nHbK4pena7ysepulkKy9PQ",
        "caption": "Photo of La Pappardella - London, United Kingdom. Margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nHbK4pena7ysepulkKy9PQ/o.jpg"
      }
    ],
    "user_id": "vCUEFX30RTkUozUOOwgHIA"
  },
  "5_qQ_pdpUKBvilk0ZM4ioQ": {
    "date": "11/24/2016",
    "text": "We love this place.  Great Italian food, great service.  When we're in London, we hit this place every other night.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnWVm-0Mqm-KZPg8vdfzRw"
  },
  "0MkC2x_7r4IY4zjdfHOZow": {
    "date": "4/27/2016",
    "text": "Honestly, this was a little disappointing. Based on the other comments I was expecting great pizza, but it was pretty average. The focaccia wasn't your usual focaccia (it was flat and tasteless). Overall not a bad experience, I think it's just a matter of expectations: this place offers OK pizza, so go with that idea and you'll probably have an acceptable experience.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olQsB8umLN3QyMtUVZSz9Q"
  },
  "PaIcRgiLOWUKuWH-jFymTw": {
    "date": "6/7/2014",
    "text": "Wow - lamb based pasta w/ noodles was awesome. Can't say enough how good it was. Others had pizza (4 cheese), bacon, garlic and cream sauce, and pent a Ala chicken - all agreed dinners were excellent.Next time in London we'll be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBkFSmKKv8kxQeUtl43IMg"
  },
  "bG4-bEj6fKwxY1YNOBE6dg": {
    "date": "8/11/2016",
    "text": "The staff is very very very bad specially the one who put rap for his hair and wearing glases.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G0EJkepStLw-TCWg-wwNpA"
  },
  "hcAiSQC4w4-lwC7_jO2q9w": {
    "date": "3/20/2015",
    "text": "Loved it! Absolutely worth the value. Great decor, and the food was delicious. Meal for town with alcoholic drinks included came out to £30. Not bad!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yQ6oEHn3-SR-lLvO1fQTjA"
  },
  "0MiSumVVCty6Zm2eQT7lAw": {
    "date": "1/3/2013",
    "text": "My first meal in London was such a memorable and delicious one, thanks to La Pappardella. This quaint little Italian eatery had such character and I loved that the majority of diners seemed to be regulars. The waitresses on staff that night were both attentive, friendly and Italian speaking. They answered any questions I had, and made the experience a great one. I ordered the gnocchi with tomato cream sauce and basil. The gnocchi was perfectly cooked, and the sauce was a wonderful complement. I was full after eating half of my meal, but it was so good that I finished most of the gnocchi on my plate. I had read a review raving about the chocolate souffle dessert, and decided that I must have it... for research purposes, of course. :) It was delightful. The richness of the chocolate was paired perfectly with the sweet neutrality of the vanilla ice cream.All-in-all, would I go back? Of course! I intend to! Would I recommend to friends? Absolutely!Happy Dining!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ll5l4WTKPH7zWQWA68Rhdw"
  },
  "yn2DOxLErU6BqKCwZ1h8PA": {
    "date": "11/4/2015",
    "text": "First impressions were not good, it was uncomfortably hot, the starter was disappointing focaccia rustica, expensive and tasteless. My main however was nice Pappardelle pollo e funghi selvatici, and my partners Carbonara was good too. Such a shame there was no air con!!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYpyPwNy4vWhLKpt1eFPaA"
  },
  "9cCf6DaB6brVialM211u7Q": {
    "date": "4/15/2011",
    "text": "For an Italian restaurant in London, this place is rockin'! The prices here are great. as everyone else mentioned, they have a lot of pizzas, but there are tons of other options. I was looking around the restaurant and saw lots of people ordering pastas, main courses, and of course, pizzas. I went with a colleague and we both got the same dish: Tagliatelle _____ (bacon, cream sauce, and some other items -- can't recall!). It was awesome. The portions are HUGE!!! All of the portions for most all the dishes are HUGE! You can definitely split one dish with another person. AMBIANCE: Loud! It's not a place you want to take a date for a nice, quiet dinner. This place is casual, loud, etc. It's a place you would go with friends to have some drinks (wine/beer) and pizza or a snack to eat. Also, the place is small (though I believe they have two stories), but it has a lot of character. SPACIOUS? You are almost sitting elbow to elbow. There's enough space for one body to fit through to be seated near the wall. You're fairly close to those next to you and if you listen very, very closely (amongst the noise!), you might hear something .... but you'd have to listen hard! Also, I saw a couple tables where you could have up to 6-8 people seated -- at least on the top floor. They may have larger tables on the floor below, but up top, you could have 6-8 people seated. Prices are VERY reasonable for London. Our still water was about 2.5 GBP (approximately). Our dishes were about 8-10 GBP for the pasta dishes. The pizza dishes were approximately 8 GBP (give or take). DESSERT: We also ordered the souffle (chocolate, with liquid center, whipped cream, and vanilla). It was very good. I believe our neighbors saw us eating it and ordered some as well. Oh, their house wine today (I didn't pay attention) was pretty good. a red house wine -- if you like dry. All in all, the food was tasty, portions huge, and value was great. Would definitely go again and would recommend to others. OH YEAH. I remembered. Our server didn't speak English too well. She had to go and get another server (time after time). I wasn't too bothered, but it slowed down our service time some.... when we first arrived, I could tell the people sitting next to us were waiting. They must have been waiting awhile to order their food. They contemplated leaving because they weren't getting good service. Eventually, they left. The people are extremely helpful and friendly, but the speed was not so great tonight. They're friendly people and enjoy people ... but they're not so quick to serve. They're having fun chatting it up with folks, too! Soooo, I wouldn't go expecting for the servers to be at your beck and call. (i.e. thats why I would say it's a \"casual\" place...)Hope this helps....!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8YmRAiqxnXTdSmBiQp-BFQ",
        "caption": "Photo of La Pappardella - London, United Kingdom. Chocolate Souffle - great.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8YmRAiqxnXTdSmBiQp-BFQ/o.jpg"
      },
      {
        "img_id": "KP7gkexC6dZdWy_1XxSszQ",
        "caption": "Photo of La Pappardella - London, United Kingdom. Tagliatelle - HUGE portions (enough for two); great taste; great value.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KP7gkexC6dZdWy_1XxSszQ/o.jpg"
      }
    ],
    "user_id": "kdLGCFPWc1meyVPOeKPWng"
  },
  "sIxfUYyVaY6uKilh_sj90A": {
    "date": "11/2/2018",
    "text": "Came here for my last dinner before heading back to the states.  Located a few blocks from Earl's Court metro station it is very easy to find.  The establishment has seating on ground level as well as additional seating in the basement.  Noticed several other Americans were dining as well which might explain why they played 50s American music throughout my dinner.  No complaints about it but found it interesting that I was in London eating Italian food and listening to mid-century American music.  Menu was comprehensive and covered the highlights of Italian cooking.  After some internal deliberation I ordered the Four Cheese Gnocchi.  Plates are prepared by the cook in the basement and sent up to the ground floor using a small elevator which I thought was unique and inventive.  My order was brought to me within 15 minutes of placing it.  Gnocchi was cooked correctly, light and fluffy, and the four cheese sauce was very flavorful.  My only critique would be the shear amount of cheese sauce was too much. The gnocchi should be the star of the plate but it was served in a way where the sauce stole the show.  Nothing big but something to consider.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qNB021aIys7N1SRbKbXfiA",
        "caption": "Photo of La Pappardella - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qNB021aIys7N1SRbKbXfiA/o.jpg"
      }
    ],
    "user_id": "fWgfPh00KaFGtExBc6wC5g"
  },
  "4cIU3Wt8eiON7p4iZbeFDA": {
    "date": "9/26/2018",
    "text": "Great menu. It was the last meal before we left London. Ate on the terrace. I posted a photo of the bolognese....it was hella good! Very well seasoned and good portion size. Fun staff. Medium sized location but the ambiance was great.  Very nice overall and I will definitely be back if in the area again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oiAA4WSdjuZLQRZsUcUQkA",
        "caption": "Photo of La Pappardella - London, United Kingdom. bolognese......so great!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oiAA4WSdjuZLQRZsUcUQkA/o.jpg"
      }
    ],
    "user_id": "t2e8bLbRjcXG1H_xam4Ljw"
  },
  "QCD5j5QnsFZjA8Q9i5P_2g": {
    "date": "11/12/2018",
    "text": "This was honestly a really big let down. It has so many great reviews! :( We ordered the Carbonara & a chicken & broccoli dish. I was expecting great Italian food, but I have had better \"Italian\" at Olive Garden. The staff was nice and so was the wine, but the carbonara was flavorless & the chicken was boiled, AND the bruschetta was soggy. Very disappointed.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwJdsEIMukbIaeVFcpcb0Q"
  },
  "VR6X917w8l8YSi9lstZBKA": {
    "date": "10/29/2018",
    "text": "Great pizza place near Earl's Court station. Friends and I ordered one appetizer, 3 pizzas, a pasta dish, a bottle of wine, and a dessert item and our total only came shy of £90! Great service too! Place gets packed later in the night...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uS-HIAg3CdrySJcTExL5dw"
  },
  "kdx2CLxCJDIPfsKcC0hDpA": {
    "date": "10/16/2018",
    "text": "Excellent handmade pasta and friendly, attentive service. The pappardelle with pork belly was hands down one of the best pasta dishes I have eaten, the lamb pappardelle was also excellent, and the gnocchi were light and airy. We had a party of 6, including an 11 and 13 year old, and all were extremely happy with their dishes. If we are ever back in Kensington we will definitely return.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PeS-TNyXH050t9ZaZmDTvQ"
  },
  "aHyy5kiq4BY7-KXWJHAs7g": {
    "date": "8/19/2018",
    "text": "Amazing Neapolitan pizza, Spaghetti with clam sauce, lasagna, chicken Milanese and my daughter was literally licking her bowl of pasta fagiole clean!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3P4LiGqwr698YsbNV9fpAw"
  },
  "EuSLidI14hddMQG5z7MoIw": {
    "date": "1/22/2017",
    "text": "My mum recently sent me a list of places to get good pizza in London and I noticed that this place was just down the road from a meeting I was set to have. So sure enough after I was done I decided to come here for a late lunch and try it out.I had the garlic and tomato pizza bread as a starter, which I probably shouldn't have ordered since it was like 5 quid for some dough with tomato sauce on it, which even though it was tasty, just wasn't really worth it and really quite large. My main course was a lot better though!! I wanted to try a pizza but I noticed they were just one standard size which was just too much for me to eat at that time, so I ended up having gnocchi with the tomato sauce. That was ALSO quite filling and I couldn't quite finish it!! But it was really tasty so I was pleased all the same. Although I'm not sure if the gnocchi was freshly made in the restaurant since they all looked so uniform... I mean I'm sure the sauce was freshly made but I was a little disappointed as I noticed they had a \"fresh pasta\" section on the menu as well as regular pasta... The fresh section didn't have that much variety so that's why I didn't end up getting one of those dishes instead. I ended up taking my leftovers home which was a solid plan since I ended up eating them later that night... heheheh.... All in all it's a nice place but I wouldn't come out of my way to eat here. There were lots of children when I went as well as people who were eating on their own and doing work, so it's definitely a nice casual place to go if you're in the area!!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vSmgbMNdSyMCg30t00j1Eg",
        "caption": "Photo of La Pappardella - London, United Kingdom. Garlic and tomato pizza bread - starter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vSmgbMNdSyMCg30t00j1Eg/o.jpg"
      },
      {
        "img_id": "I3LFVu8GoFq_VgJKQAf8sg",
        "caption": "Photo of La Pappardella - London, United Kingdom. Potato gnocchi in tomato sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I3LFVu8GoFq_VgJKQAf8sg/o.jpg"
      }
    ],
    "user_id": "BYhuZMo5N2EgnMqRL8VeHg"
  },
  "LaGYsncgoSZMFxpmJormQA": {
    "date": "3/16/2018",
    "text": "As an Italian person, I can't give a better review to this restaurants. Despite the warm service of the staff (all Italian young people) the food was absolutely atrocious: we ordered a \"mushroom risotto\" which wasn't a \"risotto\" (there is a proper specific technique to make risotto) but some sort of boiled rice with a red tomato  sauce (bad tomatoes, closer to ketch up than Italian sauce) with some cheap slices of mushrooms you couldn't even see. No taste, other that this awful tomato paste sauce. We couldn't  believe it. I didn't want to argue so just asked for the check and one espresso, thinking \"they are Italian, at least espresso will be good\" and I was wrong, it was as bad as an espresso you might get at an Irish pub. I rarely post reviews but I strongly believe restaurants have a huge responsibility because they play with our health, not just with a simple \"night out\" with friends. This restaurant doesn't serve authentic Italian food and definitely not healthy, good, tasty, well made food. Stay away !",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HAREDSjn5fHYtPrwEXCew"
  },
  "_vI7dsJKFzG8rsB04-kJOQ": {
    "date": "12/11/2016",
    "text": "I've passed by this place a number of times and glad I finally tried this place for lunch.  It gets really busy on the weekends so highly recommend booking before you go.To start - we had the olives and focaccia.  Simple and really good but should've listened to the other reviews as it filled me up to barely touch my main.I really wanted pasta and the papardella with stewed lamb looked like a good option.  I love homemade (well restaurant made!) pasta and the lamb was so tender.  The sauce was delicious.  Portions are huge but they are happy to pack the rest of it to go if you want.I had lunch here without the kiddo - one of the tables managed to squeeze a stroller in but not the best of baby friendly places.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "_bo0ss_RXMqiaoGKbd5J4Q": {
    "date": "1/7/2017",
    "text": "Absolutely solid place for your Italian fix! I ordered delivery on multiple occasions and on all, it did not disappoint. Pizzas are authentic, the starter of mussels is reasonably priced yet healthy in portion and pastas are mouth-watering solid. Whilst I have not been in person to comment on ambience or service, the food always was delivered on time and in good packaging. Very reliable overall and would not be surprised if in-person experience is just as good. Would love to pop by in person one day. For now, it shall remain as one of my go-to delivery places!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "qZl6OXtfe0OJy07-jIGcBA": {
    "date": "1/15/2018",
    "text": "The food is amazing.  The service is slow as snails!!! I would return.  The owner upstairs micromanages so it slows upstairs service.  Carleeto downstairs is prompt and quick.  You unfortunately need to speak up to get just about anything.  Once you get it. It's well worth it.  Great food always. Wins!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "me1cfNVvUJGB0Xa89eakwA"
  },
  "Vsgwhy6Vl-Uog-QeG2wZ3A": {
    "date": "7/16/2017",
    "text": "Great local Italian place, that was busy every time we walked past.Popped in for a dinner and were not disappointed. Friendly service, good food and a good price.Had the stewed lamb pappardelle pasta and the braccio Di Ferro pizza. Both were generous servings with great flavour.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RAa8Qvob6yuoWGqn01glWQ"
  },
  "Q-QYlbYd_CfJ0nQrLcI3QA": {
    "date": "1/23/2018",
    "text": "We followed the nice Yelp reviews this place already had, and booked a table for 9 people for dinner with some friends on a weekend in London. And we were not disappointed :-)The food, the wine, the desserts, the atmosphere, the service - everything was just great!!!I hope that I will get the chance to come back to this place some time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4-RdjIit_hlm6u1nu3mbg"
  },
  "7bMJ5_MfnUgM43hKeTUXuw": {
    "date": "2/19/2017",
    "text": "I've been patronizing the gem for about 15 years of more. It's had a couple facelifts and menu changes. The old charm of sitting in a wine cellar are gone. The quaintness has vanished. There are now more customers in the same tight space. While the food has remained consistent and quality good, the atmosphere has suffered. I have always enjoyed the service. Not a place for a romantic dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2-Foit7hcvSeNZHPC1OgmA"
  },
  "2LFDFD2MJkcUAmMG7LVizQ": {
    "date": "4/13/2016",
    "text": "Another great meal in a great little Kensington resturant. I have been to La Pappardella many times when traveling to London on business.  Its is a nice \"smart\" casual, but pleasant environment.   They have sidewalk tables for weather friendly evening, dining area is a little tight but not bad, and pleasant downstairs room that the room opens up on nice evenings creating a fantastic ambience. The food is some of the best classic Italian I have ever had.  The Tiramisu is the best I have ever had.  Best of all is watching the Italian waitresses... just be a family of Italians.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zxGdMM5dRaFBvxCvC47XUw"
  },
  "99Efo0Jt8j8kk1KNAqkB0w": {
    "date": "9/14/2017",
    "text": "Lovely traditional Italian restaurant. The pizzas were great, as well as the starter goat cheese dish. We visited twice in one week and I also tried the bolognese - -great. Would definitely return.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mp1eNcF2KK-H79jIi6Pjfw"
  },
  "1wRuC23JzmVRQlpvfjmkjQ": {
    "date": "5/25/2016",
    "text": "There's a lot of mixed reviews here, some are great some are dire. Well I can honestly say I had a solid 3 star experience. The exterior doesn't look particularly appealing, but on walking in, it's quite a trendy looking place - I mean nothing amazing but it's a nice looking restaurant.Service was quick and attentive, there's lots of Italians working there, so you'd expect it to be pretty decent. I got a spritz - I prefer mine a little sweeter but it was nice enough. We ordered one pizza to share as we weren't very hungry. They were thoughtful enough to cut it in half and serve it on two plates without us asking, and the pizza was huge! I'll admit it wasn't the best pizza I've had (I lived in Italy for a year and a half, so my standard of Italian food is now pretty high) - however I would come here again if I were in the area.Overall a pleasant meal and experience - but nothing mind blowing or special.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Ge372SNSBFGvwo0Uld2bA"
  },
  "1WfdTGMM-s7HFxLN5xtr1w": {
    "date": "8/21/2016",
    "text": "If you haven't noticed based on a lot of my check ins/reviews, I love a good traditional pizza. Going on other reviews and pictures I decided on my latest layover in London, to pop on in to La Pappardella. Thankfully, it did not disappoint. I went with the Burratina pizza, which was quite tasty. Service was prompt and friendly and prices were really reasonable/quite good. The size of one pizza could easily feed just one person if you are hungry enough (as I was!) or could be split between two for a lighter/quick bite. I rate it 4 out of 5 stars as a solid choice for a nice Italian meal with good prices and service. I will be back. Bellissimo!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wGLEyrMT2QOoU6BNyPMR-g",
        "caption": "Photo of La Pappardella - London, United Kingdom. Burrata Pizza--burrata cheese, cherry tomatoes, mushrooms, fresh basil and shaved Parmesan. YUM.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wGLEyrMT2QOoU6BNyPMR-g/o.jpg"
      },
      {
        "img_id": "5brO6jfwla7ffLBm69uLoQ",
        "caption": "Photo of La Pappardella - London, United Kingdom. Menu (4)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5brO6jfwla7ffLBm69uLoQ/o.jpg"
      },
      {
        "img_id": "dqRHnsw0hG5_fkcKynUJVA",
        "caption": "Photo of La Pappardella - London, United Kingdom. Menu (3)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dqRHnsw0hG5_fkcKynUJVA/o.jpg"
      }
    ],
    "user_id": "ZkJdOOQtyhrwOH9MfgPQrw"
  },
  "FNXRihPjifZsUeiBVBr4eQ": {
    "date": "7/12/2016",
    "text": "I'm from Chicago and this was some excellent pizza! Thin crust. We were at the science museum for the day and walked here for dinner. Definitely worth the walk. Prices were decent as well. Service was attentive until it got busy. Then it got hard to find the waitress. It was family friendly for my 7 and 8 year old.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T44DSsRnlbWtAY6OOiqcSw"
  },
  "6_Bc_VWrRPnWnmXUhhHOPg": {
    "date": "8/23/2016",
    "text": "Favourite Italian restaurant ! Great food , great price , always cozy and friendly ! :) x",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sA2curqXPXiYNz_oiiJHew",
        "caption": "Photo of La Pappardella - London, United Kingdom. Perfect gnocchi 4 cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sA2curqXPXiYNz_oiiJHew/o.jpg"
      }
    ],
    "user_id": "1vwsEhADMDw86Gv4dd__UA"
  }
}