{
  "oNB6u7JlW1lVHG3xZXsang": {
    "date": "4/16/2016",
    "text": "Came here last May with a classmate because we were hungry, lost, and confused on our first day in  London. It was a fun experience grilling our meat to our own liking. It was pretty pricey though, with my tab being £24. I didn't order that much, so not sure what went wrong there. They were very nice and helpful to us Americans. It would be a great place to socialize for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q4OdVeFhhTp0xaBTYAzc5g"
  },
  "Kt0opSG6GnFaOC91IOLADA": {
    "date": "1/14/2016",
    "text": "Basically Gyukaku but I don't mind since I love Gyukaku. I really liked this place, I've been looking for yakiniku in London for years!I ordered the short rib kalbi, the spicy pork, and the spicy chicken. Spicy pork was my favorite, its fat dripping down the grill was the most beautiful sight I have seen in a while (I know, pork fat and beautiful usually don't go together). Also ordered the garlic chicken noodles which came on a hot plate and sizzled into the crispness I prefer as I let it sit. The mushroom in butter was simple but delicious and I loved the soondobu!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "vZER7b7QcuRy96itQlDnIA": {
    "date": "1/4/2016",
    "text": "YES! YES! YES!!! Or perhaps I should say HAI! HAI! HAI!!!!I was feverishly looking for a Japanese place that served more typical japanese things and not just sushi and after exhausting the first 100 results that came up on my Yelp mobile app, I came across Kintan and to my surprise, this place was Meccha Umakatta!!! (Super Delish!!!) It's a Yakiniku joint and if you've never been to one, you basically order a bunch of different types of marinated meat and you grill it yourself in front of you; very similar to the Korean BBQ places. In addition to the meat party, you get a whole bunch of sides like karaage (my fave), takoyaki, hiyashidofu and gyoza. Don't know how to select??? No problem!! They also have set menus!!! But if you are already familiar with Yakiniku or you are with Japanese, they can help you out :) My recommendations for this place??? You got it!!1. Kalbi (actually this should always be ordered no matter where you are!!)2. Garlic Harami3. Beef Tongue (eaten with salt and lemon)4. Karaage6. Spicy Cucumber7. Sukiyaki Bibimbab (of course WITH spice!)Of course all of this can be downed with a bottle of Kirin Ichiban!!Now... let's talk prices... I didn't know this until we got there, but we were there for Happy Hour and let me tell you know, this time is VERY happy!!! It's not just a few select items, but most of the menu is up to half off!!! I couldn't believe it and I will only go here for Happy Hour since it's almost every day with Monday's being all day Happy Hour!! Does it get more happy than that!?!!ロンドンでは和食屋さんが多くて見つけるのは難しくないけど訳わからないドラゴン・レインボー・アボカド・マンゴロールみたいな変な寿司屋さんばっかりなんだからたまには普通の居酒屋とか焼肉の所に行きたくてこのキンタンっていう焼肉屋さんを発見しました！！ハッピーアワーがあるのでその時に行けば値段はそんな高くはないです。例えば生ビール£３、カルビ£４、焼きしゃぶビーフ£３。肉質が良くてタレも美味しくて焼肉を欲しいと思ったら是非ここにまた来ます！。。。もちろんハッピーアワーの時にね！",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "aXdEoQNovW88fvQxIsfjpw"
  },
  "n3adM79QrSLo3XTloIA97w": {
    "date": "7/12/2016",
    "text": "Went there for a lunch with my brother. I love the desert but not some of the meat in the set menu, should have order ones instead of set menu.The price is a bit expensive and didn't realise there is a £6.88 service bill at the end.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aCPjgxd0zIrhhgiFaT_ugw"
  },
  "T9_lNv3IfAeSS7_5Lnx5-A": {
    "date": "1/4/2015",
    "text": "One word for this new Japanese BBQ place:  yummy! The environment is very nice, modern and relax here.  Great place for a proper catch up with small group friends ( normally 4-6 ppls per grill table )Their meats are marinade nicely,  even their table sauces are homemade and super yummy.They are doing some set menu deals now and good value for money too! Surely come back for more!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VIMvkoFAdZsh0Fpzl8hTuw",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Bbq squid",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VIMvkoFAdZsh0Fpzl8hTuw/o.jpg"
      },
      {
        "img_id": "8EjLcaR8Dqarfu79cgY0xQ",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Bbq in action",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8EjLcaR8Dqarfu79cgY0xQ/o.jpg"
      },
      {
        "img_id": "WO4YLdXQn-1cN2VNiJERog",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Mixed meat set menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WO4YLdXQn-1cN2VNiJERog/o.jpg"
      }
    ],
    "user_id": "aCkPz2f-JRyHAIEehwhmkw"
  },
  "vEp99ywdztmogfm7TnBfrQ": {
    "date": "9/6/2016",
    "text": "Delicious food. The whole process of cooking your own (high quality) meat is super fun. The regular food is pretty good too and great value for money.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TbO4rGTxcZqWooDRe4xHCw"
  },
  "WweBubUxStmF1PMuurP-yA": {
    "date": "8/24/2016",
    "text": "Having just come back from Tokyo, I was eager to try this spot to compare.  For not being in Japan - I was super pleased.  Most of the staff is Japanese so I got to practice some of the  language (well the little) I picked up while I was there.  The lunch menu is set - and there was a group of 4 of us and we each chose 2 meats.  It was probably as close to Yakiniku you can get over here. The sauces were fantastic, and the cuts of meat were pretty good.  They even have a smore option to do over the grill!   I loved it and will go back when I'm craving some Japanese food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "gaTd82Vf4BaaAKW4ZCKa9w": {
    "date": "11/5/2016",
    "text": "Definitely the best Japanese restaurant in London! BBQ and chicken are really authentic!! Will come again!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UYvlRte_pHTAJdx3s9ZLSg"
  },
  "RB8c_gFxkbaSmWa_6lanjg": {
    "date": "3/23/2016",
    "text": "An affordable option for pretty authentic Japanese bbq in London. Their lunch specials are a really good value. If there are only 2 people their meat lovers dinner special has lots to eat an a good price. Plus it comes with smores at the end!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "sa5QTCqoUHRGrE_kK79IEw": {
    "date": "2/11/2015",
    "text": "Delicious! Very impressed. Although it's my first time trying Japanese BBQ, I do believe that the food here is authentic Japanese bbq, as I've noticed that most guests (I'd say 90%) in the restaurant are Japanese. Happy hours from Monday-Friday!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zYsTq9_5SF6uUMjXJ6_55Q",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zYsTq9_5SF6uUMjXJ6_55Q/o.jpg"
      },
      {
        "img_id": "oJr137D4hZhRmS3Y9wE8ag",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oJr137D4hZhRmS3Y9wE8ag/o.jpg"
      },
      {
        "img_id": "ItxKR6HPRET4yZ9giIeMbw",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ItxKR6HPRET4yZ9giIeMbw/o.jpg"
      }
    ],
    "user_id": "w8-EnrU5E_F_MddvlzY_uw"
  },
  "mvkwTrKcMa2I5GuSDpFSDw": {
    "date": "3/27/2015",
    "text": "We ordered the Kintan Course set menu for 2, which is a rather steep £39.50 a head. The benefit being that you get a bunch of signature dishes and it works out cheaper than ordering them separately from the a la carte.Our starters of Edamame, Miso Soup, Kintan Salad, brilliantly named Tuna Tartar Volcano and Garlic Fried Noodles all came first and all underwhelmed with the exception of the salad, which had a lovely soy, mustard, miso dressing. The noodles were very bland and uninspiring with hardly any veg or meat and the tuna tartar was served on a dense block of fried rice that tasted like a savoury doughnut. Off to a bad start.Then came the meat. Lots of meat.The Fillet Mignon, marinated in Yuzu Ponzu and the Garlic Tiger Prawns were first to hit the grill. Our very friendly waitress from New York advised on cooking times, which were all very safe. We ignored them and cooked by eye. Next came plates of thinly sliced and beautifully marinated Premium Kalbi Short Rib with Tare sweet Soy, Harami Skirt Steak with Miso and (bizarrely) two chunky slabs of Halloumi.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZ_3l6kV2vrwilDkd15WKQ"
  },
  "gXJBNnWzw0AVMLnavkdDMw": {
    "date": "5/1/2016",
    "text": "Food are really fresh!!!the one thing not good is there are not enough people to serve so the service is not efficient enough.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9j6_wECLEDKxaOSylY_-rQ"
  },
  "gWtf2E--mJYpHXK9OHENIA": {
    "date": "6/11/2016",
    "text": "I highly recommend this place! London is unbelievably expensive, but this place is a gem. If you come after 9 and eat at the bar it is incredibly cheap. Despite the price, the quality is great. I felt like I was transported back to Japan due to the quality of food and atmosphere here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pW4V26X8Ofdn-3wjGRqSzQ"
  },
  "UGin9NWYyLUYmtrgoNlV7w": {
    "date": "11/5/2015",
    "text": "I am pretty sure I have been here at least once a week since I moved to London.  This is bascially London's version of Gyu Kaku!  Grills are slightly different.  They are not adjustable so you are always cooking on high and since I like my meat pretty much raw I have to pay more attention.  After a few hot sakes I end up eating a little well done.  Great place for a super fun night!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pu4L_r5lyoX1nFEEJYPtvw"
  },
  "AzqEdTTDgjYqc6nMgjPWwA": {
    "date": "9/8/2015",
    "text": "Very nice atmosphere and fun meeting place for good cuts of meat grilled at the table.  Nice selection of cuts and the accompanying sauces are very flavorful and tasty.  Service is good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wP2_MvxVmJrncxuYkeoRZA"
  },
  "5HpcaS6cACSus8fgFiReOw": {
    "date": "10/30/2016",
    "text": "I turned back after the horrible attitude from the hostess. Can't have the first person you see be so unpleasant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLbklk3hBnX1pSJtUKguCQ"
  },
  "6zmkDYmepElthRUUltHTvA": {
    "date": "4/16/2015",
    "text": "Well, I did go there a lot when they first opened, good food, welcoming staff and good environment, but the portion of their food is not big, for big stomach like me and my fiend, the 2 of us can eat around 60 pounds!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bXJsbEoW2wbM5XYsOc1szA"
  },
  "tw_e6JXJ73u_pnj-qRkpmw": {
    "date": "5/18/2015",
    "text": "After having visited the restaurant on multiple occasions, I must say that the service became really bad. The waiters forgot about half of the order (even though we ordered a set menu) and she seemed not really to care about if we're happy and satisfied at all. In a restaurant of this level and this pricing strategy an absolute no go! We felt like in a fast food restaurant. The electronic music which was played in the background didn't help us to relax either. So basically we paid around £100 for bad service, bad atmosphere and a bad experience... Not sure if we'll come back. Hope the restaurant management will change a lot before it becomes even worse....",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "868jo7D2a4Dx8U0l588boQ"
  },
  "1OyjIdKPrCRwMcE6yL1ixw": {
    "date": "7/2/2017",
    "text": "Pretty good Korean BBQ place. Food is tasty, and the price is great when you go during happy hour.But service is really really slow and we had some dishes missing from our order too. We were told they had just switched over to a new IT system for ordering, so maybe things have improved since we went in May.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "UonT0gR4TzUZJ5_8Ok0jyg": {
    "date": "8/9/2018",
    "text": "Went for dinner this evening with a few friends. We got there when they were quite busy, and were greeted by a friendly and very professional young lady who went above and beyond to find a table for 5 at short notice; thank you Ladan.We ordered a pitcher or two of Asahi , edemame, a couple orders of Padron Pepper (very good), some egg noodle soup [ok only], Beef Sukiyaki Bibimap [just ok, bit too \"mooshy', needed more flavor], Chicken Garlin noodles [good], 3 orders of Premium Kalbi Short Ribs and 3 orders of Premium Harati Skirt steak,  Tiger Prawn, Spicy Pork, Ross Sliced Ribeye [very chewy], Garlic Spinach etc., you get the picture. Food was generally good, atmosphere fine, service just ok.We asked for some type of spicy sauce [\" what ever You Have']. And they made A big deal Of This Being A Tough Thing For Them To do [?!] and insisted that they'd have to charge us an addition Pound for this; this was totally incredible, and thought less on the part of management ! Their attitude frankly totally put me off third place and I won't be going back there anytime soon. If you are looking for good and appreciative customer service when you are out for dinner, this place is not it.I'm giving them 3 stars ONLY because Ladan was so helpful and pleasant in the way she treated our group when we showed up.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuwf98t0N9C5oTbOpqx3yQ"
  },
  "SMKnqkZ-jy-d-qZLSew3Iw": {
    "date": "6/9/2018",
    "text": "We had a group of 2 and ordered 4 portions of beef, two portions of chicken, 2 prawns, two bowls of rice (Tariyaki or something like that, and a garlic fried rice), a seafood tofu soup. All together cost us around £100.I would recommend it if you are a huge meet lover like us, and enjoy making the BBQ yourself. The meet are fresh, but just not enough flavouring. So you have to have the meet with other sauces. The reasons I give it 3 stars are: 1. One portion is so tiny, so not worth the price; 2. The empty bowl they gave us for soup was dirty, and I found egg shells from the soup!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AQ2IOh9x42HChpq_E8T7Mg"
  },
  "AM9ahGKWv9JdT_TDVhXXJQ": {
    "date": "1/28/2017",
    "text": "This place really reminded the barbecue place I was going to when I was living in Tokyo.We ordered vegetables, different kind of meats and seafood. We had some cabbage, kimchi, bibimbap and garlic noodles on the side. Everything was really good and tastyA great restaurant to share moment with friends or family or colleague around a nice table. barbecue It's more expensive to what I was used to in Japan but the quality was really good and it worth it in London prices.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "D-prR5l13gpwshfWiXkZjQ",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D-prR5l13gpwshfWiXkZjQ/o.jpg"
      }
    ],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "HDbaeveODF5MCzabt9ZpQg": {
    "date": "9/15/2016",
    "text": "Kintan is amazing! The atmosphere is slightly confusing as it is just like being in Japan. While we were there there was a Japanese salaryman on the next table who had drunk so much that he was falling asleep on the bench next to his colleagues - JUST LIKE JAPAN!! (^^)For the best value meat-joy come on a Monday for their happy hour. Some drinks and loooads of the food is 50% off, so you can eat yummy meat all night without paying a huge amount of money.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9lf6uMpPOnJArUNePNZCuw",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Red meat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9lf6uMpPOnJArUNePNZCuw/o.jpg"
      }
    ],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "Nfj-w3KzgyGP3Ij21SOBmQ": {
    "date": "8/26/2016",
    "text": "Yummy food with many choices of set bbq options. We went for the meaty one and omg...as expected...so much meat. the sweetcorn with butter and lettuce salad were the only veggies we got and both was yummy but I have to say the desserts and some members of staff were a let down. I ordered drinks repeatedly and they never arrived and the waitress didn't explain the desserts properly hence we ended up with 8 smores instead of smores for 4 people. When we tried to explain. She just said rudely said kitchen closed. No change. Go for the food and don't expect too much in terms of service and you'll enjoy it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lLhGSByBhXY5TOEWAoD5-A",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. And more meat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lLhGSByBhXY5TOEWAoD5-A/o.jpg"
      },
      {
        "img_id": "zeojnOBG5EX719Pwgt3K5Q",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Meat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zeojnOBG5EX719Pwgt3K5Q/o.jpg"
      },
      {
        "img_id": "fxV60i4477tqUdv7PRI6mw",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Meat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fxV60i4477tqUdv7PRI6mw/o.jpg"
      }
    ],
    "user_id": "NhERs5jY_W3BF7FAA3XzXg"
  },
  "LcUyS2bOawCVRMA3c0zHxQ": {
    "date": "3/26/2017",
    "text": "Good quality and price, drinks half priced after not late! Try the octopus balls!!!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZ_qxoyFge6k4lk4Uc0plA"
  },
  "XCmvOLYrdg9xCb-zFsaVbg": {
    "date": "5/21/2016",
    "text": "We went there for lunch a few weeks ago on a Saturday. We didn't book a table and just walked in. We were told there were about  half an hour wait, which was fine and we decided to get drinks at the bar whilst we waited. Before we had time to finish our drinks, our table was ready. Great! We studied the menus thoroughly and we all decided to order different things. The lunch time offer is a bargain! Then they starTed the bbq in the middle of our table :) and we started cooking! The seafood and meats were fresh and of decent quality. We all enjoyed our food very much and the waitress came several times to check on us, topping up our drinks and asking if everything was ok. We had a lovely lunch and enjoyed the Japanese decorations and ambiance.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cIYQLf789V4TPiresisPEg",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Harami skirt steak with miso sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cIYQLf789V4TPiresisPEg/o.jpg"
      },
      {
        "img_id": "8J3kex4QUTXE9irOYw6T4g",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Scallops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8J3kex4QUTXE9irOYw6T4g/o.jpg"
      },
      {
        "img_id": "zenKiuzHzu-KCJ6HBCd4Gg",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zenKiuzHzu-KCJ6HBCd4Gg/o.jpg"
      }
    ],
    "user_id": "VQlM_L8vgI906QKELH92qg"
  },
  "iPXDa2eH3Hv_B2lRLFGtgw": {
    "date": "5/21/2016",
    "text": "I am stuffed!! Came here for the lunch happy hour menu for 4. Himawari set. Japanese BBQ, didn't quite know what to expect, but it was quite good, similar to Korean BBQ. There was different cuts of beef, chicken and some pork and prawns, sweet marinated for you to cook over a hot grill.I liked it, however thought it could do with more selection of sauces, and some beef chunks were slightly too big and chewy to take it in one mouth full. The sides like the garlic rice, and the starters was good and offset some of the sweeter bbq dishes, great with a cold pint of beer. Confused with the French fries, but that was woofed down just the same.The dessert was different, kind of heavy still, I would have preferred fruit or something acidic.  The venue is much larger than it seems from the outside. And vented really well, so it should be for indoor BBQ. Staff was kind and helpful, showed us what to do and patient with our requests. Quite efficient operation they have. Tip: ask for your grill to be changed once it starts getting charred, or your meats will start to taste burnt.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XZQh0RkFBa0kh21Wk9Uf_w",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XZQh0RkFBa0kh21Wk9Uf_w/o.jpg"
      },
      {
        "img_id": "MsHPuTbXkdCvVcqf_QS1TQ",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MsHPuTbXkdCvVcqf_QS1TQ/o.jpg"
      },
      {
        "img_id": "EXX1qGL6Dv--TWqApPE7DA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EXX1qGL6Dv--TWqApPE7DA/o.jpg"
      }
    ],
    "user_id": "HXoC5eJ8pueKhG-3AFkMOw"
  },
  "Yl48hoGdysjdaoOF-aAAqQ": {
    "date": "2/16/2018",
    "text": "Their Kalbi and Harami Miso/garlic is amazing. Try their mushroom medley. Spoiler alert, their scallops are super huge. Beef tongue is good I wish if it was cut  thinker. I'm eating this place compared to a restaurant called Gyu-kaku in NYC and Pasadena CA.  Pretty close competition",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkxjSfCpIeqVNBxCL5iyaw"
  },
  "GElsGnoIs3xfjUzrEGhV_Q": {
    "date": "2/15/2018",
    "text": "First time trying Japanese BBQ and it was a great experience. Went with my girlfriend and had a lovely meal. It does get busy. The atmosphere is lovely. Wonderful staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "byy19XgRZa-tc8fE5OV8XQ"
  },
  "Y94MjU8ndx2jP_iuCVWdug": {
    "date": "7/8/2016",
    "text": "Gave e this a go with some girlfriends for a catch up and it Wasn't bad but it wasn't great either.  Service was a tad slow considering it was a Tuesday night and it wasn't that busy. We went during happy hour and I think the meal would be very expensive if it wasn't even though it was three of us, we were told that the set meal was not enough and that we should order more.. And they weren't joking. I guess I am so used to the Korean bbq I get in the states that anything else just feel over priced? I ordered the plum wine and cassie cocktails which I enjoyed especially at 50% off. I would go back cause I haven't found anything half as good as close to me.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G_QeXJFWtj3uZjmX6LLfPg",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G_QeXJFWtj3uZjmX6LLfPg/o.jpg"
      },
      {
        "img_id": "xmcOC3kmkTJiALh5i7SkBw",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xmcOC3kmkTJiALh5i7SkBw/o.jpg"
      },
      {
        "img_id": "DcEBzIHjeYO0R4bmZKNeXA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DcEBzIHjeYO0R4bmZKNeXA/o.jpg"
      }
    ],
    "user_id": "ZpBMuzKnd9DLPK_2QBSHvg"
  },
  "yLTsMKShVbddaZAkEQxjkA": {
    "date": "10/13/2017",
    "text": "Gyu kaku knock off! Only go if you're really really really craving yakiniku. Service was meh, meat quality was ok. Both the bartender and our server did not seem to know what they were doing - brought the wrong sake, missed one of our appetizer orders. Don't get the butter corn, it's frozen corn and chalky. Appreciated the late night happy hour, but then again maybe not worth it if not at happy hour prices.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CAYYLNKmpgBCXkeGw0s5Q"
  },
  "WRv9xPPVs2jg42SBTSurBg": {
    "date": "1/10/2016",
    "text": "A place where meaty comas are made.Kintan is a Japanese BBQ whereby you cook many dishes on a BBQ hotplate. Raw seasoned meat and other dishes are brought out in an endless train. You cook the dishes as you wish to enjoy them and that's pretty much it. It's very easy and quality of the meats is top notch.The interior is lovely and homely. Sadly the same couldn't be said about the bathrooms. Considering how good the restaurant itself is, the mens toilets were dreadful. Tiny and poorly maintained.Staff were quite good. However as the restaurant got busier, it took longer to get the staff's attention. Requests for water were forgotten. Luckily however they didn't forget any of the food.For those worrying about leaving hungry, you'll eat plenty. No worries about that.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oPdbxdc4TrR8uv7zJg4_Ug",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Bibimbap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oPdbxdc4TrR8uv7zJg4_Ug/o.jpg"
      },
      {
        "img_id": "OVHbMTSNbszA3Uby0jW8VA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Butter for noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OVHbMTSNbszA3Uby0jW8VA/o.jpg"
      },
      {
        "img_id": "Q7yPhyypNzYjJ68R5g8eBA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q7yPhyypNzYjJ68R5g8eBA/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "PQxdMOtBBEfepTn_JQEsfw": {
    "date": "11/8/2015",
    "text": "Casual Japanese bbq spot. Came here at an odd time in between their lunch and dinner hours for some drinks and light apps, but the food was so good we made a legit meal out of it. Despite the bar area being standing only, I highly recommend eating at the bar. It offers an amazing all day every day happy hour deal. Half off asahi on draft, hot and cold sake. 50% off a large selection of apps, rice, noodle and dessert dishes off the regular menu. Super nice bartender. Eat at the bar!Spicy tofu - Cold tofu dish with a single slab of tofu topped with a sweet red chili sauce and crunch. I don't know what that crunch is. All I know is that I was basically licking the bowl clean of the crunch that had fallen off the tofu. I'm not a huge tofu fan but I highly recommend this dish. Steamed chili gyoza - 5 pieces on a platter. Similar sauce to the spicy tofu dish, but without the crunch.Sukiyaki bibimbap - Comes in a piping hot dish that continues to sizzle and cook as you eat it. Don't touch that bowl, I know from experience :( Wait staff execute a tableside preparation of mixing the egg into the rice.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "t7GLMunuJab44-yjLgAfVg",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Steamed chili gyoza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t7GLMunuJab44-yjLgAfVg/o.jpg"
      }
    ],
    "user_id": "lewFfNnf4d9O4ggFybzOqg"
  },
  "6Uw_F26b-i0yir1Gr_vLuQ": {
    "date": "6/2/2017",
    "text": "Really cool Japanese place with some similarity to Korean BBQ ... where you cook the meats you choose on a grill in the middle of your table. It's best if you order the specials for two (you get the most value that way). They also have great happy hour specials in late evening, which is a bonus! It can be a bit pricey -  starts at £70 for two for the specials, but it is a lot of food. You can also order ala carte. The taste and quality is very good. You know it's authentic because Japanese people are eating here! Did not give 5 stars because price is a bit too high.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-1GOFB7Wnp4bQs9AxPCXWA"
  },
  "TLvHB2a75NkZ7kWu7ivXEQ": {
    "date": "2/20/2018",
    "text": "We came here purely based on Yelp ranking in this location. This is the worse and most unauthentic Japanese meal I've ever had. All the Bells and Whistles like nice staff and the Japanese welcome but no substance. We ordered 9 small meals and the food was dry, Gyoza looked 5 weeks old, Karaage Chicken tasted like gristle and oil. I would recommend look elsewhere or choose another cuisine in this location.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GgKuIp6JPh4XS4ihmbdjmA"
  },
  "1CxaL3VY-69Ygw8gI8qmMg": {
    "date": "6/28/2016",
    "text": "Went there with two of my friends on a Monday evening. However we still waited for 20min for a table. The stuff are super friendly and polite. The menu was a bit overwhelming because of all the choices that we have. We go for the meat lover set for two person and ordered some starters and a garlic fried rice. The meat were great and everything was wonderful including the Yuzu beer. I will definitely come back soon.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "y1dqCblQiZCyGpuDZboteg"
  },
  "9R1RZlfq_qE1aoMUKDzByw": {
    "date": "10/4/2015",
    "text": "You know you are onto a gem of a place when you speak with Japanese people and they all come here to eat? Yes, indeed.Good points:-The meats are marinated in an excellent manner ensuring that you will have finger licking good food.Service isn't too bad considering we were politely told the next group booking is waiting, and we were allowed to eat our birthday cake.Big menu list allowing you to order even the randomest meats, like ox tongue, tail or something or another. If you want some Korean bibimbap? They have it. You want smores for dessert? They have it too.Bad points:-Food is overloaded with MSG, so make sure you either buy a lot of alcohol or prepare to drink a lot of water.It's quite pricey if you want to gorge yourself on meat. For my group of 10 we paid £52 per person including service charge, although yes we ordered a few sake, plum wine, and wagyu beef.They do not really advertise their deals enough. I think I saw in the toilets that Tuesdays are student nights and Wednesdays are ladies nights. Then there are the happy hours on certain days when you get half price drinks.I really liked wagyu beef and the spicy kalbi pork. If you order lamb it only comes in two pieces. The mushrooms are not worth ordering (unless you really like them?). The precooked noodles are really good.Closest station is Chancery Lane, or Holborn. Booking is allowed. Not bad if you want some Japanese BBQ action. Yes you cook it yourself, but they do come and change the grill to a clean one at least once during your 2 hour stay.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dRMqC9_LODJ08AsJASBFew",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. Yummy noodles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dRMqC9_LODJ08AsJASBFew/o.jpg"
      },
      {
        "img_id": "z8YZrpU-yoCyyeZo_PqjaA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom. How to over order",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z8YZrpU-yoCyyeZo_PqjaA/o.jpg"
      },
      {
        "img_id": "_OZ3oEXWeZpuHo-5dB_0HA",
        "caption": "Photo of Kintan Japanese BBQ - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_OZ3oEXWeZpuHo-5dB_0HA/o.jpg"
      }
    ],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "4UvU856X2ntLh1wHZHwEfA": {
    "date": "4/26/2016",
    "text": "Do you know that Japanese have their own BBQ style?YOU DONT!!!!!!!!!!!! Well then Kintan is the best way to discover it.They have one of the most comprehensive menus in town and even useless people like me (i must admit that most of the time is my partner you does the ordering) are somehow able to order food. My favourite of all - Beef tongue (Dont pull that face now). Super yammy and it does not taste like tongue at all - It taste like chicken :P Naaaah just pulling your leg. But it is really one of the best dishes and you will for sure enjoy it.Additional to all the great meats you can also get veggies and fish which you can also grill. Added to all the grilling are some Japanese transitional dishes which are very well prepared.Top all of the with an extensive drink menu and all those happy hour deals and i am sure you will enjoy the place as much as we do.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rhilOVO7_Th1IsQQk0xcBA"
  }
}