{
  "Jil0taH4xnqpoUx8fK4Pqg": {
    "date": "10/5/2010",
    "text": "Tay Do is the (somewhat) upmarket version of Tay Do Cafe on the other side of the street (presumably the first was opened after the success of the latter). I haven't been able to detect any differences in either the variety or cost of items on the menu, so essentially it's a question of decor and perhaps service (the food in both places being excellent - Lemongrass Tofu is normally a standout - though the version I had on Friday night when the restaurant was very busy was less so). The restaurant, as you might expect has a somewhat fancier decor, and somewhat larger space. It seems popular with larger (somewhat drunken) groups out celebrating birthdays and the like, and certainly has more space. If you are a couple and want a private table this is probably the better bet. On the occasions I have been there I have thought the service in the Tay Do is friendlier and a little faster than Tay Do Cafe, and I get the sense you would be welcome to linger and talk a bit longer here than at the cafe, but not sure if this is really true. Depending on my mood I tend to oscillate between the two places. Bottom-Line: Check out both and decide which suits your personal vibe better.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-KqJs1MDCT5eqbmgnEvRQ"
  },
  "ce5UztNZg7B3us0z0dOSfg": {
    "date": "11/21/2008",
    "text": "I absolutely love this place, for many reasons, the food is always delicious, you can bring your own wine, it's a great place to come as a group, it's cheap and there is always a really good atmosphere.I was here on a Saturday night for a friends birthday a few months ago and it was completely packed full of people having fun.They even turned off the lights when they brought my friends cake to the table which made it really special. The presentation of the food is great, I would highly recommend the veg rolls as a starter. I cant wait to go again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3S-kcdchrjvs1gp6ys05OA"
  },
  "PHGYqIsTvu61FlSMtQULZw": {
    "date": "11/27/2008",
    "text": "Tay Do Restaurant is the larger, slightly more expensive sister restaurant to Tay Do Cafe just across the road. Not that Tay Do is expensive at all- the portions are huge and all main courses come under 10 pounds. Whilst I would recommend the smaller, more intimate Cafe for dinner- Tay Do is cosier, more fun and you can take your own alcohol- the restaurant is perfect for large parties and during lunch time is packed full of office groups. My work colleagues come at least once a week during our lunch break due to the 4.95 lunch special and the fact that you can easily get a table for ten people. The lunch menu comes with a choice of starter- soup or prawn toast- and a choice of about 20 different main dishes of which the Pho and the chicken salad are best. Between our group we must have tried everything on the menu- only the gluey ho fun dishes are disappointing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xZgBrjkFraQjFGH-io2XUA",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xZgBrjkFraQjFGH-io2XUA/o.jpg"
      }
    ],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "R1wQw3p2XNaxV5z-EW03pg": {
    "date": "1/23/2009",
    "text": "Very popular with large groups, cheap and good food, this is a perfect place to grab a decent bowl of noodles. Two things to watch out for; service can be slow when the place is busy (that's 'usually') and when it's full, the noise is deafening. But if you go on your own, take an iPod or a pair of earplugs, you'll have a great time. Lunchtime, when it's less busy, and quieter, is perfect.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UkH9S7H6hTZRYlL7HmO54w": {
    "date": "5/28/2009",
    "text": "This place has the best food on Kingland Road. Usually very fast, fresh and delicious. Living only minutes away from there I'm quiet a regular. Only thing is the service: They ask you to order appetiser, main dish and dessert all at once and hate taking additional orders. BUT the more you come in, the more they recognize you the better they treat you! Best value for money as well!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "DeFoGd0guZ4Lqbp4JNfI5Q": {
    "date": "1/10/2010",
    "text": "I work around the corner so I've tried most of the vietnamese restaurants on the kingsland rd. I had lunch at tay do and sadly I din't think it was up to scratch. This may have down to bad ordering on my part, I had the singapore noodles and it tasted as though they had just used it as a dumping ground for all their leftover meats, not that fresh and I ended up leaving most of it. It's a shame as it came recommeded by some friends and I would be willing to give them another shot to see if I just chose wrong. But for now there are other vietnamese I prefer.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8rWzX2QCDDgYa2u7qvp5lQ"
  },
  "Rulolt4dZ3S4UUvoHLaH8Q": {
    "date": "11/18/2008",
    "text": "Great value, fast, fresh and delicious! I came to Tay Do with a load of friends, a party of 20, and we wanted somewhere inexpensive and tasty. Another friend of mine recommended Tay Do, as he had had some great meals there, and so we went for it. Tay Do is always a very buzzy lively place, and is probably not the place for a quiet romantic meal, but if you're looking for delicious Vietnamese food, freshly cooked, and full of flavour, then you can do a lot worse than coming here! I particularly recommend the Pho Bo rare beef soup, and the cool and fresh tasting Summer Rolls, delicious!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "88tUxHwYZnRQrkPsKZ0T8Q": {
    "date": "1/27/2010",
    "text": "I liked the pho - good broth - but next time I may stick to the pho that doesn't have meatballs in it since I think I prefer the thin sliced beef on its own. Iced milk coffees were fine, but nothing special, and sadly it did not wake me up at all - this may have been due to how full I was after the pho though!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5_QYtYlgkk6rXdFp2XBQtw": {
    "date": "2/5/2010",
    "text": "I've been here a few times and have mixed feeling about the place, while the food is really great and cheap, i always get the feeling i'm being rushed... probably because the place is always so busy as they do a roaring trade... also the last time i came in here was a Thursday evening and i could hardly hear what my friend was saying because it was so noisy which was distracting and frustrating.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IfxACpm0plVJ1zp4rNFoxw": {
    "date": "1/16/2010",
    "text": "Recommend this place for a cheap bite to eat. They do a fantastic lunch special at the moment, prawn toast or soup + a choice of main course for £4.30! I had chicken chow mein and it was very tasty. Plenty of room too, and the Hue beer went down well.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "071B3UIq-ZQEzXaGv0OM3w": {
    "date": "9/19/2008",
    "text": "Tay do is pretty basic Vietnamese food. It's not the best place I have been but it is super cheap and best of all byo. I love byo!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1Fm4S1gwz-ibRqvAUCkY4w": {
    "date": "6/16/2008",
    "text": "Tay do is another of the stars of Kingsland Road. Same rules apply, you bring your wine or beers in, you ask for all the food altogether (no starters-main structure) and you bear in mind they are big portions, so don't be tempted to ask for loads of items just because you are hungry or because the price is good.If you are wise enough you could have a great dinner and pay way less than 10 pounds.Tay do, or, actually, any of the Vietnamese in Kingsland road is a convenient restaurant if you are going out around Shoreditch, Old street or Brick lane.Food is great. Noodles are not bad, and the meat dishes are superb. It is like a chinesse restaurant but leaner, more aromatic and basically with a more flavoursome twist to it. My safe bet is noodle soups. They are massive and full of fresh herbs, chillies and soy on side. They are also full of meat and seafood or whatever it is meant to have. You know when you ask for a poultry or prawns dish and you get just enough to be seen but no to be chewed???? Like in most indian restaurants where you cannot see the lamb all covered in the sauce????here is different, you ask for duck soup you do get it.tay do, the second one going towards hackney right after the Viet Grill",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EBg9c7HiPosMx0nFBoqkQA": {
    "date": "10/16/2011",
    "text": "In my opinion, when it comes to a Friday night out with a big group of friends, there is little else that beats visiting one of the myriad of Vietnamese restaurants dotted along Kingsland road in bustling Shoreditch. Last night we decided on Tay Do.First things first, if you are thinking about visiting Tay Do on a Friday evening with a party any larger than 2 make sure you have booked a table or you will find yourself at the back of a long and frustrating queue. Secondly, do not expect service to extend beyond taking your order bringing your food and then shortly after your bill. Thirdly, grab a bottle of beer then order adventurously and in abundance.This is the spot for cheap and simple Vietnamese food. The pho soups come in immensely large portions, more than enough for two but do lack some punch in the flavour department. However add a splash of fish sauce, chilli or soy from the tables condiments and you are almost there. Ask for an extra side of Basil or beansprouts if you find yourself wanting more. The deep fried salt and pepper or spicy squid is one of the stars on the menu as is the crispy duck pancakes. The best way to go about enjoying a meal here is to do it the way the Vietnamese do... order a variety of dishes between you and share, share, share!Quite simply Tay Do is and does exactly what you expect it to when you walk in and take a glimpse of the plastic table clothes, flustered waiters and loud and cramped visitors. It feeds you quickly, fills you up and then chases you off your seat. Oh I'm not kidding, don't expect to hang around and enjoy the company of your friends after your meal, they are not afraid to ask you to leave. You won't be blown away but you will leave fairly happy having just had a big meal two course meal for around £10. They also allow \"BYO\".",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ewKu59xnITtNwiLMQ8GHvQ"
  },
  "wgupNu2QvCL_qVR2JChk6g": {
    "date": "8/22/2011",
    "text": "Was recommended this place by a friend, whose husband is Vietnamese, and was excited about going.Had a vietnamese salad, which was freshly made but lacked any taste sensations.My friend and I both ordered the pho, she had seafood and I had the beef. Hers tasted much nicer and I asked the waiter if they had added MSG to my beef, he said yes but just a bit. He said that if I did not want it next time to say so. He was very polite but does seem a bit stange to ask for chemicals not to be added to your food.Disappointing.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "M3gSoCC3rNh1fn-qjVe4Nw": {
    "date": "1/9/2009",
    "text": "I spent the first 15 minutes of my meal in Tay Do guiltily avoiding the waiters' eyes...My boyfriend and I were meeting two of our friends but unfortunately they were late, a fact which the waiters made no efforts to hide their disdain for. Oh the guilt I felt- it's not my fault I wanted to scream! However, Tay Do is not the kind of place you hang around in. Quick in, quick out, bish, bash, bosh and our table was clearly costing them money. Thankfully our buddies didn't take too much longer to arrive and after unscrewing our pre-purchased vino- all was forgiven! The food in Tay Do is pretty awesome. I would definitely recommend the squid starter, soft shell crab and white fish (what fish this is seems to vary) fried with salt, chilli and garlic. So good! Duck in tamarind was less successful- bit too chewy but tasty enough. My poor friend struggled with what can only be described as a bath full of soup. Why make the portion quite so big? Seriously, if his head had slipped I'm sure he would have drowned.... Tay Do is well worth a visit. Not only is the food tasty but it's reasonably priced too. For starters, mains and sides it cost us about £16 each. Added to that it's BYOB so the prices won't be bumped up by the wine bill. Definitely recommended!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "7kBluv5kfvDdK3GaA2kNIg",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7kBluv5kfvDdK3GaA2kNIg/o.jpg"
      }
    ],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "B-2IrWjAnIu8P6-Om7IHNw": {
    "date": "10/14/2009",
    "text": "One of the cheapest eats I have had in London, with massive pho portions as well! The bean sprouts that they give you are stacked so high that they are literally falling off the plate. However, the pho came somewhat lukewarm, and the taste was just so-so, with the soup broth very weak. They are very generous with the beef slices though, as well as the quantity of noodles given. Service was prompt but our waiter was not very friendly and had a stone-wall face on him all the time. It is a BYO restaurant (no alcohol is served), but they do charge a £1 fee for corkage per person. This place would get 4 stars from me if it was located anywhere else in London, but on Kingsland Road it does have very stiff competition and unfortunately it will not be one of my favourites there.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "Y0b604LQMmhXmAQcHEysHQ": {
    "date": "2/19/2013",
    "text": "My first time trying Vietnamese food was at Tay Do.  There are a handful of Vietnamese restaurants on Kingsland so we chose Tay Do at random.  It's really nice having BYOB. Definitely vegetarian friendly with an extensive list of vegetarian dishes.  It felt pretty authentic.  Don't expect anything fancy but if you want some authentic Vietnamese give it a try.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvUs4yE6LPBOgLd8Ap2Krw"
  },
  "2gfcMiyx5u1VNnE70ohfLA": {
    "date": "2/15/2011",
    "text": "Maybe I've just not had much luck recently, but I am starting to get a little bored of middle-of-the-range Vietnamese at this end of the Kingsland Road.  It was better than Little Hanoi, but definitely not as good as Cay Tre (so far, I don't understand why anyone would go anywhere else in the area but Cay Tre unless it's just because its to avoid the queues).It was big, so good for groups I guess.  And you can bring your own booze, again good for groups, though I think they do charge corkage per person.The menu is huge and relatively unexciting.  I quite enjoyed my fried squid, and the summer rolls were good.  But the green papaya salad, typically one of my favourite dishes in the world, tasted a little suspiciously like it had been rinsed with washing up liquid.  Perhaps it was just a weird papaya.Not that cheap for what you get here, I think there are plenty of other better places in the neighbourhood that you could be going.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "imxW4Dun1OhOWDnP-vN-og"
  },
  "a0PFKEiVW6mHDdvZsczkfA": {
    "date": "11/16/2013",
    "text": "Too oily, I can see oil in the pho, it's like drinking oil rather than soup.Disappointing!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BnvJmAcuWrgxtZ_9ljEV8g"
  },
  "OitFnkBtD7KR9aS0YyFMTQ": {
    "date": "3/3/2013",
    "text": "Not bad, but not the best either. Came here on a friend's recommendation and had the Pho noodle soup with rare-sliced steak and well-done flank - a classic dish. To be fair, I haven't had Vietnamese food in a long while and my go-to dish is usually not Pho (usually I go for the cold noodle, Bun dishes) but it was freezing out and a hot bowl of Pho seemed appropriate. It was good enough to eat and hit the spot for what I needed, but nothing about it really stood out for me. Solid place to go if there's no wait and wanted a quick bite.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "Rx6N27hQpbpYkyRXSFuQlw": {
    "date": "6/29/2010",
    "text": "Welcome to \"lil 'nam\" we have a selection of Vietnamese foods all within walking distance. It's kind of like the brick lane of Vietnamese food, but without the pushing.I haven't tried enough of them to say which one is the best but Tay Do definitely tastes good! And you get a LOT of food for your buck. But if there is ONE thing I have to complain about is the service! I seriously had to ask for a coke about 7 times. And they kept saying \"yes\" and then they would walk away and I would watch them standing in the back chatting away as i DIED a lil of thirst. They might as well have stood back there drinking ALL THE SODAS while LAUGHING at me, i was parched from eating all those delicious prawn crackers. I almost considered drinking the fish sauce I was so thirsty.but the food was delicious, and you can bring your own booze, So I will probably go there again.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "0FteyJcOejjSPEmNcjbGdw": {
    "date": "12/3/2008",
    "text": "Different areas in London are known for different food. In east London Kingsland Road is the place to target for Vietnamese. A friend introduced me to TayDo, we were starving. Before we went there we stopped by at one of the small grocery shops to buy wine and beer. Now this is something, which is a unique selling point of those little Vietnamese restaurant, who one after the other emerge on Kingsland Road. The tradition of buying your own wine comes from when they started up and did not have the licence for alcohol. In the mean time most of those restaurants are allowed to sell wine and beer. However, they kept their BYO policy. This is why you will find many students there, celebrating their birthday parties. The food is exquisite and tastes completely different to the Chinese kitchen. It has a lot of vegetables and is not greasy at all.We normally order a couple of starters to share such as the omelettes with duck or the banh xeo, with its crisp turmeric-yellow exterior and filling of juicy chicken and crunchy bean sprouts. As a main I experimented last time by spying on my neighbours who ordered caramelised mekong catfish in a clay pot. Even if you have a very big appetite, this place has generous portions.We were asked to pay in cash, a friend of mine had to look for a cash machine outside, which took a while until he got back. But fair enough, you never pay more then a 10er. The look of the restaurant from outside does not do a particular favour, as the it is just placed behind a dodgy bus station and looks more like a canteen, but don't be misled by that!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-46zWpFhd13eyHzYki5CPg",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. Night outside Tay Do Cafe",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-46zWpFhd13eyHzYki5CPg/o.jpg"
      }
    ],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "dmRsVGaVdcnSecXEeSx_oA": {
    "date": "7/28/2011",
    "text": "Last week we arranged a party at home but I did not have enough to spend for 10 friends but my boy friend told me that try Tay do. when I compared it was very fair price but the problem with home delivery but we lackey that got a contact MySalivation.com -MySalivation Delivers. we order online the food was fresh , hot and I recommend the Pho Bo rare beef soup.mysalivation.com/22/rest…",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FGexzzLfSZ4A92nxbbjNvA": {
    "date": "9/3/2012",
    "text": "Firstly, you need to have the right level of expectations for this restaurant.  It's cheap, cheery, and serves good Vietnamese food.  Service is not exceptional but they're efficient and polite.  The food is much better than Song Que in my opinion and they don't scrimp on portion or accompaniments.  Have been many times and don't have much to complain about.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "IgvKXn6kJQSuq29VyeMFvg": {
    "date": "8/27/2012",
    "text": "The food wasnt to good. It all tasted as if it came from a can.After the meal they said the CC machine was busted so I had to walk down the street to another place to pay.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0vcnvZAHSNY1q5n8z6FXA"
  },
  "M8PkDiVHadNpcT_qlc8hQg": {
    "date": "9/23/2010",
    "text": "Five star for the food - one star for the friendly service and four star for the speed of serviceGo to Tay Do for the great food, good value and fast delivery. The staff are abrupt and straight to the point, but you hardly go there for the dining experienceThe salt 'n pepper squid is to die for!BYO and take away on request.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3s8kxq2FyN4mHjJdDbjtSw"
  },
  "zFjIYjvKKjZn596GWNnoCg": {
    "date": "8/9/2011",
    "text": "people say they are famous for their Bun (vermicelli noodles) but my friend ordered it and it was average at best and only had a few ingredients. I had the pho dac biet (mixed meat pho) & my friend ordered the bun rieu (spicy crab noodle soup). both had decent tasting broths and decent noodles but OMG what a HUGE MSG ache afterwards.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6ps_81rqwpgRnj2DCf7xcA"
  },
  "i986gtpYf8BnUCm7VWSSvw": {
    "date": "2/6/2009",
    "text": "Down this end of Kingsland Road you are spoilt for choice when it comes to Vietnamese food. There is a selection of about 15 resturants, all of which will stand empty for most weekdays apart from this one. There are loads of tightly packed tables, crammed together, each one filled with a punter and people even waiting outside the front to come in.I went here for a birthday party and it was a great venue for several reasons:1. it was bring your own2. it was really cheap3. the menu is like a small book with loads of selectionThe birthday boy had eaten at this place 4 time in the same week so it was a favorite with him but before I continue I'll give you some context. Said birthday boy was the UK weight watcher of the year a few years ago and every birthday he like to get on the wagon a bit and eat as much fried food as possible. Me and my fella should have remembered this as we stupidly ordered on his recommendatition, crispy noodles with black bean sauce. YUCK! it was the most revolting thing I have ever ordered out, greasy noodles in a sweet rich sauce. I feel sick just thinking about it now.I did manage to eat lots though, trying others dishes, as all the portions were huge. The food is lovely I just choose badly.This place is great for a quick bite to eat on your way home as well as parties. I would go back again just a bit disappointed by my lack of judgment.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "TarnyNi5L6e1j6Ajz9-_-Q": {
    "date": "5/5/2010",
    "text": "My favourite cheap lunch spot. Lunch menu boasts a variety of main courses, plus you can have a soup or half sesame prawn toast for £4.30. Yes, FOUR POUNDS THIRTY... Eat in or take away. I recommend no's 2, 20 or 27 from their special lunch menu (don't laugh - when you see the menu all will become clear). Great also for non fancy Vietnamese. Staff are friendly. Place always packed, particularly on Thursday evenings - you can take your own booze. What more could you ask for?",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QhHXyXDvHyu8sdWpr_9zfA": {
    "date": "4/15/2012",
    "text": "i miss this place so much. the Vietnamese food is delicious, no other place has ever been able to match the goodness of it. there are some clear rules when it comes to ordering food here though. eat the Vietnamese food and stay away from the Chinese dishes (stir fries and so on). the best of: 1. Fried squid stuffed pork2. papaya salad with prawns3. fried squid4. vietnamese spring rolls5. vietnamese omelette6. tay do special (glass noodle salad with chopped pork stomach, char grilled pork, salad and fresh herbs)7. pho bo with beef i would like to give 4 stars as the interior is clean yet pretty plastic and crappy, but the food is so good, it really distracts from that. 5 stars the place therefore deserves!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7g4ZoDLFsURsv4QFn__BBg": {
    "date": "1/23/2010",
    "text": "My friends wanted to meet at this Vietnamese restaurant but couldn't remember the name to meet me there.  So as I rounded Kingsland Road off of Old Street on this typically rainy winter evening  (ok I guess technically it's still Shoreditch High Street at that point), I picked up my friends who had parked there car just around the corner.  Sure enough, the place is a kind of non descript hole in the wall and I even had to look at Google Maps to figure out the name of the place today when I went to write this review.It was VERY hot, VERY loud and VERY crowded (there were three of us and we had to sit at the end of a long table setup for 10 embedded into a large party of 7 others). I found it a bit funny that a place like this would actually take bookings ... it certainly didn't need to and I would have been a bit happier at the four top that they kicked us out of after another waiter sat us there, but that's life.I didn't know it was Bring Your Own so we were sans-alcoholic beverage - so be sure to pick up some wine before you head in.  Still, the fresh lemonade was cold and  delicious.The menu is about 100 pages long (ok a light exaggeration, but it's pretty damn big).  The food comes flying out of the kitchen almost as soon as you finish the last sentence of your order and it was pretty incredible.  Each dish was extremely tasty - especially the Chow Mein noodles and the Rice and Mushroom Clay Pot.  My friends are vegetarians so I went with the flow (though my mouth was watering looking over at my 7 new friends grazing on some kind of creation including duck (to hell with Daffy, I wanted to share their wine and their meat).  I did manage to make one deviation in that I asked for some prawn crackers.  Still, I enjoyed our Tofu dish but did wonder to myself - have I had enough protein during this carb-loaded delight.  We asked for tap water literally 5 times before we got it - each time being assured it would come and each time watching the waiter walk half way to the bar area only to be interrupted by someone that wanted something they actually had to pay for forcing the waiter to forget us.   We asked for desert and the waiter said no (and with his eyes, I'm sure he screamed out - you've eaten, now get the hell out).  We stood up to leave and two people swarmed in to remove our dishes and they were literally cleaning off our table for the next guests before I even got my coat on (did that guy just push me?).  Oh, did I mention the meal was a total of 30 quid?  Amazing value for price.I'd recommend this place - but it's not for the feint of heart.  The food is unique, served fast and tasty but be prepared not to be able to hear your friends and to get the feeling that you are part of some large culinary assembly line where the staff are trained to get you out as soon as they can to make room for the next group.  Luckily we found a very quiet cafe to have the conversations we couldn't have over dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RXp0sEkWrpe0zMhu2A7nNg"
  },
  "-cXs_seeGOxBmuvmLViqKw": {
    "date": "12/31/2010",
    "text": "I prefer this over Tay Do - while the menu is the same, the food quality seems better here, and I like the more laid-back atmosphere. This is definitely among the best Vietnamese I have had in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "EPVopVW3jDkZ_lZAWWLJkA": {
    "date": "6/4/2015",
    "text": "Finally, a pho joint in London that doesn't break the bank, and has a seriously savoury broth. I come from the land of cheap, delicious pho (no, not Vietnam... Toronto!), and it's such a struggle to find in London. We came here for a birthday bash and the broth was on point. The fresh spring rolls starters were good as well, but the pho was herby and delicious. Definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ukTqKLMXzZYG2X2e4Iyq-g"
  },
  "fZDkdnjZgBYlpxub5EzulQ": {
    "date": "7/29/2017",
    "text": "(This is a review for the location down the road, which does not yet appear on Yelp.) The pho was decent. The service was not. Two big problems: (1) The lunch menu was posted on the door at dinner time, confusing me when the menu on the table didn't match.   The price for pho was £9 instead of £6. The waiter said the meals were the same except for the amount of veg, and refused to serve me the lunch version.  He seemed convinced that the confusion was entirely my fault. (2) As has happened to other reviewers, the waiter said, when it was time to pay(!) that the credit card machine wasn't working and we had to pay cash. Generally inattentive and ungracious service. Would not go back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsEJFcKahT0FrG8WRzvXmA"
  },
  "snYcdCJJCkh7Lxllq5tGBg": {
    "date": "8/8/2017",
    "text": "Good Vietnamese place. I had the noodle with duck. The portions are generous and prices are competitive. Service is OK. However, they don't take cards and even the check is simply written in pen. Not much professional.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  },
  "DwA5sibDiGMq1Ev4SDYoSA": {
    "date": "4/12/2015",
    "text": "Pho and BYO. Like all of the other place (minus one or two) along here. The pho was pretty good- not the best beef or pork that I have had in a pho but I have a feeling the kitchen staff has made these to suit a more 'Londoner' palate rather than traditional Vietnamese. The sides on the table are good and the chilli paste had a nice kick to it. The menu is loooonnnngggg and I don't know if you can really go wrong with too much as long as you use the chilli paste to spice things up. There is soups, stir-frys, deep-fried bits and pieces perfect for a hangover, a tofu section and the Viet salads. The Vietnamese spring roll was exactly what you would have expected and they cut it up in 8 pieces so easy to share. Highly recommended was the aubergine with soy sauce. I could eat this for days. It went well with the satay chicken (not something I would usually go for but also very delicious). The staff are really lovely, a little spacey, but really nice and eager to help. The kitchen thinks about timing and nailed it even on a very busy Saturday night.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "onJgko2C3WB5XLqYHqD2MQ"
  },
  "hi_Q9ypXat4_Ta0rcYG-5w": {
    "date": "11/27/2012",
    "text": "Oh man, when my friend brought me to this place and the only people I see dining here are non-Asians (I'm not racist), I already had a vibe that this place isn't meant for my Asian taste buds... Summer rolls came and ingredients were alright-fresh. Not very generous on the shrimps while piling the roll up with vermicelli. The spicy squid dish came quite quickly as it was supposed to be deep fried... Squid was obviously from frozen, not a lot of spiciness or taste even within the squid itself... The worst was the Pho. The soup was terrible, more like watered down vegetable soup with a tint of chicken broth mixed into it. Vegetables looked awfully served, snap peas, corn and carrots? Vietnamese Pho? I've gotten better 'fusion' food on kingsland road than anything in this bowl. You've got to be kidding me with the ingredients. Tofu was medium hard and everything about the so called 'Pho' here is just heading towards the wrong direction. Noodles were soggy and lacked texture. Arg, a waste of calories. They do have a broad menu.. Which ranges to even serving Peking duck (what I saw the other tables munching on...)  Avoid on all cost unless you enjoy non authentic Vietnamese dishes. The food here is typically all 'White Asian dishes'.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ziTr54vYdtNFPtD7u6vB7A",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. vegetable tofu pho",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ziTr54vYdtNFPtD7u6vB7A/o.jpg"
      },
      {
        "img_id": "-EzmaZ2Pywkk-iMiJLfBoA",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. spicy squid and summer rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-EzmaZ2Pywkk-iMiJLfBoA/o.jpg"
      }
    ],
    "user_id": "wUglOGOHWulhp8Wo9bb7Sw"
  },
  "QelXRcfP2Y9WN6hnPyAdOA": {
    "date": "10/13/2014",
    "text": "Tay Do has something special that none of the other Vietnamese restaurants in London has - the best Hu Tieu Nam Vang in London. Hu tieu nam vang is Cambodian-Vietnamese clear soup with pork, squid and prawns, heavy on garlic and onions. Also good for vegetarians! There's an entire menu with a large variety for vegetarians from crispy pancakes to noodle soup. One thing to note - cash only. There are no signs and don't be confused if you see the card machine behind the counter - the staff isn't allowed to use it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GO_SrmSJQAqV6Zqmywydiw",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. Southern Vietnamese soup with pork and prawn (hu tieu nam vang). Best in London!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GO_SrmSJQAqV6Zqmywydiw/o.jpg"
      },
      {
        "img_id": "a9WWDIxPqll2o2ce38oDpg",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. Vegetarian crispy pancakes with mushroom, tofu, bean sprouts and baby corn.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a9WWDIxPqll2o2ce38oDpg/o.jpg"
      },
      {
        "img_id": "fZLhRfmNIBjrw9KyGDvo8Q",
        "caption": "Photo of Tay Do Cafe - London, United Kingdom. Lemongrass Chili tofu. Very good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fZLhRfmNIBjrw9KyGDvo8Q/o.jpg"
      }
    ],
    "user_id": "jQEmuUvnfqAlU_Jg0m_SMA"
  },
  "xrjy8j-HR8ciDel5P6gcJg": {
    "date": "8/3/2015",
    "text": "The best thing about this restaurant is the BYOB. The food was average and the service really awkward. Half of the time the waiter had no clue what we were asking him. Also, it was totally empty which we thought was down to it being Monday night. But on the way home we walked passed at least 5 (Vietnamese) restaurants that were all buzzing.Also, it's cash only which we weren't aware of.Prices are on the high side for what you're getting.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ywsFn7EvBFx0Z0S8S9uRkQ"
  },
  "EgCgFQQnl5byZs_OES0O7w": {
    "date": "10/15/2016",
    "text": "Solid Vietnamese and Vietnamese-Chinese standards. The green papaya salad, pho, and crispy \"birds nest\" egg noodles with veggies were of the standard of the best hole in the wall Viet places in San Francisco. Friendly service. Cash only. Apps and mains around 10 pounds each,",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U4Mos3ZeuUkb9ekQO7fbnQ"
  },
  "ovC3ntH5g3g1YnVF0eQXMQ": {
    "date": "4/12/2015",
    "text": "Kingsland Rd is THE place to go for Vietnamese food in London. A short walk from Shoreditch/Old St, the whole road is rammed with delicious fresh CHEAP Vietnamese restaurants. And in my opinion, Tay Do is the best of these. There are some fancier joints available, but if you're looking for a tasty lunch or after-work dinner then this place is perfect. Grab some Summer rolls and a delicious Pho and you're set. My particular favourite is the beef and papaya salad; don't be put off by the fact that the beef looks like a shredded jumper, it is delicious! You'll walk away with a full belly and an only slightly less than full wallet.They also offer BYOB which is great, but note they do charge £2 corkage.Note: It's cash only, but there is a cash point next door.Yum yum yum.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W41-ZkAIjOTx_ftYMdUAUw"
  },
  "2ErEC4A6GEfjDIB8meCb_g": {
    "date": "8/27/2014",
    "text": "Many of the pho restaurants in London are centred on or around Kingsland Road.  Tay Do is one of them - right opposite the Honda dealership, you can't miss it.It's great for a casual night out and perfect for groups.  They allow BYOB and supply you with the appropriate glassware - bring wine, you get wine glasses, bring champagne, you get champagne glasses - it's that simple!In terms of the food, it's pretty standard for London pho - portions are standard size for London and taste is decent.  My issue however is the price. They have recently increased their prices so a bowl of pho is £10.00!  Way too much for a bowl of semi-decent pho.Being a West Coast American, Pho is pretty much a staple so in my early days in London I kept looking for comparable Pho.  Needless to say I was disappointed all the time as Pho here isn't as good (both in quality and quantity)... you basically don't get much bang for your buck/quid. Unfortunately you don't get the bang for the buck you used to at Tay Do.  However, if I do want pho, I head here... they're probably the best out of the lot and they're definitely better than Song Que (see my review from there if you're interested)",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jU7oGy4C6rMIO9EeRCGqZg"
  },
  "rL1HK5OIvLWe_toQfpN-Yg": {
    "date": "10/28/2013",
    "text": "The best vietnamese I've tasted on Kingsland Road.Four of us went here on Friday night and were blown away. The table was ready for us as soon as we got here which was a good start, and by no means a guarantee at this type of restaurant at a busy time. I'd read from other reviews about the massive menu (over 220 items) and so suggested to the group that we ask the waitress to decide for us. This was a tough choice given that two of the group are control freaks but it was the best decision of the night.  We agreed with the waitress that we'd have 4 starters and 5 main dishes and after a chat with her boss (where I assume they discussed what they should serve us) she proceeded to deliver a string of amazing dishes - many of them things that we would never had ordered. It also saved us from the monotomy of the standard asian food order - prawn toast, spring rolls, spare ribs and chicken satay.Having not actually chosen anything I can only guess at the names of some of the dishes we had. There was definitely some spicy squid and summer rolls amongst the starters, following this we had some beautiful fried fish, king prawns in a stew, an amazing roast duck dish and udon noodles with mixed meats amongst others. Every dish was lovely, hot and fresh. We just about finished everything and were well and truly stuffed.I'd recommend this place really highly, but more than this I'd really recommend the approach of allowing the restaurant to choose what you eat, particularly if you're not that familiar with much of the cuisine. It was a gamble that well and truly paid off.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "vqw44UwJzI2DbhduLexI3A"
  },
  "9sGXgswDaKeiWlp6AnQVMg": {
    "date": "2/18/2014",
    "text": "Another great BYO I've found in London. Initially I feared that this would be a total hole-in-the-wall, but the decor is actually quite nice. The menu is a bit overwhelming but we were already set on the pho, and it did not disappoint. Very authentic and much better than what you get for lunch takeaway! The right noodles, the right broth, this is exactly how pho should be.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "EOdJgQmR9Cg5Lzyg9aLxjw": {
    "date": "10/25/2013",
    "text": "One of the first Vietnamese places I tried on Kingsland Road and I immediately fell in love with the flavours of Vietnamese cuisine. I had the Lemongrass chicken and boiled rice and was blown away by the complex flavours. It sure had a lot of oil, but was darn tasty. Around lunchtime they do a deal like others in the area of a main dish/rice or noodles from a set menu for £5. Portions are good. Service not so good. You need to go up to the counter in order to pay. Strangely the card reader isn't portable.Since that first time, I've tried vietnamese omelette, fried summer rolls with their sweet sauce, fried frogs legs (which are EXACTLY like fried chicken wings) and some other dishes that are foggy in my mind, not to mention un-pronounceable. I was happy with every dish. Also try the cold vietnamese coffee after your meal. Delish.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "o_fFGLYozUInM_x5bSc4CQ": {
    "date": "5/12/2014",
    "text": "This is a great place for a casual dinner before a night out on the town. Compared to a few other Vietnamese places on Kingsland road, Tay Do can be a tad bit more costly (i.e. £1 more for pho). I favour Song Que for it's 'Special' pho which includes tripe and tendon for the adventurous people. Nevertheless, Tay Do does the trick. The bowls of noodle soup are generous and the best part, it's BYOB. If you like a few beverages, the amount you save on BYOB with no corkage more than makes up for any slight comparisons in price :) There's a reason why there are two locations on Kingsland road! Worth a stop by to either. No queue when I popped by just before 7pm on a Friday night but within the hour, the place was packed!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "255UWFKMll3xfOtUj1E_ZQ"
  },
  "AuX1iBitqL3mLKELq4Unzg": {
    "date": "10/16/2016",
    "text": "Delicious pho! And green papaya salad. And coconut water. The service was excellent and the food was great. I really loved dinner at this restaurant, which my son and I just happened on.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3JMUCM-5EwkL_TIL9GaoQw"
  },
  "jEeWPuYaJMjGytJGeyNzgA": {
    "date": "3/11/2014",
    "text": "Came for BYOB, came back for really tasty bun noodles. I've been here twice and will probably go again before nights out in the Shoreditch area. The food is all cheap and the vegetarian options are plentiful (whether they actually ARE vegetarian or not is a mystery but I figure if the veggies in my group aren't asking then I won't say anything -bad friend?). The pork spring rolls were delicious as well as the stir fried noodles with chilli lemongrass and pork (other options for the meat as well). And if I'm going to be able to get a main with meat and have it under a tenner, I'm pretty happy.The service can be a bit hit and miss though generally it's fine. We booked dinner for a large group the second time and when we got there they tried to squeeze us into a table for quite a few less people but that was quickly rectified. Definitely is a great place for big groups, just make sure you book up first if you're more than just a few as it fills up quickly at dinner time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hU8n9Is1dbbasCTd5kKMWw"
  },
  "V30TXuLHtKyMslbZEtqMkg": {
    "date": "5/24/2013",
    "text": "You can't swing a cat on Kingsland Road without hitting a Vietnamese restaurant, so it makes it hard to decide where to go in. My go-to favourite is Mien Tay, but when I rocked up outside they now have a sign saying that you can't bring in alcoholic drinks, soft drinks or water. NO WATER... dammit man, how can we be expected to live under these conditions?! Turns out they now have a liquor license so it's no BYOB. Seeing as I had a bottle of red wine burning a hole in my handbag, we ambled along to Tay Do who helpfully advertise that they welcome you bringing your own wine. Good job, fellas. Consider yourself my new go-to. It's not that I expect BYOB everywhere i go, of course, but it was a great selling point for these places. It's a big restaurant and a lot more spacious than Mien Tay. We ordered up some summer rolls, a Vietnamese pancake, pork bun and pork yuk sung. The summer rolls were pretty standard, I love the pancake, it was hugely tasty and left me wishing I'd ordered my own. Disaster came when I was eating the yuk sung, it is minced pork and vermicelli noodles wrapped in lettuce. Chewing away I realised I was eating a staple as well as pork. Not great, I called over the waitress and she was a bit non-verbal on it. But they brought me out another dish. This isn't really the kind of place where they are going to profusely apologise and offer you free food, but i appreciated them replacing it. I'd definitely go back, it was a pretty solid meal.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "0Avl7bn_gaIul3caBI404w": {
    "date": "6/26/2013",
    "text": "Have been going to this restaurant for years. I've always thought that the food on the whole was great. However sometimes, depending on the chef, it isn't always as good as the time before.I personally love the phos. Kingsland Road's nickname is 'pho mile' due to the propensity of Vietnamese restaurants serving it.Another dish I love are the goi salads.BYOB is an added bonus.I have noticed that their prices have risen recently :(",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TvGNXJSMEaxCcTc3wsmVEw"
  },
  "maKooaYpqyrAROrCHdFrwA": {
    "date": "10/1/2015",
    "text": "Another amazing BYO restaurant which seems very popular with the hip crowd.  Prepare yourself for a long wait for a table, corkage charge but also fantastic food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmE0gtgDkZ5MlzqYU0c8xA"
  },
  "-V2W-w_cjeMrpaWMkHjk0Q": {
    "date": "9/17/2013",
    "text": "I really liked this place, it was busy, the food was cheap and awesome (I had the egg fried rice and chicken satay...) beautiful! The only annoying this was you couldn't pay by card so my friends had to leave so they could withdraw cash!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  }
}