{
  "JS4CbvO_tbRy9eB_u2125w": {
    "date": "1/14/2015",
    "text": "Had a really nice veggie bibimbap today for lunch, the service is lovely too, really smiley staff. The only thing that could be improved would be to serve the bibimbap in a hot bowl, as mine was pretty cold by the end, and I'm more of an inhaler of food than a dainty eater. I LOVED the condiments on the table, I wanted to drink the gochujang one. I will definitely be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hNU5VTNp1iZCA-r-gWcB0g"
  },
  "Lh760GoAiM4uhIIHtgcfdw": {
    "date": "9/28/2015",
    "text": "Great sweet and spicy chicken and flawless buns - would give it 5 stars if it weren't no-reservations and if the service were a tad quicker.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBQ-PMxjmTw2rF6swl5i4A"
  },
  "23f2V9jAq1lDWcICzktMUA": {
    "date": "12/29/2015",
    "text": "The food here is great, which is probably why there's always a queue in the evenings. The fried chicken is delicious, as is the bulgogi and the kimchi pancake. Highly recommend it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_Minlapl4V9UOLMv2SO1Q"
  },
  "YJs3Zbsq8M4UB1fBPHThFw": {
    "date": "9/29/2015",
    "text": "Stumbled upon this place while traveling. Loved it. Great food, cozy atmosphere & lots of energy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "diiQdw7yLcJ2tdF4u3jvjw"
  },
  "C7StXrVo8O6FWoQK1c63YQ": {
    "date": "9/22/2015",
    "text": "Best tteokbokki I've had (might be spelled in a different way on the menu). Good starter followed by the spicy pork and beef buns. The buns are good but the economics of charging more for having two different buns doesn't really make sense to me since they're not sliced \"halfway\", if you know what I mean. Happy to have tried it though. The bibimbap was okay. Would come back if I'm ever in London again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwGzDeDTYi0yAkuDZpjcHw"
  },
  "v1kYsnIUMvMOV_W_neUmdQ": {
    "date": "11/14/2014",
    "text": "My starter and friends' orders were delicious and the waiter gave succinct and interesting insights into Korean eating and drinking culture.However my spicy tofu seafood soup was .. lots of weirdly textureless tofu and blergh. I guess I'm just bitter I ordered the wrong thing. The spirit selection (soju or soju) was limited and expensive.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-RjKjE31q-I5RE5TFIsV6Q"
  },
  "KQfmo6AwShq_1r8NpiUniQ": {
    "date": "9/27/2015",
    "text": "Food was very very good specially the Korean chicken. Highly recommend getting a mix of both soy garlic and sweet spicy sauce. The only downside was that the mains didn't come out the same time with everyone else on the table.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KjkWkfdLWcRrTnKeZg2bXQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Bulgogi ramen",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KjkWkfdLWcRrTnKeZg2bXQ/o.jpg"
      },
      {
        "img_id": "oQFCCzwkySsgS4U-D4gz6Q",
        "caption": "Photo of On The Bab - London, United Kingdom. Soy garlic and sweet and spicy chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oQFCCzwkySsgS4U-D4gz6Q/o.jpg"
      }
    ],
    "user_id": "hkxrZjhCzItTwsG2RqexBA"
  },
  "GA2UkeTe9dt1wuVJIo04TA": {
    "date": "8/5/2015",
    "text": "Love the Bibimbap here. However I have to say that it's not too authentic. Some flavours or dishes are quite westernised.. I was a bit disappointed by their revisitation of the number 1 street food in South Korea, Topokki. It wasn't that good, not spicy enough and served with some sort of fried vegetables on top to make it look nice. It's street food, in South Korea they serve it in plastic bags!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WM63jixEeCky7PjAIUDW6Q"
  },
  "3jGcWdnJBQFXcWRvjHEjLg": {
    "date": "6/2/2014",
    "text": "Went in for a quick dinner around 6 on a Monday. I was seated immediately, but it looked like there would have been a short wait for parties larger than 2. Ordered the bibimbab for £7.50, adding (amazing!) beef for an extra £2. Overall a very quick, light, delicious meal. In and out in about 30 minutes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JYkb_VfjT1o_8tdbIiy2rg",
        "caption": "Photo of On The Bab - London, United Kingdom. Bibimbab with Beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JYkb_VfjT1o_8tdbIiy2rg/o.jpg"
      }
    ],
    "user_id": "KYIvVVCsUXb4CoqzLlyx_A"
  },
  "AFM7VZrmFUdQk1KruCe2xg": {
    "date": "4/27/2015",
    "text": "Tiny space. Get the bibibap with spicy pork, the pork is delicious. The chicken wings are also nice - go spicy. Would come back here for food; however, service is rude. They did not want to be there and even them getting us a glass of water appeared to be a massive inconvenience for them.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k5KzL1TVuqmF2WKX52VdPQ"
  },
  "6GL5xxFGSgFupRkAyRQ2cg": {
    "date": "11/15/2014",
    "text": "Great place for quick Korean food fix in Shoreditch. It's tiny (and popular with the area hipsters) though so come early or prepare to wait in a short line. Run by Koreans and it's pretty authentic w modern edge. I've eaten here 3 times now on recent business trips as it's close to my office and one office mate in particular loves Korean food. Quick service, tasty Korean staples like bibimbap and bulgogi. Try the Korean fried chicken as an app or the spicy rice cakes (tukpoki).",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1f5UXxerXwviq9H34NMr9Q"
  },
  "s3KDOnGbJwMnRcJtQ__5Lg": {
    "date": "7/1/2016",
    "text": "KA visiting from NYC. Found this place after checking out the flower market nearby. If you're Korean, I don't recommend it as quality is fast food-like and it won't satisfy your k-food cravings. It's definitely not worth a trek to eat here! Also being such a casual joint I didn't understand why they didn't allow outside drinks during lunch-esp. when there was no one else in the place wtf.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rrq-dw4-1CXBSTLqR9f_Hw"
  },
  "eO6PMQIC1Fiq_l-eUEjJRA": {
    "date": "6/21/2015",
    "text": "Personally I am a beer man but this place only serves cocktails! But we tried the vodka and kale cleanse one which is was surprisingly delicious and healthy! Sunday's are 2 4 1 so bring friends and make sure you know it's only cocktails",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HpwXsj2BLHD3OqkTaZCI0A"
  },
  "GNw8roGR1I1UIFmvM6Ugzw": {
    "date": "4/4/2015",
    "text": "I think 2.5 is closer...again I rant, why the f*** can't you look a bit happier when serving.  Both the girls working looked so miserable I felt like it was a warning and I should walk out.  I took a small amount of comfort in the couple of Koreans eating there and order kimchee jjigae, kimchee pancake, and risotto balls.  The arancini was a nice surprise, I think more could be done for it, but pretty good in general.  Pancake was nothing special and in fact served a bit cold.  The soup again, not much going on but I use a deep pork broth when I make it at home so not fair to compare.  I will go back a few more times to try other items on the menu.  I'm still looking for a \"home\" Korean restaurant but after 3 years in London I don't think this places gets me any closer to that....a boy can still hope.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AO49-lvWoC3E3WmFZcf-5g"
  },
  "x2ulMhFrRiik4_tKbVD8Mw": {
    "date": "4/9/2014",
    "text": "I ordered the bulgogi beef noodle soup. The restaurant was absolutely slammed and the food took about 40 minutes to appear (I knew it would take a while and so toodled off to get a smoothie in the interim). Bulgogi beef is full of deliciousness and made for a great noodle soup - a little bit pricy (hence the loss of a star), but I guess that's down to location. Ordering 'on the bun' looked like better value.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rGh9qla05uWguZpB-stUSQ"
  },
  "QO3iNyHIqxRYX1JfJNhybg": {
    "date": "7/29/2014",
    "text": "Two days, two fantastic Asian meals. OTB has been open for a while now and is getting pretty busy - had to queue to get in on a Sunday night. I've been a little bit wary to this point as it seems to be pretty trendy from the outside, but make no mistake - this place is totally badass and, trendy as it may be, the place has a Korean matriarch who seems to oversee things. Us being us, we went a bit nuts, getting a bunch of things from the 'Small dishes' section (jap-chae, toppoki, Korean arancini), a 'small' dish of Korean fried chicken, and two spicy pork buns. I also had a honey yuzu tea which, like Cocoro's, is utterly delicious. The small dishes are pretty small, served in small metal canteens or enamel dishes. The toppoki (rice noodle cylinders with kimchi, fish sausage, and chilli sauce) was definitely the star here, definitely the best I've had in London. The other two dishes were good - the japchae was solid with nice crunchy veg. The fried chicken is really good and served with a nice heap of coleslaw - don't let the 'Small' label trick you, you get a decent whack of chicken for your £11.50. The sauce is excellent too (trumping Jubo in that regard I think), getting the balance right between sweet, hot, and sour. Then the buns. I have to give it to them, OTB make one of the best buns I've had to date (protip, the sauce is back loaded so it gets progressively tastier as you eat through). They're really generously stuffed with delicious pork, and even though I was dangerously full at this point, I couldn't help but stuff my fat face full of the drippy goodness. Awesome. All in all, I had an awesome experience. Trendy maybe, but there is authenticity leaking through the cracks. On top of that, the staff are really really nice. I was absolutely stuffed (around ~£18 a head) and will definitely be back soon. I'm sorry I ever doubted and judged you prematurely, OTB, you truly are the babbiest.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "j7_FGnfY_rI4A2PFLZbkgw"
  },
  "ZCM9Krw3rfVgmc3XKNbkbQ": {
    "date": "2/20/2015",
    "text": "We had planed Chinese new year family dinner celebration at On The Bab but when they saw us with our two years doughter they refuse the entrance plus it was raining outsude but we had no other options other then look for another place in the area to have dinner. Very disappointed and it was a first place i've seen not allowing kids inside. There webside does not mention that this place is NOT FAMILY FRIENDLY place.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_40RCv7rZpKG_yrUYKHFg"
  },
  "7qezP9YyWNZGzpn0Oy8WrQ": {
    "date": "7/29/2015",
    "text": "Just tried eating there with my husband and baby, and were immediately turned away. They said it was their \"policy\" not to have babies in the restaurant. Complete BS.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBx56ZcMJtLea-ViVO2Rhg"
  },
  "KR0gFmFrkp_ZOU4tQBRrhw": {
    "date": "5/12/2015",
    "text": "£2 for a teeny tiny portion of kimchi or namool is quite outrageous.  The portions are so small, they should be free like they are in most Korean places - so that's one mark down.  The waitresses... I think they've lost the ability to smile, I've never seen such a miserable bunch in my life.  I went with a friend who isn't familiar with Korean food so he was asking questions, their responses were just incredulous and the look on their faces were asking why are you even here!  Another mark down. As for the food, I ordered the On the Soup noodles and while it wasn't awful - it wasn't great either.  The meat was incredibly stingy and there were just a couple of specks of meat.  Would I come back?  Probably not when there is the outstanding Jubo just around the corner for excellent Korean.  I can only think that the reason this place does well is because we are well starved for good authentic Korean in London.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "S3j75S77fm8eSd8JOBpO1A": {
    "date": "6/10/2014",
    "text": "This korean food captures the current gourmet street cart kitchen ethos. It cuts corners with ingredients - my bi bim bab had raw carrot and pickled daikon radish which are less labor and not traditional. The portions are smaller. But on the other hand, it does turn out some tasty food at cheaper prices. Knowing that these guys run Koba, their traditional restaurant on rathbone, you know they can do traditional if they want. But I guess this is what they think works in shoreditch. A sort of street food version of korean food. It is quick, filling, tasty but a touch disappointing.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOxvXx-3ks1HkExJFB-kEw"
  },
  "2wDzpBFpDJjjAb-xStc1Bg": {
    "date": "12/28/2015",
    "text": "This restaurant took my breath away, and after writing lots of yelp reviews I didn't think twice about giving it five stars. The food came lightning quick as well as the drinks, and I couldn't stop myself from digging in as my dish looked marvelous. I was submerged in wonderful, authentic flavors when I took my first bite. I ordered the bulgogi beef on a roll, and I was pleasantly surprised with the vegetables that came with. The flavors mixed together in my mouth to create a taste that anyone could enjoy when I took my last bite I was left wanting more so I ordered the chicken dumplings, they came out steaming and when I dipped it in the dumpling sauce and I felt like I was in paradise. The fried dough combined with the tender chicken and crunchy flavors created a sensation like no other. The only problem was the E in the merry Christmas sign had fallen. The decor was comfortable and cozy. No doubt I'll be coming back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMGWwsRUreWIoc2WI0asdg"
  },
  "m3681FvSirzemA_XoVosSA": {
    "date": "12/17/2013",
    "text": "New Korean place on Old Street I was fortunate enough to go to for it's soft opening.  Decorated in the current trend for exposed brickwork, but it's not distressed...note to self, if I shout at exposed brickwork will it become distressed and look more authentic.  Sorry!  enough of my nonsnse - kinda.  All the waiters were dressed like models in a Jean Paul Gautier ad just without the bulging muscles and stature.  It was crazy chaotic but the waiting staff still managed to be friendly, attentive and good natured - that impressed me.  We had some delicous fresh, creamy tofu, seaweed and glass noodles to share for starters.  I had the fish casserole, which was huge and delicious, but it came with lots and lots of broth.  If anyone were to have I would recommend getting an additional serving of rice or noodles.  All washed down with a glass ... or 2 of soju.  All in all a very tasty, satisfying meal without being the least bit heavy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jHOWvl9mU9VhkLGpFC6-TA",
        "caption": "Photo of On The Bab - London, United Kingdom. Wow!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jHOWvl9mU9VhkLGpFC6-TA/o.jpg"
      }
    ],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "zfBlwWCFLq8jdxs6awKd2g": {
    "date": "2/10/2014",
    "text": "Although I've only had the chance to try the takeaway here - I'm going to go ahead and say that yup, I'm a fan! If you do choose to do takeaway - note that the menu is scaled down from the normal men.I happened upon On The Bap walking home from a workout just the other day - I had noticed there was a new business moving in and was pleased to see quite an interesting menu.I tried the Kun Mandu (chicken dumplings) - though on the smaller side they were absolutely delicious.  For a main I tried the On the Noodle Spicy Chicken - a noodleised verision of a bap that had just the right about of spice, meat and veg (I often find myself over noodled!).Though the prices may seem a bit steep, compared to other noodles in the area (and there are a lot!) you get quite a lot in a serving - I had more than enough for both lunch and dinner.  I'm excited to get back and order off the larger menu during a sit down meal - it appears from 6:00PM they also have a cocktail offering.Don't forget to ask for a loyalty card!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cq1sO85GsfMrgNIdnuRRuA",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cq1sO85GsfMrgNIdnuRRuA/o.jpg"
      }
    ],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "KzT2Q7vDMk9OgbyjsUSKVw": {
    "date": "2/7/2014",
    "text": "I thought I already wrote a review for On The Bab. But I realized just now that I had only shared pictures previously. I was surprised to discover this place. My friend took me here saying he loves Korean food. I had no idea what to expect. I thought Koreans ate live squids! I was nervous. But the menu actually changed my impression. There were so many items to choose from. I chose something light. I don't remember the name, but after checking my photos that I posted on the day, I recollected it. I had OnTheBun with spicy chicken filling. It was amazing. But it was too small. It got over really quick. I also had plum tea. Sweet, warm, fruity tea, served in a steel mugMy friend on the other hand had Kimchi fried rice and seafood pan-cackes. I did taste them, and it was really filing. Great quantity for the price. I had to get another one, and I went for it. Had another set of OnTheBun with spicy chicken. I'll visit this place again. On other note, the waitresses are pretty and the Chef is amazing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mwIDobuU8-xuj3Axfek4rA",
        "caption": "Photo of On The Bab - London, United Kingdom. Kimchi Fried Rice. And seafood pancakes!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mwIDobuU8-xuj3Axfek4rA/o.jpg"
      },
      {
        "img_id": "5NjbP6z5AYBqdiLUtm0Wxg",
        "caption": "Photo of On The Bab - London, United Kingdom. On the bun - spicy chicken. Tastier than burgers. I loved it.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5NjbP6z5AYBqdiLUtm0Wxg/o.jpg"
      },
      {
        "img_id": "VD7My_XebqKH_Lxv6SohNQ",
        "caption": "Photo of On The Bab - London, United Kingdom. The toilet signs are so cute!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VD7My_XebqKH_Lxv6SohNQ/o.jpg"
      }
    ],
    "user_id": "3srPnKmmrWcdX-ZRrXEuRw"
  },
  "A-FnFIz_LfkxrULXLG8-1g": {
    "date": "7/12/2015",
    "text": "Good service, decent prices.  Went there on a Friday but early side and place was just starting to get crowded.  Loved the shrimp dumplings and Bi Bim Bop dish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAzYuKAHGDVoPbOHXdrLzw"
  },
  "8WgAmFOYig7KnYxhGuO92A": {
    "date": "3/2/2015",
    "text": "Waited 15mins outside for a table, but that was no problem. Seating is a little cramped but, again, enjoyed this as part of the atmosphere.Enjoyed every dish, especially the steamed buns, chicken bites, bibimbap and spinach pancakes.Will certainly plan another visit soon.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZrMJ837-GUVKX8ZA-J0YxA"
  },
  "Xe9Zjj1Ty-I7b131q6XGQg": {
    "date": "10/21/2016",
    "text": "Tasty tasty tasty! This little busy place is my favourite place in old street.They get very busy and long queue but it doesn't take long until you are seated.Tufo stew is my favourite but all other food choices are excellent too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ar8NA9FoOFmFXR9AWHLCpw"
  },
  "cApnmUPYhPpzlWgEeS2yEw": {
    "date": "8/10/2015",
    "text": "First time in korean restaurant. Pleasant interior, nice atmosphere and very fast service, probably too fast. My friends ordered straight away, but I have asked the waitress to wait for my choice. Unfortunately the food arrived in 2 minutes before she took the order from me. English level of the staff is really poor so I wouldn't count on their advise. 2 dishes arrived cold including beef buns and beef bibimbab. When we have asked about it, they told us 'yes it's cold' - why isn't it written in the menu? Not everyone is from Korea! Kimchi Bokeum Bab - kimchi bacon paella was quite tasty, though I can't say it about beef bibimbab. No dessert menu which is not acceptable for dessert lover like me. The prices are ok, the service charge is included which is funny to add when the staff isn't communicative at all. Too many restaurants to discover in London to choose this one again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "of2IRTsdiXgR8XN7CIsTbg",
        "caption": "Photo of On The Bab - London, United Kingdom. Kimchi Bokeum Bab - kimchi bacon paella",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/of2IRTsdiXgR8XN7CIsTbg/o.jpg"
      }
    ],
    "user_id": "aDuCNP69w159g874EYjSHQ"
  },
  "3sDd10b-7DOY8I1VpV_RJQ": {
    "date": "1/7/2015",
    "text": "Tiny little Korean street food restaurant near old street. Lovely staff. Amazing buns. We shared all sorts of things and they were all pretty good. A little expensive but they pretty much had one staff member on per two/three tables. Wine list is super pricey and I would like to see some local beers. Whatever you do (unless you are vegetarian) order the pork buns. They are so flipping good. They come out in servings of two but you can order one extra if you are a three. The dumplings are tasty too but very small serving size. The kimchi is a good mild 'beginners' kimchi to start people on. Fried chicken looked nice and I loved the tofu with toasted seaweed but the others weren't so sold. Kimchi pancake also delicious. Rice with veg was a bit yawn so would skip that next time.There is often a line at this place but it moves super quick. Food comes out fast and aesthetically this place rocks. Lots of beautiful design to take in without trying too hard. So I will be back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "onJgko2C3WB5XLqYHqD2MQ"
  },
  "6CJU9NtYt74emJPqQDU6xQ": {
    "date": "5/2/2014",
    "text": "Amazing place, despite the wait outside. Well worth your patience! Really reasonable price wise, although the fact you simply HAVE to try everything does mean it all adds up...! The toppoki is amazing, I have no idea what it's made of but it's a bit like gnocchi in a sticky sweet vegetable sauce (and that does not so it justice). The soups are great, my only criticism is the noodles could be better - they're a little bit too supermarkety and that lets the dish down. The fun thing is we had no idea what anything meant on the menu so just had to go for it - and we were not disappointed. At all.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tSZ7H4GibHpLw445bmWcKg",
        "caption": "Photo of On The Bab - London, United Kingdom. spicy pork soup.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tSZ7H4GibHpLw445bmWcKg/o.jpg"
      },
      {
        "img_id": "FNd949DxvyPZpXjnWwfM9A",
        "caption": "Photo of On The Bab - London, United Kingdom. Starters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FNd949DxvyPZpXjnWwfM9A/o.jpg"
      }
    ],
    "user_id": "GPeRVJU7Y_l9VzX02ZEn1w"
  },
  "2S9l7c5VXIhYNxw2VpiIjg": {
    "date": "1/4/2016",
    "text": "i am so ridiculous because I walked into On The Bap, ate some good food, walked out and only now just realised that the name alludes and points to Korean baps! #fail.So, I will plan to go back and check the baps out (wahey!), but in the meantime....I stumbled across OtB last week while actually trying to find this Vietnamese place nearby.My mate and I were starving and as he was over from NYC, I didnt wanna take him to a burger/bbq joint (although the following day we went to Byron...).Anyway, the venue is small so it was a little \"cosy\", and the authentic music was a little loud, but the service was good, and as I was feeling a little under the weather (not helped by the actual weather being sh1t), I ordered something a little more spicy. I wasnt disappointed and 45 mins later I was feeling sufficiently much warmer :) The menu overall looked good and there were a few things I recognised from other Korean restaurants as well as some other stuff that I hadnt heard of, that I would now like to try out. Like the baps.I shall return to sample the baps!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "j0rpbEOZQqydJkboCEGQ4w": {
    "date": "5/11/2015",
    "text": "The best Korean food around.the fried chicken is delicious! The Korean pancakes very good and the small arancini a pure delight!The best thing to do is to order several dishes to share with friends.Of course you may have to queue,  but it is very quick and it is definitely worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tl2lzqZEZVrMM04Yumrkg"
  },
  "XDfJZDajJ8XM2P5vy5OmXA": {
    "date": "2/10/2014",
    "text": "When my friend and I walked in and were able to get seated within five minutes on a busy Saturday night (at the window table!), I felt like I had won the lottery. When we tasted the food, I felt like I had gone to heaven.Here's the blow-by-blow:- Honey Yuzu tea: comes in a metal mug with a lid, and a cute wooden spoon. Sweet and tasty, with a light citrus kick coming from a healthy portion of yuzu at the bottom.- Kimchi mandu (dumplings): SO GOOD. Fried to perfection. I could eat three orders of this and be happy.- Kimchi jeon (pancakes): wonderfully crisp with a tender bite. Definitely more interesting if you eat it with the fresh scallion garnish.- Kimchi side: flavorful, not too spicy, could have used more of it!- Beef bulgolgi bibimbap (stuff on rice): excellent lean cuts of beef, well-marinated with a good texture. We were too full to eat all of the rice, but I polished off the deliciously crunchy pickled vegetables.- Japchae (glass noodles): perhaps the weakest link on a powerhouse roster of items, but still tasty. I would recommend reallocating the 4.90 toward other dishes. Like more mandu.- Spicy chicken bun: I wasn't expecting a bao-style sandwich, but boy, was I pleased with it! The two buns were huge, with a big bun-to-filling ratio (great for carb-loving me, a little much for my friend but she finished it in the end), and it was definitely the best value out of the items we tried.- When the bill came out to be just under £20 each, I was thrilled.Downsides:- It's not a place for lingering, as you would want other diners waiting for your table to experience OTB's delights ASAP.- Additionally, they ask you to wait outside the restaurant before you get your table. We were fine, but I'll bet it's not that charming if it's pouring or freezing.I hope I'm as lucky and get seated equally quickly next time I come, but this is food worth waiting for.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "X5K8HEHr6jh5J95s80wo4w",
        "caption": "Photo of On The Bab - London, United Kingdom. Heaven",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/X5K8HEHr6jh5J95s80wo4w/o.jpg"
      },
      {
        "img_id": "-VBVDsbDbNzKKf2kds1J-A",
        "caption": "Photo of On The Bab - London, United Kingdom. Spicy chicken buns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-VBVDsbDbNzKKf2kds1J-A/o.jpg"
      },
      {
        "img_id": "caZKzoDvrcWAGIrxpvpvHQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Perfect kimchi dumplings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/caZKzoDvrcWAGIrxpvpvHQ/o.jpg"
      }
    ],
    "user_id": "hhHdA-UuG5DG1XYXfClPtQ"
  },
  "d6L1XJRZMGG_gpbso_czng": {
    "date": "3/30/2015",
    "text": "Great, but tiny, Korean street food restaurant near Old Street. I don't recommend showing up at conventional eating times; we always aim for something like 6:30pm on a weeknight in order to secure a table quickly, and even then we sometimes have to wait. (They don't take reservations.) Easier to get a table on the weekends, as its proximity to Shoreditch/the City means that its a popular post-work option for professionals in the area.There are a few fusion items on the menu, including the kimchi paella and kimchi arancina starter (fried Italian rice balls stuffed with kimchi and cheese). Also a fan of the soy/garlic fried chicken and, of course, the bi bim bab. Prices are very reasonable and the staff are always friendly.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDuX9c2IRDx98OMXZIKxVg"
  },
  "gTrw9GNlYWmZyXS931NqEQ": {
    "date": "2/8/2014",
    "text": "We came here for dinner after work on a Friday, with a craving for tasty Korean food.  It seems that many other people had the same idea.  It was a full house and there was a line of patient people outside, even though it was raining and the air was crisp.  We weren't waiting too long, though, and we were seated on bar stools near the entrance.We are notorious for ordering a lot more than what would be sensible for a couple.  We ended up doing it again here, as there were just so many tasty-sounding dishes on the menu.We ordered the following things, which luckily came out periodically, rather than all at once:Pa Jeon (spring onion and seafood pancake)Japchae (glass noodles with vegetables)Yangyum chicken (fried chicken with crushed peanut, we had the sweet/spicy sauce)Spicy pork buns, from the eponymous On the Bab section of the meuBibimbapBaek ban (we had the bulgogi beef - it was like a bento box arrangement; it came with side dishes, rice and a miso soup).DrinksWow!  After writing that list and reliving the memories of the feast, it is amazing that we really ate that much food.  But, I regret nothing!My favourite dishes were the spicy pork buns and the yangyum chicken.  The buns were light and fluffy, kind of like the texture of steam buns from a dim sum restaurant.  The yangyum chicken was ideal comfort food on a cold winter's night and went very well with our drinks.If you are lucky enough to get a table big enough, I would recommend coming here with a group of friends, ordering many different dishes and just enjoy yourself.  We will be coming back here again, no doubt.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "NWPmjIV6KXDKnZkK9QuG7g": {
    "date": "6/30/2014",
    "text": "In one of those - found the right place because the place I wanted was out of business - situations, I very happily found On the Bab.  Excellent and authentic Korean food, served quickly and for reasonable prices.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVUIi0q38pAvsfuEEppe0Q"
  },
  "J1Pog2oGCqVkwLRcxJ365w": {
    "date": "4/9/2014",
    "text": "No point talking about the food, previous writers have it down. Super, really good, Chicken Soy Garlic maybe a wee sweet..whole chicken is hugeSpace is super tight and full of young (under 30 mostly) hipsters. My mate and I were only Londoners as far as we could tell..I could swear Scarlett Johansson was on a table but my mate said not..I would return for food but not comfort or waiting outside for a table.Just don't be upset by squished space  and wait time.We ate like kings, one beer, one tea 45GBP.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85Km-EQdJE39vcmMYz82sQ"
  },
  "YLoVlVKTVKkj-RRJInvkWg": {
    "date": "4/25/2016",
    "text": "Food is really good. Book in advance if you do not want to wait outside, the place is small.Waiters pretty quiet.They will see me again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "htkWPLdIQ97yk6-aVVwW7A"
  },
  "Oqvooeo09xSK_dq27FlxUg": {
    "date": "6/25/2014",
    "text": "Was here a week or so ago for a quick bite before a gig. Got the beef on the rice to go and some dumplings on the side. I wouldn't be the biggest expert on Korean food but I do know what I like and I found the dish very tasty. A generous serving of your typical mushy but nice rice and thin strips of beef with a salad garnish and dressing on top.I was concerned the takeaway portion may have been a bit measly but it was anything but. Service was relatively quick but difficult to comment on what table service is like. Not overly expensive and as its old street you can simply grab and go then pick up a few beers in the newsagents next door and make your way to a suitable place to sit and people watch. Would definitely return, this time for a sit down.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZc63UbbhiKXhM1DnHmRLw"
  },
  "FrZK8HbILRIVu34vqMGr6Q": {
    "date": "1/16/2014",
    "text": "OK so there's still an air of chaos regarding the seating, maybe they'll get this into a system or maybe it will become part of its charm.. time will tell! Anyway, the pancake and bibimbap were good but on the case of the beef bulgogi bibimbap, where's the spicy chili paste? There's some on the table but it's like a sweet British thing. I used the entire jar and it was still less than mild. I want a bit of fire in my life when I dabble in my Korean food! Over £4 for a Hite as well.. You know they're like £1 at Longdan.Just saying. The good was good though, just a bit British-ised.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "l5PVd3-gvSes0rMoMn_nWg": {
    "date": "2/11/2016",
    "text": "I ordered chicken dumplings for takeaway. The dumplings have good flavor but the skins were a bit gooey.   Also, a order is 3 pieces.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vZXvgC0Be1o1pCjHWSkKNA",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vZXvgC0Be1o1pCjHWSkKNA/o.jpg"
      }
    ],
    "user_id": "5BDNpjPp2Yfbgbp4M0OShQ"
  },
  "_ZcOSEz43Lx90VxlgrK52g": {
    "date": "2/3/2016",
    "text": "This place was recommended by a friend and I wasn't disappointed. Wow never eaten Korean food before but this place was amazing. As there were a few of us got to share some dishes. The Korean fried chicken was divine - half of them were ginger the other half sweet spicy. I also had the spicy pork on the noodles soup - was just oh my gosh. The egg in there was lovely and spices just right for me. We also tried the bulgogi beef on rice. Can't wait to go back. On the down side because it's small we had to queue - best to go when less busy so not rushing. The amazing food made up for the queue.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KFGFytblMdWGZiehbUz4fQ",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KFGFytblMdWGZiehbUz4fQ/o.jpg"
      },
      {
        "img_id": "uvwUhcg2F6xpKgMuLBNFzA",
        "caption": "Photo of On The Bab - London, United Kingdom. Spicy chicken on the bab!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uvwUhcg2F6xpKgMuLBNFzA/o.jpg"
      },
      {
        "img_id": "903-6AC2aF21IHsN-dssHQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Shrimp dumplings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/903-6AC2aF21IHsN-dssHQ/o.jpg"
      }
    ],
    "user_id": "Ntw9EXjF8TAZNtqBbDp4aw"
  },
  "s61YtIJt_JGzoc39qAmxbQ": {
    "date": "8/4/2015",
    "text": "Delicious Korean street food. I ordered the small plate of yangyum chicken which is Korean fried chicken served with crushed peanuts and in a sweet spicy sauce. I'm normal not a huge fan of fried chicken but Korean BBQ is a fav of mine so I figured this would be different and delicious . And I was right! So yummy. I also got a soup noodle bowl with vegetable fritters and a egg . The broth was so flavourful and the fritter and egg and noodles all went so well together ! Really enjoyed it ! I was so full by the end ! Like really should have gotten two small dishes OR the soup bowl... (Instead of the one small and soup bowl I got!) . I ordered a beer  too that I mistakenly thought was a Korean beer, but it was a Belgium or something haha . For so reason Korean food is like Mexican it just takes better with a beer! Must have something to do with the spices ! Delicious place, hoping to make it back again this week!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vHi2xl94xGQI8qoMBbLDyA",
        "caption": "Photo of On The Bab - London, United Kingdom. Bibibimbop with spicy chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vHi2xl94xGQI8qoMBbLDyA/o.jpg"
      },
      {
        "img_id": "hFX6PMQRO_Xs_J13Fn4bqw",
        "caption": "Photo of On The Bab - London, United Kingdom. Bun with a fried shrimp cake! Delicious",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hFX6PMQRO_Xs_J13Fn4bqw/o.jpg"
      },
      {
        "img_id": "IYcFG_lREv_u8-HZKujSag",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IYcFG_lREv_u8-HZKujSag/o.jpg"
      }
    ],
    "user_id": "BpKuNkYgAuisCNZlSzfUAQ"
  },
  "orEFHloMR6vvp8N4LMG4Cw": {
    "date": "12/13/2013",
    "text": "OnTheBab is a small place, great for a sharing meal with 2 or 3 of your friends, since they doesn't take reservations. They're on a walk-in policy. Heck, they don't even take names when you get there, so be ready to be very English and do what they do best, and queue.When japchae is on the menu, I always get it. OTB has it as a starter portion and it's great size to share. Other great starters? Saeng Dubu: Fresh tofu - it was so fresh it almost melted in my mouth.For my main dish, I ordered the bulgogi beef on the noodle, it wasn't bad, just wish there was a bit more meat in it though.Service was great despite how busy it was, they were very friendly and courteous, even if they have missed putting in an item we ordered. We weren't charged so weren't all that fussed.They might try to serve a table that seats four to those in parties of three or four first even if you're in the front of the queue with just you and a mate, so if you don't mind sitting with some randoms, do speak up and tell them seat you with another party of two.Overall, I like this place, it's relatively in my area, not too pricy, good food & good service. Will visit again in the future.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "rKGLC7k_ldnqlBENYsBqzw",
        "caption": "Photo of On The Bab - London, United Kingdom. Saeng dubu (fresh tofu)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rKGLC7k_ldnqlBENYsBqzw/o.jpg"
      },
      {
        "img_id": "tSGKP5VDX1GGOC8ZdluvXA",
        "caption": "Photo of On The Bab - London, United Kingdom. Bulgogi beef on the noodle",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tSGKP5VDX1GGOC8ZdluvXA/o.jpg"
      },
      {
        "img_id": "78PzjwKi1XXUlOKhAcy-5Q",
        "caption": "Photo of On The Bab - London, United Kingdom. Here's a blurry menu!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/78PzjwKi1XXUlOKhAcy-5Q/o.jpg"
      }
    ],
    "user_id": "tOzTi_wIS2Gajy90pscoMw"
  },
  "yo1T2h45ZGSyj7_wqVAeKw": {
    "date": "5/24/2016",
    "text": "OMG... You should totally forget your diet and run to on the bab if you like korean street food, baos, kimchi and fried chicken! I love baos (almost impossible to find in Brussels, my hometown) and I was so glad to discover On the bab during my short trip to london. We tried the spicy chicken bao and the \"kind of\" maki with kimchi and seaweed salad on the side. Everything was so tasty! We (me and my sister) truly loved it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5cY-tnFXLVV_8_g5SKABJw",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5cY-tnFXLVV_8_g5SKABJw/o.jpg"
      }
    ],
    "user_id": "sESi4-K5f5MGTvNuEUr5lQ"
  },
  "UxzC5Zdpcmv82LHrO18HYw": {
    "date": "7/26/2015",
    "text": "Loved the kimchi pancake and fried chicken, a small portion of fried chicken would feed 2 people just enough as a side.The environment is great but the seating can be very tight and uncomfortable.People always queue outside so get there early.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g6DjRG5GgH_ox1HnVvL8tg"
  },
  "VwZR-O3JmlgCb2-Z5iP-Dg": {
    "date": "3/26/2016",
    "text": "LOVED IT! i had the veggie bap, it was delicious, mouthwatering good. The place is very small, but if you are prepared to wait, it's worth it. they had very good looking bibimbaps. looks like the place is frequented by native people, so it can only mean authentic. I loved every mouthful. I only wish i lived closed to this place.recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tkzWc6pqwccL5w08DRHfPA"
  },
  "uwziqLfQr743l7cpD4aLdw": {
    "date": "1/30/2016",
    "text": "Not much I can say about this place other than, the food is amazing. They've got me addicted and I spend too much money with them every month! I might actually pop down there after writing this review.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "_WjOJazwr9dIY7rIKmcIfQ"
  },
  "J6uD6mdjcs0Oa3p7mLDrlA": {
    "date": "4/5/2016",
    "text": "This little restaurant made me fall in love with Korean food:) Their kinchi stew is out of this world. Same as their pork bab (the sauce is amazing) and spicy schrimps are the bomb. Extremely friendly staff. The korean pop music made the atmosphere even better!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mbc9Et9Ro-lofE0n9aPpyA"
  },
  "K5JaPQV2mKbh0jOTNfhhPg": {
    "date": "6/28/2015",
    "text": "The Korean-style food is pretty good, and it can be cheap if you want it to be.  You can get a bibimbap (£7.50 bowl of rice, meat and vegetables with an egg on top) that is filling and delicious especially when large amounts of gochujang (spicy fermented bean paste) are mixed in.  You can probably share one of those between two of you so that you can quickly line your stomachs and get back to your Shoreditch Triangle™ pub golf tournament.I wonder if this type of evening out is hinted at in the restaurant's name?  On the lash and on the pull, then on the bab before getting on the last train back to Chelmsford?  The clientele are young and trendy so On The Bab will have to try harder if they want to pull in the jeans and untucked-button-down-shirt crowd.With our bibimbap we also shared a medium portion of fried chicken wings with cabbage salad.  The wings were essentially sweet and sour fried chicken wings, which didn't seem very Korean, but they were delicious.  Cabbage kimchi and daikon kimchi is available at £2 a portion (quite small: we had four during the meal) and is served in sealed stainless steel pressure containers that look like they could comfortably contain low-level nuclear waste.  I would love to get hold of some as I've disastrously kept kimchi in my fridge before using only regular tupperware causing the entire fridge and its contents to become kimchi flavoured.If you happen to be on the lash then bottles of lager (Asahi, £4.10) will add a bit to the price of your meal, and brought ours to £50 including service for two people.The staff uniform is based around breton striped t-shirts.  The walls are part panelled with tongue and groove woodwork with little wooden hat pegs, and the bathrooms have rotating savon de marseille soap holders.  The weirdly out of place Frenchness is however offset by pounding K-pop which remains novel and exciting for at least half an hour.(Our fried chicken wings, intended to be eaten with our hands, came with some On The Bab branded moist towelettes to help clean up after our meal[1].  Sadly, they were perfumed to have the scent of chewing gum, so if you find this smell unpleasant -- I do -- you may want to avoid On The Bab.  Most customers are given them and the smell wafts throughout.)[1] Relevant Dilbert comic: dilbert.com/strip/1990-0…",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "74CB-0VDEWZl1V59jWD-Qw",
        "caption": "Photo of On The Bab - London, United Kingdom. Medium portion of sweet and sour chicken wings with cabbage salad.  A very good dish.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/74CB-0VDEWZl1V59jWD-Qw/o.jpg"
      },
      {
        "img_id": "9l58pm96yIU9sfPvOApPqA",
        "caption": "Photo of On The Bab - London, United Kingdom. Rustic details and traditional French truck-stop soap.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9l58pm96yIU9sfPvOApPqA/o.jpg"
      },
      {
        "img_id": "hW0-dddlmQzVohp-KiF3XA",
        "caption": "Photo of On The Bab - London, United Kingdom. Breton stripes for the staff.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hW0-dddlmQzVohp-KiF3XA/o.jpg"
      }
    ],
    "user_id": "b5AnUV6NiSdZ4-KSKb3Rmw"
  },
  "UWsakukMeRIv0xulvKEDwg": {
    "date": "3/14/2015",
    "text": "Great Korean place for a bite early in the night as I hate waiting in line. We sat at the back table which means we're pretty ignored by the staff but despite having to ask for everything the food was really good. Especially great as I had plenty veggie options for myself and my friends loved the chicken wings etc.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bl8DYyL-_Espn6w30xifYg",
        "caption": "Photo of On The Bab - London, United Kingdom. Veggies the Korean way :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bl8DYyL-_Espn6w30xifYg/o.jpg"
      },
      {
        "img_id": "kEA9tU1DhoIbzIi9cKXS4w",
        "caption": "Photo of On The Bab - London, United Kingdom. Tofu!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kEA9tU1DhoIbzIi9cKXS4w/o.jpg"
      }
    ],
    "user_id": "ZQ0r3LdgDtKCik5jUmqMUg"
  },
  "dhrjBy2GN3Qy9DI2_kNORw": {
    "date": "12/9/2014",
    "text": "I've only been here when most other people aren't here, ie not at lunch time or dinner time but in between. If you go at those times, prepare to stand outside in a queue. The place is pretty small inside with limited seating and has clearly been formulated from the book on how to do hipster restaurants: 'street' food, beat up white enamel dishes and metal dishes, almost illegible menu written in tiny brown letters on brown paper, brick / tile walls, whatever. Fortunately overall the food wins out.My favourite is the spicy noodle soup with beef. It's got those curly noodles like the kind you get in packs of instant noodles but works perfectly with the spicy broth and other ingredients. Warming and satisfying comfort food.The korean fried chicken with sweet, spicy sauce is amazing. It comes in different sizes ranging from very small to quite large so take your pick.The noodles with seafood was less successful having scant seafood and gritty mussels, just not as good as it could be.Service was pretty good and food comes quite quickly. Prices are reasonable.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "d0DGZRp6lHXGECJSc_nn-A"
  },
  "XyfM6-63_yOSPD4EW79FZQ": {
    "date": "4/15/2016",
    "text": "Sorry to say I found this place very average, it also had a hectic atmosphere that wasn't very relaxing. The four of us were seated at a cramped table with not much room, and then the food didn't make up for this.We all had On the Bun, with chicken, and it really wasn't anything special. Maybe we just ordered the wrong thing, but I was also disappointed with the size of the portion. It wasn't what I was after and it was surprisingly expensive for the small buns we received.I'd say definitely try this place out to see what I'm talking about, and to also may be try their sweet buns, but I don't think I'll be going back unfortunately.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nb_mnq4fTYz8W7MyfCJQbQ"
  },
  "LS06fmrXcc8LV0i94sKjXw": {
    "date": "2/4/2017",
    "text": "Love the Fried chicken the best!!! Just taste so good!!!!!! But the one with rice noodles was really not a good dish to choose. Besides, the bibibab tastes delicious as well. But still, rank the Fried chicken for no.1!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iKA5NWkPuIR5Ha8olWvwOg",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iKA5NWkPuIR5Ha8olWvwOg/o.jpg"
      },
      {
        "img_id": "n40PWdkhry6FL1F-0vxg9A",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n40PWdkhry6FL1F-0vxg9A/o.jpg"
      },
      {
        "img_id": "40bLToFLnD73-NCrN-TBSQ",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/40bLToFLnD73-NCrN-TBSQ/o.jpg"
      }
    ],
    "user_id": "bGcX839Ln1mvEF6Q56RgOg"
  },
  "bD6hgwdNAeRw66RfgvTGpw": {
    "date": "11/4/2015",
    "text": "My absolute favourite establishment in east London, next to Patty and Bun.I've always had it as a takeaway as there is often not enough space to sit inside - a testament to its growing reputation I suppose. I usually either get the bulgogi beef or pork 'on the bab' (i.e. on a bed of rice, which includes delicious coleslaw with lashings of spicy mayo, bit of kimchi, some pickles, spring onions) or the bibimbab, but I've gotten the spicy chicken before, which is also good. Very very filling and not especially unhealthy - the meat is marinated in a kind of dense, slightly sweet and spicy sauce (I mean dense as in the flavouring penetrates the meat quite intensely, I don't mean that the sauce is sticky or gloopy) and the sticky rice is very comforting to 'discover' at the bottom of your plate. Starters also very good - had the kimchi and arancini balls, very crispy and the dip was great.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KR0PWT6JW8Z06dWMjdp-sg"
  },
  "DAPAj_MJ5LIqV4ivwQC63g": {
    "date": "6/18/2016",
    "text": "Excellent and quick Korean BBQ.  Lunch only and no seating as it packed with people.  Also they don't take American Express which is always a downer for me.  That said will definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xxm0u_LkGkHj4u-_4xCuyg"
  },
  "caaxqSvMP313KVmv9xKDrw": {
    "date": "9/9/2015",
    "text": "Last night we were craving Korean and decided to try OTB. There was a line in front so I thought this place must be good. Now, I've been spoiled rotten with amazing Korean restaurants in LA and the OC. Korean food is my favourite cuisine. I love the flavors and all the condiments. Listen, if you really know Korean food, most likely you will not like this place. Just saying. I ordered the Bibimbap without meat. I wish they had a veggie version with mushrooms. Btw, it did not come with kimchee, so I ordered a side of it. The entire dish came cold. The egg on top was chilled. The portion was big for me. I didn't finish it. The Mr ordered a medium portion of wings (12), half soy garlic and half sweet and spicy. He said the soy garlic was better. We also ordered an appetizer. It was a seaweed salad. It was good. The aloe punch was also nice. The staff and service were good. The buns looked yummy. I don't think I'll return.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYuDfyHg-AalZUHLn48Kkw"
  },
  "IIS3xyNBN4svjdh7z54r7A": {
    "date": "6/29/2014",
    "text": "Finally made it to this place after hearing from friends that it's a 'must try' spot...We managed to get a seat for four around 10:30 (last orders by the way) in which the waitress was keen to tell us. After settling in we ordered the seafood pancake and shrimp dumplings. The starter portions were very small, a little too small for my liking. I think there were only three dumplings. The dumplings were well seasoned, and had good sized chunks of shrimp in them too! I felt the seafood pancake tasted a bit 'doughy'. Almost like it wasn't thoroughly cooked through. Not sure if this is how it's supposed to be, but at the time I wasn't feeling it - I may it try again upon my return... For main we went for a large portion of Soy & Garlic Fried Chicken with crushed peanuts and bowls of rice. The chicken was glistening from it's sticky coated sauce, I couldn't wait to get stuck in! Included in the tray of chicken was coleslaw with some EPIC sauce which the waiter described as Korean Mayonnaise. I wanted to take that sauce home with me, we were all trying to figure out whether it was store bought or homemade. The waiter unfortunately confirmed that it was homemade...boooo! The selection of chicken was perfect - boneless chicken thighs and bone-in wings (winning combo in my eyes). It went beautifully with the plain rice.To drink I went for the So Maek (recommended) which is Soju with Beer. It was served ice cold in a metal canister style bottle, and went perfect with the meal.This was my second time trying Korean cuisine and I can honestly say some of the best fried chicken I've ever tasted! If you're around the area, do yourself a favour and try On The Bab!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oLtT_ZtoTg0GA-p2QA3CCQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Large portion of Soy & Garlic Chicken with Crushed Peanuts and Coleslaw.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oLtT_ZtoTg0GA-p2QA3CCQ/o.jpg"
      }
    ],
    "user_id": "nFDGc5wmRmPDynJ24ymncw"
  },
  "WtUucf96o8f6eLaYGrkHJg": {
    "date": "6/21/2015",
    "text": "This Korean joint in the heart of Shoreditch always seems busy.I had:Plum Tea - Very nice. Very addictive. 8/10Spicy Pork buns - Bit sloppy but good 7/10Spicy chicken wings - Very good 8.5/10Egg, Kimchi and Slaw - Good  7/10Can't help but think it's not totally authentic (like in New Malden) but it's good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "syQSJ7YOH7eW2eQeDAbxhA": {
    "date": "7/16/2015",
    "text": "Today was the second time I'd been and I got the same thing I had before: the spicy pork noodle soup. Let me just say that for £8, that is a massive pot of soup... but soooo delicious. The servers and menu make things kind of confusing (i.e., my girlfriend ordered the spicy pork buns and he said, \"do you want two portions?\" which is what is on the menu -- 2 buns -- and she said, \"how do you mean?\" and he said, \"do you want one portion or two?\" and she said \"are you saying I could get individual buns of different flavors?\" and he said, \"if you want two flavor buns, you need to pay full price for an order of two portions, but if you just want one bun, it's £3.90\" -- so that was confusing. Just say yes if he asks if you want two portions.) but it's pretty straightforward otherwise.It's a tight squeeze in there, you'll get cozy with your neighbors when they get your butt in their face as you try to sit down, but hey, that's London, eh?I'll be back -- it's delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eH5cPO1SV9hTVktzenjYgw"
  },
  "u767O6u_1mmqtXju1E-Crg": {
    "date": "2/23/2015",
    "text": "I suppose the appeal of this place is that there isn't a satisfying Korean place in London. NO I don't think Kimchee fits the bill. Paying for panchan is a blasphemy. And having your soondubu jigae swimming in chili oil is not right.BUT I will commend the buns here. The pork and chicken buns were loaded with meat and sauce. I would come back for them.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "jSVrOA6elsGU7mOpg5lwkA": {
    "date": "10/9/2018",
    "text": "I think the food served here is more a modern take on Korean cuisine but it's pretty delicious!The restaurant is casual and feels very homey. The prices are pretty reasonable and the service was quick too. The only negative is that there's always a wait whether for lunch or dinner. My friend and I came here because we wanted Korean fried chicken. This location only serves the soy ginger and sweet spicy flavors (you can do half-half) but the other locations seem to do more flavors. I prefer the sweet spicy more (although it wasn't spicy at all) and I also really liked their spicy mayo which they drizzle generously on the side cabbage. We also got the Beef Bibimbab which was a delicious classic but I'd like it more if it was served in a stone pot. The Soondubu Jigae was also nice but we only got very few pieces of seafood in our serving.Overall, the food here is pretty solid and decently priced. Other than the long wait, I can't think of another reason why I won't come back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mliGcEnNGEE4VuBoU6bSZw",
        "caption": "Photo of On The Bab - London, United Kingdom. Back: Yangyum Chicken, front: Beef Bibimbab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mliGcEnNGEE4VuBoU6bSZw/o.jpg"
      },
      {
        "img_id": "zbyV7CHFuoGGoY6aEk1ORQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Left to right: Soondubu Jjigae, Yangyum Chicken, Beef Bibimbab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zbyV7CHFuoGGoY6aEk1ORQ/o.jpg"
      }
    ],
    "user_id": "vGn4kW2dWSagcy52pM5_pQ"
  },
  "AHLA_9OxvlBykdeEH8Cozw": {
    "date": "10/25/2018",
    "text": "They were out of rice. ...Beef Bulgogi tasted like bad fish. Noodles weren't cooked through. Staff was very nice. Pickles were good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ksmi2P_R-M7_3lLC3wGc9g"
  },
  "-568UP8n-G68KPZ6kISHKg": {
    "date": "4/13/2018",
    "text": "The spicy pork bao is delicious and a meal in itself. The fried chicken in sweet & spicy sauce was great and the bimbimbap was good. The food is very reasonably priced. The only drawbacks are the line outside and the lack of space inside, but if you order it to go you won't have to deal with it. The food is definitely worth the wait though.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z2gbygDwi0S5gu_71YGV4g",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z2gbygDwi0S5gu_71YGV4g/o.jpg"
      },
      {
        "img_id": "SsGKloE8EdGIsPq0q8zVJA",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SsGKloE8EdGIsPq0q8zVJA/o.jpg"
      }
    ],
    "user_id": "FiCR7moMbwPHZOvuby9JHw"
  },
  "qv001q_H2WG2Vq281an7Qw": {
    "date": "5/6/2017",
    "text": "Pretty good bi bim bap! There is usually a wait, so be prepared. But the service is quick and friendly, and the cute decor and low lighting soften the high level of activity. It's a cute place, with a tiny bar and staircase leading down to the facilities. The pricing is very reasonable, our bill came to just under £30 for two veggie bowls, two teas and a seaweed salad. The salad was tasty, but not fresh. What really made it for me was the plum tea, it was so satisfying for my sweet tooth! I can't give full marks because the star dish was missing a bit of flavour, and we were really crammed in together, causing some discomfort to us and neighbours. But I'd definitely come back on a quieter day, for a quick fix of one of my favourite cuisines ... and looking forward to trying their kimchi, pancakes and the 'new' octopus salad!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "kbws_HWtzkXlibPA1zux3Q",
        "caption": "Photo of On The Bab - London, United Kingdom. Bi bim bap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kbws_HWtzkXlibPA1zux3Q/o.jpg"
      }
    ],
    "user_id": "hCLGgtfo4bCXOzGNuYHvdQ"
  },
  "-CR2qy9uLkHoJgTD-eJDyA": {
    "date": "6/9/2018",
    "text": "Reasonable prices and prompt service for a yummy bibimbap and dash water (like sparkling Hint). Tiny place, but I was dining solo, so nabbed a seat along the wall. If you're in a group expect a wait.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vOzgNV2E2o2ulGX2PV_ilA"
  },
  "S4wPgBa1FYAlve6bAGnUow": {
    "date": "5/23/2017",
    "text": "Even as a Korean, I fell in love with this place! Had their bibimbap with bulgogi and fried chicken. The bibimbap had a very satisfying amount of vegetables and meat, and the chicken was flavorful and crispy. All at a decent price!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VSeUlusAhOf38GH3yR8xkQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Bibimbap with bulgogi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VSeUlusAhOf38GH3yR8xkQ/o.jpg"
      }
    ],
    "user_id": "7jmAvbN-jAuFDJNhyX0qxQ"
  },
  "kiA4m07LvE4I3CM7mIn5wg": {
    "date": "6/15/2016",
    "text": "On the bab is probably famous for the bibimbab and this is what you should get. The ladies at the table next to us had botch huge bowls which made my small kimchi stew looked pathetic (it wasn't but the beauty pressure from the other table was real).The food was over all nice, the staff friendly and the music korean. I would come back to this spot for some quick lunch but probably not for dining and chit chatting since this venue is rather small and not the coziest place on earth.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NmSgkzFaUx-GkqQ5Wk11ow",
        "caption": "Photo of On The Bab - London, United Kingdom. Seafood pancakes and tteokbokki:)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NmSgkzFaUx-GkqQ5Wk11ow/o.jpg"
      }
    ],
    "user_id": "rIwCIE_pOfJcJrPgTeVsAA"
  },
  "O8ijant-j-A9E6x8XZ5WyA": {
    "date": "11/5/2017",
    "text": "Been here several times already. This is apparently a very popular Korean restaurant in the area, always have line at night, best go there for lunch if you don't wanna wait lol.The food is pretty good, nice and pretty staffs, and I really like their tea drinks (Yuzu tea, plum tea)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgM5hDdaWbi5ig9CHQ7P6w"
  },
  "DOPRxrw3clb_eDKHKejStQ": {
    "date": "7/9/2018",
    "text": "Really good food, the price is not to high. Even if the queue is very long, the time is worth the food we had !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoTkYBqplnFZNgL9G6LqRA"
  },
  "SBmCwbah-GiUHNiJ_ddRdQ": {
    "date": "9/3/2017",
    "text": "Nice small restaurant with a good and quick service. I had the spice tuna Bibimbap which was very tasty. You get a lot of toppings and just the right amount of rice. It is not a cheap restaurant but it is reasonable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nz_pYp8E78me5xcp0NwC0Q",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nz_pYp8E78me5xcp0NwC0Q/o.jpg"
      }
    ],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  },
  "J-Q5sbWv_13nzRPwstPCNQ": {
    "date": "1/2/2018",
    "text": "It's really a 3.5 since the food is great and comes out crazy fast but this place is just too small! Four of us came all the way to London to visit a friend and they can only seat parties of 4 or less!? We ended up getting lucky and sitting at bar stools against the wall but that's not exactly conducive to socializing. They forgot our cocktails and took ages to bring the check, which is strange considering they only can have about 25 people in there and there was a crazy queue outside. But I get the hype- for the price the food is very very good!!!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYjRexxq37QqbwkakptyQg"
  },
  "WzrzLHC5ykWK88fDxsRcPg": {
    "date": "5/27/2018",
    "text": "The food was decent, but there was a rock in chicken buns and I almost chipped my tooth!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-YRuiO3CYaHhKBejQYJOg"
  },
  "tjyFJwKRC2PEc7ylV7nKxg": {
    "date": "12/30/2017",
    "text": "Pretty good and affordable too! I don't think I would wait outside for 40+ minutes again, but I wouldn't mind another go with minimal wait. I got the budae jjigae and shared a few apps with friends. Fun and chill vibe in the restaurant - dim lights, etc.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COlsr3ylbrZi2miqbY9ZlA"
  },
  "iQl8pZ8x0RxDhz2FMgwUoQ": {
    "date": "2/18/2016",
    "text": "I wasn't deeply seduced by my first visit here. I love the idea of bringing korean food to the masses through this fast/urban type of venues, but my experience yesterday was \"in a hurry\". It starts with the queue (kind of getting used to that by now) but we were asked to wait outside in the rain..a joke. Our bibimbap was tasty but wasn't very hot so got cold very fast. Buns were good, korean fried chicken was definitely the best...waiter advised to take the big portion but this was just too much for the 2 of us. Horrible teenager music playlist, noisy and in a hurry...will have to come back as this went just too fast to enjoy.",
    "rating": 3.0,
    "rated": {
      "useful": 8,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "2kVfqTxih4a0uUMXGbZ3WA",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2kVfqTxih4a0uUMXGbZ3WA/o.jpg"
      },
      {
        "img_id": "89Dv21WBLZrdam3bzbFIrQ",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/89Dv21WBLZrdam3bzbFIrQ/o.jpg"
      }
    ],
    "user_id": "4Qzu3MooyeO_vB-tNiQ1RQ"
  },
  "GqrTtzd-K25KutPUDbb0gg": {
    "date": "12/5/2017",
    "text": "I wasn't in London long, but this was the best meal I had while I was there. I literally didn't put my chopsticks down until my plate was clean. It was a great lunch, very satisfying - I'd definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MNrHZGH9d_oIFSkEWk6BIA"
  },
  "qenmi7ipFm8qfdWGXgGoTw": {
    "date": "2/7/2018",
    "text": "went there after reading rave reviews on yelp. it was freezing out yet had to cue outside with no clear indication of how long the wait would be or explanation why they were taking long time to sit people in when i could clearly see two tables were available. finally got in and ordered bibimbop with beef and a small order of soy garlic chicken wings and have to say they were just ok, not as amazing as other reviews described. as korean i can assure you that bibimbop, or bibimbap if you insist, is practically impossible to screw up and the fact they didn't bother to cut long strips of beef into bite size showed that they were more concerned with how it looked. the wings were fine but again not worth waiting for half an hour in freezing temperature.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMELLzeoKvZLt8oMHJNu0A"
  },
  "GTL74EY9DIfm_h3AOp4i6g": {
    "date": "7/23/2017",
    "text": "Food was delicious and was served quickly. I had the \"on the rice\" with beef which included rice, shredded cabbage with a mildly spicy sauce, and tasty bulgogi beef with cooked carrots and some other veggies. I also got a hot plum tea bc I saw it mentioned on here - sweet and tart, just the thing for an overcast day!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJAqt3U9L8UaeWwsqg263Q"
  },
  "HjS0BMjIkBqmWqO05cCObA": {
    "date": "4/7/2018",
    "text": "Cute Korean restaurant with a very authentic feel in Shoreditch. My fav dishes were the Korean fried chicken, jinga and onion pancakes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9wU9uMzC0O3b9HMNElKNuw"
  },
  "XH_dN2_fuG3ZWTLZbAtsHw": {
    "date": "2/8/2018",
    "text": "Instant noodle for their soup noodle dish!!! I would be ashamed to serve that to my customers if I owned the restaurant. Sure, Korean instant noodle is tasty but why should I wait 40 mins outside the store for a £9 instant noodle dish if I could just have one at home??? I find the food there quite expensive too, 3 small dumplings for £4. No idea what the hype is about. Will not go back.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7519XbOrJCSjxaZiMD2o7g"
  },
  "usiZPw6UvtLP2bOJ9g_y-w": {
    "date": "11/30/2016",
    "text": "I tried Korean fried chicken here. It was amazing. After I first came to this place, I cannot help thinking of ordering kfc again. So I used deliveroo to order it second time. I will definitely try bibimbap and something else next time. Strongly recommend this place!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OMMpnnuYwpwO5yPcvpacXA",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OMMpnnuYwpwO5yPcvpacXA/o.jpg"
      },
      {
        "img_id": "lES3TLlkjcJ6--4tegxz0g",
        "caption": "Photo of On The Bab - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lES3TLlkjcJ6--4tegxz0g/o.jpg"
      },
      {
        "img_id": "MEQ2x3G5Q5zZ_zR_W4-iwQ",
        "caption": "Photo of On The Bab - London, United Kingdom. Medium sweet spicy! Love so much!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MEQ2x3G5Q5zZ_zR_W4-iwQ/o.jpg"
      }
    ],
    "user_id": "T8BVtDdRYqtpi7a0FBxVzg"
  }
}