{
  "00pLkySZ2XIZWZOKLU3p-Q": {
    "date": "1/28/2013",
    "text": "We stumbled upon Cote's on our first night in London. Service was not the best, perhaps it was just our waiter.... I was hoping he would recommend a few highlights from the menu but he didn't even though we asked. Food was delicious and it was great value. It's a pretty big restaurant and was full on a Sat night at 8:30pm. Will come back for a stable meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ti-niM7abd35LRHHc3Ui9g",
        "caption": "Photo of Cote - London, United Kingdom. Chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ti-niM7abd35LRHHc3Ui9g/o.jpg"
      },
      {
        "img_id": "d2_tp7Y2D9VgSLzVBXXYDA",
        "caption": "Photo of Cote - London, United Kingdom. Sea bass",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d2_tp7Y2D9VgSLzVBXXYDA/o.jpg"
      }
    ],
    "user_id": "fPiFXF-7omeURbpZAY8ZWw"
  },
  "PSoxkg7r-w94DUveV7uSuQ": {
    "date": "11/4/2012",
    "text": "Excellent value for money in this well located restaurant.The wine list is very interesting, and the wine is good, well served, and at the perfect temperature.It accompanies the main courses divinely, be it some exquisire pièce if Beef (cooked to perfection), chicken, their sauces and delicious fries, or any other dish.The dessert list is equally great, with lots of delicacies to choose from. Personally, I can recommend the Creme Caramel... The service was fine yet oddly unfriendly...But that did not prevent us from spending a great night there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NWPw2mY-82hmNNJpp84R-A"
  },
  "U1NadFSGUhmFA8y3dvbImw": {
    "date": "8/23/2010",
    "text": "Went for the pre-theatre menu at a friend's recommendation.  We were promptly seated at a nice table in the corner which was nice because the breeze was the only for of air conditioning (it was around 33 out).For the price I feel the three course was quite right, though nothing too outstanding.  The soup, a bisque, was tasty but without any ground pepper to be found.  The pan fried cod was pretty much just fancy fish sticks, and my creme brulee was awesome.  My dates (DATES! Suck it.) each enjoyed their meal, but the dessert they split, some sort of odd caramel filled pot thing, left much to be desired.Oh and the gratis filter water was a nice touch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BgopO420lx2-fCMRDszzQ"
  },
  "23u7hn9EbzXQrCosSW-DSQ": {
    "date": "5/16/2014",
    "text": "Regrets, I've had a few, and Côte is not one of them! Excellent staff, food, and ambiance. Try the duck, can't go wrong. I can't wait to go across the pond again, this will def be my first dinner when I'm in town. Thank you for everything Côte!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0nALgpcBMjGQl8pBEByJA"
  },
  "T8HeXAFm9KGN9X-dFq0MMw": {
    "date": "6/1/2010",
    "text": "Got taken here last Friday by two business acquaintances, and as a place for a relaxed business lunch it was very good.We stuck to the fixed price menu and all opted for the vegetarian option: a pea risotto, with courgettes, asparagus and broad beans. Don't be put off, this was very tasty.Dessert for me was a \"chocolate pot\". The pot was a little bigger than an egg-cup but what it lacked in size it made up for in taste - rich and bitter-sweet beneath a creamy white layer (should have ordered two!)Expresso coffees were even smaller - a one gulp cafeine hit that helped jolt the sense back to reality after a couple of bottles of beer.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "xX8Dzb18tkGCw-xmVy0knA"
  },
  "yGPoRfbU5JdA9E1YtJ_V_A": {
    "date": "2/7/2010",
    "text": "Came here for a pre-theatre meal with my Mom. They have a two course or a three course meal you can choose from.The atmosphere is pleasant and Cote provides fast and friendly service coupled with serving simple food well done.This is a popular spot to eat at for pre theate/show meals.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "KETa97Knz4ZJZPv53CHGcg"
  },
  "aLwKuUbPb1JlRm2h9i4ChA": {
    "date": "3/29/2010",
    "text": "I went with 6 friends late last week for a meal - foolishly we were too late for the fixe prix menu but the prices are very reasonable so no concerns reallyWe all had a starter, mine was mushroom feuillete which was okay but not knock down marvellous.  The others reported highly on their startersMy main was Duck Confit, good and a very reasonable price.We had several bottles of wine and a couple of beers and with one person having desert and we had a few coffees.  Total bill something around £220 plus service.A couple of gripes, they wouldn't let us have the bill, we asked three times and I think the boss overheard the third time when I had gone up to the bar area to ask and remind them that we had already asked twice.  So it took 20 minutes after finishing our food and drinks to get the bill. Next time I will ask for the bill when I order the coffee.The desert, quite a delicate tarte fine aux pommes, was served with a large spoon and fork as you would get at school diners for a big bowl of spotted dick and custard.  Tarte fine suggests a smaller spoon size not some lumpen thing so a teaspoon was used.  Time to improve their cutlery",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B51-WjhKFcR58THOoj4i-w"
  },
  "4tbiBk5-xQ0rlChDiUR-CA": {
    "date": "2/9/2015",
    "text": "Good fair priced French cuisine. Their menu is very impressive. Happy to have found it just walking around.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQCCZ0CUC5BebN1RGvgHGw"
  },
  "FHfJ06EBIIeedcKrjppBpw": {
    "date": "11/16/2008",
    "text": "For a truly splendid taste of French fare, go to Cote Bistro. One evening, my roommate and I discovered this newly open restaurant and stayed for hours. From the moment we entered, we were warmly greeted by the host and were able to sit near the front widow to enjoy the view of Covet Garden.I ordered the Pissaladière, a delicious warm flatbread with caramelised onions and reblochon cheese to start and for my main course, I had the Duck leg confit which is reasonably priced at £10.95. The restaurant is simple, yet chic. It spans over three main dining rooms and would be a great place for a private party or romantic evening out. The service was impeccable, as our server offered useful suggestions and our food was prepared in a timely manner! Ask for Paolo or Claudio.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MUI1QRMaYMIDZP_kRXEVTA",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MUI1QRMaYMIDZP_kRXEVTA/o.jpg"
      }
    ],
    "user_id": "OW3nrU3uQQ1DynD4MQ24-w"
  },
  "p5pV0F4l-7nqiUEKJJJTbw": {
    "date": "8/17/2009",
    "text": "Delicious!  This is no 5 star restaurant (which for your wallet is a very good thing) but I can honestly say everything I got here was memorable.  Their duck was cooked just right with just enough sauce, their steak tartare was tasty, their chocolate pot was oozing with goodness.  I love small french restos (whether they are a chain or not) that offer such good food at such an afforable price (who doesn't right?), and this is definitely my first bistro in London that I will now have on speed dial. Only negative I can think of is that it seemed that the wait staff are a bit miffed if they don't think you are ordering enough food in their opinion (we ordered wine and beer then just ordered 1 appetizer to share because we knew we would be having dessert on top of each of our entrees which I think is more than enough) but as soon as they heard our meal choices and that we wanted dessert they did a complete 180 and treated us the rest of the time very friendly.  I get it, you want your tip (they add 12% in, which has been happening frequently lately at every resto and kind of annoying) but there's an art in not letting the customers know/feel it.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "8LBIuuR_8ubF9QrcsZsbIg": {
    "date": "10/29/2011",
    "text": "I just want to say that I think Cote's steak tartares are better than the ones served at the Wolsely....which is a huge compliment!",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "J1otPwOt4f79iEYdqm7p0Q"
  },
  "FhPN5vrH3HHzi164RpWkHQ": {
    "date": "1/18/2009",
    "text": "If you want a place to go in the West End, where you're not going to pay those crazy tourist prices and love simple French food, then Cote is the place for you. They have different priced menus for lunch, pre theatre and A la Carte, but no matter what menu you choose from the food quality is great. The dishes are not complicated just simple French Bistro styled food prepared and cooked really well. The service is super quick and the waiters very efficient, maybe they could smile a bit more but they're RUNNING, this place is busy! Let's keep it that way; it's so much better than its competition. There are five Cote Restaurants now, I hope they can keep popping up in a few more places. I've been to their Covent Garden one a few times now and they just keep ticking those boxes, yum,yum,yum!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SwLRVlPpfDCm6vBzyGzI2A"
  },
  "UM3acDAh7x1MJyY66b25ug": {
    "date": "12/6/2011",
    "text": "Had dinner at Cote on Sunday evening when the mother came to visit. It was much needed after post- Oxford Street christmas shopping!We arrived just before 7pm, and so we were in time for the pre-theatre menu. This was 2/3 courses for about £12/£14. We were seated immediately by a very friendly host. After perusing the menu for a few minutes, we ordered a bottle of red wine and from the set menu opted for a pizza-style starter each (it has a snazzy French name but I can't remember it!). For mains I opted for the steak and my mum had the seabass. Then for desert we both had the apple and almond tart with vanilla ice cream. And every last mouthful was delicious! I actually commented that from the set menu I could visit 3 times and have 3 completely different meals as everything sounded great. We finished with a couple of coffees, and the total bill was around £45. A great price for the quality of food. The service was excellent, and the place filled up a lot while we were there. I would definitely re-visit and recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ZddF5HaZJ_MXG3XQ3SeKQ"
  },
  "4Wh4stiAz51EseRjHfUFng": {
    "date": "11/24/2008",
    "text": "Covent Garden is placed in the heart of the west end musicals. Lots of tourists stroll around watching the street performers. As the Royal opera is there, you will find lots of actors practicing by singing their soul out in public.If you are fortunate enough to get hold of  musical tickets, you will find lots of smart restaurants around Covent Garden offering pre theatre dinners. If you are unfortunate enough, most of those might be  fully booked already and it is a gamble to stumble into the right restaurant without a reservation.Cote Bistro was our lucky strike that night, not having any time to loose as the musical started in an hour. Their unique selling point is to cater for customers who want to enjoy a fantastic diner, which is quick, enjoyable and served by charming French waiters. Cote Bistro is a proud French restaurant. Therefore they offer French wine and French food only.The choices of the menu are simple but having had a look around me, I saw everyone going for the pre theatre menu option. A responsive waiter who made sure we enjoy ourselves understood our requests for mustard and pepper. That night we ordered the steak tartar as a starter for both of us, while as mains we ordered the moules  (excellent sauce) with fries and a chicken leg dish with a potato gratin and lots of vegetables - this was the safe options and delicious as well.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "WCPdjx-gY1u8qkvKcri3jA": {
    "date": "11/9/2008",
    "text": "Went there Saturday night, and indulged in their being open post-theatre. This means we could eat after 10pm, which is sometimes a feat around London. There is even a post-theatre menu of main and glass of wine for £12!!We ended up ignoring that, and getting a bottle of wine for 3, a starter main and dessert each, plus 2 dessert wine glasses, and the bill was barely £35 each!The food was amazing. I'd highly recommend the mussels, the duck, and as dessert the Creme brulee. The calamari were great too, and the staff lovely and friendly. I'd go back every day if I could afford it. Yummy!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "446G85KWIe9xkf9LleoDtQ": {
    "date": "1/2/2010",
    "text": "Great food, I had a crispy mushroom tart and my date tasty salmon and caper starter followed by the Breton chicken with skinny fries, and creamy asparagus risotto. Relaxed and romantic atmosphere and it looks like a good place to go pre or post theatre. Laissez faire service though.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-y9a3hmZyWjqcPeifu1xA"
  },
  "FH2FRFt3Ga2eTTQmdPxg3g": {
    "date": "1/24/2012",
    "text": "best branch of this chain I have been too (london bridge & wardour street)exelent food",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZtAB7orp4_PqPgnDndTUYQ": {
    "date": "7/11/2011",
    "text": "A Very disappointing meal here last night.  It began with an indifferent waiter.  Service was very poor and slow.  A decent meal would've made up for it, but they didn't come through.  I ordered a heritage tomato salad with rocket, cheese and avocado.  They managed to find a few cherry tomatoes, ran out of rocket and substituted curly endive.  They were out of the cheese that came with this dish and didn't bother to add another.  Managed to find a couple pieces of avocado.  A dismal starter.  The others were mot much more impressive. Entrees took forever to arrive and then mine was cold.  They couldn't manage to fill water glasses or refill wine.  The waiter never asked about dessert or coffee - we finally got up to pay bill since we couldn't find him.  Overall, could not recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGrgQw_EoJg4zDnoWnFb2w"
  },
  "Zkp32Xf49QthU7miaEhvHQ": {
    "date": "2/12/2010",
    "text": "Great, small restaurant.  Friendly, cool staff.  Steak was very good.  Very slightly hip.  Crowd was pretty mixed, from 30's group dinners to 50's couples to professionals.  Will definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S7RGrhHZMCAsyzC0FwSI-g"
  },
  "ELtIv7_2qlk3s26LYhdOxA": {
    "date": "11/30/2016",
    "text": "On the hunt for some French food in London and we found Côte.Three of us for dinner - last minute reservation was no problem. We were seated at a lovely table in a corner, by the window. The hostess was very nice and our server was THE BEST.The food here is amazing - our selection included french onion soup, a seasonal goat cheese salad, moules frites, poulet grille, and Beef Bourguignon. Everything tasted so fresh. The wine list is impressive - it took us several minutes to land on a selection and we were not disappointed. Dessert you ask? Why yes...definitely. We shared the Creme Caramel (their specialty) and the Tarte Fine aux Pommes. One of the most decadent desserts...so good!I found out later they have a few locations around London -- but it did not feel like a typical \"chain\" restaurant at all.Looking forward to my next trip to London and returning to Côte in Covent Garden.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e--0vTbE8AWBV1uHwauCDw"
  },
  "BaAvxhdKYHgFmzeL0ccluQ": {
    "date": "12/11/2017",
    "text": "Cheap for a restaurant in covent garden, but the food here is underwhelming. I still eat here, but it is nothing I would ever crave for. With their pre fixe lunches and dinners, you are saving money, but they are not that consistent with their dishes. The best thing I have had here is a salad and a mushroom soup. Their English Breakfast is also very tasty, but iconic French dishes like coq au vin was bad, their mussels were ehh, and the food was somewhat warm. Besides their average food, I really appreciated their service. I have never come here when they have been really busy, but they were super accommodating. My friend ordered a steak the last time we went here and her medium steak was more like WELL DONE to the max and had burnt marks. Even though she ate almost all of it, when she told them how cooked it was, they gave her a new steak and side dishes and didn't charge us. Talk about service!  If you just want a sit down meal before a show or don't mind just having something to eat, then go here.",
    "rating": 3.0,
    "rated": {
      "useful": 22,
      "funny": 14,
      "cool": 19
    },
    "photos": [],
    "user_id": "AhntYDYezxv6k_YFPdBRTg"
  },
  "PSglrNQ3IcruzrgpARZuag": {
    "date": "8/4/2017",
    "text": "We really enjoyed our dinner here although the service was slow especially waiting for our dessert and again for the check. Our waiter was Italian instead of French so we didn't have the opportunity to practice our rusty French.Extensive wine and drink menu. I had a kir royale and my hubbie had a bottle of Bolée d'Armorique cider -- both lovely. For appetizer I had the Charentais melon with prosciutto, just delish! My hubbie had the tomato, shallot and basil salad which was quite good. The baguette that came with our appetizers was perfect in crumb and flavor, nice and chewy.For mains, I had the fish Pamentier in a dill cream sauce topped with a crisped crust of mashed potatoes, good with lots of fish. My hubbie had the wonderfully succulent sirloin steak with Roquefort butter, a bit of watercress and pommes frites.For dessert, my husband loved the Crème brûlée au Citron. I so enjoyed the Coupe Noire with a wonderful vanilla ice cream and a pitcher of warm chocolate sauce on the side.Don't visit if you're in a hurry, otherwise enjoy this wonderful bit of France in the heart of London.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iJaNZp1saDaFEsR6oElY_Q",
        "caption": "Photo of Cote - London, United Kingdom. Baguette, nice and chewy, perfect crumb and flavor",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iJaNZp1saDaFEsR6oElY_Q/o.jpg"
      },
      {
        "img_id": "95HvW21PgZw6W5Go3vUq8w",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/95HvW21PgZw6W5Go3vUq8w/o.jpg"
      },
      {
        "img_id": "Z214GFaIr0uiNlQ_-ZiW1g",
        "caption": "Photo of Cote - London, United Kingdom. Wonderful Sirloin steak with Roquefort butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z214GFaIr0uiNlQ_-ZiW1g/o.jpg"
      }
    ],
    "user_id": "UmjTwNiISLPdHFmN5CxyFA"
  },
  "aFAjx42YTF4Dj5lM56B_sw": {
    "date": "5/26/2017",
    "text": "So many options and the servers are helpful/ happy.  We enjoyed our entrees which were beautiful and fresh.  See our photos for a review of entrees and give this place a try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xcr4bZ7taLN1z8M8o5k_hw",
        "caption": "Photo of Cote - London, United Kingdom. Baked Crotin was so fresh and amazing !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xcr4bZ7taLN1z8M8o5k_hw/o.jpg"
      },
      {
        "img_id": "gDMcD4pXkTLSWnEbXdQlAA",
        "caption": "Photo of Cote - London, United Kingdom. Tuna Nicoise Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gDMcD4pXkTLSWnEbXdQlAA/o.jpg"
      },
      {
        "img_id": "lQLao_PI7H8kEvCVai1zuA",
        "caption": "Photo of Cote - London, United Kingdom. Asparagus risotto",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lQLao_PI7H8kEvCVai1zuA/o.jpg"
      }
    ],
    "user_id": "2bqPc1yFS0V4UKyfxEOWZQ"
  },
  "Oi6gsnNkLkbeHKaSIIz3KA": {
    "date": "6/23/2017",
    "text": "We came in for dinner as the atmosphere looked nice and friendly. We had the fougasse for starters which was really good but the reason for the low rating is because of the food illness my wife got after dining here and the company's initial response. My wife had the grilled chicken and walnut salad which gave her an acute bout of food poisoning that sent us to the emergency room in the middle of the night. I called the restaurant the next day where they promised to give me a call back the same day and they never did. It wasn't until I called back again that a manager was kind enough to take my information and promised I will get a call back. Salads are one of those things that should be treated with extreme care and the fact that they couldn't get that right means this is a place I can never go back to.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWi3EwMM8e8a1Zr3WwuNIw"
  },
  "b851Xm1HvNZ4XcB2Y2QKJg": {
    "date": "6/7/2017",
    "text": "Don't come to this place to eat unless you want bad food bad service.....extremely disappointed. The slow and busy waiter was nice.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jcpUPSOoEx6gzc-BDnM0tw",
        "caption": "Photo of Cote - London, United Kingdom. Horrible food with terrible service. Yuck",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jcpUPSOoEx6gzc-BDnM0tw/o.jpg"
      }
    ],
    "user_id": "pup9n_pEejMRwUasbFZzYw"
  },
  "XcG3YRzE8BFOfOg3SmZIqg": {
    "date": "4/27/2015",
    "text": "Saturday night around Covent Garden. It's getting late and we need to eat something before going home. Walking around, looking for a place that won't scrounge money from us we find Côte. It seems ok, price looks average for central London and they are offering pre and post theatre menu!We walk inside and the girl at the door greets us and leads us to a tiny, dimly lit table near to the service stairs. My friend asks if we can change places? The girl rolls her eyes and sets us in a table at the very end, close to the toilets and where the smell is quite funny... But it is fine. We won't complain again. We don´t want her to kill us or worse, spit in our food!Our waitress arrives. Lovely girl this one, very polite and helpful. She takes our order and delivers drinks and starters in appropriate time. She does the same with our mains.I order the roast chicken with garlic sauce. It is ok, a bit undercooked for my taste, but it is probably my problem as I like my meat well cooked. My friend has the steak with frites and she seems to enjoy it. Portions are generous, so no complain about that.We pay. A bit overpriced for the food they serve. But, hey! It is a French restaurant! What am I expecting?We leave. The other girl is still at the door. Still not being nice to people.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "-y3GzX7mYIuGfS_78W2zbg"
  },
  "Bycdr5yebN22q4tlHtRnzg": {
    "date": "12/16/2013",
    "text": "A fantastic meal in a tiny place you wouldn't expect to be such a good restaurant. Went there for a business lunch, and every plate we had was simply perfect. From the crispy calamari with garlic butter to the perfectly grilled steak to the most amazing french fries I have ever eaten: This place is good!On top of all, the lunch menu came with a really fair price tag, and excellent service.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gd1Q5BvCEta_B0tNE8w5rg"
  },
  "QL1aOufXjrQ20PC5vXwvYw": {
    "date": "10/30/2016",
    "text": "I ate here for pre-theatre (it's very close to Theatre Royal=Charlie &Choc. Factory).  I came a little after 6pm on a Tues, and they were able to seat me right away--even though I had no reservation.  The place was almost packed.  The theater menu offered some nice choices; I opted for the mushroom soup (flavorful and not overly salty), breaded chicken (moist & tender) and a very rich chocolate mousse for dessert.  The waitstaff were very attentive and prompt.  I was able to have satisfying and reasonably priced dinner in about an hour (with time to spare before the 7:30 curtain!).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIs9eO2udU7RvZ8bDIVoiw"
  },
  "-KCspD-JIYsb9nzXcb2wfQ": {
    "date": "3/1/2014",
    "text": "One of the larger Cotes that I've been to in London. Recently went with several friends for brunch as it is a short walk away from university. We made reservations on a Sunday morning as it is in Covent Garden. Yet, we didn't need to- majority of the restaurant was empty.Service was fine, food was normal minus the croissants being a little stale. Would recommend for a quick bite!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e1WA0YE3JpTg2Zb_lrHKQA"
  },
  "yoC6WvqMRzgTwvVr_ud2iQ": {
    "date": "8/19/2016",
    "text": "Great food and service. We were here with some friends that absolutely love this place and I do understand why.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3azMv3MQgVyzKC5jzTShg"
  },
  "cPZr4R01EMXv60FSuArQ2g": {
    "date": "1/29/2015",
    "text": "I know the tabloids rate this chain as do some yelpers but maybe I just dined on a bad day?  Negative points - The pissaladiere, a flat bread with caramelised onions and anchovies was not edible.  Only a small piece was eaten therefore you would have thought the waiter may have asked was the dish ok but no such question?  My friend had the moules marinieres, the mussels were way too salty. The linguine with seafood was a let down.  The prawns and squid were very tasty but the lack of sauce made this dish dry and well just boring. Positive points - Light bright large restaurant with contemporary decoration.  Wooden tables and chairs. We were in a group and a friend had the set lunch men at £11.70 for 2 courses.  Her food was tastier and well just plain better than what we had on the a la carte menu.  I wish I had gone for it. The Kir Royal was only £3.95 and was quaffable as was the Saumur Blanc, white wine. The corbieres was very drinkable and therefore this place definitely has a good wine list. My advice would be go for the set menu, I will next time on my return to see if this place can do any better? xoxo",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "23BfvNiCUERIKFu3w7ljUg"
  },
  "WSKbQmzaT-uHzH9fj5A_XA": {
    "date": "9/26/2014",
    "text": "My cousin who lives in London was gracious enough to invite me to dinner.  He said he's a frequent patron at the sister restaurant in his neighborhood and the food was superb.Let me start with the atmosphere.  The tables are super close and intimate, it's dimly lit at night, the windows by the entry are movable and can be opened for al fresco dining.  There are outside tables that you can dine at as well.  My cousin got the chicken and it was crispy on the outside and moist in the inside.  I ordered the sea bass and it was cooked to perfection! The sauce was not overpowering at all and was light.  I ordered the potato scallops and it complimented my fish as a substitute for mash potatoes.  If you order water, it comes in this tiny little brown jug because most Europeans drink wine as their water.  The servers are on point and well attentative.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oY4NZbBXAw4GHgI9GmHIQg"
  },
  "A-0oZHb2_VhsEXSY3npd0g": {
    "date": "7/22/2016",
    "text": "Lovely restaurant. Excellent good. They served is rather late, which we appreciated very much. Brought the bill instead of dessert but it was midnight and we were one of the last people here so may be why. All in all very wonderful experience and right near Covent Garden. Would Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sN_V6Fimdyg1a2gZ1SwEsw"
  },
  "vkckdCP-CpOm-w39eBuE6Q": {
    "date": "5/23/2016",
    "text": "Excellent food, pleasant service and good prices!  I had the grilled roast chicken with potatoes gratin and I also ordered the creamed spinach.  For dessert, I had the BEST browned caramel custard--all I can say is YUM!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQyDLUu8Wj5LUblU8sDWtA"
  },
  "KPDA-8yJS2RdL8trXfHhEQ": {
    "date": "1/20/2016",
    "text": "I've only been to Cote once before about 5 years ago and the food was cold and this is the first time I've given it another shot. But it was awesome! This branch didn't feel like a chain to me. The staff were happy and attentive and the atmosphere was lovely. The food was delicious and amazing value for the pre-theatre menu. I had the french onion soup followed by the goats cheese and roasted vegetable salad. So much cheese! It was great =]",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aEvXXiSkgW4D2d8IJWPumQ"
  },
  "8JgkEc889aj_ts8lbTYuBw": {
    "date": "6/8/2014",
    "text": "Yummy mid afternoon retreat.  Ate here two days in a row. Had the tomato soup, salad Niçoise, risotto, green beans, and char.  All but the char were delicious. Surprisingly pleasant service for a French restaurant. Clean small bathroom downstairs.  On shadier side of street so nice for hotter days.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mVPCgrCLbPW-wgybeIQZ3A",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mVPCgrCLbPW-wgybeIQZ3A/o.jpg"
      },
      {
        "img_id": "ZjiRwTEK29pTr21vgHhxxQ",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZjiRwTEK29pTr21vgHhxxQ/o.jpg"
      },
      {
        "img_id": "XdFQZIQ_wMK_lPXFo7YlDg",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XdFQZIQ_wMK_lPXFo7YlDg/o.jpg"
      }
    ],
    "user_id": "YKC58ikNrzJZ64BLScF0ig"
  },
  "1Z0S8D32P8D2Ft6uP-YuQw": {
    "date": "2/19/2014",
    "text": "Don't bother. Great staff, food is no good. Maybe it was because we showed up at 10:15pm (after watching the Lion King @ Lyceum Theatre...) we were just on the search for some tasty, delicious food. We chose Cote because it was the first place we came across that was open. The staff here is quite friendly, and you can tell that most of their customers join them post-theatre.Started off with Flatbread with caramelized onions and anchovies and the calamari. The Flatbread was good, nothing special. The calamari was a bit over-cooked (or maybe that's just the way they serve it). Next, as our mains, I wanted to go for something on the lighter side and ordered the goat cheese salad (with roast vegetables) and my friend got the beef bourguignon (cubes of beef/mushroom sautéed with some sort of really really salty sauce with a side of dry mashed potatoes)... Both of us.... Utterly not impressed. (I've posted pictures)The goat cheese was great, but the vegetables were terrible... The carrots were way over cooked and the chunks of onions still had the ends on them (then again, maybe this is how they always serve it?) my salad was overly dressed with really limp/non-crunchy lettuce. My friend had got the beef bourguignon. The presentation of this plate (well, let's just say it looked much much better than it tasted). It was so salty!!! My friend literally had two bites and that was it. She sat there unsatisfied. She tried the mashed potatoes hoping to tame some of her hunger... And again, disappointment. I tried both, the bourguignon and the mashed potatoes - and I definitely don't blame her for not eating any of it! We decided to opt out of dessert because of our wonderful main experience Lol. The waitress brought around our bill and asked if something was wrong with the bourguignon (I guess she noticed it was untouched)... My friend said it was quite salty and she was no longer hungry. She went to the manager and he came over almost immediately insisting she try something else or we have dessert on the house. We decided against it, paid and left. We were satisfied when the manager did come over acknowledging we were not content. Great staff, but I would not recommend the food.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5XDIUHTOgBRqKWisZX7yug",
        "caption": "Photo of Cote - London, United Kingdom. The onion ends in my goat cheese salad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5XDIUHTOgBRqKWisZX7yug/o.jpg"
      },
      {
        "img_id": "1OvzX8Qn4WDSeVmhX7R-FQ",
        "caption": "Photo of Cote - London, United Kingdom. So salty!! The beef bourguignon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1OvzX8Qn4WDSeVmhX7R-FQ/o.jpg"
      },
      {
        "img_id": "BNcBml2L9_2s_08LKqprqQ",
        "caption": "Photo of Cote - London, United Kingdom. Goat cheese salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BNcBml2L9_2s_08LKqprqQ/o.jpg"
      }
    ],
    "user_id": "Ed19qt-FyhaJWsFIze0X1g"
  },
  "m68T3_-GYmtVQr31E7p-mA": {
    "date": "1/25/2013",
    "text": "Walked in for a Friday lunch with no reservations and was able to get a table instantly.  Wasn't sure what I was expecting to spend price wise as it looked like a cute overpriced French bistro from the outside, but was complete opposite. Located a minutes walk away from Covent Garden, this location is ideal after a long day of shopping.There were two lunch menu offerings when I was there. Your two lunch menus were either 1) A choice of 5 mains with a drink (either soft drink, beer, a glass of red or white wine for under £10 or 2) A 2 or 3 course menu, both for under £15. You had a choice of 5 starters, 5 mains and 5 desserts which is absolutely brilliant for the price. I can't recall what I ordered for a starter but it was flatbread like with caramelized onions and melted cheese. I could have done without the started, but it was decent. There were many better options for starters such as the mint and pea soup with pine nuts, a pork appetizer, you weren't short of options. I went vegetarian and ordered a chick pea and squash cake which was delicious. It was meaty and hearty like a burger, but was still light and had this sweet but satisfying flavor about it. It was flavored with fresh herbs and wasn't heavily spiced, but had the most perfect taste. As I have a sweet tooth, I will always say that dessert is my favorite part of the meal. I just couldn't choose between the warm apple pie with shaved almonds, the chocolate cake or the Creme Caramel. I love the consistency of custard and sweet, so I went with the Creme Carmel and it comes highly recommended. Flan like consistency but silky smooth and sweet.Service was prompt, friendly and attentive. There was a mix of patrons enjoying a business lunch and just as many enjoying lunch on a day off. There were many more items that I'd love to try on the menu so I'd love to say I'd be back to work my way through the menu. I didn't even glance at the regular menu so I can't even imagine what options the dinner menu has to offer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oQjo9kUHG71S_zmathTPSA",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oQjo9kUHG71S_zmathTPSA/o.jpg"
      },
      {
        "img_id": "4-XYDeIO8FRyk3HAzPnviA",
        "caption": "Photo of Cote - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4-XYDeIO8FRyk3HAzPnviA/o.jpg"
      }
    ],
    "user_id": "wybesJ4QS0NzyQStnomLUw"
  },
  "SRywdbmIwhRW0R6U1agadw": {
    "date": "4/2/2012",
    "text": "In classic French Bistro form, this place is a little tight on space, but makes up for it with excellent service and even better food.After a long day of tourist duty in London, we wandered back to the Covent Garden area where we were staying.The truth is, we (and by \"we\" I mean \"me\") were a tad lost and looking for a non-pub option for dinner.We stumbled into Cote and they were very gracious about finding us a table in what was already a pretty packed dining room.Our waiter was very nice and very helpful with menu descriptions.He was prompt with refills of drinks and plate clearing, without hovering.We enjoyed an appetizer of goat cheese, artichoke hearts and caramelized onion that was quite unique and very very tasty.Between the three of us we ordered the beef bourguignon, seafood linguini and a seafood casserole. All three dishes were perfect.The beef bourguignon was flavorful and tender without being burnt or overcooked (a common problem with this dish).The seafood in both the linguini and casserole were also cooked just right, without being over done.Everything was fresh and nicely, but not overly, seasoned and the cream sauces in the linguini and casserole were creamy without being lumpy or overly cheesy.We have already recommended Cote to friends who are traveling to London in a couple weeks.The next time we are in town, I'm certain we will make our way back to Cote.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lZzKS-UOJCP4AMYiLIq3MA"
  }
}