{
  "9r067sMCrfrz-0RvFW8jXA": {
    "date": "4/5/2011",
    "text": "Skip this one.  There are tons of Chinese Restaurants in the area and I am sure that they are better than this one.Overpriced.Food is very bland.Service is bad.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kwLjniiYa1H57LwQX2TGIQ"
  },
  "fojHlLSjKWRjizS3Wneu8A": {
    "date": "7/20/2013",
    "text": "If there were a zero star, I give them that. The worst waiter ever! He shouted at me because of his own carelessness. How dare they charge service fees for such a terrible service. Bad bad place!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b3KT-Da3O8afR-Z396JRqQ"
  },
  "1AmH7XNSagptNAsZ3Pb2-A": {
    "date": "4/15/2012",
    "text": "Went there for dim sum on Sunday. There was a good selection, but of the dishes we ordered they were fairly average.Not bad, but nothing that I would go back for.",
    "rating": 2.0,
    "rated": {},
    "photos": [
      {
        "img_id": "59suNXskrDkG8vk81zGZ9Q",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/59suNXskrDkG8vk81zGZ9Q/o.jpg"
      },
      {
        "img_id": "NKAbDnKViO7eII3KYkSPEw",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NKAbDnKViO7eII3KYkSPEw/o.jpg"
      }
    ],
    "user_id": null
  },
  "P97k-qvXCvezeLj49_TNHA": {
    "date": "8/20/2011",
    "text": "If I'm ever dining out for dim sum in London's Chinatown, it's ALWAYS got to be Gerrards corner. Granted it doesn't have all the dishes for dimsum but the ones it's got is far better than most of the others I've tried in Chinatown (Don't even get me started on top of the town!)I really suggest going for the chefs specials and the bolo bun with charsiu filling. It's pretty lack lustre compared to HK ones but it'll do the job and i'm pretty sure only they serve it. :) I like the siumai here, it's less fatty pork meat that most other chinese restaurants use. But be careful, it really depends on the day. Service wise, I don't have a problem, the staff have always been well...chinatown average. They're all like that in chinatown, so i don't take it personally. Their mantra really is to, get you in, feed you, then you pay and get out for the next table. Seeing as most don't speak much english anyways, if you speak cantonese/mandarin, it's always a plus. Racist but it works.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "TimaycfZS7O8Hx8R2c7_2Q": {
    "date": "12/9/2008",
    "text": "Gerrard's is not a very Chinese name, but don't let the name fool you, the food is ALL Chinese!  When I first went to Gerrard's it was after a night of clubbing and I was surprised to find a place open well after mid-night.  It was crowded but I wasn't sure if it was because of the food or just convenience.  Trust me, it's for the food!  Since my first visit I have gone to Gerrard's often to enjoy the duck with pancakes, at least I think that's what those little thin patties are called.  Anyway, the duck arrives at your table hot and they cut it up into smaller pieces.  With each pancake you add the duck, plum sauce and a bit of celery, it is yummy goodness with each bit!  The duck is flavourful and crisp and the blend of plum sauce and celery just adds to the taste.  They also serve wonderfully large and delicious steamed dumplings, another personal favourite.  Whenever I go to Gerrard's it is rare that I don't have to wait a few minutes for a table, the later you go the longer the wait.  But the food is worth the wait.  I know they have other dishes, a few I've tasted, but I go to Gerrard's strictly for the duck and the dumplings, a combination that, at this restaurant, can never be wrong.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ETbafIMq3Wyw5mQdvpDGIw",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ETbafIMq3Wyw5mQdvpDGIw/o.jpg"
      }
    ],
    "user_id": "JdgnOJAlrfl8AiSRpeYmYQ"
  },
  "mo2Ng7RSw7gxBrVUbpW99A": {
    "date": "12/28/2010",
    "text": "Come here for the best dim sum in London's Chinatown. The menu is pretty sparse for a dim sum place but the food is of relatively good quality.Gerrard's offers a menu with pictures for everyone who has never ordered dim sum but sadly does not have a push cart system. You put the number of each dish you want to order onto an order slip and the waiters bring it out for you. Not the most traditional flavors as I feel the dishes have been tweaked slightly for tourists and non-Chinese clientele. But that being said, this is probably one of the places that have dumbed down their dishes the least in Chinatown.For those who are more adventurous, try the hot chicken feet and congee with preserved egg. The place is usually pretty busy during the peak hours so be prepared to wait if you're with a large group, but the service is very efficient and you won't wait terribly long for your food.Best restaurant in the Chinatown for your money!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MbCvY4Fk3CHK-mjquYOYQ"
  },
  "oKdR-wa0BSI-B0lPj1MnfQ": {
    "date": "12/4/2012",
    "text": "I found the food to be pretty bland, but the crispy duck was good.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayKUyYEYihSFuYNrqujLKA"
  },
  "MuIyn6lzSRZzUwTtEjkj2w": {
    "date": "9/6/2010",
    "text": "Have only ever eaten dim sum here, so need to confine my comments to that side of things. Fairly run-of-the-mill - all the standards, nothing outstanding, but a good place to people watch if you can bag a table with a view of the street. If you're desperate for cracking dim sum, and happy to pay double the prices here, stumble over to Yauatcha. If you just want to zone out for a few minutes with some pleasing bites to eat with tea and/or the odd cold Tsingtao, this is a reasonable pick.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4GUUH2FU7r36h1KxEhZFXQ"
  },
  "jmueqydaK2aUko7Xt33yQg": {
    "date": "4/1/2010",
    "text": "Definately a good place for some Dim Sum! it's hard to find a nice Dim Sum place in Chinatown cause there are so many of them.. but this place is definately awesome and has me coming back for more and more. It's a little expensive but what place in London isn't? They have everything I crave for.The food:The Cherng Fun (Rice flour cake with shrimp) is hella good. You must try it! The dumplings are all pretty tasty as well. Chicken feet. The chicken feet here is ohm nom nom delicious!The service:Not too bad, could be a little better, but definately always had a full glass of water.Will come here again!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ni3yFHU27ugYej7GSNLz8Q"
  },
  "iWdEoiIjXiiXES_dFigZUQ": {
    "date": "2/19/2012",
    "text": "Like many along that strip, they tend to bulk out out mainstream standards with onions and overload on MSG, but if you choose right there are some goodies here. The roasted meats are good if not exceptional and their pork hotpot is a rich and worthy winter ribsticker, full of soft yielding aubergine and slippery pork slices flavoured with star anise punctuated with shards of garlic and chilli.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "yV3nHBFPJ29nuftms9VKMA": {
    "date": "7/2/2014",
    "text": "the beef in oyster sauce tasted like the beef was from a big mac but i was a huge fan of the chilli prawns! the food though was very greacy",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KAi78iPpaS67pyQ-dZDPlg"
  },
  "3ua_ulPgkJkowBBMTD3xYg": {
    "date": "7/18/2011",
    "text": "Bland food. Disinterested waitstaff.Prime Chinatown street-corner location, but wish the food was better.Got my shrimp dish in a pasty white sauce, with a few pieces of onions.Far cry from the food in San Francisco's Chinatown.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azW36pSX3OsE_HgT5sCCjQ"
  },
  "jeYGAGHY1jbMI_56AxWdvQ": {
    "date": "1/14/2009",
    "text": "Slap bang in the middle of Soho.This place can get crazy busy during rush hour and they do a great dinner special with a free beer!For the most part they offer standard Chinese fare, but, their Crispy Duck is awesome.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "56c6V5LqoJx-Qsohd0STZg"
  },
  "xIF_CARt1qM11MkA2w7ukQ": {
    "date": "9/25/2009",
    "text": "Gerrard's Corner is another one of my favorite restaurants in London not so much because it has great service (which it doesn't) or has great food (its good but great) but because it is unpretentious, consistent, conveniently located (being near Leicester Square), and generally doesn't require a long wait or reservations. They have very nice variety of dishes from the more traditional to the more westernized to please everyone's palate. Food is always fresh and flavorful. I especially like that there is no smoking in the restaurants any more.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GBfOPFlKzRXRAkQUJ1K_6A"
  },
  "jX64J3C4co3xHKoc1IPUzw": {
    "date": "11/21/2008",
    "text": "Gerrard's Corner is a bog-standard Chinatown restaurant serving bog-standard dim sum. I'm a particularly fussy eater when it comes to dim sum, and this didn't meet my standards. Wont be going back again, and certainly not recommending this restaurant to anyone.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jfISGg-VBmQZLbZ_9CMqIQ": {
    "date": "8/7/2008",
    "text": "Gerrard's Corner is a mainstay of the Chinatown scene, and with good reason! You just can't go wrong with delicious dim sum served quickly by the expert and obliging staff. Even the Chinese dramatic pop tunes playing along with their videos on the big screens can't put a damper on the generally friendly atmosphere. Try the duck pancakes or, if you're feeling more adventurous, sample the delicious pork buns. For non-Chinese speakers there are helpful illustrations of the dishes to guide the discerning eye through the plethora of steaming delicacies on offer. The place is immaculate and the bathrooms are the best in Chinatown.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jbmLRHwfyXQhNHd9EjxBag": {
    "date": "9/30/2009",
    "text": "been here over and over it is a very nice place clean and efficient staff food is always piping hot fresh and tasty i would reccomend this to anyone i always take friends here for lunch have never been let down yet brilliant",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0zcWS_z57fajyYWi5w0cAg": {
    "date": "9/3/2017",
    "text": "I can say with full certainty that this was the worst Chinese food I've ever had. There were six people at my table and everyone hated their food. We each had a few bites and then left the rest to be thrown away. The service was also despicable. One person asked to change her order because her soup tasted like chunky blood, and the waiter was so unbelievably rude. He argued with her for about five minutes and treated her so poorly. 0/10 recommend. Such a bummer because I was really craving Chinese food. NO THANK YOU GERRARD.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "79ND4eHkQV1-G2ZGTLyrEQ"
  },
  "41zJC68V0TGVlw_l2jqCcA": {
    "date": "3/29/2016",
    "text": "I have been at Gerrard's Corner many times now. It is one of my favorite Chinese restaurants in London. While the price is a bit higher than average, the food is amazing. We always order mainly the same things: Dim Sum platter; Deep Fried Soft Shell Crab with chilli and salt; half Cantonese Roasted Duck and egg fried rice. We are always happy with what we get. The quality is always up to our expectations. The one thing I dislike, hence why I have only given 4*, is due to the fact that when they are full, they try to hurry you. So its either you order more food, or leave as fast as you finish eating. But apart from this, if you love Chinese, dont miss this place. And if you want to avoid being rushed, go during week days. Not so crowded.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZcmjvpMIwRGaFCr6zvYGWg"
  },
  "BJYyxogXBm-t8oRbUjiU9w": {
    "date": "8/13/2017",
    "text": "The service took long to come and when summoned they looked the other way. They were fast enough, though, to present us the bill. The bill was the total amount in a manuscript piece of paper. Then, we asked for the detailed receipt and after a long waiting they grudgingly brought it to us. We saw that they charged 12,5% as \"optional tax service\". As we soon learned this tax has nothing of \"optional\" and that was already included in the bill! We didn't want to pay that tip since the service was lousy but the rude maid quickly brought us a cart to proof us that we had to pay 12,5% as tip. We demanded to talk to the manager but she told us the manager was eating. We said the manager had the right for their break; we paid for the total amount but we insisted on talking to someone else in charge.The maid told us \"disgusting\", she left and never came back. After 15 more minutes we grew tired of waiting so we left.This is a tourist trap to be avoided by everyone visiting London's Chinatown. The charge for the tax service is now customary in the U.K. but one can refuse to pay it when the service is lousy as this one. Well, except if you're going to Gerrard's Corner!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLNWq057JJ8IiJwZ_6FuIQ"
  },
  "ox5zDuGsc3L-xy28i4wU9A": {
    "date": "11/8/2015",
    "text": "A colleague recommended this place and I'm really glad he did. I ordered a mix platter of pork belly, braised duck and roasted duck. the meat was perfectly seasoned and cooked. I ordered a side of steamed rice and combined the two in a small bowl and devoured it with chopsticks. it was just enough for one person with a little left over. I topped it off with a couple of Chinese beers. the service was good too, and the restaurant was clean and comfortable. I highly recommend this place. And to finish off the night go to little sister a block away for the best extra cold Guinness in all of London. ask for kiran. he's an Irish bartender who will teach you all you'll ever need to know about the perfect Guinness pour.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "REmjeATdkO_57Ezwzz7YqA"
  },
  "2qUA3EEZ7FnVP_puKVYcpQ": {
    "date": "2/14/2014",
    "text": "Went again for dinner last night with my boyfriend and we had the set menu B with a bottle of white. Service this time was perfect. Everyone was friendly, efficient and anything extra that we needed was brought promptly. The sampler platter was good. Mostly fried things, and the ribs were a little too sweet for my liking ( as was the sweet and sour pork) but still good. Spring rolls were crisp without a trace of grease and the sesame shrimp on toast was very good, too. Aromatic duck was the perfect second course, although, again-- more deep fried food.The black bean shrimp were slightly spicy with lots if crunchy peppers and the fried rice seemed to look sticky and glue -like but it turned out to be among some if the best fried rice I've had. Vegetable portion was small, but I love those little straw mushrooms and the way their texture contrasts with the water chestnut and crunchy snow peas.Overall, it was a great dinner. The place is almost always busy and last night was no exception. This is always a good sign. I think this little corner has won me over!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_t3BJzyGaqr9mcDazYiYAQ"
  },
  "D0o204E5dJL1dZtfnb0mjA": {
    "date": "11/28/2016",
    "text": "Most of the food was average. My beef brisket hotpot was not good at all, chunks of mostly fat in a not-very flavorful ginger and spring onion sauce. The set menu the other adults in our group had was ok. The hot and sour soup was good.As other reviewers have noted, they brought a bill that was only hand written with our meal items and the total price. It seemed high, so we asked for an itemized bill. Aha. They'd tacked on a service charge of 12.5% which was an unpleasant surprise. We asked for a look at the menu to see if this was noted on there, and sure enough in tiny print inside the front cover it stated it there. That's just shady. The £8 for a plate of chips we ordered for the young children in our party also was a \"gotcha\" opportunity for them, since it wasn't on the menu.The place had sort of a touristy, get em in, get em out, type of atmosphere. The mens' toilets were ok, but my wife and mother-in-law said the womens' room was pretty rough.I'll try another place in Chinatown next time.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zX2Kgtc3-Zw8FEPbaVowyA"
  },
  "FLk1BJh20kNX9ox51CnBHg": {
    "date": "5/4/2015",
    "text": "I came here a few years ago for dim sum with two Chinese friends who like coming here. Dinner however, is a different matter. I went again a few weeks ago with my husband. Unfortunately we made the mistake of ordering from the set menu, which is pretty touristy. To be honest it was because the price was so cheap. So you get what you pay for really. We had the set A menu, which was fine but not great Chinese food. The portion sizes were much smaller than the main menu dishes but they were enough.We would go again and order off the proper menu, because the food looked really good. There are a lot of mixed reviews on here but it's like that for most places in Chinatown...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1v2-TcNnww0dIEOm6Chtxg"
  },
  "uLkrRsXvLWKt98U3wnPoZA": {
    "date": "7/29/2016",
    "text": "Poor service. Extra charges. Ordered dumplings. Came with no sauces. When asked for some was brought a hot chili sauce and ketchup you sauce. Stir fry vege meal came without any seasoning or sauce and no rice. Charged 3.50 for small bowl of rice. 12% service charge was added to bill and was hidden. Pointed out where to leave tip on credit machine. And left a tip tray on table.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JFgAo2lAMEZbGx57UOG_yQ"
  },
  "s9BOAZHpEOQaYrs4JcHwYQ": {
    "date": "2/6/2015",
    "text": "Wandered in here for a decent quick Chinese meal as I found myself in Chinatown. These places are usually forgettable and overpriced, which this one is. The brusk service never really talked to us and didn't bother telling us their credit card policy until it was time to pay. It was all what I expected, but I am sure there are better places in the area.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQ0r3LdgDtKCik5jUmqMUg"
  },
  "NkanBYnCzQ_UwNartbrlow": {
    "date": "4/24/2012",
    "text": "The food was disgusting, it looked and tasted like they had scraped the leftovers from other diner's plates and reheated them. The servers were extremely rude. When the bill came it wasn't itemised. It had one listing - \"meals\" with a price next to it. When we complained, suddenly they couldn't understand English. My boyfriend has had to take time off work due to an upset stomach from eating here. Avoid!",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrGFc2IUccf2sKcvLc78LA"
  },
  "HuiLyO-_570N15hhlYmOwg": {
    "date": "4/5/2016",
    "text": "Went there for a mediocre dinner. Only order 3 dishes with menu price total of around £40 and got a check of £52 without listing individual prices.The dishes are small and of take-out quality. However waiters are polite and courteous.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQbGCSUoAFBO0MOMW6OUZg"
  },
  "iGF1bZFBTiwxp-rG0buJlA": {
    "date": "3/1/2012",
    "text": "This place culled a three star review. Yes; culled.The waiting staff have seemingly lost their way. Not just in their food business, but in their very existence. Never have I seen more employees appear dead behind their eyes than this crew. It felt like I was talking to a poorly designed robot when speaking with anyone who worked there.Anyways, we went here because it seemed like it had the best prices in the area. 7 pound sweet and sour chicken was about the lowest on the strip; and with 2 pound rice it seemed like the way to go.Look, I can't really knock the food. It was the most normal Chinese food I've ever eaten. Never have I been less excited but not disappointed in what I was consuming. For that it's an only ok and bland place to go, probably better if you're drunk (like most things).One member of the staff left us a pitcher of water after we asked for our glasses filled. That was nice, I like having a lot of water available to me. The check came out to 20 some odd pounds and we weren't thrilled to have to pay it. The portion size of our chicken was quite small. The rice was well portioned but overall it was not enough food for the price. What's with sesame chicken not existing in England?",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lgPCm2v8ZGOQpLKlTTQKOw"
  },
  "vV2pA-XNMkXCjoC5YkY4-Q": {
    "date": "11/2/2015",
    "text": "Similar to Wan Chi Corner, Gerrard's Corner is your no nonsense standard Cantonese restaurants in China Town. Diners mostly come in for dim sum at lunch time and classic Cantonese dishes for dinner. The wok fried noodle dishes are generally pretty decent and so are the soup based noodle bowls, try to stay away from the BBQ items, however as quality wise are not near as good as other restaurants nearby, such as Four Seasons.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "szAj5KOtXruIwKweAcnp6g": {
    "date": "3/4/2014",
    "text": "Amazing food! Not so great service but if u can put up with that I would recommend this place. Get seated quickly. Lots to choose from and everything is yummy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tk0mgkDurcGeCrvLgWA9nQ"
  },
  "5ImJTilSNS29KicgDCEFdA": {
    "date": "12/30/2012",
    "text": "I've eaten here several times and I wonder why I ever did. The quality of the dishes vary enormously depending on how busy it is, from reasonable to positively offensive. The range of dishes are nowhere near as extensive as the other restaurants nearby. Vegetarians should be discouraged from eating here as a friend's Sweet and Sour Tofu had a 2 pieces of chicken in it. Although the prices are quite low, around £30 if you don't order the lobster or oyster dishes, the place leaves a lot to be desired.The service, as indicated on the menu, is not included. So expect muttered indecipherable explanations of dishes, long delays for your food, plates ripped from you before you've even finished, a generally rushed atmosphere where they want you out as soon as possible. They took a chair from our table to put onto another one, without asking, whilst one of our company was in the frankly disgusting toilets. When she returned they shook their heads blankly as she requested another chair. She stood for another 10 mins before they understood the problem. To top it off, on one occasion they brought the rubbish through the floor of the restaruant leaving behind the scent of refuse everywhere.Although all these things have been compounded over 3 or 4 visits. I will pretty much guarantee that at some point when visiting, you will encounter something unsavoury.Please, walk on a little further and visit the many other places in Chinatown where the food and service are miles ahead of this one. I implore you, please do not eat here, for your own sanity.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mgUZBDPYD8jPfNnuuXzifQ"
  },
  "EE-VYDhYI8pETz5H_6BFNw": {
    "date": "6/17/2013",
    "text": "WOW WOW WOW WOW. I took a random chance on Gerrard's Corner as i was with my family and we didn't want to spend ages walking around deciding which chinese restaurant to check out. This was the best chinese food I have ever eaten in London. Realy was epic. The egg fried rice was perfect and the curry sauce I ordered on the side was so rich and cream and beautiful. Go here! The staff were also very friendly and een charged my phone for me!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "VXp8kS0lXYc2YCYmsjeOrw": {
    "date": "6/4/2014",
    "text": "I came across Gerrard's while in the Chinatown area. It has the standard Chinese menu.  The quality is good but nothing special.  Pricewise, it's pretty reasonable by London standards.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N4Y2GiUxnQOvUUHtFyayKg"
  },
  "4cj3Q2vZGuQcIEXMIz5LnA": {
    "date": "3/16/2011",
    "text": "Zombies do not a good wait staff make.Gerrard's Corner is run by zombies; they're forgetful, barely sentient, and spend most of the time staring at the ground.  Thrice I tried hailing someone down (in Cantonese, English and Mandarin) to bring me chili sauce.  On my visit on a Wednesday afternoon the place can hardly be considered bustling; homeboy just needed his sauce to get his grub on, how hard is that?The food had arrived excruciatingly slowly and, when asked to inquire about two stray dishes, no one thought to return with an update.  The deep fried taro (yam) dish was delivered cold, but all other dishes (including steamed dumplings) were brought up satisfactorily hot.What could have easily been a one-hour luncheon had stretched out to one-and-a-half.Forget it.",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "YCOwZztY3w6KbmlETuHm4A"
  },
  "QCNZhcWBGi1vCBVAp8olIQ": {
    "date": "8/15/2013",
    "text": "Honestly dumbfounded by the bad reviews went here for lunch and had amazing crispy duck and dim sum with jasmine tea. Highly recommend the duck, as a Chinese food addict this is by far the best I have tasted. As far as service goes this place leaves a lot to be desired but it is worth it for delicious authentic Chinese food at reasonable prices.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ncw_hBFY5eWB0fEsoGawaA"
  },
  "Kk2MdId1rL9Xm6Gcxz3uoA": {
    "date": "2/20/2014",
    "text": "Gerrard's Corner is amongst my favourite Chinese restaurants for a relaxed dinner with friends or family. The service is only ok, and the decor is only fine, but most crucially the food is great and offered at a pretty reasonable price. The menu is generally geared to Western tastes (so go somewhere else if you're looking for specialism in Szechuan craziness), but the old favourites (duck, crispy shredded chilli beef, etc) are all delicious. Would highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hD15GhDY6GN7GUEUzJKtIg"
  },
  "lLolyiSJBDaxabo_uA6B5Q": {
    "date": "9/29/2018",
    "text": "This was a lovely dim sum place, among my top two in Soho Chinatown.  My friends and I went for dim sum during the weekend, and there was a little bit of a wait. But, it was well worth it. The dim sum menu is a pretty standard Cantonese spread. We ordered a couple of dishes for a light brunch. Two dishes I typically use to judge a dim sum place are: the rice noodle rolls and the baos (quality of the noodle crepe and the dough, respectively). One of my friends ordered the rice noodle roll with youtiao (油条). The noodle crepe was perfectly steam and thin. And, the noodle roll had a sprinkling of toasted sesame seeds which added another layer of fragrance. The char shao bao was flavorful in its stuffing (Chinese BBQ pork) and the exterior was soft and wasn't dry. We ordered a couple other dishes as well such as chicken feet in black bean sauce and duck tongue. Both were great as well in terms of flavor. The food and atmosphere reminds me of dim sum tea houses in Hong Kong with a bustling staff, Cantonese dramas playing on flat screens, and the tables set with white tea cups. So, brownie points for OG-ness. Overall, I would definitely recommend this place for dim sum.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zshDhByF4QWVqrmhMV2RmA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Dim Sum Brunch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zshDhByF4QWVqrmhMV2RmA/o.jpg"
      }
    ],
    "user_id": "Si4k5RiTmm6bRELuqaqzvw"
  },
  "sUsGLK8YZezRem36gPhapw": {
    "date": "7/11/2018",
    "text": "Gerard's corner was lovely! The food is priced decently and is quite tasty. Also- the staff is wonderful! They went above and beyond to meet our needs. For a dinner for 2 we paid under 30 pounds which is fantastic.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9tW7NSHCPP8cK-t0FDWtA"
  },
  "5ckzo7TU141jWpj4wnH4Cw": {
    "date": "6/12/2018",
    "text": "Sometimes I don't understand how a restaurant has the rating it has and this restaurant is a perfect example. It has three stars but IMHO it's five stars all day long. Based on ambience, spectacular service, and delicious food. My wife and I ordered the \"A\" meal plan which means we were served family style. Corn and egg soup, prawn crackers, fried rice, vegetables, sweet and sour chicken, and black bean beef. It was absolutely delicious!I'm betting this is where the Queen mum gets her Chinese food from.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Il0iitUkO5whVGbBm2_YDA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Il0iitUkO5whVGbBm2_YDA/o.jpg"
      },
      {
        "img_id": "DsuM92w_AeG5CsqWhWZn7g",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DsuM92w_AeG5CsqWhWZn7g/o.jpg"
      },
      {
        "img_id": "e1J7Jg_SzyTP1lmSrq4oQw",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e1J7Jg_SzyTP1lmSrq4oQw/o.jpg"
      }
    ],
    "user_id": "swgXXZKjHbgu_TInKmrMXQ"
  },
  "dY-0NDl_7FOYkBfpWM8d2g": {
    "date": "11/11/2018",
    "text": "Went here for dimsum and was a very nice surprise. The food is really good and the staff is really friendly. The place looks like an old tea house inside but it's so good that the decoration shouldn't bother you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yFZFMqNeifZwXwzC2iSaiQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yFZFMqNeifZwXwzC2iSaiQ/o.jpg"
      },
      {
        "img_id": "5qQgRvVriZykVaz9XI3avQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5qQgRvVriZykVaz9XI3avQ/o.jpg"
      },
      {
        "img_id": "zNBGFxyf3N33dSiuWtmL-w",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zNBGFxyf3N33dSiuWtmL-w/o.jpg"
      }
    ],
    "user_id": "Pi6VRCv-HDY4DbwrUutDww"
  },
  "enX_lHybFytWnBWhjCEyVA": {
    "date": "10/25/2018",
    "text": "Went here with a party of Five. The decor was quite dated. The menus were gross. They had very worn pages that needed to be replaced and at a minimum cleaned. The food was perhaps authentic, but it did not taste good. The dim sum was not having any fluid left in the noodle though we were given four in an order, it was not a good deal. A friend of mine ordered the duck, it looked delicious but the duck was cold and though brown, lacked a crispy skin. Therefore, the fat was gross and congealed. The whole dish just did not taste right because it was pre-cooked done and not heated correctly.  The flavor of the soups was quite good. The staff seemed to be pushing us to get through orders but was not really helpful with questions. Overall, not a great experience I would not recommend eating here.  The place is playing off the location in China town but is not a good representation of the nation's food especially for the cost.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tNXzBnzzcDZOE8gnNYRAyg",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tNXzBnzzcDZOE8gnNYRAyg/o.jpg"
      },
      {
        "img_id": "kOI55fBzGduSwzi55u5R0A",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kOI55fBzGduSwzi55u5R0A/o.jpg"
      },
      {
        "img_id": "LNcc2kVnwRPE8pGOW0eGbQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LNcc2kVnwRPE8pGOW0eGbQ/o.jpg"
      }
    ],
    "user_id": "I75WqXtbA3FmZKoieo7YSw"
  },
  "2Dricj52InV3Nk5Opt39Ow": {
    "date": "7/17/2016",
    "text": "My family (Chinese, Hawaiian) highly recommended this place and it really delivered. Since they have an extensive menu, I asked the waitress for a few of her favorites. She hands down recommended the sliced beef in black bean and chili sauce since it was where she was from (I believe it was Taiwan). By the description and the looks of it, I was skeptical but once I took my first bite it was an explosion of flavors. I never had anything like it and it was by far the best meal I had during my week trip in London. I recommend coming here and going with the staff favorites!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "aNjYDO0S46DEriyHUzeCmA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Chinatown",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aNjYDO0S46DEriyHUzeCmA/o.jpg"
      },
      {
        "img_id": "LJcxmH8Kg2rIZ4oWcWeDUQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Chinatown",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LJcxmH8Kg2rIZ4oWcWeDUQ/o.jpg"
      },
      {
        "img_id": "6MgQEudVm49nRxf3YBOJ7w",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Sliced beef in black bean and chili sauce",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6MgQEudVm49nRxf3YBOJ7w/o.jpg"
      }
    ],
    "user_id": "1OMTcgeVcV0nmqVMCnoeIg"
  },
  "JUGI6tgBLnBDmxgqmVANWw": {
    "date": "8/11/2018",
    "text": "TOURIST BEWARE! Ask for a detailed receipt of your consumption prior to paying. Having hundreds of alternatives to eat elsewhere nearby I would avoid the hassle and headache of their shady practices. Ate here for lunch and although we had a decent meal, with decent food service left a lot more to be desired. When asking for the receipt after our meal they came with the Credit Card machine without bringing the receipt. When asked for the detailed receipt they brought us paper slip with a 55 lbs written on it and no detailed purchase. We did the math and including their stated 12% service charge, our bill should have been under 50 dollars. When we insisted on the detailed bill they had us go to the main register and they printed out a bill stating that the total of the receipt with service charge was 49.60 lbs. They were very reluctant but after insisting they processed a refund and charged us for the correct amount.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssl_obliEmdi8ktq__ZmFA"
  },
  "L1aPEnqS3Aq88SX3gu2Qbg": {
    "date": "4/21/2018",
    "text": "Stumbled on this restaurant walking thru Chinatown. Saw the sign for dim sum and knew I had to try it.   Everything I tried tasted great. Wished they offered pork buns. Can't say it measures up to San Francisco hence the 4 star, but I would definitely eat here again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q_hurDuZCSRX0PmbVFE1BQ"
  },
  "5q4F2G2yOse-IyVhwBUA4A": {
    "date": "7/24/2017",
    "text": "Really enjoyed our experience at Gerard's. The staff was extremely accommodating. Our food was equally great. We started with Dim Sum appetizers which everyone enjoyed. We had sweet-and-sour chicken, chicken cashew nut and Seafood Lo Mein. Each of them were very good. All parties at the table gave them five stars. I would definitely recommend eating here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7CxjTFFm79dPkmIKHrsk9Q",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7CxjTFFm79dPkmIKHrsk9Q/o.jpg"
      },
      {
        "img_id": "jjxRFLCDRm-piIHMA4d-aw",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jjxRFLCDRm-piIHMA4d-aw/o.jpg"
      },
      {
        "img_id": "p2BOjqZUgbclYT6XG2-QAA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p2BOjqZUgbclYT6XG2-QAA/o.jpg"
      }
    ],
    "user_id": "d7DdH911x222DVSxiCL_ZA"
  },
  "X17iiukbPmd0rhMW9IpscA": {
    "date": "7/6/2017",
    "text": "Waiter was nice, but everything was kind of mediocre. Beef noodle soup was the best dish we ordered. Would I go there again? Probably not.Dishes:- Chicken with cashew- Beef & broccoli - Fried tofu - Beef noodle soup",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4UA32NcZzJETRBOUkXu1w"
  },
  "P1ECINBFLEJD0QRs0drffg": {
    "date": "9/11/2017",
    "text": "Food is average (some dishes are good while others are just ok) and prices are probably too high for the quality.The service is bad. They forget to bring dishes. In addition, they almost force you to tip after having already paid the service charge included in the bill.There are way better restaurants in Chinatown to waste your money and time here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  },
  "3uthD6fZwoHdupnOdUvixQ": {
    "date": "12/12/2016",
    "text": "Great Dim Sum! Came here after a quick Yelp check and it did not disappoint. I've had Dim Sum in Hong Kong and through out the USA and this is one of the top ones for me. Flavors and textures were on point. Another great thing is they accept credit cards. Service was friendly and fast, the place is kept clean, and there is two levels to fit customers on their busy hours.Stand out for me was the Crispy Pork Belly!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dxEQTQ5vj8nctV5E_RlKIQ"
  },
  "1yWzzvkyjaw8pp-VVZf4NA": {
    "date": "7/24/2018",
    "text": "Great food served in a nice setting. Reasonable prices. Air conditioned. In the heart of Chinatown very near Trafalgar Square.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2SpkZFyAkae0Un7HJbtCiQ"
  },
  "EIHhVcf02Spno4qbqKgWvA": {
    "date": "12/25/2017",
    "text": "Pleasantly surprised. Good service, enjoyed my duck + noodles, and the rest of my group enjoyed their meals. Be aware that they only take cash, but an ATM is just down the street",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6QVoBoALL0arQEzDhoDLA"
  },
  "fkxYPuYvNu7QVVH9iNyV_w": {
    "date": "2/14/2016",
    "text": "I found this restaurant pretty good, despite of thw reviews i read.Well, it is expensive but the food i had was tasty.We were a group of 9 from my office, lead by Debbi our chinese colleague. We had this dinner for the mew chinese year and we trusted her in the coiche of what to eat and drink.We had this lovely herbal tea during the entire dinner, because as debbi said \"Chinese people always drinks tea while they are eating\". It is a mix between a green tea and a matcha tea. Very nice.The arrived the startes. Everything was fried: from the prawn ball to the vevetables, spring rolls and meat. The fried was not heavy at all! The secound course was the pancake with duck. I never had duck before. It is nice! Tasty and fun this course as you are the one who create its own pancake with the souces you like.Finally the main courses arrived. Debbi ordered a lot of things: sweet and sour vegetables, lemon chicken, prawn with i don't remember, egg fried rice, singapore noodles and other things i don't remember.The total has been 33£ each.I vividly suggest this place",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "vDgw7evpMQJAeUvZ1VlOOA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vDgw7evpMQJAeUvZ1VlOOA/o.jpg"
      },
      {
        "img_id": "5vRUE-LszWt_LrC2CqpiSQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5vRUE-LszWt_LrC2CqpiSQ/o.jpg"
      },
      {
        "img_id": "SNCT1pJZTVFoxhPQP5kqfQ",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SNCT1pJZTVFoxhPQP5kqfQ/o.jpg"
      }
    ],
    "user_id": "v5ur4IUqTp5lSZe4P0YQrg"
  },
  "x3TH7wkXO4domdajvyx3GQ": {
    "date": "10/10/2017",
    "text": "Friendly staff, but the food is just ok. Came here before seeing a play. I'm Chinese and from San Francisco, so was not expecting the same level of taste in a tourist spot of London that I would expect to get at home. That said, they have a variety of dishes and compared to what we've had to pay for throughout London, the servings were generous for the price. Moved us through quickly enough, left happy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQx4KQekowcwCSE1UGWCdA"
  },
  "NctvYIPkamnLMWimesQqlw": {
    "date": "5/1/2016",
    "text": "Not my first choice to have dim sum here, but everywhere was full with long queues, and they were the only one that had a table for two available without waiting.  Anyway, it was a chance to try lunch as I have already been here a few times for dinner which was ok, but nothing to shout about.I ordered the usual steamed prawn and meat dumplings (har gow and siu mai), and deep fried octopus cake (which were abnormally too puffy) but the texture was good and springy and tasted good dipped in the sweet vinegar. I noticed that they have a trio of cheung fan with prawn, charsiu and scallops as one dish, so ordered that rather than having to decide which one to choose, why not have all three!  This dish was a little more expensive and also the sizing was much smaller than I am used to, so not sure if it is that good value after all.  The rice sheet wrapping should be almost transparent that you can see what is inside the wrap, so this was good.  We also ordered a bowl of rice noodles soup with mui choy (preserved mustard greens) and shredded duck, but they didn't have the mui choy and substituted it with picked mustard greens.  Normally, this would serve 3-4 people, but the bowl was the same except the contents was not.  We struggled to even serve 2, and it was quite bland.Dim sum for me is not dim sum without the steamed deep fried chickens claws in black bean and chili sauce, if done well the the meat is fleshy and soft and melts in your mouth.  Here, the flesh was not soft enough, but was ok.My companion likes the pan fried turnip paste so we had some of that too.  Finally, i also liked to finish off with something sweet, like the steamed lai wong bao (steamed custard buns). I love these baos.  However, did not realise they were not the ones I wanted, until I went to eat one, the filling was in liquid form, and just poured out, and was so sickly sweet and it felt like it was uncooked!  I have never come across this type of bao, and it was not all that nice, so definitely have to be more wary when ordering again, that I am ordering the right bun! Did not realise that there are different types of lai wong baos, hmm! Instead of the usual green teas, do try the chrysanthemum tea. Light and refreshing.Also, good to note that they do not charge for the take-away box, if you wish to take a doggy bag.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F9h3-vxyjebrU2gZQuGwhA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Baskets of steamed dumplings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F9h3-vxyjebrU2gZQuGwhA/o.jpg"
      },
      {
        "img_id": "jcwa7Jp14WH7-9zQWdktyA",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Deep fried octopus cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jcwa7Jp14WH7-9zQWdktyA/o.jpg"
      },
      {
        "img_id": "OTHRys-SeIprvuTmljwItg",
        "caption": "Photo of Gerrard's Corner - London, United Kingdom. Steamed custard buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OTHRys-SeIprvuTmljwItg/o.jpg"
      }
    ],
    "user_id": "NcGrzF4ygFZEOhWIkLdOVQ"
  },
  "gOepyqE9A_B4_KrLcEb0_w": {
    "date": "9/7/2017",
    "text": "Food was SO SO SO good!! Service was friendly and efficient.Will def go again on our next trip to London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QOKAQugybysauJztYYHcgg"
  },
  "AL5qwnT9fmKEDAQTtsjNPQ": {
    "date": "6/4/2017",
    "text": "Since more then ten years my favorite Cantonese restaurant in China Town. Love the Dim Sum and the roasted duck.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WypXuXwSEoXzEdAP8r0TQw"
  },
  "BNUJn1RnGpwc5skXe4yFvA": {
    "date": "8/21/2016",
    "text": "So many things wrong here.  Was waiting to meet friends outside and the door greeter came out to tell us off because we were standing in front of their sign. (On the public footpath, I might add.) As for the food, well seemed to consist mainly of tiny pieces of meet covered in cornfloury goop.  They want you to eat fast and get out, of course as it is essentially a tourist trap.  I really wouldn't bother. There are far better options, even nowadays when Chinatown is past its prime.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7016Gs82zG8XYE8HxJDHg"
  }
}