{
  "KI4bIoCP97mythPqsH7g0w": {
    "date": "12/13/2009",
    "text": "Excellent local Greenwich pub...friendly staff, chill atmosphere, and great home brewed beers. My favorite is the Kolner pils, fruity and light but the wheat beer is tasty too. Worth the extra cash for a pint to drink here veruse other pubs. The bartender recommended a bottled chocolate beer that I'd like to try, maybe in lieu of dessert after dinner.Haven't tried the food here yet, but it's definitely on my list, as we try to stop by here every time we're in the village...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E9m9adcWg9h8mRX9idm9Qw"
  },
  "zIyZfonTGj7F4fSLSM6YqQ": {
    "date": "2/5/2013",
    "text": "Had a great evenign with my buddy Steve. they have a good beer selection here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTJPKLMSq1JC07jPwttnyA"
  },
  "CJPgyEiG-_NLSVePIi3SNA": {
    "date": "11/16/2012",
    "text": "That's neat place, where we go sometimes the weekends. I prefer the Saturday menu and especially the homemade angus burger  beef is sooo tender. And their desserts aren't bad at all. Recommend!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oFYxWXl7lTEWJpdOtwV99g": {
    "date": "12/29/2011",
    "text": "Just a minute's walk down the street from our house, I feel fortunate to have such a nice pub in mostly residential part of the neighborhood. The beers on tap are Meantime Brewery (always nice to support the local goods) and the food is reliably good. My favorite menu item is definitely the burger (even the bun is good!), albeit a tiny bit overcooked but generously portioned and with homemade condiments and chips. My only disappointments are the small menu (wish they had a few more classic pub items as I'm sure they'd be great at it) and the Sunday roast - its OK, but like a lot of pubs serve thin slices of beef that aren't as rare as I'd like. Overall great for a drink or snack and in nice weather has a lovely small garden out back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FQa8tXO9DTC95dHlr9bi5w"
  },
  "DOvrbnGTGdKOJCXD0A8AEg": {
    "date": "9/15/2010",
    "text": "Brilliant pub. Its out of the way from the tourist trap of Greenwich and is a great place to go and sit and drink your way through the beer menuWe went there on a Sunday and the bar staff were excellent.  They are friendly efficient and have a good knowledge of all the beers so can guide you through the menu.nice beer garden as well",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hEZ51tCovIyb-6sbH5H3w"
  },
  "HtkfzqNgYdaPO95c2EKWTg": {
    "date": "1/25/2014",
    "text": "My visit to the Greenwich Union was a spur of the moment encounter having met friends locally and trying after their recommendation. Set along a quaint street with a historical setting the ambiance in the area is second to none. The selection of ales and beers is fantastic, with something for every palette to enjoy. Turning to the the menu i found it to be pretty standard but solid. I tried the fish and chips with the cod being fresh and light but the batter - a crucial part - was crisp but, i felt, a little lacking in the depth of taste. The chips were firm, thankfully missing the ubiquitous London grease and exploding with a fluffy potato interior. Kudos. A friend had his order mixed up and the manager was superior in his customer service qualities both apologising, getting the appropriate dish out to him quickly and going beyond by giving him a free drink. Good job mr manager. The casks are professionally kept, the kitchen is solid and efficient but all the time I had a nagging sensation that the space begged for a more imaginative and perhaps authentic revamp. The Union is run in ship-shape fashion offering a high quality experience and with a level of service that the locals clearly lap up but it lacks a certain imagination to mark it out as a marque London pub.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pF02nji8fFxf8W2Dh6MeBQ"
  },
  "cURSlcTpqBQdsjPHUhGrLA": {
    "date": "3/1/2008",
    "text": "This is the best pub in London. Well, OK I might have trouble proving that, but it's my local and I adore it. To give you an idea of how much I adore it, I should tell you that i live on the other side of Greenwich and have to get on a train to get here. But it's worth it. For a start, it's so untouched. It's a bit off the beaten track and you'll have a hard job finding it if no one has told you about it. This is a really amazing quality in a pub in Greenwich. Sure, it's busy at the weekends but it's busy with locals. And big fluffy dogs too. Cute. The bar staff are firendly and hot. All of them. They're happy to see me when I come in. They've never once siad anyhing when I've got too drunk at the bar. (It doesn't happen often I promise.) They let me eat ice cream in here while I drink beer. I don't need to bring my own ice cream though, the food here is great. It could be described as gastro pub food, but they source all their stuff locally and it's yummy. The do brinch as well. Their Sunday lunches are pretty good too. If a tad pretty looking when what you really want is more roasties. They also brew their own beer. Meantime Brewery is pretty well known south of the river and it's well worth discovering. Though I'm allergic to raspberries so I've never tried that flavour. Their wheat beer tastes of banana milkshake. (I'm a smoker, this may just be my messed up taste buds!) I absolutley can't say anything bad about it in here. there's a beer garden out the back and I've given myself pretty awful sunburn because I just didn't want to leave. It's so gorgeous in here. The whole pub makes me happy. It's got everything a local should have. Except a cat. Maybe it should have a cat.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hXB0sYXcbid0sBhg1HfkdA": {
    "date": "12/30/2008",
    "text": "Greenwich is a wonderful place to go to on a Sunday, to have a look around the market, take a walk through the park, and of course grab a beer and maybe a pub lunch, and The Union is the best place for it. It's a traditional English pub, but with an airy modern twist that makes it an attractive summer option, as well as somewhere to huddle in the winter. The garden is also great when it's sunny.The pub is the Meantime Brewing Company's first official home and serves no national beers, only its own products including fruit beers, pale ale and wheat beer. I'm a fan of the raspberry, and that's from someone who doesn't normally like beer.The food menu is traditional English fare, done to a solid, quality standard at reasonable but not cheap prices.This is a great place to visit after a walk, for an evening with friends, or just an afternoon alone reading. The beers alone are worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnRGniwBA5vYvlHo7A3OHw"
  },
  "LyAoZucRKYSq_LBsXlbUHg": {
    "date": "11/28/2013",
    "text": "Great beer and very good food.   Don't generally like German smoked beers but theirs is perfect with the heavier meals.   Definitely coming back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zuf_p-RIGYlK-7ZsyQV2HA"
  },
  "DkcIdfp-3rcvwF9Kx0XxpA": {
    "date": "8/20/2011",
    "text": "The pub we decided to settle in for lunch was The Greenwich Union. The Greenwich Union is one of four pubs along Royal Hill  they are all pretty much in a row, but most if not all do great business and each seems to have its own vibe and particular atmosphere  there is something for everyone.In any case before we tackle the roast lets go back to the pub itself, its housed in what looks like a traditional pub and inside is also very traditional with lots of wood however the back part of the pub opens out into a light and airey conservatory with booth seats, further on is the beer garden. The music going on in the back ground is just at the right level for you to be aware of it and to hum along to your fav tunes but not too loud that you cant hear yourself or anyone else speak.It wasnt too busy which was great, though was largely because we went quite early it would soon fill up. We sat in one of the booth seats.On offer was a Vege option and Beef, Lamb and Pork the cost of each was £12.20 (the Vege option was cheaper). I love it when a pub separates out its roast menu  it makes it feel a little more special and shows that on a week on week basis it could change depending on whats available.I settled for the Beef and my other half on the Pork. Before I could get to the bar to order one of the staff came up and asked if we wanted anything and were keen to please always a good sign.InsideThe food arrived really quickly  probably within 10 minutes if that  maybe a little soon for my liking, surely some of the joy in eating food is the anticipation of it..anywaySo once it arrived what did we get for our money:Meat: Beef in slices a generous portion \\ Pork was the same in slices with cracking but a generous portionVeg: A large roasted carrot, green beans and red cabbage (a nice and different touch!)Potatoes: Roasted 2 largeOther: Large yorkshire pudding, Gravy (made with Meantimes own London Stout), horseraddish sauce for the Beef and Apple sauce for the Pork in a separate dish.Heres the roastIt was very attractively presented and hot, I loved the fact their yorkshire puddings were home made and werent some uniformed Aunt Bessies  though it was a little too crunchy for my liking. On the reverse the potatoes were large but not quite crispy enough. The red cabbage was a nice touch  always nice to see different veg, and being lightly pickled it added a different taste sensation when combined with the meat or the potatoes. The gravy was rich and using London Stout again brought it to a different level  would have been nice to have more of it though!All in all a nice roast  it goes to the top of the leader board.Here are the ratingsMeat 4.5/5Veg 4/5Potatoes 3/5Gravy 4/5Other (ie yorkshire pudds) 3/5Service 4/5Value for money 3.5/5 (possibly just a little overpriced)Total 26/35View Larger Map",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zC7dXpmO7oUKqwYaads0lw": {
    "date": "11/19/2008",
    "text": "I first learnt about the Greenwich Union after visiting their stall at the Catford Beer festival a couple of years ago. Initially mistaking this pub for part of the University bar was an easy error to make in name, but upon seeing the actual pub it soon becomes clear that the connection ends there. The pub plays host to a series of it's own varied beers. Definitely a place worth visiting if you'd like to see that Greenwich isn't just confined to the surroundings of the market square. Saving the best for last, on my most recent visit there I was very pleased to discover that they sell a very tasty bottled ciderI unfortunately forget it's name, but if you ask for the sweet bottled cider I'm sure they will know the stuff. Definitely worth a try if you like your libations apple based!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FShvQ9UteU5sO4At2ZQcEA": {
    "date": "7/3/2008",
    "text": "Like Sainy I have to agree the food here is really nice.I had a sunday lunch here with some friends and so we were looking for 8 lunches and it only took around 20min to be served which I thought was brilliant given there were quite a few people here. The beer garden is a nice touch and for all you smokers that would be a great plus Like Siany mentioned they brew there own beer and have some varied tasting beers but I enjoyed trying them all. I cant say what the evenings are like here as we came during the lunchtime period but i'm sure if its anything like lunchtime thwen you wont be disapointed.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "2oZAm-DwFjTW_HIo9MHQyQ": {
    "date": "5/8/2012",
    "text": "Great atmosphere, went her while on holiday in Greenwich and looking for some good locally brewed beers. The bartender gave me a sample of  everything on tap without me even asking. Staff was helpful and attentive and the beers are good and reasonably priced. The pub ha a nice modern feel to it and also has a nice garden in the back with tables and seating that was very nice to sit. Would definitely recommend going here if you looking for a good pub, one of the best I've been to in London so far. Also the burger was ginormous and very good, definitely pub priced but it's more food then you'll be able to finish for 10 pounds a d above average quality",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Zwcbb8-3RQeyn5p_okCHg"
  },
  "liohvMNnaS59APzhTUG1ew": {
    "date": "3/6/2010",
    "text": "Best pub in London, very good varied food and the beer is amazing. Relaxed atmosphere and fresh locally brewed beer, how can you improve on that?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F850YGr5lMCm_auuItpMvA"
  },
  "KLdRBpUJcfph7nIXTn6ZAQ": {
    "date": "2/2/2009",
    "text": "Note: I ate here in July of '06, so I apologize if anything has changed.Our family of 5 spent two weeks in London. This is by far the best food we had on our trip, coupled with the friendliest service. No offense, but Londoners don't seem to smile much. Not true here. I found the Union in a London with Kids guide. It's a bit off the tourist track, about a 15 minute walk from the park, but well worth it. The food was excellent- fresh fish perfectly cooked, and those potato patty things were crazy good! In fact we came back here 2 more times even though it meant a long boat trip down the Thames.Great for kids, if yours are fairly obedient anyway. We found that most restaurants discourage children, if not forbid them outright. True, we saw a lot of bratty British kids (what's with that?) but our daughters are well behaved and enjoy good food, not McDonald's. The Union welcomed us with open arms. The girls loved the cat in the garden out back, and we couldn't get enough of their delicious beer- we tried almost everything! It's been two and a half years but I still remember this place fondly, and have recommended it to my British friends and relations. Go there now and have a pint for me!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "77cFD1N1PtMVmGrqs9af5A"
  },
  "OFCVrGC8GjmmQxl6-oQf_w": {
    "date": "7/6/2009",
    "text": "The reviews here on the drinks are accurate, a wide selection of great beers and ciders. The service on the other hand needs improvement. Two guys, just weren't enough to keep up with demand on the sunny weekend we went there. So long waits were a feature. Also, the bar is split in two, and they only seemed interested in serving one end. How about one bar tender on each side? Really, it makes sense. But that isn't why I'm writing this. I really wanted to warn about the food. We had a selection of bar snacks, hummus dip, black pudding, chorizo and fish sticks. The fish was pretty decent, so no complaints there other than the fact they ran out of condiments. As the ketchup bottles were empty (but still out), I asked if there was any more. I was unapologetically told they had run out. The black pudding was charred to a crisp, the hummus tasted only of lemon. The presentation was great, but the rest was poor.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "G2NNkJJfIcsYEq8E9papdQ": {
    "date": "1/21/2009",
    "text": "The Union pub in Greenwich is off the beaten track up a residential side road, so unless you'd heard about it you probably wouldn't find it by accident. It has a pleasant atmosphere, nice decor and the staff are very friendly. A bit of a trendy pub! At the Union they brew their own beer, which I am told is very good. I don't drink beer myself but apparently the chocolate beer is marvellous! I had a meal here with some friends between Christmas and New Year, and have to say I wasn't particularly impressed with the standard of the food, it wasn't cheap. Maybe we came at a bad time. The bread pudding however, was excellent.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rfeZmfEDo_ysV_OcWhM2yQ": {
    "date": "10/25/2008",
    "text": "i don't know about being the best- the price increase startled me a little bit. Having said that the union has a charm about the place- its one of those pubs that you go to have one or two, and read a paper. the beers are excellent- as well as brewed locally ( a personal fav is the wheat beer). i may see you guys in there some time!. the staff are always willing to help out, as well as talk to you- which lets face it, is getting rare nowadays! the food is good, overall a charming place, if not a little overpriced, but hey, this is greenwich!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jw_ZItHdRfaSyfAqk_i-kA": {
    "date": "11/4/2009",
    "text": "Go in the evening and great little find, own beer selection and great for a conversation. Lots of drama student types the night I went and staff friendly although very strict on closing time and odd they were preparing to close 15 min before 11pm with many of the taps for the beer covered in cling film for the night. There was still about 10 people drinking in pub. Went again on a Saturday morning - avoid at all cost during this time, full of three wheeled trendy mummies and pretentios kiddies running around the place.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1oCBuN0YnUsC6jhl9T4WIA": {
    "date": "11/19/2008",
    "text": "The chocolate beer here is to die for the vanilla beer a close runner. I have never seen such a good selection of beers in a British pub. What a fantastic pub. The food is ok but I would just recommend a good spot at the bar and a plate of nachos. You want to try all the lovely unusual beers on offer but beware they are very strong. There is a lovely conservatory out the back and the beer garden is smoker friendly with heaters outside. It is like being in Belgium with so many varieties of beer. This is a must visit place, but please don't be tempted to take the car.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MaM0ecgKgQrl_zXwQPafuw": {
    "date": "6/8/2015",
    "text": "So happy Yelp led me here.  Great food. Great brew selection.   Mushy peas is mushed peas...in case you wondered.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_khxNztzaS1wdpOB4YYKAQ"
  },
  "pf3ZUNa0lcPB--ezO3C4cA": {
    "date": "5/8/2016",
    "text": "Good beer and snacks like chips, but the burger was barely edible: too lean, too finely ground, and too cooked. It tasted like a dried up meat paste.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zoPRnL6Ppwj_fDYtuomM_Q"
  },
  "ems5YEzen4mr-N4ByFGjyg": {
    "date": "6/5/2016",
    "text": "Alright pub. Good atmosphere. Disappointed with the Sunday lunch. Very noticeable small portions i.e. Half a potato and a single slice of pork loin with other veggies isn't enough.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nnp9I23H-vzT5ZjCM50YZw"
  },
  "1l7tfwMVdzoPKfrhRAnMBQ": {
    "date": "10/22/2012",
    "text": "Cracking pub. Has the feel of a locals' favourite, with friendly staff and superb beers.This is a Meantime Brewery pub - so you might struggle if you're looking to have a pint of your regular drop, but ask the staff to recommend something based on what you like. My personal favourite of their beers is the Yakima Red.It's a relaxed place, this. No pretense to be found.The food is very good. I enjoyed their burger a lot. If I hadn't been sporting a hangover and no doubt slightly worse for wear after a very enjoyable brewery tour, I might have been more adventurous with my choice, as there is a lot to choose from. My friend's Fishermans Pie was excellent. They also serve roast dinners on a Sunday until they run out.Can't recommend Meantime beers enough. Easily my favourite brewery in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "LlCCrsFrpcWqEMI2kzc87g": {
    "date": "1/17/2013",
    "text": "This is a fantastic pub. They seem to have virtually all the meantime beers which are great to try but it also means that there should be something for everyone. I had a delicious smoked bock and a hoppy lager..both were really fantastically tasty beverages....simple as. You can understand why they are on the expensive end of the scale. Apparently they serve real ale too, but I completely missed that so captivated as I was by the Meantime options.The pub itself if very pleasant, in particular the beer garden. They serve food...with burgers that look like you might need to install a hinge on your jaw if you want to eat one.I was disappointed when we had to leave",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "_z5UkcPgaSthp3uzyx00bQ": {
    "date": "1/14/2012",
    "text": "First off, I'm a dedicated and devoted wine drinker.  However, The Union holds a special place in my heart - it's where my fiance took me on our first date, and it's the place where I learned to really like beer.  I don't remember how many pints I consumed here (or at the Meantime for that matter) but obviously it was enough for me to agree to a long distance relationship (4000 miles and an ocean.  yep.)I actually haven't eaten at the Union, but they serve draught beer from the Meantime and I remember having a wheat beer that was particularly tasty and at 3 quid a pint, I found it a beautiful addition to my romance with London and one of its (previously) lifelong inhabitants.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "KwIU9DBHSPeqW5MnMAwHxQ"
  },
  "QHKf7C8FQ7LG4Ki1xxukKg": {
    "date": "6/15/2012",
    "text": "Enjoyed a very pleasant couple of hours here earlier this week. Food (I opted for the fish and chips, friend had a burger - which comes with its little bucket of chips) was good - though I would have liked a few more chips! But what really sets this pub apart (and makes it worth the short trek from Greenwich Town Centre) is the Meantime beers. I had a Wheat beer and a Pale Ale - both absolutely brilliant - OK, yes, I am a Meantime fan!Staff were friendly and efficient, and the pub wasn't too noisy either. The pub had football on one screen when we arrived, but the commentary was turned down so that it wasn't intrusive. As more patrons arrived, we were asked if we minded having another screen switched on (but again without sound) - no problem. Meant we could eat and drink in comfort, and the pub doesn't get full of people gawping at the screens rather than socialising.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xX8Dzb18tkGCw-xmVy0knA"
  },
  "lz6Ozbw3sbiZdmFgOS7CuA": {
    "date": "5/11/2014",
    "text": "Excellent gastropub. We spent the day in Greenwich to do some touring, and had decided in advance to do Sunday roast while we were there. I did some pre-research and wrote down a few pub names. This one is a little off the beaten tourist path by a few blocks, but was nonetheless packed -- a good sign, since they were likely all locals. We had a 15 minute wait - not problem, and a little mix up that the people before us got seated first. But the waiter was profusely apologetic so no harm done.We were with a toddler and they were able to bring food for him right away - the pigs in a blanket (mini sausages wrapped in bacon - so amazing), and a side of perfectly good chips. Husband had the roast beef roast. I had the vegetarian roast. Both came on a bed of roasted veggies and some greens, drizzled in gravy and a yorkshire pudding. Husband thought the roast beef was exceptional. I was literally in heaven with my veggie cheese tart and accoutrements. It's so rare to find a good vegetarian roast. Every mouthful was delectable. The one weakness was the yorkshire pudding, which was pretty dry and crunchy. I like some breadiness there for sopping up the gravy. I would return here in a second. Wish i'd found a similar place in the city.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tiLxdVSxa_1JUIWkVbrLcw"
  },
  "shu2gUzsQj_lrCqqD1DoVQ": {
    "date": "9/23/2011",
    "text": "I Yelp for a reason. I use Yelp and therefore, feel it's my duty to give back what I have taken. The Greenwich Union is a perfect example of this.On the weekend my partner in crime (and fun times) and I went on a cycling adventure to Greenwich from our home in Stoke Newington. We had a few things planned along the way but by 1pm we'd hit Greenwich and were starving. Using my trusty Yely app, I hunted for a pub with an outside space and The Greenwich Union came up. Wonderful! So after really enjoying myself, I just had to leave a review...The Greenwich Union serves up a selection of local Meantime beers and have recently taken Brewdog on tap too. They have specials that change daily and really wonderful British pub food - you may even dare to call it a gastropub (you crazy Americans you). The portions are huge and the service is pretty decent too.As always, I ordered a Bloody Mary and was suprised at how well made it was. Kind of spicy and then I could add more if needed - I love it when they let you add extra bits without judging. And there really was no judgment on the amount of Tabasco I splashed in. As for the dining space, it was lovely, they have a little patio with neat little tables outside, loads in fact. They also have a conservatory which is great to escape to when you need to get out the rain, and a reasonable sized inside area too. Well done Greenwich Union, well done!Oh did I mention it was kid friendly? It's kid friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "nRAywRsGCcH0vCl12FjEKw": {
    "date": "6/12/2014",
    "text": "I read all the comments on yelp and decided to go for dinner. My husband and I are visiting from California and staying in Greenwich (closer to Deptford but the hotel says Mercure Greenwich). Everything about the night was great.  And it was the most crowded place we saw. We walked past a few restaurants and only saw a few people in the other restaurant s. Maybe we will go back tonight",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7fnPap29KuYmSy8mh3zSYQ"
  },
  "0KC9to_wCJKsCBnv0LJKww": {
    "date": "10/16/2014",
    "text": "Love Love LOVE this gastropub that I visited in London.  Had a 10 minute wait or so, no issues there.  Food was great, reasonably priced, drinks were great. Wasn't blastly far from my flat either.  Very recommended and must i add, GREAT CRAFT BEERS!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nLlrGMgHkQq3T6K9O4JV8A"
  },
  "m1wltrP6uzy0RjT2e8ezHQ": {
    "date": "2/25/2010",
    "text": "We recently bowled in here for a Sunday roast whilst in the neighbourhood - as a visitor from the far North I'd often heard of The Union in the wilds of Greenwich, and was quite pleased with what I found. The main drawcard of this place is the beer: the tap selection is almost solely the preserve of Meantime Brewery, London's excellent artisans of the brew. There were around 6-8 interesting looking beers on keg, and 3 further ales on handpump. We tried several of them, and they were all very tasty & fresh tasting - the Smoked Bock was an interesting find, the Wheatbeer had the fruity character of the German variety it's based on, and the handpumped London Pale Ale was sheer hoppy, piney joy in a glass! The building itself seemed cosy enough, but with a slightly modernised edge to it: perhaps it was the blondwood finish of everything; it definitely didn't give off the vibe of Old Man pub. We ordered Sunday lunch, and whilst initially thought we might've been screwed over on portion size (I seem to recall the roast being £12?), although it was all very tasty and by the time we'd finished we felt just on the pleasant side of being farctate. Which left room for more beer. The staff were friendly and helpful: the barman mistook my indecision over which beer to try for confusion, and set about describing the different styles, which he did very capably and clearly without sounding like a prat. I'd happily swing back through there - no questions! The only downside is that it didn't seem quite as cosy as the Richard I next door. Otherwise: nice battle cruiser, this!",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "LDsC1hLTnFuGiZCvsTN3rw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. The inside of The Union on a lazy Sunday afternoon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LDsC1hLTnFuGiZCvsTN3rw/o.jpg"
      }
    ],
    "user_id": null
  },
  "LuoGiPUTL8X9_88uvJ_dRQ": {
    "date": "1/24/2011",
    "text": "Meantime might be the world's greatest brand of beer. So of course, any pub that specializes in serving Meantime is bound to rank pretty highly. I'm a big fan of the Greenwich Union. It's tucked away on a side street, close to all of the main attractions of Greenwich, but far enough away that you get few tourists than other places. Service was great. The bar staff was pretty efficient, even as the pub got packed later in the evening. My biggest problem with the Greenwich Union was the outdoor seating area. I sat on the back patio and got a great view of the tall, impenetrable wooden fence the pub had set up around its premises. My suggestion: If you find yourself in Greenwich, and you want a pint of Meantime, walk down the street to the Old Brewery. But without taking the Old Brewery into account, the Greenwich Union is tops.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5lzxA444rZf39IpJiFYyVA"
  },
  "RcspUJlarwdEfYWgbKSTSw": {
    "date": "12/9/2011",
    "text": "The reasons why I like the Greenwich Union so much is because their overall offering is quite good. The staff are attentive and friendly, the food is good (especially the pork burger), they serve predominately Meantime Brewery's beers (which are my favourite), the prices are reasonable and both the inside and the beer garden are great places to hangout and spend the afternoon or evening in. Additionally, as the location is a bit off the beaten path, there really aren't the usual Greenwich tourist lingering about.For me, it really doesn't get much better than the Greenwich Union. I highly recommend it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GhPsVqtRtf1t-H9OIa1jMg"
  },
  "EbmaiNDNIy53cgPJ48Xxkw": {
    "date": "6/27/2014",
    "text": "This spot was definitely worth the 5-10 minute walk from the Cutty Sark area of Greenwich. Great service, fantastic beer- our very helpful server brought out a tasting tray so we could pick between the incredible array if craft beers. Nice pub atmosphere, very nice outdoor garden Area (complete with amusing wire haired fox terrier wandering about). We were the only tourists there, the rest were all locals. Beer was fantastic and food was very good,  albeit nothing super creative (it's a pub!) Asparagus starter was delicious, good meat pie and scotch egg...only down note was the decidedly inferior coffee. Oh well...Do take the walk, avoid the tourist traps, ask the waiter to recommend an unusual beer and enjoy!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cxuvx74m0ZNH5qGywo0R8w"
  },
  "UHJLN3PUJg-pRgR6D5yS6g": {
    "date": "10/29/2013",
    "text": "I must have caught a thinish batch from the bottom of the bag on my first visit because the second time around the chips showed up in all their fat pub chip horror. Puke, but the beer and burger, which I forgot to make med-rare, hello Mcfly ask me!!!! were still great. Oh wait, it's Saturday around 18:00 (pre 5:30 should be safe for a table) and they are slammed so they don't need me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5TtAGCQx1MZFY_RKIrGww"
  },
  "S20ABjrxz9cbFCL8QTu60g": {
    "date": "4/17/2013",
    "text": "Stopped here for dinner with a friend. Very much a local but with a huge beer selection. The sirloin steak (which is not the most frou-frou cut) came topped with a yummy herb and peppercorn butter. Chips were great too. Barkeep was nice and very knowledgeable but like a lot of locals, there was a bit of a chilliness towards us newbies from the regulars/locals.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QN-ltGtFDmZ0SixAX9Ik1w"
  },
  "Gpc_fRT2-PznCpTaYaHNBg": {
    "date": "11/27/2008",
    "text": "Of all the pubs in Greenwich (and there are many) this is definitely my favourite. It has great beer, a perfect pub menu and a huge beer garden for the summer. So far my description has not made it seem out of the ordinary at all, but it really does stand out from other pubs. The beer they serve is in fact from their own independent Meantime Brewing Company and not from any national breweries. On draught they have a variety of Bavarian country style lagers, pale ales and amber lagers whilst by the bottle you can try their delicious coffee and chocolate beers, as well as the other excellent worldwide beers they store.The lunch and dinner menus are simple and traditional- cod & chips, steak and stout pie, steak and chips and roast shoulder of lamb during the week, on Saturdays a reasonable brunch menu of eggs florentine and benedict, bacon butties and salt beef hashes and on Sundays, an excellent roast dinner for under 13 pounds (roast beef is 12.95 whilst lamb and chicken is 10.95) It is a perfect place for groups- the crowd is typically friendly and unpretencious- but also an excellent place to sit on your own and read the newspaper.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fsw5Uy2o2A3OY837WYqVcw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fsw5Uy2o2A3OY837WYqVcw/o.jpg"
      }
    ],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "b3YHa6oPs_bpgfXJlmNp7A": {
    "date": "5/24/2010",
    "text": "I can't get enough of this place.I live in nottingham as a student but home is about 5 miles from greenwich.I still always make my way here when the sun is out.It's the sort of place where you can have a long conversation with a friend(s), you can read a book or just knock a few back.The Beer is the reason to go, but the food is also one to go.The staff are friendly and any beer on tap you wish to try is no only accepted but is offered to you.They have a huge selection of world beers but I always drink the Union beers, with the English/London Pale Ale my favourite.Best thing about the place aside from fresh beer is the beer garden!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mw1fd0SOJF80It6fppqhKg"
  },
  "wIARtW4rat23nJU7iICoFw": {
    "date": "8/29/2009",
    "text": "We came here on the August Bank Holiday weekend on the strength of previous Yelp reviews. We're happy to report that the Greenwich Union is still going strong and their beers and ales are fantastic! This is micro-brew without the 'tude. In the US we had gotten used to micro-breweries being obnoxious and over the top with arrogant self-absorption. This was definitely a breath of fresh air- a real true pub... that just so happens to also serve small-batch beer. We tried a couple of their seasonal brews, including the Belgian-style High Saison, and enjoyed all of them.The food is definitely not too shabby either. I had the sweet potato cake with goat cheese and rocket. Very flavorful! My husband ordered the burger and while he enjoyed it and thought it very good, he wanted it made clear that the beef was mixed with a lot of bread crumbs and spices. So if you're looking for a very beefy, American-style burger, this isn't it. But he really enjoyed it. Little one had the fish and chips (cod) and yum-yummed it right up.Service was snappy and very friendly and they were really happy to give us tasters of any of their beers. We sat in the front of the bar where it is slightly darker and more pubby, but the atrium area at the back looked warm and inviting and glowed a nice tangerine colour. It was full of locals enjoying a pint and some company on a lazy afternoon. The outdoor garden patio also looked fantastic, but it was on-and-off rainy and windy while we were there.We enjoyed ourselves very much and will definitely be back some time when we're in Greenwich again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "KG8FlMhNYZbPbaBveajYEQ"
  },
  "D8NL6y9fPK2s2VOuKyFKiA": {
    "date": "2/21/2016",
    "text": "Excellent Sunday roast. You couldn't ask for beget than that. The beer selection is to die for. I've been drinking the cognac one and it's out of this world.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "8S0nfxB6nMru1ZpbRT3WDQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8S0nfxB6nMru1ZpbRT3WDQ/o.jpg"
      },
      {
        "img_id": "M5NYH1pSsw7e1-gcrbd0sA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M5NYH1pSsw7e1-gcrbd0sA/o.jpg"
      },
      {
        "img_id": "jYQ2pekfvV2ljMr9rmbF-w",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jYQ2pekfvV2ljMr9rmbF-w/o.jpg"
      }
    ],
    "user_id": "eof5BdqbG0dSVTWRyLj_2g"
  },
  "ftuE0xfJbKOaELvJ7qbLqA": {
    "date": "1/21/2017",
    "text": "Awesome!  Great food, great beer, great service. This place is fantastic.We had the burger and the fish and chips. Both were excellent. Also had the hummus appetizer and was also very good. Wheat beer and cider beer topped it off. Great spot.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "niuhZ4Lm0zKgih1O0eBbEg"
  },
  "w2Y5yS8I-si774-S3Np-zw": {
    "date": "10/11/2017",
    "text": "This was a great find while we were visiting Greenwich. Food was excellent, and service was spectacular. When we arrived they allowed us to sample their house crafted beers in order to get familiar. Would highly recommend if you're in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SM4ow_ZIwX770Tb-K6zvVQ"
  },
  "ZU-P9gFuwwst6VT9YkVveQ": {
    "date": "9/27/2012",
    "text": "We had decided to take a riverboat cruise from Westminster  Pier to  Greenwich. When we landed, we were hungry. We found a lot of restaurants/pubs in the Town Centre area but decided to walk further,  a little off the beaten path. We are glad we stumbled upon the Greenwich Union!!!!This was our kind of pub. They have a large 'beer bible' list offering of many different beers on tap and bottled. They showcase local/craft  beers. They even had a few from the USA (Flying Dog and Victory).  They serve flights of beer. The food was very good. The staff was really friendly. The bartender allowed us to sample the beers before buying to see what we liked (just like they do in many pubs in the USA). We sat outside on the back patio (kind of a small beer garden). For beers, Kate had the local  beer  'Meantime Wheat' from the The Meantime Brewing Company, it was delicious! I had a few Belgian offerings but ended up sticking to the Meantime beers. For food,  Kate had the Union lamb burger and I had the 28 day aged Angus burger. Both were tasty and cooked to perfection. The hand-cut chips were crispy the way we like em'. The next time we visit London, we must come back to the Greewich Union.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wRzxuepaWZ74aeda5XWTVw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wRzxuepaWZ74aeda5XWTVw/o.jpg"
      },
      {
        "img_id": "bssoFyxO2gIbyTA8SCLAVw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bssoFyxO2gIbyTA8SCLAVw/o.jpg"
      },
      {
        "img_id": "rYXjO-wuLd2hxi34e45--w",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rYXjO-wuLd2hxi34e45--w/o.jpg"
      }
    ],
    "user_id": "UJEjJgi1xpmLR4b3J8fn2Q"
  },
  "09OnZRpUyh9zfUYv_Y0aAA": {
    "date": "10/15/2015",
    "text": "First off, let me start by saying that in all the years I lived in Greenwich (which was about 4 in total), I never stumbled across this little place. However, having now moved away, I got a tip-off that this was worth a visit, and it certainly was.The bar has an extensive range to offer, and the food is also very good - fresh, locally sourced and well-cooked. My only two slight quibbles are that the pudding menu is slightly lacking (nothing with chocolate - apart from ice cream, and it's Winter!), and I was offered no option to have my burger rare/medium etc., and it came well done, which wouldn't have been my first choice. That said, it was still moist, well-seasoned and very enjoyable, so it's only a minor point for improvement.Trek up Royal Hill and find this place - cosy for a Winter's evening!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8rJuX9ZfQmp4CtJOmjErg"
  },
  "Bkv_8GA8b7II0lnfhL7-6w": {
    "date": "8/2/2017",
    "text": "It was really disappointing ! Fish had strong bitter after taste . Hamburger very mediocre . The only saving grace was the friendly service .",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z0LdyAkDM_Y6ky3x3Vm1TQ"
  },
  "cglq_1IpVXwI9bjL7oyeOg": {
    "date": "11/28/2015",
    "text": "I can here for a brew during a visit to England. I had traveled around Greenwich and England. I have only been around Greenwich for the more \"touristy\" places. Before I got there, I booked a table, which after being there, was a great thing I did because the place was packed!    I came for an ale and fish and chips because I heard rumors the place had the best fish and chips from my friend, who happens to live in England. Everything tasted great! The Ale Was awesome, the Fish, was cooked perfectly, and ahh the chips, were AMAZING!!! I think they were the best chips in Greenwich! Next time I visit my friend, I will visit here!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-ZKEQ0GYSt1LvF_gbKHQg"
  },
  "GdJwLpmUFMxndIAmMGCCoQ": {
    "date": "8/11/2017",
    "text": "Everything was quite good and they have a nice lunch menu.  From the Scotch Eggs to the Falafel wraps you couldn't go wrong!  Service and the site were great to.  You should come here :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ksYHvi1QWsg-M-JucNkn9Q"
  },
  "OeEEraoCI0TMDfzv7nD04Q": {
    "date": "8/4/2017",
    "text": "We had a great lunch with excellent beer and wonderful, friendly service.  The staff asks you about your beer preferences and bring your a small tasting flight.  We were happy with the craft beer selection.  Delicious sandwiches and fantastic chips!  It's located a couple blocks away from all the touristy joints.  We loved it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "to_u7HvoZnoEWf1Z7xh2ug"
  },
  "RC6gegaFg4uACss02hoySQ": {
    "date": "6/19/2015",
    "text": "Decent spot. Decent beer. Decent food. I used to think of this place as a bit meh with expensive food. Then I figured it out. It's a good pub. The food is a bit pricier than your low level pub fare, but that's because it's better. The beer isn't particularly expensive (not saying it's cheap) but it's good. Meantime. Need I say more? Ok I will. Meantime and loads of other beers. With glasses to match. GLASSES TO MATCH. I'm coming here again. It's just a chilled atmosphere. I recommend you do too.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XB-IGrkkY4u-pCkCmOVEBA"
  },
  "7EQqYi4q2_UGIHyuY0Izig": {
    "date": "7/5/2017",
    "text": "First night in London and came across this place not to far from the hotel. The service was amazing and the food was perfect! I was unsure which beer to get and they provided a sample of beers based on my preference of light or dark. It made for a great first impression of London. I definitely recommend stoping in for a pint.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WSn3BJYwQp05O6yhD_fDGg"
  },
  "AjFIc2ji3EMYxYZl6Gu4Jg": {
    "date": "8/10/2015",
    "text": "Contrary to the other reviews, my Sunday lunch was great. The crackling of the pork was nice and crisp. The only annoying thing is that this place doesn't take reservations - and it can become busy and difficult to get a table at times. If eating, you can also put drinks on the tab (table service) and I was pleased to see that the bill didn't include an \"automatic gratuity\" insult that unfortunately has become standard around here",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ghTkJHG6YCO7EiY0DLauDQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Craft beer?!? WTF",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ghTkJHG6YCO7EiY0DLauDQ/o.jpg"
      },
      {
        "img_id": "n05XEPPpkgc3-X9bh7UI7w",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Sunday roast pork at the Union",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n05XEPPpkgc3-X9bh7UI7w/o.jpg"
      }
    ],
    "user_id": "cPbzi8EYG0YXfQobvau8RQ"
  },
  "tAoobDzDhER8FKzra0hadA": {
    "date": "6/13/2015",
    "text": "The *home* of British craft beer. It literally all started here in this rather unassuming little back-street pub. I remember visiting here in my teenage years to sample the strange flavoured beer they had. Now I go to enjoy the Meantime beer on tap. I've heard the food is decent and they have a nice garden to enjoy it in. There are a couple of pubs next door that are also worth checking out if you're in the neighbourhood!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M9ZTlN5V717HtPiwT8DEWg"
  },
  "eeslAJWxBbu7w4Y5elwbaw": {
    "date": "9/22/2015",
    "text": "Great beers? Meantime Brewery. CheckGreat tasting Sunday roast? Both beef and pork with crackling. CheckGood desserts? CheckHelpful friendly staff? CheckWould I return? Yes!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uQ69HLjnorXVXLq31MwZQ"
  },
  "S6eup7CWMcdG9EZVue9Qdw": {
    "date": "6/14/2013",
    "text": "Came hear for dinner while visiting beautiful London. What a great place. True to the meaning of Pub. A lot of locals, and lets face it, giving the location I don't see a whole lot of tourists crowding this place, which is a great thing.Talk about one of the best beer selection I ever seen. Several of them in the top 50 beers of the world. I'm yet to see that many top rated beers together anywhere in the US. Not to mention Meantime on draft. Meantime, a brewery I got introduced to by my friend while in London and oh how I wish I had some with me. Typical pub food but very very good. We were four and shared a Veggie burger, risotto, steak and Shepherd's pie. The veggie burger was incredible, can't believe I ate a veggie anything. The risotto was creamy and much better that what you find in some Italian restaurants. The steak was perfectly cooked and the Shepherd's pie was delicious. Another reason to love London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Ehl_cTP3obGOWU6DkLOKHA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Delicious steak",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ehl_cTP3obGOWU6DkLOKHA/o.jpg"
      }
    ],
    "user_id": "dhoTdvlMGKiTCOt4tx5Hfw"
  },
  "IeoDxMD_Uy3GPxLhPr9OGw": {
    "date": "7/6/2015",
    "text": "Great food, good beer. The staff is very helpful. Had the fish and chips and really enjoyed it. If you in Greenwich I highly recommend this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "knuV5nP318ei36kHOUO2Qg"
  },
  "JzgqlP8sxKnxYMlT0h0KLg": {
    "date": "8/8/2011",
    "text": "I love Meantime Brewing Co..  And, I love that Meantime is showcased here at the Greenwich Union.  There are other beers from abroad (Germany, CA., NY.) that I can get behind both serving and drinking with my head held high.  Anchor Steam Porter, anyone?  -a rarity even back home.The bar itself is tidy and spacious.  The outside seating area in back on a warm day is packed out with happy folks a-drinkin'.  There's a front patio, too, for people-watching and beer-sipping. And, as previously stated, the bar staff is nice.  They have a tip-cup out on the bar, too.  Methinks that too many \"Amis\" have done ruined 'em there by leaving gratuity on the bar! ;) I've not yet eaten there, but I look forward washing down a burger with an ale at the Union sometime soon!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CPR7gdg-UXNDwTVv0HQcgA"
  },
  "xCjWFZndVGlVXhT2bNu76g": {
    "date": "9/5/2013",
    "text": "A very nice bar in charming Greenwich.  A good selection of beers including several from the local brew Meantime.  I loved the outdoor patio in the back.  They have a menu of small bites if you are hungry.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vj8bIwLtKj9Y2ld8h5WYQg"
  },
  "_WEkoQjEs88ZYjuOboQJww": {
    "date": "10/26/2013",
    "text": "I LOVE Meantime's Yakima Red Beer? Lager? I don't know what it EXACTLY is, for fear of causing offence to any aficianados out there but it's the first time I've actually finished a beer and liked it. Food wasn't to my liking, it's pub grub but I decided to try the polenta and it was a bad idea. It was so carby! LOL. I thought it would be light, like cous cous. I was wrong. and the starter was some sort of grey egg on toast. I don't even know! But I know my friends enjoyed their meat dishes!Will be back again to try their own brand beers! I loved it!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "Z0se_jbzh4FDRdBjUwVi-A": {
    "date": "9/18/2013",
    "text": "Clean and open pub.  They have a sunroof in the dining area and it really makes a difference in brightening up the typically dark and pubby atmosphere of... well, a pub.They have tons of options for beer too, even providing a free sample of available drafts if you can't make up your mind.  Brunch here was affordable, their soup of the day was a 5 quid scrumptious fish stew that came with bread and aioli, and their 6 quid scrambled eggs had a nice twist with the capers and anchovies on top of grilled bread.This is going to be my Saturday morning tradition!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "qOHLejakMG9pOGxvTgSwuw": {
    "date": "5/26/2018",
    "text": "We stopped in at the end of a long day and this place was perfect. Everyone was very friendly and the food was absolutely delicious.  It had a very local vibe too, so it was fun for us Yankees to people watch while we scarfed our pies and sausage.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N0-v397Ntye4xRU4u0CuSQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N0-v397Ntye4xRU4u0CuSQ/o.jpg"
      }
    ],
    "user_id": "sHTbosf6eg6XCvRJXQIpgw"
  },
  "_MflDwqb2DGQBnQpQc9l3A": {
    "date": "11/10/2018",
    "text": "Classic pub vibe with friendly staff and broad selection of beer.   Sunday does a nice roast plate option for food as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Inr961XWpFLo9koGBHAoow"
  },
  "dX5YKuC1TRB-wz1elTNrzg": {
    "date": "4/12/2017",
    "text": "We didn't really venture too far from London proper during our recent trip to the city, but decided it was worth the time to visit The Greenwich Union for a Sunday roast. The establishment has a nice mixture of cozy and airy, which was perfect for a lazy(ish) Sunday. I hate to use this word, but I'll use it anyway (because I can't think of a better descriptor): the service here is \"super\" friendly, and very knowledgeable, particularly regarding the ales on tap. The barkeep gave us a few sample pours without waiting for us to ask, which we greatly appreciated. Because of that, we were more than happy with the pints we ordered. Moving on to the food: the roasts were delicious, in particular the pork loin, which was moist and flavorful. I enjoyed my roast beef as well. The Yorkshire pudding was wonderful and I might have been just as happy eating that alone for my meal, to be honest. The pub is in walking distance of the touristy areas of Greenwich, so it's easy enough to put some good food in your belly and continue on to your sightseeing, afterward.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "43yoMFEPvFADlr_oPRVdgQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. The Union Sunday Roasts.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/43yoMFEPvFADlr_oPRVdgQ/o.jpg"
      }
    ],
    "user_id": "mx842y7Jy06Fqt692YtsCg"
  },
  "s9O-JkVkvz0Mwch8tOpjBg": {
    "date": "9/18/2017",
    "text": "After an exhausting day of sightseeing, hubs and I wearily wandered in from the downpour outside. We were starving. It must be a cultural difference but the service was atrocious. It took forever to be provided a menu, served a beer and to have our meal order taken. The food took 45 minutes to come out Hubs ordered the bangers and mash. I got the cheeseburger. His food was delicious. My burger was over cooked and the cheese tasted funny.  It then took forever to get the check. Perhaps another cultural difference. Hubs went to ask for it from the bar. Being as tired as I was, jet lagged and cranky, I'm going to provide 3 stars. Luckily this meal occurred in June. I may not have been so charitable then.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQFtveqbz9M6s3z7TAXKag"
  },
  "7DrSKzAK5voKOAvZeOrRPA": {
    "date": "1/15/2017",
    "text": "Great pub, we had spent the day in Greenwich at the observatory and were doing the Meantime brewery tour that evening. We came here for some drinks and lunch, we had their fish and chips and ribs. The fish and chips were great, and the ribs were good too, fall off the bone. However I wasn't keen on the BBQ sauce they served on the side, it didn't compliment the ribs. Nonetheless the beer was great, mainly meantime and a few guest beers on draft, plus various bottles. The service was great and we had a lovely time at the pub.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TVajIYkSCQKEY0Il1b9tPQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Fish and chips and their ribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TVajIYkSCQKEY0Il1b9tPQ/o.jpg"
      }
    ],
    "user_id": "AB8vb-aFdiUouDuNmfyjGQ"
  },
  "aEu5P5g5zDEhNlhGwp6a6w": {
    "date": "8/13/2017",
    "text": "This place is worth hunting out. Looks small from the outside, but sizeable inside and in the beer garden. Own brewed beers are great. Food is very good also: scotch egg for starters, very good. Tasty chicken burger for mains. Friendly service. We will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EL-Av_Bxqa6cXuGfNnFW7A",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EL-Av_Bxqa6cXuGfNnFW7A/o.jpg"
      },
      {
        "img_id": "sojJ2nicrkDWverVj_yDfg",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sojJ2nicrkDWverVj_yDfg/o.jpg"
      },
      {
        "img_id": "xh4taswZIiWYjRaf8KYBlg",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xh4taswZIiWYjRaf8KYBlg/o.jpg"
      }
    ],
    "user_id": "KRKZbNwMyoQoF6giUv1UTA"
  },
  "evLI41UpnlDdiTZ1WBRYVw": {
    "date": "6/19/2016",
    "text": "Was warned London only has potatoes to offer, this pub place proved that was so wrong. Food was surprisingly good! Felt like still in New York. Lol.   My favorite is the wings n sea bass in prawn butter!One of \"nice things\" is London does not accept tips:)))). The reason subway is 3times more expensive than in New York???",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FgCTJF6NnA7nyCSBofJ1Dw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Garlic bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FgCTJF6NnA7nyCSBofJ1Dw/o.jpg"
      },
      {
        "img_id": "P7qtPziy4IfstCdmLXdoZA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Brownie ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P7qtPziy4IfstCdmLXdoZA/o.jpg"
      },
      {
        "img_id": "Nuz7myRPirX3lWut3NOH-Q",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Mango dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Nuz7myRPirX3lWut3NOH-Q/o.jpg"
      }
    ],
    "user_id": "FZrZFZWVKe7FhZsrHQ_adg"
  },
  "-7hXM_75fPbtPRYD_RyKAw": {
    "date": "7/1/2017",
    "text": "Proper pub with local craft beer and good food. The staff were really friendly and it has a nice quiet garden out the back. A bit out of the way from the main town centre but worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_ZlQ8NIXImBgmYrU52m7yg",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_ZlQ8NIXImBgmYrU52m7yg/o.jpg"
      }
    ],
    "user_id": "CaPOuBJTxuNsneGVVP9FvA"
  },
  "biLd5r3_K63XyNKSrFUXrQ": {
    "date": "4/25/2016",
    "text": "Okay so for weeks now me and my drinking buddy have wanted to try some of the local Greenwich meantime beers... The Greenwich Union more than delivered ! We were thinking of taking a tour of the brewery itself but we had heard a lot of hype about the Union and quite fancied a lunch out too which we couldn't really imagining brewery having much to offer in that department.As soon as we walked through the door we were greeted by a very friendly and knowledgeable bartender who , before even asking, poured a small taster of a beer he had a preference for. After a short conversation with the staff I went on to order a paddle offering four 1/3 pints for £6.50 which consisted of four meantime beers of my choice (Yakima red, Pilsner lager, raspberry wheat beer and London stout). Moving on to food ... We always judge a venue on the quality of their garlic bread and cheese so we both ordered garlic bread and hummus asking them to top off the bread with cheese. As far as the garlic bread and cheese goes it's a solid 9/10 just could have used more cheese but bar that it was perfect. For the mains I ordered a rack of ribs which was accompanied by fries and house slaw as are most rib dishes, but these ribs were sublime they were so soft and actually had a large amount of meat on the bone compared to most other places. My buddy ordered an aged Angus burger which I can only comment on the presentation and comments from my friend which were both 10/10.As for the venue it was perfect small hip location with great lighting and the wall decorations were fascinating. They consisted of vintage fosters and a huge selection of rare branded glasses, kind of like a small beer museum. The smoking area out back was covered , heated , decorated great and surprisingly clean for a smoking area. One final comment goes to the huge selection of craft beers available and even the bottle shop where you can pick up some rarities to take back with you.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "5vkxBaXjekRWlNW11s8ibA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5vkxBaXjekRWlNW11s8ibA/o.jpg"
      },
      {
        "img_id": "GWQVt2OsAm0tIXxPcB4b1w",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GWQVt2OsAm0tIXxPcB4b1w/o.jpg"
      },
      {
        "img_id": "nJilPiY3g136VJj0ngrajQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Great range of meantime beers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nJilPiY3g136VJj0ngrajQ/o.jpg"
      }
    ],
    "user_id": "xxMP-bM6lb66veCXt8obcA"
  },
  "DQoZmRZffC7sBYmFy4rtlA": {
    "date": "4/9/2017",
    "text": "Great Sheppard pie, fish and chips and also amazing local beer selection. Try the cherry one. Everything was fresh and tasty. Also try the beets and hot smoked makarel salad.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RaLN9pM7FMc0WoQzN54ljQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Front door.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RaLN9pM7FMc0WoQzN54ljQ/o.jpg"
      }
    ],
    "user_id": "AEYJQZd-45fOc1S0luDCqw"
  },
  "V2gcQ1gdQ79VdnFEq30eCw": {
    "date": "4/2/2017",
    "text": "This little pub is wonderful...The food is delicious (I got the ribs and my mom got the fish and chips). The beer selection is very varied to satisfy any pallet. I had a black stout IPA which was life changing. The service here is also something to note, the servers were knowledgeable on the beer selections and even offered a free tasting flight to help make a selection so you weren't stuck with a beer you don't like. I'd go back for sure!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3ZFG9xt67KTWBAuaNM-2Pw",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3ZFG9xt67KTWBAuaNM-2Pw/o.jpg"
      },
      {
        "img_id": "sgIGIEwqX0WSM1Rzk9jTPA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sgIGIEwqX0WSM1Rzk9jTPA/o.jpg"
      }
    ],
    "user_id": "Knes7R1MdiGbW_ElSHfFzA"
  },
  "PJ0RlaaT6K_Vz7v5df-jVA": {
    "date": "10/26/2015",
    "text": "I might be making it over to Greenwich more often! We reserved a table for 6 for 1pm a few days in advance, which was a good idea since all the tables were full for Sunday lunch.I ordered ribs that came with coleslaw and chips. The chips were crispy and fresh. The coleslaw wasn't the best, but I've come to expect that in the uk. It was too wet. The ribs were covered in a great spice rub and slathered with BBQ sauce. All in all a pretty fantastic meal. I wasn't drinking but my friends ordered different Meantime Ales and enjoyed them. There were also a bunch of kids there, so friendly for all.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "4MzTss4Hn2sVvwb317xxpw"
  },
  "DwxlZjCppUdFOnK2n_Gtgw": {
    "date": "1/30/2018",
    "text": "One if our favorite stops while in London for a week.  We have wonderful food, great service and a nice atmosphere.  Also a great beer and cider selection.  The fish and chips were just yummy.  We tried Meantime Beer and it was quite good.  The waiter gave us directions to the local brewery.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMH8X5FGRTuTJZ42XpZ3Q"
  },
  "AQFQ5d1k31gE_rPxbj5CEQ": {
    "date": "11/14/2015",
    "text": "My only previous experience of Greenwich was the area around the Cutty Sark and the touristy bits, but the Greenwich Union is worth checking out. In spite of the previous sentence, the pub was deceptively close to Greenwich park by way of a few side roads. I came here for Sunday lunch with 5 others at the end of October. We booked a table which was a good idea as the place was full.The Greenwich Union is one of the Meantime places which is fine by me as I really like their brews. The food was good, I was a little disappointed that the beef roast dinner was unavailable because of an operations management mistake but the fish and chips was a more than adequate replacement. Julia D had ribs which I hoped she wouldn't finish as they were great, I would recommend that off the menu. All in all very good.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "unV05KrzxsUQoyUF50Q_TQ"
  },
  "I6-zRIDDyzGDzANt4dmVrQ": {
    "date": "9/27/2015",
    "text": "Finally got to sample some of my favorite brewer's wares in person!  Great beer, good food and good ambience (can't beat being at a pub in England).  Tried the Meantime Fools Gold seasonal ale and it was really good, the porter was even better (and is different from their bottled porter).Had the veggie burger and chips (thick French fries) and both were really good. Many of the veggie burgers here are Halloumi made from cheese and a vegetable, in this case carrots.  Our server was kind enough to offer ketchup for the chips once she saw that I wasn't using the vinegar and salt on the table!We sat in the back outside area which is quieter than inside the pub and has heat lamps (which were needed).Well worth a visit if you are in Greenwich and are a fan of craft beers.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pRI7lLPA1N-Jpbei3reB9g"
  },
  "uG3I-KL3ugnGK9hmvFBraQ": {
    "date": "4/28/2016",
    "text": "A friend and I who are fans of  Meantime Brewery thought we'd check the place out and for lunch and quick pint and we wasn't disappointed. The staff were friendly and had good knowledge of the beers they served. I went for a Cali PA which was really crisp and not too heavy while my friend went for a paddle. Onto the food: We started off with garlic bread(asked for extra cheese) and hummus. The hummus was really cold but tasted reasonable with a strong flavour of coriander. The garlic bread itself was moreish as it should be.Garlic bread with cheese o'meter - 7/10I had a burger which tasted like the best of pub burgers, with nice and crispy homemade chips and a nice garlic aioli. My friend had the ribs which came straight off the bone.The place has a nice vibe from the beer-oriented decor and friendly staff, and it's just the right size too. Definitely worth popping into if your around the area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8G45aN-jJnyItdK0hwuHSA",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Cheesy garlic bread with hummus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8G45aN-jJnyItdK0hwuHSA/o.jpg"
      },
      {
        "img_id": "Blj_JvCZ6BFTEZqwe2BUBQ",
        "caption": "Photo of The Greenwich Union - London, United Kingdom. Meantime Brewery",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Blj_JvCZ6BFTEZqwe2BUBQ/o.jpg"
      }
    ],
    "user_id": "ne0YdhpplsfmWR85GhQgtg"
  },
  "1toINSXX2LMzQcuGLyePaw": {
    "date": "5/29/2016",
    "text": "First time in Greenwich and had to make a choice for a quick weekend lunch. Given there are a lot of pubs right near the tube station and observatory, we almost ended up in one of the familiar chains. Fortunately, a quick Google search revealed the Greenwich Union as an independent pub serving local beer. That sounded good, so we went for it. It's a little bit of a hike away from the central (touristy) core and, oddly enough, right next to another big chain pub. Walk past that, in you're a fairly unremarkable interior but there's a nice solarium in the back and garden behind that.Once seated, service was quick and friendly. The menu looked pretty standard - fish and chips, burgers, pies, etc. - but the beer list was astounding! It's a huge list that's heavily tilted toward mid-range and higher end Belgian ales, plus a strong selection of craft American ale. There's also the local beer from Meantime, which we didn't end up trying. Settling on a Founders IPA, a sour ale from Lervig (Norway), a burger, and some fish and chips, we settled in for our meal.Food was served quickly and staff were again attentive. The beer was excellent, unsurprisingly. But the food really stood out. My wife said it was the best fish and chips she'd had in London (and we've tried a lot of fish and chips). The burger was moist, tender, and had a strong but not at all overpowering pepper flavor. One of the best burgers I've ever had to be honest. The chips looked a little questionable at first - maybe they were going to be too greasy, we said - but turned out to be quite the opposite.Highly, highly recommend. And we will be back, even though we don't live anywhere near Greenwich.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Vha9gWWNosTcGigr294JQQ"
  },
  "XDwr6xocPHDFf32lWWOLfw": {
    "date": "3/20/2017",
    "text": "Greenwich Union is a great pub with great beer and good food. If you find yourself in the area, try and visit. The beer selection is very good. The menu is not what you'd expect from a typical London pub. The staff is friendly and service is great. I've been a few times and would highly recommend stopping in for a pint or two plus a good meal. I would have rated it a 5 star - but the ribs deserve a better BBQ sauce.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-rKNnY_Uf73d3g5EFagBow"
  },
  "-gkeicY34u8pqTov67vRKQ": {
    "date": "9/25/2017",
    "text": "Had a great lunch there. Great beer selection- they even give you samples if you aren't sure what you want. Falafel sandwich was excellent. Service really prompt and helpful.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GFyGkAqpuI95RxrTSeIbdg"
  },
  "-vieGfbz7469wcQMjjyxDg": {
    "date": "2/12/2017",
    "text": "One of the best bar restaurants we went to during our stay in London.  Fish and chips top notch, prices very reasonable which goes for food and drinks.   Staff very friendly",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "xFEuc4PY-S3bwaK8V7FiHA"
  }
}