{
  "lT_gKafLKhrJJREZGH5nEQ": {
    "date": "2/21/2009",
    "text": "Probably my favourite seafood restaurant that's not actually by the sea. A real treat for me. The oysters are particularly great. As has been any dish I've ordered. Although a dover sole I had there four years ago remains my favourite. I think the whole place is spot on, they really know what they are doing and don't mess around with it. A warning though, I still give this pace four stars because I really get a kick out of the average customer age being somewhere north of seventy.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "On5v7CzMQ7C_K_awH8alRQ"
  },
  "odgUo3r1bjU8Mppxi9DxKw": {
    "date": "9/7/2014",
    "text": "We had a quick meal here between events and it was superb.  I had lobster pasta and my partner had clams - both were exquisite dishes, the service was terrific, the wines well chosen by our waiter and the ambiance a delight.  Only wish we were here long enough to try the fish pie - that takes half hour preparation so need plenty of time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5xQhum5dDfaAAvEN2V_OA"
  },
  "miDKYVCb53l0O92flEobsg": {
    "date": "7/30/2009",
    "text": "I can only really comment on the bar - and I can only just do that, bearing in mind the two bottles of delicious rosé consumed whilst there! Bentley's is located on Swallow Street the small connecting street between Piccadilly and Regent Street, that seems to be ever more populated by decent bars and restaurants. A smart entrance leads straight onto the small but sophisticated bar. Attentive service at the bar ensured that the wine was consumed way too quickly. And on a hottish summers evening the choice of rosés was tempting. The smattering of upmarket minor celebs also helped the overall atmosphere. Nice place to meet before dinner - and going by all the other reviews a pretty good place to have dinner as well!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHOlP582pn4SLnDH0yd-sA"
  },
  "uZFsv9uFGjh5YIyCv4S2Lw": {
    "date": "7/7/2011",
    "text": "Nice Oyster bar!  Good ceviche selection...great for raw and seafood lovers.  Had sushi grade sea water trout special prepared rare...omg",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FWauvWzj0ddXnrcRoZX_5Q"
  },
  "pn3tkN0kHLUjbd6a29qWsw": {
    "date": "3/10/2012",
    "text": "I had a good dining experience there. Good food, attentive waiters/ waitress, spacious dining area including an outdoor area. I ordered a Loire Valley white wine which went with my scallops pretty well. The scallops were delicious. And of course I tried some oysters as starters which were also good. The downside is awkwardly small reception area and for some reason they charge a $2/ person cover charge. Note that i in a country where tipping is not a norm, the restaurant includes a 12.5% service charge in the bill.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AB4m42iovjpwdh4pIu8wSw"
  },
  "lbAtMD7c7LgBni3Uvp55Uw": {
    "date": "2/20/2012",
    "text": "At the time of this writing I have been there 6 times and each time it was both a gastronomical pleasure and wonderful experience.  The staff are top notch with making sure your time spent is both efficient and well tended to.  The food is outstanding in terms of variety and quality.  Private dining is also available if you are in the need for business entertaining or a meeting of friends.  The drinking spirits are top shelf which only add to the experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVrHV3r6dc-2pUzsE18qRg"
  },
  "I9UME7P4QWwPwz-XiBUlJA": {
    "date": "1/31/2011",
    "text": "I was disapponted with Bentleys. The food was mediocre at best but the service was horrible. For the money there are many better places to go in London. Scott's is supposed to be excellent but even my concierge at Claridge's couldn't get me a table there for a week so went to Bentleys instead. Should have stayed in the hotel and ordered room service.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fFEleOCpVuaZuT_ynegmow"
  },
  "5FdoC3xEY75-JxeBRVPsRw": {
    "date": "12/8/2008",
    "text": "Being a fish connoisseur there is a special place in Mayfair for special occasions. Bentley's Oyster Bar and Grill is tucked away in Swallow Street, not far off from Piccadilly. Reservations are highly recommended. There are two parts, the restaurant upstairs, which I find rather boring and stiff as well as the Oyster Bar & Grill downstairs. Entering the restaurant, there is a entrée, where wine and drinks are served, it is a good place to wait in case some guests are late. Being ushered to our tables at the bar, we were unfortunate enough that we ladies were placed near the door. After speaking to the maitre di, he generously allowed us to sit at a more comfortable spot.Their menu is excellent, but what I was looking forward all day long are the oysters. We ordered 2 different species. One of them seamed to be fresher then the other.When I am invited to a restaurant such as this, I never go for the most expensive menu, even though it always happens to be my favourite. However, my dish partner order the lobster. All night long I was gazing over at his plate. The waiters where very attentive and their multilingual entertainment amused our whole table. The dinner was excellent and the portions were generous. Even though the prices are rather the top end of London, this place is not over stylish, but is true in its origin - seafood! ...And they have a high quality in service and atmosphere. This place is good for business lunches or a dinner in a smaller circle of dear friends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzLvy4qnTE1diJok-GS4vQ"
  },
  "VkQwvQJhYHlS18egxkr9CA": {
    "date": "5/28/2009",
    "text": "My husband and I went here for Valentine's Day once. It's got a lovely old interior that makes you feel as if you're stepping back in time. The food that we had was delicious - I remember I had the fish soup and a fancy fish pie. My only complaint is that the staff were rushing us to finish our meal and a bottle of wine, which really did dampen what should have been an exceptionally enjoyable evening.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L0XB70D9J6UceY2HFq6zcQ"
  },
  "nuRcIPJnFYIoklZw_xhs-Q": {
    "date": "7/18/2008",
    "text": "This place is great. Fantastically old school, but in a modern and stylish way. We sat at the Oyster bar, watching the guys crack open and turn over the oysters one after the other for hours - very therapeutic. After a glass of pink bubbly, I tucked into a fish pie, with spinach on the side. And oh my god, this fish pie. It is quite possibly the best fish pie I've ever tasted. It arrived and I thought I would only be able to finish half of it, but the sauce was so delicate and the fish so perfectly cooked, I finished the lot! Amazing crunchy mash on the top, not too heavy or salty, the fish melts in your mouth, it was incredible. This is the kind of place to go for a special occasion or if you just love seafood and happen to be shopping in the area  it is after all right near Piccadilly and Regents Street, so a great place to stop off and recharge! And if you're looking for a fish pie to beat all fish pies, this is your place! Good tip  eating at the bar is a lot cheaper than in the restaurant which is pricey. The fish pie was around £10 cheaper at the bar because it didn't have lobster in it, which the restaurant one does Oh and lovely old school powder room toilets for the ladies (I'm not sure about the men's!)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5CBmyQz7VaYtG0BtAv5uow": {
    "date": "6/30/2011",
    "text": "The service was terrific.  The maitre d' was incredibly helpful (and makes the tomato horseradish relish for the oysters himself......a must) if you are there for the oysters, ask him what he would suggest .  Fish and chips (believe it or not) were a step above the typical street side fare.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C18sAW9jO54YTn8VsVp95g"
  },
  "o7QwsVtbdKjektiKVS4E9g": {
    "date": "8/12/2008",
    "text": "What can I say, I love sea food and have eaten it all over the world. this was not just great fish it was a dining experience. Service, ambience presentation quality all top class.Wine list to drool over. Ok Richard Corrigan@s restaurants were never going to be cheap but I truly believe for a special treat this is expensive but value for money.try it and see!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V2F29vm3s2S2ihDaV1k5hQ"
  },
  "paOTfSW61wpLjrbfOVA5VA": {
    "date": "8/28/2009",
    "text": "My girlfriend recommended we try this place which is owned by celebrity chef Richard Corrigan, she knows how much I love oysters.  We sat at the oyster bar, and had an oyster rockefeller for a starter to share between the two of us.  It was okay, I've made better myself. She ordered a lobster, which was pretty small like the size of a large shrimp and bland tasting.  I had a mix of a dozen oysters, which were fresh, but the selection of oysters were okay, nothing to rave about.  The oysters at Bentley's can't compare to the Kumamoto, Blue Point, Chesapeake, and Irish Rock oysters.  I generally like to enjoy eating my oysters a few different ways, either as is, with a little bit of fresh black pepper and lemon, or some horse radish and cocktail sauce.  When I asked for the cocktail sauce, the bartender behind the oyster bar made it from scratch, but it turned out to be something like a ketchup/mayo mix, which tasted horrible.  The bartender then chastised me for putting the \"homemade\" cocktail sauce on a couple of my oysters, telling me the only way to eat it is plain, without sauce or vinegar.  I do eat my oysters plain, but just smiled and nodded my head.  Luckily he insisted I try it his way and gave me a few extra for me and my girlfriend to try, which I happily obliged.The interior was nice, menu seemed well put together, but for the hefty price the place just didn't blow me away.  And the pretentiousness of the place almost made me give it 2 stars, the only save was the few extra oysters thrown in.  Decent meal, but way too expensive for what it's worth.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TrKAQ5qOYENBwiLR_PO7Uw"
  },
  "2olmoFi0W5thm7VBx1HhvA": {
    "date": "1/5/2008",
    "text": "Owned by Richard Corrigan, who owns the fantastic Lindsay House, this place is a bit of a let down. I was expecting far more from the food and definitely from the service. The chorizo stuffed squid starter was a winner. The fish pie main dish, dull. Now I guess the fish pie might seem a boring choice, but it takes a god chef to make a good fish pie, it ain't as simple as it appears. Anyway, it was a bit weak. I've had much better.  The selction of fresh fish, cooked in any manner you choose would probably be a better choice in a venue like this, and did get the thumbs up from my dining companions. Now for dessert. Yes, I chose the traditional option again, decided to play it safe and went for my favourite: the chocolate pudding. Now I know my chocolate puddings and this wasn't at all good. It was dry, not a hint of that steamed moistness you expect from a pudding, and didn't taste particularly chocolately. The accompanying custard was on the cold side of warm. Either give it me cold or make sure it's piping, not 'left on the side for 10 minutes' temperature', not when I'm payingf £100 plus a-head. I did taste a friend's apple tart, which was delightful, maybe I just chose the wrong thing. Two particularly sour points about the evening: one of my dining companions was given the wrong dessert. The waitress merely shrugged and said if she wanted her original choice she would have to wait another 20 minutes. There was no apology. Another friend was a vegetarian. And I know it was a fish restaurant but he didn't pick the venue, seriously, how hard can it be to have somethign other than goats' cheese (which he is allergic to) on your menu. We even phoned ahead to let them know and they said not to worry at all. Upon telling this to the waiter when placing our order, he was far from impressed and merely moved on to the next person ordering without uttering a word. Anyway, a vegetarian dish did arrive. Guess what it was? A bowl of pasta with cheese, brilliant. And it was overcooked. Has a privaye room that sits about 14 too. The lady at the cloakroom is a little gem. The best thing about this place.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mUaw8tU9KJicTeW1TMvHzg": {
    "date": "1/17/2013",
    "text": "Went with a friend and not only did we both get horrible food poisoning but we were both charged twice. Unacceptable. Horrible. Don't go here.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c41Fz5akQUD23lehpxcwxA"
  },
  "3-scI4NkHhn7p40_mGVzIQ": {
    "date": "10/28/2010",
    "text": "The food was delicious but the side dishes (chips, salad and a \"selection of seasonal vegetables\" didn't arrive to the table until much later when we were finished with the main course... Very bad organisation on the chef's side. The service was poor too. We waited for ages for the drinks. A friend ordered a drink without ice and he got one WITH ice in it... I was asked if I realised that a lobster bisque was a soup... Quite insulting really as if i didn't know what a bisque was or couldn't read that it was under \"soups\" category in the menu. I wiill never go there again or recommend it to anyone. Such a shame as my \"bisque\" (what's that? ;)) was gorgeous and crème brulée was massive and very appetising! If it wasn't for that, I'd give it one star...",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-tvUbLmdiPsTu9aWc49n4w": {
    "date": "4/30/2009",
    "text": "Now okay, I know it's a seafood restaurant but I decided to try ot out from a slightly leftfield angle and opt out of all the seafood dishes and just pile up on chicken (what can i say, I didn't pick it). To be honest though I actually quite enjoyed my chicken liver pate on posh toast, it was delicious. For mains I had roast chicken with mashed potato, mushrooms and soinach and it too was very nice but didn't really rock my world which is what I was expecting from the interior of the restaurant. By far and away though my highlight of the meal was the wine, i'm not really a fan of white but the glass I had here may lead me to re-think things a little.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ftDgFya0LXjY3iVpOP3T_g": {
    "date": "6/10/2007",
    "text": "Good business class fish restaurant; well located near Piccadilly. Quiet enough for business conversation, good menu, excellent wine list. Entrees were good quality but could have been better. Casual bistro and bar downstairs and a more formal restaurant upstairs",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WAHh3CsIPd9eWetz4X0SFQ": {
    "date": "3/14/2010",
    "text": "Mothers days... my wife and I and my sister took my mother, taking advantage of the 'special Mothers day deal'. I live in the West End but up till now never managed to try Bentleys. Thought it was an opportune time to try it. Well, they are obviously only interested in the tourist trade and take a short sighted view of their business. They made good money from us so I guess they were satisfied. The food was shockingly bad. Clearly none of us would ever go again. But as I said, they did well to entice us in and make a quick buck. Shame really. Why not use the Mothers day deal to catch some long term customers, not fleece them? Strange really. I have a friend that has raved about this place. I don't think after such a bad experience I would ever go back. Will stick to fish works if I want great fish. Mind you, the service was good.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "h8Fj1wF8KkcgFMJ2k41pMg": {
    "date": "11/16/2008",
    "text": "good stuff. decent service, night relaxed atmosphere and a small but varied menu. dishes were either well or very well executed. my fish soup was tasty, and the fish pie filling and flavoursome. it isn't cheap - expect to pay a tenner for an average glass of wine, but the overall bill is reasonable given the execution and lively menu. this is really a 4.5 star place for me right now",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_m9kmAO1w6XLdOf0EN2ow"
  },
  "9yt752G0oBjnrYvK5s3D6Q": {
    "date": "7/14/2015",
    "text": "Unfortunately our worst experience by far on this trip.  Our waiter brook didn't seem to understand much English and we had to ask for things at least twice.  My wife started with a very bad martini which we didn't bother sending back with what followed (Sommlier was actually very nice and knowledgeable).  Had to ask for silverware for seafood platter, parm for pasta, more oil for bread, water, etc...tough to eat without silverware.  The food was just ok but with our poor service everything tastes worse.  It's too bad as several of the other wait staff seemed very nice and gregarious.  Lobster ravioli inedible (manager did come over and comp) and my favorite was when the bill came...\"cover charge\" of £2 per person (haven't seen that one yet in U.S. or Europe).",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IIv0ZfPZlTwT9fOih7R3A"
  },
  "Wt3aXdwk_4krY5nGyxC0fw": {
    "date": "12/27/2015",
    "text": "We went back again today and had the best fish and chips in history. Because of this, we're upgrading it to five stars.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQk_TnOI6JI5ogqT5FpviQ"
  },
  "B6mHvvPO2RC2c9K4rov7Xg": {
    "date": "5/8/2013",
    "text": "I was seriously disappointed by Bentleys.  I really did think it would be much more impressive. Now don't get me wrong. Some of the food was excellent, my steak was so good I actually picked it up with my hands at one point and ate it like a lion. The veg we ordered was lovely, and the bread they provide at the start was excellent! But the service was intense, strange and a bit rude . The waiter also lied by saying he'd give me a free coffee at the end...but didn't.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "brUQwIxDSntv2rPO4s03zw": {
    "date": "7/12/2014",
    "text": "We were looking for our last dinner in London when we stumbled across this restaurant.  It was an easy walk from our hotel.We were able to get a table without a reservation, and ordered the Salmon Teriyaki and Sirloin for dinner, along with a side order of spinach.  Dinner came hot and tasted great.  The wait staff was very attentive - our wine glasses had a hard time getting below half full until we finished the bottle.For dessert, we split a chocloate mousse, which really hit the spot.They had a singer / musician playing the piano for background music, which was a nice touch.  It was clean, well kept, and served good food.  For us, it was a good ending to a good trip.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoO7bwAbGDjPAKURfJe36w"
  },
  "pu5vAzrdST7yeu43ZtvWYw": {
    "date": "6/28/2013",
    "text": "popped in here late (10pm) for dinner. We had a great plate of oysters to share - delicious - and some champagne. Then a starter each, a glass of wine and some dessert. It's NOT cheap, but the food is very good and the wines were really enjoyable. Service was friendly without being invasive. Overall we had a very pleasant evening. Complaints ? Just that we could hear every word of the conversation of the table nearby.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6lxnYSNtjdNkbbZ5i2kEw"
  },
  "UziEFvcD_6QpG4Nb_zyizQ": {
    "date": "7/13/2015",
    "text": "Very good seafood, and the upstairs restaurant provides a quiet and stylish environment that fits both a data and a more casual dinner with your friends. The staff is very professional, and even though you really do not notice them, they are always there when you need them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic2LNlH6tGfeicEMS-JMmQ"
  },
  "VvhZdaZINQH7xk9n60Q1Yw": {
    "date": "8/13/2011",
    "text": "They have a pleasant outside dining space, but was full so we ate inside which was a little cramped. The menu is well complimented by much more exciting specials. Pescetarians beware: many of the fish specials include meat. Ordered the trout special and the fish pie. The fish pie looked hearty and good comfort food. The trout was cooked perfectly, inventively prepared and was clearly of good quality. The service varied from cold and curt to friendly and informative. Prices are not atypical for the West End (which means they are expensive). Although I really enjoyed the food, I'm not sure I would come here again as the variable service just let the place down. Update: How could I forget, they also clearly make their own bread. With mixed results.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJ6Oj-Fyv_J9qjCdxNxbHw"
  },
  "byCsbZPdy00LORtmZuK7OQ": {
    "date": "7/16/2011",
    "text": "A review would be so much easier if I could give the service a two and the food a three on a scale of five!  Bentleys is a delightful, convenient location in the heart of London where the promise of something great falls short on service first and food second.  What a shame!  Two friends and I enjoyed a dinner at the Oyster Bar recently.  Starting with oysters, well served chilled and fresh, we moved onto main meals consisting of Trout, Fish and Chips and the Fish pie.  My companions absolutely loved the pie and fish and chips.  I thought the fish was a little expensive to come out in a questionably raw style that resembled tuna preparation rather than trout.  The fish was fresh, but, I warn you, a diner needs to buy an appetizer, fish and side to feed even a modest appetite for a good meal.  Drinks are well prepared.  Options are quite good.  Service started off terrific and then was confused between wait staff and bar tender to the point of complete waste of our time.  At the end of the day I am sorry to say a simple management decision will affect my future visits to this restaurant.  My companion and I ordered two ports which never arrived and, of course, ended up on the final bill.  After pointing out this error to the manager, we received a casual \"oops\" and an immediate fix.  For a group that spent a good deal of money, it was a lost opportunity to make some amends for poor service and misplaced orders. Go for a drink.  Enjoy an oyster. Leave somewhere else for a special dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OuE58nEqKFDVZTI-NK68NA"
  },
  "5bF5i9Afwz6yKX9LMiysGw": {
    "date": "3/15/2011",
    "text": "We went here for dinner last night. I'd never heard of it before but it seems to be quite famous. Its famous as a fish restaurant, so in some ways it was unfortunate we had at least two fussy eaters in our group, and out of six diners four had rib eye steaks. The steaks did go down well though, and the starters for the fussy eaters (smoked salmon for one and goats cheese salad for the other, if I remember correctly) also ended up as clean plates. We had a couple of pre-starters with our drinks, which is always a nice touch. One involved beetroot and I think goats cheese, the other was a number of small fried cheese things to share. I had squid stuffed with chorizo and feta to start and halibut with sauce nero and vegetables for main. Both were very nice. Then tarte tatin with calvados ice cream for dessert. Again, nice. But all of it was just that, very nice, not blow my head amazing, which is why it only gets four stars.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NJbNz2fvCyB-5Liq7xCmfg": {
    "date": "6/14/2013",
    "text": "Thus is a really nice restaurant with excellent food. Probably the best place I have been to in London. Very fresh menu with a extensive collection of seafood",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsckjIjmwbaMyuc9SR1pjQ"
  },
  "xJv6PaFKL2PtcFNGqhzcqg": {
    "date": "6/11/2015",
    "text": "This is a restaurant to be avoided at all costs. I was there on a Thursday night and was quickly escorted to a very small table in a crowded bar area. A single waiter was available to serve approximately 20 people and as you would imagine, the service was atrocious. My wife had a lobster bisque that was as thin as dishwater! Although the night was early, the Seabass was no longer available and the salmon that I had was quite boring. The prices were exorbitant and this was the first restaurant that I had experienced in London that had a charge of 3 pounds per person for a seat. When I challenge this charge, the manager did waive it. Fortunately, this was my last night in London and this was by far and away the only bad meal that I experienced. As such, my memories of this trip will generally be very positive but I will advise people to never patronize this tourist trap.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ugZt0Zv_owxhgfNxN9_YOA"
  },
  "8WVDbKXcxrzWkGC7mFQDLg": {
    "date": "11/14/2014",
    "text": "Came here because we had reservations at the Ice Bar and needed something close.  Great atmosphere, felt kind of like being back in time in the 1930's. The manager, Ben Hedley was very friendly to talk with and made some suggestions on what to order.  I wish I knew the bartenders name because he made us some great martinis and was a true mixologist.  For dinner I had a pasta dish with truffles that was great.  The bread they put on the table is a really nice variety.  You can sit outside also, they have heat lamps all over.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMYgbDsehip3EBPW7F171g"
  },
  "ndSSpZk3Tcm0HDjeJwNiZw": {
    "date": "2/14/2013",
    "text": "I get to Bentley's 8-10 times a year. The oysters are the freshest tasting I know. the dressed crab is sensational. Usually sit at the counter where the staff are great. Upstairs is more formal; I prefer the buzz of downstairs. Can't go wrong.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0ZjHzQypjAUcA36EVm7KA"
  },
  "71MjGgim_KbT0QCZiiu3-w": {
    "date": "3/23/2012",
    "text": "Got taken to this shuzzed-up (don't know how you spell that word) old stalwart recently and it is delivering in spades.set on a lovely street just off the beaten track, downstairs is the brasserie, upstairs for something a bit more posh.We went upstairs. The dining room is quite old fashioned, but intentionally, done beautifully. Lots of lovely fishy decorations (this is a fish place) and silver everywhere. Service to match.Wonderful bread on the table. Some of the sourest sourdough I have tasted. All our starters were great. crab that was still nipping. Oysters alive and well as they slid down the gullet. Mains served with skill. My Turbot (to share) expertly dissected in front of us. Accompanying hollandaise beautifully viscose. Lots of lovely wine to choose from and some decent puddings which didn't seem like an afterthought.This place feels special and a real treat. You pay for it but nothing more than you'd expect for a top quality London afternoon out. A great British treat in the heart of London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJTAqZ8QgmvWuo8kuiIMJw"
  },
  "wtZlU7WfUPimfAhWQu3tpw": {
    "date": "10/24/2012",
    "text": "Stumbled onto this great place after we were told by Le Meridian London Hotel staff that there was no place to eat outside in London.  Of course they were wrong about that but this was a great find.  The seafood food was excellent and the service was exceptionally friendly and caring.   Definitely some the best food and atmosphere in this part of London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a5JxBMqYbo6bM-aZJvm8Aw"
  },
  "z3AfjJ1ghzxqDsy4EeCQfQ": {
    "date": "4/9/2010",
    "text": "Happily came across this restaurant one afternoon while I was roaming around London with friends. The hostess was able to give us a reservation at a time we wanted. We came back a few hours later.The food was delicious! I shared some oysters with a friend and they were plump and juicy. I then had a lobster linguine dish which was lovely. I left full and happy. Definitely recommend this place if you'd like a little bit of a nicer dinner, and have a love of seafood.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cjfjw1ZKy9Fa1vf1MIRCaQ"
  },
  "PpPAMc7L6xo-UvqF98m9tQ": {
    "date": "8/1/2012",
    "text": "Excellent quality oysters and seafood. Far better than Wright Brothers in Soho. However the service wasn't very good. I was seated at the bar counter and the waiters were cold although they were very friendly to a family seated next to us....why the preference?? I don't understand!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1otPwOt4f79iEYdqm7p0Q"
  },
  "aqKVjp61DlFCj0OGOxbTZQ": {
    "date": "10/9/2011",
    "text": "Great restaurant, bar and outdoor seating area....fantastic menu - great seafood.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Uo7h77EPa5hLlE_8KA7Qw"
  },
  "qFeJTsm9DayqY85B1HgyOg": {
    "date": "4/22/2013",
    "text": "I am in love with the with the grilled prawns and salad they make. The food looks very fancy and posh. It is in the heart of London. But the staff are not very polite.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JGW2js6hleK6A3ZOYWugTg"
  },
  "o3gOnMviYQNA-uRWELaLGQ": {
    "date": "4/20/2009",
    "text": "My boyfriend has wanted to go to Bentley's forever so when I got the chance to grab a promotional two course meal here the other night, I jumped at the chance. Said boyfriend is so into seafood that I wouldn't be surprised if a blood test showed him to be more fish than man and with Bentley's being renowned for this delicious speciality we both had very high hopes. Unfortunately, not all of these were fulfilled. I have to say, the staff were lovely, a bit stiff for my liking but very well informed and friendly. After grabbing a quick cocktail downstairs (a couple of boozy, boozy Caprihina's) we were swept into the more formal dining room. Full of suits with a very stiff atmosphere, it was not the easiest place to relax in but fortunately we had a nice corner table away from the room a bit. Being on a set menu, our choices were limited to just two options. For starters a prawn cocktail and salmon mouse and for mains pea and bacon broth with cod and a fish stew. Whilst both the prawn cocktail and cod were delicious, the others fairly forgettable. In fact, the fish stew was more of a curry, very dry and although tasty, padded out with chickpeas. I would definitely give Bentley's another go as I don't think our menu was a very fair representation of the place. However, next time I go, I think I'll try and get a good group together to give that dining room an injection of personality.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "RExKcr_9AxUKjfWNO0Q3zA": {
    "date": "7/26/2015",
    "text": "We were greeted by a gentleman with a French accent which I believe is the manger of restaurant. He highly recommended the fish cake which he said the chef only made around 10 of those each night.  We ordered a bottle of Paul Dethune Grand Cru Brut Champagne, matched very well with the seafood.Recommended dishes: fish cake, fish pie （inside there are scallops, lobster meat, and fish) , dover sole meunière.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kq0RHztUEkHdS9axDT6Pbg",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kq0RHztUEkHdS9axDT6Pbg/o.jpg"
      },
      {
        "img_id": "wnqYICPHZ0KO3w38KM6VGg",
        "caption": "Photo of Bentley's - London, United Kingdom. dover sole meuniere",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wnqYICPHZ0KO3w38KM6VGg/o.jpg"
      },
      {
        "img_id": "N7NQfDFYcTdVH03QwWU8Pw",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N7NQfDFYcTdVH03QwWU8Pw/o.jpg"
      }
    ],
    "user_id": "IOno7gA0w4CB8rq5ODzgLQ"
  },
  "hTjvTGwQqwFBWnTks50S1g": {
    "date": "5/28/2017",
    "text": "I had one of the best meals I've eaten in a while here. The beef tartar was absolutely mouth watering with a hint of horseradish and the qual egg on top. The Monkfish and Lobster special was splendid as was the greens and mashed potatoes. The only thing I was not a fan of was the 2£ \"cover charge\" for the bread they bring out which I didn't ask for nor eat. I found this to be a bit cheeky for a restaurant of this price and caliber.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xD98L4ycp1Jr6idwRMcN2A"
  },
  "pYTxdu4ogl0nSeyYz05hOA": {
    "date": "11/27/2013",
    "text": "Excellent seafood. A great selection of fresh and perfectly shucked oysters, both wild and what they call \"rock\" which I presume means farmed. The Dover sole meunière was excellent. Good selection of fish friendly wines, by the glass, carafe, and bottle. Service started off slow but then picked up nicely. The outside terrace is covered and heated, making it a nice place for a cigar.Recent visit was also excellent.  They now charge a two pound cover.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5dPlnH2XWHHUkb-pW9-zPw",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5dPlnH2XWHHUkb-pW9-zPw/o.jpg"
      }
    ],
    "user_id": "6xh4RHBZS7MG6rgubRLSlw"
  },
  "iFmopYQOQMQpWF1PFGA_FQ": {
    "date": "4/30/2017",
    "text": "Great seafood and oyster selection. Surprisingly fresh and relatively inexpensive. Very nice bar and solicitous staff. I enjoyed the atmosphere and interaction with staff and fellow bar patrons. I recommend especially if your dining alone.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKuJCDsA2e-EwW1U8XV7MA"
  },
  "JmvAQ0Q0PfVTTn7SnxvFwg": {
    "date": "1/11/2017",
    "text": "If you're looking for fish in London, this is the place to go. The oysters were perfect, fresh and briny. I had the seafood pie, not much to look at with the mashed potatoes on top, but divine beneath with many kinds of fish in a slightly bacony sauce. My guest had a sea bass special, about which he said I never understood why one would order this fish, but now I do. Dessert special was a rhubarb crumble. They have a good range of white wine by the glass.Service was pleasant and efficient.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uecZhhWBEQ-qe7YeEtntLg"
  },
  "ErRrbrbimpGPRSDatDvPPw": {
    "date": "10/1/2016",
    "text": "I stumble upon Bentley's on a recent trip to London and I'm so glad I did!  The staff was very accommodating considering we did not have a reservation.  We stared off with the oysters which were absolutely delicious.   Fresh, grainy with a beautiful taste of the ocean sand.  Lobster spaghetti was cooked to perfection, well balance of tomatoes and spinach in a light broth sauce.  Spaghetti cooked al dente.  Last, but not least was the fruit tart and    Pudding to top off a great meal.  An absolutely must try when in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0ENOrIuhdXoSjZ0v9E6lVw",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0ENOrIuhdXoSjZ0v9E6lVw/o.jpg"
      },
      {
        "img_id": "RbVu-tpo2jwy_OhGGVydXg",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RbVu-tpo2jwy_OhGGVydXg/o.jpg"
      },
      {
        "img_id": "XFNaTfIXjdc2d3ipYQv_kA",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XFNaTfIXjdc2d3ipYQv_kA/o.jpg"
      }
    ],
    "user_id": "EmCLjACaWmRc-a1BXV1AUA"
  },
  "GnrvhO0iABLi9ObvJzBBCA": {
    "date": "11/8/2015",
    "text": "Went for dinner, on a date. The service is immediate and impeccable. Gave us a great recommendation for wine. Opened and poured it perfectly. White-glove service. The food was outstanding. The duck salad came with a to-die-for pate. Everything was good, up to and including the cheese plate for dessert. This is a beautiful, old-school restaurant that I wouldn't miss. Probs wouldn't come for lunch, and don't sit outside.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUxzQpB4LNkHKajEHveMOA"
  },
  "MxZ0X4Q1vVV2WuUwP2o1sg": {
    "date": "6/17/2016",
    "text": "Bentley's seemed like a very polished, upscale restaurant, but just speaking to the food, it was not as great as expected. We ordered some raw fish plates to start, which were very good! We got the tuna and the scallop ceviche, and they were both fresh and flavorful. For our entrees we got the baked seafood dish and the fish and chips. The fish in the fish and chips was not bad; it was tender and the batter was pretty good. On the other hand, the potato mash it came with was a bit sour and didn't seem to go particularly well with the rest of the dish. The chips were okay but nothing special. As for the baked seafood dish, I was pretty underwhelmed. The presentation was quite nice, but it was really just a few pieces of seafood with tomato paste on top, and that's what it tasted like. For the price I definitely expected a bit more, but the raw fish I would definitely recommend!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHLAT1uLpXO1typ6_7qqxw"
  },
  "ORZVyafZQoccP_zrPJm6Lg": {
    "date": "6/29/2014",
    "text": "I've been coming here since 2008 and its one of he best seafood places in London. The staff treat you right and the food is always on point.I can't believe it has 3 1/2 stars - that's just not rightGet your arse here its great!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IgWGDZJiN8NqqdTO5XGR4w",
        "caption": "Photo of Bentley's - London, United Kingdom. Tuna soy and mirin",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IgWGDZJiN8NqqdTO5XGR4w/o.jpg"
      },
      {
        "img_id": "8e9migPHlLUpzLb7Cl-fvQ",
        "caption": "Photo of Bentley's - London, United Kingdom. Oyster Bar area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8e9migPHlLUpzLb7Cl-fvQ/o.jpg"
      },
      {
        "img_id": "Qc1whQLWak7lGblTgUvnJA",
        "caption": "Photo of Bentley's - London, United Kingdom. Home smoked roof too salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qc1whQLWak7lGblTgUvnJA/o.jpg"
      }
    ],
    "user_id": "LgAUc4F2SqJS-Y3FcbZR4g"
  },
  "9_srsB7Bi5QnjLKSlefmdQ": {
    "date": "4/29/2015",
    "text": "We ate there 2 nights while on our trip to London.  The first night was upstairs and the service and food were great.  I had the scallops with pork belly and sea bass carpaccio, I wouldn't change a thing.  The second night we ate downstairs, different menu.  I was even more impressed.  I had the asparagus appetizer and the white truffle macaroni.  Amazing!!On a different note, the downstairs seating rather close together.  Which is not bad, but our neighbors to my right were so sad that we ended up listening to the rest of their conversation through dinner laughing uncontrollably.  Which naturally they picked up on and then the awkward silence set in.  This guy was a real gem.  He sang, purred(yes, I mean purred) and told her of all of the many women in France that he just got done sleeping with.  It was so bad when they finally left, the woman on the other side of them had some comments of her own to make about them.  Learned something new indeed that night.The food was fantastic I highly recommend this place, but be careful you might get a show as well.  I mean they do offer a theatre menu, just didn't realize I was ordering from it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSVXQY7qC32tIWGaXREkng"
  },
  "iBMEI2v7tiU20HbWQFUe5A": {
    "date": "11/4/2011",
    "text": "Hard to understand whats a starter but it all looks beautiful...what little you get.Specials? Sure but out of a great sounding squid (still on the board) so went with the grilled octopus- more artsy fartsy than substance but beautifully done with the almond aioli, JulieD chose the wild duck with foie gras salad- fantastic paring with the mandryn orange. Loved it. For mains I'm sticking with specials and a monk fish and prawn patato curry and she opted for the smoked haddock. Wine paring was a Loire chenin blanc for the lady and a cote de rhone for me.Patio was warm under heat and this side side street has walking traffic fun without too much noise from the high street. AS a single, I've sat at the bar for dinner and prefer it to inside tables that can get cramped. The evening was enjoyable and fit for foodies but the service never made the mark. For these prices, I expect top notch. And please remove or remark specials that are no longer available. I get all excited for not.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cs764jKE3aR5kBQqG874rQ",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cs764jKE3aR5kBQqG874rQ/o.jpg"
      },
      {
        "img_id": "MV5nZG6tcmPn-sd_FNl8rQ",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MV5nZG6tcmPn-sd_FNl8rQ/o.jpg"
      },
      {
        "img_id": "csvtTPkdensT_KCDn2eRcg",
        "caption": "Photo of Bentley's - London, United Kingdom. Monkfish special curry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/csvtTPkdensT_KCDn2eRcg/o.jpg"
      }
    ],
    "user_id": "-B-QEUESGWHPE_889WJaeg"
  },
  "S9CWlW6lrBXJrLiHWssSXQ": {
    "date": "5/2/2017",
    "text": "We were looking for a seafood place close to our hotel. The rating were good so we ventured over.  We were able to sit outside under the heat lamps, which was nice.  Service was great; very attentive.  We started with the scallop ceviche which was thinly sliced scallops in a lime, cilantro dressing-very tasty.  I had the sirloin- very flavorful; my husband had the grilled sea bass- also tasty.  We had the steamed spinach which was a nice compliment.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgWCV-vO541MaIoWxPE_Gg"
  },
  "GkQUx_vw4YE6qIgE_hG3eA": {
    "date": "4/12/2015",
    "text": "Holy mackerel! The mackerel nettle soup is to die for! As are the spring salad and Dover oysters. Lovely little patio dining experience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iS__AWkEXBQrcoDSs888eQ",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iS__AWkEXBQrcoDSs888eQ/o.jpg"
      },
      {
        "img_id": "5YTFpTiBz-BxXNA26rMDPw",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5YTFpTiBz-BxXNA26rMDPw/o.jpg"
      },
      {
        "img_id": "qqHlEhsOyGRq0q-N-sFrXA",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qqHlEhsOyGRq0q-N-sFrXA/o.jpg"
      }
    ],
    "user_id": "b1Y35DPYKgVLf3XnlXMBaA"
  },
  "zdT_amSgmLt-pK6CGnkdxw": {
    "date": "7/2/2015",
    "text": "Top notch seafood and a beautiful wine selection. I'm not sure the high prices match the food, though. The sommelier was helpful, but the rest of the service was poor (although friendly). We arrived for a pre-theater dinner at 5:30, and they were out of ahi. They did not tell us until 10 minutes after ordering. While they did offer free dessert for the mistake, it was offered at 6:58 when we had told them we needed to leave at 7:00. Cigar smoking was allowed on the garden patio, was obnoxious, and disrupted our meal greatly.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTJhR3NdvpCB2ZAx_qRiqQ"
  },
  "1Q19CpBHJj61m4lHA-q8BQ": {
    "date": "8/4/2015",
    "text": "Excellent food, nice decor and well maintained.  Service excellent.  Sea bass carpaccio was fantastic.    One of the best dinners I had during my visit to London. Highly recommend if you want to have seafood in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uhJq4AJ9Z9IfGQHfQVf_vg"
  },
  "Nq-QU-ZSALynZawSrKpGpA": {
    "date": "2/17/2014",
    "text": "Great seafood but the venue is a bit tired....  and also waitresses are not well trained - it feels like you are at a tourist trap.It is such a shame as the food is really great - especially cooked fish is the best in London but really the setting, waitresses, quality of crockery... they all just make it rather under-whelming.I go for the sole fish meuniere... one of the best in town... go for food and not for the setting...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "uDiO3Kc0I_apXCKuXnEi9g": {
    "date": "2/14/2016",
    "text": "Fantastic food. The only let down was the booking procedure. This place demeans itself by having things like 'special valentines menu'. Too good for that",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgSb04KRi2dynuiwXRvz7Q"
  },
  "3HpQglIxgY57Y0SfCPqyMA": {
    "date": "3/9/2013",
    "text": "My word has it been a good food week! I have been a very spoiled woman and I have the belly to prove it! Tomorrow I hear I'm due another foodgasm. Can I handle it??? I'm sure you'll hear about it. Oh yes, I'm writing a review. Owned my by a Michelin star chef, not a Michelin star restaurant. Although my meal was better here than the one Michelin star restaurant I have visited. Started ceps tart. Amazing, buttery, flaky, earthy, huge for a starter. Ate every last morsel. His starter was supposedly nice as well but it contained meat so sadly I had to pass. Sea bass, perfectly cooked served over some apple relish salady sort of something. Deep fried chili courgettes, yummmmm. Buttered spinach, lovely. Malbec, 2 bottles. Found out there was a Cinnabon near by, after my 3+ year mission for a cinnabon, decided to have that for dessert. That was disappointing so then we headed to Haagen Dazs. How the hell are my clothes still fitting??We ate upstairs and this portion of the restaurant is very fancy or like they say here, posh. Apparently there is an oyster bar and grill downstairs that is supposed to be less stuffy. It's in the center of London and it is expensive. This little Puerto Rican woman is beyond BLESSED to get so spoiled! I'd take off a half star if I could because service left a lot to be desired. Server could not recall the specials, kept pulling out her notes and still flubbing. Not ok for this type of place. However the food was very very good- Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tjzGqQm4ClUY2ANaKtZ1pQ"
  },
  "5kbCXpJELynuoyHSyqC5VQ": {
    "date": "8/2/2014",
    "text": "This place is legend. Filipo behind the bar will make you feel so welcome and man can he shuck oysters !Have oysters, fish and great wine. I love this place.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jIRXCJn_5_ceJk-AFAwRZQ"
  },
  "us2wEaAXjH06iqQAKXAMuQ": {
    "date": "5/12/2015",
    "text": "Ordered a fish pie as recommended by a waiter and it was very delicious. Quiet restaurant within very crowded Piccadilly Circus area.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FwoPLUp_50RaICicoEx3gg"
  },
  "HcYwNg84Fzo6oQEcpO0kQQ": {
    "date": "10/15/2018",
    "text": "We loved this area and decided to come back on our way to our hotel from Harrods.  Came to this charming looking eatery with a very romantic patio.  We sat inside since it was still a bit cold outside for us although they have very nice patio heating over head lamps.Our servers were very attentive, friendly and very knowledgeable of their menu and entrees du jour ... one from Poland and the other from Romania...            The lobster spaghetti was quite delightful, the monkfish lobster with light green curry savory was fantastic!  We truly enjoyed the ambience on our last nigh on London Town.I have been to London before we have dined in London every day and night the past three days and nights. So when our dinner bill arrived with a service seating charge of $4.00 that we've never seen before-it raised a ???....    our wonderful waiter sincerely explained how this charge has affected their gratuity and it's a seating charge per person for the chair.. he did have it removed!When the restaurant was brought up by our cab driver on our way back to our hotel  (who seemed to have been a Londoner all his life) and he asked about the food and if the service fee was high.. we told him about the seating charge and the 12.5% service charge added.. he was in shock with the seating charge.We recommend this eatery for their unique dishes and wonderful service!BUT WATCH OUT FOR THE SHADY SEATING HIDDEN CHARGES ON YOUR BILL!!  Hence the loss of 1 Star!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "ztmKSobJwj4rAVudmD4eQg"
  },
  "P1JuhkRKohsm_ZOeqfCa8Q": {
    "date": "5/27/2018",
    "text": "For a restaurant with a 2018 Michelin sticker in the window and Michelin prices, we were disappointed.  The wine was the only saving grace.We arrived without a reservation tonight and was seated in the patio as the dining room was full.  The food was 4 stars.  The service was 1 - 2 stars.My wife and I ordered the Turbot with Meuniere sauce.  Very good.  We had a Cotes de Beaunes Chardonnay which was pricey but superb.  Our girls split an order of Fish and Chips.  Having sampled Fish and Chips all over London by this point, theirs was by far the crispiest and tastiest.The Turbot was excellent.  Tender meat cooked perfectly with a nice light butter Meuniere sauce.Service was exceedingly slow all around, to the point where we had to get up to get our bottle of wine from the ice bucket and serve ourselves, which was something clearly the waitstaff were originally handling.  After sitting more than 10 minutes with an empty glass and not a waiter in sight, time to self-pour.  We also waited nearly 25 minutes before the waiter came to take our drink order.The Waiter also had forgotten the ketchup for our daughter's fish and chips after we had requested it.  The service quality was summed up when I asked the waiter to explain both the Fish Pie and the Royal Fish Pie on the menu while ordering.  His only words, \"They both have lobster\".  That was it.  Really?  I was tempted to give this place two stars but the food was good and the wine was fantastic. We were charged a cover charge and a 10% gratuity.  For that much, service better be stellar.  We will not be returning.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOF1xP1LITK5cjwnHUjJVw"
  },
  "YRI4W1scbRQsAwzlUoTPFw": {
    "date": "11/15/2018",
    "text": "Solid 5, all day long, every visit, best seafood in London, well priced, plenty of choice, great service, fantastic wine list, seating indoors or outdoors or upstairs if you want to be even more classy",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMDdDNree77oZgsMu1MmmQ"
  },
  "Nz88xKLtz0eulbvXCNA5gQ": {
    "date": "11/18/2017",
    "text": "Four stars for food and service, Two stars for Confusing layout.They need to do a better job of clarifying this is two restaurants. Upstairs is more high end dining and downstairs is more casual (smart business). Each offers a different menu and you may not order off of the other.Our hotel called ahead for us and made a reservation. We we seated upstairs in their very nice dining room.  We were hoping to order fish and chips, but noticed the menu did not offer that. We asked our server who explained that is only available downstairs. Unfortunately, they did not have room at that time to accommodate us downstairs so we opted to stay. The bread basket with butter is amazing. For our meals we had the Royal fish pie and Dover sole - both outstanding.The next day we returned for lunch - downstairs - and had the Fish and Chips. AMAZING. I would return just for this dish. Both dining experiences were good, but I would only return downstairs.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uo3kC8iVcYyKS9rpC6PSBA",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uo3kC8iVcYyKS9rpC6PSBA/o.jpg"
      },
      {
        "img_id": "wDCnRenoA8cPVLLiw4VqEA",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wDCnRenoA8cPVLLiw4VqEA/o.jpg"
      }
    ],
    "user_id": "F_xqjAyMw1OPexsJDUF5fg"
  },
  "sZoFpEl72CjyWaT6DnpOfA": {
    "date": "10/13/2018",
    "text": "Amazing fresh seafood! I had the tuna tartare and the special which was a fish and muscle curry. It was simply amazing and one of my most favorite meals!!  Great wine paired with it all. I highly reccomend and great ambience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OuqdFwPa7OCV4lgIfX-v3A"
  },
  "qST4NbdCJk9Tt6Y28kVVMg": {
    "date": "7/20/2018",
    "text": "Fish stew had a great variety. Tried 3 kids of oysters, excellent too. Fish was good too. I would definitely be back on next trip.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ul7QalgF6mAhVJWXMDr6pw",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ul7QalgF6mAhVJWXMDr6pw/o.jpg"
      },
      {
        "img_id": "fnPE1vd6Ldt7PE2VBv6y2Q",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fnPE1vd6Ldt7PE2VBv6y2Q/o.jpg"
      },
      {
        "img_id": "lK8Y2VxTlNlzVc48rDmixQ",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lK8Y2VxTlNlzVc48rDmixQ/o.jpg"
      }
    ],
    "user_id": "jBW54p9jF9Y2dhPqWmIbig"
  },
  "mf619xo4oqogB-gBCUA6QA": {
    "date": "9/13/2018",
    "text": "Everything was terrific. Sea bass, octopus, tuna and sides were delicious. Enjoyed eating outside under heat lamps and listening to live piano player.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q12T3zqbdTEQtX-I_OUvxg"
  },
  "DMjgVgH46duab-vqWRvbsw": {
    "date": "9/9/2018",
    "text": "Spot on, would highly recommend this restaurant!  The food and service were outstanding!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXSyXRyrdjvdDWhHvNDsRQ"
  },
  "pfNs1n4-mhTKL5I8bz4FHw": {
    "date": "6/14/2018",
    "text": "We had a very pleasant lunch outdoors; it seemed less stuffy than the dining room upstairs. The menu consists of traditional, one dare say boring, dishes; however they are well executed. An exception to the \"boring\" qualifier applies to the oyster appetisers: in addition to the raw ones, they also serve innovative cooked oyster dishes (like Catalan, Vietnamese); I tried the Catalan trio - very tasty. The fish stew would make any bouillabaisse lover happy, even without cheese and rouille. The seaweed butter is fragrantly delicious, and compensated for the mediocre bread. Helpful service, including the good practice of giving out the price of more expensive spécialités du jour. The one Michelin star is well deserved.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rTwgAE8maPYz9KkpT6ujWA",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rTwgAE8maPYz9KkpT6ujWA/o.jpg"
      },
      {
        "img_id": "NApjxHK_cQPPNUst8dYG3Q",
        "caption": "Photo of Bentley's - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NApjxHK_cQPPNUst8dYG3Q/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  },
  "F1U7lHO1_gnmmR1vMgiLIA": {
    "date": "7/11/2017",
    "text": "Bentley's is a bit of a secret tip right in the heart of the West End. I'm yet to go for a full meal, this review is based on the cosy Sunday sessions held in the downstairs bar area.  Free entry, beautiful music and complimentary snacks served between sets - what's not to love, this is very classy entertainment.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Y-IF-K3Ra4hwsykbpU5m0w",
        "caption": "Photo of Bentley's - London, United Kingdom. Sunday Sessions - great music around a table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Y-IF-K3Ra4hwsykbpU5m0w/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "oTuwSl5pykwMby-1h4DyvA": {
    "date": "7/14/2018",
    "text": "Amazing food. We got the jersey oysters, mussels and fish/chips. Service is as good as the food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWuVZY2Gw-nLihFrY5kDSA"
  },
  "zhcHAXRQLJZy-aExqTIZbA": {
    "date": "7/30/2017",
    "text": "Bentley's has been in business for over 100 years and is a very classy restaurant for a special occasion. There are two indoor bars for seating which we preferred to the covered outdoor setting on a windy evening. A pianist played in what would be a very small hallway connecting the bars, the only strange thing about the restaurant. The menu is extensively seafood, although I did see a couple order steaks, the stars of the show come from the ocean. I enjoyed a selection of three types of fresh oysters to start, although they have many dressed options available. The quality and presentation was perfect. Next up came the lobster bisque and fried calamari. Both were executed flawlessly. A great seasoning on the squid and dipping sauce was well made. The lobster bisque didn't actually contain any chunks of lobster, which would have really sealed the deal, however, you could still taste the flavour and a hint of spice in the creamy broth.For mains we enjoyed the fish pie and linguine vongole. The fish pie was a large portion and very hearty. There were three types of fish and it was your classic dish. The linguine was lacking some depth. All the ingredients were there - fresh pasta, clams, tomatoes and herbs. I could have used cheese, white wine and chillies. Service was excellent, save for the wrong beer served, which was corrected as soon as we brought it to their attention. Overall, an excellent place for any seafood lover.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gs1HAp_sImvHS_yCfySaKQ"
  },
  "WktWzFIHDs6lNz37TnRmtg": {
    "date": "5/29/2017",
    "text": "Food and service were exceptional. Enjoyed 1/2 dozen oysters and the fish and chips. The taste of the fish and batter were perfect. I A bit pricey but I will recommend. F",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-JIjgcv8efGFnjEtXA9MNQ",
        "caption": "Photo of Bentley's - London, United Kingdom. Oysters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-JIjgcv8efGFnjEtXA9MNQ/o.jpg"
      }
    ],
    "user_id": "uf_swxnbcwYv8ijXzByzXw"
  },
  "ZeWL74FyoW7JjdOlB9hAOA": {
    "date": "5/19/2016",
    "text": "This is a cozy restaurant with a very good service and a pretty outdoor patio. The food was also very good and high quality. Location is also good, few steps away from Piccadilly Circus.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aBY-6DXFjl9gSVXwqLPHkA",
        "caption": "Photo of Bentley's - London, United Kingdom. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aBY-6DXFjl9gSVXwqLPHkA/o.jpg"
      },
      {
        "img_id": "EK1GJjxtzikAV7lcA9n2aQ",
        "caption": "Photo of Bentley's - London, United Kingdom. Outside. Pretty patio.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EK1GJjxtzikAV7lcA9n2aQ/o.jpg"
      },
      {
        "img_id": "0VPC7B43vw6T-mdDrz8YfA",
        "caption": "Photo of Bentley's - London, United Kingdom. Dining",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0VPC7B43vw6T-mdDrz8YfA/o.jpg"
      }
    ],
    "user_id": "IgS1X9vrZRTdtEvXWwC4Dw"
  },
  "ECMHeU3pY3H4_6ExpdqXpg": {
    "date": "10/12/2017",
    "text": "Ok, so my expectations were very high with this restaurant. Everyone recommended the place. We went and maybe we just expected more than was reasonable. The restaurant is pretty, the outside area is very nice but it was a little chilly so we elected to stay inside. The staff was very nice, but they did not tell us about the specials for the night and I think we would have ordered differently if they had. The bread and butter were great. I had the grilled octopus and Joe had the grilled prawns as appetizers. Both were very fresh and the ginger and lime on the prawns were very tasty. I had the 1/2 lobster grilled and Joe had the steak (yes, I know that ordering steak in a famous seafood restaurant is just asking for problems).  The lobster was good, not great, but good. Not a lot of it for the money but it was average. The steak was even more expensive and it was literally two medallion pieces that were tough and very small for the price. The meal was ok, certainly not what we expected and no way would we bother returning. Just too many other places to try",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoGKik9NuJQS5u_ha1Y3_A"
  },
  "1-td8kjtgAMPh3mizjMuRQ": {
    "date": "6/18/2018",
    "text": "I sat at my table outside for 1/2 hour with no service. It's like the waiters were intentionally ignoring me. I've visited Europe many times and never had an experience like this. Was simply weird. Finally I just got up and left.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CycA28LbZOXrBghT_Z6PCw"
  },
  "9ap1brMxHDpWV3MkqwT4yg": {
    "date": "11/22/2017",
    "text": "This is a terrific seafood restaurant in a cool neighborhood. I sat at the bar and had a selection of freshly shucked local oysters and cold gin martinis. I also had the lemon sole and side of spinach which were both cooked perfectly. Convenient location two blocks from the Piccadilly tube station. Highly recommended!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rQ-1w3XcC4iPLZhdFpEoQ"
  },
  "rEQEqXKqbvLkTBdSSj_kIg": {
    "date": "2/23/2016",
    "text": "Bentleys is a place made for 5 star reviews! Simple as that really. Owner/operated by the esteemed Richard Corrigan this place is a celebration of all that it is to be an oyster bar.A friends birthday was a great excuse to pop in here a week weeks ago on a Saturday, to start we made out was in and were ushered to the beautiful bar area. A well made g&t in hand we took in the surroundings and discussed the lovely venue.Escorted to our table I took on ordering responsibilities, I have known Rach for more than 7 years now and with it being her birthday she was happy to trust me. Bottle of picpul, easy choice.Next, well this was an easy one really, the seashore sharing platter. Oysters, mussels, clams, whelks and crevettes served with a selection of bread and condiments. The star dressing had to be the tomato which i'm still not sure exactly what they do to, horseradish and red wine vinegar turn it into a taste sensation. With the oyster it was just remarkable. The platter was an amazing as you would expect and fair value at £44.Desert....well for this we resorted to the specials menu. A crème brulet for 2, dressed with raspberries, white chocolate and flowers. Visually stunning. The snap on the sugar, the visible vanilla...it was just phenomenal. Great lunch, great service.....perfect afternoon.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "6WyOhdGmlZ-B5kJVzOjCFg",
        "caption": "Photo of Bentley's - London, United Kingdom. Creme brulet for 2.....or just for me!!! YUM",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6WyOhdGmlZ-B5kJVzOjCFg/o.jpg"
      },
      {
        "img_id": "e-ztf0EnVc5-k1QbsSbnFA",
        "caption": "Photo of Bentley's - London, United Kingdom. Seashore seafood platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e-ztf0EnVc5-k1QbsSbnFA/o.jpg"
      }
    ],
    "user_id": "rl4hqDnywPJDCK4wfbXMzg"
  },
  "8dONRyjEZPZMsF65vMVVMA": {
    "date": "10/16/2015",
    "text": "Had a lunch here today as I missed another reservation I had made because a meeting ran late... It's located off a bustling street in Piccadilly and has a more casual downstairs and a more formal upstairs. I didn't realize this until the end of my meal, but if you have the choice, I'd opt for downstairs. I started out with incredible gougères filled with oozing cheese. Their bread basket was filled with some wonderful homemade breads and nicely whet my appetite. Lobster bisque was fishy and watery. Such a disappointment and hard to swallow.Tomato soup on the other hand was comforting, smooth and savory with a lobster garnish. For the main, I ordered the brill and it was very fresh with a decent side of mashed potatoes. The atmosphere was formal and borderline stuffy.",
    "rating": 3.0,
    "rated": {
      "useful": 25,
      "funny": 18,
      "cool": 22
    },
    "photos": [],
    "user_id": "peuxbSQwXed-81cSqL7Ykw"
  },
  "YdoNRzoJkRnIFcD2bC2t5w": {
    "date": "9/29/2014",
    "text": "This is a favorite stop of ours. Excellent fresh seafood and shellfish in a great environment. I particularly like the prepared crab appetizer.Cozy, pub-like interior. On a nice day it's great to dine in the covered area out front.The wine selection is particularly well-suited to fish and especially the shellfish selections. You can't go wrong with the Albarino.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nzk0-jUa6GvSqzErNzgk6w",
        "caption": "Photo of Bentley's - London, United Kingdom. Prepared crab",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nzk0-jUa6GvSqzErNzgk6w/o.jpg"
      },
      {
        "img_id": "2K4B7sC1L1unL2oqJF-T-w",
        "caption": "Photo of Bentley's - London, United Kingdom. Exterior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2K4B7sC1L1unL2oqJF-T-w/o.jpg"
      }
    ],
    "user_id": "uEQ3nCdOBNOeJ0ow4Ds1vA"
  }
}