{
  "C3pnIJbCeF8bXe8nPA4SBg": {
    "date": "4/24/2009",
    "text": "Tas offers an exciting cuisine of Turkish origin. On their website they describe their restaurants as offering a fine dining experience and the highest quality food. This is a tall order to live up to and to be honest I would not expect \"the highest quality food\" from a restaurant that makes such a claim, but I figured I would be fair and go in with an unbiased opinion and give Tas the opportunity to prove itself.My first impressions of the restaurant as I entered were positive. The restaurant was open and airy, providing a pleasant view of the London streets just outside. The mood was inviting and pleasant without seaming cheap or informal and the music and lighting complemented the atmosphere.Because we had booked for the large group we ordered off a prepared menu and already had a portion of the meal predetermined. The starters came out in a relatively timely manner and I must say that the array of food was impressive. The starters included Borek, Humus, Manca, Tabule, Sebzeli Kofte, Zeytin Yagli Bakla, and Zeytin Yagli Patlican and were all excellent. In particular the Manca (a sort of tart yogurt and spinach mix) offered a refreshing yet zingy flavor and was exceptional with the traditional bread served with the starters. As a whole the starters offered an exciting mix of traditional flavors and I would suggest any of them.For my main course I ordered calamari. I was hoping for an exciting dish filled with interesting flavors that would compliment the squid. Unfortunately my meal was not all that I had hoped it to be. The flavors were bland and it was served only with an equally bland walnut paste. This is not to say that the calamari wasn't good, it just wasn't as exciting as I had hoped and I wish that I had chosen a more exotic dish. My friends Karides Guvech was exceptional and offered a full gamut of flavors, I would recommend this dish to anybody looking for a good meal.To complement the meal our teacher graciously agreed to pay for a couple bottles of wine and we enjoyed both of the house wines, a Turkish white and red wine. The house red would best be described as blunt and had an almost shockingly strong bitterness to it. However, this lessened as the wine breathed and by the end of our meal was quite fruity and flavorful. The white had a mild flavor and was quite smooth. Neither would be my first choice if I went again.On the whole I would describe the restaurant as good and I would most certainly eat here again. However, I would highly suggest to indulge in the more exotic sounding dishes as these will provide a more exciting meal. The service was a bit over zealous although our large group size could well have been a factor. I will return to this restaurant on different terms in the future and I suggest that you do the same if you are looking for a meal that will be sure to excite.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HrOsmVIrtLQ11igk6cJsQ"
  },
  "IDHU4h8J-zDqG3a_-lueHw": {
    "date": "6/16/2011",
    "text": "I had dinner here with a large group of people and was impressed. The meal started with a selection of great appetizers- spanakopita, baba ghanoush, hummus, and some other things I can't quite remember. Though my calamari was a little dry, it was still tasty. And the baklava and was great for dessert. I didn't have anything alcoholic to drink, but the fruit juices and cappuccino were both really good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fS-ekojyqQr_Ff-ll8s-_w"
  },
  "7p2GWwhYlAoU5iXTwYHSJw": {
    "date": "9/23/2009",
    "text": "Not having been able to find \"sit down\" Turkish food closer than this, we made the trek along the M4/A4 from Windsor to Bloomsbury. TomTom did its best to misdirect me, but we finally made it to the general area and thanks to my mum's disabled badge we found easy parking. Note to other drivers: most parking around there is resident's. It was after 6pm, so no congestion charge and free parking. Does it get better?On to the restaurant... Perhaps they've redecorated since the first review, but the place looks nice: bright, airy and busy. What recession? The place was packed. They have additional seating downstairs (which are where the toilets are). Note for the mobility impaired, there seems to be stairs only access to the downstairs, though perhaps there's a lift hidden away for staff use (or a dumb waiter?)The menu is extensive and has a great assortment of items. We had three appetizers: dolmas (lovely and fresh), cacik (good but not great) and something with broad beans. Turkish bread with a yoghurt dip and marinated olives come with the table. The dip was actually tastier than my cacik appetizer, so next time I'll just keep asking for more dip. The olives should come in a steady stream throughout the meal - they are delicious with chili flakes to liven them up. You get four at a time and we went through two servings. I was gutted when a momentary distraction made me miss out on the last one before it disappeared when the plates were cleared!We had four entrees and split them: a mixed grill (kofte, lamb and chicken kebabs), shish taouk (chicken kebab) and an okra-based vegetarian dish. All entress are served with couscous, which I find odd because it is a North African rather than a Turkish staple as far as I am aware. But who cares because it is delicious and rich: flavourful, oily and just plain yummy. They could bring me more of that all night but they don't need to because the little bowl fills me right up.My kebabs were delicious and then there's the hot sauce. Now, I consider myself to be a hot sauce expert and no hot sauce scares me *chest thump*. This stuff is amazing. It is freshly made and is both spicy and refreshing at the same time. Full of green chili goodness.On to desert. I stayed traditional and had the baklava. My mum had   Kaymakli Kestane - a chestnut based dish - and my mum's friend had Kayisi Tatlisi, which are dried apricots with nuts and cream on top. The last two were good (and the presentation was superb). My baklava was the best I've ever had (and as with the hot sauce, I haven't met a baklava I didn't enjoy). I got three small ones. They were moist, flaky and nutty, superbly rich and best of all, not tooth rottingly sweet and sticky!We had no alcohol, just water, soft drinks, espresso and Turkish coffee. The bill came to about £77, which seems expensive to me coming from the United States but is probably good value for London.Service was efficient but a little brisk. The waitress did a double take when I asked for a box for the leftovers (because we had enough for a one person meal), but it is possible so ask! There's a recession on you know.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GFkDRbR4n-TstOIuFn25Og"
  },
  "tFdOrqzd8MKq6l4cKSqr6w": {
    "date": "11/15/2008",
    "text": "I visited this restaurant back in 2000 when I read a Time Out review about their vegetarian menu. Since then I have been many times and since I am not a vegetarian anymore, I quite enjoy their mixed grill. Excellent quality meats.The wine list is impressive, I like the Kleine Zalze, which is reasonably priced and delicious. The bread is so good you do not want to stop eating it, and the desert is delicious. Try to sundried apricots with homemade cream, or the homemade pistachio icecream. You will be in heaven!Reservations are a must, especially on weekends.Great place, great atmosphere and busy!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "E6z5CB_7tkNh9gHERTstbQ": {
    "date": "1/18/2010",
    "text": "Went to this Tas for dinner after eating a few times at their Southwark branch. The menu looked promising, sound vegetarian dishes, but must say that I was a bit disappointed, the Bezelye Sote was a bit dull and quite small. The atmosphere and the service was good as usual, but think I'll stick to the Isabella street one.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "gYnLfYrjQiEOulSYZDClSA": {
    "date": "1/16/2009",
    "text": "Great restaurant just off Tottenham Court Road. They do a very cheap lunchtime menu for London that works out around £10 per head. You can get delicious lentil soup with unlimited bread, followed by lamb or chicken shish ith couscous (but they will replace this with chips if you want, for the unhealthy option!) The bread is excellent and the service is very good too. You can easily get in and eat comfortably within your lunchbreak.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWUCqrV0HWwwHrxWpRRnZw"
  },
  "wb6gxQmGlCP9Wfa1nCdlzw": {
    "date": "11/17/2008",
    "text": "I usually like Tas restaurants, but after going to so many, my excitement is waning. The hummus generally doens't have that much seasoning so can often taste a bit bland. However, saying that, their lunchtime deals are great value, the staff in this restaurant are very friendly, and the meat is always cooked well, and house wine is very drinkable. And I agree with an earlier review about the bread - it's delicious!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xmdTHYU3vhpng-b16vFx6w": {
    "date": "10/30/2010",
    "text": "Really impressive food and service at a good price. Vast amount of variety on the menu, and even within the set menus a huge amount of choice. If I was really nitpicking they could do with refreshing some of the signage and menus as it does the quality of the food and hospitality a disservice - I'd walked past for years before I tried it. That said, it has zero effect on the dining experience and is more a marketing point for the owners than anything else.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ywcDlUq-759duv5UKlKDpA": {
    "date": "8/17/2008",
    "text": "i like this place i always come back and it is great if you have parties or groups as they have a downstairs place which is massive. the food is alwyas served at the right temp and is always very fresh and perfect every time. staff are willing to do anything fior you and have been known to give you stuff on the house if you are not satisfied. overall excellent chain restaurant nice food if you like the turkish grill salad scene.also pretty surroundings.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fy7634QsXj7S4sX5BqyaPw": {
    "date": "1/14/2008",
    "text": "TAS is a very affordable chain restaurant serving Turkish food. The dishes are very healthy, and delicious - tabouleh, salad, falafel. Their specialty are these cheese-stuffed pastries that are sort of a like a turkish pizza, with different toppings. A typical meal for two costs just over £20. The restaurant has a relaxed and slightly ethnic atmosphere - a good place for a casual dinner.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "E3_k36QDctHqsUTCqwIa4w": {
    "date": "4/23/2009",
    "text": "This was the first time I have ever had Turkish food.  When walking through the doors to the restaurant the first thing that I noticed was the decor.  It was simple, clean and white.  I really enjoyed the simplicity along with the calm soft music playing. I attended Tas for class, so my menu was already set.  I really enjoyed all the different starters that they provided.  The starters consisted of Humus, Zeytin Yagli Patlican (aubergine, tomatoes, garlic, peppers and chickpeas cooked in olive oil), Tabule (chopped parsley salad with tomatoes, onions, cracked wheat, olive oil and lemon juice), Manca (spinach with fresh yogurt served with garlic), Zeytin Yagli Bakla (fresh broad beans, coriander, red & green peppers, dill, garlic, olive oil served with yogurt), Sebzeli Kofte (ground chickpeas and broad beans tossed in spices, deep fried and served with tahini sauce), and Borek (filo pastry filled with feta cheese and spinach).  They were nicely displayed as well as quite tasty.  I liked the humus the best.  The Manca starter surprised me because it had a mint taste, but it was good.  For the main course, there were several choices, Karides Guvech, Kalamari, Turlu, Ispanakli Patates, Karisik Izgara, Mousakka, Tavuk Sis, Eksili Kofte, and Tavuk Guvech.  I chose the Karides Guvech which was prawns cooked with garlic, tomatoes and mushroom.  It was delicious, I ate it with white rice which balanced the sour, tart taste of the sauce.  Along with the food we had a choice of the house wines.  I'm not a big fan of wine in general, but the white and red wine were not too bad.  Overall I enjoyed the food, however I wasn't too thrilled with the waiter for our table.  In general, it's not good for a waiter to reach across someone's face to place things on the table or to rearrange place settings, this happened several times throughout the dinner.  I didn't order sleeve with my dinner.  Despite the waiter, I enjoyed the food at Tas.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AZbpQYsKKcMo0bG1WEYRA"
  },
  "a19Dt_v5S5-PjN5bKH1fWQ": {
    "date": "5/14/2015",
    "text": "I have been traveling all through Europe and stumbled on this unexpected gem for Turkish food. Honestly one of the best meals I've had this month. Service was excellent even during a very busy day. Be sure to try the two course meal for around 11.50£ as can pick a cold appetizer (I had spinach yogurt) an a hot meal (chose the lamb kebab). 10 years ago when I was in London, I thought there was no favor in any restaurant I went too.This place proves me wrong on so many levels as well as getting a very satisfied and happy belly.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fsbwElZoPuesjW1gpy1ZA"
  },
  "KEL7KtcIUlgtPCvg6YQJ_Q": {
    "date": "7/26/2014",
    "text": "I've been in this restaurante for the first time a couple days ago and it totally surprised me. The flavours are quite intense but the combination in the menu of 8 dishes has completely satisfied me. I didn't stay for desert but those that I took a look really make me wanna go back and taste them!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "l18d7QPeJKmhTEXkGTlcSA"
  },
  "EKTYpC1WyUictk2ut8-How": {
    "date": "12/28/2011",
    "text": "After walking around for a few hours in the British Museum, we stopped by Tas Restaurant for some Turkish food.The interior's nice and bright, and has a nice atmosphere about the place, with a bar near the door, and plenty of seating.Upon being seated, we were given a bread basket of lovely Turkish flat bread whilst we decided on our orders. I opted for a lamb dish, and my date went with a chicken dish.Both tasted very nice, though admittedly I've had better Turkish food. Nevertheless, the food was definitely enjoyable. Would happily return here if I were looking for a place around the British Museum again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "z0G-4DW_8r0Kz94JkFLj4A"
  },
  "KvlCf9CYHxMsR-f7c5lP6A": {
    "date": "8/14/2014",
    "text": "Excellent meal, attentive service, and welcoming Turkish ambience on the lower floor with my 13yo daughter as we visited here from Boston.  Reasonably priced menu with good vegetarian variety that most would find something worth sampling.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "payXCBMcWBiKWXX7zFixQw"
  },
  "JtRxt0GesLWqQLSnk4EvAw": {
    "date": "6/19/2014",
    "text": "We stopped in after a visit to the British Museum. It was a rather gloomy day, but we decided to sit outdoors. After about 15 minutes it started to rain, no... it started to pour. No one came outside to see if we would like to move indoors so we picked up our wine and asked for a table inside. The man that seated us was less than welcoming, but the food was good, not great, but good. With out getting into too much detail, the menu is very nice and offers a lot of choices. Decor inside is a bit tired and the staff is not very kind. Female manager was rude. Should give review 2 stars, but food was good and the location is great.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pbgHtTlNzacZSkW1SePn5A"
  },
  "1PsfKZgI5ZDktflipfNsaA": {
    "date": "12/16/2008",
    "text": "From the outside the Tas in Bloomsbury is unmissable as it looks like a mini Oasis, with trees, tall grasses and other foliage lining the facade. Whilst inside is a bit of a strange contrast; pale yellow, blue and light wood, that all remind me of a seaside hotel breakfast room. They could do so much more with the interior but, apart from the dodgy decor discrepancy I have, the Turkish food is worth a visit. The menu is an extensive and well-priced choice. All hot and cold starters are under £5 so it's good to get a meze selection between friends and try out a few different dishes. I really like the Borek (Filo pastry filled with feta cheese and spinach) and the Icli Kofte (Minced meat covered with cracked wheat and salad). Whilst all the mains are around the £10 mark. The casseroles, which are cooked in a traditional Anatolian stew pot are very flavoursome, with tender meat and Eastern spices. These are especially great during the cold weather! Tas also has good value set menu's such as three courses for £8.95 and a meze platter for £10.95, although when I tried this the meze selection was slightly less tasty as when we'd ordered them separately. I give the food a thumbs up, especially as around fifty percent of the menu is vegetarian, but the cheesy decor looses Tas a few brownie points and it wouldn't be a choice for a special evening meal. We usually come for afternoon tea, although it is busier then as the Bloomsbury literati and tourists also like to pile in.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yxKZQBQdA7n57qN-0toyrA",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yxKZQBQdA7n57qN-0toyrA/o.jpg"
      },
      {
        "img_id": "XHcLT1eHvza2s2MA1Qe1pw",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XHcLT1eHvza2s2MA1Qe1pw/o.jpg"
      }
    ],
    "user_id": "SazNhsqh0aCMKkn55MXjBQ"
  },
  "jhW38dNgP6zIVU2LO4wfiw": {
    "date": "9/9/2013",
    "text": "Tas is one of my top two Turkish restaurants in London. It is not as classy as Kazan, but it isn't as expensive either. It's a really decent restaurant: great service & usually delicious dishes (but not as consistently good as Kazan) I would suggest the lamb chops.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KRtnwiA3GWluA2WMxb852g"
  },
  "kc6PR76pa8EelOjS5pSwoA": {
    "date": "1/6/2013",
    "text": "Despite the mixed reviews we came here for dinner and highly recommend it. The setting is nice, service is fine, and the food was wonderful.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRfw2L0AbG-cLMtzrImYeQ"
  },
  "5BwQL3eTDvaDU6i2qcTMfA": {
    "date": "3/26/2013",
    "text": "Hey, we chose to go back after a visit to the British Museum. Lovely food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urj4QhiZkhoUA5mnENvubg"
  },
  "zIFNI7wHtkASKpGAiwmKHQ": {
    "date": "3/28/2012",
    "text": "It was real busy on a Friday night.  They where pretty packed but we where able to get a table within 5 min.  They where very friendly and quick to take our orders.  I ordered a chicken dish I can't remember but there was also a cucumber spread the was super delish.  Next time I'm in London I will try something different.  All the dishes seemed really good from looking at the other tables.  The aroma of the restaurant was filled with pure spices and hearty meals.  They have some juices that where pretty good and also baklava??Can't spell it.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9Gg62hHUyDloLL5sfFUsCA"
  },
  "T7y4JtwhLi0G1M9NOyr0VA": {
    "date": "1/9/2010",
    "text": "Came here for dinner with a group of 28 students at the beginning of our semester abroad in London. I love the ambiance, and the servers were very gracious and attentive. I've never had Turkish food, and I don't think I ever will again (nothing to do with this restaurant; it just doesn't do it for me). We got a number of starters, all of which were mediocre. The borek was my favourite. I ordered the tavuk guvech, which is chicken cooked with a whole lot of vegetables. Everything came out very fast. My dish was a little watery (that might just be the way it's supposed to be cooked?), but otherwise good. I also tried the mousakka (kind of like shepard's pie, but with eggplant), and it was pretty tasty.If you're on a tight budget, don't go here -- this place is fairly expensive. Our group meal was £16.95/person. I think the main menu is cheaper, but probably not by much.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AIxwUiEaUrCEf2gUXi4pDw"
  },
  "z5MuyGQIvJGx4Ppb7Zd0BQ": {
    "date": "6/13/2011",
    "text": "After touring the British Museum, two friends and I decided to visit Tas  It was mid-afternoon, so we were seated quickly, and someone came and took our order fairly promptly.  Then the waiting began.  This was not a busy afternoon.  I would estimate that there were around 8 tables seated and 4 servers.  That seems like a decent ratio, right?We never saw our sever again for 45 minutes.  She never checked in on us to ask if we wanted more bread or to order more drinks.  Never were we told \"sorry for the wait, it will be out shortly.\"  We heard NOTHING.The food finally came, we ate it, it was average.  Nothing to complain about, nothing to praise either.Plus, our server never came back after dropping off the food.  We saw her in the distance, but she never revisited our table to clear down or to ask us how our meal was.Someone else came to clear our table, and swipe my credit card.  This is where the real insult came: a 12.5% service fee was automatically attached to our bill.  Now it makes sense: why provide good service when you know you're going to get a tip no matter what?We may have just had a bad server, but I have a problem with any place that assumes the tip, thereby requiring no effort on the part of the server.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuThEkUMYJvU2e3pSJrHfg"
  },
  "7hJBEVTuj1AQXenwza8Tow": {
    "date": "12/9/2009",
    "text": "Beautifully decorated with Christmas lights! Staff is super friendly and efficient. Luckily we got in before the mad dinner rush. I'd recommend getting there before 7pm if possible. I must admit, I'm not too familiar with Turkish food. Most of my experience with Turkish food involve infrequent visits to the corner of 36th Street & Steinway in Astoria, Queens (New York). It was my  \"street meat\" fix and it was delish!I tried the kofte, lamb, and chicken dishes at Tas. Although I'm not a huge fan of lamb, I did find myself enjoying the lamb dish the best out of the three. It was seasoned just right and not too spicy. I'd definitely come back and try their moussaka!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rem8ln92PSbFZ9IlqbToZA"
  },
  "3VK_0wlpPbGmAriP7cxCGw": {
    "date": "1/13/2015",
    "text": "Perfect tender lamb. Great service. Fresh delight with the check. Fast without being rushed at lunch.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PeDHon_9JbHWewHa2dvPpg"
  },
  "V09_XhiPn8Rue4OkQ-Aktg": {
    "date": "1/10/2012",
    "text": "Very close to my hotel and so yummy...great for a solo dinner! Bread and yogurt dip along with olives arrived as soon as I sat down. I had red lentil soup, a salad with mint and dill dressing, falafel, and hummus. It was all delish and served at a decent pace. The decor was lovely and the service was reasonable. I'll definitely return on a future trip!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yg54-0jKspYSbqIGp9b3-A"
  },
  "6zvvVLE7SrFV_iZWstUMTw": {
    "date": "2/10/2013",
    "text": "Good food at reasonable pricesWe were in London for a long weekend and ate at Tas on two occasions. On both occasions we did not book but were given a table within seconds of arriving. The service was excellent and the waiter pointed out that the intended main course ordered by my wife was available as a 2 course option at the same price as the main course. We tried different starters and main courses on each visit and found all were very good. The wine was reasonably priced for any city we have visited. We would definitely eat here again when we visit London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qo24auJOmLmUMXa8EXVJ3g"
  },
  "ePa4gXIJj2UEOOokf1TgGg": {
    "date": "3/28/2009",
    "text": "I have never had Turkish food before trying Tas, but I'm so glad that I took the chance to do so..Right when we sat down we were served a fantastic homemade turkish bread [i have no idea what it's called but we scarfed down the whole basket] and an olive oil sauce to go with it. My entree was full of flavor as was everyone else's at my table.While the meal was delicious, my wine was horrible!! I ordered a small glass of the house red and it had an unpleasant musky flavor.. not appealing at all.Our male Turkish waiter, who I first thought was Russian or French, was very attractive as was the woman that seated us. If everyone in Turkey looks like them I will be moving there ASAP!!!!Not my favorite meal ever but definitely worth a try for a new dining experience.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "dcnKrfLgwZJS29rTmm5LZA"
  },
  "z7cPGMhp_guAgN_rQxiBug": {
    "date": "9/10/2010",
    "text": "I was visiting London and needed a place to sit and catch up with a friend over a good meal, and Tas filled that need admirably. Tasty food (including plate-lickingly good hummus that might have been the best I've ever had), reasonable prices, attentive but not pushy waitstaff who let us linger over a bottle of wine even though the place was bustling. All conveniently located around the corner from the British Museum and an easy walk from King's Cross/St. Pancras. If I didn't live halfway around the world, I'd be a regular.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw5I771H5tIbh5o5BhR2PA"
  },
  "1raUWymeKDpKNfux0XCBLQ": {
    "date": "11/23/2012",
    "text": "I went here with a group of other scholars after a conference at the University of London -- all people who have traveled a bit and are particular about their food. We were a group of about 15 people, and we were seated in the basement. The restaurant has a pleasant enough decor and seems very classy on the exterior and inside. We were informed that because we were a large group, we had to order off of the group menu, which was 18.50 per person... that was the first thing that annoyed me about the meal. I am a graduate student who has scrimped to fly 8 times zones away to a conference, so being informed that I MUST pay at least $30 for my meal, right up front, sort of made me angry. My colleagues offered me wine and I had to tell them that I couldn't afford any because the meal was too expensive. That was embarrassing. Fortunately, the senior colleagues were sweet and offered to buy wine for the students provided we didn't go crazy and drink a huge amount. With the group menu, the waiters bring you a selection of mezze and let you pick your own main dish. The mezze were all very good; I especially liked the eggplant salad and boerek, and the balls that resembled falafel and the hummus were very good, too. I was moderately fond of the fava beans with yogurt and the tabbouleh was average -- about what I expect from tabbouleh anywhere. The Turkish bread and olive oil/tahini dip were quite tasty. For my main, I ordered the spinach and potato vegetarian dish, which was cooked in soy sauce and veggie broth. The waiter added some chili paste at my request. They also offered herbed yogurt to our table to add to our dishes. I had a colleague who was gluten-intolerant, and the restaurant's chef made him a special mezze of his own, as he couldn't eat many of the other ones -- some sort of mushroom and vegetable dish. They also brought him chopped carrots and cucumbers to dip in the hummus. I thought that was nice of them. We all liked the food a lot.You may wonder why I am only giving the restaurant 1 star if I liked the food so much. Well, as many other reviewers have noted, the service was BAD. The waiter was unfriendly and brusque and appeared rarely. He left us without water for long periods of time. He would not give me more chili when I asked for some. I didn't enjoy that. I also didn't enjoy that I had to pay 25 for my meal once the service charge was added. That's $40! For $40, I expect amazing food, large portions, and polite, attentive service. I NEVER pay more than $25-$30 when I go out to eat at home (in Los Angeles) unless it's a very special occasion, and that is including a 20% tip. WHAT A RIP-OFF. Being FORCED to give a THIRTY-FIVE PERCENT TIP for what was actually ROTTEN SERVICE is an insult. I am given to understand that in the UK, you only tip if you got really great service, and then you only tip something like ten percent. So, why do they have the cheek to FORCE us to pay a 35% tip, especially when they give such terrible service? This is why I would encourage you, the diners of the world, NOT to visit Tas. Show them that we have other choices. The city of London is absolutely crawling with other options for delicious and fresh Middle Eastern/Mediterranean food. Go get some of that instead.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C7dOGOapD1cW1hAyr_u7QA"
  },
  "DZl1YgTX46g-9BerCAvJhw": {
    "date": "9/24/2012",
    "text": "This is one of the most bizarre experiences I have had that pertains to dining.  If I could give no stars for service I would. The wait staff seemed disconnected from the cooks and from reality!  As we ordered a prefixed menu item, among the five appetizers we asked to replace an equally priced item... The waiter needed to consult the manager for this and sadly the manager turned us down.  When we asked for boxes to go at the end we were informed that he was not allowed in the kitchen because it was closed.  When we asked for dessert which was included in our meal, we were informed for the second time that the kitchen had closed!  The manager had to be called. He in turn informed us that we ate too slowly and the cook had gone home and could not prepare the dessert we wanted.  Throughout this conversation he excused himself repeatedly to make phone calls to an invisible force behind the scenes who seemed to be remote controlling this turkish tragedy unfolding before us. Alas we were deprived of dessert. He did however adjust the bill to reflect this by charging for only one person at the end.  Food quality was so-so.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vbn5f-OF9XG0wYssH8zUuQ"
  },
  "4n2gWb1FItC5W6YlZQRpQg": {
    "date": "8/1/2017",
    "text": "Good food, if a bit pricey. The restaurant is a large open space with nicely spaced tables that aren't too close together. Staff is very friendly, if a bit clueless at times. There doesn't seem to be a particular staff member responsible for a table, you just flag down whoever you're able to catch attention from, so you might wait a little to order when it's particularly busy.Food comes out fast and is really tasty, absolutely no complaints there.They do add a 12.5% service charge, which seems to unfortunately become increasingly common in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bk4ccdVNb3w2mgQ7WwHMNg",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Bk4ccdVNb3w2mgQ7WwHMNg/o.jpg"
      },
      {
        "img_id": "fz1jYJYChnnQ2z61s2tBkw",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fz1jYJYChnnQ2z61s2tBkw/o.jpg"
      },
      {
        "img_id": "rgjKQ11qjdeFrlY7vEYuhg",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rgjKQ11qjdeFrlY7vEYuhg/o.jpg"
      }
    ],
    "user_id": "HiY5E-vORIoCK61nTuqHxw"
  },
  "HcKZmRJ33OXkcpclneb6nw": {
    "date": "8/29/2018",
    "text": "Quite far away from the traditional (also light) Turkish food: no typical spices, not typically cooked, seems to be a \"UK adoption\" for a \"stupid\" unexperienced customer. The food is too plane and not enjoyable if you really want to try some mediterranean meals. The prices are too high for everything in comparison to authentic restaurants. The service is ok, but also automatically included in the bill. Will not come here again, rather look for an authentic restaurant - the Turkish food is usually very enjoyable and affordable!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVubSz2uasojSkDDIR0jgg"
  },
  "dpVNce14gNCX53uXXtkORQ": {
    "date": "2/18/2017",
    "text": "I would definitely come back here. The dishes were great. I haven't had Turkish food before this place and I want to find a good Turkish place in Chicago.Their dips are very nice too. Everything was so colorful and the waiters were attentive.5/5 experience.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j3jaM4FyZPlDZy0m17stlw"
  },
  "VTDG9D69pEdWJGclw53fqg": {
    "date": "1/21/2016",
    "text": "Since Tas is located directly across from the hotel I stayed at during my last London visit, a family member and I opted to eat here after we spent a very long day on the train and Tube alike. While we stopped in planning to not eat THAT much due to it being a little late, we quickly ended up ordering more than we expected simply due to the delicious nature of the menu! We ended up sampling soup, meatballs, and an okra and couscous dish I believe was called bamyan. The seafood soup with mushrooms and shrimp was delightful, and topped off with seasoning from the cilantro family. The meatballs were simply excellent: tender, juicy, covered in absolutely delicious sauce. And the okra was, for lack of a better word, delectable -ESPECIALLY with the yogurt and couscous that came with it. Even after all of that, though, we had to try the Turkish delight squares that came with the bill; they were a perfect sweet addition to a meal dominated by tomato- and citrus-based sauces.My only complaint about the experience was that I wished throughout the visit that they would either check on tables more or leave a pitcher of water, because my dining buddy and I were parched after our long day. But, we managed, and frankly, the food was so good, I got over that pretty quickly. Turkish food is hard to come by in my hometown, but now I can say I've been able to enjoy it - and that I would absolutely visit here again during future trips overseas.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_r7Z8qlpcwEYqbqvBogV2Q",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. Meatballs, couscous and an okra dish I believe was called bamyan.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_r7Z8qlpcwEYqbqvBogV2Q/o.jpg"
      },
      {
        "img_id": "onobwSZ-ARaZYNLrEXZxTQ",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. Seafood soup!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/onobwSZ-ARaZYNLrEXZxTQ/o.jpg"
      }
    ],
    "user_id": "M9TjYmTgHayJ22cNkyvW_g"
  },
  "_RMcpNi-AQBFlxOOEFT0Ug": {
    "date": "6/18/2017",
    "text": "Rich menu, several vegetarian options. However, food not cooked in traditional ways. Totally and badly surprised with what was served under traditional names. These represent fava beans, carrot salad and Iskender Kebab. The kebab was especially bad.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "diW8_d-500G2S8wJmVaD5A",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. These represent fava beans, carrot salad and Iskender Kebab. The kebab was especially bad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/diW8_d-500G2S8wJmVaD5A/o.jpg"
      }
    ],
    "user_id": "FmQbuZojb95tzLLEj9R_tQ"
  },
  "nc5t0OC2JkgAzk5X9eCKKg": {
    "date": "6/5/2014",
    "text": "After a long trek across London, it was time to eat before tackling the British Museum.  After a brief wander around the streets near the museum, we found this vegetarian-friendly restaurant.  We felt a little underdressed entering the dining room in our touristy walking clothes and comfy shoes, but the service was lovely (though one of our waiters was a little hard to understand because he spoke so quietly).  The menu can be a bit daunting with its dozens of offerings and unfamiliar words, but the dishes are all described in English below.  It just takes a little while to read through all of it.My sister ordered falafel, and I ordered lamb skewers, and a lime flower tea that caught my eye on the drinks list.  Bread with a yogurt dip and olives were provided to start.  The lamb took a little while to be ready, but the waiter let us know the reason for the delay, and we didn't mind the wait.  The lamb was very good -- worth waiting for -- and was served with couscous.  I'm not sure how the falafel was since it disappeared quickly from my sister's plate.  The lime flower tea had a very powerful flavour, but was mellowed by the honey that accompanied the glass.  A lovely lunch for two; the cost was about $35.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Weh5k-BTby7SbGIGMKlMEQ",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. Lamb skewers and couscous.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Weh5k-BTby7SbGIGMKlMEQ/o.jpg"
      }
    ],
    "user_id": "fG7E6EO-Op2gKX5OsXrF0w"
  },
  "SsbkSD5QR9k95lCLC5JXmA": {
    "date": "9/14/2015",
    "text": "We stopped in after a long day at the British Museum. I didn't have internet so I couldn't check Yelp and just went in on a whim. They have a great selection and were able to accommodate both my husband's dairy allergy and my gluten allergy. The Mr had fish and chips and said it was the perfect amount of crispy and flaky - the best he had when we were in the UK. I was so jet lagged that I can't remember exactly what I got for an entree. I do remember the side of potatoes. I could have just had a giant bowl of the potatoes and lived off of that for the rest of forever. I swear they put crack in them. Prices were pretty average and service was great. I highly recommend it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ApU_zz2ldg_rn1QZX8NAtg",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ApU_zz2ldg_rn1QZX8NAtg/o.jpg"
      },
      {
        "img_id": "i3rtm8WM2gl6fLQ1ZuYzmA",
        "caption": "Photo of Tas Restaurant - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i3rtm8WM2gl6fLQ1ZuYzmA/o.jpg"
      }
    ],
    "user_id": "dKCEIzXWKjQoorZ4R6PBvg"
  },
  "DqmLiKFWqr8oxeCw_8sl2Q": {
    "date": "11/27/2017",
    "text": "The manager of this place is a very rude and aggressive person. We (me and my wife) kindly asked to use their toilet (you know, it happens sometimes when no public toilets around), but the manager showed his anger and said it's only for customers. I said \"ok, I will buy some drink to go on a bar in exchange for visiting toilet\" (it was cold outside and I was thinking to take some coffee to go, before entering the restaurant), but the manager just said \"go away, right now!\" in a very very rude form (and some abusive words). He literally pushed us out of the restaurant. What would a normal manager do? In most cases - nothing, just kindly smiling while showing you a way to a toilet. In some cases a manager might ask you to leave some tips for the cleaners but still with a smiling face. Hope that the manager of this restaurant will read this message and learn some lessons of politeness. Almost all negative reviews apply to rude staff. I've been here on 8 of November 2017. You can see in rating statistics that the average rating of this place is continuously falling down since 2013.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wZwyVwzFaBi14bH_jO66Q"
  },
  "2D3M0LpOIJA6ytUVh8rZQQ": {
    "date": "7/25/2015",
    "text": "I'm going to have nightmares of this restaurant forever! This place will haunt me like Freddie Kruger. I don't think I've ever given a restaurant a 1 star, but I shutter at the thought of letting anyone eat here ever! Tas was the worst dining experience I've ever had. Upon arrival the wait staff as rude. But Yelp loved this place so I overlooked it. When the soup came out cold and the salad came out mushy, I said nothing and smiled. When the bread and hummus came out stale, I smiled kindly. When the halibut came out, I nearly died from disgust. This dish was DISGUSTING. It was cold and had BONES all in it. Not only that, the fish was a frozen fillet! It wasn't even fresh. The taste was horrifying. When we tried calling the manager over, he not only didn't listen to me, he YELLED at me in front of the customers. I asked for the bill and he wouldn't give it to me and told me I didn't have the right to say the food was disgusting. So be FOREWARNED Yelp, this place is the pits. BARF!",
    "rating": 1.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "t0f_3BgagS9T1UrNG_Qhqg"
  },
  "b6iMleOWLyX70OU-DJVjnQ": {
    "date": "10/9/2016",
    "text": "We were thoroughly unimpressed. London has so much to offer in terms of Turkish food, but this place is clearly designed with the tourist in mind who comes in once and doesn't know any better. Our mezes were all just cold, basic, and hardly worth £13/person. There wasn't even pita bread or something nice to dip in with. Don't be fooled by its convenient location: Overpriced and uninspired food-- just avoiding d it.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8K9M_ckCe00RrU1q_qm4yQ"
  },
  "IweajRsFRJGePdgMqZTqfQ": {
    "date": "9/25/2015",
    "text": "I booked this restaurant for the Yelp book club for two reasons: 1) It was in Bloomsbury where Virginia Woolf lived and 2) In her book, the main character goes to Turkey for awhile. So this place seemed like a great idea.We had two last minute drop outs, and they easily adjusted our table to fit four instead of six. We chatted for a bit, and kind of decided what we wanted, but no server was to be found. Eventually Jules had to wave at one to get them to come over.I had the only cocktail on the menu and it was nice. I also tried the non-alcoholic drink consisting of picked carrots and beets with salt and spices mixed with yogurt. (Also tasty, but it was a bit intense). For food, I ordered the spiced lamb liver to start and the mixed grill in tomato sauce and bread for a main. The liver was fantastic. Really tasty, and the spices complemented the liver well. My main was slightly disappointing. I was expecting a bit more bread, and it turns out I was eating the chicken as bread for awhile. Oops. And the tomato sauce was a bit bland, and didn't really add to the meat. I think I would have been better off with just the mixed grill with couscous. Oh well.Then after we decided to leave, it took another long period of time before we could flag down the server to get our bill. And another long period of time before someone came over so we could pay our bill. So that was slightly annoying.So the food was good, but the service let it down a bit. But the venue is nice, so that's something. If someone wanted to go, I'd probably go back, but I might seek out other Turkish places to go if I was in the mood for that type of food.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "BK5emz7rNPMgnEqxjBGMTA": {
    "date": "11/27/2013",
    "text": "Located close to British Museum and within walking distance from several hotels, Tas is a good choice to try exotic Turkish cuisine in London. It's a chain, but chain done right.Interesting interior design, good service, delightful food. I love good Cacik, and this one was perfect - fresh cucumbers, light yogurt with touch of mint. Humus was nice as well, with good balance of garlic and a bit of lemon.Main dish, the Iskender, is always my favorite - meat, cubed bread, tomato sauce and yogurt - it never disappoints, of course I cleaned my plate!Wine was decent, not bad at all. Great place for dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "c3xkFRo38JB7T0xgiPOEbw"
  },
  "xeCT4_D08EORvIwnBvdLLw": {
    "date": "7/25/2015",
    "text": "Absolutely disgusting.  We ordered Halibut - which we discovered was not fresh and frozen and filled with bones. Rude manager, rude servers.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kMxot40Ysd_z4ZhOq0iO4g",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. Nothing like charging 15 for frozen Halibut with bones in it.  Absolutely disgusting.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kMxot40Ysd_z4ZhOq0iO4g/o.jpg"
      }
    ],
    "user_id": "8zZwOBvAdU17-5PB6PnOOw"
  },
  "uDbF_aLl6wx7R5AB_-NzTQ": {
    "date": "9/12/2013",
    "text": "My new travel friend recommended that we go to his favorite place near the British Museum and we were all delighted.  This place is super vegan-friendly -- you don't even have to go out of your way to have them modify dishes on the menu!My experiences at Tuirkish restaurants have been limited -- usually, they don't seem to offer quite so many vegan or vegetarian options.  My mom and I had more than enough items to choose from - we got all small plates to share between us -- and everything was absolutely delicious!The service was impeccable, and the wine list had some really nice and reasonably priced options.  I even enjoyed the rather strange Turkish cover version of 80s pop music done in traditional instruments playing overhead (Seriously - \"Wake Me Up Before You Go Go\" and others done instrumentally - precious!).",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RlXfOTtpgTfcisRmukrGbw"
  },
  "vRBkv6uJbBh2GOe49TcCew": {
    "date": "12/24/2013",
    "text": "Great Turkish food for a very affordable price. Can get a meal and under £12.The meat plates are executed well, kebabs not over cooked and juicy and tender.The set for 2 is all vegetarian, carnivores be warned.Service is pretty laid back and you need to be proactive to get serve staffs' attention.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sdA5CD3KvulaHjYcRcFSVw",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. Delicious lamb kebabs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sdA5CD3KvulaHjYcRcFSVw/o.jpg"
      },
      {
        "img_id": "V1yHuC7svJWGrRavbkkb5A",
        "caption": "Photo of Tas Restaurant - London, United Kingdom. The 24 set menu for 2",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V1yHuC7svJWGrRavbkkb5A/o.jpg"
      }
    ],
    "user_id": "G46sszqrpJmFCKVMmeQL5A"
  },
  "92xQcM6uvfqyKbjfUmPlOQ": {
    "date": "6/4/2015",
    "text": "Our hotel suggested this restaurant and we went there after a long day at various museums. What an awesome place! We've eaten Turkish food before but the menu was new to us. However, the service was excellent and we received great suggestions on what to order. The food smelled delicious and tasted even better. New spices in interesting combinations. I had a pea and carrot dish called  Bezelye Sote which was savory and a little spicy and delicious. My boyfriend had the Tas Special of lamb and potatoes and he liked his dish very much. We had Baklava and Kanafeh for dessert and they were wonderful too . We made plans to go back again for our last night in London.You can't miss a chance to eat a delicious meal like this! Or to be welcomed by the great staff. Treat yourself to a trip to Tas!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mqOx5m7jaUZPmY6FSKU6kw"
  },
  "SnNV2Z1nWFApIgUe7ZyYNg": {
    "date": "10/24/2014",
    "text": "Very different from what I'm use to, but everything was delicious. A little on the pricey side when it comes to portion size but none the less very good. Right down the road from the museum, it's a great change in diet!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_1POoB-wLcS3HvJmF9tsVA"
  },
  "qLGVA9MMNoiT6rKBvCOctQ": {
    "date": "1/20/2014",
    "text": "Okay this is gonna be a loooooong review so may the gods give you strength! The décor: slightly 70's looking pale yellow, light wood tones and lots of unnecessary turquoise accents everywhere - a little like being inside a mosque in the Ottoman Empire.  During my visit with a friend Tas is near empty; granted it was the tail-end of the weekend, but this is central London after all - you'd expect the location to be ideal for business regardless of time.  We order from the prefixed menu: 3 courses for £19.95 - not unreasonable.  The appetizer selection of 5 dishes included something unfamiliar so we asked if we could switch to something that we actually recognized.  After looking a little horrified the young waiter goes to ask the manager for permission.  The request is turned down even though what we wanted is actually cheaper than the existing item on the set menu so if anything, it would have been to their advantage!  The appetizers arrive and there's hummus, then a yogurty dish, then an artichoke, potato and tomato thingy, then an eggplant dish and finally dolmas sitting on a bed of lettuce thing, all lacking salt or any discernible taste.  The main course takes a while to arrive but when it does it's actually not half bad- not award-winning but better than expected.  Perhaps that is the key to their success: low expectations.   When we eventually ask for a box for our leftovers this is where things take a turn for the bizarre:  the nervous little waiter takes our plates away and promptly returns to inform us that since the kitchen has closed he has no access to boxes, or anything else.  This is confusing as well as disturbing, because you see #1: it is nowhere near closing time and #2: we had yet to get dessert which was the last part of our delightful 3 course meal.  When we remind him of this minor fact, he apologizes and scuffles away once again, visibility sweating now.  I am beginning to fear for this guy's life.  There we sit and wait - utterly baffled.  Soon another guy who looks like he could belong to the Russian mafia comes over and says no dessert in broken English (which I know is hard to achieve when you're only got two words to work with, but achieve it he did).  Clearly they were bringing out the big guns to deal with our very threatening behaviour!  After we explain our dilemma he agrees that we can go ahead and order dessert.  Fantastic - we look at the menu and decide.  When we inform the original waiter he says that particular dessert is unavailable and to try again.  We ask him to let us know what is in fact available; he says one second and runs away - again!!Yet another guy then shows up.  This one, who seems to have a slightly more managerial role, is less frightening looking but equally clueless.  He explains that since WE took such a long time to eat dinner the kitchen closed and the chef has gone home and as such only the cold desserts are available- they can no longer cook anything.  A little stunned, we remind him that THEY took their sweet time delivering the entrees and no one actually told us the kitchen was about to close, so how about fixing the problem instead of placing the blame on the customer?!  He too said one minute and disappeared.  He didn't actually go far - just to a corner to immediately get on the phone.  After an eternity and what we assumed to have been several confidential calls with the secret service, he came back to say he didn't know what to say!  He wasn't unpleasant - just completely helpless, defeated, borderline pathetic.  He accepted that what had happened was \"unexcusable\" and was prepared to adjust the bill to reflect the lack of the third course.  Fair enough we said, by this point so thoroughly annoyed and exhausted that we didn't care about having dessert any more.  (And equally unwilling to correct his grammar - saying unexcusable instead of inexcusable is, well, inexcusable!)  He went away once again, and returned a little more apologetically this time having reduced the bill by 50%!  Not quite able to believe this was actually approved by the faceless gods running the show behind the scenes, and thinking surely there must be a mistake, we quickly paid and legged it out of there as fast as we could.  I do wonder what fate befell that poor bastard since everything seemed so tightly and mysteriously remote controlled, with the staff completely powerless to make the simplest decisions without getting NATO clearance first.  Hopefully he wasn't taken out the back and shot on the spot.    Okay, rant over.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "ebIvQWKuUN1Qeck2OT5A8g"
  },
  "Xl14wJbxccy0GFZAGzixow": {
    "date": "4/11/2014",
    "text": "Stopped in to Tas after leaving the British Museum.  Crisp and white, lovely to sit outside in the sunshine.Seervice is excellent.  Food is fresh, zesty and tasty.  The house wine is very good.  And all for very good value for money.  Especially if you choose one of the set menus.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSwwRATdcNBDDz8dF4oJpg"
  },
  "eZ7DugeYCuuB5gJULa3N1A": {
    "date": "11/27/2013",
    "text": "The restaurant is pretty amazing in my opinion and offers exotic Anatolian cuisine. The place is located at a walking distance from the British museum and the location is pretty central; there is a big crowd passing by pretty much the whole time so don't be surprised if the place is packed.Exclamation point on the Pacanga - it's so, so delicious, smooth and crispy all at the same time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R24Tu1z6ck1M3LdE7eVbKg"
  }
}