{
  "gUGqejhzVS4kx1VZoogVnw": {
    "date": "9/10/2010",
    "text": "If Shakespeare and Dickens could get behind this pub and its coaching shenanigans, who am I to say otherwise?Just trust me -- this pub is fantastic. For its history, its cobbled patio, its maze like layout, its stumpy ceilings, its exposed oak beams... this is truly the place to educate your guests on what a true \"London pub\" once was. (Then you can take them for a kebab and a pint at your local.) Shakespeare people, Shakespeare.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 6
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "M2jM5miLzTKoCJuSt-ZmBw": {
    "date": "6/7/2009",
    "text": "I'd seen this place hidden down the alley before but had never really taken a good look at it, which was an oversight as it's a lovely looking old fashioned pub in a secluded courtyard. A good find anywhere, but in a busy part of London, a godsend! It's basically an olde coaching Inn, rebuilt in 1676 following a fire in Southwark (I guess the same one that led to the nearby Anchor being rebuilt too). Just about survived the death of coaching and now the national trust protects it. There are various different bar areas and they offer a decent selection of ales and friendly staff to pour them for you. As with most good pubs, the worst thing about them is how busy they get and so this venue is no exception. The outside area expands the available space but of course depends on our weather. If the weather is Ok though, it's the place to be.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1rh3Xg580yeTqEfVQYF_xg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1rh3Xg580yeTqEfVQYF_xg/o.jpg"
      },
      {
        "img_id": "3xPqOWGhm8wgCcFpSQLX6A",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3xPqOWGhm8wgCcFpSQLX6A/o.jpg"
      }
    ],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "aS9MS0JZkqCFe71omzdktw": {
    "date": "10/14/2011",
    "text": "Lovely pub with a couple of different rooms and huge outdoor area with heaters. I'm a little hesitant to recommend this pub though, purely because it is usually very busy and I don't want to fill up the few seats that are available!Drinks are good but not much of a wine list, food was also beautiful  must recommend the chicken wrapped in bacon, mmmm! Slightly on the pricey side (but what London pubs aren't these days).What tops it off is that I've only been here a few times, but each time I've had super-friendly and quick service, the kind of welcome that makes you want to visit again very soon. And I'm sure I will :-)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Yd_9yl77BlIzpldykFVQDw": {
    "date": "4/2/2011",
    "text": "Recommended for sunny evenings...but good luck getting a table if it is sunny! Food is stodgy and does the job, but nothing to write home about. It's the setting and architecture which sets The George apart from other pubs, and if you're in London with tourists then they'll love it. But if you live in London, you'll know that there are better drinking establishments than this.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "IRE78CR1vhJSl6UCVLkjfw": {
    "date": "1/19/2010",
    "text": "By most scales, this bar is a 3-star, but for sheer historic value, I rate this pub a 5-star. Owned by National Trust and the last galleried coach pub in London, this establishment has outlasted its peers by a long measure. A Dickens haunt, the place appeals differently in different parts of the pub. While the main bar and the immediately adjacent rooms might give it a fairly anonymous air, like any old pub in London, the room at the right hand side of the main bar has an old world charm to it, perhaps due to the uneven flooring or the wooden benches. It could even be the dimness of the room or the conspicuous absence of ambient music. This room is definitely my favourite for it allows for the two primary things for which one goes to a pub (or well, at least I do) - peaceful appreciation of one's beer or wine or whatever one fancies and some good ol' hearty conversation. This place has become a weekly haunt for the past few weeks and their mulled wine and chips are a comfort on bitterly cold winter nights. Unfortunately, I am yet to have a meal here so I have no opinions on their kitchen yet.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "E8OPx1EO2EF8DjV5SQDOwQ"
  },
  "1r1yX7Q4sPvrb2uKV6mMAw": {
    "date": "4/8/2010",
    "text": "I love this part of town (London Bridge/Borough Market) so I'm a bit biased but I was quite happy to find this ye olde English pub gem just a short walk away from the tube (and the waterfront and the market).  Very funky building and lots of outdoor seating (with heat lamps) and an inside filled with misshaped and odd little rooms... guess for the English it's not new or interesting but for an expat like myself I love the mish mosh of old cozy tiny rooms in these kind of pubs.For sure will be an addition to the list of place I will hang at when I'm in the area as well as add it to my list of trusty pubs to stop at when tourists are in town.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bk8vptdyN5iH9pM8_SB1cw"
  },
  "VtPjCdcDM43Q5nsRDMO48Q": {
    "date": "4/26/2013",
    "text": "This is everything a pub should be.  Good beer, lots of outdoor seating and a cozy indoor seating.   Hope to be back many many times.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNclkukeUwI7Yw5UA3FTSQ"
  },
  "iXikJfz7_lhJe6gBBGdSPA": {
    "date": "11/8/2009",
    "text": "It's pretty, historic, easy to find but that's where the good stuff stops.Service is indifferent on a good night and it's just too busy.  The last galleried coaching inn in London.  Architecturally sublime, a Dickens haunt, but where isn't, rebuilt ten years after the great fire. Unfortunately, the other side of the courtyard was remodlled by the Germans in the 40s and council planners in the 60s.  Now owned by National Heritage, Go here for the history, go everywhere else for everything else.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "xwV7jXDWps_Wu1kdqCybRg": {
    "date": "9/10/2012",
    "text": "Splendid old building, but the inside stinks of stale booze and the outside is marred by the encroaching ugly modern buildings opposite. It may just have been the day we were there, but there was hassle from a creepy lecherous old man and beggars circulating in the courtyard. They really need a friendly doorman to give it better security.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqnj3tF6Pe-9Ss4ahO3tug"
  },
  "_OQEr2j_7K1WLn_Bw-7YUQ": {
    "date": "7/23/2012",
    "text": "We went to The George based on the recommendation from a friend that this was a pub that around during Shakespeare's time and rumor is he frequented here. It's amazing that it has such great history. It's also a popular spot among the locals. We went during happy hour on a weekday and the place was packed. Reasonable prices for a pint and fun people watching.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yZS81ytT4TnAzaQ9Qs73oA"
  },
  "FhpyyGIyTbYpoOntTcNtDw": {
    "date": "7/4/2009",
    "text": "Just popped in here for an evening of cool drinks on a summer's evening. Nice cobbled courtyard with loads of tables and a really nice vibe. Staff were friendly except for the doormen who gave us death stares at the end to leave IMMEDIATELY. But hey, they were only doing their jobs and probably wanted to get home. It's just a shame they aren't open until later because I didn't want to leave!As noted by Alice S, it's owned by the National Trust and it is charm itself. I love quaint windows and the feel of the place and I'm definitely coming back again.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-6xdOUjVCWs4d8olhrDuUA"
  },
  "Alj5gE5V1uT5CAVFlvgPEw": {
    "date": "6/7/2010",
    "text": "I'm teetering between three and four stars with this place. On a good day it would get four stars. A good day meaning you get a table all to yourself and the sun is shiny. But on any other day, I imagine this place is just a bit average. The main draw for this place is the outdoor space. Actually, that's quite exciting. Well done them. But I really really hate drinking wine out of those little wine bottles. Nothing annoys me more. If you're giving me wine out of one of those little bottles, it's shit wine. And at least smile when you're serving me and don't roll your eyes at me because you've forgotten to give me my receipt and that's why I'm still standing there. The service was brisk at best. This is a gorgeous building and if you're outside you'll have fun, but this pub could be so much better.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ACh4fWBKhXN4MwZtLK4yaA": {
    "date": "2/12/2013",
    "text": "A regular haunt on St. Geroge's day (a must) came here for a stag night, great ales, decent food, steeped in history. A good old fashioned English pub. what more do you want!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "f6Wy0X6ae2xYaY_X4JfhLQ": {
    "date": "2/4/2012",
    "text": "This place exists and is like any other pub. I have no positive or negative feelings towards it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Az97YHaP5mognwqSz17ghA"
  },
  "a7888L-4A-DG_NDVxNrNmQ": {
    "date": "10/4/2012",
    "text": "This is a gem of a pub, steeped in history. Shakespeare used to get trollied here. Dickens mentions the place in at least two of his books. The pub is the oldest galleried pub in the capital, and the oldest coaching inn. And because it's Grade I listed, it's kept more or less its appearance. You can see old photos on the wall from the 19th century if you don't believe me. It looks the same.It's also a great pub to go to in the summer, if it's not raining, until closing time at 11pm after which there are plenty of late-night bars to go to in the vicinity. I used to drink here every day, when I was working in the area, although now I only tend to go occasionally. I often include it on my pub-crawl route which I do every year on my birthday.It used to be really expensive, but while they haven't put their prices down, the other pubs have caught up with them. I think it's about £4.20 a pint, which is very expensive of course, but it feels more justifiable given the beauty of the place.The Old Bar (on the right, westernmost side of the inn) is by far the most picturesque, with its really old interior, tables that are at a huge slant, and a real log fire. It's also normally quicker to get served there, assuming it is open. The new bar is not so nice, and they've really spoilt it (I remember it before). I'm surprised they were allowed to make the adjustments they did.But to be honest, I never sit inside unless it's raining. The courtyard is too lovely to miss. Food is poor. I have twice been tempted by food there, and twice been sorely disappointed. It always looks lovely, but tastes very bland. Better eat somewhere else instead. If you come to London, and want to visit nice pubs, this one HAS to be on your list.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "chgu-78H737I9Lb3b0l2BA"
  },
  "sVaFABQ0gn9QSYbibUBRZw": {
    "date": "7/16/2009",
    "text": "Definitely an after work near the City type of place to go.  Old England charm goes very well with a cool summer night.  Great service.  The food is a trifle bland, but that's to be expected.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1Ce1N6F7vw9pKnsv8MtRA"
  },
  "P7m_EWhE6YyE-23jGN1aCw": {
    "date": "11/12/2009",
    "text": "This wonderful, historic pub is hidden off Borough High Street, but moments from London Bridge tube station. As it is historic and central, it is a bit pricey. Although it appears you can put a price on feeling like you are sitting in the same bar as Dickens, the selection is good with Cider, Real Ale and Lager all on tap. It does get very busy in summer, although it really shows its charm in midwinter. Don't worry there are patio heater for the outside dwellers and real historic charm for those who prefer that inside.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hlZGQF6QRw1cneih9sibrA": {
    "date": "7/5/2011",
    "text": "Looks amazing but sadly its style over substance. Poor wine selection and expensive drinks.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "aBPq40W5aK8se6pWkSiIHA": {
    "date": "12/29/2008",
    "text": "The George Inn is my favourite pub in Borough and a perfect joint to go and warm up, after a few hours of wandering down the Southbank or through the market. Owned by The National Trust (it is the oldest galleried coaching public house in London and is mentioned by Dickens in Little Dorrit) the pub is down a discreet, cobbled courtyard just down from London Bridge tube station on Borough High Street.In the winter, they make an excellent mulled wine and serve up hearty meals- pies, fish and chips, stews.It is a remarkable building from the outside and retains a number of beautiful features on the inside too- look out for the tavern clock- it dates back to 1745 and the high pine settles which split up the bar.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "qXPhsc6zMODXMVG3ypajzQ": {
    "date": "11/11/2011",
    "text": "Great feel about such a historical place, and the renovation is done very well, cleaning it up without destroying any of the amazing galleries, walls, etc. Staff are generally friendly and efficient and its one of my favourites near home.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Z5qeWvGJcGPgeFmn_RCDQ"
  },
  "Lvnim2otBTruJKM-boJMpQ": {
    "date": "1/12/2015",
    "text": "I love bringing family and friends to The George Inn when they manage to visit London. The building is beautiful and gives a wonderful sense of London's rich history - always a winner for the Americans! The outdoor seating space is great, the staff are friendly, and there are always a couple of decent beers to fit your mood. If you find it crowded and hard to find a seat, look harder and ask a to share tables; I've always found the crowds to be very friendly, even though we've had a case of beer spillage once! As for the food, I can't vouch for it since I've never been here for a meal (I mean, Borough Market is right across the street!). But if you're looking for refreshing pints on a lovely, warm day, this is a great spot for it.I'm not sure if I would continue coming here as a local because the pub still has a touristy feel, but I'd definitely recommend it as a stop for any visitor to London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "hyEMG39W2GUw_JxmzArL3Q": {
    "date": "12/4/2014",
    "text": "What a find!! Didn't realise this pub was here and must have walked past it a thousand times. What really impressed me was the extensive list of beers (from around the world might I add) they had - a Beer Bible almost. I would say the range of beers is even as good as the Porterhouse in Covent Garden. This pub has a nice cosy feel (and sofa seats if you're lucky enough to get there early). They also had live music when I was there (Wed night) - not sure if it's a regular thing, but I certainly enjoyed it. Will definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mfcgaot7YKLD1DvPmfKgFQ",
        "caption": "Photo of The George Inn - London, United Kingdom. Coconut Beer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mfcgaot7YKLD1DvPmfKgFQ/o.jpg"
      },
      {
        "img_id": "zQ3s4OHl8Mx4yEeHQATRKA",
        "caption": "Photo of The George Inn - London, United Kingdom. Belgian beer - Bruges Zot",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zQ3s4OHl8Mx4yEeHQATRKA/o.jpg"
      },
      {
        "img_id": "k_rJFH56QCPmKNIP82BP2Q",
        "caption": "Photo of The George Inn - London, United Kingdom. Belgian beers!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k_rJFH56QCPmKNIP82BP2Q/o.jpg"
      }
    ],
    "user_id": "tN2s2AiPblojh4_rv9AJ-A"
  },
  "9McfKONrLu5mFLii-H6RTw": {
    "date": "2/12/2015",
    "text": "Bit of an old traditional style pub, good selection of beers and a decent sized function room upstairs with it's own bar are so could be good for parties. Friendly bar staff.Also has an outside bar, really handy when it gets busy inside!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9L5hXMQ4waJvvc6UX70Iw"
  },
  "KFC3Th5Yoxem1HIg1smsLw": {
    "date": "1/21/2012",
    "text": "Oldskool London pub. Nice outdoor area, where I petted an adorable dog, and then whined about missing my dog. Well, now I miss the George Inn, so we're even.What can you say about these venerable old British pubs except that the cider is cold, the room is OLD and the bartenders are HOT and young. Shakespeare and Dickens hung out here, cool history is always a plus.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxA0vTDi1KABuA5Tgg1HKA"
  },
  "zt3564V6VuIMUlNxCl9MKQ": {
    "date": "8/20/2014",
    "text": "Found this pub from across the courtyard at The Heeltap and was glad I ventured over. The building is full of character and the beer selection is good and priced really well.  The whole place comes into it's own when the sun is shining though. There's plenty of seating outside but it does get busy and there's a cool balcony which is perfect for people watching",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfM4mH3T3xJspJfOGbJIsQ"
  },
  "e5pNZUjr2Ixp3O1sYEVE8w": {
    "date": "9/4/2014",
    "text": "Probably the most popular bar on Borough High Street, the George is always packed with locals whenever the weather's nice enough to drink outside (which, in this country, is pretty much all the time). They have a decent selection of draft ales and lagers, and plenty of bottled staples. Prices are on the upper end which surprised me, because this doesn't seem like a tourist spot at all... It's a fantastic place to unwind with friends IF you can snag a seat outside. If you're forced to sit inside on a nice night though, the bleak lighting and awkward setups of some of the ground floor rooms can make conversation a bit depressing. We ordered some charcuterie plates which were just OK, considering the prices we paid for them. Everything was lacking in salt, and the rosemary bread was drenched in olive oil which made them non-ideal vessels for tzatziki, eggplant dip, and hummus...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMXfcEK9S4BVLYEGhyEsbQ"
  },
  "h9OC9SbL1NkwSD8rfnbCkw": {
    "date": "5/30/2014",
    "text": "Great place to visit if you are from out of town, not as brilliant if you are local.  The place oozes atmosphere with its cobbled courtyard and Tudor-like exterior.  Beer selection is usually excellent, with a range of ciders, lagers, and bitters on offer.  However almost £5 a pint is a bit steeply priced, even in Central London. Pair that with the wait you'll likely have for the privilege of paying that much and the ambience begins to lose its charm. It can also get incredibly loud both inside and outside, which can be annoying if you've come to chat with your friends. That said, I do find Sunday evenings are fairly quiet there.Useful venue if you are meeting people from out of town as it's easy to find. I'd suggest gathering here and then heading off to another pub tucked away off the beaten path.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuIuTO0t6AxBhQgIfnNKkw"
  },
  "066_DWFL3Qpw_rAMDIegRg": {
    "date": "8/21/2015",
    "text": "Very nice outdoor beer garden. Really enjoyed a few pints and more than a few glasses of wine out here. A little on the expensive side but centrally located and one can say it has character.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "a_v-o5mhVKhRyyRS_2UyYg": {
    "date": "11/6/2013",
    "text": "Meeting up with friends in London after work I wasn't sure where we'd end up (I have next to no knowledge of decent watering holes there). So hopping off the tube at London Bridge and after only a short walk, the George Inn is tucked down a blink-and-you'll-miss-it cobbled alley and you immediately get transported back a couple of centuries (if you ignore the legions of folks sitting by the patio heaters 'smirting'). Inside it's on the pokey side but that adds to its charm. Loved the place. And Charles Dickens apparently frequented it in his day (though I'm sure several hundred other establishments could claim the same). Recommend you try the house's IPA (George IPA, really easy to remember).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9tJS1I0BtaLEKZQjO7R4w"
  },
  "bzuXvYhMgXHOqSg_lzdobg": {
    "date": "10/7/2015",
    "text": "History is the reason we came to the George     And the fact hay it was actually open. We read the reviews that said the food and drink were just ok.  And they were right.  Plus service was a little slow.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CLXT2JlD8sXCEU3oG_hxNw"
  },
  "qidDTLB2_-sSfOoVmmwCLg": {
    "date": "6/29/2015",
    "text": "Had Sunday lunch here yesterday, best roast beef I've had in ages - lovely and rare and very tasty. Epic Yorkshires too! Good range of beers and wines, nice atmosphere, chilled out, v friendly staff. Been here for drinks previously and is a lovely atmospheric pub, well worth a visit if in area. Reasons not for giving five stars - no highchairs, really annoying as its a family pub and it is v hard to eat a roast dinner with a baby in your knee!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tXZ3N0WZYzFsj6Ep2adGw"
  },
  "wP8ZzO21Hsoosxvai4orUg": {
    "date": "4/5/2015",
    "text": "I have such a soft spot for this historic pub. Great courtyard,  perfect for evening drinks in the sun. The atmosphere is always fun and lively and has become a popular spot in the area and can get busy. The food is also really good! One of the best perks of working in London Bridge",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KJ1HAE_XZo7XxlIxRIvw-Q"
  },
  "lGB7jD_CH2jQ-_h2YXLUkg": {
    "date": "2/27/2013",
    "text": "What a great unique place I would never have found if I wasn't on some random London scavenger hunt thing! It was tucked away off the main road in Borough, and though it took a bit to find, it's got a huge patio space and two indoor seating areas to keep you preoccupied. They have a standard service bar, and are basically a good place to pop in along the east end of the Southbank. It's close to Borough market, as many have pointed out, which makes it extra convenient if the market doesn't take all your money. It's the kind of place, with authentic furniture and mismatched chairs and lots of weird nooks and crannies to sit in, which feels so authentic that you forget you're in the shade of the Shard.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "pXz0I-SSmb6QHQMq4GW-UQ": {
    "date": "4/16/2012",
    "text": "While on vacation, doing the tourist thing in London, we were recommended to try the George Inn.What great history.  Truly.As noted by other reviewers, Shakespeare and Dickens haunted this place in their day and it has survived for nearly 400 years.. My son noted that we were having lunch at a tavern that is older than our country.The steak and ale pie, steak sandwich with stilton cheese, mushrooms and caramelized onions and the chicken tikka were excellent.All were washed down with a pint and we were on our way.A great place to stop, soak up some history and have a good meal.We'll be back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lZzKS-UOJCP4AMYiLIq3MA"
  },
  "5qVbakuNEYdlLuHrDOOTaA": {
    "date": "10/20/2012",
    "text": "I think I need to come back here at some point because it neither wow'd me nor convinced me I shouldn't come back.My friend knows I'm a fan of ale so he said we had to come here. The ales fine, didn't have anything that had me scrambling back to the pump though.I'd imagine the outside in summer is brilliant, on an evening that's seen rain, not so good. As has been previously mentioned on another review, you do get the odd one or two people hassling you for change, while this doesn't usually bother me, when you'd in a courtyard where you'd intending to stay a while it can get uncomfortable, a table not far from us one of these bods sat down with them when they said they had no change, not great.didn't see much of the inside so can't really comment. we had a couple and moved on reasonably quickly.Think I'll have to give this one a shot during the day time",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_wQYj5o-l9H-rq49_PRmA"
  },
  "8rSCdHCIiac9Epdemczoyg": {
    "date": "9/26/2009",
    "text": "One of my favorite pubs to stop at when south of the river, the George really captures what a great London pub was supposed to be. The building would have spanned around the perimeter of the courtyard originally, which over the years has been turned into some awful modern buildings which I wish hadn't been built because it would have been great to see the whole historic building still in tact. Perfect for summer nights to sit outside (and they do have heaters), though i have to agree with Li-mei about the workers giving you the death stare when they're about to close, if they're that bent on getting out on time they should stop serving a little earlier cause we had full drinks a couple of times and they were shouting at us. But assuming you aren't closing the place down, it's a must-see. It's one of those places that reminds me why I love living in London.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "LTw7YwPYujw5vI_k2_IREg": {
    "date": "5/8/2014",
    "text": "My first night in London was spent at the George Inn. For this reason, this Pub will forever hold a dear place in my memories. After a few drinks, we ordered a fish platter and a side of chips, while we continued quenching our thirst. Staff was friendly. The atmosphere was fun, happy. The indoor area was as lovely as the outdoors. I wish we could have returned.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ohtJIP4gBmCa6bKgvaYZqA"
  },
  "Ga-yRinqdJ8gFopmQr4NGw": {
    "date": "8/17/2014",
    "text": "Great ambience on a Saturday night.  Food was better than expected.  The meat platter appetizers were the best.  Fish n chips, mushroom pasta, burgers were good.  They were our of the beef pie.  Service pleasant enough.  It's definitely go back for the fun.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jgQCGTkitewsSspiZiHy5Q"
  },
  "ZOKOO2_1Hbn6dZPfKb0kcA": {
    "date": "4/19/2011",
    "text": "As the sun shines down on London it's important to find places to sit that maximise your intake of vitamin D, or is it E, I don't remember the since bit but I know it's good for you. So in the hunt for this, a group of friends and I headed down to the George Inn to sit in their huge courtyard. If you weren't already aware of it, the George Inn has something of a history behind it and is even mentioned in some one Shakespeare's work - I'm just dishing out the facts today aren't I?! As you take a seat and join the many other Londoners and tourists look up and you can almost imagine the wenches hanging off the balconies in those days. \"Cam on darlin', buy me an ale and I'll show ye a merry time!\" Something like that anyway. But yes, I like this pub, they have a wonderful summery house rosé but it will cost you over a fiver for a glass. This is a tourist trap, that will be why.So if you want to eat and drink in an proper British pub with some serious history, you really can't go wrong with this place.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "bT8R2hpsTwfDfxls7hZ03Q": {
    "date": "1/31/2011",
    "text": "I'm a history nerd so I'll go any place where someone famous and brilliant used to hang out. Especially if they are dead now (that sounds kinda wrong but you know what I mean). The George Inn was visited by Shakespeare and Dickens so that alone makes it worth having a pint at. When you enter the courtyard you are definitely taken back a few hundred years. The area has cobblestones throughout with benches and heaters if you want to stay warm while you have a drink and/or smoke in the cold. The pub feels very old as well with low its ceilings. Service was fast the last few times I have visited, so no complaints there.The one complaint I do have is with the bathroom. The men's bathroom is outside and that alone sounds dreadful when it's cold outside. The women's bathroom has gross old carpet in it. Carpet?! Yes, carpet. Grim.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "M3jx1i97WRVMK8x4JiKt6A"
  },
  "Urm3AktiDxMwDUstOVrmqA": {
    "date": "10/12/2015",
    "text": "A rough diamond hidden amongst the bustling streets of London Bridge - The George Inn is not just a traditional British pub it is THE TRADITIONAL BRITISH PUB. Found within the care of the National Trust, the George has been around since the 17th century and although you can feel it's history as you walk in any of its numerous bar areas, what I really love about this place is that it's not a tourist trap. It's clientele are majority friendly locals, and those just looking for a decent British meal and a good pint.Pre warning - this place is always always busy but there's plenty of room both inside and out (outdoor heaters - woo!) and the staff are never short of a smile, I insist that you visit if in the area....And grab a pie and chips while you're at it. The chips are insane.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ry0REo4iHIAdZv42csbxWQ"
  },
  "TcQSjWK9jY8Ha413rCn4mw": {
    "date": "8/6/2016",
    "text": "Great place for a drink In the courtyard when the weather's nice. Our table of 6 agreed the food is positively abysmal though disgusting & cold. Sent one meal (a burger & fries) back and they clearly nuked it. So many amazing eateries in London Bridge - don't eat here!",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vSPoK41InV_xppNS6p-NpQ"
  },
  "q6JJ-k9vXZW8rFgj8IMnuA": {
    "date": "12/18/2015",
    "text": "This place is really quaint. It is very traditional pub and has a lot of history. The food and service is what you would expect from a pub. I had the burger which came with fries. Generous portions and decent price. It's really close to London bridge tube station so very easy to find.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMxAeLHIklIgwyJ_gDdBCw"
  },
  "otUcDOUG0AKbbmy05ENfGA": {
    "date": "7/22/2016",
    "text": "Great place to hang out and drink on a sunny day. The outdoor area is surrounded by three buildings which give decent shade and keeps it cool. The food wasn't the best but for a pub it was pretty good. They have a large selection of drinks though. Great place to go to.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "QTvixJ_7AFt17ARgtTITYQ"
  },
  "HOn7wNT6VXTMFso2c7bblA": {
    "date": "9/24/2015",
    "text": "I have been to The George Inn a few times, it is definitely a place to visit if you are sightseeing in London as you'll get to see an example of an old Inn which for visitors will be exciting. The courtyard and bbq is great and quite tucked away from most pubs in the area.I have had a party here in the past and it wasn't great, not sure who's fault it was, but the food was booked and ordered but when it came out was missing a few dishes, portions and such. The Chef had pre cooked everything and were just left on the hot plate in the kitchen to be served up, so people ended up paying for half a plate. This was last year, so not sure if things have improved, just a warning if you are booking a party here.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4MPHYYKWmnPJbfUlJxGrg"
  },
  "dya-gNbsqXq4vTFCBeHMbQ": {
    "date": "7/26/2015",
    "text": "Came here specifically to watch a friend play a gig in the outside bar area. It is a nice pub, been around since the 1600s which is pretty cool. A very popular place with lots of families with young children. And even a massive sheep dog hanging under one of the tables. Atmosphere was great but decided against eating here as it was quite pricey for the amount you were getting, the portion sizes looked quite small.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DQCInTG86-90yqr0lGNa9Q",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DQCInTG86-90yqr0lGNa9Q/o.jpg"
      }
    ],
    "user_id": "gHLVai_3dr0OV1Qrgkglug"
  },
  "l1xuR5HlTNdIQ3TWhUSESA": {
    "date": "7/24/2016",
    "text": "Historical pub with fake grass and lots of tables with umbrellas in the courtyard. (Probably just for the summer)Was a great location for a drink and chatting with friends on a sunny afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "VKX4sN0lwmjrhkbhl4fV4g": {
    "date": "8/25/2014",
    "text": "Been coming here for years and only just realised that I haven't given the place it's own review, sharp as a tack me !!Few minutes walk from London Bridge station, has a lovely courtyard that is a lovely sun trap in the summer time, in the winter it's lovely and cosy so you can have the best of both worlds. Looks lovely inside and the outside is easy on the eye too, especially when the sun is setting.As a part time ale drinker, they always have a different selection on tap to keep you on your toes.If you are looking for a seat, you need to get here before the office bods get out of work around 4ish, especially on a Friday as it got packed, but it's a lovely way to spend an hour or two before you jump on the train.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pOoHW-xZBKWFtBhD1kvmzA",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pOoHW-xZBKWFtBhD1kvmzA/o.jpg"
      }
    ],
    "user_id": "EL9a1CZKTpDtTcYD5g_0zg"
  },
  "VlYa46WxSSr5LR5QcYNNJA": {
    "date": "6/6/2015",
    "text": "Here in London I have learned that people are very friendly and outgoing ... Restaurants and bars are always busy but here in this particular place, locals gathered eat and drink wile making friends !! Lots of cultural diversity and everything in the same place, they also have a nice band that plays very very nice music  but not only that, they are very good singers !!! love this place",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0QBVLYsiDhq9KddB0PKUTQ",
        "caption": "Photo of The George Inn - London, United Kingdom. Love the ambiance",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0QBVLYsiDhq9KddB0PKUTQ/o.jpg"
      }
    ],
    "user_id": "BFk615bizY_IB_8N5_eYcw"
  },
  "fKB8W4OGkq8uUoYbrpt5GQ": {
    "date": "11/5/2015",
    "text": "A wonderful pub opposite Borough Market. The atmosphere is magic and the food is very good. A bit pricey thought!I spent for a burger and a coke almost 15 pounds.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-OQwQ5-OJoUQNMEo49b-BA"
  },
  "psBylvY4bVxKzHrvWy770w": {
    "date": "7/27/2015",
    "text": "This is one of the nicest spots to grab a pint after work in a sunny day. Quite Central because close to London Bridge, great view of the Shard, kitsch benches in a large courtyard and affordable booze. My advice: come \"early\" on Friday especially on summer days, because at 6 it's so packed that you may wait a bit to be served. And speaking of drinks, give the cider a try and let me know what you think :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSxH9fkLaUke9zXRVk3i1w"
  },
  "qnnF4jL_AB3QPTjrb_fmlQ": {
    "date": "7/3/2016",
    "text": "The George is a classic English gastro pub serving the traditional British bar fare.  It features outdoor seating and copious amounts of history.  Give serious consideration to the Sausage and Mash -- tasty sausage over mashed potatoes and a deep gravy with shallots.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D4eVxqcWuh4xjAz8kUguVg"
  },
  "Lp8uOHEHdsQu7IU-9xMM9w": {
    "date": "9/22/2013",
    "text": "Went here for a quick lunch stop while seeing sites in the area. Needed a place to sit down, grab a diet coke and a quick snack (chips, of course!). Decided to go someplace historic...and this was the spot. Beautiful weather and friendly service...a mixture of tourists and locals.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_DdzQJi6W0Leg0hAZPc2YA",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_DdzQJi6W0Leg0hAZPc2YA/o.jpg"
      },
      {
        "img_id": "wYG3g8ml105mKWSX-ItTdQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wYG3g8ml105mKWSX-ItTdQ/o.jpg"
      },
      {
        "img_id": "_NakaKgv3xTi7rwoHzfuoQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_NakaKgv3xTi7rwoHzfuoQ/o.jpg"
      }
    ],
    "user_id": "6d74xseomEdQZ7u5CIkh9A"
  },
  "nz3lwXJSE2b626HwaYHP1w": {
    "date": "6/7/2015",
    "text": "Opened in 1676, lots of original structure still in place and furniture.  Ice cold beer, great experience to say I've been there.  Must visit!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kKiIJ-OroNH1oUtv_-V3eQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kKiIJ-OroNH1oUtv_-V3eQ/o.jpg"
      }
    ],
    "user_id": "zzYF64kl9es4c16fv68OIQ"
  },
  "svA9Iihb_S5KLi0nX20ueA": {
    "date": "4/28/2013",
    "text": "Came here after work for drink and catch up with old friends.  The bar gets very busy and it was at least 5 deep in at the bar ALL night.  Which is a little frustrating having to queue for at least 10 minutes every time we wanted to order.  Nice place to go in the summer time as there is a lovely seating area in the square.  There is a lot of seating inside however this gets full quickly and therefore noise levels can rise also.Don't to there for intimate quiet drinks!  But great for a lively catch up place during the evening.Food available along with bar snacks.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hh8yDWUP9-hqRZZu_Xbf2Q"
  },
  "RpQEgbWuGuknxiDP1CWspw": {
    "date": "6/19/2015",
    "text": "A real London pub, historical and very much for locals. Food was ok, drink was ok... The experience was a blast! Fun, friendly serviceTook a group of 16 and we had a great time. Not typically visted by tourists, great prices",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B98CA1BO-gzMp0D1wV6rTQ"
  },
  "sfnvKZ6q5Wpehcb9rxooqw": {
    "date": "11/30/2010",
    "text": "One of the great features of this pub is the location.  It is located just a very small walk away from the Borough Market and a great respite from a day of eating one's way through a market.  The pub itself is just so quaint and cozy.  It reminds me of how really old it is.  The pub itself is made up of several little rooms and an upstairs where the kitchen might be?  Or it could be another dining area.  I noticed the cooks running up and down the stairs getting ready for the lunch rush.  The interior is full of rich wood and plaster walls and wonderful smells coming from a kitchen.  It is a great place with little nooks to sit and  I spied several business folks hanging about having a pint and a chin wag.  The service was very attentive at the bar, I didn't even get a strange look when I asked for a half pint... I know, what a wuss.. it was early in the day and what I was looking for was a warm meal.  I got the chicken special and mashers.  Both did the trick.If you are heading out to have a few pints in SE London, this would be a must stop along the way.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fjSWLLrQyVKOw0Q6mGZ2KA"
  },
  "ObaXdqfk9B0t3awbpf5i2w": {
    "date": "12/17/2015",
    "text": "Really liked the look of the pub and particularly the outdoor area! Would love to go back in the summer for a drink or two...We went for dinner and it was fascinating going to a pub that's been around as long as this one. However we weren't sitting at a great table (right near the kitchen exit) and the staff are very friendly but very busy.The food was alright, nothing great however. I would definitely go there for drinks but probably give the food a miss.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1aFAPUVrY1abbfo4Dcu4Q"
  },
  "Qum0i7dNEVwaVUTE3ioW3A": {
    "date": "7/21/2012",
    "text": "The remaining galleried inn in London (Southwark, near Tower Bridge) dating back to 1676. It's quite the institution and well worth making the trip if you are in the area. I distinctly remember trekking up the street to find it. I remember the interlocking rooms, the low ceilings and fireplaces creating a romantic atmosphere of the past time. I was in awe just soaking in the fact that this place has stood for over ...336 years!  A humbling reminder of how little you are in the grand scheme of things.While I was reflecting on this, I also noticed that 10 minutes had passed by wondering how the serviced worked here (2nd day in London and first time in an authentic British pub). After finding out from my table neighbour, I went to the bartender and placed my order. When he asked me what table I was at, I had quite the blank face....I had to go back and take a look at my table number. Oh so embarrassing. Wonderful thing that absolutely no one was keeping score, or cared!I ordered half a pint of ale (enjoyed it) and the Sunday roast. It was a bit dry, if I must be honest, but I was hungry and quite enjoyed it. Could I eat that regularly? Maybe not.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "--Qh8yKWAvIP4V4K8ZPfHA"
  },
  "Y1EcCiUNKWOdggtf3a_U8w": {
    "date": "9/13/2014",
    "text": "Every time I come here someone mentions that this is the oldest coaching inn in the UK, or London or something, I dunno.I came here the first time and there was a band playing great jazz so I stayed for a while (slowly getting drunk), which was great because it was a Saturday afternoon.I usually walk past here on the way home and it always looks really busy especially on Thursday and Friday nights. The service is ok, but the smell of stale beer inside is kinda a bit grim so perhaps a good clean/dose of febreeze might be helpful here?!Again, decently priced drinks (Im obviously just used to ridic Canary Wharf prices), and good atmosphere so, I've already been back here a few times :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8JeTyxMflxvCvKlvWQIb9g"
  },
  "B-CjF1mn0aOeZdjHCi1WLg": {
    "date": "8/11/2017",
    "text": "Fun local watering hole with traditional British food. Conveniently located with short walk to Globe Theater.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F80sp8mreu9uVzjMnPSK6w",
        "caption": "Photo of The George Inn - London, United Kingdom. Outside area",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F80sp8mreu9uVzjMnPSK6w/o.jpg"
      },
      {
        "img_id": "Y4vka1cat5eUrXEUiHADDQ",
        "caption": "Photo of The George Inn - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y4vka1cat5eUrXEUiHADDQ/o.jpg"
      },
      {
        "img_id": "hckd0qXZe8FGlzjMCzH57g",
        "caption": "Photo of The George Inn - London, United Kingdom. Beed and ale pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hckd0qXZe8FGlzjMCzH57g/o.jpg"
      }
    ],
    "user_id": "Cr82q-OCs6-A4LyGzjf7pg"
  },
  "HExsvl91Y_hIzighP16IwA": {
    "date": "6/11/2017",
    "text": "Cool little courtyard with tons of picnic tables. There are actually multiple restaurants/pubs that use the yard, so make sure you're sitting and ordering from the right places. I ordered from the Southwark and sat at the tables by the back. Cool vibes, lots of young professionals, all around good time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJpvRrk04rb4rgWtMXaPUQ"
  },
  "6HVB2n_rMawd9gSPaC3R-Q": {
    "date": "8/6/2016",
    "text": "Came here during the hottest week that London has probably seen in a long long time and of course after work it was packed to the brim all over the lawn. Luckily, there was virtually NO ONE in the restaurant upstairs, which allowed us to have a table by the window where we got the benefit of space to ourselves AND some outdoors air. The restaurant was doing a burger and hot dog special for the months of July and August, so of course as the resident American I got a fun burger with mac and cheese on it (don't worry, I also got an order of mushy peas as my token British dish). I definitely recommend - it's close to the station and good! If only the bathroom were cleaner...",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lxaBfy6snoCHWtN5KPrZtw"
  },
  "I-TKgMFa7H8a5I34WyBgrg": {
    "date": "4/6/2017",
    "text": "Awful experience here. Went into the bar area with no seats anywhere and in the restaurant the waitress told us basically to go away because she was busy. When we were seated she did not come to greet us for at least 15 minutes while seeming to avoid contact with us altogether. And since we were being given that type of vibe, we decided to take our business elsewhere.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jHS_tvtLjcIPSeiJa_xCtw"
  },
  "WhYA0OO2doEn0vGiiizdnQ": {
    "date": "5/22/2015",
    "text": "Enjoyed hanging at this old bar. Couldn't believe the inn once housed Shakespeare amd Dickens. Truly an honor for me. Had a few pints and some laughs here with friends. Food is available in the restaurant if your hungry and the staff here is very friendly.Ill be back.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I29bopV3ftDw2EJh7bSKMQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I29bopV3ftDw2EJh7bSKMQ/o.jpg"
      },
      {
        "img_id": "e2bYzp0HUWVfJh9USxvq6Q",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/e2bYzp0HUWVfJh9USxvq6Q/o.jpg"
      }
    ],
    "user_id": "3jZ7W7ZPXBCX7opq1IUdPw"
  },
  "RuKj4asPl6sZVnTBS20Dtg": {
    "date": "5/8/2016",
    "text": "Awesome food and atmosphere, best thing on the menu was the fried chicken burger and the mac n cheese!Definitely try it out if you are in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OrwO9ILx-4KbvURCSLnr9A"
  },
  "V2kcoceytxAhsH-3Aj6nnw": {
    "date": "10/22/2017",
    "text": "Nice little spot, especially for the history behind it, which we came for. Enjoyed a couple of pints in the middle inside bar, then went outside to enjoy the patio since it was a nice warm October day. Weren't many people here, maybe about 8 all together, so it didn't have that convivial pub \"vibe\" at that time. It was a work day, and we were there at an odd time, so that's understandable. We ordered the buttermilk chicken sandwich to split, and it was quite tasty, but not the best I've had either. Still, it a nice little spot to appreciate the history around you. I would like to come back again when the place is more busy. If you're looking for that historic pub atmosphere, with really good food and a nice view as well, I highly recommend the Mayflower.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQZeAn5q1FT8bisYjxAPjw"
  },
  "neO_JiRZhp_wClR2165Lgg": {
    "date": "4/27/2016",
    "text": "What a great Bristish pub! I was in London on a business trip and a friend that lives in the London area took me to this place. It seemed so very authentically English. I had the scotch egg. Yum. And an American style, local IPA. Yum. I'm bummed that I'm not in London to make another trip there this week!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "858nJ2LedRZDZRqb-7uoVw",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/858nJ2LedRZDZRqb-7uoVw/o.jpg"
      }
    ],
    "user_id": "ockLCPvDsk2X1KXhwadnhw"
  },
  "QL9xlpRTcSUJ1JOtT6Yipw": {
    "date": "4/25/2017",
    "text": "Great outside space with plenty of tables and umbrellas. You need to place your order inside with bartender and they will bring your food/ drinks to the tables. Very friendly service.Great place to have a drink outside while catching up with friends!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkuI-9N8quIMsTejUe6Ndw"
  },
  "Jq4BPuEGCe899Jav-cnR8A": {
    "date": "7/16/2017",
    "text": "Ordered two Sunday roasts for lunch. The beef wasn't great and the Yorkshire puddings were like rubber. After finally cutting into them, we saw one had mould growing inside. Really poor. We complained and were given a full refund.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SaX3kpgDUSu2bdkiqwWWgg"
  },
  "0X7ZX6OpISDCmSegmsrP2w": {
    "date": "8/16/2016",
    "text": "My friend brought me here because he knew I liked 1. beer and 2. old things. Imagine my joy discovering that I was going to drink delicious ale in a National Trust building! BLISS! It is a beautiful old building with plenty of stories to tell, tucked in a back alley. The range of beers is great so even if you don't get 'old things' there's still something here for you. The sun was shining so we were able to sit outside in the court yard but it would have been equally pleasant tucked away in the beautiful old wooden pub on a cold winter's day.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RnJwaPy00Ca1nUGM9uWQ2Q",
        "caption": "Photo of The George Inn - London, United Kingdom. Even Shakespeare drinks here",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RnJwaPy00Ca1nUGM9uWQ2Q/o.jpg"
      }
    ],
    "user_id": "ofKha-HelPGDR3Hh3xtWSw"
  },
  "xc1YlwV7atF68WAzQSSVGA": {
    "date": "8/12/2017",
    "text": "Good cold beers and ciders on tap. Bar can get quite busy. Nice open patio area outside with picnic style table and seating. May be difficult to find seating during peak hours - we saw many people standing around waiting for a seat to open",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoCDacpr-b6etykixWHr1w"
  },
  "_3PGMZLKi8h1C71AqmX1Sg": {
    "date": "8/11/2017",
    "text": "Excellent traditional British food... Comforting beef and ale pie, fish and chips, and sausage and mash. For our last night in England, it was the perfect meal! Fun bustling atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HjaCPHihUpM3J8EBHiGfcQ"
  },
  "od1P8Tmkw_3CbEQyDv2pWQ": {
    "date": "4/21/2016",
    "text": "There is a lot of history with this pub. Someone should write a book about it.... oh wait someone has!The book (Shakespeare's Local) was what introduced me to The George, an original Coaching Inn though now much reduced. As pubs go it's busy, popular and has a lot to recommend it, however the food and the loos are not part of that.  The multiple bars, especially the Parliament bar, really add character to the beautiful pub balconied pub.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RDIHIE0Fawi_T553O-PT_g"
  },
  "wlhQ_ktx6HQ_PQyvb8ctBw": {
    "date": "6/7/2017",
    "text": "This was a classic British pub with pub food. I had heard this place was highly rated but it seemed average compared with other pubs I've tried. The service was also a little slow (but that may have been since we came in after lunch rush). All in all, if you haven't gone to a pub, definitely give it a try. If you've already gone to one, don't feel like this place is a necessary stop.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJH-Il2cD7nXge4kNMrQGQ"
  },
  "yCQg8gstz8TPWls0HmDbvw": {
    "date": "4/11/2015",
    "text": "The George used to be a bit of a secret tip in the days before Southwark gentrification.  No longer secret, and a lot more crowded, it's still one of the nicest settings for a pint (or glass of wine).  Especially on a warm Spring night when the courtyard becomes one of the best beer gardens in London.  Staff cope exceptionally well with the large numbers and queuing at the bar is a lot less frustrating than it could be.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "4e_PsE0eLTinhdReYh30fw": {
    "date": "3/15/2015",
    "text": "We had the best time here! The setting is historic, the welcome warm, the menu tempting and did I mention the lovely drinks on offer?Service was great, helpful and charming, and the time passed too quick.Come and have a wonderful time!Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TY_Nb_e5criDA0yfhW6TQ"
  },
  "HlXt1F8c6yNue_kcqVmKzw": {
    "date": "2/5/2016",
    "text": "Situated close to London Bridge station, just down from the Thames, near Borough market, this is a very popular ye olde English style historic 17th century pub. As you enter the large courtyard you are immediately struck by the  imposing Tudor façade of The George which just oozes history! The building itself is on three levels, complete with balconies. Inside, it is very warm and cosy with a choice of numerous rooms in which to relax and enjoy your drinks. However, The George is at it's most popular in the summer when you can sit outside in the courtyard and soak up the historic surroundings. We often visit The George as the final stop on a crawl which begins on the Southbank in the Founders Arms and continues with The Anchor and the Old Thameside  and until you reach London Bridge.If you are into historic odle English pubs, The George is an absolute must visit!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wetju9YTk-xCgoT1ZKpyJg"
  },
  "UnzIGBsPnJQtTumi5Jmb2A": {
    "date": "1/6/2016",
    "text": "We stumbled into this pub after running from Clapham North to Borough Market to deserve our fattening food intake for the weekend. However we forgot how crowded borough market can get so after staring at various food stands from 50 feet away, we decided to find a pub to take care of our hunger.The George is about 3 minutes walking distance from the market so it is very convenient. You go inside and find yourself an empty table, memorise the table number and go back to the bar area to order your drink/food. We had grilled chicken sandwich (sandwich deal of sandi+side+drink = £9.75) and a burger (burger+side+drink = £12 - I think - ). Sandwich was filling but dry (I'm just so damn used to thick, juicy, dressed up NY sandwiches), chips were thick and great and my glass of vino just cleaned all up perfectly. Great old pub atmosphere with good service and lots of food options.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rA-NSah4y8oSBOOoX27sg"
  },
  "Ibzl2nH-xrdHrH-SWhRJYg": {
    "date": "11/25/2016",
    "text": "Wonderful wonderful food with friendly service! The atmosphere has been beautifully preserved to give the feel that your eating in a time capsule from Dickens's time!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nDu2B3q5RO6amD9j3mAeWA"
  },
  "fQPtggUhkEdIql-p-0ryfw": {
    "date": "11/8/2018",
    "text": "Fun pub.Nice cobbled courtyard.And great character.Beer is ok.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "crfwfzWqZChlsXIyeJgQBA"
  },
  "nKkmclr80IapztAYSLEstA": {
    "date": "10/12/2018",
    "text": "Great old space, lots of history and character.Beer selection and food were mediocre, and even if you've grabbed a table, you have to go to the bar to order. Which would be fine except it's hard to open two doors when holding three beers; or at least, I had trouble making the math(s) work.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Z-povofP-her5ElltKejQ"
  },
  "bJVjsXK7k1-NfGI7JuocBQ": {
    "date": "5/23/2018",
    "text": "Great spot! Incredibly crowded outside but lots of seating indoors. Order at the bar. Cold beers and cider and tap. Had fish and chips and the Mac and Cheese and both were excellent. Would recommend to anyone who has the time and patience to deal with the crowds.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QWRS3dLYcErBh4DXC4vXiw",
        "caption": "Photo of The George Inn - London, United Kingdom. Fish & Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QWRS3dLYcErBh4DXC4vXiw/o.jpg"
      },
      {
        "img_id": "WYj1OC2DbqGoDoC-9gMrPQ",
        "caption": "Photo of The George Inn - London, United Kingdom. Mac & Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WYj1OC2DbqGoDoC-9gMrPQ/o.jpg"
      },
      {
        "img_id": "K_57nYTub7eUv-uAiiXeEA",
        "caption": "Photo of The George Inn - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K_57nYTub7eUv-uAiiXeEA/o.jpg"
      }
    ],
    "user_id": "hFRUCqIDetkjAXaHmPMrZg"
  },
  "RueDQRHKtOhPAF6Xh2NdpA": {
    "date": "10/24/2018",
    "text": "Cute Pub/restaurant. Tried their Fish and chips. Very happy with my choice. The fish was battered and fried to perfection. We got lucky enough to hear their local band play. Turns out they are just a bunch of musicians that get together every 3rd Monday of the month and have a jam session. Loved every second of it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c6XLswM0AzHtl4u3V-qbNQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c6XLswM0AzHtl4u3V-qbNQ/o.jpg"
      }
    ],
    "user_id": "Al7jz5T1w-y88zq13r77_g"
  },
  "_QcfcGi-iLQ3VbS7hClwnQ": {
    "date": "11/19/2018",
    "text": "The worst Sunday Lunch I'v ever eaten.The parsnips were raw & the beef was inedible .It's a shame because the staff were very pleasant.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57NKpkItNQz11_h0e8RgFg"
  },
  "hSFdDmst-wu8hf87vUtsrg": {
    "date": "8/20/2018",
    "text": "The George Inn was recommended to us by a local. We were looking for a place to watch a World Cup match. We are so happy we followed his suggestion! During the World Cup, they had a huge screen and lots of tables set up. The place was packed but the atmosphere was intense and so much fun! So cool to drink a beer and hang out in a bar that is older than the United States!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pn_hxXZyzicPvcRpcgDWSg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pn_hxXZyzicPvcRpcgDWSg/o.jpg"
      },
      {
        "img_id": "rmnbOrG3lXfOjy-Ybk87Wg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rmnbOrG3lXfOjy-Ybk87Wg/o.jpg"
      }
    ],
    "user_id": "HJaYsdPtQq3qZNeH5P__Wg"
  },
  "V5QNhd2hbrhdP0vqrZ8z1g": {
    "date": "10/5/2018",
    "text": "We came here for dinner and drinks.  The locals are all in the courtyard, while we had dinner in the upstairs dining area.  We tried the tomato soup, fish and chips, and finished with the Sticky English Toffee desert (a la mode).  The food was delicious, the service was great as well.  We hit the jackpot for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GYE5YsH_meWXQDdqTf6AfQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GYE5YsH_meWXQDdqTf6AfQ/o.jpg"
      },
      {
        "img_id": "7fcIOAY2MMXOa5UsI0mSsQ",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7fcIOAY2MMXOa5UsI0mSsQ/o.jpg"
      },
      {
        "img_id": "r0YDa7FhkyTFVsd9xVKrUw",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r0YDa7FhkyTFVsd9xVKrUw/o.jpg"
      }
    ],
    "user_id": "bY6VH2NmDhkdiJmzjgdF8Q"
  },
  "iJYfNpdpaVFj-0d2FOKneA": {
    "date": "10/19/2018",
    "text": "London landmark. Huge beer garden. Great atmosphere. Swamped with people but a spot for everyone. Chances are if you have a friend in London, they'll ask you meet them here for at least one beer.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q3rJtTId7C-ky4PZquuDVw"
  },
  "wxZ-uQk6vscHBl_sF6QxmQ": {
    "date": "4/10/2018",
    "text": "Set way back in space and time from the craziness of London Bridge and Borough High Street, this place is a welcome refuge and an easy walk from the London Bridge Underground station. One of my favorite meals in an 8-day UK trip. Yes, it's a Greene King corporate operation now, but still has plenty of history and character and family-friendly. We were blessed with good weather that Saturday, so we enjoyed our lunch on one of the many picnic tables out in the beer garden courtyard patio. Busy, but not so packed that you couldn't find seats. At least one friendly local offered to share. I don't believe that there's a kids' menu, but my son enjoyed his giant hot dog and my daughter liked her beef pie, which was served with traditional tasty roast carrots and parsnips. I liked my £5.95 fish finger sandwich- good value. Note your table number and order in the Main Bar. Pleasant service from the food runner.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "obnSWeGIYsjedPvy0_0Jag"
  },
  "Tssf7SGKKNMSv1uHPlzZmA": {
    "date": "8/29/2017",
    "text": "Great London pub food! We came here on our first night in town to enjoy some traditional pub food and drinks. About 10£ for a pint and large glass of wine, very reasonable. Fish and chips and meat pie were about 12£ each. I had the pie which had a really nice flavor inside and the crust was outstanding. I got chips instead of mash and only ate a few but it wasn't because they weren't good. It was just a lot of food. The veggies were also very tasty. I liked that there were carrots with the peas to add some more color to my meal. My husband said his fish and chips were really good. He finished everything on his plate... great sign! (Tip: If it's your first time to a pub like this, you order you food and drink at the bar and they bring your food when it's ready.)",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "b4aEc0bDFMcRtQFlqXJ9Dg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b4aEc0bDFMcRtQFlqXJ9Dg/o.jpg"
      },
      {
        "img_id": "kqApYD8_cyoJRs48vHrruA",
        "caption": "Photo of The George Inn - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kqApYD8_cyoJRs48vHrruA/o.jpg"
      },
      {
        "img_id": "qPdbGCiGKySaUon6gzVLjg",
        "caption": "Photo of The George Inn - London, United Kingdom. Beef pie in front and fish and chips in back",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qPdbGCiGKySaUon6gzVLjg/o.jpg"
      }
    ],
    "user_id": "fm2npkf_1BNUPRZQbvJA0Q"
  },
  "ITAT6BM8rGgtfgxoDVZu6g": {
    "date": "10/24/2018",
    "text": "Love this place!  It's been 17 years since I've been here, but happy to be back at one of the oldest spots in London!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_OJn02sp82PUtVDp1ONJRg"
  },
  "I2VtUGmQTOHFJrqZ0WyRzg": {
    "date": "10/16/2018",
    "text": "Fish & Chips were really good, the batter was seasoned really well which was great! They even had Franks Hot Sauce.  It was pretty busy but the wait to get your food and drink was fast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B-mdTOte4BYWl16gXS5mvA"
  },
  "wyfJxa-el7MugR5vuB5ZRA": {
    "date": "6/8/2017",
    "text": "This was probably my least favorite meal in all of the ones I had throughout my 9-day stay in London.My friends and I had just finished taking some touristy shots of the Tower Bridge, and we were looking for a dinner place that was close to our hotel. Yelp told us about the George, which had really great reviews. Plus they had Sunday Roast, which was something I wanted to try while I was in the UK, so we decided to venture on over. There wasn't a wait for our group of 4 on a Sunday at around 7.I ordered (as might have already guessed) the Sunday Roast. The meat was dry and chewy. My friend ordered the same thing, but well done - so I can only imagine the workout that her jaw had. My other two friends ordered something else, I can't remember what - but they were drenched in the same gravy as the Sunday Roast, so everything ended up tasting the same. The atmosphere seemed to have that authentic pub experience - old with some charm. Unfortunately, the food was just old, without any charm.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EgIGIx6QJVWBfRaT2YBRVA",
        "caption": "Photo of The George Inn - London, United Kingdom. Sunday Roast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EgIGIx6QJVWBfRaT2YBRVA/o.jpg"
      }
    ],
    "user_id": "hwSSM8Jn29dXRW4ym-roDQ"
  },
  "VrjXZW_SNmlRWf0vnogSUw": {
    "date": "10/22/2017",
    "text": "The roasted cauliflower on the roasted cauliflower sand chili salad is not roasted. And the chili is a bit of fresh sliced. But the rest is a Mediterranean selection that goes well together and is very satisfying. Surprised but pleased. Dip your cauliflower and cucumber in the hummus and babaganoush and feel healthy  but then don't viscously attack the bangers on your kids plate or you kind of blow it. The kid had sausage and mash and the kale and multi colored carrots elevated it a bit. Enjoyed the French white by the glass and the ambience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UA772HRAVr6zP5kT7bVw4Q",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UA772HRAVr6zP5kT7bVw4Q/o.jpg"
      },
      {
        "img_id": "_BpJoksGkfGF0AWNqOlNNA",
        "caption": "Photo of The George Inn - London, United Kingdom. Roasts on Sunday only!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_BpJoksGkfGF0AWNqOlNNA/o.jpg"
      }
    ],
    "user_id": "R1o7fAUOM_CWKBcQY8bbkQ"
  },
  "62Y4R3PMjjWP4seziRfbWA": {
    "date": "5/15/2017",
    "text": "My wife and I were in London and our first stop for a meal was The George. I ordered a beer and the fish and chips.It didn't take too long for the meal to come and they had quite a good selection of beers. I ordered the house ale, which was quite good.The fish was super hot and the chips were good as well. I haven't had fish and chips in 15 years probably, but I had to try them in London.I don't need to order them again, but they were good for what they were. The added malt vinegar was awesome with the dipping sauce.The atmosphere adds an extra star for sure and the service was great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m3xcp_A8mcqzpOQrQxyUdA",
        "caption": "Photo of The George Inn - London, United Kingdom. Fish and Chips with a George Ale and crushed peas.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/m3xcp_A8mcqzpOQrQxyUdA/o.jpg"
      }
    ],
    "user_id": "-uglef88WEwkI6UlAqwO0Q"
  },
  "cA9QwLKFiP4j9RhjizKg4Q": {
    "date": "7/3/2017",
    "text": "The George, feeding giants since who knows when! The meals at this place were massive!! And not that good, to be honest. Maybe giants aren't fussy.I ordered the roast of the day. I'm thinking it'll be roast meat and roast veg with gravy and Yorkshire pudding. What I got was two very dry and overcooked steaks, skinny fries and peas mixed with stewed cabbage all covered with gravy. I went and asked for my Yorkshire pudding and didn't bother complaining about the rest of the food. The YP was nice. My hubby and friend both got fish and chips. Again, enormous meals. The fish was nice but there was far too much batter. And again with the skinny fries. It's England people, I want proper chips!! As an Aussie living in the USA, I don't come to the UK for more fries.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-y2-MbdJebSaTKmY1QxHw"
  },
  "3K1svDlUTdKr_l79n6CmZw": {
    "date": "11/2/2016",
    "text": "The George was sort of hidden, but not really. At first, it looked like an alley, but the alley led to a large outdoor space with picnic tables outside of the actual pub. The pub itself had plenty of tables and space, but if it's a nice day, I can definitely see one sitting outside to enjoy a pint or food.We visited in the late afternoon on a Friday and the place wasn't crowded, but there was a good amount of people inside.still. As with all pubs, we ordered at the bar after taking a seat inside the pub. We ordered the Fish & Chips and Shin of Beef & Ale Pie.Fish & Chips The hand-battered cod was served with deviled whitebait, crushed peas, bread & butter and chips. The cod was good, but nothing extraordinarily memorable, but it's not to say it wasn't flavorful still. Same could be said about the chips. As for the crushed peas, it was an interesting side as I had never tasted it before. The texture was almost like mash. The deviled whitebait was a nice palette changer, as even though it was fried, it had a very different flavor than the cod.Shin of Beef & Ale Pie (Served with potatoes & fresh vegetables)In summary, the beef and ale pie was a pot pie. The presentation was very nice and it was served on top of a healthy serving of mash and fresh vegetables. The pie was really good, filled with plenty of beef. The vegetables and mash underneath went really well with the gravy from the pie.In a very busy area, I had no regrets about going to The George for a lunch pit stop. The spacing was plentiful and the food was good. That's all we could have asked for since we were starving prior to our stop here.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0awB8njRFrfVjZrStB5ETw",
        "caption": "Photo of The George Inn - London, United Kingdom. Interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0awB8njRFrfVjZrStB5ETw/o.jpg"
      },
      {
        "img_id": "WorpfN7UJKrCsqsvfCkuCg",
        "caption": "Photo of The George Inn - London, United Kingdom. Exterior",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WorpfN7UJKrCsqsvfCkuCg/o.jpg"
      },
      {
        "img_id": "6stKI_eFfwYjGhUAXRAY7A",
        "caption": "Photo of The George Inn - London, United Kingdom. Malt Vinegar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6stKI_eFfwYjGhUAXRAY7A/o.jpg"
      }
    ],
    "user_id": "m1AUK8tI19tUT_N3DMkyIQ"
  },
  "zUlLkuYT2suW3gFUgbEP-Q": {
    "date": "4/12/2018",
    "text": "My credit card was skimmed and used fraudulently the next day. I know it was done here because it's the only time I used the card in a long time. DONT USE YOUR CREDIT CARD AT PUB!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v8E-FR2EyD3JwRGsupjz_A"
  },
  "ARE8h5jWs3z3F1CTawvkOw": {
    "date": "1/24/2016",
    "text": "Came here for a Sunday Roast. Really awesome little courtyard. Unfortunately the food was average at best. Large amount of good quality meat but the veggies and sides were very lacking. Both in quantity and taste.I think this place is better for enjoying a drink in the traditional English surroundings . Not a place to come to for food alone.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RxxOFondPh2hPu_ggEqk-A",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RxxOFondPh2hPu_ggEqk-A/o.jpg"
      },
      {
        "img_id": "tz5L_5lCdFOvkAiAgzwaxQ",
        "caption": "Photo of The George Inn - London, United Kingdom. Roast Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tz5L_5lCdFOvkAiAgzwaxQ/o.jpg"
      }
    ],
    "user_id": "7Ro3UwVc4m264CckiwZLgA"
  },
  "n0x6xsJpTNH_dds2iHnl1w": {
    "date": "8/4/2018",
    "text": "Came here for our first sit down meal on our visit to London with the kids. Everyone loved it. High quality food, good drinks, WONDERFUL ambiance. We were all sad we couldn't fit another trip here into our visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjknwpdjsxOol4fFGs-mAw"
  },
  "iWhpelUCEbNzBes84vLCcA": {
    "date": "11/21/2008",
    "text": "A lovely beautiful pub full of history. This place is absolutely great after you've spent a day at borough market (2 minutes walk away) and then come for a few quiet pints. Particularly good in summer with its big courtyard.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "uUjATmAxJKiVh0cOEYA0pg": {
    "date": "8/5/2008",
    "text": "This is a great pub in the summer where on a hot evening you can grab a bbq, bottle of wine and a space on the kerb (because inevitably by the time you get there the tables will have gone). Nice hustle and bustle without having to inhale the pollution, nestled down a cobbled alley way this is a pub you almost won't find. Drinks are reasonably priced and staff are friendly. Beware of tourist groups who come to visit on walking tours - this is one of the oldest pubs in London and still retains its Dickensian charm - they will fill the bar, take lots of photos which, if drunk, you will try to invade the back of and end up being immortalised in, perched on a German Grandmother's windowsill for all eternity!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8cxKCnQmg8tLcZ5f9fYtZA": {
    "date": "8/4/2008",
    "text": "We're not fussy people, just happened to be in the area on a Sunday night and fancied a decent glass of red wine in nice surroundings. This beautiful old coach inn has suffered from an unsympathetic modernisation, perhaps so the managers can better cater for the crush of rowdy med students who descend on it every night. We sat under the harsh glare of spotlights in an extension. Wine list was terrible - there was only one wine by the glass, and for £3.50 we were served miniature bottles of very poor quality red wine (as if you were being served on a plane). We were served by a surly skinhead who refused to enter into any discussion about the wine (although he did taste it and make a face), and was later seen laughing about us with another customer. We were forced to buy an entire bottle of red to get anything drinkable. The whole experience was so unfriendly and sad that it wrecked our night. We later wrote a letter to the National Trust (who are the leaseholders). It's a real shame that a place of such historical importance has been turned into a moneymaking pub with no respect for itself.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "79Qszbm_-_X2bwqU5PzJUw": {
    "date": "8/24/2009",
    "text": "I have to agree with the reviewer below, they have changed it and not all for the better. Sunday again it's time for South Bank pub crawl with a slight diversion for The George Inn. It has some good ales (it did have a lot of good ales) and it's the people drinking there gives it the atmosphere which makes you want to come back. Staff, oh dear. All I know if their were having a drama on Sunday (kitchen staff) which also effect the bar and floor staff. Saying that our chips were good. This pub will still be visited by us but in the hope that something could be improved. 4 star for the pub, 3 star for the drinks, 2 stars at least for the barmaid who made us laugh while the others around her were flapping",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2i9glMHmFtR4azaWZ75nFg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2i9glMHmFtR4azaWZ75nFg/o.jpg"
      },
      {
        "img_id": "yuCk6pri4mW3RtlSPdPJAg",
        "caption": "Photo of The George Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yuCk6pri4mW3RtlSPdPJAg/o.jpg"
      }
    ],
    "user_id": "yHHsILb0yT8zPzYt0JoHcg"
  },
  "dDvgWVsseKxQ8IeLW5qH2g": {
    "date": "2/25/2011",
    "text": "I really enjoyed it here last Wednesday. It was pretty busy inside but the outside seats were fine due to the patio heaters. Outside is the best part anyway as you get to look at the building the whole time, that way you can't forget you're getting drunk in a little bit of history",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W7Ffly0OLK48wdyHPK3olA": {
    "date": "6/10/2009",
    "text": "It's happened. Really I always knew that it would do, but it still hurts. Some one in a marketing department (I don't mean to sound scornful, but I am so that's how it comes across) have done The George. Proper computer screen tills, the beer has taken a plummet, the staff have lost their manners and the menu. dear Lord the menu! A pub that used to be a bastion of good, old-school pub food has sold out to poncey ciabatta's, Mediterranean wraps, the same old knackers you can find in any third rate pub. And maybe I'm being unfair. Maybe I am the only person who likes a ham sandwich with a handful of crisps at lunch rather than a cherry-tomato-and-mozzarella-style-cheese sandwiched-between-gently-toasted-ciabatta-rolls, or a bit of home made pie, or for the bar man to gladly ask chef if he can knock up a bacon sandwich rather than flatly intone It's not on the till. Can't do it. Seriously. What is the difference between a beef-burger and an Angus Rump Patty? (About £3 the dearer, and 6oz the poorer apparently.) And I want it in a burger bun not a friggin ciabatta! Look, it's still an alright boozer, great place to go for a drink and a chat. The building still has bags of character, and I would rate it at 3 stars were it not for the fact that it used to be SO much better and more pleasant. I'm thoroughly depressed. I'd go for a pint and a sandwich but I'm scared the Porter will have gone robins up by the time I get there. ---------------------------PREVIOUS REVIEWRapidly elevated to top 5 in my favourite pubs in London mental list. Spacious, friendly, good food, reasonably priced, good provenance (if it's good enough for Mr. Dickens), admittedly very busy later on in the week but surely that's testament to it's merits. Nice house beer as well, if you like that kind of thing. One of the few pubs in town where you can get what I describe as good, honest, straight forward pub food.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-WmFedZeAA8FRObi2unH4w": {
    "date": "5/26/2009",
    "text": "My husband took me there on my birthday in April just gone.The food is nice and beer is GRREEAATT!!!!We had a BLAST and there are always lots of people there.Me and my friends are planning to go back there for another lash at the beer tap.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UIjP98Z7MbYooa-dw7TPWg": {
    "date": "11/14/2007",
    "text": "This Inn was apparently frequented by Charles Dickens. It is said that he even managed to publicise one of his books-The Little Dorrit in the pub.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "oSvh6jfKH-cCTnROzIqXDQ",
        "caption": "Photo of The George Inn - London, United Kingdom. iNN",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oSvh6jfKH-cCTnROzIqXDQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "gqtvi9E3inB0GHSaErgl2g": {
    "date": "1/20/2008",
    "text": "Amongst the oldest pubs in town, this place has the reputable names of none other than Dickens and Shakespeare on its score of former patrons and carries the mood and atmosphere of old London with dignity. Set around a large courtyard just off Borough High Street, this is a three storey building with balconies that were for performances in the courtyard back in the older times. Amazing real ales and fantastic atmosphere, the slightly hidden aspect of the place keeps the clientele interesting and has managed to gather an unusual group of regulars. My son is one of them. Really good place to sit outside in the summer, far removed from the noise of Borough. Can`t recommend enough, but keep your eyes along Borough High Street if you have any hopes of finding it.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "GvOuLz-lO_ekM-3vN9t1wQ": {
    "date": "2/19/2009",
    "text": "This is a lovely tucked away bar with tons of outside seating. Very busy in the summer. It is down a cobbled street and set back from the road.Lovely to meet group of friends but the bar is quite small so you will be waiting a while to get your drinks.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fNPhPwwxifgrIVNUFh7QBQ": {
    "date": "4/28/2008",
    "text": "The best thing about a house party on a Saturday is couch surfers and residents gathering on hungover Sunday and engaging in good chats over copious mugs of tea. The topics of conversation? Anything from the previous night's housewarming gifts (out of a skip), to is cat the opposite of dog? and of course, best places to go in London. Gordon's on Villiers Street was mentioned as a favourite London institution and after visiting the George Inn, pre-party, on Saturday night - I'd put it in the same cateogry. This is just one of those pubs that oozes England and history out of every floorboard and beam - but not in a Shakespeare gift-shop tea towel kind of way. Tucked away down a little alley off Borough High Street the outside is overflowing with tables perfect for summer drinking. I was attending a party and a room had been hired, so I ducked in to find a glorious little space with beams and wood and tables, a darling little hatch which serves as a bar and plenty of smiley party goers. Friendly staff completed the package - the next sunny day there is I'll be back, and hopefully outside drinking Pimm's! There I go, being English again",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Hj4KuNx7p_NDefGob_iZmg": {
    "date": "11/8/2012",
    "text": "4-5£ per pint. interior is nice but the exterior is even better - lots of picnic tables, heaters, a great view of the carriage exterior, and you're sitting right below the shard! perfect place if you've been walking along the river or just ate at Borough Market!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7Q3Rurtpv7Bmy6htBpL7Q"
  },
  "HcC0nd_FJis9V5zdfJtL9g": {
    "date": "4/13/2008",
    "text": "Hidden down an alley, not far from London Bridge tube station and Borough Market, the George Inn claims to be the last London 16th-century balconied coaching inn. What it certainly is, is an old, wooden, multi-roomed pub. Plenty of real ales on tap, including one brewed just for them. There are nooks and crannies everywhere, from stools to tables to benches. There's a dining room upstairs, and some function rooms. The kitchen serves a good menu. There are lots of picnic tables in the cobbled courtyard for outside drinking when the weather is good. The men's toilet is in a small outbuilding across the courtyard. The George Inn is often very busy, and if the weather's not good enough to allow people to spill outside you're likely to find yourself standing. Still, despite being in a busy part of town its location down the alley separates it from traffic and noise. It's definitely worth a visit.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rUllZyU9qHc6eolVlpwZuA": {
    "date": "1/27/2009",
    "text": "This is a very traditional and very old pub in Southwark! One of the oldest galleried pubs in the UK. Not far from Borough Market or Southwark Cathedral and a great place for a lunchtime drink and sandwich or pub meal. They serve real ale and also have good pub food. It's down a small alleyway off Borough High street so watch out for it!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1EMZkoDfnGIVYv4ffgZOGw": {
    "date": "3/27/2008",
    "text": "Hard to find if you haven't been there before but well worth it. This gorgeous pub is only ruined by the hideous buildings which have sprung up around the courtyard.Get an outside spot and just look at the historic exterior or cosy up in the quiet side bar where there's a gas fire burning in winter.Slightly odd that you can't buy wine by the glass but even more excuse to dispense with restraint and just buy the bottle.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0CwFDM2DN9gG506bF9InQw"
  },
  "eBQAyZ7WsMQpoZnkplW3kQ": {
    "date": "11/21/2008",
    "text": "I love the George. Or, rather, I love its big courtyard and the bar which opens through a hatch to the outside, so you don't need to battle in to the main saloon to stock up on drinks for the smokers. The building itself is low and dark and oozing with London history, but you do need to position yourself quite carefully so that your view of it isn't ruined by the modern office blocks that make up the other three sides of the courtyard. As it's slightly further away from the city than haunts like the Mudlark or the Anchor, the George has that slight air of secretiveness, and you feel rather clever for knowing about it, but visit in mid-summer and you will find you are not the only Londoner who knows about its outdoor charms and leaded-window delights.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4jTBIFwj_EmX4qRd_zsDoQ": {
    "date": "9/12/2008",
    "text": "Great pub for sitting in front of the fire and getting trolleyed with friends. Apparently you can even hire the back room for not a lot or maybe even nothing.Best for after a couple of hours elbowing your way through the hordes at Borough Market, it's always sweet relief to settle in with friends and while away some time.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Di5VVg3D5hemMQtDnav5mA": {
    "date": "2/5/2010",
    "text": "For me this is a summer pub as a large seating area outside in a courtyard off the main road. The building from outside is fantastic, you can imagine the horse and carts being parked outside whilst the passengers went inside for a pint. I don't like the inside as much, find it a bit dark and cramped. Food here is good though but a 3 star from me as more enjoyable in the summer.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nV_pS5NHeOoZfFtcyeebUQ": {
    "date": "2/28/2009",
    "text": "Lots of old, rickety charm to this place. Very traditional feel to the place. No background music, friendly bartenders, and a hearty house ale. Gent's toilets are outside across the patio.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RwFMbKklySC3yxf5M4y85Q"
  },
  "IEr4OhMOwzavW_v1hMJHxw": {
    "date": "1/30/2009",
    "text": "One of the oldest pubs in London, very traditional, cool place.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WJDwYaMrZ0-HQDPXDs5Svw"
  },
  "hMh7ee_oEln8vaPL4TiO2w": {
    "date": "1/19/2012",
    "text": "Brilliant fantastic venue , shame about the toilets that are shut, the bars that are not open and the minority of staff best described as unhelpful Still it's a brilliant place to go into l, so many rooms to explore. Shame the only bar still open had run out of all but two ales. Maybe it needs better shift managers",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3U9s2bIYFQWgVnkMSENnKw": {
    "date": "5/22/2009",
    "text": "The George is hands down one of the best pubs in London, tucked away just off the the busy Borough High Street, it is a popular watering hole for many people throughout the day. Historically it was known as one of the many haunts of Charles Dickens. The staff are very adept, and the bar is well stocked with a wide variety of drinks to suit most tastes. All in all, a brilliant pub.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "px94cW3segjB6xG5WJ2SQw": {
    "date": "11/29/2008",
    "text": "The George inn is a wonderful place to go summer or winter! great space outside and the customer seem to be very friendly.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}