{
  "oL-6myws3JEGNAO2Qz1VUg": {
    "date": "11/25/2008",
    "text": "Situated at the heart fo Camden, you are never far away from some off the wall celebs at this trendy hangout. It is usually my first or last stop of an evening if Im North of the river. I looks out across the canal and has a great feel to it. The dj's always play some great tunes, and if you can get past the sometimes heavy queues for the bar, it seems this place has it all. Would recommend Saturday instead of Friday night if you go out there though, as you get a much better mix of people there.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "kVuzglpuKW85LTP9dmspYQ": {
    "date": "11/10/2007",
    "text": "The garden is a fairy-lit wonderland with the best gas heaters in the land and an adorable wooden booth to escape into while the inside of this pub is stuffed with subdued Camden trendies. Try the wasabi penuts if you dare.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "aVMlylc3wbPN7RwGicqOAw": {
    "date": "11/28/2008",
    "text": "Ate here recently with my girlfriend who absolutely loves this place!Granted, it's a cute, shabby chic little hideaway which itself is charming; coupled with the fact that it always appears to be busy (I've been turned away once before)...but it wasn't as fantastic as i was lead to believe.The service was fabulous and our waitress really cared about our tastes and whether we were enjoying ourselves, so big ups to service here.I had excellent Fish and Chips, but their take on mushy peas was disappointing. Minty and dry. Also odd was their take on bruschetta - garlic bread with some sliced cherry tomatoes and slices of prosciutto - something I would make as a late night snack at home. When i eat out I want to eat something I can't be bothered going to the effort of preparing!Not the cheapest place to eat either, but the ambiance, decor and service make me love it just a little more than I should.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "R-ArupIMhbAqvcQ5pVTvtg": {
    "date": "7/14/2009",
    "text": "Well known, well loved. The Lock Tavern is a valuable member of the Camden drinking establishments so as a result it is often full to the brim, overflowing, chocka-block. If you're looking for something other than the relaxed, hippy Camdenite (more 90's than noughties I know) or 'I'm still crying over the Libertines being over' Indie crowd than the Tavern is the only place to venture. Having said this I can't guarantee that you won't be served by a lank haired, skinny jeaned depressed individual (really- haven't people heard that it's NOT true not washing your hair for 6 weeks results in it cleaning itself???!)- there are a handful that make you feel so very clean and straight-laced and who abuse you with a look when you don't plonk a penny or pound into the tips jar. All this aside it's nice. Desperately and grubbily cool but nice none-the-less and good fun. Word to the wise in case you haven't already figured- don't go drinking there if you are feeling a little vulnerable. Or Ladies- if you are over 5ft2'' tall and in suffering a week bladder- you'll have problems closing the doors on the toilet cubicles when you sit down.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WroMjAgVXXFCbkkA7NjOjg": {
    "date": "11/14/2009",
    "text": "An all-time favourite.  I don't want to post how brilliant this place is because it'll become too overrun with people, but I can't help myself.  They play the best music too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADAYyLhq7qOjNpW3reyvfA"
  },
  "wSyFtQ42xAe03ZwYhkB-HQ": {
    "date": "6/28/2008",
    "text": "not a bad pub great selection of drinks freindly staff (a huge bouncer!) and overall a great place for a quiet relaxing drink!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "q1i3avKD314VfpXepanlgQ": {
    "date": "1/16/2009",
    "text": "I love the Lock Tavern, but you have to get there early (and by early I mean absolutely no later than 5pm) to get a seat in order to eat, and that's just during the week. The food is excellent, especially on a Sunday when they serve a mean roast, and quite reasonably priced, as are the drinks. I particularly like going to the Lock Tavern in the summer, when you can sit outside on the roof terrace and look over at the old stables.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "f9Qth1wksHZbOUY1-gdcVg": {
    "date": "11/18/2008",
    "text": "Only been there during the day, but a really nice bar, the line ups at night looked really good. one of the bar staff looked really miserable, but i think it was her im too cool for school rock n roll look, either that or because she had not eaten for 2 weeks.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oOA_OtlK2q6iu_5r54Fw0A": {
    "date": "12/12/2007",
    "text": "I live in Chalk Farm and love coming here for its legendery square pie.If you ever visit here then don't leave without tasting this.Sunday is always a good day to visit because they always have a live band playing and it could be indie or pop but its always good.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7nW9uJ2MIvTQfkeZJEYVDw": {
    "date": "8/19/2008",
    "text": "A very cool bar that looks like a big studio flat.It is situated to the left of the Camden Lock up the cobbled path past the market which is usually very busy in the daytime.As you enter there is the bar to your left and in front of you, you have the choice of sitting in the high wooden chairs or low sofa's placed opposite each other.There is a large wide wooden staircase which takes you to the upper seating area which consists of more sofa type arm chairs in lines opposite each other or again there is the choice of sitting with a table and set of chairs.The vibe is very chilled, and relaxed with dim lights.There is also a very big outdoor seating area with large wooden bench tables and big red canopy's over them with touchsensor heaters underneath them.The prices are quite average for wine and beer or the usual.Cocktails were about £5.00 each but I have to say are very very good. (Try the one with strawberries and vodka!)I definitely love coming here and it's right near camden high street so it's alway easy to move on if need be.:)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3Xh0OhahgheeRVwmjpeYoA": {
    "date": "2/15/2011",
    "text": "Always a pleasant place to be .. afternoons lazing on the couches or nights watching free gigs upstairs. Good food (gone downhill since a few years ago but still good!) ... pretty and friendly bartenders and overall nice vibe. Smoking area is most loved in Camden with nice amount of heat in the winter.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "5Kebl7jgp3DN7usy_pz_Zg": {
    "date": "5/31/2012",
    "text": "Really great pub, good vibe, awesome terrace nice people and tasty beer",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qd_egTB-5xgByruuMip93w": {
    "date": "11/10/2008",
    "text": "Described by Time Out as a north London institution, this is the perfect place to while away summer days sitting out atop the large roof terrace, or in the large beer garden. Consistently busy with locals and passers by who chance upon the pub, enticed by the amazing outside areas and the tantalising menu of Square Pies available to munch on. DJ's / Events happen every Thursday - Sunday, and this is the perfect place for a large group to sit, eat and drink. Sunday's see a great menu of roasts and pies (Square pies are available along side a great menu during the week as well as Sundays), and main courses are around £7 - worth it for the quality. Prices are your Camden usual (£3.40 a pint), but come summer when you're sunbathing on the roof you'll be very happy.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DfI6PndL0xdUOsI-rEH1-Q"
  },
  "BIRj9VxgAUCa4ko3N2wl5A": {
    "date": "12/13/2008",
    "text": "The Lock Tavern is a little bit set apart from the rest of Camden but that hasn't stopped a host of people choosing this place as their drinking hole. In the day, when it is closed, a foreboding corner of blackness. When it is open, two floors inhabited by so many of the Camden Town Marketers - the people who shop for ALL of their clothes in Cyberdog and other Goth holes. Look forward to meeting alot of people between the ages of 18-24, and look forward to gazing at their mohawks when they're not looking.. from behind their back...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UG_hriMI8ZFkZFDOT-96ig"
  },
  "9_xaTqc1e62CCLxuuhhsTQ": {
    "date": "2/19/2012",
    "text": "The Lock Tavern is my joint favourite pub in Camden (with the Crown and Goose sitting alongside it). It caters to everything  there's a lot of outside space at the back and upstairs; whilst downstairs is your traditional pub, the room upstairs has DJs most nights and they never charge you to go up there. The staff are nice (with the occasional, to-be-expected, surly one thrown in) and the roasts are good. At £4.10 for a pint of Symond's, it is one of the more expensive pubs, but to the detriment of my bank balance, I just love the atmosphere of this pub, whether for a night out or a quiet drink.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CQrl3Pd7nxGgdPyP2qbzDg": {
    "date": "11/30/2008",
    "text": "Packed full of a generally young crowd of cool kids, the Lock Tavern is one of those pubs you can't help but go back to.   They have a good sized beer garden, outdoor heaters during the winter, and with plenty of seating, although be prepared to fight for a table during the busy times.  With regular gigs and DJ's, there is always something to lure you in.  Consistently jam packed at weekends, the buzzing atmosphere makes it a good choice for a raucous night out.  Chill out in the beer garden or head straight to the dance floor to join the eclectic mish mash of the young, and old(er) beautiful things.Yes it's yet another trendy Camden hangout, but its one of the good ones, just be prepared for the crowds on weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2aNLypxAxXuj_PQTfjdT8g"
  },
  "oQswRevjjgx2eO50tBQhAA": {
    "date": "1/3/2008",
    "text": "Excellent pub just by the canal as the name suggests. They had Adnams Broadside on tap last time I visited, although I'm not sure if they rotate or not. If not, it's a solid choice, although not really a session beer at that strength. It's a pretty laid back affair, with some comfy seating, fairly dark and a bit dirty. They regularly book famous DJs to play here which is fairly novel for something like a trad pub. Food wasn't on on New Years Day but I will go back to try...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mqtQQbqFUwGqQivcmOy1zw": {
    "date": "1/20/2008",
    "text": "I really like this place as a spot to relax in, given that the lighting and canal-side feature give it a great ambience. They have some amusing live acts occasionally, the one man band type, which is fun. The drink prices are great, you can get a good cocktail for about £4/5. Oh and don't forget it's got sofa's. they say you can tell a pub by its sofas, very comfy!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I9kCkMPwBFMHUYc4OTr3PQ": {
    "date": "11/14/2011",
    "text": "Love gettin a quick gin and a ciggie before headin back into the stables x",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yshWxebvLzkN5sf_UlA5xQ": {
    "date": "4/9/2008",
    "text": "Have been here a few times, and my view on the place changes each time.Fell in love with it on a Friday night, but couldn't wait to leave on a Sunday afternoon.The interior of the pub on the first floor, is classic pub-rock-casual, with plenty of skinny indie boys in stovepipe jeans and girls with blunt fringes and red lippie draped over sofas and leaning on the bar.Upstairs it becomes more like a bar and is often so packed you head straight outside. The outside deck is good for groups of people if you can find a seat, however I especially love the ground floor courtyard, feels just like you are having a drink at a friend's house party!What I love about this bar: The GORGEOUS boys who work there; the reasonably priced drinks; the beautiful arty crowd; Friday nights at the barWhat I don't love about this bar: the embarrassing behaviour of 'laddish' boys on Sundays; crowds on Sunday afternoon!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MmQJJyQo5m5xnOaeVzp9Rg": {
    "date": "9/21/2008",
    "text": "A great place during the evening, but as soon as it get dark, i would advise you to get out as it will almost definately be jam packed. When i mean packed, i mean really packed. I once had trouble even getting to the bar it was that bad. the only thing you can do is wait and sweat it out or go into the outdoor area for the smokers. the outdoor area was actually really cool. This place must have something good about it as there are always queues outside. I imagine that it has a loyal following. that or the music is really good. i, however, didnt really feel anything too special about it to queue outside in order to get in, especially since there are plenty of other great bars in the area.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9JDg2ouU1OP7n9t9iu8_jQ": {
    "date": "6/19/2010",
    "text": "went there for drinks on a friday night.  the crowd seemed like your typical camden town crowd - pretty eclectic.  they stayed away from mainstream pop music and played stuff that was a little more retro.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wtc-_ItNFE7GCddADBR34Q"
  },
  "bK4UOWsbUcI5Iz62J3ODuA": {
    "date": "10/22/2007",
    "text": "I think this pub was once, or still is, part-owned by the DJ John Carter (can anyone confirm this?) I could imagine this is so because of the (very) trendy crowd in their 'scruffy thrown together Camden' look. I love their style and appreciate the effort they put in; I like people watching here, it's lots of fun. Put that together with great music, especially on Sunday afternoons upstairs, a tiny room where the DJ tends to be sat at a table in the room, the decks almost in danger of having someone's pint over them. They seem to be at the forefront of music with their bookings, and attract a dedicated clientele (A queue forms Saturday eves / late Sunday afternoons!) As well as a terrace upstairs, there is also a beer garden out the back. Their food is good here too; try bangers and mash, or pie and mash or their fabulous Sunday Roast.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "L2sX5vL38b0VeoA4pUAxGg": {
    "date": "6/21/2008",
    "text": "Really decent pub with a great range of drinks. Several Eurolagers including Baltika and two real ales, including broadside! There are really nice leather sofas downstairs and the dance floor upstairs is pretty decent too.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0upMkbobgyQlJVJJw446xQ": {
    "date": "11/15/2008",
    "text": "Food here is excellent, good choice for veggies (and meat eaters!). Well priced food, though drinks can be a bit pricey in comparison. Only a slight problem with the staff who appeared to ignore that fact that our food was waiting to be served and continued to wait at the bar instead of bringing it. Not unfriendly though.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xXyXOSOXEkinYkuxkBk_qQ": {
    "date": "11/1/2007",
    "text": "This is one of my favourites. The alcohol is reasonably priced (by London standards) and they serve good food too. The outdoor area has been decorated really well recently, and the heaters make it just about bearable in winter! Upstairs they have a DJ playing, so it can be quite noisy if you want to chat. The downstairs area is really nice - comfy sofas and big tables. This place is perfect for birthdays (although you can't reserve a table in advance), for a girl's night out, or just to catch up with a friend over a bottle of wine.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AkOtMUEMlzkgioAcvL2I8A": {
    "date": "6/18/2008",
    "text": "Time Out rates this as 'a London institution' and like with most of their definitions, they're pretty much spot-on. The Lock Tavern is one of those places that should be swanky, and even is a little classy, while managing to hang on to a clientele that can throw up some great characters. Like last time I was there I ended up chatting to these two girls from Camden called Ruby and Gwen who were about to go on a blind date with two guys (one named Loyce?) and were getting drunk on champagne they had stolen from Sainsbury's. See what I mean? Brilliant. Combine this with really good bands that you get to see for free, and you'll understand why this pub is gonna be around forever. If I have one minor beef, it's that their cheapest beer is £3.20 per pint (The Amstel).",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QRj8TVjIrTw1mwVJsOtQ9g": {
    "date": "10/4/2008",
    "text": "The Lock Tavern is a well known bar in Camden that has live music nights and DJ appearances. Close to chalk farm tube stn. the drinks werent a bad price either, but they certainly weren't cheap! It wasnt great, been to better bars but it did look quite trendy and flash. It was quite cool, but the loo's stank! Was an average bar, nothing amazing, although the dj was good. The food was quite nice too. the music however, wasn't great!! It was pretty average actually",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "l3RWcN1gmK8NBQVKqckkKw": {
    "date": "11/30/2008",
    "text": "Don't be fooled by the name, The Lock Tavern although near is not actually located in the Camden lock (but check out Lockside Lounge which is!). Located at the Chalk Farm end of Camden, The Lock Tavern is best descibed as 'shabby chic'. Attracting a varied and eclectic crowd it's great for people watching, and the food is good too. Live music and/or DJ's most night, (and with Camden to explore later in the evening) you're always guaranteed of a good night. This place, with its large Beer Garden out back and roof terrace really comes alive in summer.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Qp6A3V3L4Zdii1SfDos8Ng": {
    "date": "1/20/2008",
    "text": "One of the great things about this pub is the different ambients. First, the actual pub in the front, with comfy sofas, the bar and dim light that adds all the coziness to it. Then, the great beer garden in the back, where you can smoke while you drink and not freeze - they have heaters, yay. Go upstairs and - surprise - great dj's and the odd indie band, always new fresh music in this laidback space. Want some fresh air? Head outside and breath in the view while sipping your cocktail. This might be specially nice in summer. Unlikely the usual scruffiness that you find in pubs around Camden, this one has something chic about it. Might be what makes it so trendy.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JGYnBv0mehHQvovvnqPNog": {
    "date": "1/20/2009",
    "text": "Four words: hot staff, hot customers!Lock Tavern is probably one of my favourite pubs in Camden, where I have spent many a drunken afternoon/evening.The bar staff are all ridiculously attractive, complete with great style and same goes for the people who drink there... The music is usually awesome (indie, rock, mod, punk, electro) and they often have bands/djs playing.  There are 4 different parts to the pub, which I think have a completely different feel from each other.  There's the downstairs part, the garden out back (complete with heaters) the upstairs and the roof terrace which overlooks the stables market. I love lazy weekend afternoons drinking cider in the garden or roof terrace in the summer!They have a well stocked bar, with booze including Brothers pear cider (YUM) and bison grass vodka...The food is also tasty, especially the square pies...oh and the gravy...d.e.l.i.c.i.o.u.s. They also do full Sunday roasts (and nut roasts) and the Lock Tav is definitely one of my favourite pubs to be in on a Sunday afternoon!  It can get pretty crowded, especially on weekends or depending on the bands and djs playing there.  There is a lot of seating though, including comfy sofas...tables and chairs upstairs get moved later in the night though on the weekends for dancing!  Woo!  I'd definitely say a friday night spent here is a worthy alternative to a club.Arguably, many an obnoxious scenester frequents this place...but I can't help it, I'm a sucker for people watching obnoxious scenesters...",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "G9PFPTlnblQf32OvyjJEaw"
  },
  "zYcVsyUrRPdssYo7o9dRmQ": {
    "date": "2/2/2010",
    "text": "The Lock Tavern is one of the great Camden pubs, perfectly located to catch you as you walk from Chalk Farm tube and lure you in with the potential of rooftop terrace or outside seating to the rear. One of the busiest establishments in the locale, the Lock Tavern is a hub for trendies and wannabe-trendies, and that includes the barstaff. A decent range of beers and wine are accompanied by a great selection of food - I highly recommend you try a burger if you get the chance. Perfect in the summer and bustling in the evening, the Lock tavern is one of the best establishments in the area.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MkOlI4fQPLDuUAOal1vJ3w": {
    "date": "7/27/2010",
    "text": "I can't believe I've been hanging out here for almost a decade. Yes it's full of media types, and yes it can get a little over crowded but that's all part of its charm - and if you frequent London you'll be used to the crowds anyway. My favourite thing about this place is the outdoor seating and the free live music. At night fairy lights decorate one of the outdoor levels, (and yes it's not so romantic with plumes of cigarette smoke everywhere, it's still an awesome place and great for people spotting). The beer is also pretty well priced for London and I found that they had loads of friendly staff so queueing wasn't an issue either. I might not live in London anymore, but it's still the first place I choose when I hit Camden for drinks. Not the greatest place for a date, but alright if you're meeting buddies for a few drinks before a night on the town.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "m17xixbDUZ6K40qirwsaIg": {
    "date": "11/6/2008",
    "text": "The Lock Tavern is by far one of the most arrogant and scenester pubs there are, and yet I cannot help but love it.  I first discovered this pub during the summer when Magners seemed to dominate all other drinks and the Lock Tavern terraces were the perfect location to indulge in these ice-filled pints of cider.  The menu is also worth a mention as I often give into their chicken and leek pies.  The Lock Tavern often works together with the 'Adventures in the Beetroot Field' crew and they usually sell tickets for their events.  The downstairs area is rather chill, whereas the 1st floor hosts the DJ's and live acts.  The best time to venture here is probably on a Sunday when they host the Blogger's Delight event with guest DJ's, live acts, or their very own resident DJ, Casper C.  They fill the room with balloons, and although it is a bit tight upstairs, everyone attempts to show off with a few dance moves.  This is usually an all-day event but it gets so busy you have to get there early.  Week nights are a lot better for quiet drinks or dates, and I would generally stay away on Friday or Saturday nights as the queues are crazy and the music is not so great. The waiters usually look modelesque and there are few urban legends that state the manager does not hire anyone she deems too unattractive (but this is probably a lie).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "O3CZ6ePrFYCNKks3xCaaMQ"
  },
  "BC7u-aFfQ-7_UtzpeCjDZg": {
    "date": "12/23/2008",
    "text": "The Lock tavern is where I discovered my love for bison grass vodka and apple juice. Admittedly this is a love I often neglect, I try out other new drinks, flirt was the potential of Dissarono on the rocks, but like any true romance bison grass and apple juice is always waiting for me when I see my senses.I must point out that The Lock Tavern also offers other drinks, in fact they have a very well stocked bar. I love to visit this place on a Friday night when they've got a great DJ playing to dance the night away. They also have an awesome outside area which is great in the Summer. My friends and I have been known to pass a few Sunday afternoons out here, drinking in the sunshine and eating one of the Tavern's great roasts.My only problem with this place is, that like anywhere good, it is often too busy to tolerate. Arrive here at ten o'clock on a Saturday night and you won't be able to move for people. This makes queuing for the bar a bit tedious and being too squashed together can generally dampen an evening. Taking this in to consideration, while I would recommend it here I would have to suggest that you time your visit well.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F7o19Xwgh-Qtg-8zgkFNiw"
  },
  "sLf46ZFForuOWKJnKKk7rQ": {
    "date": "11/24/2008",
    "text": "Lock Tavern is a cool place for cool kids, hosting a variety of DJ nights and new bands showing off their skills. The place is a little pretentious for my liking and I much prefer their other pub, The Amersham Arms, in New Cross, the vibe is much more chilled out.The food is good and pubby, drinks are averagley priced for the area. I would avoid during weekends as this is when the more school aged kids take over, thinking that they are the bees knees. However, on a weekday is it a cosy hang out, and in the summer the terrace is pretty cool. I seem to remember that they do great deals on Pimms. Well you can't go wrong with that, can you? If you are a HSP like myself, then try to avoid staring at the annoying people in there, there seems to have been an increase of late, and you will just end up getting irritated. Try and find a corner and nurse a pint with a friend, have some cheesy chips and you will be just fine!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4IBcucqWoetv1A4Mzigvw"
  },
  "sgEUBPBiUuBkKsIouBnDiQ": {
    "date": "11/8/2008",
    "text": "The Lock Tavern is a bit of a cool hang-out for the Camden kids, and while I like it, I don't LOVE it. Set over two floors, with downstairs being relaxed and upstairs allowing people to get their dance on, with different DJs and acts most nights. They served some delicious, hearty British grub and drinks are an average price.The kids are a bit younger and get a bit chav-tastic on the weekend, queues can be decent and bouncers not-so-decent.  Weekday nights, though, are a great time to head into the Lock Tavern and escape the Winter chill.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "MDwtxUkTreClwnhHuwTtFg": {
    "date": "11/4/2008",
    "text": "Although the Lock Tavern is occasionally in danger of believing its own too -cool- for- school hype (is there a place in Camden that doesn't?), this place has more than enough redeeming features to warrant a visit. The Lock is arranged over 2 floors. The bottom floor is filled with insolent young things sprawled over battered sofas and a DJ in the corner. Outside in the garden are the smokers - there are usually more people out than in. Upstairs is another room, DJ section and a large roof terrace with about 5 large tables that overlook Camden High Street. There are also a couple of heaters out here, and the tables are covered by patio umbrellas, so you can be up here in most weather. The Lock does a full food menu, although when I have come here for Sunday lunch they had ran out of food. Also just because they claim to be 'A Tarted Up Boozer', don't think that you are going to get tarted up drinks. My friend found this out when he asked for a particularly fluffy cocktail and was met with a withering look from the barman. The Lock is known for it's guest DJ nights, and they are well worth checking out. I came here for a Late Night Tales set dj'd by Nouvelle Vague which was brilliant. If you want to check out the DJ sets I would make sure that you pitch up early because this place can get pretty rammed, to the point that  you won't be able to get in.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4MzgIVS21sK4qr1yfKw_g"
  },
  "1zQoxFpod2wOAwItCUIVhA": {
    "date": "9/24/2009",
    "text": "Granted in you can ignore the preening yet quite attractive bar staff, then the Lock is an ace place to go, probably the best in Camden along with Steels. It's quirkly cool, has a huge walled garden out the back, does a mean roast and Bloody Marys on Sundays and I have seen some really good live bands and djs there in the past. Get there early early early to grab a table though as it gets super busy on the weekends or when they have well known djs playing.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HeNKuIjabjKou_r_8cxXnQ": {
    "date": "5/27/2008",
    "text": "Pleasant decor and good food. As has already been said though, it can get really rather crowded and I've been kept waiting for over 10 minutes to get served far too often. OK, it gets kind of hectic, but there are pubs and bars which I think are just as good in Camden and Primrose Hill where I can breathe and get a seat. Yes, this means I'm a grumpy old man but this place is overhyped in my opinion.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mL-tD1oPICLUd1rgcLsY_A"
  },
  "FxPzhZucAIO3NaaXcbDZrA": {
    "date": "6/29/2008",
    "text": "Pretty good pub all in - does some decent food, fair range of drinks and a garden out the back and is a pretty friendly place. I am slightly surprised about the amount of rave reviews its got though? To me it's always seems good, but nothing amazing - there are numerous better pubs within a mile of here, probably less. It is open very late though which is always a bonus.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "93DMxP3SJZg-BFJT09ebyg": {
    "date": "1/22/2010",
    "text": "Met a few friends for drinks last night and ended up in the beer garden for hours, then dug in to an AMAZING burger and chips before threatening to take a nap at the table due to food/beer induced exhaustion. Yum yum, happy Jo. p.s. the staff were....dare I say it.....really friendly!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TXrsfiSpIDoH06SyVDLZsg"
  },
  "-faxuJ-ObDRt_0O9XO2R0w": {
    "date": "11/17/2008",
    "text": "The Camden Lock Tavern is a great place in a superb location, but that is reflected it the prices. It's packed on a Saturday night after the Market has closed, but does make for a good mid week location if you are planning a party and can afford the prices. It is possible to set up decks for a DJ and have dancing on a relatively small area next to the upstairs bar. It's alao a good place to have a break from the market too. The balcony enables you to look out over the courtyard and market below.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ldyKx59pCACpPqMb9FZKnw": {
    "date": "7/29/2011",
    "text": "I used to love this place but it's grown too popular for it's own good! Everytime I go in there I can't get a sit inside or out, or breathe for that matter.Maybe I'm just getting old, but I think it's mad. Even in the Hawley you can find a seat sometimes.The pub is good, but the crowd is growing increasingly pretentious. I might have to find a new haunt...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHEPjKHIofZL7iergmnrWQ"
  },
  "dvWBozY9RusPQPd9v0fxoA": {
    "date": "10/17/2008",
    "text": "An old fave opposite the Stables in Chalk Farm, this place is always packed. Yeah it's not cheap but it's cool and good crowd and plenty of seating inside, upstairs and out the back -which is a covered area so you don't get rained on when you go out for a smoke. Brilliant.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nm_99X3zWzPiG5bRkGgLHg": {
    "date": "10/31/2007",
    "text": "Just opposite the Proud Gallery is the Tavern. Just picture the scene: sexy bar staff, comfy sofas, catchy sounds, Alex Zane Fruli on tap, yes Fruli on tap: I can count on my fingers the number of London pubs which do provide this service!One hiccup though: increased hype = increased tab. Only a year and a half ago, you could get a generous bowl of homemade chips for £ 2.50, the same misportioned product is just under £ 4 .I'm not being fussy, but we're talking about a bowl of chips!A pint of my beloved Fruli also exceeds £ 4, but that's confessed weakness!Great place to relax though, especially in the summertime with their back beer garden, plus they always manage to partner with amazing party DJs.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qZaKMr1D--TNXAWsZZT4Zg": {
    "date": "11/12/2007",
    "text": "I used to go to this pub all the time when I lived in Camden. I loved going there duing the week with a friend sitting upstairs on the leather sofa sipping Frili (that yummy strawberry flavoured beer that tasts like heaven) they have a cool beergarden thats great for those hot days! I tend to avoid this place at weekends as it's always jam packed! The music is always really good, the crowd = trendy Camden heads!",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "fbXqzjwdtam0zT9S9TxEPw",
        "caption": "Photo of The Lock Tavern - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fbXqzjwdtam0zT9S9TxEPw/o.jpg"
      }
    ],
    "user_id": null
  },
  "73zJklvKbV1ltr6VNpfp0w": {
    "date": "3/16/2008",
    "text": "The Lock Tavern is a very cool place. On the west side of Camden towards Chalk Farm, it has several zones that let you choose the type of cool you need on any given occasion. The front room is large, with several tables. It's almost always busy here, because being down in the front mean you're assured to see and be seen. Go to the back and up some stairs, though, and you can choose a couple of options. Continue on and out the back, and there's a large partly-covered garden with bench tables. Continue upstairs, and there's a smaller lounge with its own small bar - you'll often find a DJ up here spinning tunes in the evening. Continue through that bar, and you'll emerge into a roof terrace, for those who like to drink outside and hear the Camden traffic roll by. Having all these areas to choose from, the too-hip-for-you crowd, and some genuinely delicious food make this a super place for meetups. My circle of friends has often used the Lock as a birthday celebration point. The interior spaces are all painted quite darkly, so it's more on the dim chill-out side than bright and lively.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KEKHjDtH0dlWh5cFnrYswA": {
    "date": "11/20/2008",
    "text": "The Lock Tavern has a very relaxed, chilled atmosphere, especially on a weekday. I really like the decor as well, nice big tables and comfy sofas. However, the service can be a little slow, which is annoying. No one likes waiting 15 minutes for their bill! At the weekend it becomes something else entirely. If you fancy a big night out with good music, and packs of people, then this is your place. All the usual camden types can be seen here, strutting their stuff! And a terrace upstairs for smoking. The food is good but a little over priced.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7rlWnqJNj2xcTJ0_p4GGeg": {
    "date": "3/26/2008",
    "text": "This place has a great atmosphere and even more so on nights when they have live entertainment. I have been here two or three times and i always leave happy. The people who frequent here have money - but it is not a pompous or stuffy place. It is actually very friendly and relaxed.They have a nice outdoors area and an upstairs terrace. It can get quite busy here especially on saturday evenings as it is a really popular place. That being, i would get in early and have some food. The food is ok priced and is actually pretty good. the drinks are ok priced for the area too. The staff are really nice - even the door bouncers are pretty cool - so go and have a good time!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Bvn7AYWYRrbiwh4HDnVsTA": {
    "date": "6/12/2011",
    "text": "Because I'm a crotchety old woman, it's safe to say that I'd hate the Lock Tavern on a Friday night when there's a gig on.But I came on a Monday at 6pm when the place was empty and enjoyed a pint on the roof deck by myself. This was delightful.Great selection of beers, both on tap and in bottle; great indoor and outdoor spaces; quirky decor; convenient location; friendly bartenders - what's not to like?Oh yeah...The clientele.And its own popularity.If you're a misanthrope like me, come off-peak and you'll be well impressed. But, it has to be said, if you lose the ease of getting both a drink and a prime seat outside, this place loses much of its appeal.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "lsXF8fTbmKQd6XQPytH4uQ": {
    "date": "3/21/2011",
    "text": "I came on a Tuesday. And not to a gig. Was that my mistake? I don't know.I don't think I feel strongly enough about this place to HATE it, I just don't get it. Whats so great about it? The drinks aren't particularly cheap and everyone is irritating and rude, and, on the night I went, ugly. Also we had to pay to go upstairs, okay it was for charity but the music was shit. Not even trendy shit. Just shit.I don't get what all the fuss is about... Oh god maybe I do hate it.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "FHDLnvulXX6JtkH2PgVE_Q"
  },
  "0U_gFgfd6vyjf0znhnMVGg": {
    "date": "7/20/2015",
    "text": "Despite their website saying that sunday roast is served until 8pm, we've been told they no longer serve it in the evening. Had they updated the website we would have arrived earlier but this way our dinner plans got cancelled and we only wasted our time.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KonDhdE5KddUdKVsASchXg"
  },
  "GQQMTT41HXrMjQ2PlF71Pw": {
    "date": "8/6/2014",
    "text": "Ok... I've having a bit of a moan but heck... you have to do it somewhere! Turned up at 4pm on a sunday and EVERYTHING had sold out. Ok... I know this means the food is good but they run a restaurant and do this day in, day out... so how can you run out of EVERYTHING by 4pm. Please guys... get your act together.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ivvQVbTK-mVq_tai3bxTVA"
  },
  "8ql8vuNLQvHpbat8ACLS-Q": {
    "date": "12/8/2010",
    "text": "This joint never fails to impress me. What strikes me is their uncanny ability to provide just the right kind of mood to fit the season of the year, day of the week, time of the day. For example, come in on Sunday at noon and there's chilled out music playing in the background and people seated, chatting, and eating the great roasts they serve every Sunday. On the other hand, pop by on a Saturday night and the DJ upstairs will be spinning good, danceable music (last time I went they were playing a great selection of remixes of funk and old school R&B) and the funky clientele is dancing, drinking, smoking outside, and generally just having a good time. With two floors and two great outside areas, this is a great place to hang out, whether you're a smoker or not.If you are looking for a great time (regardless of the season, day of the week, or time of the day) with unpretentious Londoners, definitely stop by. And, of course, being right across from my favourite coffee shop, My Village Cafe, you know exactly where to go for a proper hot chocolate (more like chocolate soup!) once you are done with that tasty roast.I don't tend to give five stars, but this is my favourite place in Camden.Bon appétit / party on. Daniel",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JX2r0N-Pm64bEiESzwiBGw"
  },
  "RlGE-tR2rsv_fbR51JM1Lg": {
    "date": "1/3/2013",
    "text": "again the place smells of hipster, and they have a big selection of beers but staff weren't great help when i asked them to recommend one for me... more suited to the unadventurous... maybe on a saturday night the place rocks as the other reviews suggest... i will have to give it a go...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a0DAQVhenXbJIS2nlQNVGw"
  },
  "xJcvnpld-MmhielIrGcMsw": {
    "date": "11/28/2011",
    "text": "A pretty decent pub, if you can actually get in that is. On Saturday night I turned up with four friends, all visiting from America, it was around 9:30pm and the place looked pretty empty. As we walked up to the door the bouncer looked expectantly at me asked if we had \"regulars cards\", when I told him we didn't he said \" only people with regulars cards can come in tonight\". I didn't ask anymore questions because he didn't look like he was in the mood to argue. We'd arranged to meet some other friends there so we had to wait around outside for them to show up before we could pick a different pub for the evening and while we waited we saw a large number of people get turned away for the same reason. This seems like a completely ridiculous decision because the bar looked completely dead with spare tables and a completely empty roof terrace. Also I've been there a few times on a Saturday night before and I was never asked to show a regulars card. After doing a quick google search there was no mention of this policy on their facebook or twitter and their website is under construction. Despite this incident the pub itself is really nice, with a good selection of food & drink, plus an excellent roof terrace and a cool atmosphere. After spending a lot of time here recently I thought it was one of the best places in Camden to go for a drink or to grab some food. However on the basis of this shitty Saturday night policy which seems completely nonsensical I doubt I'll ever bother with The Lock Tavern again. There are better bars and pubs in Camden who's policy isn't to turn customers away from their half empty establishments.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6qo3DwgDGwa40K7N2m75jQ"
  },
  "i_4Ek85ECyY89pmMnuLjdQ": {
    "date": "6/11/2010",
    "text": "It's a fun place to sit and play \"LATFH\" If you're unfamiliar, google it. The beer garden out back is nice, but be warned, once it fills up, people will get ravenous for seats. You'll be climbing over people, making sure your friends \"sit big\" while you go get a pint... don't dare go do anything in teams of two, your chairs will be gone when you get back. Who will be in it?Some guy with ironic facial hair, neon tracksuit with braces and shutter shades on top of his fedora.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "ZDC8hUvmMgCS8kAD3jEOVQ": {
    "date": "12/18/2008",
    "text": "And the prize for the hottest bar staff in London (although the Hoxton comes a respectable second) has got to go to the Lock Tavern. A beautiful pub with only slight indie inflections - remarkable considering the location - replete with outdoor seating, great food and, it's got to be said again, many, many ridiculously good looking people.I once spotted Samantha Morton in here just after her star turn as a pre-cog in Minority Report but looking oh so sanguinely, casually, Camden. This is the kind of clientele this popular pub attracts: interesting, cool, sometimes self -consciously so, and with good reason. The Lock Tavern doesn't rest on its cool laurels however, the food is grand, the decor lovely. This has got to be the best pub in Camden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q7Gvu8bN8B2qYAebgn38QQ",
        "caption": "Photo of The Lock Tavern - London, United Kingdom. Photograph courtesy of http://www.lock-tavern.co.uk/",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q7Gvu8bN8B2qYAebgn38QQ/o.jpg"
      }
    ],
    "user_id": "j8fZ1NtpZ4ISiNl7xL6rjg"
  },
  "GrGfgNuNJaEodo9c35c1ew": {
    "date": "1/10/2011",
    "text": "Cool pubCool crowdCool atmosphereCool beer gardenAlways a good night out :)Maybe I should try the food next time",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3JRlSzcqx8B-eI_hyPqeQ"
  },
  "o5hbSGTJGDHHfj3YNuadgw": {
    "date": "7/2/2010",
    "text": "I arrived to the Lock Tavern last night for a friends gig. The place is a lot bigger than it seems. There's a beer garden, a second level with a stage, and a roof terrace. The atmosphere was cool, and the place was crawling with eclectics and hipsters. And the sound wasn't that bad either. The sound guy really did his job. But the service at the bar was horrible! My friends and I had to deal with a very rude mustached bar man the whole evening! He'd just stand there sipping his lager like he didn't notice the 5 people waiting to be served! I'd come back, but a little reluctantly.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gA4MiXjhX9iZmqkIgMxWjw"
  },
  "2kni5IqpQH_gO6oiAQ3gwA": {
    "date": "6/16/2012",
    "text": "I just went for a quick drink--it wasn't sunny so didn't check out the deck, and there was no live music going on.  It is exactly what you'd expect from a Camden pub--a bit grungy, a bit loud, a bit Camden-trendy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "EbCQ4-H7U3qz56swLlKmPw": {
    "date": "4/7/2012",
    "text": "Brilliant when the trendy Camden cool scene havn't all decided to chose the same night to descend on the beer garden. Covered in twinkly fairy lights- the smoking area is intimate in the friendliest possible way. Brilliant live gigs and Sunday DJ sesh's. A great pub just beware of the crowds!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8lhOc2ALAqKdmidG7DLFDQ"
  },
  "DDe7D0VkIqnr_amOts1XIA": {
    "date": "3/16/2013",
    "text": "The staff at the Lock Tavern made our day.We arranged an AirBnB flat in the neighborhood, and were told that the keys would be at the Tavern. The flakey girls of AirBnB forgot which barkeep they left the keys with, or maybe never left the keys at all...we still don't know. BUT, the staff at the Lock Tavern (and especially one of the managers) made us feel completely at home while we were waiting. They gave us tea and let us use wifi and the phone. We ordered lunch (which was really really good -- the bangers and mash are bangin'), and they returned the money to us! Incredibly kind, incredibly helpful, incredibly welcoming to three stranded grad students. This is hospitality at its finest. They deserve your patronage. The food is good, and they are good people.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDhZHFoPII2Cmhb4W32I-w"
  },
  "u748MuEywLBeTDxBmNBvIQ": {
    "date": "5/2/2009",
    "text": "Blankety Blank blankety blank.Blankety Blank blankety blank blankety blank.Blankety Blank!\"I wouldn't normally go to all the bother of trying to get a table on a Sunday at Lock Tavern but it was the BLANK that persuaded me to try\"Okay, celebrities... you have 30 seconds....Time's Up. What do you have?Andi Peters...  How about 'Cocktails'?Dane Bowers... All I've got is 'Roof Deck'Susan Boyle... hahaha, don't laugh...I've put 'Trendy Music'June Brown... 'Drugs??'Tom E from Yelp... how about 'Pies from Square Pie company!'Alan Partridge... 'nice men wearing racing-green t-shirt with a chevron action flash'  ah-haa!",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "KXWggMsjK6LLZhYXzc_W3Q"
  },
  "U_J-42wbaopXeN4iFaybxA": {
    "date": "4/14/2010",
    "text": "Cool Camdenside boozer that often hosts DJ sets and whatnot, is always heaving at the weekends and last time I went there Rhys Ifans was one of the clientele. There you are, short and sweet, it's one of many pubs in Camden I'd consider.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "otivCrOuCGwqJD9w5S24lg": {
    "date": "6/13/2009",
    "text": "I tend to automatically dislike anything that is too trendy. The Lock Tavern is potentially the trendiest bar in Camden. It epitomises a Camdenites watering hole like no other bar in the borough. Yet try as I might I cannot help but love this bar.It is chock full of Camden's coolest with kids who dress down to dress up but still look chic. Sexy boys and sexy girls lounge out on the roof terrace, down in the beer garden or hang in either of the two bars drinking the night away in Kool Kid Heaven. Known for its blistering live music line up's Lock Tavern rarely disappoints. My only bug bear is that this place can get really busy.My favourite time to come here is in the day before the crowds arrive. Do not get me wrong you will rarely get Lock Tavern to yourself, but at least now you can enjoy the food menu, which is surprisingly good.Great bar and the place to be seen on a weekend in Camden.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "CIC3PGqS4rdHV6g3t88XBA": {
    "date": "3/17/2009",
    "text": "A victim of its own popularity.And what the hell is this whole - member only rubbish! You're a pub not the Kingly Club so sort yourself out and pull your trousers up...They have seriously amazing gigs here but they will be so busy that you'll have to get there an hour early and even then you'll find someones butt/knee/elbow/hair (delete as appropriate!) shoved in your face.They need a bigger places, or charge to get in but not this silly members nonsense. I miss the old days!",
    "rating": 2.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "DxpCAymSIqvIcyABpxiorA": {
    "date": "2/16/2010",
    "text": "Went there one evening to meet some friends and was not impressed. We sat at a table near the back, which was near the rather fragrant loos... Said table was so sticky I had to remind myself not to put my elbows on it. Thankfully, lots of free publications around, so I put one in front of me to \"read\" and used that to rest my arms/hands/glass. (eek!) This was winter time, so I didn't get to see any outside seating or anything very nice. Just seemed like a somewhat loud dingy and dark little pub to me. Hopefully it's better in the summer. Or maybe the music is worth it on other nights. I'd generally give it a miss on \"regular\" nights though.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "65RXQjA6rMCiDH16leud1Q": {
    "date": "2/14/2011",
    "text": "Becoming quite the gig whore in Camden of late but this joint is far cooler than the last one, The Enterprise. In both senses of the word. Ah, air con. Outside, meh, pretty grey and dark but you can see it has an upstairs beer garden hang out bit which over looks the Stables, thus guaranteed to instantly float my boat. Through the boozers doors lies a dark and very cool place. Lit with those red candle jar style holders that are simply everywhere good in my books. It screams hip, music and a bit 'sure' even. Barmen and women are both equally attractive and I can't decide if the bloke or the bird is fitter in this case...boyfriend spends evening eyeing up the skinny maids with my approval. Upstairs is gig focused, all red lights, AMAZING music being played until act came on. We were here for Cashback, which was ace. Free as well. So many hip hop type old skool fun tunes, not pretentious shit that you can't move to played before acts came on.. Loved. It being Valentine's weekend they had special cocktails which I sampled all of. Bellini was bit shit as had cheap champagne but 'Sex Juice' more than made up for it. Lethal concoction of strawberry stuff and Voddie. Yum. It does get heavingly busy but all good. Great music, the burgers looked to die for on way out and a great time was had here. Just get a cloak room and it'll be mint.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 9
    },
    "photos": [],
    "user_id": "ZmSv8VT-iBuQFvuPxKs00A"
  },
  "zJP2ZgPnDo25aEOVT1XRZw": {
    "date": "7/17/2018",
    "text": "This place doesn't come up when you search for vegan options. It's crazy. They have vegan fish and chips - so dangerously good. The tartare and mushy peas really made this meal. Great with a beer in the courtyard.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2r1UcFFANKQEXihv4Hvc7g"
  },
  "6DyaqTrA3IoC2LG1ceq9Fw": {
    "date": "12/17/2017",
    "text": "Avoid their Sunday roast. Soggy, deflated Yorkshire, potatoes that were oversalted yet still bland. Oh, and the table in the corner stinks of urine.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iRyEolDQn1OSpyK6icJPQ"
  },
  "7tfGxWiB0O9ffTu23L35Ug": {
    "date": "5/10/2017",
    "text": "Stopped by for a quick late night beer. They had many selections on tap, and the environment was very modern and had room for large groups, smaller groups, and couples. Would definitely return for a night out",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B6kHo5Bfik1kAK7SFtYtCg"
  },
  "KXFPZWgbIs2jTwQdyMW3fQ": {
    "date": "8/6/2016",
    "text": "Solid roast cauli, feta and squash salad and excellent chill vibe earlier in the night allow for four stars. I'm dinking a star bc it seems no one has an idea what the hell is going on DJ wise. With no sign of an advertised DJ playing 20 minutes after he/she was supposed to (this past Friday night), I asked the bar staff what was going on. I got a nebulous answer that a DJ should go one \"at some point.\" Um yeahhhh no, I got things to do and places to be.The salad portion is quite generous, with the feta, cauli and squash tossed well. I only managed to finish half as it was quite filling. I had the rest put in a takeaway box. For 7 pounds only this was a great value.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "XhT-5owbPMhFGjU-SRjwKw": {
    "date": "4/27/2015",
    "text": "With roughly an hour to go before I had to set off towards Euston for my train, we headed into The Lock Tavern for a final drink of the weekend. After wandering around Camden Lock Market, it was the perfect distance between the market and the tube stop - great for that final stop, especially if you're unfamiliar with the area and don't want to venture too far afield.Inside is quite standard pub decor, with some nice flowers in the middle of the tables and menus printed on brown paper. I must say, the food looked cracking; visiting on a Sunday meant it was predominantly roasts coming out of the kitchen, but options included a delicious sounding duck breast, and some of the biggest Yorkshire puddings London's probably seen.Service was slow to start off with, obviously annoying me at first, until we realised that the huge table in the corner had all ordered coffees, much to the dismay of the one person behind the bar. When it did come round to our turn, drinks were poured quick as anything. It looks like there's more to explore upstairs and outside, and apparently some game machines built into the tables upstairs, which I'll be sure to revisit in the future.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ej_YkwvVAj1PIUVbB31VmA",
        "caption": "Photo of The Lock Tavern - London, United Kingdom. sunday menu (2015)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ej_YkwvVAj1PIUVbB31VmA/o.jpg"
      },
      {
        "img_id": "_OYq1p46aK0C-XZM3R3fMw",
        "caption": "Photo of The Lock Tavern - London, United Kingdom. table (2015)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_OYq1p46aK0C-XZM3R3fMw/o.jpg"
      }
    ],
    "user_id": "4yhsn0kSKP4-Kp0aFKmKzQ"
  },
  "Ji_cMslj69yLoHxsLl3W6g": {
    "date": "4/13/2017",
    "text": "Really, what more do you want? If you're out in the beer garden listening to the music, having a pint with your fish and chips and soaking in the vibes and you're not having a good time, I really don't want to know you.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "J5Irklt4m2AhjTcNG_Gnvw"
  },
  "YoCx3IVPh9eyVE264cPTKA": {
    "date": "7/29/2016",
    "text": "Great pub, great venue.  Very nice interior and outdoor seating is available in this lively tavern which is more often than not packed.  The venue offers frequent high quality gigs and weekend festivals which are always free.  In addition the food is great, a bit pricey, but you'll get your monies worth.  Can't really say a bad word about this place - always a good time.Super guay ese!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pAC_Wx1C0fGZEFHXBavOZA"
  },
  "D_0UZzvxjKZCzLM1x_jNEA": {
    "date": "8/4/2014",
    "text": "I found a new favorite - Yorkshire pudding!  My cousin took me here for a \"proper British Sunday roast\" and it was delightful.  As for the Sunday Roast menu, there have a few variety of meat to choose from; I got the pork belly.  Another good spot to eat and extremely close to The Camden Lock.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uyzoIDdYeuW6rmCC5UJV7A",
        "caption": "Photo of The Lock Tavern - London, United Kingdom. Sunday Roast - pork belly with Yorkshire pudding, potatoes and veggies",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uyzoIDdYeuW6rmCC5UJV7A/o.jpg"
      }
    ],
    "user_id": "sAb47uEcSjK3uQcylhkhPw"
  },
  "TWnVXdyCcRMsoiW6ORSCmQ": {
    "date": "5/21/2015",
    "text": "Good beers, great vibe, and a really nice outdoor beer garden in the back. My only complaint would be all the second hand cigarette smoke you'll inhale sitting outside. But that's certainly not their fault. Highly recommend this place!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dohuRohZZKd5654iHk-gHQ"
  },
  "9xUk0ylhyHGdYRdpw9dgvA": {
    "date": "5/17/2015",
    "text": "They have 3 separate spaces but I absolutely love the roof terrace! It's a need to try!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gYIEf_wDbu7KIJ2NX1blHw",
        "caption": "Photo of The Lock Tavern - London, United Kingdom. Inside decor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gYIEf_wDbu7KIJ2NX1blHw/o.jpg"
      }
    ],
    "user_id": "KldNPNl0obbnKtys-PJcWw"
  },
  "R91129U62dlcyvUKYMa_aw": {
    "date": "2/12/2014",
    "text": "I went with my husband and a friend on a Wednesday night.I was hungry and the friend was thirsty. It all worked out well.Ordered some food off of the menu, beers, soda and an assortment of other little delights.It was pretty busy at about 6 or 7pm.We found a table though....I don't recall the music being played as it was rather loud to begin with.I will definitely be back when I return to London to eat, to drink and to check out the music.I read somebody posted about \"locals only\".Fuck, I'm from Los Angeles. I think they'd have noticed by my distinct lack of accent that I'm not a local. Nobody cared. Just go and have a good time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v9rmihk15ssK3hqqTKuRxQ"
  },
  "7_xzC7FnaDNbNS5dm7k2vg": {
    "date": "9/29/2016",
    "text": "we came for the roast and wasn't disappointed . it's a little pricey , but the meals are huge! the beef was off the hook , but the pork was a little dry . all the veggies and sauces and gravy were top notch! perfect way to end a Sunday session in Camden",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "In_I8fiWympQhi-d8aJ2Fw"
  },
  "ObI3n4cPhUDjpkBaM8FUmw": {
    "date": "12/29/2015",
    "text": "Nice! The atmosphere is very relaxed, and a wide variety of offerings are on tap. The food is great--try the nachos! The spicy green chili sauce will get your attention. I also had the Napoli salami sandwich and found it excellent. A good old style tavern with great food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XIljDRBeNeZtPH7ABkjntw"
  },
  "RqSiXazWVlwzigbDX_lSOA": {
    "date": "8/5/2011",
    "text": "A nice airy place to be that is a little off the beaten track of Camden so tends to be a nice quiet retreat!The food is of good quality, but the portion size is small and it's not the cheapest.I have only been to this venue in the day and I like the vibe, however it's not an outstanding pub and the staff whilst able, are not the friendliest.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "Clz-4MDJX-1WpwwHtIF6jA": {
    "date": "9/7/2016",
    "text": "Great inclusive yet alternative atmosphere, live music on select nights. Pleasant staff and good yet simple variety of beers and meals. Would come here often if I lived in Camden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cua2JO1vZHAtB4lUpVisog"
  },
  "bOZCmDTdo89Hy4xCjlwCNg": {
    "date": "8/20/2016",
    "text": "Great tavern food. Just outside the busy life of Camden market.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vVbiSJlbvlKc24hsvXLJfQ"
  },
  "88TjVuhkLYLfmJJig66JTw": {
    "date": "2/6/2013",
    "text": "Ah the Lock Tavern. I feel like I've been coming here man and boy!But, your experience here will entirely depend on when you come. If you're here on the weekend during the day, it's an ideal spot to grab a pint and relax. If you can tolerate hipsters staring at you and wondering why you're not wearing a trilby or cultivating a moustache. But that's ok.In the evening, it does get busy, and past a certain time they have a ludicrous policy of only letting you in if you have a locals card. Which is a right pain in the arse if you're meeting friends here and you don't have one.They do often have decent music and DJs on, and in the summer there aren't many better places to enjoy the temperature than on their roof terrace, crammed in with your fellow drinkers.In summary, you just can't rely on this place. But do chance it sometime, you might love it. But I did warn you.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "KKqhP8uFomQ_H6OKEryB_Q": {
    "date": "8/16/2012",
    "text": "The Lock Tavern is pub situated on Chalk Farm Road in Camden.I LOVE the Lock. It's a little hard for me to be unbiased as I used to have a DJ residency here and was looked after really well by everyone involved.There are two floors and two awesome beer garden/patio areas, one on ground floor out back and one roof terrace. The decor is hip and cool, the hottest new bands and DJs play here yet there is always a great atmosphere. Although this could so easily be a pretentious place, it somehow manages not to be, everyone is welcome (except trouble makers!) and it's a really friendly vibe. As it's in Camden you do get some tourists in but they mix with the locals and hipsters and all in all it's just one big party!If you like a good old fashioned rave-up check out monthly night 'ASBO', smiles all round!Staff are friendly, helpful and attentive, the food is delicious and there is an impressive selection of drinks.I've had some of the best days/nights of my life in this pub! It's like my local in London, home from home! If you haven't been get yourself down there now!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VoVx4PtrRM7LHx-RylFkmg"
  },
  "Ab1Qro8GEuYA7XReIyIADA": {
    "date": "7/20/2010",
    "text": "I've been going to this pub since I was under-age for any reason from day-time raves to after work drinks. In four years it hasn't changed a bit and I love it. Unlike The Hawley, it manages to retain it's dirty Camden chic without turning into a 'cooler-than-thou' watering hole for London's elite.They do an amazing Sunday roast (between 12pm and 2pm so get there quick) as well as seasonal drinks like mulled wine in winter and a gorgeous Pimms in the summer.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "oVZbavWnm_vuzOkoYpsqQg",
        "caption": "Photo of The Lock Tavern - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oVZbavWnm_vuzOkoYpsqQg/o.jpg"
      }
    ],
    "user_id": null
  },
  "HhJkUeTr7KZximfmH8IteA": {
    "date": "2/25/2013",
    "text": "I'm a semi-frequent visitor to London, and I spend a fair amount of time in the Camden area. As mentioned in some previous reviews, experiences here do seem to depend on what day/time you visit. I've been to this pub a few times; my best experience was on a Monday afternoon near the end of a trip, at which point I happened to have an excruciating hangover (I know, it sounds delightful already). The pub was practically deserted at this time, and the bartender was very accommodating in my request for a Bloody Mary that I hoped could bring me up from 75 to 100 percent human. He took great care in crafting what turned out to be a generously endowed and delicious cocktail, and provided some nice conversation during the process of creating the drink. On the back of this event, I ordered lunch (which was also nice) and had a second cocktail-- slightly adapted from the first according to my feedback-- while watching the world go by on a lazy afternoon.I have passed by this location a few times at night on the weekend, and it seems a bit intimidating with the bouncers outside and the apparent 'locals only' policy. However, there are so many other venues nearby to check out that it barely registers as an issue in my opinion. I would highly recommend this pub for a late afternoon visit or the occasional boozy lunch. As for the overly trendy evenings? If you don't like it, walk a block in either direction and find something that fits your taste!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0usx4OTWK-Y7blJwwETeQ"
  }
}