{
  "_hMBDrri0ChYx-BxnY6TBQ": {
    "date": "10/17/2014",
    "text": "Great British pub, with friendly service, good drinks, good food AND they're dog friendly! It was a welcome oasis during our stay in London, as the service we had gotten in other establishments was spotty at best. But here? Everyone was smiling and super friendly and totally made me wish we had found this place sooner. Being from the US, I had never had sticky toffee pudding before and was eager to try it. Wow, it was amazing, and now I brought home a recipe to try out for myself. If you want a friendly, non pretentious British pub look no further.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4w6eo7UDf5faybprl1KJ2Q"
  },
  "7mIO9khDHObnLK5edzEM7A": {
    "date": "11/24/2013",
    "text": "We really enjoyed this pub. The staff was friendly, the food was good, and it was walking distance from our hotel. I look forward to a return visit on our next trip to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV-35Jot55tW5eTdkrFtyA"
  },
  "CcUFdQeI_4CdiFl9JT2TfA": {
    "date": "5/2/2014",
    "text": "Cool little place. Loved the ambiance and the food was awesome. Not too many options but all seem to be well thought. Our dishes were very satisfying, just slightly over salted.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qJGlB-v4T4r8Zj1Dlc_CEQ"
  },
  "1hCnaCjkt3cAQ0I6rPDq_A": {
    "date": "7/8/2011",
    "text": "One of my favourite neighbourhood pubs.  Food is pseudo-posh and not that great, but love the atmosphere and the hidden backyard garden (tough to get a seat out there in the summer!).  Prices are not too bad.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KgJdBWS3ReP6TVhYWJRKmg"
  },
  "6LOtWI0V4OdLL06upV40pw": {
    "date": "12/15/2008",
    "text": "The Champion - I do love this name for a pub. I go in there, I feel like a million dollars. Michael Schumacher, Alex Ferguson.. a true winner. The pub itself is pretty average though, once you get over it's awesome name. There are an assortment of beers on display, more so then most pubs, and it does possess a pretty nifty garden round the back. The service was decent bordering on indifferent and the price of a pint was vintage Notting Hill - back to East London I roam.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OsbecZMGu9nCXVLpNz_q8g",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OsbecZMGu9nCXVLpNz_q8g/o.jpg"
      }
    ],
    "user_id": "UG_hriMI8ZFkZFDOT-96ig"
  },
  "Yk1qdCzCcVV5TPiKaOBqtQ": {
    "date": "3/11/2009",
    "text": "Above average pub.  Comfortable seating areas and an overall relaxing atmosphere.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "003VskSkYJAF3ytFJ6rH-A"
  },
  "_Whf8CdKwvzHuUMY4T_bnw": {
    "date": "12/13/2015",
    "text": "I had a burger at lunch time. The food was okay but the service was below average. I needed to ask the waiter to take my order after waiting 25 minutes. The atmosphere was less than average.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1ojNzAEPIm94DH_psrVawA",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Chips and burger. Nice .",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1ojNzAEPIm94DH_psrVawA/o.jpg"
      }
    ],
    "user_id": "uPlXTqRG7ZxtIKrf7EFE7A"
  },
  "7tv3_krF-w0fs4JU7MFrmg": {
    "date": "8/27/2016",
    "text": "This is our local pub we frequent, but we are so lucky to have such a great place just steps from our place. Great vibe, good food, wine special on Friday nights, and really good roast on Sunday's. Also, the secret garden in back is a great little place to hang out on a nice summer evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jt4NWol6ygrSozQiCMG5tQ"
  },
  "W_n93m028bCGFvfDa8au1A": {
    "date": "6/30/2016",
    "text": "This became our local pub while on a 10 day visit to London. It's a typical English Pub with good service, a good selection of craft beer and good food. They even will take orders at the table, instead of just at the bar. The atmosphere is lively but not so loud that you can't carry on a conversation.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0AJoH3nDzTHPBr2SwZ6UQ"
  },
  "kc29jcb013j90_enmOLhLA": {
    "date": "2/26/2016",
    "text": "Nice enough looking pub, and have dropped in a couple of times. Reasonable beer selection but wine selection definitely lacking (heavy on the cheaper Antipodean wines - and not the good ones). Staff have been friendly and helpful so no real complaints there. The food is ok - had burgers and some sides only at this stage. Food was nicely presented and tasted ok but wasn't writing a postcard home about it though. Nice place to drop by for a pint and some nibbles though.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pYWGJdGfo3i2Bcrn-M6N3g"
  },
  "kUU9QPoWH8vo1wP14oUZ2w": {
    "date": "9/28/2013",
    "text": "i really like the ambiance here. After our meal at The Prince Edward, we walked around and decided to stop here for a drink. This place was happening... lots of people just catching up, drinking, and just having a good time after, perhaps, a stressful day at work. I love it. They have a good wine list and some good beers on tap.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vp5DzIiP_MmaMZMZVFFltA"
  },
  "J6e2gGRJwZYKBY2vSggWYA": {
    "date": "4/1/2017",
    "text": "I guess its typical pub grub but we expected more from this place since the menu seemed decent.  We ordered burgers and chicken which apparently are not made fresh and frozen pre made which is not what you would expect, very disappointed.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CrXP-er1DvZOyimrPiGr_Q"
  },
  "psshTA2f8t9YIm5HKLLGvQ": {
    "date": "3/25/2016",
    "text": "Mac n cheese bites were tasty. Fish and chips were a bit greasy but still yummy. Bar staff was very friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CNun4k6CMy21f-W4ajaig"
  },
  "NX1cdFOo-g6Qu5tIgXBFdw": {
    "date": "6/6/2016",
    "text": "Food is good to great. The chicken skewers are okay, but the ham and salami sandwich and the calamari appetizer are fantastic. The Welsh rarebit and pork sausage over an onion mash was really good and the fish and chips was light and tasty. A good place for lunch and beer. Free pub trivia on Tuesdays.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "89bllU5BYxOo0kmGSLn-0g"
  },
  "7ugldXYNxn6eBNEYAPadiA": {
    "date": "10/14/2015",
    "text": "Our first British pub meal was here on vacation and it did not disappoint. We had the fish and chips, a board and a outstanding cauliflower and kale pie. We did not have a burger but they also looked great. Their beer selection was very good and the bartender was super helpful. Great neighborhood to walk around and then end up here for a drink and dinner. Great neighborhood to walk around and then end up here for a drink and dinner",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oGsDSTYq_m5gm1BfTJrmWw"
  },
  "6t2uQ8vAQD_s1nrkzcmpGA": {
    "date": "11/25/2015",
    "text": "Ya know, I'd really love to give this place a better rating but the bartenders have no idea what beer is what, the food was okay at best and overall service was poor.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcZIqercSslRFWxHQJqyQw"
  },
  "lc8PucYOYW9AYbfdSpZkVQ": {
    "date": "2/18/2012",
    "text": "Notting Hill . . . posh! This was a perfect \"Oh, look . . . a pub\" find while we were out walking around. Cute, friend barmaid, rocking a really cool hat. The menu looked great - quail, wild boar sausages, red wine risotto - but we didn't eat - and not all that pricey.It will be a great day if I find myself back here one day soon.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kxA0vTDi1KABuA5Tgg1HKA"
  },
  "uFZtCDSiuAkZLl1KxO7mGQ": {
    "date": "5/14/2015",
    "text": "Love this place. Great for lunchtime eats and after work drinks, although can get a bit busy at weekends. Great friendly bar staff.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jbWZjGnkeqR7J0ygXz7qlQ"
  },
  "hNh5L7rsex0KtZ_S2k6lFg": {
    "date": "11/27/2016",
    "text": "Not good....fish tasted like bait and the burger had the consistency of mushy peas...inattentive wait staff also played dumb when it came to the free pint check in offer",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPMRLo7dFfOzr-rTC7WtiQ"
  },
  "bDOVS7gepJ9GNmJNSYGSDA": {
    "date": "5/8/2015",
    "text": "Warm, welcoming pub with some serious beer. Service was friendly and welcoming to our family of four, with helpful advice on the menu (including some off-menu kids' options) and knowledgeable guidance on the cask beer selections. Did I mention \"cask beer\"? We will go out of our way to return here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFnIOPQZwoMK36USZ2nchA"
  },
  "DGIiEvmEx6wR7-SUUUikBg": {
    "date": "7/23/2016",
    "text": "Food was great, nice English pub atmosphere, and the bar tender really knew his beer. Talked me out of a salad and into some great fish and chips!  The ham hock pie was also good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oH9BY5s14_Tl827wM4yxoQ"
  },
  "-WzXz1n8TB31ixCpbT0e7w": {
    "date": "5/22/2016",
    "text": "Waited for 12 minutes without a server.  Table that was open when I walked in had a patron with food.  Greeter sat down in front of me and started eating.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHG6NsipuaRQRniawtpKAw"
  },
  "-2YszvDiH23ZrmfZwlfSCg": {
    "date": "11/25/2012",
    "text": "Walking around Notting Hill area on a day off from work meetings- great beer and good food, including really good vegetarian options (not so much for vegans).  I had the leek tart and my friend the fish and chips- both delicious, and it seemed like a lot of it was locally sourced.  The beer was, of course, heavenly.  The ambiance is nice and the bartenders were really helpful.  A great place for a quick bite and brew!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gkH-GFjy16d-mKIKu1_Mrw"
  },
  "RhJAnvP-C8QGdXcUeFoF5g": {
    "date": "10/26/2012",
    "text": "I first stopped here many years ago with the Missus. The place has not changed  one iota which is be expected with a true pub. When I first entered I got the déjà vu  feeling and it took a pint to figure out why. It eventually dawned on me it was our \"local\" on one of our trips.They have added a bit of posher menu but the ales are still very good. Good place to relax after the mob scene at Portobello Road human sandwich routine on the way back to the hotel. The high ceilings and many windows make the place less foreboding.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fAPfgpJo_0xvU98ocYrubA"
  },
  "WuLY_5Rt1BGYLHTiazYfgA": {
    "date": "6/1/2015",
    "text": "I booked this pub as it had a beer garden then on the day the weather was rubbish. When I first walked in I was a bit disappointed as I felt that not being able to sit outside, it was quite a non-atmospheric environment and all a bit dark and dingy, however my opinion swiftly changed. Firstly when booking I wasn't allowed to reserve a table outside however the lady advised she'd sort a table inside and if we could get one outside she would happily move us. When we arrived she had remembered this and offered to move us outside (which we declined for poor weather). We stayed inside and the service was great. Table service for all drinks which we got regularly, no waiting around, reasonable prices and the food was AMAZING. Most of us had roast dinners and the portions were great, well presented and tasted yummy. Peanut butter cookie dough cheese cake is A MUST and I'll be going back just to have that! I like this pub despite the 'plain' interior, and would happily go back again for a Sunday lunch catch up or similar (not necessarily for a heavy party night out).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UjfrHXO8RFcMYhEsk_PG7g"
  },
  "8IkE0fgJsIxKm9KQ2T8HSA": {
    "date": "1/30/2010",
    "text": "After a cold weather walk in Hyde Park, this pub is a good place to warm up. Stopping in for ale and hot food is just what I needed. This is the kind of pub that attracts groups of friends with board games available, as well as the lone paper reader in the corner booth. With lots of comfy seating, The Champion invites you to stay in for the duration.",
    "rating": 3.0,
    "rated": {},
    "photos": [
      {
        "img_id": "cwzbHW66PR3GVUYfkxI75Q",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cwzbHW66PR3GVUYfkxI75Q/o.jpg"
      },
      {
        "img_id": "_1UrkYies0JjajXVlJrznA",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_1UrkYies0JjajXVlJrznA/o.jpg"
      }
    ],
    "user_id": null
  },
  "u80SG3xc5GNF7y4l5l2M4g": {
    "date": "3/16/2018",
    "text": "This was a fun sports pub with good food and a beer list that included both traditional and modern local microbrews. I loved the burger I had. The atmosphere is noisy and fun in a spot close to a metro stop but a short walk from the center of Notting Hill",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PwH0MeYZnnuzun3idW57gw"
  },
  "tVS_4addt-tQLPXZEWTcvQ": {
    "date": "9/12/2017",
    "text": "Great little pub. Place was packed and the service was very good especially considering how busy it was. We were 10 days into our trip so we took a night off from trying the local cuisine and just had the cheeseburger. It was nice and tasty. Hit this place up if your in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5eQK1DWgiajI30ULbOkpQ"
  },
  "C8_ezAldWOGHTa5NhqZWjg": {
    "date": "9/25/2015",
    "text": "Lovely place to stop for lunch, dinner, or just a good beer. Randomly stopped in while strolling through the neighborhood and was pleasantly surprised. I ordered a bacon chicken burger with mac n cheese. The chicken in the burger was so moist and delicious and grilled just right I swear it got better with every bite. The mac n cheese was also nice and cheesy and seasoned well, I was very pleased. Really great beer selection as well would definitely come back when in London again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "PjHkUuuG9bTs2oMsVIwmXw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Nice window views",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PjHkUuuG9bTs2oMsVIwmXw/o.jpg"
      },
      {
        "img_id": "RcdXoN0dJpXnAQhCnG2k9g",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Nice window views",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RcdXoN0dJpXnAQhCnG2k9g/o.jpg"
      },
      {
        "img_id": "YUWlhBuD813fbko-dxNx1A",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YUWlhBuD813fbko-dxNx1A/o.jpg"
      }
    ],
    "user_id": "-H6X7u_GCtqVXkGZmW7lzQ"
  },
  "MJWrFsDAWLO101yroYj6TQ": {
    "date": "1/30/2018",
    "text": "Had dinner there this evening. Fish and chips were wonderful.  Beer and cider selection was also good.  Service was also fast and nice.  Convenient local pub.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fcMH8X5FGRTuTJZ42XpZ3Q"
  },
  "4fuHaJzCiFJGe485f7wBMQ": {
    "date": "7/2/2017",
    "text": "Very nice find. In the area and wanted good pub food for my wife and daughter. Food was great. One of our best pubs meals in London. Fun, pub classic environment. Seems like lots of locals. Great atmosphere to match the excellent food. Prices decent. Only issue is that service is slow and discombobulated. Our waiter wasn't even sure about his own menu. Okay, quirky. But food overcomes that shortfall. Feel free to come here and know that you will have a good meal in a nice local pub.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ajeqt6_CwtRVSg9eFr5hHw"
  },
  "s5S6EJxcEv8pXJ3wCaofDQ": {
    "date": "12/30/2017",
    "text": "First time here while visiting London.  Ok place.. Bangers and Mash was good.  Service could of been better, but a good place to have a drink.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g9-3fbOBcRpNsYBLaxDA9A"
  },
  "xQ60YSIWEsg9WafEcMxCYA": {
    "date": "3/28/2017",
    "text": "Good pub near our hotel.  I had dish and chips and my wife had roast chicken and both were good.  Wish we had tried it before our last night.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-zIFYwNhMT7284LJSaWXBg"
  },
  "_LaTxjPYHXd42BW4r77daw": {
    "date": "6/10/2017",
    "text": "Great fish and Chips! Cute place with a great outside and inside atmosphere. When you walk in tell the bar that you are sitting down. It's a Pub so you need to seat yourself and if you don't let them know you are here it might take a little while to be served. If you are just coming from Europe then know that water is by the bar and you can get it yourself. (This made us happy!)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zqFdip9utaCARyaFLcCu0A",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zqFdip9utaCARyaFLcCu0A/o.jpg"
      },
      {
        "img_id": "2AOZJxbNoHhINQYccuqJjA",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2AOZJxbNoHhINQYccuqJjA/o.jpg"
      },
      {
        "img_id": "lcRXk75GLKVaplwS-EKhSw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lcRXk75GLKVaplwS-EKhSw/o.jpg"
      }
    ],
    "user_id": "68fiTTsnsxI-DkWAmHVk2Q"
  },
  "CKrr-lU4eilg9Yz6GhXh-g": {
    "date": "11/30/2016",
    "text": "Really bad experience to be my first beer in London, first they don't have seats on the bar, second I asked for a Guinness she ask me to pay first I ask to open a tap their credit card thing doesn't work, I paid first after that she brought my beer completely disappointed, drink my beer and go to another bar",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YTcGJyB8Bg0KGVr6a4758Q",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YTcGJyB8Bg0KGVr6a4758Q/o.jpg"
      }
    ],
    "user_id": "TDMSCW5yqn1BVwxCk8scyg"
  },
  "WBULTC_3fwquV6-SapjrLg": {
    "date": "5/24/2016",
    "text": "Cool place - with an open style and wooden decor. They have a good choice of drinks - guest ales are particularly nice. Small outside sitting at the front - with a larger outside area down the stairs out the back. The back part is quaint with benches and tables, ideal for warmer weather. Well worth a pop in if you are around that area or why not make a trip there for a meal.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jUhh3_-eKKsKWS8EBHT4yw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. View from near stairs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jUhh3_-eKKsKWS8EBHT4yw/o.jpg"
      }
    ],
    "user_id": "mrYGAxvkhenAt5fpOPDmgQ"
  },
  "HlJF04-LvQwAEpC8_Jaf3w": {
    "date": "8/10/2017",
    "text": "Place was just around the corner from our Double Tree hotel. The pub food was good. We had bangers & mesh + burgers for the kids. Beer selection was ok and also tried some Cider. The noise level was very high.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Z6iea4cKcX9E-k0o5hdtQ"
  },
  "480svRMnsl8LJHmLXGjpuw": {
    "date": "8/28/2016",
    "text": "This is my first UK review! I must start off by saying the whole bland food, warm beer thing is a complete myth, and this places proves that.I stumbled upon this pub while searching for some sustenance before participating in my first Carnival. Upon checking in, I received a free pint. I wasn't sure this would be an option since there was an event going on and it seemed as though they cleared out some of the tables. I ordered the burger w/ cheese and fries. The fries weren't chips, which I quickly learned are different things. I loved how crispy they were on the outside and smooth in the inside. The burger was soooo good! As a foodie, I know a a good burger and this is one of them. A good burger is one that doesn't need the frills of added toppings. It's a simple burger with good quality meat. That is what you will get here. I highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tz2sh1cRRulKLVG3KUcZLw"
  },
  "xRRb8a6B3Fm89Kx-AyqJfw": {
    "date": "12/30/2016",
    "text": "Waited a little to get service but once he came, it was all better. Our first course was a baked taurine with figs.  It had a wonderful salty and sweet taste.  Their fish and chips were cooked to perfection.   Totally enjoyed our dinner.  Their beer section. Was also very good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vTla5cyYCc4MnGUOgZwsSA",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vTla5cyYCc4MnGUOgZwsSA/o.jpg"
      }
    ],
    "user_id": "fZxL1kYopL7jTXtGbHaKNg"
  },
  "EPqNRj8fBVV9hfr5Sd0hSQ": {
    "date": "12/26/2016",
    "text": "We spent our Christmas vacation in the U.K., staying in the Notting Hill Gate area.  On Boxing Day we had dinner at The Champion and it was excellent.  The beer was great.  My wife enjoyed a white wine with he fish and chips.  The hamburger I had was the best I have had on this side of the pine. The atmosphere is relaxing and the service was good.  Put it on your list.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Lx0KlzKHYbBgXJLDLgnsA"
  },
  "ecJ0C5k3nSPNmTF5UHnbIw": {
    "date": "7/3/2016",
    "text": "Great local pub with tons of beers on tap. The service is a little confusing because it is not clear how they seat people and if/when they will help you at the tables. We typically order at the bar and then sit but sometimes people ask if we want food. Have only eaten here once but the food was delicious and reasonably priced.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bh6XvJljf5NsvBCpNznOIg"
  },
  "JFfmiySvt5VSl2UUT1EuMg": {
    "date": "7/1/2017",
    "text": "Service okay, but drinks were very weak - my husband ordered a Bloody Mary and I ordered a aperol spritzer and I think they forgot the vodka in my husbands drink and the prosecco in my drink.  We warned a few patrons that walked in and sat near us and we left after 1 drink.  If you need to go here stick to beer as I saw a lot drinking that",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1EDkt30_bak-_8a4YZtcBg"
  },
  "gEPY8DKTnHH85NFoAO2naw": {
    "date": "9/6/2016",
    "text": "This was a lovely pub just far away enough from the hubbub of Notting Hill to be considered relatively out of the way (insofar as anywhere in the centre of London can be). Good selection of beers, some nice bric-a-brac on the wall. Child-friendly during the day and close to Kensington Palace Gardens which is an ideal one-two on a sunny afternoon.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C-3eJylBXYJa-X6PkBUq3w"
  },
  "4u3EbbyBNdpmeJbwU46GPA": {
    "date": "7/11/2017",
    "text": "Great pub atmosphere. Had a couple of pints and some super snacks. If you're looking for fun and local flair enjoy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHnsSJSmXq2l5JAeeao5kQ"
  },
  "jfKU49_8_s0oyIZn8N3TgA": {
    "date": "6/14/2017",
    "text": "My favourite pub in Notting Hill! Friendly service, good selection of craft beers and great Sunday roasts!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WoFuuIhdgw6pvI8JlKRDMA"
  },
  "gAYYBQPl1bjmvwqo1iGUQw": {
    "date": "8/15/2016",
    "text": "Quaint atmosphere, great prices, large drink selection, and classic pub food make this a worthwhile spot!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AyiZSoscmPn_HZSqJhF3hQ"
  },
  "RY-eFAkkkMfKI5v1A2_sSg": {
    "date": "12/5/2017",
    "text": "Short rib meal was good. My daughter said the burger was also good. Not great but no bad. I came on trivia night and easily found a table while also getting to search my mind for the answers to all the questions. Entertaining",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kBX3C4i7iIjhH5ZS_ZNCNg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Burger and fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kBX3C4i7iIjhH5ZS_ZNCNg/o.jpg"
      },
      {
        "img_id": "dD9QsDLkJ8iPJaglJP50Og",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Beef short rib and potato mash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dD9QsDLkJ8iPJaglJP50Og/o.jpg"
      },
      {
        "img_id": "MyXc5idwLqAYImiK2MDsUA",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MyXc5idwLqAYImiK2MDsUA/o.jpg"
      }
    ],
    "user_id": "ORPvRisZYWxTCiOCE03rpA"
  },
  "rQmUza2kr6QaU5T22WIoYw": {
    "date": "10/31/2017",
    "text": "Great experience and even better service at this place. We're visiting from the US and just happened to stop by here for dinner. Our server was so friendly in helping us not only pick out amazing entree's, but drinks to accompany them as well. The Camembert starter is one of the greatest things I've ever had and to be honest, I'm going to try to find a way to get this back at home. We ordered the meat pie and bangers and mash, and hardly talked because we couldn't stop eating. Afterwards we had the sticky toffee pudding and as much as we knew we ate a lot of food, there was no regret. We plan on making this place a regular stop when we come back to the UK and highly recommended anyone to go. The quality of the food and great service can't be beat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hZKi0sZnyx08CdFluNbaGw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hZKi0sZnyx08CdFluNbaGw/o.jpg"
      }
    ],
    "user_id": "yGUGo3dwBIab8kFO95WdZw"
  },
  "gi6FJy8a0usZasszMTL_LA": {
    "date": "8/26/2017",
    "text": "First night in London...Pub restaurant close to Hyde Park and within walking distance from my hotel.. Good fish and chips. A variety of pints...Bustling atmosphere! Overall great experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_B5c8WFzJM1aIMHqdS0agQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Dark Star Hop Head Pint",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_B5c8WFzJM1aIMHqdS0agQ/o.jpg"
      },
      {
        "img_id": "Q_nil86POBLv6fEkSlFbEQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Fish and chips with peas! Yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q_nil86POBLv6fEkSlFbEQ/o.jpg"
      }
    ],
    "user_id": "OR7sjG3SL2SClrqGsWXdhg"
  },
  "SETiU-mliG0bxv-hjxzhEA": {
    "date": "7/11/2017",
    "text": "It was a dark and stormy night. No, really it was.  My    padner and I were looking for a quick nightcap near our Airbnb. The Champion was around the corner. For a stormy night, the place was fairly lively.  They were playing classic rock, which could use a bit of improvement, but the bartender was nice. I had a nice fresh Camden Wit, and my padner had a local attempt at a pale ale. My beer was better, if I do say. Anyway, was a nice vibe and a reasonably priced fresh pint. Tip o me hat to ye, Champion of Notting Hill.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "bQaKuQAnC1jwANNAaV1nqg"
  },
  "qDDkP_dsceu751voB6zuaQ": {
    "date": "7/6/2017",
    "text": "+ Great beer selection. - Dinner on a Wednesday was difficult. One waiter serving the entire inside + outside terrace.- Burger was tasty, but very small pattyI'd visit again for a pint and quick bite but would seek dinner elsewhere.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvSfOWwkusENV2CWDvF3ww"
  },
  "Noig_tpg8wqmqnfebux5lg": {
    "date": "5/6/2017",
    "text": "Our first London pub excellent choice. Free beer and cider samples provided on request. Wings were great. Smoky and tender. Good atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "0TwtM8OnGlW-syp18fqgCQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0TwtM8OnGlW-syp18fqgCQ/o.jpg"
      },
      {
        "img_id": "4LSujCiGmoDnxRALNGyDxw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4LSujCiGmoDnxRALNGyDxw/o.jpg"
      },
      {
        "img_id": "u_yceB3tcA6PAXIIzqIV3Q",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Nice pub",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/u_yceB3tcA6PAXIIzqIV3Q/o.jpg"
      }
    ],
    "user_id": "QZVSbt2nyfMHKTGu8MPolw"
  },
  "sMXK604iSJ7esy0dD7I5OQ": {
    "date": "11/26/2017",
    "text": "I didn't expect too much when I found this pub on Yelp.  It was close to my Hyde Park and all the tourist hotels that line the north edge of the park which led me to believe that it might be in the Hard Rock, Planet Hollywood line of tourist magnet eateries....how wrong I was!My family and I arrived at 7 PM on a Friday night and learned from a server that, since we did not have reservations, and because they had live music on Fridays that started at 8 PM, we would only have a \"reserved\" table until the guests for that table arrived at 8 PM.  We thought about leaving and finding another place for dinner but the menu looked intriguing (both food and drinks) so we told ourselves that we would order quickly, eat quickly, and get out the door by 8 if we must.  Our server told us to take our time, she would be on the lookout for reserved tables where the guests did not arrive and she would find a place for us.No sooner had we ordered our drinks (local beers and ciders) than a corner table was found and the family and I sat down.  My teenage son and I share (some) musical tastes and found the piped in music to our liking (LCD Soundsystem's \"My house\", etc).  We loved the beer and cider and decided to order some food.  We ordered the Fried Squid with sweet chili glaze (starter), Fish and Chips (when in London...), Handmade bacon & Cheese British beef burger, and Sausage and Mash.  The food arrived and was enjoyed by all.  We shared all the dishes and felt that the Squid dish and fish and chips were comparable with some of the better versions that we had eaten elsewhere while the burger and Sausage and Mash were excellent.  When the live music started at 8 we were still dining and enjoying ourselves.  Several other restaurant staff had come by to see how we were enjoying our visit and to see if they could get us anything....so nice of them to take an interest in folks who weren't \"locals\" and, as a family with two teen kids, not your typical Friday night crowd.In short, we loved our time in the Champion and our only regret was that we had not found it earlier.  As it was, we didn't try The Champion until our final night in London and we all agreed, it was the perfect end to a wonderful vacation....we even joked that we should win the lottery and make it our Friday night spot, flying back each week to enjoy another Friday night at The Champion!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DYFJLLQEwVWm770D_detoQ"
  },
  "9xMMjSRqex8KCrtsDov34A": {
    "date": "11/27/2017",
    "text": "Wonderful little pub with great food and even better beer! We were so lucky to find this place after a day of sightseeing in London. We really can't wait to go back and we will definitely keep this place in mind when we need to stop for a bite!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YVIyn9K6a0qsv1Bw_eidAA"
  },
  "Iv_tusAP1AHGRFvYIWzWVg": {
    "date": "7/2/2017",
    "text": "Nice location right outside of the Kensington Garden.  Recommend to go for beer and drinks but don't expect fast or much service at all.  For drinks, try to order at the bar and don't wait for the wait staff.  One of our food orders didn't come but because everything was taking so long, we didn't mention and just paid our bill and left.  The starters are not great but Yorkshire pudding dishes are better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FwhMQQ7j0u7agThX5adGHQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FwhMQQ7j0u7agThX5adGHQ/o.jpg"
      }
    ],
    "user_id": "1h_Dwv0hUEKs3z59BAgRmg"
  },
  "fkXHo4M0vRXe3z2itJJV0g": {
    "date": "7/1/2017",
    "text": "Had dinner here on the last night of our 10 day European/British vacation.   Food was exceptional.  We had the Fritters, Chicken wings, Fish and Chips.  And Chicken Kiev on the special board.  All were very good.  Service was great.My daughter had her first Pint here, a lasting vacation memory.  The beer garden down stairs looks like a good spot if you want to get away from the busy pub up stairs.  Only down side was it is extremely dog friendly, and the night we we're in, there was a dog barking in the Pub.   But no points taken off for that as we are a dog family and understand how that goes.Cheers....",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NsMeXGpotvleDtQz_iH_g"
  },
  "3bsUdGh1CI349m6bsnsBJg": {
    "date": "8/18/2015",
    "text": "Typical English pub, the food and service were great. It is in London so it will not be cheap. The beer they served was nice and refreshing. They did honor one free pint of beer from Yelp and that was very nice. The calamari had a very light batter and they were fresh and tasty. The chicken wings were free range chicken not very spicy, but very tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1Zwu_dSMjRFjSKYRp6qVKw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Spicy chicken wings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Zwu_dSMjRFjSKYRp6qVKw/o.jpg"
      },
      {
        "img_id": "ni-qzzNTV97AYGYGDLpFiQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Fresh calamari",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ni-qzzNTV97AYGYGDLpFiQ/o.jpg"
      }
    ],
    "user_id": "ufICbdVlGBGKTKkyy6uBmQ"
  },
  "1MkCllHJ1hL8EzfURabQHQ": {
    "date": "2/3/2018",
    "text": "Just what I expected...food was good and the service is quick.  Food came to the table quick as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLsaT-y-xqEgXi51IVX-mw"
  },
  "RN2L51Adqmqq-98S3f73YA": {
    "date": "6/29/2016",
    "text": "After almost a month of living in Notting Hill, I finally made it to The Champion for dinner. This place was literally advertised in my move-in packet as being \"right around the corner\" and \"a great place to grab after-work drinks with mates\" (loosely paraphrasing, but still) so I had to try it. Little did I know, it was pub quiz night - luckily, the quiz takes place in the main foyer, and I was able to grab a table downstairs in a cute, secluded part of the restaurant.You order at the bar upstairs, and take your seats and wait for table service. Kind of haphazard, but it makes sense the way the restaurant is set up. Service is quick and friendly.It's perfectly standard pub food (coming from someone that has been to a single pub) - the fish and chips were really good once I doused them in vinegar while they were still hot. Their sides - roasted vegetables & salad - were pretty unimpressive. The veggies, which I envisioned as being a few different kinds of vegetables, were just some half-roasted yams, and the salad was undressed lettuce and a slice of tomato.I'm sure there are more \"classic\" London pubs, but if you're craving fish & chips or something else greasy and are in the Notting Hill area, you'd do worse than to go to The Champion.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MumODgS0Q4C6r5gYoIdiaA"
  },
  "h_iwywFqvdCBVYixnTsbYQ": {
    "date": "10/5/2016",
    "text": "As crazy as it may sound, I so miss The Champion!My husband and I were in London in early May 2015 and our hotel was about a \"block\" - an American term - away from this awesome little pub.  After passing by here a couple of times on our way to sight-see, we decided to stop and have a drink and dinner and were so glad we did.This became our \"regular\" place over the few days we were here, and we were so impressed by the quality of the food, the friendliness of the people, and the general laid-back, comfort of the place.I highly recommend stopping by for a drink or food if you're in the area, or even somewhat close.  The Champion was so, so awesome!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTWsLLPN_JsafbV-MJA1ug"
  },
  "Pq2JaE1ve-Gl-pfhwG828w": {
    "date": "5/28/2018",
    "text": "Solid bangers and mash & fish and chips. Good beer selection too, although service was a bit slow.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amOJ-ExLLKeujH4Jv3Th0g"
  },
  "eHfgCX3GAujLHrOnFsbq1w": {
    "date": "5/23/2018",
    "text": "A lovely holiday was abruptly spoiled by server at The Champion who took the liberty to help himself to my credit card info.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FpVBV54kWvP3TY9e7uQpLg"
  },
  "rkNKhsy2cGMpl_Vm0NcVfA": {
    "date": "1/25/2017",
    "text": "The place is a wonderful gastro-pub~The roast chicken is moist and succulent, the pot pie an experience of fresh and subtle flavors which I truly enjoyed.Heck, even fish and chips are big fun!My partner and I were in London for one week and came here 3 times, bringing guests the third time. It was the very first place we ate after getting off the plane from LA, and after the initial experience, we were enchanted, and had to go back. In case you are already sold after my first two sentences, I had the exact same wonderful experience as Steven E, who wrote a Yelp review on 11/26/2016!  It's great!Very, very friendly staff~",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cg6YmnT0Va0cXiXQ51NFIg"
  },
  "hKPVq-4I_SCRyOz0EcfYUg": {
    "date": "6/8/2017",
    "text": "We headed to this pub when we were craving fish and chips.  The food was great and the beer selection was also good.  It was a bit of a walk from our flat in Notting Hill but was a great choice.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeQ89-J0c64OmNGAKMubKQ"
  },
  "Ig50-90EuQpHqM0wEw7wdg": {
    "date": "6/12/2017",
    "text": "Great selection of beer and cider. The staff was very nice, and the food was excellent. If you'e looking for a good pub with great bar food, don't miss this place!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hpGnrSfpajo8yPEf4IUfbw"
  },
  "nj6-G45vMxVfB-t_oImigw": {
    "date": "12/17/2016",
    "text": "Best beers we had in London. Many rare craft brews as well. Great food and ambiance. Bartenders were all really friendly and service was great.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hCtNwGCxEY32y38VzCff0A",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Warm pub on a cold night",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hCtNwGCxEY32y38VzCff0A/o.jpg"
      },
      {
        "img_id": "lZyq-tASqyLPd5pET_LwJw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Mulled cider and great beer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lZyq-tASqyLPd5pET_LwJw/o.jpg"
      }
    ],
    "user_id": "kcXO1s7HPiO-QoziQcNCGA"
  },
  "28P27JgD9dT1polZvztJog": {
    "date": "10/27/2018",
    "text": "Great atmosphere - although limited menu.We came back three times on our trip .Recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZvkKLlc-zZbCKqObX2pKtQ"
  },
  "0IhbZnWEn-tOS4VZb36dZQ": {
    "date": "10/22/2018",
    "text": "Food was great but a bit expensive, service was terrible. Definitely a bar for drinking, not for eating. Took almost 40 minutes for them to take our order and we were the only people eating as far as I could tell. Forgot our drinks and didn't get them until end of meal, took forever to get the bill. Billed us for the comped drink promo on yelp. Wait staff was super inattentive. Like we weren't even there. Just really bad service. Some of the worst I've ever experienced.Fish and chips and burger were really good. Brownie with ice cream was tiny but great. Beer was good.Food was a 10/10, service was like a 1/10.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "etmhf7c7REgh-j17ffyACA"
  },
  "Y0P4tNV6XGmADu9Dq4D8cg": {
    "date": "9/16/2018",
    "text": "After too many pints, I'm guessing it is a multiple times a day tradition for patrons to sing Queen's We Are the Champions in the small garden, the basement lounge, or the large pub/dining space upstairs. They serve up traditional British fare near Hyde Park and Kenington Palace. Despite their proximity to these touristy spots, they offer solid food and drink options. They had a large beer list, and more importantly, the fish and chips with a side a mushy peas was tasty and satisfying.Bonus points for free water on the bar. Double bonis points for the setlist of rocking jams - my wife was in her happy place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ll9xYfxhRJ3gy3upckMrTQ"
  },
  "A4e1HGUQnrtbNGMmHlRpcQ": {
    "date": "10/20/2018",
    "text": "Been to London 5 times and this is the best fish and chips we've had. By far. Sat by the cozy fireplace after walking around the Kensington gardens.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WAm8Ko61geZ7Ey9WXdKEGQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WAm8Ko61geZ7Ey9WXdKEGQ/o.jpg"
      }
    ],
    "user_id": "cnKtDF1kjrZ2XBbMR6_3Ww"
  },
  "xZWt-yTn9K8SeM44j7tkBA": {
    "date": "4/14/2018",
    "text": "The Champion is one of the many English pubs that dot the London scene. We were a group of six (two of which were children under the age of 12) but lucky for us, the Mercury Lounge downstairs was open and had seating (the main dining room upstairs was jam packed). We had the downstairs lounge for most of our visit (occasional smokers would come down to smoke in the outdoor patio off of the lounge).While we sat downstairs, one had to order at the bar upstairs. They bring down the food when it is ready. The menu was typical English pub grub. I again opted for the fish and chips... I have not quite yet found the best one yet, but thought I'd try at a place called \"the Champion\". It was definitely good! I upsized my order, and probably should have had the regular size.Service here was decent. The staff seemed a bit disorganized when it came time to check out. We settled the bill upstairs (I guess everything is done at the bar). No one seemed to know which table we were. After about what seemed like an eternity, the person who took our order showed up and \"remembered\" our table and printed out our check. We did not realize until we got back to our hotel and checking our credit card receipt that we actually paid for the table who later came downstairs after us!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ERoPHDAbdBf-5EXMZI-u0A",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ERoPHDAbdBf-5EXMZI-u0A/o.jpg"
      }
    ],
    "user_id": "1keSzYrEUFfCNKJjB4MduA"
  },
  "6Jy4V4K15K-hYBGRB7pRGQ": {
    "date": "7/24/2018",
    "text": "Looking for an English pub that's not sticky and run down? Head to Champion in Nottinghill just north of Hyde Park. We popped in for a cold one after a long day sightseeing on foot. The barmen were helpful in suggesting some local brews and the price was right. Cute atmosphere with a large after work crowd. They also had a gorgeous patio out back and trivia on Tuesday evenings. Two thumbs up!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m9pn9_jLeDYIde8anbV2ew",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. In full bloom.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m9pn9_jLeDYIde8anbV2ew/o.jpg"
      }
    ],
    "user_id": "Hg-XAfgMBX9SqK_JJyo0DQ"
  },
  "FANE1l2vroUZyA9FZPX8ew": {
    "date": "9/29/2018",
    "text": "Nice corner pub with friendly staff, always willing to give suggestions. Very mixed crowd that tends mostly to young adults. Always seems to be almost full to capacity with people. Definitely would recommend if your in the area, especially when compared to the surrounding cafes.Typical Pub that delivers.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5x5x4Mkc8E6KNq4pxhurw"
  },
  "kHkw9FLoVgfLCwJ4YOCLsQ": {
    "date": "11/29/2017",
    "text": "We rolled in at around 1 on a Sunday with a group of 6 and panicked a bit bc we hadn't made a reservation but the staff helped us nab a seat. Our whole party took a while to arrive but the waitstaff never rushed us to order. They gave us good guidance on the menu - especially the best vegetarian options. One of our friends had brought her dog and they quickly brought out a bowl of water for him which was so attentive! For the humans, the food came quick and with generous portions. The vegetarian Sunday roast was quite nice with well cooked sides and lots of gravy. Would definitely advise (unless you're scared of dogs!) given the lovely interior, kind and attentive service and all the cute dogs at the pub!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "BytRWk8X1OelSgwwfXd8Aw"
  },
  "6AWp82gLbgBaS4x_xPjddg": {
    "date": "9/22/2018",
    "text": "Typical English pub. Good selection of local and named brands. Good food. Great service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8nTKFPOnsPMXwbKpwq8Vg"
  },
  "OOMU18IlueYxut_J5PxP6Q": {
    "date": "12/20/2017",
    "text": "This pub was really close to our hotel so we stopped in for dinner on our way home. It turned out to be quite nice. The atmosphere was quite nice, a semi modern twist on the traditional pub, on both the decor and menu. I had the fish and chips and my husband had the rib eye. We enjoyed both along with a cider. The staff was nice but not very attentive. We had to order our dinner at the bar since no one came to our table. Others seemed to get some table side service but not much. I wouldn't go out of my way to go back, but it's worth a stop if its on your way.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yOwQ4dCJ1KgKKAxiycO-jg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Rib eye",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yOwQ4dCJ1KgKKAxiycO-jg/o.jpg"
      },
      {
        "img_id": "gbDetdNpyKJLLrtqya-fGQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gbDetdNpyKJLLrtqya-fGQ/o.jpg"
      },
      {
        "img_id": "Wf6ibzinZNoJroROvdEjVQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Merry Christmas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wf6ibzinZNoJroROvdEjVQ/o.jpg"
      }
    ],
    "user_id": "oCQL1K75KqzptANKH5eUCQ"
  },
  "UfX3Cnd1fDb4dphq-qWaOA": {
    "date": "10/15/2017",
    "text": "One of the better pub establishments for food I have being to in London.  This pub has a higher end feel for food, and drink than most pubs, I went there on a Sunday for lunch and was surprised by the number of people wearing nice sweaters/jumpers, and drinking coffees.  I had the fish and chips, and a microbrew local IPA, and everything was quite lovely, not the best fish and chips but pretty good for Sunday luncheon.  Maybe I should have gotten the roast because I saw a number of people ordering it, at least this place was clean and was decorated way better than a typical pub.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E68ZPVpcuWhxvnjq8vTqAA"
  },
  "miPmzWuXG35KfPJhE-LA8w": {
    "date": "11/21/2017",
    "text": "Dog friendly. Seriously. CleanTrivia, no, QUIZ Night on Tuesday with 50 lb prize Need I say more?Yeah, free pint  with check in!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sgszG_7y2tn6iYBZX37zKg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sgszG_7y2tn6iYBZX37zKg/o.jpg"
      },
      {
        "img_id": "QmWLLzEqr5TtAVRZeQf8vw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QmWLLzEqr5TtAVRZeQf8vw/o.jpg"
      },
      {
        "img_id": "uBoHRrhUWkYnYeyApEZsjQ",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uBoHRrhUWkYnYeyApEZsjQ/o.jpg"
      }
    ],
    "user_id": "5-gXtqDOkj1ZBLIeV6OciQ"
  },
  "QNxZzTJRW6Wjy4vZyYKigw": {
    "date": "5/7/2018",
    "text": "I really like coming here for a pint or two. The staff are usually very nice and when it a nice day, it is great to sit outside. My big issue with the pub is the food is just not good. I've tried quite a things on the menu and their sandwiches are not bad but the rest is just not good. Have a drink, enjoy this awesome pub, just don't eat here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mhWVns3lOstbppkbytBTIQ"
  },
  "OkLphcRr_-cPeSlm1sha7w": {
    "date": "10/21/2017",
    "text": "So good! Popped in here around 530, only seating was outside but that was okay. Got the rosemary fries & chicken and my husband got the mash and sausage. Also got the house red wine and the English lager. Everything was superb, dinner came out quickly. Couldn't ask for a better meal. Absolutely stop here if you're in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0EAHakQr9c0BqA8H3FQ5dg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0EAHakQr9c0BqA8H3FQ5dg/o.jpg"
      },
      {
        "img_id": "G6Ihen6Vt--1enTr35yuZg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G6Ihen6Vt--1enTr35yuZg/o.jpg"
      }
    ],
    "user_id": "WjnbU7FdHgwewazjIHyamQ"
  },
  "BmibvsOv17MrwAG5p5KRdQ": {
    "date": "8/25/2017",
    "text": "Great beer selection as well as food.  We ate hear during our last night in London with a group of 10. We tried a lot of different food options ranging from the fish and chips to and sausage and bangers to the quinoa burger.  All were great!They have a great beer selection that kept us wanting to try more!It was pretty busy and service was pretty good considering how busy it was.  Staff was pleasant and happy to explain the different beer selection. The fish and chips were on point.  I had fish and chips 6 different times while in the UK and this was top 3.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "d2xbN_kxrhU9I4rSLbw_pA"
  },
  "EC8mVMy7YVCPM6ydWj3h6w": {
    "date": "4/4/2018",
    "text": "Wonderful local pub! The food was truly excellent. We ordered the rib eye steak (delicious!), sausage and mash and fish and chips. All were amazing. The atmosphere was fun and friendly. Highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CDKXKgacZDyGvl1WhS4iKw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Fantastic fish & chips!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CDKXKgacZDyGvl1WhS4iKw/o.jpg"
      },
      {
        "img_id": "vJV7kNPZkKsLLXR00AT6tg",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Ribeye steak with horseradish butter!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vJV7kNPZkKsLLXR00AT6tg/o.jpg"
      },
      {
        "img_id": "MsneYiNY2f3lryCHl5QR1A",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Sausage and mash!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MsneYiNY2f3lryCHl5QR1A/o.jpg"
      }
    ],
    "user_id": "uZrczfRJeF9ucBKrzOhEYQ"
  },
  "V7Z62RH5ihclWwi9IrofDw": {
    "date": "11/26/2016",
    "text": "My wife and I were in London for one week and came here 3 times. It was the very first place we ate, and after the initial experience we were haunted by the food and had to go back. In case you are already sold after my first two sentences and are looking at the rest of this review like lol tl;dr, I want to quickly leave you with this pro tip: make a reservation online if you want to eat dinner / want a table in the evening. One of the dishes that made us pine for the Champion after the first visit was the slow-cooked ox cheek and mashed potatoes. The meat was melt in your mouth. We're not sure what they put in their mash, but it's magical... probably some of the best mash ever. Across our visits we had the bangers and mash, mac & cheese, beef pie, ox cheek, and sticky toffee pudding, and all of them were outstanding. The atmosphere is quite nice, the bartenders are friendly, and the beer selection is better than most pubs if you are a craft beer fan... they don't just have 6 different lagers on tap like a lot of pubs. They had the Meantime (Greenwich based) Hop Kick Pils on tap, which was likely the best pint we tasted in London.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jk4J4Oyl1Fw4z_sw0jRaPw",
        "caption": "Photo of The Champion- Notting Hill - London, United Kingdom. Ox cheek = amazing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jk4J4Oyl1Fw4z_sw0jRaPw/o.jpg"
      }
    ],
    "user_id": "Rjjcmt_fHiN4SXt6VbaIJA"
  },
  "3eX3iJ-9jyMadfM6Inae0w": {
    "date": "7/16/2018",
    "text": "This place has a website that includes a kid's menu, but when I took my family here the waiter indicated they, in fact, do not. And he wasn't particularly appreciative or accommodating to our quandary. So confusing and weird. Definitely not a place to take kids. But again, I emphasize, their website has a kid's menu. Why????",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3pofbn5j3krou5AGGg_VNw"
  },
  "hxi8hAomm1K2cLaE22pLtQ": {
    "date": "12/2/2017",
    "text": "excellent service, ok food, busy place. went there for dinner with two friends, I ordered Sausage & mash. pretty traditional, not very exciting. my friends ordered Fish & chips, I had a bite, a bit too greasy and lack of taste.I may come back on Sunday to try roasted items.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2PaUztb6pdZMvhMrXp05MA"
  },
  "_ShHmDTe0IGir82jUgPHBA": {
    "date": "8/19/2017",
    "text": "Very nice I came in here for a quick bite they had a butternut squash risotto to die for it's a Saturday evening so it was a little crowded so it was hard to find a seat but very typical English pub except they had more of a healthier variety of food to offer than most that I've seen",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QHX3NxFAlda3I32taYzI8w"
  }
}