{
  "0d_Ep4CGFKytoyCH-fHRvQ": {
    "date": "1/7/2015",
    "text": "Good service and plenty choices in the menu. Authentic Malaysian tea is definitely recommended to everyone. The only complaint is that the fish I order smells a little bit near the part of its head. Maybe the fish is not that fresh. All else are perfect and would definitely come back again if I was London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KNeyecs1Dh86fQ2if16vrw"
  },
  "6SQIUF69dd_wYcI1Rw-bAw": {
    "date": "10/21/2010",
    "text": "3.5 / 5Very similar to Thai food that I've had here in LA.  The service was very good and my wife and I were lucky to get the table next to the door.  You'll have lots of locals walking by and stopping to see what food you're eating.  Uncomfortable?  A little at first.Anyways, everything we ordered was great.  The picture I uploaded was an interesting pink drink.  I thought it was very good.  My wife thought soda and milk should not mix :p",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vMX9DfbzCOP2fjejSWc5wA",
        "caption": "Photo of Tukdin - London, United Kingdom. rose syrup with milk and soda ... mmm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vMX9DfbzCOP2fjejSWc5wA/o.jpg"
      }
    ],
    "user_id": "Pj6EZiNxtAnuxy1yUrDxgA"
  },
  "p5D-2okfp4HJdv1lcjsH1A": {
    "date": "11/2/2011",
    "text": "This place is legit!!  Stayed at a hotel nearby for a holiday with my mom and cousin.  We ate here the first night and we couldn't resist returning on our last night as well.The eggplant dish is DELICIOUS!!!!  So bold and spicy.  A mild rice side dish is the perfect compliment.  Beware though, if you're not familiar with Malaysian food, or dried fish, you might want to avoid the Nasi Goreng KPG.  I wasn't a fan but I think it's more of a preference thing.It's been 2 months and I'm still craving this food!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "e0wdKXD2X51CKQO8x87g8A"
  },
  "DhodbZKmasxSlJjR1UuzfQ": {
    "date": "8/30/2013",
    "text": "after 3 years of living in the area, i'm kicing myself for not getting in there sooner...it was excellent.. but please note below:1) satay chicken - OUTSTANDING - very good portion and the satay sauce is divine... even for finger dipping on its own.. yum!!!2) grilled aubergine in the chilli paste - OUTSTANDING - two large slices of aubergine smothered in sauce. health conscious peeps out there beware.. it is pretty oily.. but all oh-so-good3) beef slices in soya - DELISH - smothered in thick sweet soya sauce, a very rich dish that goes very well with rice4) Garlic fried chicken - VERY good - ordered this based on the reviews.... i don't think i will get it again bc i thought it coming without a sauce was a bit dry for my taste, and overall a dish that packs calories.  It is however very nicely crisp and juicy inside, so if this floats your boat... GO for it.5) banana fritters - CRISP - ordered this based on the reviews... the ice cream was delcious, and the batter was VERY crisp, but what did not do it for me was the mushiness and the blandness of the banana... it tasted floury... which is a pity... as i don't think this one will be a repeat (for me).6) grass jelly juice - YUM - i am sure it doesn't float everyone's boat, but i LOVE this, sweet and gelatinous was quite refreshing. \"i\" am a fan7) sprite... umm.... yep... standardall this for £45 (with tip). DEFO a repeat. super nice service.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "na3UYTLl5dFNrHrOurmM6g"
  },
  "W34EpHsBCeusowtZPzGv0A": {
    "date": "11/27/2013",
    "text": "Get the black glutinous rice desert. Sounds disgusting, tastes incredible. Their Malay dishes are quite good, especially curries and soups.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KIm8Y_d7ykQEUcy0eeDWlQ"
  },
  "sYQNzr_ixRvTICdGP84ssw": {
    "date": "8/2/2012",
    "text": "This place is a short walk from Paddington Station and Hyde Park. Very good food, nice clean little place. Coconut rice was great and spicy mango sea bass was unique and very tasty. No liquor license it seems so don't expect to drink a lot ; but great food and pretty good service.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8KD2IgZ7YUql3jnfx6B8w"
  },
  "AHN3QRYSMohSJ3QlcUM-_Q": {
    "date": "6/24/2010",
    "text": "Tukdin Flavours of Malaysia - Pics at The London Foodie (thelondonfoodie.co.uk/20… ) I am enjoying the 2010 Malaysian Kitchen Campaign a great deal. The opportunity to find out more about one of the most fascinating but relatively undiscovered Asian cuisines (and eat a lot of it in the process), right here in London, is an opportunity not to be missed. I was lucky enough to have been involved in this campaign for the launch of the Malaysian Dining Card at Kiasu (reviewed here), and more recently as part of a Malaysian restaurant tour which included Awana, Satay House and Tukdin. The event was organised to showcase what these restaurants will be offering at the Malaysian Section of this year's Taste of London Festival. Our final destination was at Tukdin, a charming little restaurant on Craven Road, Bayswater. The restaurant felt very Malay (as opposed to Hokkien-Chinese or Indian); the clientele appeared to be native, and wonderful smells of spices, coconut milk and grilled fish were wafting through the air as I came in. It was nice to see entire Malay families eating together, and I could sense a delightful camaraderie among most customers who were probably regulars and clearly knew each other. Malaysia has three main ethnic groups  the Malays, Chinese and Indians. Since the Malays are predominantly Muslim, there was no alcohol or pork on the menu, and all the meat served was halal. To kick off proceedings we had Satay Goreng (chicken served with peanut sauce) served off the skewer. The meat was sweet and had a delicious char-grilled flavour, and in my opinion, was the best Satay of the evening. Mee Goreng Mamak (vegetarian fried noodles) was served next. The soft yellow noodles had a lovely richness, and a slight sweetness from the kicap manis (Malaysian sweet soy sauce). The noodles were stir-fried with chunky pieces of firm tofu and rice cakes and topped with ground peanuts and spring onions. One of the best dishes was the Ikan Rasa Khas (sweet and sour sea bass). The fish had been cut up in chunky fillets, deep fried and topped with a delicious sweet and sour sauce made from tamarind and chillies. I also enjoyed the Daging Salai Masak Lemak Cili Api (grilled beef in coconut sauce with lemongrass, turmeric and chilli). The combination of the creamy, sweet coconut milk with the tart lemongrass went particularly well with the grilled beef. To accompany these main dishes, we had coconut and corn rice and Tukdin's special mixed vegetables pickle called Acar rampai. The Kupang Berlada (mussels in chilli sauce with lime leaves) was also excellent. I could taste a rich mix of flavours including pineapple, coconut milk and lime and with a touch of heat from the chillies. This was again a very good dish. I enjoyed all three restaurants but felt that Tukdin was particularly special - the food was fantastic and great value, and I cannot wait to return. I would also like to revisit Awana for a more considered opinion. I strongly recommend trying some of these restaurants' dishes available at Taste of Malaysia if you are planning a visit to Taste of London Festival this year (17 -20 June) in Regent's Park.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TKE_h9zyl10szWS7PuIa8w": {
    "date": "7/12/2010",
    "text": "Tukdin's menu isn't huge (like, er, no roti?) but what they do I dare say they do well. They only have three starters for example, the satay goreng (which was still as fabulous this time around), sup asam manis (prawn and squid sour soup) and karipap (chicken or potato pasties). And with the exception of the yellow-ish beef curry, which tasted more like a Thai green curry (no rendang!), all the mains were To. Die. For. especially the rasa khas, a large slice of deep fried sea bass in Tukdin's special sweet and sour sauce big big heart Everything was appropriately spicy, the sambal udang (prawns) carrying a delightful kick and the kangkung belachan, that one made my nose run and so it absolutely should! To challenge their limited starters menu, Tukdin offers all of two  that's right, count with me now: one. two.  desserts. Bubur pulut hitam (black glutinous rice with coconut milk) and pisang goreng (banana fritters). The pulut hitam came with a large dollop of vanilla ice cream which would seem rather generous to ye olde regular bystander but here's the thing: this dessert is never served with ice cream! Totally veering left of tradition here but hey, it worked. And it worked a treat. And the banana fritters? I think the 'nanas were a little unripe but hey, that's not their fault. Overall, I LOVED Tukdin and will be back!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KdvW_S_wYxDh7DlhNEkiuw": {
    "date": "12/15/2011",
    "text": "To list my credentials: Born in Malaysia, lived in Indonesia and Singapore for years. That said, food here is solid, very authentic. I had the nasi lemak, always a favorite for me. A very decent place to go when I start getting homesick. Now, if only I lived anywhere near here...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EYMJ7duJTByjSfjuNhLQ7g"
  },
  "xlAu7UicOMepOgh96Z4wGw": {
    "date": "12/13/2010",
    "text": "how can you beat authentic cheap eats?  the restaurant was packed with southeast asians and locals.  (didn't see too many folks who looked like tourists with backpacks/suitcases.)  noodle soup was delicious and perfectly warming for this chilly weather.yes, lots of tourists but hey, you're near paddington.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsS8xgyW_rjflrQnhI9Fdg"
  },
  "-m5IjjiMRK1BO-6ncIShQA": {
    "date": "7/19/2011",
    "text": "Tukdin, a family run restaurant in Paddington, offers a choice selection of authentic dishes that demonstrate the best of Malaysia.Malaysian cuisine is the original fusion food, bringing together culinary influences from native Malay, Chinese and Indian cooking. For starters why not try Chicken Satay Goreng (£6.50), tasty bite-sized chicken marinated in oriental spices with a delicious peanut sauce, served with rice cubes, cucumber and onions; or Sup Asam Manis (£3.90) a delicious prawn and squid sour soup garnished with pineapple and tomato.Meat lovers can indulge in a traditional beef Rendang (£9.50) cooked in coconut milk with spicy Malaysian spices and herbs; or a delicious chicken Masak Merah (£6.90) cooked in spicy tomato sauce. Nasi Lemak Kosong (£2.90), coconut rice; and Tukdin's crunchy mixed vegetable pickle Acar Rampai (£4.50) complete the meal.Fish and seafood dishes include traditional Ikan Sos Mangga (£18.90/£15.90) of either grilled sea bass or mackerel served with a savoury mango sauce; and Udang Sambal Tomato (£7.90), prawns cooked in chilli, tomato sauce.Tukdin also specialises in traditional street food. The Masakan Warung (Hawkers Delight) Menu includes Nasi Goreng KPG (£7.50), traditional spicy fried rice strongly flavoured with dried shrimps; Mee Goreng Mamak (£6.90), savoury fried egg noodles with beancurd, eggs and shrimp fritters; and Kway Teow Goreng (£6.90), stir fried rice noodles with seafood.Vegetarians can choose from tasty dishes such as Terong Berlada (£4.50), aubergine with chilli paste flavoured with lime leaves; Sambal Tauhu (£5.50), beancurd cooked in chilli sauce; or Pajree Nenas (£4.50), pineapple sweet curry.All desserts are priced at £4 and diners have the choice between delicious Bubur Pulut Hitam, black glutinous rice pudding served with coconut milk and vanilla ice cream; Malaysian style Pisang Goreng Aiskrim, fried banana fritters with vanilla ice cream; or Pengat Pisang, banana with sweet coconut sauce.Not to be over looked is Tukdin's thirst quenching selection of traditional Malaysian drinks including Sirap Bandung Muar (£2.20), rose syrup with soda water and milk; Lychee with lychee fruits (£2.50); and delicious Soya Bean with grass jelly (£2.50). A selection of teas and coffees are available including Misai Kuching (£2.50), a traditional Malaysian brew hailed for its cleansing properties. Tukdin entices with an exquisite melting-pot of flavours and provides an hospitable welcome to its customers. The friendly staff are always ready to help those in need of assistance, whether seeking a recommendation for particular preferences or choosing the perfect accompaniment.To find out more about Malaysian ingredients and recipes, visithttp://www.malaysiakitchen.co.uk",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pvIBSEyrvVTbD4EgDlkn8Q": {
    "date": "3/29/2011",
    "text": "Tuk Din serves authentic Malay food. The satay goreng is scrumptious, something different from the satay that you get on the sticks. The nasi lemak is delicious as with the other dishes. Will definitely return.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "SisnaY_6nYE1Oa056shCSw": {
    "date": "11/25/2013",
    "text": "Good food, superb peanut sauce, ok curry, good price for portions, quite slow service at lunchtime.  Cute place with a nice atmosphere.  I'd go again, but not for a nice night out.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y2ohLh8LVWYxb248AKxwFQ",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y2ohLh8LVWYxb248AKxwFQ/o.jpg"
      }
    ],
    "user_id": "q6ibE-PiceizG6Pjk3OMmA"
  },
  "uZkyJ80KGGC23L_-MKHrpg": {
    "date": "9/7/2015",
    "text": "I went there Saturday night with 6 friends for the first time. I booked our table (the restaurant is pretty small).The food was fantastic and traditional, it was a real success and I will definitely come back to try other dishes",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YIyKYXuJJI7i-pU24XBzGA"
  },
  "PqL-UKX625X_VRDsGkydlw": {
    "date": "2/6/2016",
    "text": "A great find for Malaysian food junkies.  Went with my Malaysian fiance and 2 friends who spent the past 3 years in Singapore.  We were thrilled to find good, authentic food.  The staff, chefs, and 1/2 the patrons seemed to be Malaysian... which was encouraging from the get go. The food was awesome.  The sea bass was crispy and flavorable.  The randang was quickly devoured.  The aubergine was delicious.   While we didn't have alcohol, the entire bill came to less than GBP80.  This fed us until we were stuffed and left us with leftovers.  Nice to have a new casual, yummy, and affordable dining option in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCDvxSJAGXDkTq_kObVi1Q"
  },
  "QpcoCKXFEOYsPF1UTEZr6g": {
    "date": "3/22/2017",
    "text": "The most delicious food!! Everything was cooked to perfection and full of different flavours.  Staff friendly. Recommendation, 100%. Go. You won't regret it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIyB9hgfL54sA0CnDqPBUw"
  },
  "c8z65PmnF_OEgCf3POwo_w": {
    "date": "4/12/2014",
    "text": "Coming from Silicon Valley where we have gazillions of great Asian restaurants, I thought Tukdin was not that special.Don't get me wrong, the food was delicious. I was excited to try their Rose water drinks. It was peculiar but I liked it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3_9OnpLUVgPOQNedADFjZA",
        "caption": "Photo of Tukdin - London, United Kingdom. Rose water with milk",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3_9OnpLUVgPOQNedADFjZA/o.jpg"
      }
    ],
    "user_id": "Glt6xvnJVXg5n6rtWF_-4w"
  },
  "WqbQuCwmNinErj4gdcTRkg": {
    "date": "1/23/2016",
    "text": "The food is ok. Do not order the Kari puff as the crust is so dry. The service is really slow and not organized with the order system. I am giving them a 2 just because they are Malaysian restaurant and all the Malaysian ones are about the same in London. The people were complaining about being too busy. If that is the case go to 6 tables and do it well. Not Sedap!",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ix0V0BXAfROgGFq-c3sgRQ"
  },
  "yU7IG1BpdrEP-d0XlL_SBA": {
    "date": "3/16/2016",
    "text": "This place is fantastic. Everything we tried was terrific. Lots of flavor without excessive heat. Don't miss the mixed vegetable pasembur and the black rice pudding. Reasonable prices for this neighborhood, too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qiN9q0Der8O2C6jBO17JuQ",
        "caption": "Photo of Tukdin - London, United Kingdom. Oxtail soup. Aromatic spices and melting, almost creamy meat. The portion was enough for two as an appetizer.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qiN9q0Der8O2C6jBO17JuQ/o.jpg"
      },
      {
        "img_id": "nLGKKfz4gnKQDMeR_a9JQw",
        "caption": "Photo of Tukdin - London, United Kingdom. Beef rendang. Salty, sour, tender.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nLGKKfz4gnKQDMeR_a9JQw/o.jpg"
      },
      {
        "img_id": "2sDBLPEclFc1jqdyjvjAEg",
        "caption": "Photo of Tukdin - London, United Kingdom. Mixed vegetable pasembur/rojak. Different from anything you've had before, but you're going to love it. Have it with the coconut rice.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2sDBLPEclFc1jqdyjvjAEg/o.jpg"
      }
    ],
    "user_id": "s3YE_gYMg6z6E723EXliXQ"
  },
  "yjxuQ7UuB5ZOd5wNnZut7A": {
    "date": "11/21/2015",
    "text": "Quick service, great food, attentive service. I'll defiantly be back. Very authentic flavours - defiantly try the coconut rice!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysafjbp3KMfC5ok7vmK0GA"
  },
  "REr5jFLMH3yeMO4gUnonyg": {
    "date": "5/18/2014",
    "text": "Quick glance:+ Authentic Malay flavours+ Reservation accepted+ Cozy venue+ Friendly staff- No alcoholTukdin offers simple and authentic dishes from Malaysia. Although presentation may be lacking, the flavours are bold and tasty. The restaurant itself is small and cozy, so reservation is recommended.I came with a group of about 10 and the venue was more than happy to hold the tables for us on a Saturday evening. Unfortunately, there were some problems with the order and they missed off one of mains we have ordered (it happened to be mine). It was disappointing they didn't bother telling us until I asked about the missing dish, but I can only guess they aren't used to dealing with such a large volume of order for one party at once.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC4IUf5o5xjoAyUdTbm21Q"
  },
  "SkJsUI4LKpOwcFrU7U7SRA": {
    "date": "8/14/2011",
    "text": "That's what I love about balmy summer nights in London. It encourages one to get out and walk round our great city. It was on one such random excursion this weekend that I stumbled upon Tukdin.It's located just far away enough from the tourist trap centre around Paddington station to need to serve good food in order to survive.I discovered from my server, who happened to be the daughter of Tukdin that the restaurant was started and is named after her dad. Unusually for a Malaysian restaurant in London, it's owned and run by Malays, which is reflected in the halal sign on the door and a sign stating different opening times during the current month of Ramadan when Muslims fast during daylight hours.This ownership is translated onto the menu, which leans more towards Malay food and of course there's no pork on the menu.It was nice to see traditional drinks like rose syrup and teh tarik on the menu. I however settled on a lychee juice which came with 3 plump lychees in it.I started with curry puffs, 2 parcels of chicken curry wrapped in a lovely light flaky pastry. The crimped edges bring memories of Cornish pasty but it's much smaller in size and the pastry is much lighter and flakier.I then set the kitchen a stern test - fried koay teow (broad rice stick noodles). It is my favourite hawker (street) food dish and I've even stated in public that I just may have to marry a girl if I find out she can cook decent fried koay teow. The perfect version is bursting with heady aroma of garlic and the slightly chared edges of the rice sticks and every mouthful is a taste of savoury heaven.I've tried to reproduce this dish at home, using tips as diverse as adding a stock cube to sourcing the freshest koay teow straight from the factory but it doesn't come close to the best versions. Perhaps my domestic hob just can't generate the fiery temperatures required to get that proper fried taste into the noodles.I'm glad to report that the fried koay teow was good. Not the best in London but it's up there for sure.The only slight disappointment for me was the chicken curry, which lacked the true depth associated with the best chicken curries.There was a healthy number of Malaysian accents in the restaurant. I willo certainly dine here again when I'm on the area.",
    "rating": 4.0,
    "rated": {
      "useful": 23,
      "funny": 10,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "BFOLzx32mx5G84mh8Qi9Ag",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BFOLzx32mx5G84mh8Qi9Ag/o.jpg"
      },
      {
        "img_id": "eLp1SytqeuRJ0jNtdL6pfA",
        "caption": "Photo of Tukdin - London, United Kingdom. Curry puffs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eLp1SytqeuRJ0jNtdL6pfA/o.jpg"
      }
    ],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "n43Hy7FA6pDyQdyt__Rh9w": {
    "date": "5/30/2011",
    "text": "Well, it would be criminal if this Singaporean turned American turned Brit mutt didn't go to a Malaysian restaurant 15 minutes walk from his flat. This is why statistics requires you to have a sample size of 15 (for a student - t distribution) or 30 for a normal distribution. 3.5 stars is about as wrong for this place as Obama refusing to bow to the Queen. Been here three times since moving and I have to say, it's the best Malaysian food west of Old Street (only because I've heard Sedap is just as good, but who the heck from West London would travel out that way just to eat?!).  The only other place  that probably is more authentic, but you'll either have to look Malaysian or speak Malaysian or be accompanied by one, is the Malaysia House - i.e. embassy. Food here is delicious, authentic and served with just about the nicest people on the planet (faux pas and inappropriate alert: I think they're secretly mormon - j/k!). You HAVE to try the sambal belachan (additional chili-paste on the side). It will scrape paint off the side of a car, but with every possible authentic taste that Malaysia could ship over in an aircraft. Anyway, anything you order here is good (at least in the case of most of the dishes I've tried), but beware, it does get a little on the pricey side because of it's location. Serving sizes are caught somewhere between British and American, which also means a decent meal for how much you pay.I'd also recommend not coming in groups of more than 10 (we did one time),  because I don't think their kitchen can really handle it, and some of the food came out tepid - but you can always get them to nuke it back to life. PS for the culturally uneducated and since I have written about alcohol at different joints - this place is run by muslim folk so forget the alcohol at home or pop over to the adjacent bars after if you need it.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "7Dub32evcemffptOA7FSRw",
        "caption": "Photo of Tukdin - London, United Kingdom. Good spread!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7Dub32evcemffptOA7FSRw/o.jpg"
      }
    ],
    "user_id": "_5pQIxCTGyjd89bqgUonNg"
  },
  "n5YHL8J6SKpw61z2BEt1MQ": {
    "date": "5/8/2014",
    "text": "Just try it.  Quaint and great food if you are burnt out on disgusting pub food and need variety.  This isn't Thai or Chinese it's the real deal!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mpBlD0c7CgXOrsPyDWjOVQ",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mpBlD0c7CgXOrsPyDWjOVQ/o.jpg"
      }
    ],
    "user_id": "yC8cVmEznJZQFm0k7mEZ6g"
  },
  "Pxfj6qFbOl09AIPEeHtIlA": {
    "date": "8/29/2013",
    "text": "You can't go wrong with chicken... but this place probably has the best garlic fried chicken I've ever tasted! I am not a massive fan of Malaysian food but I gotta say this one hits the spot. Staff was super friendly. We had the place for ourselves as they were about to close by the time we arrived. It was a bit annoying that they started vacuuming while we were in the next room but they did apologize in advance and asked if we minded so that's ok.   I strongly suggest the fried banana for dessert - it's awesome!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qMEWEhMMtG90t8my48f7jg"
  },
  "bRmKcWs3bSuJAK4lJwzDrw": {
    "date": "3/21/2016",
    "text": "This was my first visit to this restaurant. I stayed in the Park grand down the road and went by. The service was very friendly and quick. Regarding the food I tried Pajree Terong with is kind of a vegetarian sweet and a bit hot curry with rice. It tasted fantastic. Considering the price of 4,50 Pounds for a regular dish and 2 Pounds for the rice this was a fantastic dish. I will definitely return to this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsJyw_z2rl0fbWLxL_aFlQ"
  },
  "Lee9zcvObUVW-VL2d0Ex5w": {
    "date": "10/3/2013",
    "text": "How many kinds of rose water drinks can you have on a menu?  If that's something you have always wondered (I do, daily) you can finally find out at Tukdin.Tukdin is a small and cozy Malaysian restaurant with a robust menu for omnivores, carnivores, and herbivores alike.  Its presentation is kept simple and authentic, but filled with flavor all the while.  I enjoyed the sour pineapple soup so much I contemplated ordering a second. The Nasi Lemak (which came with crispy fried chicken) was solid, as well as the rose water drinks.  Prices are reasonable.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "O54Cg0aiAihN4Lp-uPZOfw": {
    "date": "7/3/2016",
    "text": "This was tasty food served with politeness and attention. It was also inexpensive. We were staying a few blocks away at the Corus Hyde Park hotel and it was a pleasant respite from all the pub food we've eating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DG1B4fNaoUbzFccpwN2xbw"
  },
  "-gYaWWtNA7Gx_lWZGQ1DaA": {
    "date": "1/12/2013",
    "text": "James found this place close to our  hotel and as he loves Indinesian food, wanted to try Malaysian. Looking up Tukdin, I saw Yee Gan O. gave it a great review and he is a foodie guru. We had the curry pasties and satay starters followed by Mee Goring Mamak & Beef Rendang with coconut rice. The food was complex, delicious and plentiful. As we couldn't manage dessert, we tried the herbal coffee & The weird an wonderful grass jelly. A great meal and c.£40 including 2 rounds of soft drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Be4R-gxhJiZ-uBVasX5x5w"
  },
  "dFOHiZA5tAJyrg4UKQQe5w": {
    "date": "5/22/2016",
    "text": "pretty good Malaysian food, nice service, not super quick, but we were not in a hurry anyway :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DXUYOkUqXjFwT7F6HUn0jQ"
  },
  "CwFeBs9JdIDJLOoaA1wzGA": {
    "date": "3/15/2015",
    "text": "We knew it was going to be good when we walked in and everyone in the restaurant appeared to be Malaysian. The chicken satay was fabulous! We were not familiar with Malaysian food so we asked the waiter for recommendations and he was very helpful. Definitely give this place a try!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9N2kj6c3dEo9jk6IF9nhRg"
  },
  "FEAF4dKrN3ipmWpFmIfWBQ": {
    "date": "5/14/2012",
    "text": "The things I liked about this place the most was the welcoming environment, warm staff, and very unique and flavourful food. I'd never had REAL Malaysian food before and my introduction to it was definitely pleasurable. The deep fried chicken was excellent (forgot its real name).  The curry puffs were like Cornish pasties, but much lighter. The koay teow was also extremely tasty, but if you don't like fish, well it might be a little much. I thought it was excellent, I will be back whenever in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "R-rqPWJTQZrKxJPKEwClzA"
  },
  "oA0Hn07VEVVO0SLx-7bPhA": {
    "date": "7/19/2018",
    "text": "Amazing Malaysian food. Taste like home and at a reasonable price in London. Highly recommended,!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0D3wYvencIYf1eJjhEzOBg"
  },
  "3bvCbCPUn2J9Fpd18CLfaQ": {
    "date": "3/4/2018",
    "text": "I realized I never wrote a review for this place because I just had so little time while traveling through Europe for the first time.   Here's the thing I live in las Vegas and sadly Malaysian food is scarce.   I grew up with my oma who was part Indonesian making amazing Malaysian style food.   I was determined while in London I would find a place that brought those authentic flavors to life.   Being able to quench that nostalgia when I came here was such a blessing.  Every single dish was so full of flavor,  and had it's own unique qualities. There was love and generations of knowledge flowing through every bite I took. Even the rice was fluffy perfection.  I also appreciated the extensive beverage menu of non alcoholic drinks.  The rose drink with grass jelly was addictive,  the lychee beverage refreshing and not overly sweet like it can get at some places.   The key really to everything here was bold flavors that balanced eachother.  It truly was a peice of heaven to me,  and one of the highlights of my trip.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Sy7O7H1ktBDgQh8nWnkXkQ",
        "caption": "Photo of Tukdin - London, United Kingdom. Coconut rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Sy7O7H1ktBDgQh8nWnkXkQ/o.jpg"
      },
      {
        "img_id": "3CYJGMTMjVgTKCzwXOECXQ",
        "caption": "Photo of Tukdin - London, United Kingdom. Nasi  lemak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3CYJGMTMjVgTKCzwXOECXQ/o.jpg"
      },
      {
        "img_id": "rfAN736jHFSzCT2PCGYk1A",
        "caption": "Photo of Tukdin - London, United Kingdom. Vegetarian dish",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rfAN736jHFSzCT2PCGYk1A/o.jpg"
      }
    ],
    "user_id": "XYZw8rWQ0wjMWQChRCU8Hg"
  },
  "p6IjlPy8KVKuR5bd0kBIng": {
    "date": "4/8/2018",
    "text": "This restaurant is located about 5 mins from Paddington station and is close to the Malaysian embassy. It's not a large restaurant - seats about 30 pax and I had no problem getting a seat for lunch on Sunday. But I have seen the place very busy even at 9pm on a Friday so it is popular. When I was there, most of the diners were Malaysian so clearly the food is authentic and the prices reasonable. And all this was true when I was there. I had nasi lemak Tukdin, oxtail soup, keropok and Ice Bandung - all Malaysian hawker staples / favourites. Food presentation was good and the food was tasty and authentic overall. The nasi lemak rice was particularly flavorful - full of coconut milk flavor, it had the right texture and basmati rice was used so the grains are drier and more discrete, giving a better mouthfeel. The keropok was crispy and tasted authentic, as did the ikan bills (fried anchovies) and fried chicken in the nasi lemak. The oxtail soup tasted exactly as it is in Malaysia with all the right spices and fried onions (which was FANTASTIC) and the meat was flavorful and 'fall off the bone' tender.  Service was friendly if a little slow, but I think there's only 1 wait staff for all the patrons so be patient. All in all, a very pleasant experience and I would recommend coming here for a very inexpensive and authentic experience of Malaysian food in London. For Malaysians, definitely a must!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BS75gihFusDNBEIR2nbRPg",
        "caption": "Photo of Tukdin - London, United Kingdom. Keropok and oxtail soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BS75gihFusDNBEIR2nbRPg/o.jpg"
      },
      {
        "img_id": "TJSGSOjEM_s-J_LegE1f7g",
        "caption": "Photo of Tukdin - London, United Kingdom. Nasi lemak",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TJSGSOjEM_s-J_LegE1f7g/o.jpg"
      },
      {
        "img_id": "j6cTIkQiaR5NSTVK2AyVNA",
        "caption": "Photo of Tukdin - London, United Kingdom. View from the window at Tukdin",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j6cTIkQiaR5NSTVK2AyVNA/o.jpg"
      }
    ],
    "user_id": "CRNLxbmm5iV0xgtGzhrOTg"
  },
  "LN4_M6wmPK8EX62OwAwcEg": {
    "date": "9/13/2016",
    "text": "Hands down the best stir fried noodles ( Char Kuey Teow ) that I've had outside of Malaysia for 16 years. I haven't been home for 16 years and I have had my fair share of Char Kuey Teow in different Malaysian restaurant in US and UK and Tukdin was the best ! We ordered a spicy shrimp with petai ( oh my god , petai aka bitter bean. Love it and miss it ) and it came out just the way I remember having it in Malaysia. We also managed to order some Ox Tail soup and it had the same spices that I used to remember. I can't tell what it is but you will smell it when you are almost done with your soup. Service was good , our waiter was attentive and prompt. I don't live in London but if I do , this would be my new favorite Malaysian restaurant. The one thing I would probably mentioned is that the watercress seems to be a little old and it needed to be cooked just a little longer so that it's a little soft but yet still crispy. Other than that everything was perfect.If you would ask me to summarize Tukdin , I would say it reminds me of the food that my mom would have cooked for me when I'm home in Malaysia. Comfort food. Simple yet delicious.  Definitely do give it a try if you are ever in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QVrJLwYeBuEG8-x281IYYg",
        "caption": "Photo of Tukdin - London, United Kingdom. Chinese watercress with sambal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QVrJLwYeBuEG8-x281IYYg/o.jpg"
      },
      {
        "img_id": "HQh7lchX5_OPoQWBObHugw",
        "caption": "Photo of Tukdin - London, United Kingdom. Fried noodle,  shrimp belacan with petai",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HQh7lchX5_OPoQWBObHugw/o.jpg"
      },
      {
        "img_id": "jSpMKxkkOuYC5HWijfZTYw",
        "caption": "Photo of Tukdin - London, United Kingdom. Ox tail soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jSpMKxkkOuYC5HWijfZTYw/o.jpg"
      }
    ],
    "user_id": "MpQv0tlpDuX6SI1k7_DuSQ"
  },
  "5qXBixHZF3M1D8S5DuL6gA": {
    "date": "9/23/2017",
    "text": "This place was just ok. Friendly service and the veggie dish and coconut rice were ok but not amazing. The rendang curry we had was simply not good and didn't taste like it should.  Some of the meat cubes were quite tough as if they had been microwaved.  Clearly it hadn't been cooked in the curry and it was just sauce dumped on top. With so many other options around I'd recommend looking elsewhere but maybe I just came on an off day.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7EOm7WAQfVGnmBSY5pYQg"
  },
  "eCHjg6Xc40y7fWsHvc9Ovg": {
    "date": "9/18/2016",
    "text": "Tasty, authentic Malaysian cuisine is just a quick walk from Paddington Station. Strolling in at about 7pm on a Saturday night, it was a packed house (though I fortunately found a table to myself). I had my eyes set on one thing: beef rendang. I scored an order and glass a rose syrup drink with lime; service wasn't exactly friendly but the food came out very quick. The rendang may have been cooking a while too long, with the beef much chewier than expected. The flavours, rich in coconut milk, lemongrass, and galangal, were spot on, if a bit oily. A decently priced meal (rendang, rose syrup, and a side of rice came out to a little over £13) and probably worth a return trip if I'm back in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 8,
      "cool": 9
    },
    "photos": [],
    "user_id": "dqo-o6O847KTF3NDADxxDg"
  },
  "7pJyHgHDGfCZaE8_PiwQvQ": {
    "date": "11/18/2017",
    "text": "Quite decent food. Probably best fried rice outside of Malaysia. Sublime coconut rice. Chicken Satay and Tea tharik weren't up to the mark but the rest were good. Will definitely be a regular here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GbXFTs4xUgp9IwA5MfZKsg"
  },
  "mc5EwvfhdiXel8t3_Hrc3w": {
    "date": "8/9/2017",
    "text": "We went here on a late night (about 10pm), the restaurant was still with quite a lot of customers. The waiters were friendly and patient waiting for us to order. We didnt wait for long for the food to come, and they served us water without us asking^^.  Authentic Malaysian food. Recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jEVluy2qwu6r960ufLU0cw",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jEVluy2qwu6r960ufLU0cw/o.jpg"
      }
    ],
    "user_id": "wX17kuI3xkj62773pCewPQ"
  },
  "W-eEbJ374NIRdr_vsGNiiw": {
    "date": "8/7/2017",
    "text": "This place seems like a different style of Malaysian food. They have oxtail soup which I don't come across in other Malaysian restaurants. Food come quick. - fillet sea bass fish w/ sweet & sour - Chinese broccoli, squid & shrimp - noodles which ended up being soupy- watercrest, onion w/ spicy sauce - soy bean w/ grass jelly",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "plIqYQLJ1sGr6K0djbd1dg"
  },
  "BKseOO8Spqd4Oc7tMwNGtg": {
    "date": "5/24/2018",
    "text": "The Satay is to die for!!  The fried noodle was excellent as well. I finished the meal with the Malaysian tea, it is on the sweet side.  Treated it as my dessert, so it's not bad.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbFGWhd_USrAVkHeBxEcrw"
  },
  "7oxtdUbL10D32MFyltIdvQ": {
    "date": "5/22/2016",
    "text": "Fabulous restaurant with great food and staff. I walked in without a reservation, but the staff was so nice to move empty reserved tables around for me to sit alone. The food and price point was good for what you get in London. I got a noodle dish. Definitely want to go back for the Kari seabass every other table was ordering.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kOczQYfW4Osb1p4R821s3w",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kOczQYfW4Osb1p4R821s3w/o.jpg"
      },
      {
        "img_id": "jenTM8fIEXw3UTsOejxHVg",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jenTM8fIEXw3UTsOejxHVg/o.jpg"
      },
      {
        "img_id": "avDcmO3fM41Hw25VWQm_FA",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/avDcmO3fM41Hw25VWQm_FA/o.jpg"
      }
    ],
    "user_id": "obijr6vOAPxzhkwzS957yA"
  },
  "qtHhIgQuC7GYS65ewooddQ": {
    "date": "5/6/2016",
    "text": "I've been here a few times and have tried their Mee Goreng (a classic Malaysian noodle dish). They can make the dish vegetarian which is great and they always check if eggs are okay which is great for vegans. I always find that their food is quite oily. If you get it to go - the bottom of the container is pooling with oil which is unpleasant. The service is quite dour and even if the restaurant is empty there is very little care and attention given to the clients. That's the main reason for my 3-star rating. I ordered an iced tea and was pretty annoyed to see the cashier mixing powdered tea and warm tap water together before serving it with a cube of ice. They charged me 3 pounds for a drink that wasn't even made in house and with little attempt to hide it. It's not a bad restaurant and in a pinch I would still drop by though I wouldn't bother with the drinks and would definitely get the food to go just to avoid the service.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BytRWk8X1OelSgwwfXd8Aw"
  },
  "BmoRo8FZC_4OnU9oF2yG5Q": {
    "date": "5/20/2018",
    "text": "Nasi Lemak was excellent.  Just like in Malaysia and cheap for London.  I will be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQek0Ft9uFPRuxP9Z3g5-A"
  },
  "TVQLJ4jaYZvP6ngltAoBww": {
    "date": "5/30/2018",
    "text": "Just moved to the area. Was recommended Tukdun - it is probably the best Malaysian restaurant I have been to. Very very tasty food and great service. The number of other Malaysian's who eat there is a testament to the quality of food served. Will be back many times!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tfWngrPHTIg8riMfQbWJTA"
  },
  "eKDU-cQS5ASByW2UMhWrew": {
    "date": "8/12/2017",
    "text": "I visited London last month and our hotel was very close to the Tukdin restaurant.  I had never tried Malaysian food before so it was a first for me.  While I cannot remember what I ordered, I can say that it was a lovely meal.  Wonderful flavors, spicy and it more than exceeded any expectations I had.  A small restaurant but intimate; my twin sister and I were seated in the back.  Everyone was very welcoming, the service was extremely prompt and the food arrived quickly.  I ended the meal with a wonderful malty tea and according to my twin, she had the best cup of coffee she had ever had in her life.  She asked the server to write down the name of the coffee she loved it so.  A wonderful meal and a wonderful evening.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BniZUGEcnH1GACXBsOUCWg"
  },
  "v0Bgw8rQhJwod3Kid4ujyw": {
    "date": "7/19/2017",
    "text": "A quaint Malaysian restaurant near my hotel in London. The food and service were amazing. I ordered the nasi goreng and fish curry, which were both tasty. While it wasn't super authentic likely because the ingredients are different, the flavors were reminiscent of Malaysia.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CH09qt9I0IqdA57zvQ8_mw",
        "caption": "Photo of Tukdin - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CH09qt9I0IqdA57zvQ8_mw/o.jpg"
      }
    ],
    "user_id": "ZjO9pUVjY3ZfYTEoIELplg"
  },
  "L9DyHaW9vyOSZJIAHKnHwQ": {
    "date": "9/4/2016",
    "text": "Good solid well executed food. Had the chicken satay and the garlic chicken entree plus coconut rice. Both were piping hot, garlic chicken crispy.  Saw a large steamed fish go by to another table and looked generous and not chintzy like some places.  Small but well decorated, classy interior.  Service was a little spotty but eager.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OmEpzRfwZAgCS0AlDcj9Ag"
  },
  "RjhsPZGXmVxFx6ONMXRmoQ": {
    "date": "11/18/2015",
    "text": "Lets face it London isn't known it's great food.We had time between flights and this place was close enough to transportation.Thats all not much more to say",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7ffJwemR6psfvnGN-cDlg"
  },
  "gEff96TIgjEuUWW2gROcPg": {
    "date": "12/19/2015",
    "text": "Second visit here. The first was a few months ago and was blown away by the quality of the food that I had to come back to verify this wasn't a one off. Authentic cooking utilizing authentic spices makes you want to eat more than what you can accommodate! I went for the Mee Goreng with Garlic Chicken ( both comes separate). The noodles were succulent with a sweet tangy sauce which I could have not have enough off! The Garlic Chicken was deep fried giving a crispy outside but was moist on the inside with infused garlic. Where most deep fried chicken usually tasted like a lump of oil soaked meat, this was not the case.The restaurant was 95% full for most of the time I was there with most of the clientele being of Malay/Asian origins. Perhaps giving testament of a home cooked meal! My partner went for the Oxtail soup which although is listed as a starter you can get it as a main meal size portion. The feedback I had was that it was very tasty with a little spice to give it that 'zing'Service was polite and professional with the food delivered in an acceptable time. Not cheap here but not expensive. If you are driving, then parking will be a challenge during the week. More spaces on weekend after 1:30pm when the restrictions are relaxed.This will be my regular haunt going forward and would definitely recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjiUXeILqOV-sXwCyiQLyw"
  },
  "5e1zXK_qMYjGS41_Titf-Q": {
    "date": "8/24/2013",
    "text": "This place is like others say, real authentic.The curry puff, nasi lemak and other dishes were packed full of flavour and obviously cooked by Malay expats. The small downsides being that the nasi-lemak was a little stingy. Only less than 10 peanuts on the plate, 2 slices of cucumber. Now Malaysian Delights is a good example of what a real portion should be like. Food also came out quite quickly, given the fact we were the only people in the restaurant and the stoves were probably turned off.This aside, I loved every dish. The staff were extremely friendly and the perfect hosts Our group were the last customers before they closed and they asked us before starting to vacuum in case the noise disturbed us.I would most definitely take Malaysian friends here if they were feeling a little homesick.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ikiJ4BOOaZVE2lurJrxdPw",
        "caption": "Photo of Tukdin - London, United Kingdom. Nasi Lemak Ayam (Coconut Rice Chicken Sambal)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ikiJ4BOOaZVE2lurJrxdPw/o.jpg"
      },
      {
        "img_id": "JIcrdl6sCnDR3137n2tnFw",
        "caption": "Photo of Tukdin - London, United Kingdom. Curry Puff Chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JIcrdl6sCnDR3137n2tnFw/o.jpg"
      },
      {
        "img_id": "u0A-WdDNCkoaiDqk19PuQw",
        "caption": "Photo of Tukdin - London, United Kingdom. Sharing Dishes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u0A-WdDNCkoaiDqk19PuQw/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  }
}