{
  "xQMszZpXPEAPtQJH9nXZqg": {
    "date": "9/6/2013",
    "text": "Beautiful arranged dishes are works of art; winning wine list; attentive service.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCiAn7esOAh9LRsSM65SSg"
  },
  "Alnj6d4RQk60wYHmrjxSWQ": {
    "date": "7/27/2010",
    "text": "Amazingly inventive scandinavian food cooked to perfection. The lunch menu is quite reasonably priced given the quality of the food. I can only dream about coming back for the seafood tasting menu. A must!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_SmK7sPegNCXH-oYR7503A"
  },
  "eLUarxdJS1CBsI-Xjx36Ag": {
    "date": "1/3/2013",
    "text": "Last night diner was amazing, fresh simple and tasty. 8/10. ordered Gravlax as a starter Icelandic cod as a main, perfectly cooked nice presentation! I did not expect to get so fresh meal. Recommend to anyone who likes nordic simplicity and modern cooking.I will definitely go back there again!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MMC9JlKKJPXvLS2CQ7x1oA": {
    "date": "6/25/2008",
    "text": "Texture is certainly a little pretentious, but please don't let that put you off! The trick with this restaurant, I feel, is to think of it as an experience or an adventure, rather than simply a place to eat food. Although the atmosphere is a little imposing, the wating staff (of which there seem to be far too many), are actually very friendly and helpful, if a little humourless. My 2 companions and i all chose the set menu, which I think was about £65 per head, and I would reccomend this to other diners too. Although 3 dishes are listed on the menu, Texture delivers a variety of interesting, slightly outlandish but always tasty food experiences between each course, which staff describe for you in some detail since it's not possible to tell what you are eating or drinking by looking at it or tasting it. I really enjoyed this aspect of my meal at Texture. It turned a meal into an adventure, and that was very pleasant. But of course, most important is the food - and this was all very good indeed. It was all well cooked, and although it was all unusual, often in texture as well as taste, I found that this was part of the enjoyment of it. Foam does feature, but not heavily and where it appears, it feels appropriate. The only slight drawback to Texture is that the wine 'list' is more like an encyclopedia - it really is several inches thick. And as the wine starts at around £30 per bottle and goes up to several hundred pounds, you want a wine list you can skim for an affordable but drinkable bottle, which isn't possible with a wine list this long. That said, once we had chosen a (very nice) bottle of white for around £40, the sommelier did a very good job of making it last for exactly as long as the meal did. I like Texture - and next time I need a special occasion to mark with a special (and relatively well off) friend, I shall return. I'd reccommend anyone try Texture once.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "46_236re4mcV-z6B7wv_gQ": {
    "date": "12/8/2007",
    "text": "I've only been to the bar and not the restaurant and the atmosphere and setting is a fair bit more upmarket then I'm use to. The entrance is understated and easy to miss (we walked past twice!). The bar area (which is separate from the restaurant) is simply but elegantly decorated but quite small (probably wouldn't comfortably fit more than 25 people). The cocktails are very nice though, premium ingredients were used and this was reflected in the price. It's called a champagne bar but the drinks list is not limited to just champagne. If you've got some cash to spend and you're looking for somewhere chic, intimate and impressive (in a grown up way), Texture would be a good choice.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lfD22g580gJI0jnOxd8y8w": {
    "date": "1/28/2014",
    "text": "Excellent tasting menu options - creative and experimental. Definitely should be on the London foodie's hit list, but amongst it's competitors, I'd choose a more out there, unique experience with more of a buzzy atmosphere. Great for a romantic date night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "m0vRiuLRjS_B0tT3oppqbQ": {
    "date": "10/17/2013",
    "text": "I LOVE THIS PLACEbest. tomato. mozzarella. salad. ever. It's the simplest thing to make but they made it AMAZING. I wanted to lick my plate.Great lamb chop, wide and interesting variety of wine selection. Knowledgable staff that gives great recommendation on f & w pairing. Very attentive service. Lovely atmosphere...And may I just say that they make some mean champagne cocktails? I don't normally drink cocktails at all. But I had their old fashion champagne cocktail and my mind was blown. I had such an amazing time at Texture that i can't wait to go back again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LphHVE8Alp4P-irzg2Rang"
  },
  "t9RB3kui5PxLfdMfoR9r2A": {
    "date": "7/7/2012",
    "text": "Two words: BACON POPCORN. Seriously. As we were waiting for the rest of our group to show up at the champagne bar (well waiting really isn't the word, more like having an hour's worth of champagne/cocktails), they put down a bowl of the stuff. It is AMAZING! I can't even describe it. I wish I had a bowl of it every time I saw a movie. (At home, at the cinema. I don't care, I want it.) But enough about the popcorn (well, that's not completely true either), the eight of us took our seats and had the tasting menu. Everything on the menu was delicious, but there were definitely four stand-out courses for me. The first course of pea and mint soup was fantastic. Quite intense flavors. Next was the heirloom tomatoes with mozzarella and basil. The tomato flavor was insanely intense. The quail course was amazing, and it was served with a bit of bacon popcorn! Probably the best course of the night! The last course of passion fruit soup with basil ice cream was great! The ice cream was completely refreshing, and it was a great way to end things. The other courses were also delicious, just not quite as exciting! The bread was also really amazing.I'd definitely go back! If only for some drinks and bacon popcorn!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 5,
      "cool": 7
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "1Duz0lZ3T6SaaF0Tha6SOA": {
    "date": "11/13/2014",
    "text": "The food is exquisitely presented and my dessert was one of the best I've ever had in my entire life. I don't think Texture really sets itself apart from other fine dining establishments as the food isn't that superb but it is well worth a visit! Keep an eye out for their lunch offers which are great value and a good way of experiencing fine dining but without the hefty price tag.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLkHVykmYbnHz-TF9O0mkA"
  },
  "j6JpSZQBNTEAEmxz4Wwi2A": {
    "date": "7/12/2012",
    "text": "Bringing up the rear of the triple main course was a chargrilled beef rib eye served with ox cheek, horseradish, and an olive oil béarnaise. The beef was my least favourite item, tasting distinctly of liver and even having some of the texture I associate with liver (that slightly powdery foretaste). The ox cheek was bursting with flavour and I could have easily eaten 10x the amount. Special mention must be made of the horseradish sauce that had the bite you'd expect without the intense sinus-clearing smack down you get with horseradish. I'd love to have a pot of that to spread on roast beef sandwiches in the future.The pre-dessert was a strawberry granita with a dollop of cream. The taste of strawberries was so fresh you would swear you were frolicking in a field of them and picking the succulent fruit straight off the vine to pop into your mouth. Pure bliss I tell you.Finally, dessert. This took the form of a passion fruit soup with basil ice cream, cubed mango, and a ginger granita. Now, I'm a firm believer that all desserts should have chocolate and give fruit a pass, but this dish persuaded me otherwise. A clear slightly syrupy \"soup\" created from the essences of passionfruit surrounded a pastel green scoop of basil ice cream. The cubed mango and ginger granite were artfully scattered around the bowl giving the overall impression of a spring time bloom (something we're not used to seeing in London). The flavours were incredible with the slightly sour passionfruit being balanced with the uber sweet mango and the basil ice cream providing a refreshing cleansing effect to the palate. The ginger granite provided crunch and a bit of warmth although I could have used with a tad more ginger taste (I'm a huge fan of ginger though). Overall, one of the best desserts I've eaten in a long time which pretty much says it all.Oh and the selection of petit fours are unrivaled by anything in London. Save the lollipop looking one until last, however, as it's a refreshing mint best saved to cleanse the palate at the end.Other thoughts: I didn't get the wine pairings (£60 on top of the £80 for the tasting menu) but the rest of the table sang the praises including Dan and Ellie who were our resident experts having lived in France for two years. The waitstaff are very friendly and tailored the menu for allergies and dislikes with ease and grace. The tasting menu took almost 4 hours to go through so be warned that this isn't a quickie but something to take your time to enjoy. Overall, a high win in my book and well deserving of its Michelin star.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6n2p7LfvKPdGc7C3QfxqpA",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6n2p7LfvKPdGc7C3QfxqpA/o.jpg"
      },
      {
        "img_id": "nxH55e-U-waCcLym3VKIZw",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nxH55e-U-waCcLym3VKIZw/o.jpg"
      },
      {
        "img_id": "fS2p6X3Lfei_b4XdJ-AT0A",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fS2p6X3Lfei_b4XdJ-AT0A/o.jpg"
      }
    ],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "yi2Sv3oztx5O1TzVLudOQg": {
    "date": "4/2/2012",
    "text": "My boyfriend and I went to Texture on a trip to London in 2009. It was, hands-down, the best dining experience we had while there, and one of the best in my lifetime.I see that it's now Michelin starred, which is well-deserved. The flavors of each creative, innovative dish still stand out in my mind - more so than any restaurant I've ever eaten at across the world, and it's been over three years. We're headed back to London this year and will be visiting again. Will update based on the undoubtedly wonderful meal and time that we'll have there.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XF4nyiyjz4wQztyjcQPN0g"
  },
  "92GvGzZ5yTdCwP99erdY-w": {
    "date": "9/20/2012",
    "text": "We had a very enjoyable dinner here.  The meals were well-presented and had excellent flavours and textures.  Every meal had different elements to savour on their own and combined with the others.  I would echo some of the other reviewers who were impressed by the style of cooking which differentiates itself from the other top restaurants out there.We had the Organic Salmon gravalax and Scallops for our entree.  The salmon was delicious and I got to try a piece of the scallop which was cooked to perfection.  For our mains, we had the Grain Fed Ribeye and Lamb.  My lamb was delicious with the cooking sauce/juice, but the ribeye was only good (not great).  However, it did come with some great chips which were nicely crunchy on the outside and fluffy in the middle.  We had the basil icecream, mango and passionfruit soup and valhrona white chocolate for dessert.  We enjoyed a bottle of Pinot Noir (from New Zealand) throughout the meal.The service was amiable and attentive, however some of the explanations of the dishes were too fast for me to understand.We had some extra small dishes before our entree and dessert, which were nice touches.  One was a shot of tomato and lemon grass gazpacho which was very refreshing.Total price was just over £200 which feels a bit pricey, but was worth it for such a good meal which is a treat that you don't have every week.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "bdryvmWGOn-YEIT0m6Xx4Q": {
    "date": "10/1/2011",
    "text": "Recently my friend and i have been on a mission to collect Stars. because... why not, its something to do during a random wednesday. so we devised a plan to go have *one* course at a several different places, all with in walking distance from eachother - Restaurant Hopping, as it were.the day we had Texture as my first stop.... well lets say we didnt go to far because we simply couldnt only have one course.i ride up on my bike, park it literally outside the door and waltz in, a bit sweaty and windswept, but they hardly batted an eyelash. i explained our mission and they smiled and showed us into the dining room to a nice little table. they certainly know what theyre doing there. everything was just *so.* the cutlery, the glassware, the plates. visually, the place had a certain grace and order to it that made you feel calm, secure, and collected.i dont normally eat bread at restaurants - i find it makes me too full to be able to eat the real deal - but this bread was yummy. even though we went to get just one course.... we got the 2 course lunch menu (not bad at £19. i spend that one course easily enough. and for 2?? yes please.) the food was lovely. tasty and visually stunning. however, after 2 courses i was still wanting a little more. which would have been fine if we were getting a 3rd course. but as we had other stops to make....i would like to go back and do a proper tasting menu there and see all they have to offer.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "I3URSVRu24EaGWpvZB0cuA"
  },
  "uyODRjqiUBJQxa4h9pbOkQ": {
    "date": "4/5/2014",
    "text": "I personally like the restaurant - this had been around even the times Noma brought si much attention to Scandinavian and Nordic food... And it serves good, tasty meals with good source of ingredients. Got me, try for lunch deals if you are slightly tight on budget or go for the full dinner menu if you can afford it. I don't go too often but I do enjoy when I go. I always just take the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "ixIlathAXB9_8OZqYwgsig": {
    "date": "2/16/2010",
    "text": "Texture's cuisine style is modern European and focuses on combining and emphasising different consistencies. I believe this restaurant  has received a Michelin Star!Food: Innovative is the word I would use to describe the food here. I shared a meal with my mom and some friends here, and it was a unique and memorable dining experience. They have a tasting menu, A Scandinavian tasting menu ot you can order A la Carte. My mom and some friends said the scandinavian tasting menu was fantastic. I had the lamb and it is probably the best lamb I've ever had. It was cooked to perfection and each bite revealed layer upon layer of balanced and delicious flavors. I would recommend going with the wine selection by the master sommelier, they are a perfect accompaniment to your meal.Ambience: The restaurant is housed in a renovated Georgian building. Great lighting, decor and design. Perfect for business lunch or a romantic dinner. Service: was very attentive but never intrusive. Tip - Make reservations. It is close to Oxford Street.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "KETa97Knz4ZJZPv53CHGcg"
  },
  "H-Q8ACKNalZPhcZfhBt-qQ": {
    "date": "9/15/2013",
    "text": "Great food, personal and including service from a team of highly skilled employees. We felt at home at once and had a brilliant meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ytSd7c3goiuqkFbQoLT90A"
  },
  "2hELY9M7DwDFX0OiO5fg5g": {
    "date": "4/11/2013",
    "text": "This restaurant was absolutely fantastic, there is nothing I could say that was bad about it. The attention to detail was amazing there was nothing during the service that went unnoticed, including making sure the food was brought out exactly on time. The flavours are very unique and definitely worth trying. This is one restaurant that is worth a visit even if its just to try the fantastic wine selection and hear the advice of the great sommelier.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q15Z9AfFJCYIFcTqVmdW0A"
  },
  "euiZyOKcH2Q7s0PdAJZEAw": {
    "date": "5/11/2012",
    "text": "The food is very unique. Its like no other food that i have tasted, and i have tasted a lot as a foodie. Very different than French Laundry or Gary Danko. Service was impacable and very accomodating. They really try to  make it work for me eventho Im a last minute walk in customer. They have 7 course fish tasting menu, a scandanavian tasting menu and a la carte, which is the route we took to save time and pound sterling LOL. They started us with a thin lightly fried crackers made out of salmon skins, etc. and then then a complimentary mint peas that is sweet, salty, smooth like a pudding and have a touch of rough black pepper for texture, simple and nice. Then we had seared scallops that was big, sweet and succulent with black caviar on top and grapefruit beans, macro greens, and mascoporne bubbles. For main we had the veal cheek (very tender, to die for), and salted cod, pan seared into perfection, with white wine and shrimp sauce. It was delicate, elegant and beautiful taste! Price is very reasonable especially if you dine only a la carte. They also have lunch deal for only 21£ for 2 course tasting menu if you really want to stretch your money :) It's so worth it considering it's a michellin star restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UcihR7SXobyx0jG-WqrmDA"
  },
  "HD8D_JWKji0btq3NxjNbEw": {
    "date": "9/7/2010",
    "text": "This place is scrumdiddlydumptious! Doesn't look like much from the outside, so over the last few years since it opened i have walked past and not really though much about it. Finally went in and boy am i glad. We thought we would have a little tipple prior to eating (it is a champagne bar AND restaurant after all) the bar area is quite small, but cute, with a weird mixture of people. And tables with an ice bucket in the middle - pure heaven - I have to have one in my house, who needs to keep visiting the fridge when you can have ice on tap in front of you, heck these should be compulsory post 2010 on all coffee tables in production. Anyway, back to the food, we were served bacon popcorn (worked well for all the salty popcorn lovers out there) and a selction of crisps, well sliced bread, parmesan and seaweed and dip. I opted for beetroot and goats cheese for starters, followed by the chicken for main, and my was it yummy! served with an egg, bacon and a yummy lemongrass sauce, and after speaking to the maitre'd learnt that the food is cooked by sous-vide, a kind of vacuum packing to help intensify and keep flavours. Dessert I opted for strawberries complemented with a delicious 'soup' and granola and yoghurt, tasted like a very gorgeous breakfast. The chef is iclandic and aims to create healthy food, by avoiding cream and butter in the food, but my it was still so tasty. The surroundings were ecclectic. Think big white room with twigs and sand and big candles, complemented with huge paintings of volcano erruptions. Loved everything here, down to the iclandic plates on the tables! Will most certainly be returning!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "l5T5aXNkdD5tdBJJoBB-Qw": {
    "date": "10/14/2012",
    "text": "Texture is the best restaurant in London in my very humble opinion. I could go on and on and on, but really it wouldn't make a difference. Just go and enjoy. Dear chefs of various overrated Michelin starred London restaurants (you know who you are), you should pay a visit too and learn how it is done.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJxLO-VKW6W_H2wMiyijOg"
  },
  "RdaEUhf6s7P_dNJ-iLriLg": {
    "date": "5/13/2010",
    "text": "I went here to celebrate a promotion and decided to go for the tasting menu. First off, the interior is very nice, I think some people could be a bit intimidated and feel they really need to dress up but in fact it is a quite relaxed, just don't show up in torn jeans and trainers and you'll be fine! The starter was not very impressive, I can't say that I liked it that much, a beetroot dish, but from there on the menu got better with each dish. The beetroots were followed by a very nice soup and then the fowl served with sweet corn and popcorn. It sounds strange (it was actually supposed to be bacon popcorn but I couldn't really tell) but the texture combination was really interesting and very nice, especially the sauce. The best part of the tasting menu though was the dessert which was divine, I would go just to have this again. In short, recommended for a special occasion and to try their quite original dishes but not somewhere I would go just to have a good meal out.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n5EstAV-NoLvrw6VaB2L0A": {
    "date": "5/6/2010",
    "text": "With the volcanic ash cloud causing disruption around the world it was apt that we should come to a restaurant with the first Icelandic recipient of a Michelin Star, Agnar Sverrisson. He teamed up with Sommelier Xavier Rousset in September 2007 to launch this place and they seem to have a good thing going. I was invited to a canape and Champagne evening so we were only in the front bar, the atmosphere was quiet but pleasant and the ice buckets in the centre of the tables was an inspired idea. Our Canape selection included Suckling Pig Spring Rolls with Hoi Sin Sauce and a selection of crisps, parmesan, codskin and crispy bread.The food was tasty, I favoured the spring rolls and the salmon but it was all interesting and with a slightly unusual edge you might expect from a kitchen with an Icelandic influence.It would be extremely interesting to go back and see what the main courses are like but I'm not sure I entirely feel I have a grasp of the place from this selection.I also appreciate it is usually quite pricey but this was complimentary",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Jwfs_WwjY9Lu1-R-dMzFtw": {
    "date": "3/1/2010",
    "text": "Visited Texture last week along with 2 friends and we each tried the main tasting menu with accompanying wines. The food was extremely good - as we'd expect from a restaurant recently awarded its first Michelin star. Memorable dishes included Icelandic poached halibut with a light foam, celeriac and Jerusalem artichoke textures, beef rib eye chargrilled, ox cheek, horseradish, olive oil béarnaise, chargrilled Anjou Pigeon with sweetcorn, shallots and red wine reduction/essence and all sorts of little subtle surprises along the way, with delicate flavours and spices. Chef, Agnar Sverrisson came and had a chat with us after the meal and the staff were all very friendly, professional and attentive. In fact, we stayed on and chatted for a long time and the staff were very kind in not asking us to leave! We didn't meet the Sommelier Xavier Rousset, although I think he served me earlier on at the bar - an excellent bar BTW! But, we did enjoy his fine choice of wines each of which perfectly accompanied the meal. One of the things I enjoyed most about dining at Texture is that I came away feeling content but not bloated. This may be in part to the chef's approach which is vacuum cooking combined with very light and healthy ingredients - not too much cream and sugar - this in no way takes away from the taste. I highly recommend this restaurant.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "m37vI1b1MrMWgyJALfGhkA": {
    "date": "4/3/2012",
    "text": "Texture is cool and hype place, elegant bar, classy decor, intimate and inviter.Great cocktails and other drinks,",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "79kRQlzKP8qkgCIm5UhWOA": {
    "date": "7/16/2009",
    "text": "They have a nice private room where you can seat perhaps up to 20 people. Really good food, some splendid accurate flavouring, very careful composition and immaculate presentation. Some really unusual wines, and excellent with it. The more expensive wines are not supposed to be marked up pro rata so are better value. As a previous reviewer mentioned, staff very good and professional, and on my most recent visit charming and attentive Lunch is very cost effective. I will go again, it was that good. Sadly the usual +12.5% service, now ubiquitous in London. And I have been again, and it was if anything better than I remembered! And again!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-UnHQ1gq-4pWhxCEXx3_A"
  },
  "CbqmChALabWXDtUZqK_Hjg": {
    "date": "6/10/2018",
    "text": "I loved this Icelandic Michelin restaurant which was built into the Doubletree March Arch hotel (a pleasant surprise upon checking in). Even if you didn't order the tasting menu which we didn't, the staff provided amuses before each course. The artichoke appetizer was delicious, and we each ordered a main dish with fish. The tuebon",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQGJ9Zu_qvTBQCXHMJW76w"
  },
  "Vd1NBL0S9tqVP309z8oWjQ": {
    "date": "8/11/2017",
    "text": "I went here to try the tasting menu.  The restaurant is easy to get to and is a short walk from the Marble Arch Underground Station.  The food is described to be influenced by Icelandic food and Scandinavian influences.  Overall I would rate this 4.5 stars.  My meal started with a really good \"bread\" service.  Nice texture and taste of the chips.  They also had bread with two types of olive oil.  Bread was good but the highlight was one of the oils which I really liked.  Good start to the meal. Highlights of the meal was the different types of peas (snow, shoots, and flan?) which provided variety of texture, taste and temperature.  The other thing I liked was the lamb.  It was nice presented and the burning coal might appear too much but I guess the scent was part ofnthe experience.  Cooked well and tasty.  Things which I think could be improved in the meal was the gazpacho (the deconstruction didnt kind of completely work in terms of flavor and presentation) and the dessert.  I felt the wait staff was a bit more aggressive in pushing wine compared to other similar restaurants in the area but perhaps it was just in my mind.  When I came in, the restaurant was mostly tourists and not local people from London.  One interesting thing is that they give you a gift in the end. That night it was Icelandic yogurt for breakfast. I just eventually ate it immediately since I didnt have space in my hotel's fridge...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "krLLnDksOVPjX4qvrGdR-g",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/krLLnDksOVPjX4qvrGdR-g/o.jpg"
      },
      {
        "img_id": "vBvD6lHBokwONB-VNTlx1g",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vBvD6lHBokwONB-VNTlx1g/o.jpg"
      },
      {
        "img_id": "XrszqePOqGvnZOMiVOi2nA",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XrszqePOqGvnZOMiVOi2nA/o.jpg"
      }
    ],
    "user_id": "dPlkIeqHnFm8RjmIZ3Utow"
  },
  "5BJ8fFXMC1rMpsnsGLA9yg": {
    "date": "2/25/2018",
    "text": "Lovely atmosphere, with incredible staff. Delicate flavours, and as you would expect, some great textures - the barley cake in particular was very satisfying.I had the vegetarian tasting menu which was a bit disappointing in originality in comparison to my fellow diners with the meat course, mainly consisting of grains and veg, it didn't really venture into the realms of veggie protein. It was also very cold. Overall a lovely experience if you're a meat or fish eater, but for veggies a bit underwhelming, it didn't feel like I got my money's worth in the same way.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_jeVWxOkr_skOy5pqmWcw"
  },
  "EzVvu-5J-b6Q_LEdZeEfQA": {
    "date": "7/8/2017",
    "text": "The food is fantastic. We both had the seafood tasting menu since it was a hot day and we didn't want to weigh ourselves down. The lobster and crab dish was outstanding. No complaints on the food. It's really good.The decor is subtle and tasteful. In an old building but with modern decor, it was a nice visual atmosphere. Being a more modern decor, it did have a lot of hard surfaces which amplified the conversations at the adjacent tables. It also amplified the wooden heeled shoes that one of the servers wore. Seriously, it sounded like a jackhammer on the tile floor ever time she walked back and forth.One other point, the pours were a little light. I don't mean to get lit when I eat but I would like to make sure the wine lasts longer than the dish. If you are pouting a glass, the liquid needs to reach the fat of the glass.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E1oJ2V7i2pSG1GyO7fsAIA"
  },
  "9u2M5Jo_naF-4lvSPVn9sA": {
    "date": "10/18/2016",
    "text": "Amazing Food and great service. When we read the Yelp Review it said not a kid friendly place, but it is wrong. It is totally kids' friendly and the staff are really nice to us and the our toddler.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Igb9J0lRLMUH4N5sIikePQ",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Igb9J0lRLMUH4N5sIikePQ/o.jpg"
      },
      {
        "img_id": "s9AXjsunIDH2IhTM0l5Nhg",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/s9AXjsunIDH2IhTM0l5Nhg/o.jpg"
      },
      {
        "img_id": "LNGYPE4RrAlCzyG-tMVGDw",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LNGYPE4RrAlCzyG-tMVGDw/o.jpg"
      }
    ],
    "user_id": "hW5gFli9U22g3Vh8YoF43Q"
  },
  "g2CmxXTcHdqF-Xuvkiwkyw": {
    "date": "4/14/2016",
    "text": "Wow! Amazing food, amazing staff, amazing ambiance. It was a pleasurable experience... From the starter to dessert, it felt like we were taken into a deep forest and taste the richness of the food. I bumped into this place, because it's located in the hotel where I'm staying, and am so happy with the result of this experience.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eYqRwK0a5qJ_rZ-hbS7W2g",
        "caption": "Photo of Texture - London, United Kingdom. Loved them!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eYqRwK0a5qJ_rZ-hbS7W2g/o.jpg"
      },
      {
        "img_id": "GGUo6I18hy0Lam1oHNnHZQ",
        "caption": "Photo of Texture - London, United Kingdom. Best rib-eye ever!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GGUo6I18hy0Lam1oHNnHZQ/o.jpg"
      },
      {
        "img_id": "5Jfwv2V5yAZM2_JB1ArmGA",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Jfwv2V5yAZM2_JB1ArmGA/o.jpg"
      }
    ],
    "user_id": "CYQmw0hzUMTW3oKnhsGkyA"
  },
  "8deApVECTOdtCuX09UIbIQ": {
    "date": "7/11/2014",
    "text": "This 1 Michelin restaurant is a visual and tasteful treat. The icelandic influence is clear with a clean menu and a understated elegance. The mood lighting transforms the dining experience so much, that you become desensitised to your location. The restaurant could easily been in trendy NY, Melbourne or Paris. I thoroughly enjoyed the Norwegian king crab entrée with coconut and lime- such a fine balance of flavours and different textures of the fleshy crab, smooth coconut, crunchy nuts and the zesty lime. It was light and fresh and a great start to the meal.An entrée is not necessary as you are offered sourdough bread with Icelandic black lava salt and spicy and sweet olive oil as well as bread like crisps and complimentary palette cleansers throughout the meal.Following the crab, I opted for the turbit,  a flat fish which swims sideways. Again, the fish was soft and broke off in juicy flakes. My dad had the US grainfed steak with ox cheek, which was melt in your mouth goodness, served with crunchy chips.The only downside is the range of champagne by the glass. Texture prides itself with 125 champagnes on offer, however there is only 5 champagnes by the glass to choose from. The sommelier is extremely knowledgeable in all things wine and can suggest one to suit your meal and wallet.Texture is contemporary/experimental dining to a fine degree with attentive, yet discreet service. Each meal is a unique experience,  pushing the boundaries of all the great things you can do with food.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Yj-qOw2L_qs01t3mzwBv5A",
        "caption": "Photo of Texture - London, United Kingdom. Complementary petit 4's",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yj-qOw2L_qs01t3mzwBv5A/o.jpg"
      },
      {
        "img_id": "9DESLwdorHmuHDVuA-H_Lg",
        "caption": "Photo of Texture - London, United Kingdom. Turbot- flat fish",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9DESLwdorHmuHDVuA-H_Lg/o.jpg"
      },
      {
        "img_id": "kxis8b9qlvqgneyup5FVYQ",
        "caption": "Photo of Texture - London, United Kingdom. Norwegian King crab with coconut and lime",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kxis8b9qlvqgneyup5FVYQ/o.jpg"
      }
    ],
    "user_id": "yaUG0gvMTV4ENlGV42CBEQ"
  },
  "4tEe-pB4h2MUwtqm2Lpn_A": {
    "date": "2/22/2017",
    "text": "Delicious. Unique. It has a couple of Michelin stars for a reason! Close to perfection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYmyxhM6XW8kVCb7bjONCA"
  },
  "nFnl53WhXywrBRPWgrZK6w": {
    "date": "6/15/2015",
    "text": "I must thank Grant T for recommending this place to me. Many months ago I read his  Michelin list and asked him to provide me with his top picks for a 1st Anniversary meal. Among his suggestions was Texture. Their example menu appealed to us the most out of those we read and we thought it had a very convenient location just behind Selfridges on Oxford Street.We went for a lunch tasting menu. Neither my husband nor I had ever experienced Michelin star dining before so we were looking forward to trying several courses and experiencing an elevated level or service. Most of all, I was excited about the snow.As you might expect the food was beautifully presented and it smelled wonderful. Each course brought new and interesting flavours and textures; from asparagus and parmasan snow to pigeon with bacon popcorn. My personal favourite was the smoked salmon with diced pickles and cucumber snow; it was refreshing and livened up my taste buds. The pigeon was too smoky for my palette but my husband (a keen Islay Whisky drinker) thought it was great.It was not as expensive as I'd expected for such a nice restaurant and the staff were as happy to recommend the cheapest Champagne on the menu as they were the more expensive options. People were dressed smart-casual during the lunchtime service (men in jeans and shirts)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4hIg10gcNGMM6UF29x6NJg"
  },
  "uxzazPiAYQUs-7X9Nc4Thw": {
    "date": "6/22/2017",
    "text": "The food is much over my expectation! It is soooo delicious and service so nice! Strongly recommend the salmon and crab!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cun-HDPNsMHHX69zJNMFQg"
  },
  "TNYh6UmAx1pfp6yJBpsAcQ": {
    "date": "4/29/2014",
    "text": "Decent 1 star restaurant near Marble Arch serving Icelandic cuisine.  Good value lunch menu 2 or 3 courses for £21.90/£26.90.We opted for 3 courses:Amuse bouche - pumpkin soupStarter - Fallow VenisonMains - Icelandic lightly salted Cod with Black Truffles (£5 supplement) & English Suckling PorkDessert - Valrhona white chocolate, mousse, ice cream, Dill, cucumberOf the two mains the suckling pork was the better dish.Cocktails were ordinary.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "idRAeHaWdvUXloH8LyINEw",
        "caption": "Photo of Texture - London, United Kingdom. Valrhona White Chocolate mouse, ice cream dill & cucumber",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/idRAeHaWdvUXloH8LyINEw/o.jpg"
      },
      {
        "img_id": "x3kNyEecyltuZQIoPHaPhw",
        "caption": "Photo of Texture - London, United Kingdom. Icelandic Cod with Black Truffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/x3kNyEecyltuZQIoPHaPhw/o.jpg"
      },
      {
        "img_id": "ez1uNKx833j3BcVYMX68xA",
        "caption": "Photo of Texture - London, United Kingdom. Suckling Pork",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ez1uNKx833j3BcVYMX68xA/o.jpg"
      }
    ],
    "user_id": "5Px3GyYgFyhXwsejZrdfMQ"
  },
  "3tRXHROnOavE6Xt9zDIfjQ": {
    "date": "2/26/2016",
    "text": "The service great; the food very good. A table for two for lunch and there were no let downs; the Icelandic cod and lamb dishes were awesome and deserts great. They are getting it right and absolutely a place to visit again.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NS6Il8PsEl7jtE4PBrlWg"
  },
  "QwgQpLqS0bRqjfLYUblu6Q": {
    "date": "12/3/2014",
    "text": "Amazing building, great cocktails and stupid good food. Do you hear a but...? Yes! You do...!I love a good soll",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "hPGtb6dtBq38B7RTwu3NIQ"
  },
  "jAQ-RwRTcqyGmYSKGyIx7A": {
    "date": "3/24/2013",
    "text": "A friend of mine was raving about Texture as she went right before the won their Michelin star - saying it had one of the most interesting tasting menus.  Now if there is a special occasion you want to celebrate, birthdays anniversaries etc, this is definitely one place to consider.  We went with the Scandinavian tasting menu where everything was so deliciously prepared and presented.  I like that the place wasn't very big either as it feels a little more intimate to indulge in the fine dining experience.  It isn't the best food I've had in my life but I thoroughly enjoyed experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "-mcgxEuk6IFQtesNBsHwdQ": {
    "date": "8/25/2016",
    "text": "What a wonderful dining experience. It was our last night in London and we wanted to finish our vacation on a high note. Texture delivered on all counts. Incredible food, attentive and hospitable staff, and the ambiance was sophisticated and warm. One of our favorite meals of all time.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGqgiR5mFatOGs8JvQ71IQ"
  },
  "rNEr5vsLt812UxQDqaJ6Uw": {
    "date": "5/9/2012",
    "text": "The food at Texture is proof that you don't have to douse food in cream, butter and olive oil to create delicious cuisine.I'm a huge fan of Scandinavian cuisine largely for its simple ingredients resulting in complex flavours (and techniques). Agnar Sverrisson was in the restaurant during my visit - it's always exciting to see the head chef in the kitchen! Amuse bouche was a jerusalem artichoke velouté - very light but delicious. We were also brought a bowl of fried salmon skin and parmesan crisps...mmm, seriously addictive. I love eating fried fish skin (do give it a try even it might sound gross!) so I was very pleased. The bread was fantastic too, remniscent of rye bread that I've had in Norway before. My starter was smoked cod with potatoes and rye toast - this is probably one of my favourite starters ever. I'm generally wary of smoked fish because it can be overpowering if cooked poorly. This fish was perfectly smoked - a beautiful combination of flavours and very light. My meat dish of lamb with sweet potato puree and other vegetables was very good. However, the fish dish of pan-fried ling with quinoa and prawns was stunning! Even though it sounds something a health-freak would cook, it didn't disappoint in flavour. Dessert was Icelandic skyr with rhubarb and granita - apparently skyr is similar to a yoghurt, but technically a cheese. This was unlike anything I've had before, but I loved it. A bit tart, but very refreshing particularly with the rhubarb accompaniment. Petit fours of passionfruit macarons and cardamom chocolate truffles rounded out our meal of amazing food.The food is a bit avant-garde and probably not to everyone's taste. I personally loved Texture - the fact that Sverrisson can use minimal amounts of cream and oil in his cooking yet still produce such great food is a testament to his skill and innovative cooking philosophy. The dining room is very bright and beautiful, and service is friendly and not overbearing. Loved everything.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZW_L56V9jIQCxPZh9wA_ew",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZW_L56V9jIQCxPZh9wA_ew/o.jpg"
      },
      {
        "img_id": "3O_B3d3lgDbLtKTOSt4lBQ",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3O_B3d3lgDbLtKTOSt4lBQ/o.jpg"
      },
      {
        "img_id": "C0GRAid6hAl6Bgs7H8BHNw",
        "caption": "Photo of Texture - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C0GRAid6hAl6Bgs7H8BHNw/o.jpg"
      }
    ],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "FzxHXNORYQ00XwtBs6sFWw": {
    "date": "2/19/2012",
    "text": "I feel like I've written a lot of \"eh\" reviews lately so it was time for a positive one and which better on my \"to review\" list than one of the best meals of my life?I had the fish tasting menu here.  First of all, props for a fish tasting menu.  Talk about a pescatarian dream come true.  Each course was simply amazing.  The flavors are so clean and light.  Like Tiffany L. said, minimal butter and cream.  They were seriously some of the best food pairings and flavor profiles I ever had. I think the price is actually not horrible considering its a multi-course fish meal at a Michelin star restaurant. If you are in London, you must stop in here.  Its been a while but I find myself think of this meal quite frequently.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ot3m-jIwFMFFCMG1bkLZgQ"
  },
  "2jyyyMLeG_fLtZdRJtpGyw": {
    "date": "8/17/2011",
    "text": "This was my first time eating at a Michelin star winning restaurant, and I have to say that it was nothing short of amazing.Texture serves European cuisine with Scandinavian influences. The head chef, Agnar Sverrisson believes in minimizing the amount of butter and cream to achieve a comfortable fullness.I ordered four main dishes:1.. Appetizers - Native Lobster and Anjou Quail - The most tender pieces of lobster I have ever had in my entire life. The quail was also equally delicious as it was perfectly charbroiled and excellently paired with the sweet corn and bacon popcorn.2. Main Course - Cornish Brill - A flawlessly cooked fish filet that was deliciously matched with a light lemongrass sauce and fresh asparagus.3. Mango Soup - Very creative desert. At first, I thought the Mango and ginger were an odd combination taste-wise. However, I grew to like it with every bite I took.Each dish was beautifully plated; every time something new was brought to the table, I went through a brief moment of hesitation where I would debate whether or not to eat so as to avoid destroying the works of art. Alas, my belly won every time, but luckily, I took lots of photos to keep the images fresh in my memory.   At the end of my meal, Chef Sverisson accomplished his goal: I was comfortably full.If you are looking for a very unique and wonderful dining experience, Texture is the place to find that and more. 5 stars.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "t296PY9n70iV3zlhiDaDoA",
        "caption": "Photo of Texture - London, United Kingdom. Mango Soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t296PY9n70iV3zlhiDaDoA/o.jpg"
      },
      {
        "img_id": "y1rsicycPXi9cuKJNfjsPw",
        "caption": "Photo of Texture - London, United Kingdom. English Pea Ice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y1rsicycPXi9cuKJNfjsPw/o.jpg"
      },
      {
        "img_id": "orcfYx4OBShGBRtIepMIwg",
        "caption": "Photo of Texture - London, United Kingdom. Pyrenes Lamb",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/orcfYx4OBShGBRtIepMIwg/o.jpg"
      }
    ],
    "user_id": "lPftW_nFJ6oT6jfoIYuQMw"
  },
  "5RJO-XIrWopgO1DeKR_kSw": {
    "date": "6/20/2013",
    "text": "After all the glowing reviews, a friend and I were excited to try this place. We've both eaten in some of the finest restaurants in Europe, North America, and Japan, and we hoped we could add this to the list of favorite dining experiences. Unfortunately, Texture failed on both food and service-- but most egregiously on service. Throughout my lunch here, the service vascillated between aggressively rude and simply nonexistent. The problems started the moment we walked through the door. We had made a reservation for noon, and we arrived exactly on time. Rather than being seated, we were told we should have a seat in the bar to have drinks before lunch. When we suggested we planned to look at the drink offerings in the context of the menu, we were told again to sit in the bar. This was puzzling: the tables were clearly set and ready to go, there was no one else in the dining room... why were we being so strongly urged to sit in the bar? Once we finally agreed-- more out of bewilderment than anything else-- the answer became apparent. They were damn well not going to seat us until we'd ordered a glass (or preferably a bottle) of champagne. It didn't matter that it was lunchtime, and that we didn't particularly want to have drinks before we'd had a chance to consider the food-- this was obviously of no matter. Several times I tried to indicate politely that we'd prefer simply to be seated. When someone came over a second time to ask if we'd decided, I said once again that we would prefer to go straight to the food menu before deciding on drinks. Instead of taking this as his cue to seat us, he actually came back to the bar with the food menus, and for emphasis, slapped coasters in front of us. It became apparent that we had two choices: 1. Be as rude and graceless to them as they were being to us, or 2. Order a glass of champagne. We opted for #2. I consoled myself with the thought that I always love champagne. Unfortunately, this glass left a bitter taste in my mouth. Once we had been press-ganged into the drinks, we were finally permitted to be seated. We hoped the bad experience was over. Nope. Service continued to be dismal (although nothing managed to match the rudeness of the front of house staff). Some major problems:1. Several courses were brought to the table and explained while one of us was away from the table. I have NEVER been in a Michelin-starred restaurant that has managed to get this wrong once, let alone several times.2. Wine was poured while the person who ordered the bottle was away from the table and unable to taste it. 3. Every other diner in the restaurant was presented an amuse-bouche. We ordered more courses than any other table (with the exception of one four-top), and believe me, we certainly noticed when everyone else received an amuse and we didn't.Finally, the food: if you're impressed with artistic plating, then yes, Texture does that bit well. If you expect food at this level to be surprising, delightful, a treat for the palate as well as the eyes-- keep looking. There are so many better choices than this. We ordered the Scandinavian tasting menu, so I feel we got their best effort, and sadly, it didn't even begin to make up for the gauche service.",
    "rating": 1.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S66Wvav9nZaQSRQ9cr-Ubw"
  },
  "jxQbt9sa0Pwh-ojPcX5pVA": {
    "date": "5/3/2015",
    "text": "It was SUCH a treat to go here for our anniversary dinner - the staff were so personable and helpful, the food was just completely unique and amazing, and I still smile every time I think about our evening there! Very much looking forward to going back sometime for another treat! Oh, and .... Bacon Flavoured Popcorn. Just brilliant :)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzapbYtnDIwcosmi5EZquA"
  }
}