{
  "QuS7qDWeXljQ9O_NybwImQ": {
    "date": "10/18/2009",
    "text": "I've only been to the upstairs dining room, which seats 30-ish and requires booking midweek, but on weekends, show up early and often no reservation is required.  Lucky for us, as the food on a par with our other local favourite gastropub, the excellent but oft-overcrowded Thomas Cubitt, and priced much more reasonably -- our bill for two is £45-ish at Queens Arms and £55-ish at Thomas Cubitt.My partner was happy with their wine selection, but my minor pet peeve: no stouts on tap...only lagers and bitters.5 stars for the upstairs because in this neighborhood, there's not a better gastropub, although maybe 4 stars in a more competitive neighborhood.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GZV2HthzX0caUDhq7fwbYA"
  },
  "fmBwHrTXQC-opfT-jhea_g": {
    "date": "1/5/2011",
    "text": "The service here is very friendly and the food decent, but the pub itself, while nice enough lacks in atmosphere. It's too cleaned up and sober for my liking - more like a restaurant than a pub really, and not as warm and inviting as I had hoped.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "8PeJqGaX_8UbwV-7xiYf9A": {
    "date": "11/5/2008",
    "text": "Situated in residential Pimlico, this pub has recently changed hands and so much the better that's what I say! It now firmly inclines towards the gastro-pub crowd and both the food and the setting are understatedly elegant. I had a great meal here of blackface lamb cutlets with puy lentils, savoy cabbage & potato rösti. The cuisine is seasonal, locally sourced and very good indeed.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FlK8JA-veGIm1yoyEAjwEw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FlK8JA-veGIm1yoyEAjwEw/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "YTUle93sHkaPHtLz4IxKVQ": {
    "date": "10/19/2010",
    "text": "The Queens Arms is a warm inviting place to eat and drink--the chef is producing consistently fine food--the menu ranges from the ever popular burger to pasta, risotto, fish and game ( my lunch last week featured delectable partridge salad). Downstairs pub/food area has just the right amount of buzz during the day--evenings I prefer the lovely room upstairs.Queens Arms has become yet another happy addition to our ever improving area--and would make a delightful resting place for anyone attending the spectacularly improved Tachbrook Market which was launched last week.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1GTm_PCHyXgIOiD4p6igQ"
  },
  "6c0FoBItFCLygkdubtV1rQ": {
    "date": "11/24/2008",
    "text": "This gastro pub is clean and modern inside, with a relaxed atmosphere. There are wooden floorboards throughout and plenty of wooden tables and seats - though I don't find these wooden seats comfortable in the slightest; I'm always fidgeting trying to get comfortable. However, the big booth with the soft seating at the back is VERY comfortable and excellent to relax in with friends if you manage to get this! It's also good during the warmer months as they have plenty of outdoor tables and seats. They have an upstairs restaurant area which serves VERY good food. We were very impressed. They only had one vegetarian option but it was delicious.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9y6HjbU-DOs1dhCgHydy4w": {
    "date": "2/1/2010",
    "text": "Was here this past November.  This pub was fairly decent food service.  Upstairs didn't open until quite late, but the special Prime Rib cut was excellent.  The meat was savory and the serving size was large.  Beer selection was mediocre, but decent prices - decent trade off.The service was decent.  According to a local family friend, there aren't too many pubs that do pub food well - so I take that as a thumbs up?Found this spot to be great if you want to catch a pint and check up on your e-mail (free wireless). Only issue is that the music was super loud, and rather modern.  Did not feel right in a \"historic\" feeling pub.  This is the only reason why it got 3 stars instead of 4.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAIFXQmZWg2ziOPkCP-iVQ"
  },
  "jOOiPa_FADJwNOeInHllnQ": {
    "date": "7/25/2015",
    "text": "We went out with the baby in his pram to look for a nice lunch.  We did quite a bit of walking around the Victoria area without being able to make up our minds.  In the end, we opted to go to The Queens Arms because it looked good on the outside and it was not too far away from home.We were there at around 3pm, so the full menu was not available.  However, we could still get the fish and chips which I had a small craving for.  I think they did a good job of it.  The fish was fine: not too flaky and the batter was not overwhelming and oily like I have noticed in other places.  The chips were also fine and the meal came with a side of peas.  I had a pint of beer to help wash it all down.  It was a good meal considering it was prepared at the pub outside of normal lunch hours.It is a typical pub layout.  The tables were a bit sticky and the space was a bit tight to manoeuvre the pram around, but it is perfectly fine for a pub.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "RiyToAW_-tRvcffECn_RGg": {
    "date": "1/20/2017",
    "text": "Literally the best fish and chips I have had in London.  Period. End of story.   Great service.  And cheap Jameson.  Nothing beats it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvNSst_m4JoWW7wOOluy0g"
  },
  "BHHR9jBbOJxk0NQLk46YPQ": {
    "date": "8/26/2016",
    "text": "Really great food, relaxed and friendly atmosphere. Loved the chips with the chicken and leek pie.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zR3Ea9OUN_QXK2zsGcti0A"
  },
  "_6GF3_uVkZXwd2hRSQzL_w": {
    "date": "7/25/2015",
    "text": "Great local pub/restaurant! Staying in London from the States and this place was right around the corner from my hotel.We ordered:-fish & chips: loved them-buffalo mozzarella & tomato salad: loved it  -Cumberland sausages & mash: really good-chicken Cesar salad: good-sticky toffee pudding: DELICIOUS!!Good selection of beer and wine, great atmosphere and extremely friendly bartenders/severs.Great mix of locals and tourists but everyone was super nice and just enjoying the food, drink and good company.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_LI4CgylFnecUG9Mst50A"
  },
  "0gHMwHqjAkBMO0oIJqiG_g": {
    "date": "10/12/2014",
    "text": "I was looking for a quiet, good value, cosy pub to meet a friend in at Victoria. Turns out, this is Victoria so none of those criteria are particularly appropriate BUT the Queen's Arms did deliver in that we got a table, everything we asked for on the menu was available and the service was good. So all in a solid option for the area.Generally diners go upstairs I think, which would lend it more of a restaurant feel. In our case, the upstairs was closed so we had to eat downstairs. This did make it feel like we were intruding on the boisterous Saturday night drinkers' territory somewhat, and meant it was very loud but we had a nice time anyway. Sticky toffee pudding - believe the hype!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "syh2bX9OqpUCky4nCGXQPQ"
  },
  "fy3Tf9ij3lMQKkGgpDvJ2w": {
    "date": "8/12/2014",
    "text": "The Queens Arms wasn't my original destination when I set out, but I am really glad I ended up there. The staff were really friendly, and the upstairs dining room was really nice on a cool Friday evening in the London summer.The menu is nice gastropub fare. While many of the standard steaks and fish and chips were present, they have definitely done them up a bit to make them more than meagre pub grub. They had Sipsmith's Summer Cup available, which was a delightful pre-dinner cocktail.We enjoyed a salad, the fish and chips, and a few drinks. It's definitely a step up from standard pub fare, but not so much as to make it inaccessible for an impromptu meal.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UpjdWjg7Uxv8rK9IebPdA"
  },
  "cR5njCH3_FJ8qmMa7i9GMg": {
    "date": "9/1/2015",
    "text": "The Queens Arms is a delightful gastropub.  We sampled the beet salad, watercress and pea soup, burgers, fish and chips, and crab tian and everything was delightful.  We were too full for pudding, but I wish to come back for the sticky toffee and cinnamon apple crumble with spiced ginger ice cream.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MZcQkBRzDsqPfxDAO8p-A"
  },
  "jOTuATVceW--scMoQQhoWQ": {
    "date": "12/12/2014",
    "text": "My visit to The Queen Arms was a mixed experience.First, the good - our time in the pub on the ground floor was a four-star experience. My companions and I enjoyed the cocktail sausages and chips, both of which were delicious. There's a nice wine list and service was friendly and efficient. It's also a nice ambience. We were there on a Tuesday night beginning around 7 PM, and it was mostly the after-work drinks crowd. I would definitely return for drinks if I needed to meet someone near Victoria Station.Now, the bad - we decided to continue on to the dining room for dinner. Granted, this was around 9 PM, and the dining room appeared to be winding down. I ordered a shrimp pasta dish, which was completely flavorless and had about three pieces of shrimp in it. On the plus side, my companions said their steaks were satisfactory, although not great.The server was courteous enough, but completely disappeared other than to take our order, deliver our meal, and (eventually) deliver the check. The slow service turned the dining experience into a two-plus hour event. So two stars for the restaurant. I won't do that again.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_7ocG8UaRA4CJ8iUlgmldA"
  },
  "D5eXhOBYRL7hmRHSOVxRQw": {
    "date": "11/10/2015",
    "text": "best fish and chips in my whole life.  Fresh fish, light batter, amazing.  Service a bit slow, but they were very busy.  Thats a good thing.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ly_JDTsRBh3CLM_tWoKhHA"
  },
  "cuYeWTyD7NZTtJIAFN60vg": {
    "date": "10/27/2016",
    "text": "Some of the best service I've had outside of high end dining.  The food was spot on.  Fish and chips and my wife had a burger - plenty else on the menu though outside of the staples.  Solid craft beer selection.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QbrMCsD6je-REPIDwzJCVw"
  },
  "Yg0JPBMk4Ltc-f4VqhUeyA": {
    "date": "5/21/2015",
    "text": "Popped in for a pint one Friday evening as my friend was staying over In a hotel nearby. He mentioned this pub was nearby so we met and feeling a bit peckish we ordered the Fish and Chips. Well....I was so surprised as the Fish and Chips was outstanding. Not sure if it's more a Gastropub (was decked out nicely) but skin on cooked chips, fresh tartar, garden peas (I prefer mushy though) and a cod that was as fresh and crispy as you like. So tasty. Very very impressed. Will come again when in the area for sure. Good pint of Estrella too!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "S9dIWjMwnDwTfg28Ohk3Bw": {
    "date": "7/26/2015",
    "text": "Incredible food, fantastic service. Get the sticky toffee pudding, it'll change your life. Excellent atmosphere as well! In town for a few days but planning to go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lfxpnaA-5Gg4ziONcNCehw"
  },
  "IgOtuQKdblekP-V3evxRpA": {
    "date": "3/23/2014",
    "text": "Decided to try this place out after our original choice was busy. So happy we gave it a chance!Service was wonderful, food was even better! I had the fish and chips, my friend had the braised beef. Fish was light and crisp, and the beef was to die for!Topped of the night with the suggestion of the dark chocolate biscuit cake. Let's just say we might be back tomorrow for it. A great find and strongly recommended!Also, Camden Hill Lager was delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZA3Tlf8UqU0DZsudHyhIwQ"
  },
  "0Gc3ymmBeo2qwCtBYX3GXg": {
    "date": "6/4/2013",
    "text": "I didnt eat a formal meal here but had a few drinks here one evening. Its a really nice place, its got a nice atmosphere in quite a popular area of Pimlico. They had a good variety of beers, both local and mainstream but also a nice variety of bar snack. One helpful point, the toilets are downstairs which may prove slightly tricky for some people.Overall a great place to grab a few drinks! I will be back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OK24Bcw7wyP3P9n6FKg5Ag"
  },
  "kmrjg8it-9o-YwDALGThXg": {
    "date": "9/12/2014",
    "text": "Drinks review only - this is a solid pub, and I enjoyed it. The bartenders were friendly and good at recommending a beer. Prices are very fair. It definitely feels like a British pub, but not in the stereotypical way. Solid music (mostly classic rock when there), and the interior is a cross between modern and retro. Would certainly return!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DSpFOTOSCAh3LEv3L1fPPQ"
  },
  "LRK55RtGIOBDlmshsAjXgA": {
    "date": "7/24/2014",
    "text": "This was our first meal in London, and my family (myself, husband, and 12&15 year old boys) loved it!  Our waiter was very pleasant and gave us some tips about the area.  I had the fish and chips with \"mushy peas\", hubs had the bangers and mash (with \"Cumberland Sausage\" - something we can't find in NH, despite our best efforts to look now and again), and my children had burgers.  There was a prawn dish that I wanted to try if we came back, but the night that we tried the upstairs was closed for a private function (kids can't eat downstairs).  I also had a summer-cup with a very bespoke and small batch gin (whose name is escaping me). It was magically delicious!  The desserts were lovely also...give it a try!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iHPqQo1nRAqN9bGOj5XosQ"
  },
  "BuNP8SmYkLRK5vavqXJwvw": {
    "date": "10/8/2011",
    "text": "This was my first meal in London and I feel that I lucked out.When I walked in here, I felt like I was in a proper pub.  I could quickly notice the difference between this spot and places that I'm used to in philly.  The design was notably different in the amount of natural light, the layout and of course the menu.My buddy had the burger and I went for the Lancashire Hot Pot.  I tasted lamb, carrots, onions, parsley and thinly sliced potatoes.  It was so delicious.  The red cabbage on the side was also dressed nicely, maybe more parsley and malted vinegar?  I devoured it.My pint of Grasshopper was indeed an English Ale, served in a nice nub glass (technical term) and we had a fine time.I recommend it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mzL0zHFGyd9866OUljq49g"
  },
  "4AscsnwYqF7pBxjVHYA4gg": {
    "date": "10/21/2014",
    "text": "Fast service very polite staff ......only downside they have started playing christmas music...   foods good",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sxb40wP6cQZTxHkQLtlgfA"
  },
  "msqqMu3IIuSlhiWNPEEIhw": {
    "date": "12/19/2011",
    "text": "A nice relaxed gastro pub just a few mins from my work, so is used quite frequently as a place to stop for a weeknight drink.Always reasonably busy and has a nice feel to the pub, eaten here a couple of times as well and the food is very nice. it does gastro pub well",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "w4hwF0asikySnesuduAgoA": {
    "date": "1/28/2013",
    "text": "Fantastic gastropub. The bloody mary was extraordinary, although watch out if you don't like horseradish. I got the Sunday roast with pork belly. It was a bit surprising that the pork belly was sliced, but it was delicious. I could not ask more from a Sunday roast. Got the cheese plate for desert. Quince and shropshire. Perfect recipe for a Sunday afternoon. There's an excellent vibe here, and there's 2 floors.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9uf4g85B_gz2W4d_GZI-Wg"
  },
  "g0DPcMpB5dtrC2mGnD89aQ": {
    "date": "2/16/2017",
    "text": "A very busy spot for a Monday night, it is an old building and appear to be doing some work at basement level.The service was very good, we had a table of 8 which they accommodated no problem.  Craft and real ales on tap with a wide selection.  Food was surprisingly good with a mix of vegetarian, fish and meat.  If you are in the area then give this place a look.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 4
    },
    "photos": [],
    "user_id": "6L-VcXwxYtXjmyKKRTNLkA"
  },
  "Gg_8_AqWsEE0i3Cbgq-4uw": {
    "date": "4/20/2018",
    "text": "Great! Good food and awesome staff! Was visiting from USA and was staying at a hotel nearby. I refused to leave the UK without having authentic fish n chips and I'm so happy I came here! Loved this dudes serving... so fun and attentive. But the food! SO delicious!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iIId1615t-tkEC3GYxdM1A"
  },
  "beazgM6p3_MS6c-NfQx3fQ": {
    "date": "5/1/2018",
    "text": "We wandered in here on our first night in London, weary after a 10 hour flight. We were looking for some good British fare to kick off our trip, and this place gave us exactly what we were hoping for! The ambience was comfortable, the service was great, and the food was excellent. We sat downstairs near the entrance and felt very welcome. I can't speak for the parking, but the pub was very accessible by foot.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGsDqoez_eX-flPxiHUaxA"
  },
  "W_otD5qKXWoCGzaPgxzLcg": {
    "date": "8/4/2018",
    "text": "Beers were great and refreshing! Food was good too! fish and chips was light and fluffy and the Cajan chicken sandwich was incredible. Friendly service too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JeZPEEQh794ACXPJKA3_w"
  },
  "lnMwF-W1I76zfG3FZFhKQg": {
    "date": "2/17/2018",
    "text": "Great place to eat. They have a nice dining room upstairs and nice dining bar area on the main floor. I had the fish and chips. It was very good. The service was great and the beer was also good. Another nice feature is that it is in a downtown style area so when you are done you can walk around and explore other bars and such in the area. Highly recommend for first timers in London and also residents of London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oW2XISaHkQsj1QiU6ns80Q"
  },
  "yHCkkkAR46GBVa3SOXNJnQ": {
    "date": "3/2/2018",
    "text": "The smoked salmon for an appetizer was delicious. Great mulled wine on a cold day. There mash with sausage and onion gravy was hearty and tasted great. My wife's fish and chips was also cooked to perfection. The service was exceptional and will go back if time permits.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MuvJAUMGfhLI5dH4Vp6TxA"
  },
  "2dG530WmOWe2DN0JTLX-CA": {
    "date": "8/28/2017",
    "text": "Took the family for lunch. Friendly service - was allowed try the beers before selecting. Fish and chips still great. Sausage and Mash a winner with the kids. Sunday Roast excellent. Quiet - a little away from the crowds and well worth a visit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6NDG6ZQjX80Y062JDiQ4nQ"
  },
  "yJjc8N8OMmXGj5J6wK_akA": {
    "date": "11/18/2017",
    "text": "First, I'm not a dessert person. My husband and I were looking for a couple of drinks and small bites at the end of our first night in London. This place didn't disappoint. Calamari was cooked perfectly! And the Sticky toffee dessert was AMAZING. I rarely if ever order dessert but based on previous previous we (I) ordered this. Needless to say, we will be back again t have this dessert again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_ouilQ3wiXhM11DNIyCg2Q"
  },
  "phElUBnnRMw9bVj8cukwrQ": {
    "date": "6/16/2017",
    "text": "Yelp saves the day again! We wanted a place we could all to that wasn't traditional fried pub food. Yelp pointed us to this place! Nice environment, friendly staff, light bright an airy (not the norm for a pub per se) and the food was delicious. A happy meal!! Thanks Yelp!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wUe7zizRopFaXeK08L5wCQ",
        "caption": "Photo of The Queens Arms - London, United Kingdom. the fish and chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wUe7zizRopFaXeK08L5wCQ/o.jpg"
      },
      {
        "img_id": "-i-KuaTybVsunkbmyVa8Sw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-i-KuaTybVsunkbmyVa8Sw/o.jpg"
      },
      {
        "img_id": "OW7TwXI_hjdRsQcsl5Wvdw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OW7TwXI_hjdRsQcsl5Wvdw/o.jpg"
      }
    ],
    "user_id": "fYy6CYx37PEcj8hZi0DKCw"
  },
  "KYd-y57dUUJvXpqx-JYnVQ": {
    "date": "4/2/2018",
    "text": "Food and service was great! Teens had fish and chips and fish was very fresh. We also ordered a burger and a vegetarian roast with Yorkshire pudding and they were really good. Service was fast.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Zr4O2TYGzk8-KXW_JAJVw"
  },
  "FwEuLR1DQkxVC0CEeIjQUA": {
    "date": "6/22/2018",
    "text": "This was the first place we ate in London. Everything was incredible. Fish and chips, green salad, a pork chop and STICKY. TOFFEE. PUDDING. Get it. It's amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QD-cX2VucXSg93hrTZt6mg"
  },
  "7xuSEFyWQAwPz2yqbT5rDw": {
    "date": "4/22/2017",
    "text": "Came on a Sunday afternoon after getting off a flight from Seattle and had a drink and the fish and chips.  Both were excellent.  Great staff and great atmosphere.  All around solid place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bcFtOUmHqzdxZX_vw1vmRA",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bcFtOUmHqzdxZX_vw1vmRA/o.jpg"
      }
    ],
    "user_id": "xOs05Es1r7N7Z_scR0Fekw"
  },
  "W4sBkev2IsQURuR2XU25Bg": {
    "date": "4/30/2018",
    "text": "Fish and chips were perfect. Tartar sauce was homemade with a beet twist. Mushy peas were also very good. The best were the Cheesy chips with onion gravy.....Mmmmmm, so good. And super friendly service.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "huFepNipWphvHHARc1-GPg"
  },
  "bBHJ5dLF8XI02asr72tagg": {
    "date": "1/7/2017",
    "text": "Good spot. Everything was very good, the fish and chips were \"good.\" Nothing special, not as good as most fish & chip stands. The fish pate was really good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FaX0IDpcnqQYoM7bXZJ8sA",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Olives, fish pate, great salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FaX0IDpcnqQYoM7bXZJ8sA/o.jpg"
      }
    ],
    "user_id": "1kr9EZFV3T_l-8KBkfPo5Q"
  },
  "SaBqZAtORks4IWw-qxuFrw": {
    "date": "12/13/2016",
    "text": "We were staying near Victoria for a few days and checking out the options for vegetarians for dinner.I found this place on Yelp and it looked like it would fit the bill for a few beers and a good dinner.Let me say we made a great decision.Good atmosphere, a great choice in beers, friendly staff and good vegetarian pub food.How can you not like a vegetarian roast with all the trimmings plus Yorkshire pudding and gravy or a vege and chestnut pie with mash and green beans.Neither dishes gastronomic masterpieces but great tasting and shows that the chef respects vegetarian customers enough to do something special.The cute french waitress made for a most pleasant evening.Overall a good find!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IIpGqo5f4FZfrlkqVESjTQ"
  },
  "Hg4atWjwNP7g3pU4tja5Rg": {
    "date": "8/5/2015",
    "text": "This is a pretty good pub!I met up with some friends here on Saturday afternoon. It was pretty empty around 5ish, so it was easy for me to commandeer a couple of tables while I waited for my friends to appear. It wasn't super cheap, but it wasn't unreasonably expensive either.Sweet parts:- The have old rosie (the cloudy cider that is stronger than it tastes) on tap - yay!!- I had some G&Ts that made me happy...- The staff were friendly and helpfulWe had a couple of children in our group, so we weren't allowed to stay in the bar after 6pm...but they were happy to put a table together for us upstairs, so we stayed and tried most of their bar snack menu!! The meat platter, humus and pita, chicken wings and fish goujons all went down a treat. I think the avocado salad was the best part. It wasn't particularly fancy, but we all left the pub feeling really full and happy!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "B4sj8PnO2iDZwxpBkEQ-7g": {
    "date": "2/26/2017",
    "text": "We visited here back in May after looking some places to eat near our AirBnB. Found this place on Yelp due to the great reviews, and weren't disappointed! The food was so fresh, delicious, and the service was awesome. Really enjoyed our dining experience here, and look forward to stopping by the next time we're in London!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3pt-gfzjIaKDEuVwvwkHig"
  },
  "4jHAFuf01UpkJDEpsNVxsg": {
    "date": "8/11/2016",
    "text": "This gastropub is somewhat under-rated.  My smashing BF and I were pub hopping and ended up here.  We are vegan-ish and the vegetarian options are formidable.  The menu is cleverly broken down by small and large plates.  We tried a few of each. Asparagus soup, roasted vegetable strudel, and don't judge us fish n chips for the first time in 11 months.  The fnc was served with a side of peas.  I can't overstate how delicious these peas were.  Penned by the \"smashing bf\"",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VmIWnk8MjsnEZZhAtiye0g"
  },
  "3YgjB2I6nzo4uwDDegmurQ": {
    "date": "1/12/2017",
    "text": "Good beer selection. Are there more than once and tried the fish and chips, wild boar casserole, and the burger with bloody mary ketchup. All were superb. Start were super friendly and enjoyed chatting with them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "b-bR2j4EitbT6goGZEkgCA"
  },
  "ad6z4gtY461UAueOUybbeQ": {
    "date": "6/10/2017",
    "text": "We were in Pimlico for vacation and wanted to get some fish and chips one night.  The Tartar sauce with beets was interesting but good.  Great food and service. Ambiance was nice as well.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5WamojrlM4PhlCECsJR3Q"
  },
  "Foi8ieHwQ02O34gjSQVmxQ": {
    "date": "8/27/2018",
    "text": "Absolutely loved the food here. Atmosphere is like a pub, but also feels like a classier restaurant as opposed to an old school pub. We went on a Sunday and ordered a roast which tasted delicious. The service was also fairly fast. It looked like this place got full pretty quickly so I'd expect a short wait if you're not lucky.Bottom line: a great place to eat. Service was great. Prices were fine. I would certainly come here again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EnSyq40kK4g7_OmeEFPbQ"
  },
  "JV8zmo8lzJmPNmgCPi8CQg": {
    "date": "9/16/2018",
    "text": "This was the first place we are in London and in the lovely Pimlico neighborhood.The inside was a typical pub with hardwood floors and high ceilings.  I started off with a Cider and wasn't disappointed. I ordered fish & chips, holy wow!  It was rather larger and my husband had to help me finish it.  Very good mushy peas and my husband loved the fries.  He ordered the Mediterranean vegetable & feta Pithivier, with sweet potato and rocket salad.  This was a first for us and it was delicious.We had great service and would definitely go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EH8llPEDAdbP8LZyRur-1w",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EH8llPEDAdbP8LZyRur-1w/o.jpg"
      },
      {
        "img_id": "BEBIqOZZ85qBGdSUpG36eg",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Mediterranean vegetable & feta pithivier",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BEBIqOZZ85qBGdSUpG36eg/o.jpg"
      },
      {
        "img_id": "rpcqqUQCVH1jiKd3rZIIpg",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Fish and Chips",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rpcqqUQCVH1jiKd3rZIIpg/o.jpg"
      }
    ],
    "user_id": "mE_GD001INjRTltZBescyQ"
  },
  "dhEmTDcDguAPC763dbhHyQ": {
    "date": "5/28/2018",
    "text": "They ran out of fish and chips by the end of the night but luckily it was Sunday so they had Sunday Roast. The server recommended medium rare but it came out well done. It was so tough so I had them redo it.  Even when it was medium rare, the meat was still tough. I was expecting something like prime rib but boy was I wrong. My expat friend was right...the English don't know how to cook steak and the cuts are not great.  Sunday roast came with Yorkshire pudding which was good.  The veggies were perfectly cooked and not too raw or mushy.  I also ordered sticky toffee pudding.  It was piping hot but wasn't the best tasting sticky toffee pudding.  My team had made some at the Chopping Block school and that was by far better. Overall, the food was alright.  Service was meh.  I sat for like 15 mins before I had to hail down a server to order. I wouldn't go back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vW1tlaT_QHBMrpqctvFKKQ",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Sticky toffee pudding cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vW1tlaT_QHBMrpqctvFKKQ/o.jpg"
      },
      {
        "img_id": "dYYzEp9j4ceH6I99tpBo6w",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Medium rare Sunday roast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dYYzEp9j4ceH6I99tpBo6w/o.jpg"
      },
      {
        "img_id": "LtxFkfeWFBIWXf-1MCw4Sw",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Perfectly cooked veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LtxFkfeWFBIWXf-1MCw4Sw/o.jpg"
      }
    ],
    "user_id": "EwbNggOhuKM90aY6qC-NvQ"
  },
  "NfOgyQCOKrNaT-YVDkraeg": {
    "date": "11/11/2018",
    "text": "My last night in London called for a hearty and wholesome meal. We came across The Queen of Arms as it was class to our Air B n B. It's fairly close to Victoria Station. I was drew in by the reviews of the vegetarian roast. I thought could I be reading this right!? Do they really have a vegetarian roast!? Indeed they did! Vegetarian roast accompanied by; carrots, green beans, and Yorkshire pudding! It was hearty and delicious. If you're a meat eater not to worry. They offer a few roast options with various meats. They have several beers on tap. I'd suggest one of the ciders. There is a dining area separate from the bar. The dining room was closed during our visit due to a private event. We did not mind sitting/eating in the bar. The ambience was quaint and warm. The service was friendly and attentive. Thank you Queen if Arms for not leaving the vegetarians out of your Sunday roast special!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S4TqGeDRjGTyCObU2N7jCw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S4TqGeDRjGTyCObU2N7jCw/o.jpg"
      },
      {
        "img_id": "sf7BxIZtRDQ3U8r16Ixb1g",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sf7BxIZtRDQ3U8r16Ixb1g/o.jpg"
      }
    ],
    "user_id": "TaTGyiGSjyhcD7ztXcvBsg"
  },
  "tbBwUCgv133bYCTt26oAAA": {
    "date": "11/18/2018",
    "text": "Very good and delicious burgers and chips. A cozy little restaurant. I recommend to go there",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "INvjiT9vqPjj7noJqfaw4g"
  },
  "XIpZvz43QDz925Pcc4av1g": {
    "date": "10/30/2018",
    "text": "This was our first British meal and it was fantastic! The waitstaff was friendly and warm, very helpful and knowledgeable about the food and sights around town.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WIVSgSC3gZSxfaGvHKi-Kw",
        "caption": "Photo of The Queens Arms - London, United Kingdom. The Queen's Arms... fish and chips, chicken leg and pots and roasted red pepper and tomato soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WIVSgSC3gZSxfaGvHKi-Kw/o.jpg"
      }
    ],
    "user_id": "HQcR0lLpOwM_lyWzPPIBag"
  },
  "8euLC5htuhgfauwlM13mVg": {
    "date": "10/14/2018",
    "text": "After ten days of eating boring, commercialized tourist food in Croatia, this pub was a welcome treat! The Sunday pork belly roast was cooked to perfection and came with delicious veggies. My partner had the most amazing APA (American Pale Ale, but not made in the US, it's just the style), and I had a splendid glass of African white wine. Our server was absolutely delightful as well - very warm and friendly, which rounded the entire experience. If I lived in London, I'd eat at this place every Sunday! Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ikRTwGgoH6Y13xWiW_cQA"
  },
  "-S8bQpA220p11d7Q08enDg": {
    "date": "2/3/2018",
    "text": "Decor: pubbish Service: politeFood: pleasing I chanced on this pub when half the patrons were hosting an ugly christmas sweater competition. I paid for the food but the entertainment was free.Fish and chips salted and malt vinegared to perfection. The waitstaff were lovely people.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iKZWH_uokNhWNcstwcemuQ",
        "caption": "Photo of The Queens Arms - London, United Kingdom. The bar decked with boughs of holly",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iKZWH_uokNhWNcstwcemuQ/o.jpg"
      }
    ],
    "user_id": "s7LocToSQg966Lf5fxM5Mg"
  },
  "ETERBvEuXFXRihFpCegclQ": {
    "date": "5/16/2018",
    "text": "This was one of the best meals I had in London! A great little pub with excellent food. I over-ordered because our pub experiences earlier in the trip hadn't been especially delicious. Their portion sizes are decent so, if you order appetizers, have someone to share it with! I tried the mushroom vol-au-vent (a puff pastry covered in mushrooms and a creamy sauce) and the veggie pithivier (an assortment of roasted veggies and olives layered in a puff pastry pie with feta cheese). They were both really good! My friends raved over the asparagus and pea soup. And the fish n'chips were a large, fresh side of seafood. This pub also had the BEST bowl of chips! Since the dining room upstairs was closed, we had to wait quite a while for a table so come early, grab a pint and be prepared to wait. It's worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "hxIIar6pvd_OXk9U3wGaHA"
  },
  "0i-f5Z31zZ4SyzWAn7OsWA": {
    "date": "10/18/2018",
    "text": "My sister and I came here for a last night dinner and drinks and we loved it!! The waitress came right away to us and took our food and drink orders. Visiting from out of the country she explained any questions we had. If we head back to London we will definitely hit this place up! I would recommend for everyone to go here",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "diIz0owJKi32B1c8k56JZw"
  },
  "hbnl_aunnVbB-VekvfgA4w": {
    "date": "5/25/2018",
    "text": "The servers were terrific, efficient and entertaining, which was much appreciated by American tourists.  We got the Sausage and mash and fish and chips and everyone thought loved the food.  The Chocolate Mousse was great!! Overall, we thought this place was fun, great atmosphere, terrific service and food.  Definition be back next time in London!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MyyYltjm1Kaz1we7Hgeu7Q"
  },
  "0kmXbo6YbZMTekJCWNtyqA": {
    "date": "7/24/2018",
    "text": "Absolutely delicious. The cheeseburger plate, penne pasta and chicken, potato and green bean salad were all delicious (as I had to sample every dish on the table. The wait staff were very friendly and accommodating. The food was delivered quickly and the environment was cool and relaxing. Will definitely be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bdc_rZ8mpD-RuUyS9NAeSg",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bdc_rZ8mpD-RuUyS9NAeSg/o.jpg"
      },
      {
        "img_id": "y96BuAiTL2crWUi5Y360wg",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y96BuAiTL2crWUi5Y360wg/o.jpg"
      },
      {
        "img_id": "bQOkP_anpgqFGg8SN98OgA",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bQOkP_anpgqFGg8SN98OgA/o.jpg"
      }
    ],
    "user_id": "M7lS5FRyV4ybYbPfSaB-2g"
  },
  "R6uRN_XYgDp1eNOZ8t2Kyg": {
    "date": "3/28/2017",
    "text": "Came here for a private function and had some lovely food.  The bresaola salad was tasty and the veggie Wellington was excellent. The cheese course was a letdown though. Very bland cheese! The pub also had great ambience and a friendly staff. Would definitely come again!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "9yC7Yy_BPKWFgIDR7XE5Qg",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Bresaola salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9yC7Yy_BPKWFgIDR7XE5Qg/o.jpg"
      },
      {
        "img_id": "G4WxRB54nA4vttzK7H9Fng",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Veggie Wellington",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/G4WxRB54nA4vttzK7H9Fng/o.jpg"
      }
    ],
    "user_id": "2uBbhf4dHL54V9sDNkyWRw"
  },
  "AQ72H2PQtW7gZzhanzb0tA": {
    "date": "6/5/2018",
    "text": "Great Fish & Chips! Loved the atmosphere and authenticity for a great London eatery experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SZsHO8cW7KGEWrn10CJ4Tg",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Something with mushrooms.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SZsHO8cW7KGEWrn10CJ4Tg/o.jpg"
      }
    ],
    "user_id": "q2wDgeM5EW5Arm9ha_pGXw"
  },
  "NdTW-zflp582012l41OXRA": {
    "date": "6/19/2018",
    "text": "We just arrived in London and wanted something quick but tasty. We came across this place and we were glad we did. As you can see, the portions were plentiful and the tastes were great! I had the fish and chips and my wife had the Cajun chicken sandwich with chips. Great atmosphere and great service!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d6u9hN-4Ueg-Li-X6GqtQw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d6u9hN-4Ueg-Li-X6GqtQw/o.jpg"
      },
      {
        "img_id": "qWAWLyL-wcqRUQnjTrdOzA",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qWAWLyL-wcqRUQnjTrdOzA/o.jpg"
      },
      {
        "img_id": "bQSC5rwonYtqOopsP3_4cw",
        "caption": "Photo of The Queens Arms - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bQSC5rwonYtqOopsP3_4cw/o.jpg"
      }
    ],
    "user_id": "pKQZ1tMXroMYn3IUGVSAVA"
  },
  "TTcInPJ48iXe5VFvuzTq0w": {
    "date": "8/3/2018",
    "text": "I have now visited the Queen's Arms twice while in London. Each time the service has been friendly and prompt, and the food (especially the fish & chips) delicious. I recommend it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUdday4O7sngf-pgaVLCJw"
  },
  "uHZu3c2nJA3qwS5wHcovCg": {
    "date": "11/15/2016",
    "text": "Small dining room above a traditional pub in what was once an unloved part of Pimlico...these days it's slightly more gentrified, but i like apart from the odd nod to gentrification it still feels like a 'boozer' except they do food.Pretty good fare it is too..visited with a group, service was warm and attentive, food was good all round and the desserts in particular were outstanding.I'd come back..",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 2,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "hatXVe1g94gSRS8P_vgdOg",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Bangers'n'Mash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hatXVe1g94gSRS8P_vgdOg/o.jpg"
      },
      {
        "img_id": "eQw1vBWiokE14c6r-FPZsw",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Oasis on a cold and damp London evening",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eQw1vBWiokE14c6r-FPZsw/o.jpg"
      }
    ],
    "user_id": "2QNB9bvIkq71FvrJoqGgeA"
  },
  "o8kwa6Ckny2ArYwidqIiOg": {
    "date": "2/8/2017",
    "text": "Phenomenal pub, can't believe there aren't more reviews! The beer, the atmosphere, the fish n chips & the prices are on point!!! The fish is perfectly crispy & the tartar sauce is tasty! The peas were super delicious too! If I lived in London this would be a part of my week... every week! The servers are friendly & accommodating & the drinks are great! The  best part was the sticky toffee and ice cream! I suggest getting a second scoop of ice cream... mmm so good! Warm and delicious!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "92ySBb9XcteLduz_ucwe7Q",
        "caption": "Photo of The Queens Arms - London, United Kingdom. U.K. Beers on tap!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/92ySBb9XcteLduz_ucwe7Q/o.jpg"
      },
      {
        "img_id": "-zNnmroXcAd18XEAPGck-g",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-zNnmroXcAd18XEAPGck-g/o.jpg"
      },
      {
        "img_id": "ZNVhSV8eSw5qCorGlYdm0A",
        "caption": "Photo of The Queens Arms - London, United Kingdom. Bar snack- calamari! Great deal, extra crispy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZNVhSV8eSw5qCorGlYdm0A/o.jpg"
      }
    ],
    "user_id": "fevnU9WEaJTJm5QzyQIyWw"
  },
  "rDffOGiWvbJVi88Cz7YzrA": {
    "date": "9/24/2018",
    "text": "First time in London and visited many restaurants and pubs.  The service was good and food was great, offering traditional as well as unique dishes, highly recommended. Would give five stars but the drink service to the second floor was very slow.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P8nt61vYdayp2P1gbDVlNQ"
  },
  "Qm21fDr_Oq0RSeaOaiuyBw": {
    "date": "2/21/2017",
    "text": "Though I visited in July, the memory of the meal has stuck with me.  When in London, of course you're going to eat fish and chips.  And if you are staying in the food desert of Croydon, you're going to find any means possible to get into the city and get your eat on.Which is what we did and courtesy of fellow Yelpers, took the bait of this fine establishment delivering up some tasty eats.  The fish were outstanding (especially with a cold Strongbow) though I think the mushy peas were probably even stronger!  Small, quaint, great service, and outstanding food.  I liked it better than Fish (at Borough Market).",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pH6xdmfc8NciWowKwExjcA",
        "caption": "Photo of The Queens Arms - London, United Kingdom. mmm...fish and chips...",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pH6xdmfc8NciWowKwExjcA/o.jpg"
      }
    ],
    "user_id": "p4yW0yqvkStt-PR36k5jyg"
  }
}