{
  "h3hFEhKwC9ITGoXUJpY9Mw": {
    "date": "6/18/2009",
    "text": "On my last night in London, I ended up at Salaam Namaste for takeaway. My sinus headache was starting up again and I wanted to find something to make myself feel better. Still on the quest for good vindaloo, I knew I had to go here.I entered and the interior was sleek and stylish. Everyone was quite modern and the lighting was just right to be romantic. Of course, I wasn't looking for romantic. I was looking for quick takeaway.A well dressed waiter promptly came to seat me. When I told him I just wanted carry-out, he still led me to a small table, pulled the chair out and brought me a glass of water. Shortly after, he brought a basket f poppadoms and various sundries including a fantastic mango chutney. He chatted with me, as I came in later in the evening and they were not busy, and asked how I had enjoyed my stay in London. The manager came out to introduce himself and when my food arrived they bid me farewell in a courteous manner and packed some extra poppadoms to go with me.I ordered the chicken vindaloo with naan and a side order of onion bhajis. The bhajis were fantastic--just the perfect texture and not overpowering in their flavors. They were subtle and some of the best I've had in quite a while. The naan was the perfect texture that naan should be and the chicken vindaloo cleared my sinuses just like I wanted. It was spicy, delicious and the chicken still quite tender (and it was reasonably priced for quite a substantial dinner).The food was great and this restaurant would have easily gotten 3.5 or 4 stars for that alone, but it was the extra service for someone only ordering carry-out that made me feel it was something special.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "BLmRIoETvx6ZiegiIWh0tw"
  },
  "axC-1NJqRP2an49pQAYnow": {
    "date": "4/8/2009",
    "text": "This is the most sincere of 5-star reviews.I mean, I don't usually throw around five-stars here, so I usually am quite sincere when I hand them out.  So, let's just say that this five-star review is to other five-star reviews as the A* is to A of GSCEs.  Best of the best.  And this is going to be long, because I have a lot to say about all the factors that went into my fantastic meal at Salaam Namaste.I didn't feel like cooking tonight, so I decided rather than make Robert D eat leftovers in the refrigerator that we would go out for a meal.  But where to go?  I felt like Indian, so we went to the nearest Indian restaurant to us.  Salaam Namaste.  And now that I've been there and because it's literally within 50 yards of my flat I will be returning again and again.As soon as we arrived, we were whisked to a table, which was pulled away from the wall by a server so that we could easily seat ourselves and was promptly placed back.  Napkins were immediately set down in our laps, and a bowl of poppadums with accompanying sundries in little containers was placed on the table, seemingly out of no where.  (I really appreciated the small size of the sundry bowls, as it was obvious that they were not being recycled at subsequent diners' tables as soon as we were done with them, if you know what I mean . . .)The menu was vast, and a specials menu accompanied it for good measure.  As I considered my options, I looked around at my surroundings, which were markedly different from your run-of-the-mill Indian restaurant in London.  Everything was modern, sleek, up-to-date.  An unimposing bar sat nestled in a back corner, and some floor-to-ceiling mirrors on one wall gave the diminutive restaurant a much larger sense of space.  The lighting was low and inviting, and individual candles topped each linen-clad table.Robert D ordered us some onion bhajis to start and the chicken tikka bhuna as a main.  I opted for two vegetarian side dishes: sag paneer and bhindi dopiaza.  We also got pilau rice and naan.  The onion bhajis arrived promptly, two big balls of wonderful fried onion on a plate that was thoughtfully and modernly presented.  Their taste was fantastic, light and obviously freshly home made.  It was a great signifier of things to come.  Our mains arrived in good time and tasted divine.  I can't quite put into words how delightful every mouthful was.  I realize now as I'm typing this that we ordered all traditional items, but the menu was full of more contemporary options that you don't see at your everyday curry house.  During the meal, we received attentive and sincere service, with almost all members of the wait staff coming to the table at one point or another to check on us.  When we requested another glass of Diet Coke, as if by sorcery the server magicked it up in ten seconds.  And, get this, the manager actually came to our table while we ate to ask how everything was.  And he was being sincere!Yeah, I couldn't believe it, either.  Now, I've been in England for eight months, and before I moved here I had visited more times than I can count, and I have never. once. been asked. by a manager. how my dining experience was.  I could regale you with stories of horrifying food service experiences in London, but I would be digressing.  Suffice it to say, I have come to truly appreciate an establishment run by persons who care about their patrons' dining experiences.  So on top of the phenomenal food and service I received, the manager's/restaurateur's care for my dining experience puts that extra * on my five-star review.  And, also, at the end of the meal once our plates had been cleared, a server came over with a napkin, which he laid over the table to cover the mess I had earlier made with my sag paneer all over the lovely table cloth, and set the dessert menu down along with individually wrapped warm cloth hand towels.  Classy.  I mean, this is the sort of attention to detail that I'd expect to see at a restaurant that is charging me three times as much.  (Not that I want Salaam Namaste to start charging three times as much; that would make me weep with grief.)  I was stuffed full with my Indian dinner of kings, but all the desserts on the dessert menu had me ruing the fact that I ate so much.  Because, as if Salaam Namaste knew I was overcome with awe at the dining experience it offered me, it showcased authentic Indian desserts to push me over the threshold of admiration and into the realm of obsession or infatuation!  My options went far beyond inauthentic westernized-dessert-menu afterthoughts (ie, ice cream and cakes).  Next time, I'm saving room for dessert.  And I promise to love and cherish Salaam Namaste forever and ever.And, apparently, Boris Johnson likes to eat at Salaam Namaste.  If that does anything for you.",
    "rating": 5.0,
    "rated": {
      "useful": 14,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "nm8bLm9BlPId34HWWVrO_Q": {
    "date": "6/21/2009",
    "text": "I really wanted to love this place, but I walked away feeling that it was merely \"good, not great.\"  I will add the disclaimer that we sat outside, so I don't really feel like I can comment much on the overall atmosphere or service, since we voluntarily distanced ourselves from that.I tasted two mains and two vegetable side dishes at Salaam Namaste.  One of each was very good, and the other two were sort of a let down.  The eggplant main that we had was very tasty and quite inventive and unusual, with lots of flavours but not an overwhelming quantity of spiciness.  The other main, a green Goan curry, was not all that tasty, and I've had a much better green Goan curry at Ma Goa in Putney.  The spinach side dish was great, but I think it's sort of hard to mess up a simple spinach dish like that, and our vegetable korma was a little too sweet for our liking.All in all- I might go back if I was in the area and had a craving for Indian, but I wouldn't trek across London for it.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aZGTn42PI10nzs0Amg-7qg"
  },
  "NAbHRpxUYSLLNDtmimSkSA": {
    "date": "12/8/2009",
    "text": "This place was good -I was pleasantly surprised. The service was excellent and the food was flavorful in a fresh way. We started with an appetizer off their specials list...something along the lines of chowki tikki. Yummy. For dinner we had the pistachio chicken korma which was a little sweet, but definitely a change of pace and not something I've seen elsewhere. And we had a lamb dish that tasted good at the time but wasn't notable enough to write about. The naan was especially good - it was peppered with black sesame seeds and the bottom was a little crispy. We left full and happy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLAnVhCX4ngyHK3EzUIRPA"
  },
  "JMazCLcMYIK2r0fI5esupw": {
    "date": "8/22/2010",
    "text": "yes please. I can't wait to go back to London so that i can eat here again. I live in London for two months found this  place toward the tail end of my trip and took my family there when they came to visit because i know they would love it. now London has so much Indian food that you will die before trying every one but if you love Indian food this is the place for you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gr2Bysat49iYtAlYUqnLaA"
  },
  "rWhyJ_aTnPJS4AdTn7KoWw": {
    "date": "1/3/2008",
    "text": "The food there is absolutely authentic and delicious. the atmosphere and table settings are exqusite. They have a wonderful lunch buffet for 4.95 pounds and it is a great deal for the quality of food served. Must try is the Naan as they are piping hot and freshly baked when served!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "xyJvelmRtxjbWrwqp5-iSw": {
    "date": "12/19/2008",
    "text": "great Indian dishes, cool service - attentive but not overly so. i like the prawn dishes best, king prawn pathia and jinga malabaritasty!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yas3wagQx0F8zU7EJu8zww": {
    "date": "6/8/2015",
    "text": "We booked an OpenTable reservation only because we were traveling. When we arrived and were seated we were told we'd get 30% off our meal for booking through OpenTable (something we were not aware of), but that there were stipulations for getting that including having to order two starters and two mains and that if we ordered anything with seafood there would be an up-charge of £3 per item. I watched a waiter take a swing from an open bottle of wine when he thought he was out of view, so don't order wine unless it's an unopened bottle. The food was fine. It was nothing particularly fantastic, but it was decent Indian fare. Of the four Indian restaurants we tried on this trip, it was our least favorite, however it was the most expensive - even with their reluctant 30% off.If you don't want to offer a deal, don't. It's extremely awkward and makes an experience negative to get people in the door only to make them feel weird for receiving a discount they had no idea they were receiving, especially when the food is merely average.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yctKb1nVZD7lS3ShxAA6JA"
  },
  "6PlWYsAh8Jvsuot0zqXhvA": {
    "date": "9/24/2015",
    "text": "I love this Indian, it has the probably the best looking Indian food, I usually go for the mixed grill, the one I got here was very colourful, clean, it is a very modern style Indian, if you are in the area and want to impress someone, I'd go here for food.They also do great cocktails as my friend found out.They also take Tastecard.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4MPHYYKWmnPJbfUlJxGrg"
  },
  "876zKLH4dZYEI89y_Z3nBw": {
    "date": "6/21/2015",
    "text": "This is an above average Indian restaurant, tucked away in Bloomsbury! Came for lunch one day with friends, and was pleasantly surprised. The lunch set menu was affordable, and actually a cut above average. Perhaps because it wasn't so busy on this weekday, but the service was fairly attentive well. The food was excellent. Some Indian restaurants are a mishmash of flavor, without being able to distinguish much apart. Here though, the flavors were subtle but noticeable, such that I could appreciate mute of what was going on. Would definitely go back.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ukTqKLMXzZYG2X2e4Iyq-g"
  },
  "c4x1sNm024wlJ5T3l4sA9A": {
    "date": "2/7/2016",
    "text": "I agree with everyone here that the food was alright, but the service was not. The servers here running around is a mess, looking very disorganized, and even spilled stuff on my shirt twice without apologizing. It took them 15 mins to prepare my ice cream, I hope it was freshly made. This place is for people with great gratitude and patience.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PIl5_dON4HvQ3raCD7ETJw"
  },
  "DhW7Xds9zwiLx6oL9zDzXw": {
    "date": "8/21/2015",
    "text": "Great little out-of-the-way Indian restaurant. One must know it's there (thanks Yelp users!)We went without reservations and were quickly accommodated even though they were pretty full. GREAT QUALITY. My wife and I split the Chicken Tika Marsalla with a Cod/crab cake appetizer and olive Nan.  Each item was well presented, subtlety flavored, and delicious. Friendly staff 'though a bit slow.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQK4saxO2A0qfyviQaCXlg"
  },
  "JsFgUkISMUAAfKl68cu7RA": {
    "date": "10/21/2014",
    "text": "Good Shiva is the butter chicken here amazing. AH. MAZE. ING. Having been in London for 3 days, I knew I couldn't leave the following day without trying some proper English curry. Out comes my phone and a a quick search reveals there is a highly rated Indian Restaurant just around the corner from my hostel, SCHWING!!!! I pull up their website and instantly zone into the Tandoori Portebello Mushroom starter (Mushroom filled with figs, cashew nuts, curry leaf, raisins, green chilli, and homemade cheese...um, please sign me up for that mouth party) and of course the Moti Mahal butter chicken.I mosey on down to the restaurant and order in person for take out. They seated me at a nice big table all to myself  and although they were a little slow to take my order and pay attention to me, (I 100% understand that dine in patrons are like 5 times more important than me) the maitre'd took my order soon enough, offered me water and refreshments and I was on my way to curry town.I found the wait to be a little on the long side, but nothing I couldn't handle, perhaps I was beyond excited for the food and couldn't wait one minute longer to stuff my gourd with delicious majestic curry. I got my food after what seemed like 20 minutes and I RAN back to my room in excitement.And just to underline, the food I got was AMAZING. This meal will go down in history as one of the best I've ever experienced...and I was sitting on the floor in a tiny hostel all my myself and yet, the butter chicken and mushrooms transported me into a curry heaven of epic proportions. It was just perfect. Words cannot describe how amazing the butter chicken was? I mean, I'll try...this is a yelp review after all. Uhhh, buttery? Just the right amount of kick in the spice? Tender chicken? An ideal portion?Basically...RUN, don't walk to Salaam Namaste. And order 1 of everything.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mH8UvY1RjUTjfKejkIxPzA"
  },
  "b9NK8GNFC6EhFaNJ50h0fw": {
    "date": "4/21/2016",
    "text": "Stopped in for a solo dinner. Wait staff weren't particularly welcoming on arrival, though my server was fairly attentive to needs. Complimentary appetizer was nice, which I enjoyed while I drank Cobra (the only beer on tap). The Chicken Tikka Masala was slightly above average, and the naan was quite good. Would recommend as a solid Indian choice, if not entirely traditional cooking style. Service charge added automatically to bill.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoCs3qWF8YXtLj_8iMFsTQ"
  },
  "_T0DjMHHMw7qBCCvlzdXmg": {
    "date": "10/7/2015",
    "text": "Arrived on time for an 8pm reservation, dining solo on business.  I was offered only a table within 1 meter of the door although several other tables in the restaurant were still empty, including another same-size table just further in the restaurant.  I kindly asked to be seated somewhere else and suggested two different available options, but the \"host\" said the other tables were \"reserved\"--no one else was waiting at the time.  I reminded him that I too had a reservation and would very much prefer not to sit right by the door, and that the other tables were the same size, to which he replied again that the first table was my only option.  Really? And this restaurant is named \"namaste\"?  I opted not to stay, as I didn't feel at all welcome.  A dinner out isn't only about the food.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxDi-cjJpTGRD7--4lyhaw"
  },
  "qhjtT1HSMxYAPnsGndljJg": {
    "date": "12/11/2015",
    "text": "I only came to this establishment for takeaway bread for an Indian dish I was cooking myself, but from what I experienced, I know I will soon be back. The service was excellent. To get a few pieces of bread took only about 10 minutes, but you also have the option to call ahead and pick up. I told them I had made chana masala and one of the servers helped me choose naan and chapathi that would complement the dish. Each was warm and fresh and buttery - delicious. It is dark and cozy inside the restaurant. One a weekday evening, it was not very crowded. It is mid-range price, but it seemed more upscale than cheap curry houses, and if the bread is as good as the rest of the food, I think it is worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw97_9RQOHnoo4Vkzim_Dg"
  },
  "yBOqTI91_-IjAVUZptgxrg": {
    "date": "11/17/2012",
    "text": "I know I've mentioned it before, but Indian is one of my favorite ethnic cuisines. I absolutely love the variety of flavors in dishes, the different type of dishes you can find, and the atmosphere in most Indian restaurants. So It was a bit shocking to me when I realized that after nearly two months in London, I still hadn't had any Indian food.Quickly remedying the situation, I popped round the corner from campus to Salaam Namaste for take-away lunch one day. I was a bit before the lunch rush, which is nice because I was able to see how nicely kept the restaurant is, how the buffet looks quite good, and how there's plenty of space for both big and small parties for any meal.My take-away was pretty standard: chicken tikka masala with plain naan (I guess that's like saying it was standard peanut butter and jelly; I need to get more adventuresome!) but it took away nicely, was piping hot, and provided all the flavors I love in Indian food. I always prefer things more spicy, so maybe next time I will ask for a spicier dish or option, but they did a nice job for the price, they're in a great location and served food quickly for the lunch rush. All's good about that.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BvIIvQqPJ2cKC8eaSxOFpw"
  },
  "QYRGj-8TkTR7JJv4xmg8hQ": {
    "date": "5/22/2015",
    "text": "The Tawa Lamb Chops at Salaam Namaste are one of the best Indian dishes I have ever had. Fantastic.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dcTEHVdRMvSufJb6kAzFiw"
  },
  "7MtYLSoVrwA0YKCUaY9VsA": {
    "date": "2/18/2015",
    "text": "The place is beautiful and the food was amazing! We had the Shahi Palak Paneer, Aloo Matar Gobi, and the Tarka Dhal from the vegetable menu with rice and garlic naan. Everything was so good! We were really happy with each choice.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1415CcIioEkbChUNQoqgYg"
  },
  "-lmEwugH_fHjbrLR9VKpZQ": {
    "date": "5/24/2016",
    "text": "Very happy with the service and the food. The taste is authentic, and works for everyone. The people are nice and greet you with a smile. Definitely a must go for me whenever I am in that part of the city.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5uji2hO1jFmsS_nkybVLLg"
  },
  "sarR_Sya82ZbIwIi067IJg": {
    "date": "8/13/2014",
    "text": "We visited late on a weeknight, and the place was nearly empty, only one other table seated. We received excellent attentive service. The food was flavorful, and the portions were generous.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jdWqAvw0NimMeahXtoFJWA"
  },
  "uPKq2zP2063mJU8_0cZYtg": {
    "date": "5/25/2011",
    "text": "Where: Salaam Namaste, Kings Cross With Who: a whole heap of reprobatesHow much: £30 a head for curry, rices and breads, (a lot of) lager and serviceCome here if: you've run out of options in King's Cross and can't face the walk into townSo we needed a curry house. For ten people. Nothing too clever or too different but somewhere that would satisfy my foodie pretensions. And, at the request of Lebanese Al, over for a very short visit from Beirut, somewhere that served Chicken Tikka Masala... oh yeah, and we needed it in King's Cross.Sometimes a total lack of options helps sharpen the focus. Once we'd ruled out the fantastic Eritrean restaurant Addis (for its lack of Tikka Masala) and veto'ed the shit in a tray merchants along Pentonville Road we were left with one choice, Salaam Namaste. I say only one choice, it had been checked out slightly. Telegraph critic Matthew Norman has rated it his favourite Indian restaurant in London and it's the only one in the area covered by Charles Campion's excellent local restaurant guide. Preparation prevents piss poor performance. Or so my teachers told me. And thankfully it's true in this case, preparation led us to a pot of gold.It certainly doesn't look like much. Large open windows, bright generic decor and furnishings combine with the sub continental muzak to make the place timeless and placeless, and not in good ways. The food on the other hand is as lively, fresh and refined as you could want for. Poppadoms and zingy pickles took the edge off our hunger as we scanned the diverse menu. They don't seem to have any regional specialism, bouncing from West to East coast taking in My lamb barra kebabs, an Afghan speciality, were small but perfectly formed. Cooked to a deep pink and charred on the outside by the heat of the tandoor, the spice kick came after a sweet and unusual taste of kachri or dried cucumber powder, a regional ingredient and not one i've tasted before. A 'tarragon' squid dish also stood out, partly because the predominant herb was a clean and (for sub continental cuisine) unusual shot of dill. The squid was soft and sweet, like al dente pasta of the sea.The mains were similarly intriguing. They too zipped around the region, like a hyper-active Michael Palin, taking in treats from Bangladesh, Afghanistan, Pakistan and every nook of India. Conventional curries lurked for the unadventurous. A dry beef curry came spicy with citrus sour kick and a wonderfully subtle Welsh lamb biriyani arrived authentically and theatrically with the bone protruding through a thin dough 'lid'. Other standouts included a refreshing and light Goan green curry with tangy tamarind and a clever vegetable side of mixed peppers and onions dry fried with a coconut crusting. The targeted Tikka Masala was pronounced perfection on a plate by Lebanese Al, but the sauce was too astringent for me. The chicken was well enough cooked but I didn't feel the love here.It wasn't particularly busy but we didn't arrive till 9.30. At lunch, and earlier in the evening, I've a feeling it'll be packed with lawyers from the many nearby courts though it's cheap enough and authentic enough to garner an audience among the sub continental students around Russell Square.Salaam indeed...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "5kl5pSAzsNh5DXLvZmdP4g": {
    "date": "7/17/2009",
    "text": "Based on the previous Yelp reviews, I was expecting some fairly good Indian food.  While I agree that the atmosphere and service were good, the food lacked flavor.  It seemed like the emphasis was on the presentation rather than the taste.  The chicken korma didn't taste of chicken or korma.  The pershwari naan was a bit bland, which is odd considering it's suppose to be a sweet bread.  Overall a bit disappointing and probably will not go back.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "tfxHdr6vZENXsC1Lou2BRg",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Chicken Korma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tfxHdr6vZENXsC1Lou2BRg/o.jpg"
      },
      {
        "img_id": "xBokVnaVMKyYqrNFRNs-OA",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xBokVnaVMKyYqrNFRNs-OA/o.jpg"
      }
    ],
    "user_id": "jIdpjWPfWKneYPGGtKUM_Q"
  },
  "Li2dNZHIdIB7qBXSSU8aZg": {
    "date": "8/8/2015",
    "text": "Amazing contemporary indian food and attentive staff. They even made special dish not in menu for our kid when he asked. I honestly don't know why people wait in line for dishoom. This place is plainly better and has no lines.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lc7qf6YtYeoeCMjfAUfmsg"
  },
  "FxTp8XgZbfu-PYmBv0BKxg": {
    "date": "4/4/2010",
    "text": "Looking for a quick take away bite late on Easter Sunday, we thought we were out of luck for anything other than prepackaged convenience store food. Luckily, we found that Salaam Namaste was a) open, b) had take-away and c) a mere 8-10 minute walk away. Our plans changed when we got there, though, as the clean, warm interior beckoned with delicious food-smells. We decided to eat in and ordered a little more than we had originally planned, but it was well worth it. We shared aloo chat, a chicken curry special and some naan, and all were very good and filling. The chat was different than what we get in the states, but the sweet/sour flavor was a welcome change. On top of that, a very attentive wait-staff and a friendly and accommodating manager (I think?) made this an unexpectedly nice dinner out.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "_rj_-Y1mk3DwS-lJW7birA"
  },
  "2OlN2ApMPJV4uWlJtr4g8w": {
    "date": "6/16/2013",
    "text": "My wife and I ordered two of the specialty dishes and were blown away. Well worth a visit and well priced.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zchy_tYSLPDFhcf8bgvMyg"
  },
  "nXH-IzFC5gygvnq3xINTyQ": {
    "date": "11/14/2012",
    "text": "We came to Salaam Namaste while staying nearby in Bloomsbury. The meal might have been the best Indian course I've ever tasted. Absolutely worth five stars. However, upon receiving the bill, we were not only charged for the appetizer of chutney and chips (which we didn't order and assumed was included), but the tap (still) water (7.50!!) that we also had assumed would be free. While the meal was delectable and worth five stars, this nickel and diming definitely had us leaving Salaam Namaste with a sour taste in our mouth.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MBAvNGj97wUm1VorLHvOiw"
  },
  "YVsecy_3wRpZlE-vq2xi1w": {
    "date": "11/17/2018",
    "text": "This is a fantastic place for families.  Absolutely delicious food, especially the goat curry and delightful staff. I'll definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QB-hM01yJluCIqyCcsEV0A"
  },
  "Y2UD2JqLJ_xgV0uVBbF5mQ": {
    "date": "9/14/2018",
    "text": "Prior to our holiday I researched about great Indian restaurants close by where we were going to be staying in London, and Salaam Namaste came first on our list. We went for dinner with my family and cousin which I have not seen in years. It was a Monday we went and they were supposed to be open at 5:30pm but we came half an hour early. They let us stay inside and chit chatted, served us drinks rather than sending us away and come back. The place is not too big but very clean and cozy. The lighting is perfect and there is good enough space for each one of us and our food and condiments on our table. We had Chicken Tikka Masala, Lamb Rogan Josh, Dumpukht Lamb Biryani and Garlic Naan Bread. I just wished they had it served in big portions. Albeit, their food is very delicious! The dishes were neatly and appetizingly presented. On top of that, we were very pleased with their wonderful, very friendly and fast service. We didn't have to wait long to get our food. The manager was also very nice and accommodating. He came to our table and made sure we got everything we needed. The manager said that the meat they use is grass fed and free range from a ranch owned by Prince Charles. I think that's why the meat tasted good, apart from their chef's undoubtedly good skills of course and the spices they added to it. We will definitely be coming back when we visit again. I recommend this restaurant. They deserve full star.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BwH0Gdpd4KCi5bf2WZbhVQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BwH0Gdpd4KCi5bf2WZbhVQ/o.jpg"
      },
      {
        "img_id": "d4OLmXz0kwh1tEyb1X6BoQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/d4OLmXz0kwh1tEyb1X6BoQ/o.jpg"
      },
      {
        "img_id": "qlfFyuOt8EPvMAPsMJhfdA",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qlfFyuOt8EPvMAPsMJhfdA/o.jpg"
      }
    ],
    "user_id": "BSl3arAd5Zo5Cx_cGu9T5g"
  },
  "r6bsqHg0teHxtKhU9wRD1A": {
    "date": "6/5/2018",
    "text": "I really wanted to like this place. I read the reviews before I came, and headed over on a Tuesday night. Despite the place being half empty, they asked us if we had reservations, which we did not. We had to wait until they felt like seating us at a small table, even though there were several others immediately open. Not knowing what reservations they had, we waited a few minutes and were sat. No big deal. Everything seemed fine - we ordered some drinks and then ordered food. We had a good idea of some things that sounded tasty, but this came back to bite us. We asked for an order of naan to go with the food, and (mistakenly) thought the chicken tika masala and perhaps the palak paneer would come with rice. We also got the soft shell crab and Bombay onion bhaji appetizers. Folks, I will say it here - I think we were very likely discriminated against at this place. We were casually dressed in shorts and flip flops, and we both have a number of tattoos. Did they not like tattoos? Americans? Flip flops?! My lack of intimate knowledge of Indian food? We had ZERO suggestions for food, and there were several obvious dishes that everyone ordered that they did not even try to suggest. Numerous people that came in after us were served before us. No one asked us if we wanted more drinks. They brought us two servings of naan, and of course no rice since that is apparently a la carte. Why would you not suggest some very common things that are obviously popular? Why did it take 2 hours to eat for 2 people on a Tuesday night? I asked our server about the naan and lack of rice, and he did in fact bring us some rice to eat. But it was pulling teeth, every step of the way. This review doesn't do it justice - you just had to be there. I'm really not just a whiner, but I have eaten out in many many restaurants all over the world, and this was a pretty obvious case of us getting deliberately ignored. Their food is pretty decent. Just cover your tattoos, or wear an \"I love Canada\" shirt or something. Or both. I won't come back, as there is a LOT of great Indian food in London, and hopefully the next spot will be better.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6BPMK69rK1UPhcVi_B-q2w"
  },
  "JzKlts046clDnfXkg8RBuQ": {
    "date": "10/19/2018",
    "text": "This meal was by far the best one we had in London so far, I had the lamb shank and my wife had a spicy chicken dish, Sorry I don't know the names, but the wait staff helped us order, we also got the coconut naan bread that I'll be thinking of for a looonnnggg time, we also got the chick pea side and the califlower pea side, both were very good. The ambiance is romantic and cozy and the wait staff couldn't be nicer. I highly recommend this restaurant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BMD_VX9TSHbnffRcthdEkA"
  },
  "lvJEjgcERuljfui6WQ1W8w": {
    "date": "1/3/2018",
    "text": "Amazing Indian food! I came in as a solo traveler with no reservation. They sat me quickly and I ordered wine and an appetizer. For the life of me, and despite a search on their website, I can't remember the name of my dish. It's on the right side of the menu, at the very top. It's a specialty type dish for the restaurant. Anyway if you show them a picture they'll know what it is. Try it!I also finished with the grilled pineapple and coconut ice cream which was very good too!Disclaimer. They got busy half way through my meal and seemed to forget about me. I asked for the check twice and had to wait a while for them to respond. And last the pineapple in the desert was slightly undercooked, therefor hard to cut. But still delicious!! Don't let this deter you. Check this place out!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tH5i2HciUXc5PJGioSQkBQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tH5i2HciUXc5PJGioSQkBQ/o.jpg"
      },
      {
        "img_id": "TN1lujL4_3A6Ch7RkhW8SQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TN1lujL4_3A6Ch7RkhW8SQ/o.jpg"
      }
    ],
    "user_id": "_UmGC5iA4TVU1VkPvdIEMw"
  },
  "3LSS65muD0U99Y2ulyWexQ": {
    "date": "1/9/2018",
    "text": "Definitely better than the esteemed Dishoom. Waiter took care of me very well and the food came out very quickly. It is a quieter environment and cozy with a very welcoming staff. Food was on a higher level than every Indian restaurant that I've had in London. If I lived in the area, I would definitely be a regular.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2oghpxiNbmxLsVicbbPVKw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2oghpxiNbmxLsVicbbPVKw/o.jpg"
      },
      {
        "img_id": "RzfRcGtbrWaa_CdfHDQq1A",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RzfRcGtbrWaa_CdfHDQq1A/o.jpg"
      }
    ],
    "user_id": "UXBW4K5ttWzEtbnkCMajfw"
  },
  "vAV74VZ2ZbEcBK0wm2r3xw": {
    "date": "6/13/2018",
    "text": "Wow, this amazing Indian restaurant tucked away is amazing. Friendly, clean and very welcoming. The menu choices cover all you traditional needs and the quality of the food is good (as I type this the waiter sees my beer empty, a simple nod of the heads and another one ordered). Highly recommend.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbSR9zE-7ezxJWbTkdhRhQ"
  },
  "XE-T80pcJ93LPQ5p82AsLA": {
    "date": "3/15/2017",
    "text": "Stopped off here for a late dinner recently - excellent upscale Indian in Bloomsbury.Menu items included venison, goat, quail, a variety of fish and other interesting meats as well as your curry house favourites.Unfortunately I was by myself so limited in what I could choose (and they didn't offer a Thali which would have been great) but the food was wonderful and full of flavours - you could really taste the spices.Will definitely return with friends so we can try more of the menu...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_RCDbNcDjF1dPuerIJrUtw"
  },
  "u3FnzB-8_dd8sFMZSyQA2g": {
    "date": "10/11/2016",
    "text": "We dined here on Sunday night and had an enjoyable meal. The restaurant is warm and welcoming. Loved the pompadoms and chutney to start the meal. The lamb biryani was the highlight, and I recommend trying it!We had a wonderful server who took great care of us, but  there is one reason only I gave them 3 stars and it's something that should be addressed (as I see another reviewer has mentioned this as well). A gentleman who seemed to be a manager was seen by our table taking a bottle of liquor off the shelf, taking a swig, and putting the bottle right back on the shelf. This same man came by our table one time and he seemed \"grumpy\" for lack of a better word. I'm not sure if he was drinking his sorrows away, but maybe next time if he decides to drink on the job and can pour himself a glass instead of putting his mouth on the same bottle others will be served out of.  Moral of the story, go for the food and stay away from the drinks.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gWMdp83vY2SHjz1AFUWa4w",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gWMdp83vY2SHjz1AFUWa4w/o.jpg"
      }
    ],
    "user_id": "U6wlsx-gOa0cx8kuRJsOMg"
  },
  "Z-XmtMsMl4RFhmjSdFnyZQ": {
    "date": "6/28/2018",
    "text": "The ginger plum naan was what caught my eye and it did NOT disappoint. Great service, great ordering advice and really really good food. Will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c_w6mvwNbvqR-SJls9FWBQ"
  },
  "EH8vWnNeRrsbils7rTMD1w": {
    "date": "5/17/2015",
    "text": "Elegant and modern Indian cuisine can be hard to find at home; so it's always a treat to be in London. My father in-law's flat is right down the street from here. He eats there once a week and once you go, you would too!You MUST have their Chowpatti Bhelpoori. It's modernized a bit in presentation but has all the great flavors: chickpeas, puffed crunchy rice, peanuts, sprinkled with pomegrantes...FANTASTIC. And every table needs an order of papadum. So fragrant and crunchy, served with the colorful trio of sauces--love it.For my main, I had the Tandoori Rubiyani Duck. The flavor combination (yogurt and cream cheese marinade), roasted prawn, and dressed greens truly was delicious. We added a side of naan and ordered a special rice dish that was seasonal offering for their Gujarat menu (I can't remember what it was called) but it tasted like it had everything but the kitchen sink in it--in a good way!The service was perfect; the chairs soft, and the beer cold. It kills me not to be able to get food like this all the time. I mean, how many Indian places do you know that has seasonal menus that emphasize different regions??",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TrIjZFM6sG20mMo7p7t_9Q",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Chowpatti and more!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TrIjZFM6sG20mMo7p7t_9Q/o.jpg"
      },
      {
        "img_id": "ImKzZJhsHs29jS69agML4w",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Papadum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ImKzZJhsHs29jS69agML4w/o.jpg"
      }
    ],
    "user_id": "pWmXVpOnQnN03BXEFozf9w"
  },
  "TH7TrfUTZWWraDdjoXrHPg": {
    "date": "4/5/2018",
    "text": "Stumbled onto this place during our visit to London. The spices were amazing, and the two lamb dishes we ordered (from the 'house' specialties section of the menu), were some of the best Indian food I can remember.  The restaurant is off the beaten path if you're staying in central London but just a five minute walk from Russell underground station.  Worth taking a stop if you're heading from Piccadilly to St. Pancras on the tube.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-k8jG12n7nsyusLB5LHLg"
  },
  "KeNCSLnLKOavSwXmYHoZ4w": {
    "date": "4/9/2016",
    "text": "~50mins to get orders taken and ~90mins to get served food because they prioritied over takeaway, which they could have rejected on apps. Food was actually really fragrant and rich in flavour. Lamb shank was cooked properly, came off bone nicely. Dahl soup was also quite nice. Manager was apologetic and offered free dessert, but he ran away halfway in conversation straight after another customer also complaint.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1WQ9OUxQhbZ0bQICLLayZg",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Complementary starter as apology on the house",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1WQ9OUxQhbZ0bQICLLayZg/o.jpg"
      },
      {
        "img_id": "lQPvjhuh0_BKkWWBR4W-yQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Lamb shank",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lQPvjhuh0_BKkWWBR4W-yQ/o.jpg"
      },
      {
        "img_id": "rvkXpKmhNLz4igBKYWp7Jw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Dahl soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rvkXpKmhNLz4igBKYWp7Jw/o.jpg"
      }
    ],
    "user_id": "IdIOdqVndflxZ5L0YuHcQg"
  },
  "qaeKVwNJFOMeAHhHh9vbQQ": {
    "date": "7/13/2015",
    "text": "This is a fashionable place rather than a hole-in-the-wall curry house, with prices to match. The room is modern if a bit cramped, and it's nice that they take bookings for large groups. We came as a group of 8 people for a work dinner, and it was overall a decent experience. Presentation is fantastic, everything looks fancy and avoids the classic curry presentation of \"brown stuff on a plate,\" by adding colour through garnish and side items. I was very hopeful about the food when the chutneys and pappadums came-- clearly not out of a jar and very tasty. However, the rest of the food was decent but nothing amazing. I had the Chowpatti Bhelpoori and was glad to have saved a bit of chutney to add some flavour. The black dal was tasty but no better than I can make at home. I'd say this is a good option if you don't want anything too heavy, it's not greasy or heavy. But it's also not very spicy, and misses that medley of flavours that Indian cooking is all about, so I don't know that I'll be back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "znzqNyW2pJ0Q9wlqvu4YGw"
  },
  "TFgYLWz660dtrAibIJ4hVw": {
    "date": "5/10/2015",
    "text": "Staying at the generator on holiday from USA, i wanted to get a good curry takeaway that i could walk to. This place was the best i tried. This was seriously the best in the area.If you are new to london, here is a quick HOW TO for British Curry.The British (i.e.: Original) version of this curry served here is much less salty than it's American cousin. From the dearth of sodium-chloride, the wide array of spices show their awesome strength as they Captain Planet inside your mouth. It's like eating a Bengal tiger whole.  I paid £14 for the best meal of my stay here. Zero regrets. Give it time to cool a bit before you eat. You will notice a rounded flavor of turmeric, and the garam masala. Remember to breathe. You are experiencing this as nature intended: In London, hopefully with a tall ice cold lager.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9LIdV1yNBOMGwnhdHWIQdw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom. Staying at generator and looking for curry? This place was the best i tried. Not too greasy. Not too salty. Great service.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9LIdV1yNBOMGwnhdHWIQdw/o.jpg"
      }
    ],
    "user_id": "78-ok-ZcIKHcpXaufvTGDg"
  },
  "Qwsxsdl-wtRcuN2AE7IUmA": {
    "date": "5/9/2016",
    "text": "Stumbled across this place on a walk across London with a colleague. I'm hardly a connoisseur of Indian food, but I did just come back from a trip to Mumbai and found this meal right in line with what I'd had on the subcontinent. We tried the Moti Mahal Butter Chicken from Delhi, Murgh Jalfrezi, and a Channa Masala, with plenty of naan and some rice. All three hit the spot, although the Moti Mahal Butter Chicken stole the show. Not only would I return if I were in the area, but I recommended the place to a different group of colleagues the next night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFUlQYbfUakiGNt95goWtg"
  },
  "ekrZls_0qldNXrWhDjAhZQ": {
    "date": "3/25/2017",
    "text": "Found this place on Yelp. Excellent restaurant with great service. Main course are approx £12-15 so reasonable. Will definitely return.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_QIZHQdu7Z-0ko_qZBj3Q"
  },
  "wf9vM9s5vHMfkiBu-uJ-3w": {
    "date": "1/7/2017",
    "text": "My family and I were in London for holiday for a few days and, of course, had to have Indian food while in the city.  Our flat was about a 12 minute walk from the restaurant.  We had the butter chicken, Travancore chicken, Tandoori duck, Naan, and 2 samosas.  Very, very good.  We ordered the takeaway but they treated us like we were dining in.  Very hospitable.  Would visit again on our next trip to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q_eGpPqWvg1JNPOh9Fmgog"
  },
  "vRhLm7sQ2gi6O8LVzzL2NA": {
    "date": "1/18/2012",
    "text": "My friends were enthralled with their orders at Salaam Namaste, particularly my pal who went with the tandoori mix platter. I was left wondering where I went wrong. My chicken tikka masala was strangely sweet and that's by no means a compliment to the dish. The onion bhajis were slightly more appealing but nothing I'd go on raving about.The interior surroundings of Salaam Namaste are more swish than your average curry house (you won't leave here smelling like your dinner) and the prices head north to match. Still, they're fairly reasonable.I have this odd feeling that maybe the place deserves another shot, especially given the dearth of nice Indian food in this area. But for now I can't in good faith rate it better than just okay.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3CVqgIPIBIhBAVQ51heutQ",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3CVqgIPIBIhBAVQ51heutQ/o.jpg"
      },
      {
        "img_id": "J1GdCwnvPEycvTv46mb2Qw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J1GdCwnvPEycvTv46mb2Qw/o.jpg"
      },
      {
        "img_id": "OlNxKaSZTWt_papFu8KFyA",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OlNxKaSZTWt_papFu8KFyA/o.jpg"
      }
    ],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "ogJVbLjBC00QdRnZ3E4nlQ": {
    "date": "1/19/2014",
    "text": "Let me start by saying I am not a huge fan of Indian food at the best of times - mostly due to the resulting stinkfest.  That blessed aroma permeates even concrete and I can't stand how it sticks to every inch of your being even decades after exposure.   And so on that happy note....Salaam Namaste is an absolute winner!  It is a decent sized, somewhat modern looking restaurant near Russell Square - right in the middle of a dark, quiet and otherwise deserted street.  Upon entrance I am beyond ecstatic to find the place not nearly as smelly as feared - and so first impressions are overwhelmingly positive and suddenly I am on cloud cuckoo land!  Things remain impressive thereafter.  Service is outstanding - the waiter is attentive without being pushy - the wait for food, and the prices are reasonable and quality is pretty good too.  We even took the leftovers home and enjoyed the next day.  I wish my friend and I had been offered a larger table to make for a more comfortable experience, but it wasn't possible since the place was busy, which is a testament to its well-deserved popularity.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1Rz6Y27Mf_CBdPrTbYQHg",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U1Rz6Y27Mf_CBdPrTbYQHg/o.jpg"
      },
      {
        "img_id": "Pc6rIVG88SEpJ6oO4w3sQw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Pc6rIVG88SEpJ6oO4w3sQw/o.jpg"
      },
      {
        "img_id": "hC9ZJ6FcPSChG3jfgFwUCw",
        "caption": "Photo of Salaam Namaste - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hC9ZJ6FcPSChG3jfgFwUCw/o.jpg"
      }
    ],
    "user_id": "ebIvQWKuUN1Qeck2OT5A8g"
  }
}