{
  "cRgxENCFL9L27x5dXVevHg": {
    "date": "7/10/2011",
    "text": "this place is delicious! and it smells like fresh fruits (papaya, mango) the second you walk in. the food is good and decently priced, as are the drinks (i got a Brazilian Pimms, with cucumbers and lots of strawberries). Free wifi as well. I would definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGHqM-G6piFU9MZH6kqs8w"
  },
  "VC7uZjJ5I1J-YF9T-j-HoQ": {
    "date": "6/21/2011",
    "text": "Went there mid April. Nice place, turned up without a prior booking on a Friday immediately after work so it was due to be busy. Got a table for two within 5 minutes. Waitreses were very pleasant and helped with suggestions on the Cuban food. It was happy hour, two cocktails for the price of one. So felt it was a great deal on the drinks. Food was fine too and all reasonably priced. I would go back there again for a more leisurely meal and experiment.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k9CPAC3bAFFMzs1DcFLSMw": {
    "date": "12/15/2008",
    "text": "I've never actually eaten here (though the food looks FAB), but the cocktails at Cubana are to die for. The best mojitos & sangria in town, easily. Large selection of tequilias on offer and generally a quite extensive cocktail list. Prices aren't super cheap, but considering you're in the heart of Waterloo, they aren't half-bad either. Great for parties or just some fun times with a couple of friends. They offer theme nights and things like salsa-dancing lessons & real Cuban cigars for sale.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qeKRBIe7dzwjcnnLLoGQYw": {
    "date": "6/16/2008",
    "text": "Cubana is a busy little bar and restaurant that is quite good fun for jugs of cocktail and unusual cuban food. they also have live music on many nights which adds a nice flavour. I will say though that sometimes their happy hour jugs don't appear to pack the same punch as the full price variety and when it gets packed (and it does) the staff get a bit knarky in my experience. If you are going on a wed-sat eve and want a table, book ahead!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pBmioh5BIA1TyufvPYl5wg": {
    "date": "1/9/2008",
    "text": "For me this is a really good place to get drinks as they do a great selection of cocktails with some good deals on pitchers during happy hour. I'm a particular fan of their mojitis and margaritas. I've eaten here a couple of times in the evening and while the food was good, it seemed a bit pricy. They do have a good lunch special though which I would recommend, it's good value and delicious.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "61Wea9IJgd3BgDHvA7WPHg": {
    "date": "4/22/2008",
    "text": "This place is fantastic. The cocktails are all freshly made with quality ingredients and taste absolutely amazing. The food is really great too and I love the tapas. Sharing them with friends over some cocktails with the live music that plays Thursdays to Sundays is really good fun. The decor inside coupled with the music creates a really cool, latin atmosphere. There is seating staggered on different levels and you can also sit outside in good weather. The layout is really unconventional and quirky but it all fits in perfectly with the theme of the restaurant. A friend of mine rented out the entire restaurant for a party and that was great fun too as there is a dancefloor in front of the bar.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QC5yaJHGU4Rz4SkhcEEpDw": {
    "date": "6/10/2008",
    "text": "This place is wicked, it's a really relaxed bar with loads of atmosphere. I didnt go there to eat but the food smelt amazing and everyone looked really happy. The bar sells amazing mojitos, so what more do you need? Feels a little odd standing outside drinking in what appears to be a carpark but I suppose it adds to the charm of the place It gets really busy so expect to queue at the bar, but it's open til 3 so definitely worth it.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "io0bNSZC2ZlQsgqFWlo81w": {
    "date": "11/29/2008",
    "text": "O my god.. I luuuuve this place. They serve the best sangria in the world and their food is really good too. The décor is sooo cool with murals of Che and Fidel on the walls.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bEzDkz0fSNOxE7ds2EW4sw": {
    "date": "11/28/2008",
    "text": "Haven't been to Cubana Paddington yet but went too Waterloo Cubana a couple of weeks ago and all I can say is, if you haven't been - go. Good food, nice service, good-looking people, great music, late licence. By far one of the best bar and restaurants I have been to in London. however, not really for people looking for a quiet night.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "v4zEgcSJY5xM6OzQjl7Dtw": {
    "date": "11/15/2008",
    "text": "There are lots of places you can get something to eat along lower marsh - pubs and the like - but none as fun and colourful as Cubana. The cocktails are great and come by the jug full. You can't go wrong with a jug of mojito. The food is what you expect, with a wide variety of tapas as well as main dishes (the latter are quiet resonable at around a tenner). There is also a childrens menu (not sure what this is like though) and if there are enough of you then you can opt for the buffet. Like many places it can get very busy and when it is peak times they certainly dont let you sit there for hours.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9SzhXuOVX-w0OJ710nE63A": {
    "date": "6/9/2002",
    "text": "Havana good timeKick up your Cuban heels at this funky bar a stone's throw from Waterloo. With fab cocktails (check out the after work happy hour) and tasty South American snacks, you'll keep coming back to this colourful slice of Cuba.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "dBU2WshobvAuxBjfxFIADA": {
    "date": "7/23/2010",
    "text": "The cocktails were alright and decent value, but the food was pretty terrible. The chicken and chorizo stew had absolutely no chorizo in it and two piffling bits of chicken. I think they were trying to save money by palming off some potato and chickpeas for £10 a meal. The tuna was also overcooked and rubbish. We sent them both back and got no apology, but they seemed used to taking bad food back. The fact we were the only food reservation all night says it all really. I'd go there for a drink or two, but never eat there again.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ytz0XGtS_VGUCpVXAijBQQ": {
    "date": "5/9/2010",
    "text": "Never eaten at the place but had many good nights at the place. Cocktails are the best in the area and friday and Saturday nights rock",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "u9Y9Alp54RyZuZiMZyQxWg": {
    "date": "1/16/2008",
    "text": "My friend reserved a table here to celebrate her birthday, and we ended up having such a great time. As soon as you walk in, you feel like you're in the middle of Cuba, with Spanish music playing in the background, and a very South American atmosphere. It's filled with colourful paintings and wall sculptures, which include a massive gun, unloaded of course. The interior is bright and florescent with wooden furnishings to give it an authentic Cuban feel. I also sensed that the place had regular Cuban bar-goers who were friends with the South American waitresses. The dishes include tapas, tortilla, falafel, and very traditional Cuban dishes, which were not only tasty but very spicy! So take my advice and make sure you ask how hot the meals are before ordering. The cost for Cuban cuisine and alcohol were reasonable with cocktail jugs at £15 and coffee with rum from £4. They even had chocolate cake, which I must say was extremely sweet. However, there were a couple of down sides such as the main course menu, which wasn't vegetarian friendly. If you don't believe me, check the website as it is kind enough to have its menu uploaded online. Also, it's very loud and crowded by 9pm, particularly on a Saturday, where every one tries to dance to Salsa in such a confined space.",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "ueALiJKRdxrIqscWXyD7JA",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ueALiJKRdxrIqscWXyD7JA/o.jpg"
      }
    ],
    "user_id": null
  },
  "OzAcyunDuGnkN0XtcGsMhQ": {
    "date": "4/24/2014",
    "text": "Popped in for impromptu late lunch. They were out of many things we ordered. The food was okay. I have had a lot of Cuban food and this was not memorable. The decor was very focused on the Cuban Revolution, so I found it kitschy. One thing - their smoothies were made with real fruit and were very good.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AGo0WZXdwNR3bOb6YcS9Ww"
  },
  "LFRbAteSYU1hyHFf7IfvVw": {
    "date": "6/27/2012",
    "text": "The foodI had here was amazing, for the price charged the quality of the meat was excellent. Wash that down with a Gingery Mojito and you're onto a winner.The only slight problem was how busy it was, we were sitting up on one of the decks which meant we weren't in the staffs eye line, could have got more drinks a little quicker. Other than that the upstairs mezzanine was a great location, if a little hot before they turned the fans on.I would recommend!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mafJ7wFh8zov23ZOsv6s0g": {
    "date": "9/1/2011",
    "text": "Good atmosphere, and good food, reasonably priced. Great menu, though the kids menu is pretty weak, although the Tappas starters are a good alternative.Meal slightly displaced by the kids food order not being put through, meaning their food finally arrived 25 mins after ours had, once I had advised them it hadn't arrived. They hadn't noticed. They didn't seen unduly concerned to rush through the order ahead, once notified, either. Apart from that, a good place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8j12UkXSYIkh6H_vCyUNcA": {
    "date": "11/20/2010",
    "text": "Like the most colourful children's playground you can imagine, only with a lot more cocktails! Fast, friendly service in this lively bar/restaurant. The chargrilled Bistec is particularly delicious, and comes with these amazing plantain-cakes. Empanadas a bit tired, but the frozen cocktails will perk anyone up!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N9kdc2ZFXfYcHp9qMzmWdg",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N9kdc2ZFXfYcHp9qMzmWdg/o.jpg"
      }
    ],
    "user_id": "f-RB3_zYK2dHRMWbVY4EVw"
  },
  "e9hcjrno5OVDHvS6rSEEqg": {
    "date": "6/8/2010",
    "text": "I really do like cuban-style drinks. Mojitos, cuba libres, etc. All tasty drinks indeed. Cubana Cafe does a fairly decent job of mixing these up for you and you can get them in a pitcher as well, which is totally worth the money.I wasn't there to have food, or listen to the music, so I can't really rate it on those points, but the fact that you can't drink outside after 11pm kinda ruined it for me.All in all, a decent place to check out. I think I would have liked to try the food, next time.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uC3CdTuB7YuG4GCg0OvH8Q"
  },
  "dCTUQGQ4-2Dz_Ba-Oj-5Hw": {
    "date": "7/29/2013",
    "text": "Food was mostly good but the staff was a bit incompetent and bored from our presence. That's pretty much why there are three stars above.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-LvhYtb3K2lNF42qr1xmeg": {
    "date": "5/18/2009",
    "text": "Dear Cubana,Your food is mediocre and over-priced. But that still could have earned you three stars in my book--my standards really aren't that high. It was really the service that got me. Shall I count the ways?10 were the 2-tops that were open when I arrived. Yet, you refused to seat me at any of them claiming they were reserved. Despite an entirely empty restaurant, you put us between two other tables, with 6 inches on either side. In an empty restaurant. Why is that you reserve the tables for the groups that are sharing a £15 jug, when my group of two that you completely shafted on tables spent three times that? I also saw you seat a number of people without reservations at these so-called \"reserved\" tables.6 were the inches between our table and the two on either side of us. It was fun, at least, to find out what first dates were like again because I got to hear two up close and personal. 7 were the tables that were still empty 90 minutes later when we left. Reservations, my ass.30 were the minutes that I waited for my starter, which ended up arriving after my main. Despite me pleading with the waitress for it.1/2 was the flan that you gave me. A flan mold is pretty small generally, so to find that you empty them, cut them in half and serve was heartbreaking.4 was the bites of flan I managed to eke out of my meager dessert. 2 was the times I had to ask for my bill.12.5% was the service charge you tried to hit me with after giving me the worse service I've had in this price range in a long time.1 for the first time I've EVER refused to pay a discretionary service charge. I actually think you must be taking the piss--no one in their right mind would go back here unless they were so hopped up on mojitos that they didn't remember it clearly. I'd love to love you, you're so conveniently located and I love minty drinks. But seriously, fire your waitresses. Or teach them about seating. Maybe you provide a good bar-only experience but for a dinner date? Avoid avoid avoid.Love,LIna",
    "rating": 1.0,
    "rated": {
      "useful": 7,
      "funny": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "iTAYrWJYrNP5e28f0u9x5w"
  },
  "xnd3W5sk5AW07YXQd3-MDA": {
    "date": "3/8/2013",
    "text": "Oh Cubana, I love to hate you!! You're so funky but have consistently bad service, the worst I've come across :( such a shame!Check out my full review here: naomisnotes.co.uk/2013/0…",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FHc_ZcEpTXgnRut1EIZ9ew": {
    "date": "10/13/2009",
    "text": "This place is always absolutely rammed at the end of the week.  Parched young workers spill out onto the pavements, drinking their fill of the well priced cocktails.  What with the mural and lights on the outside wall, the music and the crowds, there's a party atmosphere.I've only tried the mohitos, which were cheap and minty minty minty.  I wouldn't fancy eating here because it's pretty noisy and a bit shabby.  A quirky little place to go a-drinkin' though.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-LDyNtk9BsfCq15lrijISA"
  },
  "eq2tH47MGF0jnrJccb7mnQ": {
    "date": "8/24/2009",
    "text": "Oh deary me. I came here on Saturday and then found myself really rather tipsy after a group of us shared SIX pitchers of mojitos. SIX! There was only four of us, it wasn't the cleverest thing I've ever done. But it was fun. Even though the bouncers give you attitude (you can take your drinks outside, but you can't drink out of them. Don't dare try and do that.) The whole place smells of sweat and mojitos. I imagine if I'd found myself in here sober, I wouldn't have had nearly as much fun. But fun was had, mojitos were drunk, and I arrived home rather later than planned. Considering how busy it was in here, the service was good and the prices aren't too bad. It's a fiver in, but you get a £1 off voucher meaning our fist cocktail pitcher was just over a tenner, I think they're about £14 otherwise. It's a lot of fun, the live music is a nice touch. Just don't go expecting anything but a great big cocktaily mess.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "pfcqem9vtNYtnv5vhdiXtQ": {
    "date": "2/5/2010",
    "text": "Cubana, right next to the place I live so I pass by quite often. If you go there on weekends and there is live music you can have a great time. I expierenced that the quality of the mojito depends on the weekday and I did spot rotten limes in their lime juicer. So be suspicious of funny tastes...",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "EkAGCQ5HITKPv2fiCK04oQ": {
    "date": "12/22/2008",
    "text": "As a previous reviewer mentioned, the squeezed juices are tasty indeed. If you fancy something a little more... alcoholic, try their delicious cocktails - they are divine! The Strawberry Mojito is really something else... The cocktails are the usual £6-£7 or you can buy a jug for around £15 - perfect for groups of friends!Their tapas are also worth a mention. The prices are so reasonable - around £4-£5 for tapas. I came here with a group of girlfriends and we had such a giggle getting drunk on jugs of cocktails and eating great food.This won't stretch your wallet by any means and the great atmosphere and brilliant food and drink are an absoloute must for any night out with your significant other or a large group of friends...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "diWrBDE2A-943HJJJsbiAA"
  },
  "kRNNhgFlZG9lPiXZaupy_w": {
    "date": "9/13/2011",
    "text": "Bad bad bad mojito, lots of little pieces of broken up mint that I kept sucking up my straw so I had to drink it at a funny angle, luckily I was with an old friend who didn't seem bothered by my strange behaviour and posture. Couldn't taste the rum either, only more mint, very disappointing. We were told there were no tables (at 6 on a tuesday night) and the waitress walked off and left us to fend of ourselves and enquire with the bar staff if it was okay to have a drink standing at the bar.",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "6x59QmEH7Oq18dkZ2mU8Hw": {
    "date": "11/24/2008",
    "text": "Oh Cubana! Aie aie aie!  Somebody quick, find me some castanets!  Cubana is just down the street from where I live and for a long time, I neglected it.  What a mistake.  Finally, one night, twas not a dark and stormy night, but a night nonetheless, I went to Cubana.  It was love at first sight.  We're going to get married in the fall, Cubana and I. So what do I love about Cubana?  Let me count the ways:1.  Decor.  Paintings of Latin figureheads on the walls.  Colors like a street parade in Key West.  A ripple painted around the place where one of the large lighting fixtures meets the ceiling as though the ceiling was a body of water.2.  Drinks.  Fresh fruit cocktails.  Crush me up those strawberries and lemons, raspberries and pineapple, and, baby, you've got delicious.  Although a bit pricey, the cocktails are scrumptious.3.  Music.  Oh salsa, oh tango, oh bachata, oh flamenco... oh Latin music how I love thee.  Both times I've been to Cubana, there has been a live band playing excellent Latin music - the kind that makes your hips have a life of their own as you groove groove groove away to the funky beats.  Mm mm I love it.Cubana is great - you should go there.  They charge an entry fee after 10 or 11 on the weekends, so go early.  But by all means, go!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1blFr8oQKwzCy_V5tdJKBw"
  },
  "nYAxUwooD5zqXgkTihSgrA": {
    "date": "11/22/2008",
    "text": "I like a little bit of Cubana, a place which retains a lot of soul and is very close to the southbank- bonus! Considerably cheap for the area and for what they have to offer, I would reccomend this place to groups of friends wanting to have a raucous meal out. They take bookings for up to six people which is advisable.I would reccomend some of the chicken dishes, spiced to perfection, and then the traditional coconut tart, heaven on the tastebuds. Don't stuff yourself too much though, as you will need to leave some breathing space to dance later on.The cocktails are really good, of course you should drink Cuba Libre. The atmosphere of the place is wild and authentic, the crowd is genuine and bonafide and everyone just wants to have a good time. If you are looking for a change from the normal London scene, then I would seriously advise that you give this place a good visit, maybe even plan a whole night, starting with a meal, moving onto drinkies and ending on your feet having a jive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S4IBcucqWoetv1A4Mzigvw"
  },
  "Exq4BcAbHJPgf1-GwDg-5Q": {
    "date": "11/9/2008",
    "text": "This Trendy Cuban-Latino bar-restaurant makes you feel a bit of the atmosphere of the island. The old fashioned Cuban dishes and the freshly squeezed juices and premium liquors are part of the night. The food is amazing if your thinking fajitas that is nothing to what they offer on the menue and at cheap affordable meals from £5.00 it is one that you can enjoy without burning a hole in the pocket!. The staff are friendly and extra helpful which stands out from a lot of other resturants i have been to recently . This venue is an excellent pleace for salsa and Latin dance lovers because everyone gets down!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3fur-LH6RbkK6AOOxP_tsQ",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3fur-LH6RbkK6AOOxP_tsQ/o.jpg"
      }
    ],
    "user_id": "tYnxDawnD6tMVhU5-qcqTA"
  },
  "rnlGuiU07bLyAL1DDgnorQ": {
    "date": "2/1/2013",
    "text": "Delicious! Very colorful interior, service was OK, but anything would have been great after 12 hrs of traveling.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I2isbphjIty4-xlSosjCTA"
  },
  "cnc5ExWpTVVd-2JhK8pi5Q": {
    "date": "7/4/2008",
    "text": "Some colleagues from out of town were in for a couple of days combined with a great two for one drinks offer made for a great evening excursion. The staff seemed a bit confused about the special, but in the end it all worked out. By 8 o'clock on a thursday the place was humming with activity. We grabbed a couple of tables for ten in the corner just to the left of the entrance which also made a great place for people watching. (There was a very tall woman who had hunched shoulders. We surmised it must be because she always has to lean over to talk to people). The seating is arranged on several different levels, each separated by a few stairs. It is a great layout to give an overall sense of activity and vibe, but still allows groups to have a bit of their own space. It is conveniently located just a 200 meter walk from the entry to waterloo train and tube station.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vu-6IttnMNgt2dtjLjYHYw": {
    "date": "1/27/2010",
    "text": "It was pretty quiet when we went in on a Thursday night. The cocktails were good but the tables are quite cramped due to the interesting shape of the building, lots of chairs wedged into nooks and crannies. We loved the decor, and felt inspired to join the Spanish revolution, fortunately for us it was over. The bar staff said they'd bring our cocktail over once it was ready and then tried to charge us an extra 2 quid for table service we hadn't asked for, so don't agree to them bringing you your drinks, wait at the bar for them. The upstairs bathroom was fine but the downstairs ladies appeared to have been host to some sort of pitched battle as several things were broken. We seem to have gone on the wrong night for music, only the echo of a dodgy electric keyboard playing Auld Lang Syne. It was shortly after New Year.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x35Oxzn-qSTXE-Cd5udDOA"
  },
  "j95kmKOF5CUeSBGCukl1Vw": {
    "date": "8/3/2008",
    "text": "Book in advance, we held a 50th Birthday party here for 15 people, the quality of the food was superb with all of us eating together and without feeling rushed but it was clear that you didn't have a chance of getting in without a reservation. Main courses range from about £6.00, i tried the Garbanzos Grillios with Chirozo - this was a chickpea stew with garlic and coriander and simply oozed flavour. The cocktails were fresh and very, very tasty (from what we can remember), especially those with lashings of fresh crushed mint leaves - buy the pitchers they work out better value. After dinner the restaurant becomes part of the bar with live music. Well worth staying around for after you've eaten. One tip - wear as little as possible this place gets very, very warm.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rsnNevTQHOPY-vtZ9WRZCw": {
    "date": "6/20/2016",
    "text": "We just happened to stop by because we love Cuban sandwiches. We sat down and they said they only serve them from opening to 1400. Wtf?! That's absurd but we still ate there. I don't remember what we got but we shared a typical Cuban dish, pork, rice , black bean and plantain dish. Very very very good. Prolly one of the best we ever had in London. All the restaurants in London are not authentic.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dGP2nAKmDh3G0lJ1Be09Mg"
  },
  "_8DpiVRUWle_j_CkYmyrdg": {
    "date": "1/26/2013",
    "text": "Count that as 3'5 stars.I went twice and the reservations seemed a mess. They refused to seat us when we arrived 20 minutes late although we called and were told that the table would wait for us.Twice the service wasn't good. I am not blaming it on the waitresses, they clearly have a lot on their plate.The second time I was even charged for something we did not order.Having said that, I must admit the food is pretty good. I mean, let's be honest, there are no plenty of choices in Cuba, so you can't expect that here. The ropa vieja is simply the best dish they serve. Really good, great portions and filling. The prawns are also one of my favourites as so are the croquettes. I even ordered the vegetarian plate and was ok although a bit dry.The drinks are really good. I would say I had the best mojitos outside Cuba, but they are a bit overpriced. Not too bad considering they are freshly made :)After eleven you can move your body with the latin music, which is really nice.Don't expect a lot from the service, have some patience and enjoy the music and the atmosphere. Also good it you want to hire one spaces to celebrate a birthday.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W6vd4JIEHeB2aqqmD0Eryw"
  },
  "Tf04BfxgD5wDyZyfYGJCEQ": {
    "date": "8/30/2016",
    "text": "I enjoyed the place. It was inexpensive and the street food option is very tasty. It gets very crowded in the evenings.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_DaqVQeZqxD4ZKfMtlXxZQ"
  },
  "VB3TEN212SmFc6GZeFYZ3w": {
    "date": "12/3/2012",
    "text": "Cubana is the simpler version of Floridita and I say that with all the love I can muster for a bar. Which, as it turns out, is quite a bit. As the name suggests, it's a Cuban themed bar and they do it well. On most nights, you can expect a lively atmosphere, some colourful decorations, and mojitos galore. But what really gets it going are the live acts on the weekends! The last time I was there, the band was composed of three middle aged guys that looked as if they had just strolled in off the streets of Havana. They were exceptional musicians and had the whole place dancing up a storm in short order. Unlike Floridita, where it seems that everyone is a professional salsa dancer, Cubana attracts the more amateur crowd and you can muddle your way through the basic steps without feeling too awkward. And after a few of the £17 mojito pitchers, it's unlikely that you'll give a damn and just go for it! They also have some crazy bright green drink (something Alligator) which looks ridiculous, tastes delicious, and has enough of a punch to floor an elephant.The minor gripe I have is the lack of dancing space given the various rooms and levels the bar is divided into. You can make do, but you're constantly dancing around the stream of people trying to make it to the bathroom or the bar. Still, given the fairly cheap drinks prices, the excellent music, and the great location next to Waterloo station, it's an easy win!.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "ZhpfeghdmN8w51hWiUuhWA": {
    "date": "6/26/2012",
    "text": "Mediocre-hokey-pseudo Cuban bar/restaurant.The food was uninspired, menu unappetising and staff uncooperative.Drinks were OK, however, very stingy measures in the cocktails made them taste like Gatorade. With loads of ice. And fruit that clogged the straw.I liked the location at least. Apart from being accosted by the local homeless people.There are better versions of this type of place in London and certainly WAY better over the pond.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "ttSnEstMFdnthyAyfT7-Qw": {
    "date": "7/3/2012",
    "text": "Some people hate this place. Personally, I can't see why. Is it a corporate re-badging of a quirky Cuban food concept? Possibly but the folks were friendly, the food was very tasty and the restaurant was a pleasant interior decorated in bright equatorial colours. Got in and the place was jumping. The colour scheme is a bit of an assault on the eyes after trudging through the longest rain season in London. Lass at the front takes us to a tiny corner table that had a serious equilibrium issue and one of the legs of the chair I was sitting on was about to give way. As I perched on the corner of the chair, I mentioned it to the fellow who came over first and he rushed away to grab an alternate. So sitting on a much more stable platform, we ordered. Peter, my fellow traveller, ordered the slow cooked beef hash and rice. I was put off by the word hash. I have had some bad experiences with hash in the past, so I ordered the steak. A couple Czech beers later and we were settled in and enjoying looking at the busy restaurant. Food came within 15 minutes and immediately regretted my decision. The steak was great with a really nice salsa verde and a spinach salad, but the \"hash\" looked like classic Barbacoa. Slow cooked beef and then pulled into tasty meaty pieces. It was 5 quid cheaper than the steak and I would say worth twice the price in terms of taste. I would definitely get this the next time here, Lots of options in this area for food but I would say that Cubana is a decent place to go.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PDsPblDeTNMmrb2Vs73cPg"
  },
  "Z-7UvVno4JwkP80ux2xyPQ": {
    "date": "4/21/2015",
    "text": "I'm from Florida and eat Cuban food regularly at home and I was craving Cuban food after I moved to London. While not the best I've ever had, the ropa vieja was very good and included a lot of food! Plus, if you go around lunchtime on the weekdays the meals are sold street food style and are much cheaper than they are inside the restaurant. Check it out if you want to see what Cuban food is all about.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96Ik6o1YWTgQEL7m2GL4Kw"
  },
  "x7bF5Z75DxyXTpwvmZP-yw": {
    "date": "9/16/2012",
    "text": "Opposite the old Vic theatre, The Cubana is a very popular & crowd restaurant and bar thIs place is a labyrinth of colourful murals cover the walls, palm trees, Cuba flag, revolutionist Che Guevara, and beautiful red & yellow flowers on each table. You sense this cubaness rustic feel as you walk in a passport to Havana.I'm giving Cubana five star..! And you may wonder why..! Well, if anyone know me I love Mojito and this vibrate place serve the best mojito hands down. My friend and I were totally surprised on how good this mojito taste. Why did this tasting so good where did the mint come from?? I had to ask .... i was told that the mint came from Spain...!Latin-American chefs & bar staff that know what he is doing.. I try the sharing platter of homemade tapes that just melt in you mouth.. Hmmmmm....!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7XLk6V0SxvzDjdZYmiIiQ"
  },
  "XQj08F6w4T3xAd8LcfGayQ": {
    "date": "10/8/2013",
    "text": "Only eaten there once and looking for any excuse to go back. Will you come with me?Looking for a quick spot to grab a tasty deal one lunch time me and friend tried out the lunch menu. Soul fool at it's finest. Although at first I was a bit concerned about the portion size, it turned out to be just right. The chicken was deliciously stewed and tender (and a healthy size!), the rice was perfectly cooked, the salad was delicious and the cocktails were wonderful.The atmosphere is intimate with the actual space being a nice size, loved the bright colours and murals and the Latin vibe was a wonderful get away from dreary London outside. Can't afford to go to Cuba, well, this may ease your pain a little.Can't wait to try the fuller menu...I will update then.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lrz5MgCcEJCx8wbtKbLnYA"
  },
  "OZM1hM4oGfKdFvPQORzfsQ": {
    "date": "12/6/2012",
    "text": "Even in the dead of the winter, after a day of bleak skies and light rain, I can turn the corner of Waterloo Station and it all washes away.It's the bright colours! And the guns on the wall! I might have the mind of a small, albeit disturbed child but the pretty colours just make me happy! It's impossible for me to have a bad time in this place...Of course, there is more to it than the paint job. I love cocktails, but I like them simple and strong. Cubana pulls it off with a pure, clean, mojito made with nothing but sugar, mint, and a wine glass of rum. Proper Cuban style. There's also a happy hour, which does indeed make me happy.Granted, the sugar will someday give me heart failure, but I'm ready for it. I'll take one for the team. I'll spend my remaining days drinking good cocktails with a big smile on my face.The food is good but I'd suggest this as a venue for large groups rather than intimate occasions. The menu is made up of sharing platters and Cuban style tapas, best served with a small lounge in the back, crammed full of good friends and enough mojito to drown a bear cub.Yes that's right.. I would drown a bear cub for these drinks.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0VOtDU5gQPLYsCR3V-X1w"
  },
  "I6iJuiYy068NY17HhIjRwA": {
    "date": "10/20/2012",
    "text": "Popped in here as I was told decent cocktails near to where I was wandering from Waterloo.It fit that description perfectly.When we got there it was happy hour 241 cocktails makes the mojitos eeeven better, I do wonder if they would be better getting rid of some of the food tables as the bar areas not massive and the whole time we were there very few came for food most just seemed interested in the drinks.Bar staff were friendly, or maybe my mates ability to chat to anyone in nearly any language won him some browny points.the 241 obviously made the drinks a reasonable price, I reckon if I went again outside of happy hour I'd just go straight to the jugs as they seemed like they'd work out as good value",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_wQYj5o-l9H-rq49_PRmA"
  },
  "pPScU1rQ-MCj3D8xrLeEKw": {
    "date": "9/29/2014",
    "text": "I love platanos and pulled pork - so this one is a winner. Vibrant vibe, great live music and very conveniently located both opposite The Old Vic and Waterloo Station. Prices are reasonable and they have an outstandingly good value Happy Hour. Only quip is the staff aren't particularly friendly or accommodating but this is London after all!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e2g8qeK-wr6pJOVY3CNXoQ"
  },
  "_BoHYUiRfJSPuvmv4vJMqA": {
    "date": "11/15/2015",
    "text": "Horrendous experience. Waited for 20 mins and no one even bothered to come by our table to take orders. We decided to leave as there was no sign of anyone remotely interested in serving us (or at the least letting us know that there might be a slight delay). Not a word from the hostess either as she saw us leave. This restaurant clearly doesn't care about service. Will definitely not be getting my business in the future.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IuiB1gh-Hd4wVEYlUK-YRw"
  },
  "PcDvybTHJupIT728Z7K21A": {
    "date": "1/7/2015",
    "text": "Location at the top of Lower Marsh is pretty good. The pulled pork is nice and they have a counter outside which is good for grabbing lunch on the move. Had other food and cocktails inside a few times and it's OK, but a little uninspiring.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kEfGufN-CqVeBCI3wmkVSQ"
  },
  "IPM-De29oIb-h9oI6lnRpw": {
    "date": "4/13/2014",
    "text": "Empty tables and they wouldn't seat us. Has happened twice. Won't go here again. If you get in, the food is good Cuban.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n791vewkbnoMzV_fE90DJA"
  },
  "52dSphQ4YBYPXFPqZSalzg": {
    "date": "10/5/2013",
    "text": "This place is awful. First they would not let us sit where we wanted to, they would not give us happy hour drinks 2 minutes early, then overcharged me and were rude the entire time. Shame, it is such a unique venue.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tmzyl4I9JUGrSB-6j7IwgQ"
  },
  "Yg8fd_CWlpU1bZgBhCUHdw": {
    "date": "9/15/2014",
    "text": "A cheap and cheerful cuban place I stumbled across while in the Waterloo area (looking for another bar actually). Great value for money, delicious Sangria, and a fantastic happy hour! It has a fun latino feel to it too, which is always a bonus! It's quite big but gets quite busy too, so I'd probably recommend booking.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K5Or1PRb5hHvEM7AxtsuZQ"
  },
  "zedDQX1KiAHtzNoF1jZXpA": {
    "date": "5/23/2014",
    "text": "Absolutely adore the environment of this place. The cocktails and the food go together very well. Although it might be full if you don't book a table for evenings. 4-7 is their happy hour for jugs ang coctails 2 for1. During the day they've got street food style eating as well. Very vibrant and colorful !",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BbgiP-VEeUcV1tOETAtAZA"
  },
  "N1mqxq6-bVxBafGSFQ8jvg": {
    "date": "11/13/2008",
    "text": "It was a happy accident the night I discovered Cubana. From what I remember of the evening it was a barmy summers night, and I had just tottered out of what I thought was the last bar of the night, when all of a sudden, I saw Cubanas bright red star staring down at me. As I walked, ok, staggered towards it, I could hear the loud hum of salsa going strong. There were almost as many people outside as in (the smoking ban had just come in), and I happily paid my £5 to get in. Inside was some kind of wild party with a salsa band playing, people throwing themselves around, everyone having a good time. Someone got me a Cuba Libra and a Mojito, both of which tasted fabulous.What I liked about this place was it felt authentic, not like some other Cuban bars in London which can feel a little contrived. Its also open quite late on a weekend, till 3am, so its a great place to end your evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CTmnKFE5IaOxLwhGvdcGGw",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CTmnKFE5IaOxLwhGvdcGGw/o.jpg"
      },
      {
        "img_id": "F7QdSYc36vIqs4xTANotbA",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F7QdSYc36vIqs4xTANotbA/o.jpg"
      }
    ],
    "user_id": "o4MzgIVS21sK4qr1yfKw_g"
  },
  "iuyaCp379i3nRi7Q6795Hg": {
    "date": "11/24/2013",
    "text": "Went there after 11 on a Saturday evening. It was one of the most joyous experiences we've had.  The live band is incredibly good, and it's a nice little place for some crazy salsa dance. The only thing I'd complain is that the dance floor is a lil bit tiny...and I lost my favorite earing there! Would love to go there again and again.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OBNdAnwnZqJipi00QNJ4Ow"
  },
  "D_Mr-_brEu5g29d3utjNeA": {
    "date": "6/22/2015",
    "text": "Enjoyable food mains & yummy deserts well designed restaurant, nice selection of foods, Bad points.  environment was really loud so was difficult to talk to people on your table also only one bathroom",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c85XfKPV525gswX1Uv7_qA",
        "caption": "Photo of Cubana - London, United Kingdom. Tasty tapas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/c85XfKPV525gswX1Uv7_qA/o.jpg"
      },
      {
        "img_id": "hgr0zG47dbr-AbBpZcRWcA",
        "caption": "Photo of Cubana - London, United Kingdom. Yummy deserts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hgr0zG47dbr-AbBpZcRWcA/o.jpg"
      }
    ],
    "user_id": "K2HgqjQtVrksK2CTUpIzIw"
  },
  "qxMH-3ulqKqpc5ixKA_uiA": {
    "date": "4/6/2015",
    "text": "Nice place to go for drinks. They definitely know how to make good cocktails in Cubana. I had a fresh frozen smoothie of ripe guava blended with tropical fruit and juices, which tasted quite refreshing.It gets busy in the evenings, we went on a Sunday evening and almost all the tables were taken. If you are planning to go for food, better book a table in advance.I was pleased with lively music and colorful decor, portraits of Che, rifles and revolutionary flags hanging on the walls. The service was good too. Easy reach from Waterloo station, within 5 min walking.There is a nice lounge terrace area outside, which would be good to sit at during the warmer evenings in the summer.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rZjbBnCtS4oDe2I8fZUieQ",
        "caption": "Photo of Cubana - London, United Kingdom. I was pleased with lively music and colorful decor, portraits of Che, rifles and revolutionary flags hanging on the walls.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rZjbBnCtS4oDe2I8fZUieQ/o.jpg"
      },
      {
        "img_id": "rYnAMkXf66jKBvZQvH43lQ",
        "caption": "Photo of Cubana - London, United Kingdom. The colorful fasade makes it hard to miss",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rYnAMkXf66jKBvZQvH43lQ/o.jpg"
      }
    ],
    "user_id": "yNz6YWwxNUI_ekxZvk3Hdg"
  },
  "6gkJ4aAuh0K_vUo8jlcgqw": {
    "date": "10/31/2016",
    "text": "A bit crazy and touristy but fun with decent good. Go there fore the drinks, the crowd and the fun vibe. It gets REALLY crowded. Eating there can be challenging. We've been there three times and only able to get a table once! That time we got chased out to make room for the next reservation. If you love Cuban food and drink like I do it's definitely worth the trip. Just wave a back up plan for dinner.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1XKE1pw1S8jE3tj_kONMFQ"
  },
  "MdnSvVseq8R-F4c1p7qfPA": {
    "date": "4/24/2016",
    "text": "Great little authentic Cuban place in the middle of one of London's busiest areas. A gem for the authentic Mojitos and street style food. The live music adds to the ambiance and creates a uniqueness seldom found.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9QAdvf21fe7OHvCrxwRWIQ",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9QAdvf21fe7OHvCrxwRWIQ/o.jpg"
      }
    ],
    "user_id": "iC8pOztO1J3OIOyZMC9CRg"
  },
  "XMl7nkJe3FoxZgTf0df5hQ": {
    "date": "9/19/2016",
    "text": "Service was very slow, 25 minutes to get drinks and another 30 for our food. It was 4:30 in the afternoon an the place was dead. The food was very good and the happy hour was good deal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qjslDxel6VSVIEcWugCACQ",
        "caption": "Photo of Cubana - London, United Kingdom. I have a pork dish and my wife had chicken.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qjslDxel6VSVIEcWugCACQ/o.jpg"
      }
    ],
    "user_id": "AeL53qJX7TdBm_ttGlE83w"
  },
  "BlHfRAx5c12bPG4W0OFJtg": {
    "date": "10/29/2015",
    "text": "From the first view of the outside of the restaurant you know that it's a party sort of place. Known for its dance party in the evenings, it's also a place to go for the happy hour buzz. Select cocktails are around £6 a glass or £17 a jug which is a good deal. They weren't top notch but they tasted lovely.We began with a starter platter. The sweet potato and chorizo croquettes were definitely the best of the trio. I had the slow roasted pork as my main. This was very good. The plantains were particularly done well.We didn't stay for the dancing but the vibe seems really fabulous.  I'll have to try it in the future.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5dgWqgYcJPeFmRPZ5bxiQQ"
  },
  "lrMoAHJkYN4Nb4JmX8LQEA": {
    "date": "2/15/2014",
    "text": "We were looking forward to a fun night of dinner and live Latin American music. We got it, but it wasn't quite what we were hoping for. We made the latest possible dinner reservation, 9:30, hoping we would be well positioned to have a table to chill at once the live music started up. Unfortunately, we were only hurried through our meal faster, as they stack up all the tables and chairs to transition to club mode. That's right, once it is club time, don't expect to sit down for the rest of the night. There are not even any barstools, which is ridiculous when you consider people are dancing and might want to sit and rest a quick minute. Anyway, the food. I had the ropa vieja, which was a little bland. My wife had the slow-roasted pork and loved it. We ordered within minutes of sitting and had our food possibly less than 5, but not more than 10 minutes later. Service so fast it feels like the food has been sitting around all day waiting to be ordered. Uncomfortably fast. I didn't feel as though my meal was cooked for me in response to my order. The server was friendly, but the speed of the service prohibited enjoyment of the restaurant. And that's coming from an American, where you know we love our food fast! Perhaps my wife and I have grown to appreciate the European-style restaurant experience during our two years living in England, but I think it was a bit impersonal even by American standards. Then there was the \"live music.\" It was live in that there were people being paid to be there, but it was more like glorified karaoke. A woman in control of an iPad would select a song, and then her counterparts with bongos would beat along with the background music and sing. I was hoping for a Latin salsa band, but instead we got a chick with an iPad. Still, the experience was a fun night out, so I can't knock it too much, I'm just not sure we will go back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jHlM64I_gTdaQ5Ap0jxdqQ"
  },
  "tW70kv5U156_pRBZsV2r2Q": {
    "date": "7/24/2017",
    "text": "Meh.  Unfortunately, we were seated for dinner right next to the bar during happy hour.  It was teeming with people standing in line to get their 2-for-1 tropical drinks.  The bar was ridiculously loud - not just from all of the people waiting and talking (which we would expect during that time) but from bartenders throwing empty bottles into trash cans causing everyone at our table to jump from being startled by the loud noise.  To add insult to injury, we sat watching the activity at the bar without a drink for 20 minutes because our drinks were taken to the wrong table. The food and mojitos were fine but not fantastic.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQstuiPJOMlOVAPPGguTCQ"
  },
  "lU7vMerOmgZDppxic30DZg": {
    "date": "8/22/2015",
    "text": "Delicious food in an authentic, relaxed atmosphere. The chorizo tapas platter was amazing. Good prices, especially during happy hour!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MO1P_18YfMqK1OOkm4zx9Q"
  },
  "4rN_wJsNnq8H-QqPT8zCPw": {
    "date": "9/16/2013",
    "text": "It's Monday and I survived. Celebratory cocktail time is completely in order! Meeting a friend by Waterloo she had never been here so what a great opportunity so close to the station.We only had cocktails here, but if you came at 6ish when we did you could definitely score a table for food. And the menu looked pretty good at a glance. Fusion of the Latina vibe with some Cuban influence (apparently). I reserve the right to review this when I actually do eat here.We knew we were onto a good thing when we turned up to happy hour (5pm - 7pm) and with free tables for bar drinkers only. We grabbed a cheeky table down some steps amidst the vibrant coloured walls and stocked up on cocktails before the deal ran out. Mojitos, not good. Strawberry daiquiri, much better. The problem is how can you really complain at 2 for £6??However after the deals were over we treated ourselves to full price caipirinha (£6.50) and this was WELL worth the money! Now this is my favourite cocktail so if I approve it is worth approving ;) great texture in the muddled sugar and good flavour balance. Tempted to try food next time, make a light of it",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zfHDV6nOKq4VvxOJT4T4bA",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zfHDV6nOKq4VvxOJT4T4bA/o.jpg"
      }
    ],
    "user_id": "xpNl1ieZjanC54qQT9Y9Tg"
  },
  "dBwm-XuTF-hYgpAyQeTY1A": {
    "date": "7/19/2015",
    "text": "Quick review.Food - OK, its reasonably priced and its a little yummy. Its not badCocktails - there pina coladas are not great - its frustrating cos I really like a certain type - but these guys went for the icey version. I like the creamy real coconut milk version. Happy hour is a good choice. They have outside seating and the staff have got a specific licence, so really hate you walking outside there designated zones - however they should consider what that means as they service too many people and there is nowhere else to go.It high concept, good happy hour, nice food - i'd call it a bar with food -",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uNJe4VWqVt7A7f6NOS6HGw"
  },
  "f1hb95D-6Rp3T9EI59sfAQ": {
    "date": "11/18/2015",
    "text": "Good food,  reasonably priced and an unexpected happy hour, overall an enjoyable and delicious weeknight dinner.  We made a reservation and we're promptly shown to our table.  There is a daily happy hour on from 4-7 pm with two for one drinks.  The menu is not overly extensive but well thought out.  There is a beef,  chicken,  pork,  shrimp and veg option.  I got the chicken and my friend the beef,  both were really tasty.  The desert list is also pretty slim.  I tired the creme natilla,  a bit unexpected but interesting.  Service was okay.  We were given menus promptly and had to wave the waitress down to order but she was friendly and quick.  £50 for two,  with drinks,  main and dessert.  I think I'll be back.  I wish I worked  closer...  Apparently they do lunch boxes which are a steal!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBpxuJ61IvaAABOR-rE71A"
  },
  "hpFXIgkpdDO5GPk20r4LRg": {
    "date": "3/17/2013",
    "text": "I went here for a friend's birthday party. It had a great atmosphere, fantastic music (and a later a live band whose bongo player caught me playing the air bongos :#)  ha!) Really nice mojitos (as everyone has mentioned) and for being in central London, prices were really reasonable. £5.50 for a mojito (£16 for the pitcher) and under £4 for a pint. Bargain. They are big into fresh fruit (not frozen stuff) and I respect that!Omni Monkey and I both had the (vegan) Cubana Vegetarian Plate and that included: \"Cuban black beans, Falafel Cubana, plantain/chilli rice and sweet potato + plantain crisps\" and at £7?! YES PLEASE.Holy crap, the falafels were out of this world!  \"(P)repared with garbanzo beans, sweet potato, plantain, cilantro and spices\" I couldn't get enough! Dense and delicious! Especially covered in the black beans.... drooolllllI saw there are lunch specials and happy hour drinks, and we enjoyed it so much we have already made a date to come back to try all those specials when it is not a bustling Saturday night.BONUS POINTS!!!! If you go to the website, there is a section on what is vegetarian and vegan on the menu. AND they have a whole allergy section as well for seeds, gluten, eggs, milk, etc and which dishes they are in. Great place to come if you have a group of mixed diets! Or if you just want to pig out on affordable Cuban food!",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "6e-pQMQamHgqC5Q8EmJfNA",
        "caption": "Photo of Cubana - London, United Kingdom. Vegan Cubana Vegetarian Plate. Cuban black beans, Falafel Cubana, plantain/chilli rice and sweet potato and plantain crisps",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6e-pQMQamHgqC5Q8EmJfNA/o.jpg"
      }
    ],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "9zxaxjtwQtDe0RUvvXwG9A": {
    "date": "6/23/2013",
    "text": "Cubana is maybe not the most polished of restaurants, but what it lacks in refinement it certainly makes up for in character. PROSThe food is authentic & deliciously packed with flavour. It's also a bonus that it's also relatively healthy for those of us who are trying to keep control of our waistline. Less healthy but no less enjoyable are the cocktails - and you'll struggle to find a fun, lively but relaxed place to sip the night away in central London. They also do some really fresh smoothies & non-alcoholic cocktails. It's located just a 5 minute walk away from Waterloo station (15 mins if you've had a few too many cocktails) & is well priced with the typical bill for drinks, starters & mains landing in the £60-70 range per couple. CONSIt can be busy, particularly during the week during & just after their happy hour (5pm-7pm)Side dishes are usually served with your starters (?) so make sure you clearly say which meal you want your sides with.For a place that claims to be the \"home of the mojito\" they are inconsistent & occasionally lacking in sufficient rum. The customer is not always right, hence the 2-stars. Twice now we have ordered & been billed for one thing but received something else. On the latest occasion the waitress insisted that our plate of fried plantain was in fact rice, chilli with plantain (despite there not being any rice or chilli anywhere in sight). Presuming your customers are stupid is never the right choice & is a great shame as it really detracts from what is otherwise a fantastic place in the city.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vGR0SzncpYyyur1H3urFvg",
        "caption": "Photo of Cubana - London, United Kingdom. The bar inside Cubana - how can you not love a place that has actual AK-47's for wall decorations?",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vGR0SzncpYyyur1H3urFvg/o.jpg"
      }
    ],
    "user_id": "i5QP9LTVSe3s3vgMZ36mLA"
  },
  "LxJUEuMdFpfRQSCicEYccA": {
    "date": "11/17/2015",
    "text": "I had a great time at Cubana.  I went with a few friends on a Wednesday night and it was bustling!  The prices are really great and I believe there was a happy hour that we totally abused (the margaritas were delicious and really hit the spot).  We ordered some smaller plates to share and the one with chicken skewers, sweet potato and chorizo croquetas with plantains is beyond worth it!  The mains came out and the pork is really tasty.  We were too full for dessert, but all in all, had a good experience.  The wait staff were nice but forgot one of my orders and I had to wait for it after my friends had already finished their meals.  Make sure you get a reservation because it's a bit chaotic in there - I couldn't imagine getting a walk-in table right away.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gfmf4kQjVT4Ds2eNZCuHMQ"
  },
  "cfWh8YFnTznfh5RuZlFPOA": {
    "date": "1/15/2014",
    "text": "Cubana is a mixture of a bar and restaurant I think it succeeds on both ends. The cocktail menu is quite extensive and all of them are a good deal through the happy hour. I do get happy when I drink cocktails, I don't know why :)I loved the Ensalada Fresca - that's a vegetarian salad and comes as a starter but don't fill up on it as it is quite big and you wouldn't get to try the goodness that comes later. They also have all sorts of deals through lunchtime. That being said and topped with the high quality of the food itself adds up for a brilliant choice for a lunch spot. If you're in the area you should definitely try it, despite the lack of imagination regarding the design of Cubana - it seems quite unwelcoming to me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R24Tu1z6ck1M3LdE7eVbKg"
  },
  "hUV8ETikpCJCZM9dLSsenw": {
    "date": "8/16/2014",
    "text": "Cubana's location close to the Old Vic theatre and happy hour from 5 to 7 everyday makes it a perfect location to grab some drinks right before a show.The drinks are strong! The pitchers are a bargain during happy hour. I've had a couple of different margaritas here, and they're on the sour side without being too sugary, just how I like it.I've never tried the food here though, mostly because their kitchen seems to be open during odd hours. We came once at around 7PM on a Sunday and were told that we couldn't order any hot food because the kitchen was closed. Then two minutes later we saw a waitress bringing a nachos plate out... odd.I'll probably come back because of the convenient location, but I wouldn't go out of my way to eat or drink here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMXfcEK9S4BVLYEGhyEsbQ"
  },
  "FIdBJjUBUbmy-yBzpmV1xQ": {
    "date": "11/11/2015",
    "text": "Showed up tonight only to be greeted by a hostess who  couldn't care less. First words out of her mouth were \"WE ARE COMPLETELY BOOKED!!\". Then, 30 seconds later, miraculously, we were seated.Things started to look up when we each decided on one of the 6 choices of entree for dinner. Sadly, our decision was left solely to us as we were not served for another 18-20 minutes. We smiled patiently for the first 10, and then stared vehemently at any server passing by for the balance. We now know what the invisible man & woman must feel like. We eventually left out of sheer frustration, realizing the futility of patience. Not a word from the unapologetic hostess. She'll never have to worry about an occupied table on our account again!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgxP45YEGxdQAS0OO0Q8YQ"
  },
  "sOMUdGb5fu0Uz_mMBalLTA": {
    "date": "5/8/2015",
    "text": "A very happy happy hour! They have great drink specials from 4-7, £6 for 2 mojitos, I believe. The food was tasty as well, but so slow. They told us it would be a 30-40 minute wait for food, but our food didn't come for an hour and a half! If they didn't have a great happy hour, I would have been angry! I'll definitely be returning, but not on an empty stomach!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "y12ClNRRRJqiZ3-xwqvVYg": {
    "date": "9/15/2015",
    "text": "Very good Cuban food. The Bistec (medium) is awesome. The chimichurri sauce is really good. Very popular with the young. Beware of long lines and a stretched staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqXMM6X9Gf40lhmz4DTo1A"
  },
  "lAVtbOAG5EGE1qqidWNdiw": {
    "date": "9/8/2018",
    "text": "Very good Cuban food, the tastes are there and the place is vibrant. The portions are not very big.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XSnKhFDf2N7UZtqh_pe6Q"
  },
  "Xl9-az6Ie5n0IHsYgszhVA": {
    "date": "12/10/2017",
    "text": "I was proper pleased with Cubana. We ventured out for a work lunch and it was nice to see multiple veggie options on the lunch menu. I even had trouble deciding! Crikey!!! Is that even how you spell it?I chose the Quimbombo because it was fun to say but also an okra casserole sounded interesting. The flavours were very nice and I was happy with how nomtastic it tasted with the rice and plantains. They also have this crazy bright orange chili sauce which is delicious. £7 for an entree and £10 for an entree and starter. I had the sweet potato falafel as a starter which was also yummy. Not bad Cubana I'll come back to try your massive pitchers that everyone drinks after work.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "ux7e01Q9Gjt2KsUUuVtYog",
        "caption": "Photo of Cubana - London, United Kingdom. Falafel Cubana",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ux7e01Q9Gjt2KsUUuVtYog/o.jpg"
      },
      {
        "img_id": "vJe7IVKOrIq3kVILFPXrSQ",
        "caption": "Photo of Cubana - London, United Kingdom. Cuban pork with plantain and chili rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vJe7IVKOrIq3kVILFPXrSQ/o.jpg"
      },
      {
        "img_id": "ZdrKyFLBhphdNy-ck2M9YA",
        "caption": "Photo of Cubana - London, United Kingdom. Quimbombo- Cuban okra with plantain and chili rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZdrKyFLBhphdNy-ck2M9YA/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "78ovcAgXw1ILuzXqZIvE_Q": {
    "date": "4/2/2018",
    "text": "To all of the people giving this place a good review - are you okay?! I've actually never had cuban food this bad. Like ever. I was so hopeful and ready for some delicious cuban eats but I was greeted with less than mediocre food and a strange ambiance. The yuka fries were dry, the falafel shouldn't even be on the menu and don't even get me STARTED about the salsa and plantain chips. I've had better food served to me out of the back of a sketchy van parked next to the beach which ended up giving me food poisoning. At least it tasted good! The staff was incompetent and slow (We waited so long for our food). The only reasons I gave this place 2 stars instead of 1 is: a. I had a nice time due to the copious amounts of tequila b. I didn't end up with food poisoning (but it was a close call). It's safe to say I won't be back and to be honest, I am very disappointed with the online community for leading me to this place. This is NOT good cuban food and I could honestly make better food myself. To the people who thought this place had good food- please contact me and I will show you what actual good food tastes like. Do yourself a favour and don't waste your time and money.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "my1VebRHMyv9hAu2ytHUwQ"
  },
  "aSGp1XiwMj68XCxOMNqVXg": {
    "date": "4/10/2017",
    "text": "Ugh, everything here was so good that I struggled not to go back, as I wanted to try as many different restaurants in London as possible. I just love Cuban food, in general (see my previous reviews) so it wasn't too hard to find this place simply delicious! I had the slow roasted pork plate with rice, black beans, and fried plantains. I'm salivating right now just reminiscing on it. Also had the piña colada, which was perfect! Not too sweet and decently strong! The only reason I knocked a star off is due to the long periods of waiting to have our order taken, receive our drinks/food, and receive our bill. They clearly were very understaffed with servers, so that dampened the experience a bit. Otherwise, you can't beat the atmosphere, good vibes, and music there!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "acysJxCTEy22v0jhuKlFhw",
        "caption": "Photo of Cubana - London, United Kingdom. Slow roasted pork plate and pina colada. All very tasty!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/acysJxCTEy22v0jhuKlFhw/o.jpg"
      }
    ],
    "user_id": "LPAjAsK70yupTD37VwSlrg"
  },
  "iryJB5-Hux1K-wHyEW09ww": {
    "date": "4/19/2018",
    "text": "Food was absolutely delicious! Very trendy and hip restaurant, prices a bit high for the amount of food you get, on the upside happy hour specials on drinks were great. Also- if you're looking to have a sit down dinner after 5, make sure to make a reservation",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A7cCnGieBj_OnLJ0VjuZJA",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A7cCnGieBj_OnLJ0VjuZJA/o.jpg"
      },
      {
        "img_id": "naUA6_PYdVbcNHaV_iTEvg",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/naUA6_PYdVbcNHaV_iTEvg/o.jpg"
      },
      {
        "img_id": "cAkb73zJc6F2jKFfhkUBiQ",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cAkb73zJc6F2jKFfhkUBiQ/o.jpg"
      }
    ],
    "user_id": "X_GFw1vUl1_trnJM3NwmqA"
  },
  "AtXw5RUa-QhoIR5ID9J1Ng": {
    "date": "3/11/2018",
    "text": "Not kid friendly - Wish I could write a review on the food but we were basically turned away at the door in the rain on Mother's day ; Sunday dinner at 6 pm with 2 adults and a well behaved 4 year old - host claimed he had no tables and an hour wait... at least a dozen seats were visibly open  - we kindly pointed out the discrepancy and he shrugged ;(",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMlX0xIG4pgp2xIQlY9PlQ"
  },
  "XCkgKuqjBIdj86usoUc2eQ": {
    "date": "6/25/2016",
    "text": "When the restaurant you mean to go to is flooded Yelp can be such a life saver. This place was incredible. First off for the easy access to Waterloo it is very well priced. I didn't get the name of every wonderful staff member I interacted with, but from the bar tender who served us our happy hour jugs to our main waiter Juando who made sure we were well taken care of (and didn't laugh at our broken Spanish). The food is really delicious and well done. The drinks were incredible, they aren't so expensive and are very well made (and strong).This is a great happy hour joint, so grab the two for one jugs and laugh at the drunk 18 year olds. Grabbing food after is a great treat. Look forward to coming back to this gem.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TrsT1qLEKa1R-WmdgvAJpw",
        "caption": "Photo of Cubana - London, United Kingdom. Desert chocolate with orange",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TrsT1qLEKa1R-WmdgvAJpw/o.jpg"
      },
      {
        "img_id": "0rEfSpkxX4Pjg4cZKGm22A",
        "caption": "Photo of Cubana - London, United Kingdom. One of the veggie options!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0rEfSpkxX4Pjg4cZKGm22A/o.jpg"
      }
    ],
    "user_id": "LWtuGXaFOyAHuhrj1yH25Q"
  },
  "zuaynHqoXM0zw6gR6BS9Rw": {
    "date": "2/16/2018",
    "text": "Went for happy hour mojitos (which were great!) and stayed for dinner. The food is really good, and vegetarian options are available which were also delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSl8HNt_q5AfG0o8kMxa5w"
  },
  "0tyATkRRe8kH6ygHbgDvrA": {
    "date": "4/27/2015",
    "text": "In the area for Alice's Adventures Underground at Waterloo Vaults, we were looking for a quick drink to pass some time. It being a sunny Friday in the early evening, Cubana was absolutely heaving outside! Needless to say, we couldn't get a seat on the 'terrace' area, so headed inside to the bar and to scope out a seat. Unfortunately the majority of seating was reserved for eating, but someone directed us to a small drinking area behind the bar. This was not unlike sitting in someone's living room, with a few leather couches and posters dotted around the walls. We both had a margarita, quickly shaken up by the bartender, and at £6.50 for two (hello, happy hour!) this isn't to be sniffed at - especially when considering usual London prices! The drinks were tasty, with a real sour kick, balanced out with the salt rim.We had to leave due to heading to the theatre and, although considering popping back in on the way to the tube, it was even busier. Good to know about if you're in the area, but wouldn't make it a sole destination.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FMHJSVZ3sVL6YH1XL2F4ZQ",
        "caption": "Photo of Cubana - London, United Kingdom. margarita (2015)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FMHJSVZ3sVL6YH1XL2F4ZQ/o.jpg"
      }
    ],
    "user_id": "4yhsn0kSKP4-Kp0aFKmKzQ"
  },
  "ib4nL7hpN922G1-UI-aKEw": {
    "date": "11/18/2017",
    "text": "High energy watering hole with delicious Cuban pork which is arguably the true test for any Cuban restaurant. This place passed with flying colors. Live salsa music on the weekends is an added bonus.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rq4F4pFYCtWu03jN4mAV-Q"
  },
  "iN47iZTODrjvjtsyQYMK2A": {
    "date": "7/30/2017",
    "text": "First time and London and this place was close to my hotel. Good was great. Had the Ropa Vieja and it had great flavor along with the platano maduro. Very satisfied with the food, not so much with the drinks. Had two jugs of Mojitos and both taste it ok. Weak, in my opinion but my friends agreed. Great atmosphere though and music was good as well. Nice vibe. Would've stayed had the drinks been better. Satisfied overall and would go back for the food. Til next time London!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBMxG8q3G8_QUvkrZ9eORg"
  },
  "E-TOhDuaWXse7EIzwnu1Eg": {
    "date": "2/28/2018",
    "text": "I was shocked to find this gem while visiting. The food was great and authentic... the coffee was actually the best I had in London. They also have dancing on Friday and Saturday night. the scene wasn't what I expected, and not for me,  but I would definitely go back for the food and coffee...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "voD72wOPkRzjCf-vSnZkNA"
  },
  "4SIFGalXhIXz4nYoIk23ZQ": {
    "date": "8/5/2017",
    "text": "The Cubana was fun, and it was a break from center London shopping.  I will say the food was amazing.  The slow roast pork was fantastic and better then I expected.  The drinks a great the ginger mojito was on point.  This place was worth the exploration and staff was great.  I have made new friends in Waterloo/ London, plus I found latin food made by Latin Chefs.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uJXILK4saD6udlaCdWfd4Q"
  },
  "PyHJ_93alvLu9F2NoWSsIw": {
    "date": "5/4/2017",
    "text": "when I tell you this place was delicious and you have to try are you just must believe me this was one of the best meals I had while I was in London I'm so happy we stopped in here the drinks were great we got a pitcher of mojito and it was really cold because it was in January so they brought heaters over to us to keep us warm they had cheap shots and everyone enjoyed their food it was amazing",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "phk2WLd0nG-aLpLTVGzJEA",
        "caption": "Photo of Cubana - London, United Kingdom. Ropa!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/phk2WLd0nG-aLpLTVGzJEA/o.jpg"
      }
    ],
    "user_id": "0sqZ5Wp0k2BTXoV_50iviw"
  },
  "Q6m40bYINhVDNLRS-A6m8w": {
    "date": "4/1/2017",
    "text": "The food is a 10. Drinks were pretty good, but great happy hour prices. And the environment was great. Would highly recommend this place",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0uiA3gSAAvuFKpSyeSbyBg"
  },
  "sh0w72EGleJmiSaJewNrLQ": {
    "date": "4/11/2017",
    "text": "I loved this place first restaurant we went to in London definitely took advantage of the happy hour love the 2 pitchers for one set price! Had the pollo criollo, sweet yet delicious I enjoyed my meal very much :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gaqXR14Uk2wIIHlyZ_fHFA"
  },
  "ke8alUKj6PdoBdnWls6t8g": {
    "date": "5/16/2016",
    "text": "Takes forever to order drinks at this bar. Looks very dirty too. Didnt like the fact that the pint glasses were \"cleaned\" with a sponge from the sink. Disgusting.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "BJSZkEwRbIdfH3A8fRA-og": {
    "date": "4/4/2016",
    "text": "I really liked my experience at the Cubana. It's a very colorful place, and you got to love the rifles on the wall (well, this is Cuba isn't it). From the outside, you can spot Cubana from afar considering the thought they put in their decoration. It's lovely, it's colorful, and it makes you want to come inside. I've been wanting to try it out for a while considering I live nearby and walk up to Waterloo station all the time but it's often very busy. Not surprising that it's so busy when you see their happy hour offer on the cocktails (2 for one) and their dishes. I guess it's classic Cuban food, not that I know anything about it, and it was good.Service was helpful and fast.And they had live music !",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yNPeGWEWwpantYdEOQOLrQ",
        "caption": "Photo of Cubana - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yNPeGWEWwpantYdEOQOLrQ/o.jpg"
      },
      {
        "img_id": "tmxtrTtV0zgUJ6Lek9gLMQ",
        "caption": "Photo of Cubana - London, United Kingdom. A fresh strawberry colada and a regular pina colada.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tmxtrTtV0zgUJ6Lek9gLMQ/o.jpg"
      },
      {
        "img_id": "bGoONBYSxQXtkG4pat-rXA",
        "caption": "Photo of Cubana - London, United Kingdom. The bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bGoONBYSxQXtkG4pat-rXA/o.jpg"
      }
    ],
    "user_id": "TcIXXqDfcrFu2m-cEV2OTQ"
  },
  "ghcpiX2UMOwRUyRUHSbKmQ": {
    "date": "5/11/2016",
    "text": "We met friends at South Bank Centre for some hot cocoa with marshmallows (us girls) and beer (the boozy boys!). We hadn't zeroed in on a restaurant and our friend P suggested going to Cubana. So we walked there and reached after I took a million photos of the wall graffiti en route. In the dead of winter, Cubana brought in so much warmth!! We struggled to get a table. But the boys worked their charm and got us seated.Between the four of us, I think we tried everything on the cocktail list! I loved my caiprinhas. Food is good...but frankly, I wouldn't give it much importance. The music and ambiance were my priority.They open the dance floor after 10. Beautiful music and mood. The atmosphere takes over everything....all else will seem fantastic automatically. Would love to go here again and again and again...anytime I am in the vicinity...actually, only if it's evening.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LScF4h8D88MAxT3nMsSVEQ"
  },
  "1uVzYakKBbAl6lEtkBdvgw": {
    "date": "3/5/2015",
    "text": "Happy Hour! Wonderful drinks! Great nibbles!Walked by a zillion times, sometimes it looks busy, sometimes not. But lately more busy than not, a good sign!So we popped in and had a great time, a nice crowd, helpful friendly service and it was just perfect, a great time.Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5TY_Nb_e5criDA0yfhW6TQ"
  }
}