{
  "u-w9mXV1YDeI3-OKNcd5_g": {
    "date": "10/20/2009",
    "text": "Yummmmmmy!!  Bad location but if you're in need of a serious kebab and you're near by with a little extra money than you planned on spending, this is the place.  For a healthier option, I had the Chicken Beyti which is minced chicken breast seasoned with garlic and herbs cooked over their hot coals on the spot.  It's served with white rice and a mixed salad along with a side of yogurt sauce and spicy salsa-like dressing.  The menu is quite extensive for such a simple concept, and the restaurant is clean and comfortable.  The prices are a tad high, but the quality standard of this place is high above the local kebab stand.  Boris Johnson has even swung by for a bite.   Oooh, and they deliver!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c7czxxeGJorF3w0nvCh7Og"
  },
  "UWL48jxGl8rHff3EfxQhBw": {
    "date": "12/9/2014",
    "text": "I love this place. I've been on a bit of a budget recently - and it's seriously the best deal in London. Good food with decent service, and BYOB which is amazing. The meat is really good and seriously, you cannot beat the price!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slJQPQC0NAuduqnNHF96mw"
  },
  "gB4V2zoYAzVQ4eD6GwWQCg": {
    "date": "9/12/2010",
    "text": "I have been trying to cut down on meat, but Fez Mangal is making it impossible for me to do this.They serve DELICIOUS, fresh, tasty and reasonably priced Turkish food and make it really hard for wanna-be vegetarians like me!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUiAbOh5AbbRAlBHlCTAYw"
  },
  "zA30dNuopQSWQlIgxmaWzg": {
    "date": "3/28/2009",
    "text": "What a find!! Delicious Turkish BBQ at great prices. This place is great if you want to eat out without spending much. They don't serve alcohol but you can bring your own (thus cutting costs further!) We got the mezze sample plate to start, which was a little of everything, all very good. I particularly loved the dill yogurt dip. And they were very generous with bread. Then we ordered a bunch of kabobs (not doner, I'm a little skittish about doner) and I can't remember the names of anything but the standouts for me were the chicken and the spicy lamb mince. I LOVE lamb mince. I will definitely be back to try the rest of the menu.Update: My dad, after six weeks in England and France, believes his meals here were the best of the whole trip.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ctj5yX_odQEMprc4FN_gwQ"
  },
  "N6216veSpaW0mlJ5hdn4sg": {
    "date": "1/11/2013",
    "text": "Great quality food! Worth the price you pay.. its much cheaper to take-away. I highly recommend everything.. seriously!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OVp5xgUYj1vogx2Ln6ueZw": {
    "date": "10/11/2013",
    "text": "The food here is great, you can even eat in and bring your own wine or beer. It's reasonably priced, I'd say it's like the Ferrari of the kebab world. I recommend the mixed shish.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BbrWYg9r2AqTy3y66_zikg"
  },
  "mqlfTF1C1qx1ZNQg1BQIZA": {
    "date": "9/30/2010",
    "text": "A hidden gem on Ladbrooke Grove! I have now been here several times and it's absolutely flawless. Turkish BBQ at it's very best - If you fancy a posh kebab cooked in front of you at a reasonable price then check this place out. It gets very busy so might be worth calling in advance for a table. One point to make is that they really lay on the salt when cooking the kebabs so make sure you ask for no salt....It's really does make a difference. One other great thing is that you can bring you own booze as they have no yet got an alcohol license - a cheap night all round!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lPO4BDpQliGaVTvgIZOfnA"
  },
  "uauS7ZZlWTZ0wGPBHSDshg": {
    "date": "4/18/2013",
    "text": "Hmm delicious, i love this place i eat here weekly and im not sure if its healthy but i dont care, its just soo good!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yhv21xXu7Z3jcpjDy04x6w": {
    "date": "7/15/2016",
    "text": "Excellent and inexpensive food.  Service is quick and friendly. Nice space for eating in or you can do take away if you wish. Best Turkish restaurant in west London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brZ3AyQIL2yndBs3m3gpaw"
  },
  "q0evMWAb-1QZhU56RebV-A": {
    "date": "2/24/2017",
    "text": "This is definitely one of my favorite restaurants in London. Even if you don't love Turkish food there is something on the menu for everyone. The staff is really friendly and helpful. This is a great spot for lunch or dinner. If you are going for dinner, I recommend that you make a reservation. It is also BYOB!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z9dW-Kxtwv7ZlohwTlF6RQ"
  },
  "PSPoso6v7ktwWUwh_OBt2A": {
    "date": "3/13/2014",
    "text": "The meat is better than most, amazingly tender and the salad that comes with a kebab portion is quite nice - julienned beets, carrots, and some arugula rather than the typical iceberg-tomato-cucumber that comes default elsewhere. The lamb shish was golden and flavorful, ungreasy, non-chewy. Drizzled with the yogurt and spicy sauces at the table, I was scooping every last bit off the plate by the end.Only complaint is the curse of all good places. It's obviously popular for the above-par quality of food, which means the service is spotty during the manic dinner hour. Waitresses are squeezing around the tiny space with baskets of warm bread, dips, and heaping piles of meat coming off the grill like a factory. If you're not in a rush, the randomness of the service won't bother you: it's BYOB, so it's really not hard to be patient: you'll want a little downtime to get through that bottle (or two) of cheap wine from the convenience store up the street!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TNNRmOheG5PFV7qXop151A"
  },
  "FbDl_xfRBUHRo1UJT80JPw": {
    "date": "9/15/2014",
    "text": "Yum Falafel and baklava.  The place is super clean with lots of variety of dishes.  Eat in or take-away.The flavour is really great, however, I must say that the wrap seems to be very very powdery! It honestly gets every where!  I don't know what it is but it's like micro sand powder texture on the wrap and it's quite annoying to keep brushing it away!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OepicbUeYRwxGWM_rp1JRw"
  },
  "ptjx856QQ90x2rNQimrDWQ": {
    "date": "8/24/2016",
    "text": "The food here is absolutely delicious!!! Generous portions, fair price, and the best kabobs ever. This restaurant is tiny and the tables are small and close to each other, so don't be surprised if you end up sharing with strangers. If you are in London as a local or a visitor as I was, you MUST visit this place. You won't regret it and will look forward to your next visit. The food is so good, any discomfort created by the location's small size will be quickly forgotten after the first taste. Can't recommend this place enough! 10 STARS!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3tZ3C80Fl06ckeJ8TcrMpg"
  },
  "xFweJKkMg1_hamfcLANZSg": {
    "date": "9/6/2015",
    "text": "Omg I love this place. Everything they do tastes amazing. I've never eaten in but I've tried quite a few things and they were all fresh and you can tell they use good quality ingredients. I'm a regular",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1fyP0TVnPPn-RlKlDDwKuw"
  },
  "tXnLF2nY6KtGsIZBasFv9w": {
    "date": "6/25/2015",
    "text": "There are few times you enter a restaurant and just go 'WOW'! This was DEFINITELY one of those times. We were touring from California and didn't know the area very well and from the review on yelp, the restaurant looked like a shady hole in the wall. Upon arrival, however, we came to find a gigantic crowd around the small entrance. We pushed through and they got to us right away, seating us within twenty minutes because of all of the people. The wall decor had chillies hanging in the window and you could see and smell that magical grill where the most aromatic lamb was sizzling. Though it took a while for the order to come in, the eggplant salad was cooked perfectly and seasoned even better, and it melted in your mouth. Everything was soooo fresh and wonderful. Honestly, it almost made me be a vegetarian how incredible the Greek and Aubergine salads tasted. That is, until the meat came. OMG the combo kebab made me want to have a bottomless stomach so I could keep eating forever!! The meat was so juicy and tender and bursting with flavor. Every bite was a bite of heaven! This place is one of the best restaurants I have ever been to, and I HIGHLY recommend it to both tourists and locals, vegetarians and meat-lovers, and anyone else who appreciates good food!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WBK-yYqUE47tFhAQDRPc5A"
  },
  "iEXM8Is7hEX9w2Ce7f92qA": {
    "date": "6/19/2015",
    "text": "Amazing! Authentic Turkish cuisine. Prices are also incredible for London standards. Service was good and quick, we booked a table so didn't have to queue but after we left there were about 7 people queuing. I'd suggest booking a table if you go during the weekend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WM63jixEeCky7PjAIUDW6Q"
  },
  "Wl5uTo0HJ6-SN7qJUArAWg": {
    "date": "12/30/2012",
    "text": "This is an absolutely terrific Turkish kebab shop near the Ladbroke Grove tube. The other reviews do justice to the food-- I can only add that the chicken beyti is (imho) a little better than the lamb, and that a good deal is to get an extra skewer of grilled tomatos and peppers (only 1 pound if you're getting takeaway!).",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ppy9yffYGBpIgyQket8WHQ"
  },
  "1scS6lxkJoDB-HOJdvZvew": {
    "date": "7/4/2015",
    "text": "Quickly become a new favourite place in town. Good quality food. The flavours in every dish are amazing. (And I've tried a lot of the menu now!)The staff are very friendly for how busy they are and the value is really good bearing in mind the level of food you actually get,Also lots of healthy options so great for takeout after work when you don't want something greasy or heavy. Sometimes eat here 3 times a week!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JFL5NMlWgNTMsFonkko0tA"
  },
  "5KrOimRkIUJ8os_fqVlUwQ": {
    "date": "10/2/2013",
    "text": "This was the first restaurant we tried in London, and it may be the last. It's that good. We've been in town 2 days and have eaten there both days. I've gotten the meze appetizer both times. It is wonderful. It occupies 4 corners of a plate with each corner a different delicious delight: hummus, cous cous, tabouli, and spicy red vegetable relish. This was served with a beyond delicious made on the spot Turkish flatbread. I made little tacos with the items in the fatbread, all mixed. Wow! And I LOVE their fresh healthy turkish salad. The squares of cheese in there are feta like and much better than any feta I've had before.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mV5Ey139Bj2coaSPTKXBCA"
  },
  "7MvbhIdcOUN4RXqzSaQmEQ": {
    "date": "3/20/2012",
    "text": "I love this spot.  This is my local secret - this is where I go to meet neighborhood friends and dish about the day.  They are efficient, clean, and have a BYOB policy.  Could I be more happy?  I'm the sort of girl that loves to rock up with a nice bag of wine in my handbag.The food is perfect after a long day.  My favorite is the grilled Sea Bream, and the Lamb Kabab, both perfectly flavored and delicious.  The chicken wings are also delicious, and the other night I saw someone get the lamb chops and was practically salivating.  The appitizer 4 dipping sauce special is great, and honestly, this place has the best baklava I've ever had. Draw backs, its a little tight, and you have to sit relatively close to other customers, but it has never stopped me.  I'm in here at least once a week if not 2 nights. Don't miss this spot.  Gem.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYKhgI31akDx3-XwwYgpTg"
  },
  "hIQFcflvGdyansV2Q28usw": {
    "date": "5/18/2013",
    "text": "Brilliant every single time - probably the best tasting meat in the Notting Hill Area. LOVE IT!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2WJMaa_vPm6WiDE2IzsNSA"
  },
  "RJ3BZdE-f_-u6RD-l2hi2w": {
    "date": "6/28/2014",
    "text": "Possibly the worst dining experience ever. The food was ok but they brought our check after just 30 minutes, and then asked us to leave as they had a party of four to seat. How unbelievably rude and I suspect perhaps racist. Spoiled the meal and the evening. We will never return. Further, I will relate this to everyone I know.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lN4wwYeWiXiMHh9DE1Je7A"
  },
  "hhBY8rFkXDjsiptzV_zi6A": {
    "date": "7/27/2012",
    "text": "'Fez Mangal' is a fairly recent but VERY popular Turkish BBQ restaurant in Ladbroke Grove.I opted for a mixed doner which is only available in large for £5.50. A medium of either chicken or lamb will set you back only £4.The lamb was obviously good quality. Juicy, tender and not too fatty. It was a tad mild to my liking but some may prefer the subtler spicing. The chicken was also top notch. The wrap was paper thin and a little too stiff.The salad consisted of red cabbage, onions & diced cucumber. It was nice but loses marks for lack of variety.The garlic sauce was a good one.The chilli sauce was OK but despite asking for \"lots\" there was not enough of it.The service was fast, even though the place was very busy on this Wednesday evening in September.Most of the other take-away customers were opting for the skewered kebabs.This fine establishment lacks some of the greatness that make 'Best Mangal' my all time favourite ocakbasi and is also a little behind 'Ottoman' & 'Woody Grill' in my personal opinion.However, don't get me wrong, 'Fez Mangal' is the best thing to happen to Ladbroke Grove in a long time.The locals are understandably flocking to this place and unlike North End Road or Stoke Newington there is only ONE Turkish Grill in the area.HIGHLY RECOMMENDED!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7pJgfg5g5q3R4IHf_dqlw"
  },
  "xyYtV75GpnMNAtQTgAeVnA": {
    "date": "11/9/2010",
    "text": "Welcome to Turkey!......Or so one might think once they step into this authentic Turkish restaurant. After returning from Istanbul earlier this year, I desperately sought out a place to feed my need for authentic kebabs filled with all natural products, enticing meza platers, and yummy yogurt drinks. I was delighted to find that Fez Mangal satisfies all of these needs.Upon entering into this food haven, one might think that its 'hole in the wall' persona lessens its authenticity and quality. You would be sorely wrong my dear friends. For those of you who have visited Istanbul, you'll know that a manic atmosphere, more times than not, makes for a fantastic gastronomical experience. Fez Mangal follows through on all accounts. With limited seating and even fewer places to stand for takeaway, you'll be hard to find this place not packed to the rim (no matter what day of the week). While this can often spur unfriendly staff, the employees here are friendly none the less. The food, as mentioned earlier, is as authentic as one can get without standing in the middle of the Grand Baazaar. Fresh BBQ, made right in front of you, with fresh ingredients, makes for a definite healthy option to feed any late night kebab craving. I highly suggest the Lamb Shish as this is my personal favourite and sharing (if there are two of you) the meza plate for two as a starter. The portions are quite large (most of the time I leave unable to finish my meal), but are certainly worth it (the prices are exceptionally low for the amount of food offered in one meal).",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nO-AlmeSHteTNx3N8yKxWA"
  },
  "UBUJBANXeKoiAie5PxusSQ": {
    "date": "4/20/2013",
    "text": "My favorite Turkish restaurant in London. The menu is really, really simple. If believe there are just 10 items on the entire menu. And I love it. Very Turkish, very nice. Bring your own bottle of wine / beer (cork charge is GBP 1,50) and the food is prepared right in front of you at a charcoal grill. Good options for vegetarians too. This place is always packed, but somehow they always manage to find you a table within 5, max 10 minutes. Best part is simply the atmosphere, proper neighborhood hangout. Almost a pub. Except for that's a really nice Turkish restaurant. Also: prices are very, very decent.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RT1fYr7vGCrV2bDKrldnvQ"
  },
  "xaMZ0EvDGrCBhRMv7iqNKQ": {
    "date": "2/21/2015",
    "text": "My new favorite place in London. It is as cheap as you can get for food of this high quality. We had donor kebab and lamb beyti, and then baklava. All were absolutely amazing. BYOB is fantastic, and service was friendly and quick. We will definitely be back and bring our friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtnJibSrhah2bKhTaR9q5A"
  },
  "8sFa3i0zT7ONCIFExUBqxQ": {
    "date": "4/18/2013",
    "text": "Great value, delicious kebabs. Love the chicken shish yogurtlu, hummus and aubergine salad are AMAZING!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oF0reVhVz37puAtcbaIsLQ": {
    "date": "8/20/2010",
    "text": "Perfect smoky kebabs.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "WE9BtD0OqRvKMnyREkKm2w",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WE9BtD0OqRvKMnyREkKm2w/o.jpg"
      }
    ],
    "user_id": null
  },
  "Wy3Har3k-tV91_3vJVCY2w": {
    "date": "11/11/2018",
    "text": "This is one of the best Turkish restaurants I've been to! Amazing lamb dishes- you have to have the Beyti yogurtlu- it's the best lamb dish I had!!Great,inexpensive and so tasty!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IqQwO6PG7UIi06e_xlJ1A"
  },
  "6EgIgSAFSr71YQ89U_lp-Q": {
    "date": "6/30/2018",
    "text": "Wandered in for lunch with our daughter and granddaughter after the crowded Portobello Rd market. What a find! Immaculate (5 star rating) with gorgeous fresh food. Try the Turkish salad - outstanding. We loved the spicy chicken kebab and the combo lamb/chicken donor kebab. Delicious hummus to start. Very highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYHxzeeUpHnA0xxDtWtcwA"
  },
  "Z-8Lf0S-EIDR6AvD1SY_8A": {
    "date": "6/11/2018",
    "text": "Delicious food!!!  Generous portions!  Friendly chef! Need I say more?? Don't hesitate-grab a table here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hJ-dIJ0A5MCj6PKF1BpQfw",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hJ-dIJ0A5MCj6PKF1BpQfw/o.jpg"
      },
      {
        "img_id": "Po9cIBNc1uAajmKNb5jUgg",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Po9cIBNc1uAajmKNb5jUgg/o.jpg"
      }
    ],
    "user_id": "LlkUo9hRm0eKZ4wUSEER8g"
  },
  "FTnZJf8nnACsEqxdVDg4sg": {
    "date": "5/2/2018",
    "text": "We had the Special Mix for 2 and it was excellent.  The Adana Kebab was especially tasty but so was everything in the mix. Lots of food so we took some home with us. Will definitely be back during our stay here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hKf7G4AnF2NcSgMUMSiElg"
  },
  "ZqGap0JE2MyqGb0dBvqKpQ": {
    "date": "2/11/2016",
    "text": "Fez Mangal has been around for a couple of years now and I have only heard good things about it.  Yet I've not had more than a Turkish coffee before.  Somehow Ladbroke Grove is all about pubs and music for me, or the odd sneaky takeaway - it's such a busy dirty road, it hasn't occurred to me to stop for dinner before ...... and I've missed out.  A friend suggested lunch here yesterday, and it won't be my last! We shared a mixed grill which was served on rice and with a generous serving of salad on the side, as well as delicious garlic and chillie sauces. For a sporadic meat eater like me, this was perfect, lots of different flavours, perfectly cooked. All the meat is piled up behind a glass counter as you walk in. Carnivore heaven - veggie hell! The don't have a licence but invite BYO which would make this a very affordable dinner option. The fresh mint tea (fresh leaves sharing the water with a tea bag - free top ups!) was perfect for daytime.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tGFuzowYyRsUdy8m3l7rxw",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tGFuzowYyRsUdy8m3l7rxw/o.jpg"
      },
      {
        "img_id": "6D8G8NGaB8oEq0wbq3Df6Q",
        "caption": "Photo of Fez Mangal - London, United Kingdom. Chicken doner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6D8G8NGaB8oEq0wbq3Df6Q/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "cJMjBAxki27OZ_z4ZW1Vpw": {
    "date": "7/27/2017",
    "text": "Had dinner here and tried multiple kababs. Loved all of them. We also tried a dish with Chicken Iskender (shawarma meat) topped with tomato sauce and yogurt... Loved it! Service is good. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdJHPE7TO8Nc9bAmCMfrSQ"
  },
  "UYqdsgyBp0sxD_MAFYgObA": {
    "date": "6/30/2018",
    "text": "This was amazing and quick! The food was outstanding and colorful. I would definitely come back. Love it so much",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qhXvoadnTCMsSZc3_FABnQ"
  },
  "Mnkz5tA7GbXtkqL4XjG0WA": {
    "date": "4/8/2017",
    "text": "Would I recommend this place to a friend? YesWould I come here again? YesThis is a great small restaurant with good service. I got the lamb doner and yogurt/cucumber starter and they were both very good! If you like Mediterranean or Turkish food I'd definitely come here.The only problem was they sat us in the back next to the toilet. There's only one toilet so there was constantly people waiting in line and trying to get around the table, a little annoying.Besides that issue the food and service is good!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "CHK0Ob3r8KKwk2Q6etd0aQ"
  },
  "-2J-jPwT3Chr3gSFdwPKXg": {
    "date": "7/7/2016",
    "text": "I was staying with a friend who lives in Holland Park, and my partner and I walked here for dinner and were blown away.  I only wish we had access to Turkish food half as good as this in San Francisco.---- MAINS ----Yogurt Lu Chicken Shish: 5 starsA delicious hot ceramic dish of tender chicken, lots of tasty red sauce and warm yoghurt heaped on top.Mixed Döner: 4.5 stars2-person Special:  5 starsCame back to get this with my friends.  An amazing amount of food, lamb and chicken meat.  This and a vegetarian mezze platter fed four of us.---- DRINKS and DESSERTS ----Ayran: 3.5 starsStandard.Baklava: 3.5 starsA bit soggy but flavour is good.So many delicious sizzling smells and sights at the restaurant. There was a mad-looking 2-person special platter that I want to get if I visit again. Just be warned they don't accept credit cards that require signature, only the PIN ones.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WtZyXabdl1bP1XJ7vQRG-A"
  },
  "8YRCN7FBp7bHFB04mINNMg": {
    "date": "8/21/2016",
    "text": "My American boyfriend ranks this place as his new favourite restaurant. I agree it was gooooood!Really enjoyed our food here. They told us they were short staffed but we couldn't tell. The food was awesome and we will definitely be back when we are in the area. We had the shared Mezu plate (bread and dips - amazing) and then the lamb combo and lamb doner. So good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3BueVqxe0_446PsxPm_sBg",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3BueVqxe0_446PsxPm_sBg/o.jpg"
      }
    ],
    "user_id": "qbvBvvswIWnIr6BHBEl1dw"
  },
  "XrYahq5v4piEKtwztiRhGA": {
    "date": "10/14/2017",
    "text": "Food is amazing and properly cooked. You can choose from a different range of Turkish dishes, all of them really tasty. My favourite place in Notting Hill.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvxjL_JNla2NKbtKSP8Wpw"
  },
  "IWX8wXv3PPFZx5bUvdA5UA": {
    "date": "5/22/2016",
    "text": "Not impressed with the bread But one of the best spicy kebabs with rice Highly recommended",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "REWGP_0hUGmkygequIuXZg"
  },
  "Hfxo-XZMWvTeWC11lIna7A": {
    "date": "1/11/2014",
    "text": "First of all, for all international travelers, this place does not take credit cards. They take only debit cards that require pins. So do not get misguided.Having said that, as you can see from my star rating, I LOVE THIS PLACE! It is delicious and awesomely priced. I had the lamb shish (kebab) as some people recommended. I absolutely loved the tender and juicy lamb blocks. I also did try the baklavas, and it was wonderfully fresh and tasty. The baklavas arrived even warm still. I highly recommend this place around London. Have to come visit. I for sure will be returning a second time if not more!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q5aaJaCPCRsvg4TwkFTh4A",
        "caption": "Photo of Fez Mangal - London, United Kingdom. Best baklavas ever! So fresh too!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q5aaJaCPCRsvg4TwkFTh4A/o.jpg"
      },
      {
        "img_id": "Nqt_lBM81R9yE0Elsj467g",
        "caption": "Photo of Fez Mangal - London, United Kingdom. This is the lamb kebab or lamb shish!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Nqt_lBM81R9yE0Elsj467g/o.jpg"
      }
    ],
    "user_id": "x33z4WmRbPlOctz6Hmv2Bg"
  },
  "2S46B7Gxgu4UjSbWpu1B_Q": {
    "date": "9/13/2017",
    "text": "The food was good (not great). The service was friendly. The kebabs were flavorful but what could have pushed them over the edge was if they were more tender (they are not \"melt in your mouth\" good)",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UPNuvW7y6aVwhKK5z6eTJw"
  },
  "IcpR_Y1PP4NEe16TRdASBQ": {
    "date": "2/27/2016",
    "text": "This is a tremendously good value little restaurant, family run by Turkish people.  With decent food produced swiftly , and elegantly . There is sufficient variety to suit most tastes . Seating is cramped. You can bring your own wine free of charge. Highly recommended if you're in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4fX4RPaovJfle7ubAD_tw"
  },
  "pVkjr93WnTX28jKIyK5zlA": {
    "date": "10/22/2016",
    "text": "Always the best! The best Turkish restaurant in London by far. Had our favourite chicken beyti and chicken shish yoghurtlu, as usual juicy and tasty. Two must must dishes to order. Just yummy",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "PSzK38F2lazBtixEi0o1hQ"
  },
  "woIsXK9d2J0QpxMQLcw8KA": {
    "date": "8/5/2015",
    "text": "Amazing food. Nice ambience. Reasonable rates. Definitely one of the best meal places in the locality.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GbXFTs4xUgp9IwA5MfZKsg"
  },
  "Bnx0tQ6mKFAsXVSLS71HFQ": {
    "date": "4/18/2012",
    "text": "WOW. I am so happy this place is located so close to me. I was expecting the usual fare which they have of course but the food for the most part was amazing. I was disappointed by their lentil soup. It was a bit thin and the flavors were not very complex.The grilled fish though....amazing! I picked every tender piece of white flesh off and wished I had more. It was perfectly grilled on the outside and soft and moist inside. Just a tiny splash of lemon and bam...all sorts of deliciousness!Kebabs as expected..also delicious.When you walk in you see the grill fired up and kebabs ready to be devoured. Very cool place.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p3rAtcBgocupTM0Z1QceCg",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p3rAtcBgocupTM0Z1QceCg/o.jpg"
      },
      {
        "img_id": "rvjPBCz7sDSkWUXBk0znpw",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rvjPBCz7sDSkWUXBk0znpw/o.jpg"
      },
      {
        "img_id": "nPTivE7dg7kyZLn7E4-Z9g",
        "caption": "Photo of Fez Mangal - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nPTivE7dg7kyZLn7E4-Z9g/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "hPADTqN4cBUgEGq89sjQfg": {
    "date": "5/26/2016",
    "text": "My favourite Turkish restaurant in west London. Delicious fresh variety of kebabs. I love everything on the menu, I've been so many times! Always busy and bustling in the evening. Bring you own bottle!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "94-fFKPk8QCk3DSOts_Ctg"
  },
  "i7vc-7PUVIYEc6c_GFzK1A": {
    "date": "2/26/2017",
    "text": "Without question, the best Turkish meal I've ever had.  Reasonable prices, nice casual atmosphere, and amazing food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FibSrIRIt6KXdp7r6I1VDA"
  }
}