{
  "4167BEUKM2kLsRwiUQzAng": {
    "date": "5/12/2010",
    "text": "It was delicious. The caipirinha was amazing, and the inundation of meat that I received was, as an American, glorious to say the least.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cov2aFIs89O7zZtDfsakwQ"
  },
  "qbMWHadA6XV68UQjrV5doA": {
    "date": "11/24/2009",
    "text": "Meat unlimited, in which diners pay 22.50 to be plied with unending Brazilian barbecue, delivered to their tables with minimum fuss by efficient carvers bearing skewers and massive knives. Beef with cheese, pork chops, lamb, something wrapped in bacon, even chicken hearts. Price includes access to the extensive salad and sides bar. Unforgettable.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "lFIsDmm4VwpZmbMLwYf8DQ": {
    "date": "6/10/2010",
    "text": "Hi, We went on a sunday afternoon at about 4pm and it was full, we got so much Rib Eye and everything was great. We had a huge selection of meat and all the salad and pasta etc was great. Really attentive staff and amazing value for money- we were stuffed full of yummy food! Would definitely go again",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-eGVkpq-g_ZP0ttc6UZetg": {
    "date": "5/14/2012",
    "text": "Its a buffet style restaurant with lots and lots of grilled meat. Its not too expensive considering you eat as much as you like, our night there was fun and noisy, would like to come back some time",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ScM9nM4UXDoc7ywcu0oW0Q": {
    "date": "4/17/2011",
    "text": "Ok, for starters, 4/5 is due to the fact that food is really good and price more than adequate. Service was not exceptional, but that's rather due to language barrier than them being rude.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBTXwR3DKhyFb-0rQ7MkJw"
  },
  "oqK2hcdfeIkRsUtTW2ziiA": {
    "date": "11/6/2008",
    "text": "I went to this branch of Rodizio Ricos for a work Christmas outing nearly 2 years ago, the consensus amongst the group was that it was very enjoyable and it comes close to my idea of heaven, namely being served up limitless amounts of tender, tasty meats right off the roasting stick whilst not having to move. It doesn't disappoint as you will be offered meat until you can (m)eat no more, and as if that wasn't enough there is also a pretty diverse buffet to choose from. I long to go back to this meat temple again sometime, nowhere else comes close for pure celebration of meats.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rgooy4CwkL0DkXN820MhgQ": {
    "date": "3/10/2013",
    "text": "This place really lacks any atmosphere and it's very expensive. I wouldn't mind the cost if the meat, which should be the major selling point, was good, but unfortunately it isn't - chewy beef and sausages full of fatty bits...",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyPBQ2Vrv-pqko0_kd1s9Q"
  },
  "rsW4JiOP1R8un2VirUaFYQ": {
    "date": "11/16/2008",
    "text": "As it happens it is not easy to find a place to meet the needs of those carnivorous people out there, this Brazilian place manages quite well.  For £21.50 it is all you can eat, really as much as you can handle so be sure to take sweat pants when you come here.  The salads are lovely and fresh and the meat is bursting with flavour and prepared in front of you (almost).  Very long skewers hold beef, chicken, lamb or pork and they are being  cooked in a massive fireplace that has a very funny pork sculpture with an apple on its side.  Vegetarians fear not, besides the saldad bar they also offer grilled vegetables skewers at a price of £12 for all you can eat.  Very friendly staff, but for some reason I was not allowed to take a picture of their food, I guess you are just going to have to go and see for yourselves.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mqx10J5mNsd7yEcY_Ik71g",
        "caption": "Photo of Rodizio Rico - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mqx10J5mNsd7yEcY_Ik71g/o.jpg"
      }
    ],
    "user_id": "d14OvSJS28kOwK6DwxOFKQ"
  },
  "aAo903ZWZiaxH9k3QTuzXQ": {
    "date": "3/5/2009",
    "text": "Top tip: When you've got a Brazilian girlfriend, and parents who have never eaten Brazilian food why not marry these happy circumstances and venture down to Rodizio Rico for a barrage of beef, chicken, pork and every high protein meat under the (cold) English sun. Perhaps not one for veggies (unless you're partial to salad and garlic bread), this Brazilian-style buffet is one of the oldest and most respected eateries in town, located in the fashionable district of Upper Street. Great service, delicious tequila and a fixed rate of 22.50 quid for all you can eat. You will be considerably wider after the experience, but it's well worth it!",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "tS2zbmgTgwMmPKKSa6hDPg",
        "caption": "Photo of Rodizio Rico - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tS2zbmgTgwMmPKKSa6hDPg/o.jpg"
      }
    ],
    "user_id": null
  },
  "V0HRT1GUqCYUoU66um3olQ": {
    "date": "8/3/2011",
    "text": "Cripes, I love this place. The meat is always fantastic, and it's complimented by a great buffet. I would say it's better when it's a bit busy, because when it's quieter sometimes there's not as much of a selection available. When there's a full house they make sure to have enough staff on the go so you're not left wanting.My tip is to not fill up on the buffet too much. It's a little too expensive for me to indulge too often, but I tend to take advantage of the meat more because that's where the value of this restaurant truly lies.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "52qT7K5O_TWisZITyY6JJg": {
    "date": "12/21/2010",
    "text": "MEAT, GLORIOUS MEAT!My friend Josh and I got here at 6 on the dot, not wanting to miss out on a minute of meat induced happiness. By 6.10 we were seated, an excellent Malbec (30 squid a bottle) decanted in front of us, and a plate edged with meat lasagna (delicious and worth sacrificing some stomach space for). By 6.15 we were tucking into various cuts of meat brought to us by men carrying laden skewers and armed with machetes that they deftly manipulate to slice a portion of meat and deliver it to your plate. We started with BBQ sausage, then on to freshly roasted chicken wings, followed by top round, and finally a sirloin that had merely seen the reflection of a flame and serves steaming and dripping with juices. Other dishes included various types of sausages, grilled lamb, and roast ham. We ate continuously for over an hour and even though we were stuffed I still tried to cram another piece into my mouth (to the consternation of my date who wasn't pleased with the food coma I was rapidly slipping into).The salad bar and hot dishes also included in the 23 squid price tag were delicious although I refused to indulge too much as the meat was the prize. However, next time I may just go for the salad bar which is cheaper at around 15 squids.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "3Vv6t4AMiTningzvHyg2hA": {
    "date": "9/17/2011",
    "text": "My first visit to the Islington Branch. I had visited the Westbourne Grove restaurant a few times when I felt nostalgic for Brazil.My eight year old fancied some meat so off we went.This branch is far more comfortable and spacious than Westbourn Grove, but still, I have to say that this is no more than a taste of the genuine Brazilian experience. For one thing, the quality of the meat is just not a patch. I am sure they use Brazilian beef, but the really good Rodizios in Brazil serve Argentine beef which is superior. The meat today was tougher than I had hoped. I also found the chicken hearts undercooked. It may be my taste, but I like them very well done and crispy.Also, you just don't get the choice of cuts you would get in Brazil.However the chicken wings, sausages and salad bar were very good.If you don't have deserts and booze,  it is quite reasonably well price.Still, good fun with friends for a night out, although you won't want to do anything strenuous afterwards.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTGTU1doKuSOcSYG9IScTA"
  },
  "3787SF9h8X_-y71KAt3vGA": {
    "date": "11/13/2008",
    "text": "This restaurant has it all. The atmosphere is buzzing and its great value for money. It is the food that steals the show here though. It is excellent. The salad kart is ten times bigger and ten times better than your average salad kart. That alone makes RR worth visiting. Though the best is still yet to come.The meat at this restaurant is sensational. Waiters continually come to your table offering freshly cooked joints of meat. They will slice off as much as you want, and will keep coming back with, pork, beef, chicken, lamb etc...Rodizio Rico is my kind of place. As for the great value for money, its about £21per head for the buffet. AWESOME!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YSXhVAFmaTaMctdl-ZI9Kg",
        "caption": "Photo of Rodizio Rico - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YSXhVAFmaTaMctdl-ZI9Kg/o.jpg"
      }
    ],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "Ea443cU2ZrutwRO2SGICEw": {
    "date": "9/23/2013",
    "text": "Oh my god I love this place so much.It's a bit pricey but I'm a meat lover so I'll eat mostly rump steak that isalways cooked to perfection. I highly recommend Rodizio Rico, Islington to anyone who loves meat. If you'revegetarian there is an amazing salad bar with a splendid variety to choosefrom. The staff is always polite with a smile on their face, well done guys youalways keep me coming back.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "QLWxZw2UKtm8Vpa6sIeCdw": {
    "date": "3/16/2010",
    "text": "Epic. I'm still full.For you meat lovers out there or even those who are partial to deep friend banana!The buffet section is huge and the variety wide including fried bananas (yes them again!), lasagne, potatoes in all varieties, salads, veggies, sauces and some more authentic brazilian side dishes. Delicious.And as for the meat, well, it's intense. You're given a little drinks coaster which is green on one side - come feed me more delicious meat - or red on the other - I'm far too full and please don't come near me with that hunk of beef on a skewer.We had rump beef, shish beef, chicken wings, chicken sausage, chicken hearts (yum!), sausage, pork loin, pork ribs, beef ribs, beef with cheese, roast lamb and even some fish. Incredible.The only down side being that they can take a while to bring the skewers round and sometimes avoid the bigger tables altogether on some rounds.Did I mention the fried bananas?Not bad for £22.50 each. We were in there for 2.5 hours in all so it made for quite a night!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Puy6PcLNSBct5uZhCsjBQ"
  },
  "VMBrcqygIwiCESTKpi_scw": {
    "date": "6/10/2010",
    "text": "The trick to Rodizio Rico is to get there when it's actually pretty empty. If that's the case then you'll get richer pickings from all the lovely BBQ that gets brought round by the waiters. If it's busy and you're a long way from the grill, then you'll only get to see lots of other people tucking into their lovely meat while you have to pick through the chicken hearts they didn't want. Also, don't over-do the salad cart thing. It's not much better than Harvester was back in the day. The meat's the treat here.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8vuZ_WmHagwCBKGiVXLiQ"
  },
  "I2aK_f2ATEFuvrn8PDySbA": {
    "date": "4/10/2013",
    "text": "WOW ! A MECCA FOR MEAT LOVERS! you can eat as much as you want and . Best churrasqueria in London . A huge selection of meats to choose from , please go there when you are starving .Yum",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FU3IDy4M0zN5RnvtgfHJsQ": {
    "date": "2/8/2013",
    "text": "This place is just heaven for meatlovers like me. It is an all you can eat buffet, but don't be fooled by that as all the food is very tasty and for the price you pay you receive good value and large portions. The staff are all very polite and friendly and you will never be left unattended or waiting. The best way to describe the food is the thing my granddaughter says when we come here- yum-yum for my tum-tum. Even children love this place and in my book that's a huge plus. Definitely recommend you try it too.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "WKLStsYGorfJfqZUd5Bdtw": {
    "date": "9/7/2012",
    "text": "Lovely place for meat lovers!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "22a4FW1w5l1B1eKrdhm6Lw": {
    "date": "1/24/2010",
    "text": "So, a friend of mine was celebrating his birthday yesterday. A week or so beforehand, hearing rave reviews about the fun vibrant atmosphere at Rodizio Rico, he had phoned up and booked a table for 15 for his birthday celebrations. A few days later, mid-week, he phoned up again to check that the booking was OK. \"It's all fine, we'll call you on Friday to confirm\" he was told. Friday came and went -- he wasn't called back, but didn't really think much of it. And so, on the big day itself, he gave the restaurant a call just to double-check that everything was OK. Sadly, Rodizio Rico had no record of his booking, claimed to never have heard from him, and were generally dismissive of him. \"We're fully booked, and you have no booking here\" was the most help he could get from them. So, I hear great things about the restaurant, its meat and its atmosphere. But I cannot personally review this aspect of Rodizio Rico, as they managed to fail spectacularly far before we even managed to get through the door. By all accounts, this is supposedly a pretty fun place. So don't let this single incident put you off. Unless of course you have any intention of booking in advance, in which case you might be better off trying somewhere else. If I ever feel inclined to try and go there again, and if I actually succeed in doing so, I dare say I'll update this review based on what it's actually like once you get in. (BTW, the story had a happy ending - we went to Gallipoli Again, who sorted us out with a great table at pretty short notice.)",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cRpcy21QDy0foYWIa0rRTw"
  },
  "EDa7pLZGt3jhilm93hoxjA": {
    "date": "8/25/2015",
    "text": "My civil partner and I chose this place for our reception  . He's brazilian and half our guests were also Brazilian . It's was perfect in every way.  As the years have gone by we have returned regularly and it seems to be suffering a bit. The food is still very good but each time we visit there's something else that's not quite right.  I think the increase in Brazilian restaurant's around London is really putting pressure on and maybe Rico is,  dare I say it,  a bit  complacent.  We still go there and I still recommend it but I have been into others and they are better , just not hugely . I also think that timing is everything . We have had much better service earlier in the evening  rather than later in the evening and the food was much better at the earlier booking than later.  I would still recommend  this testaurant but choose an earlier sitting rather than right up close to the end of the night.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UYO73aAeiLcaW4jEaczaSQ"
  },
  "-A74kTU6KFg3o8IjE6M3Ew": {
    "date": "9/3/2011",
    "text": "I can't believe I didn't know about the eat as much meat as you possibly can Brazilian restaurant concept until last year when I went to one in Putney, as its complete genius and perfect for me. To be honest I'd been a bit disappointed in Putney as some of the meat was overcooked and once they had worked out that we were big eaters the meat started to come more and more slowly  so I had lower expectations when we came here.Rodizio Rico proceeded to completely smash my expectations. The meat was all cooked just right, tender and not chewy, and it kept coming and coming  our waiter had a little glint in his eye when bringing the meat skewers over, seemed to love it when we accepted his meat, and was visibly disappointed when I had to concede defeat and not eat any more. I didn't have much from the buffet (why waste space for meat with empty carbs) but I did have some beans and some of the various chilli sauces to accompany the meat, these were very good too.The service was friendly and relatively quick, all round a really great evening.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "mrDeGqmocPEyJiDuiF01cQ": {
    "date": "1/23/2010",
    "text": "This place is brilliant esp if you know people who are meat eaters and can eat alot too. It's a Brazilian restaurant and buffet too. They cater for Vegetarians too but it's more for meat eaters. You pay something like £22.50 per person exc drinks and its abotu £15.50 for Veggies. You basically have a salad/pasta and other bits in the middle where you go and fill up on your plate then you get waiters going around with different skewers of meat and you can decide if you want it or not. Definitely worth every penny and its a great atmosphere here...",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "0mMFqgwllDSWwRhixVNRBA": {
    "date": "4/15/2010",
    "text": "My body has now drained itself of all superfluous organs and fluids in order to make room for ALL THE MEAT that i ingested last night. i know you might be thinking \"but Suzanne H. YOU can't afford to spend £22.50 on a dinner\" and I will say \"I know (insert your yelp name here) but after eating the weight of a small dog in delicious meat and sides it was TOTALLY worth it!\" the atmosphere was really relaxed, and the service was AMAZING! they were consistently coming around and offering meat. We never had a moment to stop and think about whether or not we were already too full to put more meat on our place, so we would just agree to more! They have a delicious buffet of sides and sauces, but DON'T BE A FOOL! don't waste your time on side salads and delicious plantains when you SHOULD BE EATING MEAT. although, if you are not a meat eater the salad buffet on its own was a delicious feast, and that only costs £15.50, and I know you are thinking \"again Suzanne H. why would I pay £15.50 for a SALAD buffet!\" but I will reply \"(Insert your name here) stop asking so many questions, can't you see I am busy meat-ing?\" (yes meat+eating= meating) but it is an impressive salad buffet and i don't mean stupid vegetables. I mean lasagna and chips and nicoise, beets, new potatoes, rice, pasta salad and other fried things, and a chicken stew.. to list a few.The desserts looked impressive too, but if you have room for dessert you are doing something wrong. I would not suggest rodizio rico as a date place, especially if you are planning on doing *anything* afterwards, b/c your entire system will shut down for digestion and I also doubt that your significant other will be turned on/impressed with your \"meating skills\" but I would suggest a big group, at the very least so you have some people to create a meat recovery support group with.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 10,
      "cool": 4
    },
    "photos": [],
    "user_id": "Mp5gxHPkPLZqiXyAi8UtUA"
  },
  "bTUZCnKQG77lbR96oW3D7g": {
    "date": "9/17/2010",
    "text": "They will never stop you from eating, you can eat as much as you want and fill up your stomach like a pregnant cow. This brazilian place is a very typical south american churrasqueria. A great selection of roasted meats, and other local foods like fried bananas etc. Give it a try, but before you go there you'd better be starving, to fill up your senses and go in ecstasy with all their meats.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "YCKC9su13nMcbgM30hAExQ": {
    "date": "4/18/2009",
    "text": "Rodizio Rico is delectably divine. It is worth every penny, never disappoints and every bite is as mouthwatering as the last. This all-you-can-eat Brazilian fantasy is not for the delicate eaters or vegetarians of the world. If you like meat, this is the place for you. I personally use the minimalist eating technique prior to a Rodizio Rico visit, others prefer to eat continually to stretch the stomach, in either case, get your eating shoes on because it's hard to say no when the rump steak comes around for the 10th time.  Since I think this restaurant is amazing, I will simply advise you on how to be an eating machine. While the salad bar is full of an eclectic mix of cous cous, grilled vegetables, croquette and fried plantain (amongst other yummy bits,) eat small, don't overload on the cheap stuff. Save space because unlimited meat will soon overwhelm your big white plate.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "Im-sgmFUogbpJnrT2gLJcA"
  },
  "AhuWTsoj7oTSYPO4yYKZzw": {
    "date": "6/22/2017",
    "text": "London - The verdict - quantity not quality. The meats are endless. All you can eat beef, pork, lamb, sausages, and chicken.  If you are hungry then this is the place to dine at. The quality of meats is average. Again if you are hungry this restaurant will satisfy all meat lovers appetites. For the vegetarians they also feature an extensive salad bar. We were too full to try any of their desserts. Try them out if you are hungry for Brazilian steaks and meats all at a price that is family and group friendly. Eat early or make a reservation. They do fill up fast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciZF6uLSJEzy2vA6_fnBxw"
  },
  "UrBUAisZMU40zhO0DcuXaQ": {
    "date": "10/28/2017",
    "text": "It was ok... went there because a friend wanted to go... first of all its expensive.... second its loud and third the quality of the meat wasn't all that great. The staff was friendly and super helpfull! If you want some meat, and lots of it, then definitely go there!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTJVSOAxPyB1hGwoZFGoxA"
  },
  "TAaMTuYWFJrcbdtthf6iUg": {
    "date": "5/18/2015",
    "text": "A great time had by all. Stopped here for dinner tonight with friends. The buffet has a nice selection of salads, side dishes, and vegetables. The meats dont stop. Chicken, Lamb, Steak, and Sausages. It is endless and oh so tasty. They also have brahma beer and a excellent selection of cocktails.Just Go!!!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3jZ7W7ZPXBCX7opq1IUdPw"
  },
  "mRxsn-3sGM70F6mJ8IB6eA": {
    "date": "10/4/2015",
    "text": "It's my second time here, last time was 4 years ago. Came back with a bigger group than last time and we managed to get a table straight away. Service is fast, the side dishes are yummy and the meat is AMAZING! Honestly, it's so amazing and it just keeps coming. Best thing is to come on an empty stomach, skip the sides and just enjoy all the meat! Glad to say the service hasn't deteriorated in the last few years. Great place for a family meal out.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DY7gTXm4Tb86ZIt_LmFR5Q",
        "caption": "Photo of Rodizio Rico - London, United Kingdom. Couldn't take anymore!! Stuffed",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DY7gTXm4Tb86ZIt_LmFR5Q/o.jpg"
      },
      {
        "img_id": "VQGpYcHttFrIpMOKD60ItA",
        "caption": "Photo of Rodizio Rico - London, United Kingdom. Beef",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VQGpYcHttFrIpMOKD60ItA/o.jpg"
      },
      {
        "img_id": "JkiFo44_IWYCBj_TCTIdyA",
        "caption": "Photo of Rodizio Rico - London, United Kingdom. Meat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JkiFo44_IWYCBj_TCTIdyA/o.jpg"
      }
    ],
    "user_id": "0suJsRrbbt4onJgUcRJ9Lg"
  },
  "r_E-GYRoV9VKl5H2ureTKw": {
    "date": "3/11/2015",
    "text": "I went with a friend who had visited in the past, and said it was one of the best things he had ever eaten. So of course, I had very high expectations! We arrived not long after they opened at 6pm and it was still very empty in there which was great. We were seated straightaway, which was fantastic, and served very quickly. I like the idea of the open side bar. You can have as much salad, rice, vegetables, etc as you like to go with your meat which is great, and you can pick it yourself. Having said that I do like that the meat comes around to your table too. I have never experienced it before and wondered what it would be like, and in fact, it's a great atmosphere. The meat on the whole was very nice, but there were some meats that I have tasted much better elsewhere, especially the ribs. A lot of the meat seems to be low quality cuts and I think that is why it tends to be more fatty. However, the way it is cooked is beautiful. Overall I'm not sure that by the waiters coming around to you that you get your £25 worth of meat, because as you wait for each piece to be brought to you, you eat more sides as a result of being hungry. So I'm not sure I would rush back for this reason. Would rather buy an expensive steak!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0jU8RzlyzMimxf9lVuYknw"
  },
  "EhwBIMZVktlOe77IqgiaiQ": {
    "date": "6/14/2015",
    "text": "Great buffet and very good meat that keeps coming! A good place for 2 or huge tables!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XF2V6D_lV-7CiFrSCq-1yQ"
  },
  "89tYTx4_cA1oE4yK-M9gqw": {
    "date": "9/4/2014",
    "text": "Rodizio Rico is kind of like a meat lover's dream. The best thing about the Brazilian BBQ places is that you know you will never leave hungry. As my partner said, \"If you are ordering dessert, clearly you've done something wrong.\"There's a wide spread buffet to start off with. The buffet has a nice selection of salads, cheesy bread (get this), fried bananas (also get this), beans and a selection of other vegetarian goodies (also get the eggplant and mushrooms with the garlic sauce).But don't get too much, because when you get back is when the meat comes around. And there's a lot of it. I won't even try to get into the massive selection of meat they brought out. Unfortunately, the people with the meat skewers do kind of like to force a lot on you at the beginning, then they refuse to give it to you because you have too much. Well if you hadn't sliced off EIGHT SLICES of beef the last time you came around, we'd probably be okay to get some of that pork. The top meats (for me) were the chicken hearts (eat as many as possible), the chicken legs, the beef ribs and the beef neck. A lot of the other cuts of meat were chewy and not that great (even though they did come out nicely rare to medium). The service is fairly good too. Our waiter was very friendly and offered to get us some fries to go with the food as well. He was also Australian so wanted to talk to us about where we were from (although I was the only American there that night, so it wasn't as exciting as he thought it was going to be). It was a bit tricky sometimes to get the water pitcher filled up, and some of the guys with the skewers were a bit aggressive about not giving us any meat because they had cut us off too much already.So it's a nice place, but not the best. The meat isn't the best quality (but what do you expect for unlimited meat for £25). I wouldn't say no to coming back, but it's definitely not at the top of my list. You can definitely eat your weight in meat, but be warned that you may be way too stuffed to sleep later in the evening.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "UTYXtCCVYzCijfrW9IFHUQ": {
    "date": "8/31/2015",
    "text": "All you can eat buffet!! £21pp for meat bbq, salads and garnish!! Drinks are extra. Good environment. Bringing meat to you every few minutes. Use a go and stop card to indicate if you still want more food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uMbgtBErKkiFio8RmtEfmw",
        "caption": "Photo of Rodizio Rico - London, United Kingdom. Show this and they will stop brining food to your table.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uMbgtBErKkiFio8RmtEfmw/o.jpg"
      },
      {
        "img_id": "V6YLOds3qEa0nVOLYvkRtw",
        "caption": "Photo of Rodizio Rico - London, United Kingdom. Show this and they will keep coming with food for you",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V6YLOds3qEa0nVOLYvkRtw/o.jpg"
      }
    ],
    "user_id": "UZkwB8dZo-jKtWCTpsDDgQ"
  },
  "SXM9zKh9a2z8RluvQ6BC2g": {
    "date": "11/12/2013",
    "text": "In recognizing that male bonding should occur over disgustingly glorious volumes of livestock and beer, the boys at my agency have elected to build our so dubbed monthly \"meatings\" at Rodizio, one of the very few meaterias in these parts. The traffic light never sees red - not on our shift.The variety coming off the grill is respectable with no grilled veggies and similar pollutants pissing on the meat parade. The big surprise was the grilled chicken hearts - never would I have expected it to be a favorite of the night even among the less adventurous.Rodizio, I salute you! (cue formation fly over)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCOwZztY3w6KbmlETuHm4A"
  },
  "HSYnywITt1Y2CzJnaqx03Q": {
    "date": "5/5/2013",
    "text": "Meh. Meh? Yes...meh.I'll start by saying that I'm not a big fan of beef, so I am basing my review solely on the chicken and pork offerings, as well as the salad bar. The salad bar was random and didn't offer as many fresh items as other churrascarias I have been to. Some of the offerings were downright odd: lasagna? Stir fried Chinese veggies? I...um...yeah, no thanks. The chicken sausages were what appeared to be just chunks of chicken shoved in casing. It sounds great in theory, but it resulted in a very dry, chewy sausage that lacked in fat and something to bind it all together.The pork ribs were tasty, but mine was raw near the bone. Raw pork is no bueno, so I didn't take that when it came back a second time. The chicken thigh was nice; moist, with a good grilled flavor. Pork roast never made it to my table, sadly, so I can't comment on that.I will say that my husband enjoyed the beef that came around frequently. I would say it was 2:1 in favor of beef being offered. So that might have increased my review if I had sampled those offerings. The beef looked amazing and the quality seemed good. The mojitos were very nice, fresh and crisp. The service was spotty and our server spoke almost no English, making requests for additional napkins and a jug of water a bit more of an ordeal than it should be.All in all, I probably wouldn't go back unless I was hosting dinner for the Samoan rugby team or something.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hwFRU2bIc-DLX7-hGs29nw"
  },
  "FDNnQ3WU0khNWglnPvsqNg": {
    "date": "2/14/2013",
    "text": "I kind of liked the concept of the restaurant, which takes me back to some backpacking memories in South America.The veg buffet is quite impressive in its quality and diversity. The cocktails are impressive as well, very tasty and different, yest not too sweet, creamy nor sour !I'll stop here with the \"pros\" list.Now the down part: the service is quite average, at least in my experience last night. Nobody came to great me when I came in, yet I had merely put my scarf down that a waitress came to me and told me to pick a cocktail from the (quite nice) list. Wow, calm down !One of the waitresses looked angry (not at us), the whole night, and sometimes said incomprehensible things (like, you get 2 buffet vouchers, when we were three, then took off).Even though the rest of the service was fine, most of the waiters didn't understand when we asked them a question beyond \"yes\" or \"no\", when they were bringing those huge skewers of meat.The meat now.... It's supposed to be the highlight of the restaurant (and truly, of any true churrasqueria). However, most of the pieces they brought us was over-cooked, under-seasoned and sometimes dry.Notable exceptions: some beef pieces, the chicken wings, and the chicken hearts !Also, they came at a very steady pace towards us, asked us if we wanted more meat. After saying \"Yes\" the first 4 times, we quickly got swamped by meat. Then we start refusing politely, but they didn't look too happy about it (c'mon, smiling isn't that hard !).All in all, an average night. It would have been absolutely fine if the buffet price (basically the only option) wasn't that high.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "NWPw2mY-82hmNNJpp84R-A"
  },
  "7bIs86w27NuVWhOPHrQgXw": {
    "date": "11/18/2010",
    "text": "I'm well on the way to developing gout after eating at Rodizio Rico. At £22.50 this place isn't cheap but when you can eat a farm yard worth of meat it works out well.The waiters come around with skewers of meat and then slice off a piece at your table. Over the course of the night, I had steak, beef, ham, ribs, sausage and lamb. The service is great despite being in the corner, the waiters kept coming but I lacked the capacity for chicken wings, beef with cheese and chicken hearts.I'll definitely make a return visit to Rodizio Rico once my body recovers from all that meat.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "unV05KrzxsUQoyUF50Q_TQ"
  },
  "bZ_BloS9Y-pOxp_6_HIieg": {
    "date": "2/2/2013",
    "text": "At £25 for all you can eat BBQ meat - its not a bad deal.  But I'm not sure what the deal is with all these 4 / 5 stars for the food quality though.  Maybe they think the restaurant deserves it b/c its all you can eat, and has a large selection of meats.  Large selection, yes.  But I thought it was alright, would rather go to a normal restaurant and get a quality steak!  I guess it depends on how much variety you want! There were beef, pork ribs, chicken wings, hearts, and chicken sausage - which was my least favorite item.  It was heavily salted / seasoned, and extremely garlicky, and this is coming from a garlic lover!  In case anyone was wondering, the chicken meat was not ground up, but are chunks of chicken stuffed into a sausage casing.  When the waiters arrived with the spit-roasted meats, I oooh'd and ahhh'd as they sliced the meat onto my plate, but the novelty quickly wore off.  Someone else commented that the meat was either cooked too rare or too well done.  I have to agree on that, as the waiter brought the meat back to the kitchen when he realized the meat was too rare.The salad bar wasn't great, and certainly not worth the £18 if thats what you're going for. There were stuffed mushrooms, pasta and potato salads, olives, roasted veggies, ox stew, fries, rice, and beans.  Actually the highlight was these little mini cheese bread balls.. now those  were delicious!Service - the guys with the massive meat skewers came by frequently, which everyone was quite happy with, though the waitress kept asking if we were done and eager to clear up the table.Overall, not bad.  A fun place to try out, but I wasn't really into the all you can eat meat.The reason for my 1 star?  I'm writing this review as I'm clenching onto my toilet bowl for dear life.  Remember the scene in Bridesmaids where Lillian was staggering across the street and ends up sh*tting herself?  I almost didn't make it to my doorstep.  What should have been an 8 minute walk home, ended up being an 18 minute walk home.  I have no idea what made me sick but I'm def not going back!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJKnmUxpJfzPovCTsT1kLg"
  },
  "Wpb1nGmZNO9WKZGed6Tjmg": {
    "date": "4/21/2015",
    "text": "If you want meat, and that's all you want, this is the place to go! Go for the meat all you can eat and gorge on as much meat as you can squeeze into your belly. Lovely cuts of beef, pork and chicken oh, and chicken hearts if you are brave enough! Good to go to for a birthday meal as the set price makes it easy to split the bill once the meat sweats have set in. Tip: wear stretchy pants and prepare to roll home ;)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e60duUcWV4MarFRaRATozA"
  },
  "Uyop32CnPeQBD7A8nIinEA": {
    "date": "2/5/2012",
    "text": "Went to this place for dinner with friends while visiting London for business. I must say this is one of the better brazilian places, but few problems would make me not give them a high 5. So breakdown:Service - generally it was good but for some reason they kept bringing the same meat 3-4 times in a row. A bit annoying - the point of such place is to have new things, after all its like 15 different types of meat...Salad bar - fantastic, lots of selection, only thing i would have liked to see is black beans instead of refried beans. I loved the fact you could grab their famous cheese balls there and not wait for server to bring them.Meat - most was very nice and key thing, not over marinated. Few pieces were a bit hard.Also one thing is this place can get quite crowded with not much room. Perhaps thats the reason they dont bring meat out that often, servers barely have room to walk.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E75yun9KcXyzD9aKmrafdA"
  },
  "xVlqQ4y9BFK7Cu5WhEn1NA": {
    "date": "7/18/2010",
    "text": "Awesome all you can eat Brazilian BBQ place, just a pity that it costs £22 per person!! Beware the really tasty and big spread of vegetables and sides that you serve yourself; while they really do taste good as well (thus catering for vegetarians), they will fill you up so you don't have any space for the meat! Service was really quick and fast, with the meat carvers coming round to your table every few minutes, and if you don't keep up you'll soon have a plate piled high! Do try the chicken heart, which is a Brazilian speciality, and tastes better than it sounds. Review by The London Insiderlondon-insider.co.uk",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "xwqlEVa0rsuI60PC4EJ-Lg": {
    "date": "10/20/2011",
    "text": "If you like meat, and I mean a lot of meat, then you'll like Rodizio Rico, a Brazilian Churrascaria just off Islington Green. I went on a Friday night and it was bustling with many large boisterous groups.  As with most churrascarias there is an endless parade of all things meat (sirloin, skirt steak, pork, chicken wings, salt beef, etc). There are also well disguised skewers of chicken hearts so be sure to ask what meat it is first!  You get a nifty red and green card (red means = NO, I'm stuffed, Yes = More Meat! Please!). They make some well crafted caiprihinas with cachaça...having a few will make the experience even more memorable.But why just 3 stars for Rodizio Rico? Well compared to other churrascarias I've been too, this one is a bit of a let down. The meat albeit plentiful was continually either too rare or too well done, and sometimes a bit chewy. You definitley get quantity over quality here. That said, there is good value to be had (just over 20 pounds/person for unlimited salad bar and meat) and I do like the concept. Last bit of advice...be sure to be careful when you go to the toilets (especially after drinking multiple caiprihinas) as there are plenty of waiters running around with skewers of beef and comically large swords and they don't always look where they are going.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fou9pya19z4NWWAGZslxXA"
  },
  "DU-otmoLKAGM-cAsCTmTvQ": {
    "date": "3/3/2013",
    "text": "This place is awesome! Always great atmosphere and the grill buffet is amazing. I am a big meat eater and the choice is amazing as they keep coming to your table until you turn over your little card to stop them  chicken wings, chicken thighs, chicken hearts (yes delicious you need try), pork ribs, pork joint, lamb joint, beef joint, gammon, chicken sausage, many types of steaks! Guranateed to leave you feeling mega full!HEAVEN!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KHp0Xe_vQ_5LMgjKTVcgCg": {
    "date": "6/26/2013",
    "text": "I loved going to their original restaurant. However, since becoming a chain I thin k the quality of the food has gone down significantly. The restaurant on upper street is far too crowded, they shouldn't allow that many people in there. The meat also didn't come round fast enough for me.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TvGNXJSMEaxCcTc3wsmVEw"
  },
  "6ut3FHfTErbA4aCUhiNC-g": {
    "date": "9/5/2012",
    "text": "Wow! This place is fantastic if you are a meat lover! Favourite place in London and we went as a party of 6 few times while over in London. Price is good and there is a buffet which is well stocked of delicious Portuguese and Brazilian style food. They keep coming none stop to your table with different cut meats  prime rib, pork ribs, chicken sausage, pork sausage, lamb, beef ribs, chicken thighs, chicken wings and much much more.even chicken hearts  sounds gross but actually very small and delicious!Fantastic service. Big Thumbs up!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}