{
  "MrwuhtinWf0AwPECii3MPA": {
    "date": "8/6/2012",
    "text": "We popped in here after an evening at Saddler's Wells. On the way we asked about making a booking and the attentive staff even knew when our show was due to finish!Polished vegetarian food in a bright space, reminiscent of the older sibling in Hammersmith, this is a great restaurant and one I will definitely go back to.After our meal, the two of us dallied until very late into the evening and while the staff began to wind down at the bar there was no question of us being made to feel uncomfortable or rushed out of the premises.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Q2-OfokhWwz5xnj6wcK5A"
  },
  "hlnYKl81QxNycim_1nHzXQ": {
    "date": "10/7/2013",
    "text": "Damn fine addition to the Islington/Rosebery Ave scene. Top vegetarian food - imaginative and a great selection of ideas. Hallelujah! Stonking wine list. Really nice and helpful staff. Rammed pre Sadlers Wells events (too busy) and deserted at other times (not busy enough) so I hope they find their equilibrium and do well. I live across the river but happily travel to this one.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzazP0bxfr5x1v1dKJDebQ"
  },
  "RMgrHVDk1vRQcZCK8_rpzw": {
    "date": "11/27/2013",
    "text": "Great service, excellent food! I took a non vegetarian friend and he was impressed with the menuExcellent and hope to go back again soon!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "06SZginvX1apMIDQMHcdEQ"
  },
  "W_MZF_9wgXf0rLunclMPHg": {
    "date": "11/5/2012",
    "text": "I love that this place is now in Islington! I've been a fan of the Hammersmith location for years.  This location has nice high ceilings and still manages to be cozy, and in general is a more attractive venue than Hammersmith (at least, last time I was there, a few years ago).Food was quite excellent (once you get past the hard-to-read font on the menu -- their \"G\" icon, for \"gluten-free,\" looks like an O, confusing more than just me).  I started with a small \"woodland\" salad with spinach, mushrooms, hazelnuts, and truffle oil dressing.  I know I'm supposed to feel about truffle oil like one is supposed to feel about Carmina Burana -- discriminating distaste -- but they both strike just the right note, for me.  A small was actually small.Next, I had the Wild Mushroom & Celeriac Rosti, most of the words of which I didn't know (rosti? girolles? paris brown? cep?), but it was a great random choice: savory and perfect for a freezing night.I'm totally coming back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "brTYfgAc0uD7fiT8arLqIg"
  },
  "feXwDHEXhb5wwIklB8nw4A": {
    "date": "6/8/2013",
    "text": "DinnerDinner with friends because one of us was a vegetarian.As a vegetarian, this place may be recognized as a five star place. Not so many non-Asian food can be served in this sophisticated manner.I wanted to give four stars but I had a huge headache and couldn't enjoy this cozy place. I know that they managed to present vegetarian food in this sophisticated manner but, somehow what I had wasn't looking so attractive. I'm sure the present can be improved make it look more seductive? I enjoyed the presentation but I couldn't remember the experience. Normally I will remember what was the feel when I've bitten, swallow eg flavor, crunchiness and smoothness. I generally do appreciate tasting food and it's like a travel of tastes while I'm chewing. I didn't get any remarkable sensation. The okra was used which has a peculiar texture. It's a good start to use and combine with something crunchy so that you could achieve balanced chewing feel. There's a space to develop. Good opportunity.If I wasn't well, I may decide not go back, but health matters for tasting. My tongue and nose need to be calibrated.I'm going to Hammersmith one with another vegetarian friend. Watch the space.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7zWsZ_4f5H6nn5DH_OI-bg",
        "caption": "Photo of The Gate - London, United Kingdom. Tortilla",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7zWsZ_4f5H6nn5DH_OI-bg/o.jpg"
      },
      {
        "img_id": "L_7n_twTxasYO5qN0Gauow",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L_7n_twTxasYO5qN0Gauow/o.jpg"
      }
    ],
    "user_id": "IrwLjCt5g89Lz3zV86JCcA"
  },
  "HkGR4_FoT6evJkekcpDYIA": {
    "date": "5/8/2014",
    "text": "Surprising.  As a proud carnivore, I didn't think I would enjoy this meal but the my starter with the courgette flower was amazing.  The flower was filled with a sweet potato stuffing and the contrast between the sweet potato, chargrilled courgette, and the sour dressing was fantastic.  The main didn't quite live up to the starter, I had the teriyaki aubergine was a little under seasoned but it had the potential to be amazing with just a little teriyaki dressing on top.  And the blueberry brioche was a perfect ending to the meal",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eREO-Ffp2_FZBoAE-G9-Ew"
  },
  "endYXR2P5MGNXvmbK06VxA": {
    "date": "3/22/2015",
    "text": "First, when she invited me in this vegetarian restaurant I thought it will be the first but the final date ... I need meal!!! But it has been a real surprise. Congrats to the \"chef\"",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WhEAsUc6yLRpJ0kfJLWx9Q"
  },
  "R3qJ1jkSUGnwmC2UYCh_ZQ": {
    "date": "3/14/2015",
    "text": "Amazing food. Just wish I could afford it more often as it is terribly expensive. The interior of the restaurant felt a bit cold, but the service was warm and friendly. There are definitely better vegetarian restaurants in London which are less expensive if you're looking for something truly special, but we wanted to splash out on our anniversary and I'm happy we went!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zDwHNUOK7U_tuHKWIpndIQ"
  },
  "puT7Fzt7Yp4RDooz0dNFCg": {
    "date": "11/15/2014",
    "text": "Brief review: very good food, beautiful atmosphere. But the service could be a little bit better. And unfortunately for my taste it is trying to be a little \"American\" in styling, which is not bad but not needed.Definitely worth visit and revisit. Liked everything we tried (there were four of us), the dining room is one open area with a good sense of space and light.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBjuWMpbf6egqpQhwoG1oQ"
  },
  "t5QTCsEZfzwWwA4ZX-_eoA": {
    "date": "3/11/2015",
    "text": "I went here with a fellow Vegetarian in late 2014, having purchased a deal on Groupon. The restaurant was very busy so it was lucky we had booked a table!  The menu was incredible. It took us ages to chose as we wanted to try everything! When the food arrived, the presentation was stunning. It was as if you were in a luxury, very expensive restaurant. It also tasted incredible!! We were not disappointed. The service was great, despite how busy it was and staff were very friendly. In all, a superb meal and I will definitely be going again. I can't recommend enough. My friend was so impressed, she recently bought the recipe book.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_j28YAwiCRkJUUxvtA5hg"
  },
  "dBZiYdf3p7Ktj_08iiXhbg": {
    "date": "1/3/2016",
    "text": "Wonderful vegetarian meal with excellent service an ambiance -  will definitely return!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OhtB9bn5hEPJJhdDJyW7UQ"
  },
  "0R6TaLxRlXGsTZWuXaX3ww": {
    "date": "6/10/2014",
    "text": "Dang! This place was off the hook. Busy but not too loud. Delicious Syrah. Great selection of vegetarian noms. Not too expensive. Easy to get to. My only quam is that the bathrooms could have been nicer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-f5299ufV7bm1BgB8jSNQ"
  },
  "Yiq_a8Cuo0pjIjI-vxc1iw": {
    "date": "10/28/2014",
    "text": "Bland arancini.  Mushy aubergine with cous cous crumb that wasn't very nice. Butternut squash and feta salad had way too much feta. Roulade was bland.  Courgette flower very good.  The polenta chips were great.  Desert mezze pretty awful and £18! We thought it was quite expensive for what we got. Service was fine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XxG2cKNPEQXiMs-AypqoHg"
  },
  "3bN4behlFbtMP8WBG8dYMg": {
    "date": "11/5/2015",
    "text": "I've been to The Gate a couple of times now, it's always a treat, although the quality of the food is a little variable - some stuff is amazing, other things slightly less so. It's always great to go to a vegetarian restaurant and have a whole menu of choice, plus the cocktail menu is good. Puddings less so. Good place to take the parents - quite up market.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjBtKqeXqzFuDuu4PQ_hHQ"
  },
  "BFWkYGuDPu8k7hOB4q7Pnw": {
    "date": "5/24/2013",
    "text": "This place does really nice gourmet vegetarian food. The dishes are quite elegantly presented. I was feeling cheap so went for one of the express lunch options which left me feeling hungry, but we decided to share a dessert sampling platter which filled in the gaps quite well. I'd say dessert was the best part, especially...well...everything on the platter!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8JIDyRkzWPIW91_6Vco7A"
  },
  "3Bmd4pYgcod-dqNaFypa8w": {
    "date": "5/11/2014",
    "text": "We were staying in the Islington neighborhood for a month, and popped into The Gate on a whim on our first night in town. I'm a vegetarian, husband and toddler son are definitely not. To start, the front host was exceptionally accommodating: we had no reservation, walked in off the street, had a toddler and a pram... he didn't bat an eye, and went out of his way to make us comfortable. We were both surprised by how large the interior is, and also how upscale it felt. Veg restaurants often have that weird grimy hippie vibe, even when they serve better quality food. This felt like any other nice restaurant in the neighborhood.  Food was excellent. We had the leek and cheese tart (amazing), the halloumi (my husband's favorite) and the feta and cpus cous fritters (also good). For dinner we split the eggplant (which was a little bland) and the mushroom rotolo - which was absolutely divine. We plan to return during our stay here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tiLxdVSxa_1JUIWkVbrLcw"
  },
  "d5dAfhQ_9e4zOXrTy-CZnA": {
    "date": "7/29/2013",
    "text": "Tried the food the first day when they released the 2013 summer menu and it was not very good. Portions were big, food bland and it took a long time for the food to come. It was unfortunate since people highly recommended this place. I hope it was just a bad season for the restaurant.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_dC3wEoq02Op4lCyzYXSZg"
  },
  "f3pcLmgbQt-aPBq5QQyhqw": {
    "date": "3/8/2013",
    "text": "This place was fantastic.  It can be pretty difficult to find a good vegetarian meal here, but they definitely delivered.  Good wine selection as well.  I'd say they were a little light on the vegan items, but you could definitely get by.  Service was great at the beginning of the meal, but got a little bit sloppy as the place filled up.  The Gate goes on my regular rotation of vegetarian places in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eebEMFqDSh3G-JNqf9cWvQ"
  },
  "VXzVt2S1K0udUwGuzjD0KA": {
    "date": "5/14/2014",
    "text": "I had a GREAT experience at The gate! Luckily, the place wasn't crowded and the service was excellent. The waiter suggested some beers from a local producer, and they were great! I was there with my mom and my mother-in-law, and my mom doesn't love to eat outside, she's a picky eater when it's not homemade food. Spices and weird ingredients can be a nightmare for her (and for me). I tried this place because I supposed that a vegetarian place could be the answer for a person like her, and I was right! The food was gorgeous, tasty, and very well presented. I got the potato roll filled with wild mushrooms with a creamy and delicate mushrooms sauce and some steamed string beans. My mom got the salad with artichoke hearts, dried tomatoes, hazelnuts and string beans and after a week, she still speaks of this salad (thank you! thank you! thank you!) My mother in law got the Tali, the plate with chapati, Dal, fried okra and mango salad, (this one was  good too). We didn't take any desserts, we were already happily, full. With three beers, a plate with olives, a bread basket and three different place the bill was around 21£ for each one of us. It isn't cheap, but definitely worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cmaiIO3O_W4IP1YzWFuAfA"
  },
  "nlDmuMbXrepii5MV5KXf1A": {
    "date": "11/26/2012",
    "text": "This place is a short walk down from Angel tube along St John's St.Went for Saturday lunch. The main menu was not in service, instead a Brunch list was offered, so I can only comment on the dishes therein.Warm, friendly welcome, and as we arrived at 12:30 on a wet day it did not fill up till we had been seated a while. Staff remained attentive and really helpful throughout.Chose from the wine list, which is limited and not expensive. Wines were only OK, in the sense that they were not faulty but rather dull and not very interesting. The Saumur Blanc was not as good as the Verdicchio. They need a star or two to offer.Bread and brilliant olive oil (charged for) gave us a good nibble whilst we waited for fellow diners and food after ordering.Food uniformly attractively presented, very fresh, and every dish very good indeed. I thought the starters a little generous, but then it was brunch. The mains were beautifully presented (2 variety) Tortillas for myself and Root Vegetable Rotolo for my chums. We had the Dessert Mezze as we were rather full and it worked excellently, giving everyone a proper taste of each possible dessert for the next visit. Nicely our waiter asked us what we thought of the dessert offerings and understood out suggestions about one and we felt that the feedback would be taken on board  not a criticism by the way..Worth seeking out, especially if you have vegetarian leaning! And still a top place in '16",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W-UnHQ1gq-4pWhxCEXx3_A"
  },
  "bxcBK-KLQCJNWS7Ye9UGgA": {
    "date": "12/15/2013",
    "text": "Hands down the best vegetarian food I ever had.  I love how much they embrace veggies! I hate when restaurants try to make vegetarian food into imitation meats or meat dishes.  It just tastes horrible.  They don't try to pretend vegetables are something that they are not.  Vegetables are delicious and deserve respect! And their fresh fruit drinks are amazing too.  I tried the orange, mint and strawberry juice and it was so refreshing! For my meal I had a vegetarian lasagna.  The piece that stood out to me the most was the tomatoes in the dish.  I always enjoyed tomatoes but for some reason...this tomato was amazing! It was so sweet and flavorful! So much so that I called the waiter over and asked where the tomato was from. He was kind of perplexed at my question and guessed that it was from Spain.  All the ingredients they use taste very fresh and you never leave feeling disgusting or stuffed.  Even when you eat a lot like I do :).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8y-WgvkpiDOn2SpFY3RaDA"
  },
  "D9AN_iLY7EToeSh9U-YMSg": {
    "date": "11/3/2014",
    "text": "My wife and I visited ate here twice.  The first time was so good that we returned; it is close to Sadler's Wells theater.  The menu is excellent with creative combinations and tastes.  But, the service (2nd visit) was dreadfully slow and the food was warm-to-cold as a result.  When we mentioned this to the staff on our way out, they shrugged their shoulders, seriously!  :(  Probably will try other area restaurants before returning here.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8u5YcX5EEN9LHR3eZqbdw"
  },
  "WmMhwUQ3WoyUnt1RG_iiIw": {
    "date": "1/20/2016",
    "text": "Amazing veggie food and completely worth every penny! Definitely coming back again. We had the tapas dish and some sweet potatoe chips and it was enough for a light lunch for two people. The staff is very friendly and the atmosphere was great too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5UBCrFlBah7MkWSuqp5Uww",
        "caption": "Photo of The Gate - London, United Kingdom. The gate with missmooney",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5UBCrFlBah7MkWSuqp5Uww/o.jpg"
      }
    ],
    "user_id": "f5aZYhEB6a3rdwLJ6QOmUw"
  },
  "OTIpZNK7U69dAW50GbJ_Tg": {
    "date": "4/22/2015",
    "text": "Went here last night with my friend who is vegan who was visiting London, lovely vegetarian restaurant close to Upper Street and Angel station so great location, doesn't look massively impressive from the outside but inside is really nice, lot's of space high ceilings. I had the tortillas and my friend had the tofu thai red curry, tortillas were amazing, I love sweet potato but to have it with goats cheese was delicious and the thai red curry was really well spiced. We were early diners at 6pm but the service was attentive without being suffocating. I had the sticky date pudding for dessert and my friend had the crumble as this was the only vegan option - this is really the only negative thing I have to say as I definitely think more effort to include at least one other vegan option could be made.Overall delicious food, good service, great location.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sd9Kof4vFaCoB6KS2TpFEQ"
  },
  "GKQomf6uDtBx8-eift69-g": {
    "date": "4/27/2016",
    "text": "A friend took me here while I was in town. It was such a treat. Everything was delicious. I had an 8 bean salad and the halloumi. It was almost too much on the menu. I'm used to only having one or two options. I'll be here again next time I'm in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBfFWhPxKT9zVP1nbwZabw"
  },
  "YZQGPQ3TN75QYkYtT9sJoQ": {
    "date": "2/21/2015",
    "text": "A delicious-looking menu was topped only by the deliciousness and presentation of our vegetarian delights. I was so pleased with the range of vegetables on the menu - many places think sticking seitan or tofu into a dish that would normally contain meat is enough, not thinking creatively about the wondrous possibilities of vegetation. The Gate does this, with elegantly designed and flavored veg-based dishes. Will definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ks-RuwIQU_7oA5Sstor67g"
  },
  "NzXVy9io0JHU9AG3i1LWUg": {
    "date": "5/15/2015",
    "text": "Seriously gourmet vegetarian place that turned me on to filling, delicious vegetarian food. It doesn't have to be boring at all!The outside of the restaurant looks underwhelming, but the space is quite open inside with high ceilings.At just a few steps away from the Sadler's Wells theatre, this is the perfect Pre theate spot.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2dCkG0BtubmhVsoPxCZQKw"
  },
  "Xa0DGdQDNVKnp4rNbC639g": {
    "date": "7/20/2016",
    "text": "It's always lovely to find a vegetarian restaurant that doesn't have fake meats on this menu. Food was ok... A little disappointing. Food looked fantastic but was a little bland. The beetroot tart was mainly onion and didn't taste very beetroot-y. The dragon salad was very heavy on the carrot and light on the tofu, and the triangles were a little bland. The staff were lovely though, and the drinks were great",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1pSkrRulW2P_e-HaeHZ5Qw"
  },
  "1Ht-r5yR2xXupaomYnR77w": {
    "date": "8/24/2015",
    "text": "Lovely quick dinner, tad expensive for what it is but the desert was really worth it!Will definitely be back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbg7o_ytIe4ysay6iZuh3g"
  },
  "7Iv9CNIBJQ5_aSGexb8QdA": {
    "date": "4/23/2015",
    "text": "Pleasant atmosphere and comfortable enough ambiance.  Jalapeno margarita had a delightful kick to a refreshing cocktail. I had the polenta chips and falafel to start. Polenta chips were delicious, falafel was ok. Mushroom risotto as the main - memorable as savory indulgence.Overall - solid vegetarian option in the neighborhood.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d9upXWQtH5PC-3ATLBdLlw",
        "caption": "Photo of The Gate - London, United Kingdom. Mushroom risotto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d9upXWQtH5PC-3ATLBdLlw/o.jpg"
      }
    ],
    "user_id": "LOkYuXQx1ik9weMn1L7NDg"
  },
  "bKXQJybHQ6aWV8oB2ipKYw": {
    "date": "9/12/2016",
    "text": "A little noisy but the food is really good and there are quite a lot of options. Nice staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gEz00LZfBRcRAPYh2JOkOg"
  },
  "0Kh5cdmTHKqapA7M2ZjiSA": {
    "date": "3/22/2016",
    "text": "An amazing veggie restaurant, thought it was well worth the money for the quality and experience. The staff area great and the food was very good. Definitely worth a night out",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5muzyrg2VyT-7DPyxxjIsA"
  },
  "aJU1ZsqjRVsL9GKdgZKs0A": {
    "date": "2/2/2015",
    "text": "Great Place. It seemed that all tables had a reservation. But we were early so got a chance to try this restaurant while we were in London. Both our meals were excellent and the service very friendly + a nice athmosphere close to the open fire. Would go tere for sure next time when i am nearby :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZivBQCAxjLbeePf2RF5yA"
  },
  "3-Q1CorKcBZqXVuVcvJtpw": {
    "date": "3/10/2015",
    "text": "Great food experience for usual meat eaters like myself. We tried a combination of the starters and main. Make sure you order mushroom risotto!! Great service and they make excellent recommendations if you are not sure what to get.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2jafmGYMS0W7wo7SbRjJGQ",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2jafmGYMS0W7wo7SbRjJGQ/o.jpg"
      },
      {
        "img_id": "gdu2Z9ThzTgJdvwBPaWkDA",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gdu2Z9ThzTgJdvwBPaWkDA/o.jpg"
      },
      {
        "img_id": "igI_JeU-HpBkXmwgqaJrVw",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/igI_JeU-HpBkXmwgqaJrVw/o.jpg"
      }
    ],
    "user_id": "ZzHqPd-wmjU9t88Y8KM01g"
  },
  "2Z0H-O9nD5cG0xXTd6jbaw": {
    "date": "10/16/2014",
    "text": "I am so conflicted in giving The Gate three stars versus five. It's such a huge discrepancy, but I think it needs to be done. I have been to this place almost 5 times, and have had great experiences and mixed experiences.First, the good. I love that this place just elevates the goodness of vegetarian food instead of making faux meat dishes. I have been to those places, and it is almost always a disaster. The seasonal menu keeps things exciting and yet the core menu usually remains the same. The rotolo in any of it's veggie incarnations is delightful. The aubergine schnitzel is another amazing entree to go for, the saffron cream sauce complements it perfectly. The dessert mezze is an absolute MUST HAVE! Order it a few minutes before you are done your main meal, and wait for this masterpiece to arrive.Now on to the bad. I was contemplating whether to do this or not, but I think it is warranted. 3 out of the 5 times I have been, there was absolutely atrocious service. My guests and I were ignored for almost 45 minutes before our appetizers even arrived, and were left without our main courses for an equally long time. The staff did not seem to care, and all we got was \"yes, it will be out soon\". Furthermore, there are quite a few dishes on the menu that are just off the mark. There was an okra dish that was just okay, and any main salad I have gotten has been quite bland and uninspired.  At the end of the day, I would probably still go to The Gate. The frequency with which I go though is questionable.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4FeUPaH62X8BQbhuLWNEw"
  },
  "c5hRhhdD8VDY1VldBM84kQ": {
    "date": "9/3/2014",
    "text": "I was excited about this place when my friend recommended it as I am trying to eat more veggie and less meat. It is on the quieter side of Angel, but the space is nice and open. I loved the description of the food and everything sounded so yummy. In order to sample more stuff, instead of getting two mains, we decided to get 5 small dishes. We had the Thai salad, Arancini, beet root ravioli, courgette flower  and halloumi kibi. The Arancini and courgette were quite good, but heavy. The Thai salad was flavorless and I had to add a lot of salt to make it less blend. halloumi kibi was so disappointing that it reminded me of the food from our canteen. I so wanted this place to be good, but I was so disappointed with the food.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B08mpX_xN9rukIv5-S2-aA",
        "caption": "Photo of The Gate - London, United Kingdom. Halloumi skewers",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/B08mpX_xN9rukIv5-S2-aA/o.jpg"
      },
      {
        "img_id": "vahHYol9mkEnyvT1SIOoIQ",
        "caption": "Photo of The Gate - London, United Kingdom. Stuffed zucchini flower",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vahHYol9mkEnyvT1SIOoIQ/o.jpg"
      },
      {
        "img_id": "9UQbiIeGvDdv-bHOrX9HXw",
        "caption": "Photo of The Gate - London, United Kingdom. Arancini balls",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9UQbiIeGvDdv-bHOrX9HXw/o.jpg"
      }
    ],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "jOeqzZ4TTto067zS7PKvJQ": {
    "date": "2/25/2014",
    "text": "Excellent vegetarian restaurant. I'm a meat eater, but I'm always on the look-out for places to take my vegetarian girlfriend. I've been to Mildred's before and enjoyed that too, but the presentation and care taken to prepare the food here was a step above, although this was also reflected in the price. We started with the mezze - a selection if small portions of the other starters, which was excellent. For mains, my aubergine schnitzel was good, and my partner's polenta salad was also very tasty. The wine was of good quality, if a little pricey (we had the Riesling) and it's great to see that they stock local beers from Five Points and Redchurch. Service was friendly too. We had a great time and I didn't miss the meat at all.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "fCWhAID8nGxMesGzRnZd0A",
        "caption": "Photo of The Gate - London, United Kingdom. Polenta salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fCWhAID8nGxMesGzRnZd0A/o.jpg"
      },
      {
        "img_id": "nRae8ZJ4VtH0O_qpuigKYg",
        "caption": "Photo of The Gate - London, United Kingdom. Aubergine schnitzel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nRae8ZJ4VtH0O_qpuigKYg/o.jpg"
      },
      {
        "img_id": "twnR9avorS2GbzOGUlW9Sg",
        "caption": "Photo of The Gate - London, United Kingdom. Mezze",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/twnR9avorS2GbzOGUlW9Sg/o.jpg"
      }
    ],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "9gw10op-N37naGJ3HuSQmw": {
    "date": "2/7/2014",
    "text": "I'd been looking forward to coming here since I found out about it and The Gate certainly didn't disappoint!The oil and breads appetiser was very tasty. It was the soup starter that first seriously impressed though. We both went for a butternut squash, coconut milk and chilli soup and it was one of the loveliest soups I've ever had. Just about perfect!For the main course I went for probably their best known dish (and the one that caught my eye when first perusing their menu) the aubergine schnitzel. I enjoy a proper schnitzel and I liked the non meat take on it. Very nice. When I go back next time it'll be hard to decide what to try as I'd eat just about anything on the menu!To drink they have some excellently selected beers from local breweries, Five Points and London Fields...but I have a big issue with the price of six pounds. This is a very nice meal, the kind I wouldn't have every week, and I expect to pay a bit more for the food. But I've never paid anything like that for a beer and felt a little bit fleeced on that count.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "BXbCx0zoZqvSczNzCyz5Tw": {
    "date": "5/10/2014",
    "text": "I'm a pescetarian, but I usually prefer to eat vegetarian when I go out for meals. My husband made reservations for my birthday, and I was very much looking forward to it. We got 3 courses that all sounded interesting and promised a lot of flavour.Well, what we got was a LOT of flavours. Too many flavours. It started to taste like they just crammed a bundle of randomly chosen flavours and tried to make them taste nice in one dish. To me, this does not really 'show off' the wonderful flavours different vegetables can have when cooked right and paired with the right ingredients. To be fair to them, the individual items were cooked well, but the dishes were very disappointing considering the hype.It seems like they have the technique, but they just don't have the ideas quite right or thought out well. Maybe that's just what they want to be or they need more time to mature. I'm not sure. I will keep an eye on the menu, but I'm not rushing back to this place on a special occasion.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4yclQAOoXgrozfwP7Y5NkQ"
  },
  "1-M02Kz_oky_jlfWzCVGrA": {
    "date": "1/11/2014",
    "text": "Had dinner there last night with the wife. I'm not typically a vegetarian restaurant fan but this one was pretty good. Service was great, it's a nice setting and the food was tasty.Wife and I both enjoyed our meals, I thought there might have an over reliance on rocket in the salad to pad it out but then I guess Vego's see rocket as a main food type whereas I see it as an enhancer. Anyway, give it a go, well worth the visit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "jC0eb4V_0VgSS33scggUqA"
  },
  "aTyYIoj8mnAD3hg6QojADw": {
    "date": "2/15/2015",
    "text": "Had heard great things about The Gate but came away very disappointed on my first try.First, there was some confusion with service, we ordered olives to start, and were then told they just  served the last one. The waitress then just left. No apology or asking if we'd like something else instead. Not a great start.Our mains arrived - very quickly.We ordered the Aubergine Schnitzel, which was somehow both overly greasy and bland at the same time. My partner got the mushroom risotto, which was bland, and the polenta chips on the side were - you guessed it - also greasy and bland.We hoped the dessert mezze would make up for it and it did to an extent, having a variety of decent flavours but nothing we'd go back for.But for the price we paid, it simply wasn't worth it and very disappointing given the reputation.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKei6R58WtdMyHtGsw710A"
  },
  "7wKxLZ1CIa-d_OIQW53Fng": {
    "date": "9/13/2015",
    "text": "Had a fabulous vegan meal here in a comfortable but chic setting in Clerkenwell. Green curry and starter sampler were standouts. Corn cake not very special. Good drinks list, service competent.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdhnhWykPu8y5S6vAvKSHQ"
  },
  "5mDZW3Yatwd9aVsta4c4LQ": {
    "date": "9/18/2016",
    "text": "The Gate was a little hard to find but definitely worth it if you are looking for vegan/vegetarian near Hammersmith. It's also a great place for veggie/non-veggie groups as there are a lot of options for both. Inside looked very clean, staff was very nice, and the menu had plenty of options. The food was very tasty but the portions were a bit small for the price (not much rice with the green curry).Would fully recommend.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WPBbVeW9bGGJKs4AKgQwA"
  },
  "iGBHwa67E4UDhenFQTn1kA": {
    "date": "4/22/2018",
    "text": "So I didn't realize it was Vegitarian/Vegan when we saw it on yelp. We sit down and the carnivore in me immediately notices there's nothing with a face on the menu. So we started with the Mediterranean Tart and a Miso Glazed Aubergine. The Aubergine was surprisingly tasty, while the tart was also a real treat. I then had the broccoli salad, which was also surprisingly good. We drank a bottle of Cuvee des Galets, which was excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1sz6JqobepPGHyMJTv7Ww"
  },
  "T-Bl_HCuxB2UQtITrnFmOA": {
    "date": "4/22/2018",
    "text": "I am a fair-weathered participant of the vegan and vegetarian lifestyle. My colleague and I happened into this restaurant by chance and did not realize it was a vegetarian restaurant until we saw the menu. Although he was less than excited about, I was fine so we stayed. The food was out of this world. The Cuvée des Galet Syrah also happened to be one of the best Red wines I ever had. Service was great. I have been a frequent world wide traveler in my profession for 25 years eating at many top restaurants. I would put this restaurant in my top 5 ever. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i0KP7a5WQ5n-cM5jKkrjSg",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i0KP7a5WQ5n-cM5jKkrjSg/o.jpg"
      }
    ],
    "user_id": "JlaN-l82FTe4YGoz769vLA"
  },
  "PWXY70r2-OyJdyJB004g6A": {
    "date": "9/24/2015",
    "text": "I'm not a vegetarian, but some of my friends are and I'm always a bit scared when they say \"oh I know this great veggie restaurant\".  For me going out to a restaurant is too indulge yourself, so I'm not super excited at the though of eating tofu and salad.BUT - The Gate offers a really various, gourmet selection of veggie delicacies. Who knew you could do so many different dishes with only vegetables?The food was amazing, really tasty with some very interesting combination. My friend and I shared a mezze platter (stufffed mini pepper, spring rolls, fried aubergines and tortilla) and a cheese plate and we really enjoyed it. The place looks like your normal gastro-pub, really nice to meet up with some friends.The only thing I didn't really like was the quantity/price. It costs us £25 each for a tiny plate of mezze + carafe of house wine + a tiny cheese plate. A tiny bit overpriced for such small quantities. The mains looked like they had more on the plate, but we already spent quite a lot just for the starters so we passed our turn.",
    "rating": 3.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "nNqMY1PdQzKl2Y7q9KqwNg",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nNqMY1PdQzKl2Y7q9KqwNg/o.jpg"
      },
      {
        "img_id": "dNil_10Yr7JMxpv22G6rOg",
        "caption": "Photo of The Gate - London, United Kingdom. veggie mezze plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dNil_10Yr7JMxpv22G6rOg/o.jpg"
      }
    ],
    "user_id": "4Ggaq_5gjSj7FYMBmXKx0g"
  },
  "4bi48ShsLSMH8QK2gxWbPg": {
    "date": "4/25/2016",
    "text": "Being a vegan, finding places like the Gate is quite exhilarating. I won't lie, I decided to come here for lunch with friends only because I looked at their desert menu and saw vegan eaton mess on it. Eaton-fucking-mess! That too vegan. I would've eaten through a bucket of raw kale to get to the eaton mess. But thankfully it did not come to that.For starters we had the miso-glazed aubergine, some herby polenta fries, and the bread basket. The aubergine was heavenly. Perfectly sweet and savory. I wish all aubergines were made like this. Or for that matter, all veggies. The polentat fries, predictably, were fantastice. I mean what's not to like. So, as would've been expected, I ended up ordering more of those. For the mains, we had the rotola, the laksa, and the artichoke carciofini. Everything was good, albeit a little one-dimensional. Except the laksa, which was the star of the show. Nicely seasoned with a bit of a punch and a big helping of veggies.And now, the moment, you've all been waiting for, how was the eaton mess? You know how you sometimes build up something in your head and it then never lives up to its expectations? This was NOT one of those times. The meringue was still crunchy and not too sweet. The strawberry coulis was tartfully brilliant. And whatever dairy substitue they used was a superb standin. At least, I could not tell the difference. Forget the best vegan, this was one of the best eaton mess' I've ever had.The place itself is big, spacious, and has a nice feel to it. I went here with my wife and kid along with a friend and not once did I feel like we've been relegated to some cramped corner. Also, the wait staff is wonderfully patient and helpful. Definitely coming here again, and this time, not just for the eaton mess.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "RC2AZCXaXt_qHiF8HEJ9Gg",
        "caption": "Photo of The Gate - London, United Kingdom. Rotola",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RC2AZCXaXt_qHiF8HEJ9Gg/o.jpg"
      },
      {
        "img_id": "TNN0u0FFHgDcZw29-w32gw",
        "caption": "Photo of The Gate - London, United Kingdom. Vegan laksa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TNN0u0FFHgDcZw29-w32gw/o.jpg"
      },
      {
        "img_id": "dWTqKLCV76mos_mLf01omg",
        "caption": "Photo of The Gate - London, United Kingdom. Herby polenta fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dWTqKLCV76mos_mLf01omg/o.jpg"
      }
    ],
    "user_id": "Z1giyL333Abrtl0ULhDAmQ"
  },
  "3IWGabSOQjfCp0PtgpJBZg": {
    "date": "11/23/2015",
    "text": "I prefer to eat vegan and while my husband doesn't, I was thrilled when he made reservations for us at The Gate. We had the bread with olive oil, courgette flower (chose the vegan prepared option), a glass of red wine, beer, and for the mains he had the thali while I had the Asian dumplings. The bread was ok, the wine and beer were ok, and the thail was just ok. I really liked the courgette flower and I loved my Asian dumplings!Staff are nice, ambience is lovely, and there is a lot of space at this restaurant which is really nice.I live pretty close to The Gate so I would not hesitate to go back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "5P3asDGDKc-rFPZSjTt5Eg"
  },
  "0CPfbSbJCWznKwXGrS_6HA": {
    "date": "7/27/2016",
    "text": "I really want to give this place 5 stars! But the issue is that I have been slightly underwhelmed both times I've visited. Still, I will continue to return, as veggie restaurants deserve all the support they can get! This time around I had the veggie burger - the menu was a lil misleading as I thought the patty would be made from jackfruit, (as using it as a meat substitute certainly seems to be the trend in California), but in this case it was just a garnish.It was filling, beautiful presented, though a little bland. My date's Latin-themed dish looked more tasty, so maybe I'll go with that next time!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "qSQ0nB8GdTIl1c4B1GG8YA"
  },
  "piduPSsyZaeiGNT8Kt5Ecw": {
    "date": "8/8/2015",
    "text": "The Gate was lovely, and big ups to them for letting us stroll in and get a quick seat without a reservation.Agreed with Joey C.'s comment that, from the outside, the restaurant is not particularly noteworthy - turns out, I've unknowingly walked past The Gate many a time.  Inside, however, the space really opens up and it feels light and uncluttered.There is a wide range of drink options - a nice wine list, and several gins (to pair with your tonic, natch) and tequilas on offer.  Being August the table jumped on some cider, Pimms and an Aperol Spritz. The last two were nicely presented with an extra flourish of whittled-down produce.The pakora starter was totally forgettable, though I couldn't fault anything specifically. I guess my attitude skews towards leaving pakoras for Indian restaurants, but this was one of the starters that was easily divisible by three so all of us could have a share.The server recommended the mushroom gnocchi as the stand-out entree, so 2/3 of us opted for that. The final plate was lovely; five round gnocchi (the read more like dumplings, frankly, than the traditional Italian gnocchi, but that's neither here nor there) over a bed of mixed mushrooms and some cheese crisps lain atop. For 14ish GBP/plate, it was not a large, hearty dish (despite its description). It was warm, not hot, and overly salted. The service was friendly and I'm sure they would have worked to fix the former quibble, but we were on a tight timeline for the night so it wasn't worth the trouble. Yelp note: so would I, as a meat-eater, prioritize this restaurant for a night out? Well no, probably not. But it's well situated pre-night out in Exmouth or Angel, or pre-/post-theatre at Sadler's Wells.  And nice to have a vegetarian restaurant or three in your arsenal to suggest to your veggie friends!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "arMSL4-o1gGfitXvgyk9PQ": {
    "date": "10/21/2016",
    "text": "This place certainly dispels the myth that vegetarian food is boring - especially to a meat eater such as myself. Would definitely recommend and try this out!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4QlSbDQFQdUR-0rFj31EbA",
        "caption": "Photo of The Gate - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4QlSbDQFQdUR-0rFj31EbA/o.jpg"
      }
    ],
    "user_id": "6ppQZwm5Z7Vi7gyqsGvK6Q"
  },
  "az03CGE5yTS9Fik1ohfDFQ": {
    "date": "11/13/2017",
    "text": "Really like the food here. The dishes are unique.  Items on the menu seem to rotate frequently.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSxPD4O8oOtXE1fRLXXJTQ"
  },
  "ZpoqkRzBsY1C2vdIjGb3fA": {
    "date": "7/18/2015",
    "text": "Light, bright, modern restaurant. The high ceiling makes it a bit noisy, but I like the airy atmosphere and the service was fairly good. Although I like vegetables I don't usually go for vegetarian restaurants. However this one has really tasty dishes that won't make you miss your proteins. Fresh ingredients and interesting combinations of flavours like in the sweet potatoes and beetroot tortillas, with guacamole, sour cream and watercress.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0KqG1cushBHXauHbO6Kofw",
        "caption": "Photo of The Gate - London, United Kingdom. Asparagus roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0KqG1cushBHXauHbO6Kofw/o.jpg"
      },
      {
        "img_id": "GTKF4-qOOkscV2btnjw1ew",
        "caption": "Photo of The Gate - London, United Kingdom. Vegetarian tortillas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GTKF4-qOOkscV2btnjw1ew/o.jpg"
      }
    ],
    "user_id": "isvG7Z6GUB-zKPL72usBnw"
  },
  "txq7PzD28eUorKjMtDFRAw": {
    "date": "8/14/2016",
    "text": "Fully believe what they say; not just a good vegetarian restaurant, a good restaurant overall.  Speaking as a carnivore, the food is more than filling and is packed with flavor.  The polenta fries were cooked to perfection and I had a potato & feta creation which felt clean and filling.  Great place to go if you're in need of some restorative food after a hard night out (like I was...)Portions are quite generous and since it's vegetarian the prices tend to be quite reasonable as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-011DC3U_yyX_oTvC03Vw"
  },
  "X_3OnMLIoVITSPHEmobn_g": {
    "date": "6/8/2016",
    "text": "The gate is a serves up a decent vegetarian fair, able to satisfy even the meat eaters among you. The atmosphere is lively and relaxed. The staff are really friendly and chilled.The thing that stops them being five stars is that their dishes are a bit hit and miss. I had a brilliant wild mushroom dish for a main but my sister had the artichoke hearts and they really didnt have much going on for them. The starters were ok but didn't wow, the deserts were all lovely though.I'd say this is a great place to go for a celebration with the vegetarian or vegan in your life - or if someone can't eat gluten/dairy/nuts. It will hold up to most people's expectations of a good restaurant, but have a decent chat to the staff about what their favorites/recommendations are before placing your order.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "twJWGa9ygB6otKS_V1lkSw"
  },
  "4kk2BrUXQwc27KgMCzJEVg": {
    "date": "4/4/2015",
    "text": "As one of my vegetarian friends was visiting me for the weekend, we went to The Gate, which is known for its international dishes and its inventiveness.What I wasn't prepared for though, was how beautiful the place actually is! High ceilings and well stock bar: always a winning combination!The starters were really rather good: the Mediterranean Peppers, filled with an artichoke & hazelnut paste, and served with tapenade and pesto, this dish was basically the sun on a plate. The peppers themselves were melty and artichoke paste had a very delicate, slightly sweet flavour, which worked really well against the stronger flavours of the accompaniments.The Three Onion Tart itself was absolutely flawless: thin, cheesey, flakey pastry covered with a smooth, creamy, leek-ey filling. I wasn't as much of a fan of the caramelized red onion sauce, which was slightly too sweet for my taste.For mains, the Wild Mushroom Risotto was fairly nice and well balanced, the Broccoli Flower Ravioli (which was really more of a gyoza-type thing) was a bit meh (but the accompanying wasabi & pumpkin puree was ace!). The winner dish though? *THAT* Aubergine Schnitzel! Silky-smooth grilled aubergines, layered with smoked cheddar, pesto, roasted red peppers and tomatoes. SO GOOD!All together, it wasn't bad but nowhere near as creative as I expected it to be, so I'm not sure I'll visit again. Or maybe just to try the desserts, as we didn't get a chance to do so this time!cakeandwhisky.wordpress.…",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G_7XD4H_ldnzKJP-2oexXQ",
        "caption": "Photo of The Gate - London, United Kingdom. Three Onion Tart, The Gate, Islington",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G_7XD4H_ldnzKJP-2oexXQ/o.jpg"
      },
      {
        "img_id": "rturCZyHiAEkEbwOMkXKpA",
        "caption": "Photo of The Gate - London, United Kingdom. The Gate, Islington",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rturCZyHiAEkEbwOMkXKpA/o.jpg"
      },
      {
        "img_id": "GRLgS_NbRR3yu2A7VvNnpA",
        "caption": "Photo of The Gate - London, United Kingdom. Mediterranean Peppers, The Gate, Islington",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GRLgS_NbRR3yu2A7VvNnpA/o.jpg"
      }
    ],
    "user_id": "q38wOlIWVCo5wGsPIa_TzA"
  },
  "ujN2x3f7WrZpJMrGJgJQiQ": {
    "date": "8/2/2015",
    "text": "Food was delicious and lovely presented :) had the roasted pumpkin, dolcelatte and sage tart for starter. It was delicious. Then we had aubergine teriyaki and butternut rotolo - the butternut rotolo was divine! And then for dessert we had the rosewater panna cotta and fruit summmer trifle. All was delicious, including the red wine (can't remember which one we chose). Service was 4 stars. The waitresses came round after delivering the food checking to see how everything was, which was hice. Will definitely come back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NLSOq3XvXvv0w7EWiWIL_w",
        "caption": "Photo of The Gate - London, United Kingdom. Aubergine teriyaki",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NLSOq3XvXvv0w7EWiWIL_w/o.jpg"
      },
      {
        "img_id": "g6WSjohrGpr7yIhOtokE_g",
        "caption": "Photo of The Gate - London, United Kingdom. Butternut rotolo - delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g6WSjohrGpr7yIhOtokE_g/o.jpg"
      },
      {
        "img_id": "Q89P1CP_VdzTOEtz2WznAw",
        "caption": "Photo of The Gate - London, United Kingdom. Fruit summer trifle",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q89P1CP_VdzTOEtz2WznAw/o.jpg"
      }
    ],
    "user_id": "c0OAlqgzPXx92ETWR-w5wg"
  },
  "GnXr4lDfPWhHIkPk06BqcQ": {
    "date": "11/14/2014",
    "text": "A visit to the original Gate in Hammersmith has always been a special treat - one that I haven't indulged in for too many years.  I remember saving up for a meal there when I was much younger.  I used to be vegetarian and the choice of decent restaurants was very limited.  The Gate and Blah Blah Blah always stood out.I have since started eating meat again, but I still favour interesting vegetarian over burgers.  The Gate still delivers and I can't wait to return for a full meal soon.  The Islington branch is the perfect match to a night at Sadler's Wells, and I have tickets for another performance in a couple of week's time.Last night we were just after a post-theatre drink - The Gate still looks as inviting as a pub on an Autumn night, and a few seats are available at the bar.  It's advertised as a restaurant as well as mezze and it didn't take much persuasion to order a mixed plate.  Mind you, there was no active persuasion from any of the staff - the bar man didn't even know where the food menu was (it is not at the back of the wine list!) and we had to ask several times until someone fetched one for us.  This seems to tie in with Hina's experience, but I really didn't mind on this occasion.  My friend and I had just experienced such an amazing dance piece and so much to talk about, the slightly dizzy staff did not upset us.  However, it does not go with the overall feel of the place - or the prices.The food was amazing!  Tiny portions of deliciousness, and no hummus or olives in sight!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "kU5JfNWdVKEdSuE3yqCJig": {
    "date": "12/16/2015",
    "text": "I had a perfectly pleasant lunch here. My sweet potato and pomegranate salad was good, could have done with a little more crunch. My friend Jane had the rotolo, which was beautifully presented and she enjoyed the flavours. To drink I had a Sauvignon blanc which was below par, tasted more like a Riesling. Coffee after the meal was excellent, gorgeous rich roast.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ok0-rjyLwQN-maZFqeeDWg"
  },
  "6gbue2fZ_e3K-GJkcarXiQ": {
    "date": "3/25/2014",
    "text": "Ok, I'm not a vegetarian, but I'm a lover of good food. I came with an open mind and empty stomach, but left with nothing but a mushy, unsatisfied feeling in my tummy.Had the sweet potato and beet tortillas. The fillings were overwhelming in mushy, cloying sweetness. The textures were just mush wrapped in tortilla. The beets were better than the sweet potatoes though, but overall, not good.The cheesecake was probably the best part, but on it's own merits, would not hold it's own against a delicious slice of cheesecake.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBIfa3INjAj_z2_amlnq3w"
  },
  "SzFnhl-dmDhugBwm2ooGiw": {
    "date": "9/30/2015",
    "text": "The service is pretty slow but the aubergine noodles are worth it! Try their veggie sushi, too! It's a good place with interesting food, it just gets way too busy on a Friday.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i9ifFkD2ysTOli_azn30QA",
        "caption": "Photo of The Gate - London, United Kingdom. Aubergine noodles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i9ifFkD2ysTOli_azn30QA/o.jpg"
      }
    ],
    "user_id": "HBQ-PMxjmTw2rF6swl5i4A"
  },
  "HfWFl91dj9x6mVr4rxBLWw": {
    "date": "10/12/2013",
    "text": "Went to The Gate last night with a couple of friends. I'm always sneakingly suspicious of vegetarian restaurants, as I almost invariably am disappointed or leave hungry (save a few exceptions, like 'Millenium' or 'Greens' in San Francisco). The Gate fortunately met neither of those expectations: we were delighted, and left very full indeed!The service here is irreproachable. We arrived on time for our 9pm booking, but our table wasn't ready; however, our server told us to go to the bar, and order any cocktail off the list on the house. Now that's what I call turning a potential customer problem into a stellar customer experience! The cocktails were ok, but then again, I'm pretty picky about my drinks... so by and large, pretty decent drink (gin, pepper, strawberries on crushed ice).We all decided to share our starters, mains and desserts, so that we could experience as much of the food on the menu as possible.For starters, we ordered the Courgette Flower, Pumpkin and Potato Cake, and the Green Banana Fritters.The courgette flower had a perfect crunch, and was nicely tucked into a dry, crispy, batter, and it came with a side of lentils that made the dish nicely balanced. Wasn't too impressed with the banana fritters, but the harissa they came with was spot on. The potato cake was the heavier starter, and the stilton came through, but not too strongly, again, showing how the kitchen here is right on top of their flavour profiles and balance.The mains demolished us! We ordered to share: The Aubergine Teriyaki, the Wild Mushroom Risotto Cake, and the Beetroot Canenelloni.The Aubergine was probably the most strongly flavoured dish, and comes chargrilled and layered with coriander pesto, roasted red peppers, shitake mushrooms and horseradish, and is coated with crispy breadcrumbs and served on stir-fried noodles with a pickled ginger and mango salsa. Pretty explosive in taste, and really good.The favourite dish for my 2 friends was the Cannelloni. I was a bit fearful, as I hate beetroot, and anything that uses that word is usually something I don't end up going near. It's essentially a home-made pasta filled with Jerusalem artichokes, hazelnuts, goat's cheese and basil pesto, served on an artichoke purée and finished with salsa verde. This dish was absolutely fantastic, and if it wasn't for the risotto cake, would have been my favourite.The star for me was the Wild Mushroom Risotto Cake. It's copiously served with with pan/fried girolles, pied de mouton, oyster and paris brown mushrooms, with a cepe reduction sauce and finished with rocket and Twineham grange shavings in truffle dressing... Whoa. Amaaaaazing!!!!! The risotto was perfecly cooked, the cake formation slightly crispy but still moist, and flavours where wild and explosive. Really, really good, and literally the dish that pushed me to give this place at least 4 stars.The 5th star comes associated with the level of service we received last night. The wait staff were attentive, kind, humourous, helpful, and went out of their way to help us. When they saw us constantly dividing our dishes amongst ourselves, they'd come with additional plates, spoons or whatever to help. When we asked if the kitchen could set up our three desserts to be shared and equally portioned, they happily obliged. Rarely have I seen this in a London restaurant.Talking about desserts: the Orange marmalade & whisky croissant bread & butter pudding is my favourite, but the White chocolate & baileys cheesecake is worth a detour. The Banoffee pie? Tastes like any old Banoffee pie, to be honest. Good, but could do with some more 'eeeee'.In any case, The Gate is truly a gateway to a truly pleasurable vegetarian culinary experience. Is it high end ? No. But is it good, with a warm atmosphere, no 'phru-phru-posh-BS' ? Absolutely. Go there, and see for yourself :) Oh, and you will leave pretty full and satisfied!PS: The house wine, although cheap (17£), has a bit of a bite; we decanted it into the empty water flask on our table... got a whole lot better ;-).",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iO0IsbzMEaX6GpWisSs50w",
        "caption": "Photo of The Gate - London, United Kingdom. Green banana fritters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iO0IsbzMEaX6GpWisSs50w/o.jpg"
      },
      {
        "img_id": "B6N0E2puJjqs6L_6h4av_g",
        "caption": "Photo of The Gate - London, United Kingdom. Aubergine teriyaki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B6N0E2puJjqs6L_6h4av_g/o.jpg"
      },
      {
        "img_id": "ynP7LoFQF-jbb4CNWGWhzA",
        "caption": "Photo of The Gate - London, United Kingdom. Courgette flower...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ynP7LoFQF-jbb4CNWGWhzA/o.jpg"
      }
    ],
    "user_id": "JTxngs27ELvvzbrwWayVkA"
  }
}