{
  "bMM7OPuSJPGiqqqGSTP_Xg": {
    "date": "3/13/2012",
    "text": "The service is lovely as is the atmosphere and the food and coffee are exquisite!!  Lantana rocks - my macchiato was pure perfection and the mixed mushrooms on grain toast with poached eggs yummy. I'll be back again and again!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RClo74kczgGdoFmN7kq6eg"
  },
  "wUBoNJIPj0clN98VD4Q3HA": {
    "date": "6/17/2012",
    "text": "Reasonably okay. Maybe I just have a particular (Australian) perspective, but Lantana is like a whole bunch of cafes in Melbourne. Which is kind of what they are emulating, but then it has to be assessed on that standard. So, in that particular light, it was fine - nothing special. A bit of an unfriendly, unhelpful service vibe. Food was fine, but again, nothing overly creative or different. Tricky to find, too. Charlotte Place is off Charlotte Street, if you are a bit lost.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EMSKwltPW1HOce1d_0hg5Q"
  },
  "6tyN4LacTicQ8-y2lMvAYA": {
    "date": "7/17/2011",
    "text": "I've been to Lantana a few times, and each time I have left dissatisfied and unhappy.  This time was no different.The Queue (bad)When you approach Lantana, it's not immediately obvious how the queueing system works.  My partner and I walked straight in and asked for a table for 2, only to be told rather rudely that we had to wait outside and someone would be with us shortly.  There was a sign on a board inside saying 'please wait to be seated'... perhaps this should have read please wait OUTSIDE to be seated....Downstairs Seating (bad)The seating downstairs is arranged as one large table which can be shared and a small two person table.  The restaurant operates a communal 'help yourself' tap water system (like many pubs/cafes) with jugs of water and clean cups so you can self-serve.  Downstairs, however, there is no place for the water jugs so if you are unlucky enough to be seated on the small table downstairs, you have to interrupt the larger table to ask for water.The Food (okay)I had the spanish baked eggs which was nice.  A little underdone but had good flavour.  My partner had poached eggs on toast, which arrived with the egg already broken (half the yolk had run onto the toast before the plate arrived at our table).   A little vigilance in the kitchen before serving the dishes would have fixed this.The Coffee (good)We both ordered flat white coffees and they were good.  Creamy and strong but not bitter or burnt.  Not the best coffee I've had in London but certainly one of the better ones.SummaryGood food, good coffee, bad experience.",
    "rating": 2.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-vn5POeWJW_1bVbdCQx9Jw"
  },
  "K7W1eJmqGdJBnPKf_av8MA": {
    "date": "3/8/2012",
    "text": "This is the best breakfast/brunch place I tried during my short London visit. I was getting pretty sick of the standard English breakfast and was really happy to find such an inspiring and creative menu that Lantana offers. The maple french toast + bacon + grilled bananas is delicious. Add a poached egg for just 1,50. Their breakfast sandwiches are also delicious. But the star of the show is their toasted banana bread with ricotta. Add a poached egg to it. It reminded me of my favorite brunch places back home in NYC. We went here three times during our visit and we would have gone three more times if we were in town longer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BUKbteZ8wHfANb3PlDHY_A"
  },
  "r-Lfnm8IZn7OrYZgEMhB0g": {
    "date": "12/16/2010",
    "text": "I like Lantana for some things. Like when I'm looking for a cozy place to study, I go to Lantana. When I feel like being hidden in a little back street in Central London, I go to Lantana. The coffee is good and the atmosphere is usually buzzing. However, I have to agree with many of the posters here- the people working there are just not friendly. They all just kind of look like they don't wanna be there and despise you for being a customer. It makes no sense at all. They don't try to make you feel accommodated or welcome. So... three stars from me. Lantana, please change your staff's attitudes towards customers and CUSTOMER SERVICE- or change your staff. There are many good coffee shops in Fitzrovia that manage to have both good coffee and good service (and remember, after all, that you are a BUSINESS serving and competing for CUSTOMERS).",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Nq9uVNK2RM6ip9lMyIIFbA": {
    "date": "1/26/2010",
    "text": "I thought the coffee was good and the free wifi is always appreciated. Unfortunately they forgot that I paid for my bill and after I left, they charged my friend for it again. I haven't tried the brownies but I've been told that I should so will venture back at some point.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1k7jV3Gt0Us1OINNjAja5Q": {
    "date": "5/29/2010",
    "text": "For photos see the Greedy Diva @ greedydiva.blogspot.com/…  At 10am on Saturday morning, I find myself lying belly up on a purple yoga matt pondering (1) what on earth the strange smell is, (2) why the man next to me is emitting whale noises, and (3) how long it will be before I vomit, pass out or run screaming from the room in a frantic panic attack. \"You must not leave the room for 90 minutes\" warns the merciless Bikram yoga Lieutenant Colonel through a hazy 41 degree Celsius fog of B.O., visibly steaming body heat and dripping with sweat underarm hair. As I concentrate on the overwhelming task of breathing, she suggests that I and Libby, my fellow Bikram boot camper, wave to the room to earmark ourselves as the only Bikram first timers, presumably for the sole purpose of letting the others know which ones to watch between downward dogs for entertainment purposes. I emerge 90 minutes and a confronting communal shower later, relieved of 30 kilos of body fluid, with a traffic light red face, poodle hair frizz and a mildly startled/manic gaze, all of which suggests to Libby she best get me quickly to the nearest source of food. Lantana Cafe beckons. Behind Lantana Cafe is the story of a woman from Melbourne on a serious mission: to show the London public that breakfast can offer more than \"the full English\" or eggs florentine, washed down with a mug of workman's tea. As reported in the February 2010 edition of Olive magazine, Sheelagh Ryan quit her job as a policy advisor to an Australian minister, took on waitressing jobs for free on weekends in Melbourne cafes to learn the ropes while waiting for her visa to clear, and eventually found the site in Charlotte Place that now stands home to one of the most popular cafes in London. The La Marzocca espresso machine was promptly installed, and an Australian style brunch menu was put into action. And so it was that Lantana Cafe won Time Out's award for Best New Cafe 2009. Like for all caffeine oriented antipodeans, for me the key to a treasured breakfast haunt is the coffee. I'll go out for a morning coffee then go home to make my own breakfast if I must. Lantana's flat whites rate up there with the best of London's (select few) great coffee shops. What differentiates Lantana from all of them (except perhaps The Providores in Marylebone, the enterprise of 2 New Zealanders) is its typically antipodean style, hearty brunch menu. I can never go past the grilled haloumi, mushroom, sauteed spinach, corn fritter (slightly charred on this occasion), roasted tomato with chunky, wholemeal sourdough toast. The haloumi is never rubbery or tasteless at Lantana. I dined here on Saturday with Libby and Moira who sampled the alluringly runny poached eggs on sourdough. Also popular are the corn fritters, and the baked eggs with chorizo, mushrooms, spinach and spicy tomato sauce served with grilled flatbread and creme fraiche. Or you can keep it simple with toasted sourdough (with Vegemite - hallelujah) or toasted banana bread with date and pecan butter. The only downside - the hideously long Saturday brunch queue. Enjoy. Just save some haloumi for me.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FOXU5YWfsfijXMnkwCY7TQ": {
    "date": "7/19/2012",
    "text": "We stopped by for brunch on a Thursday, and after about a ten minute wait were seated at a tall table towards the back.  It's a small space but doesn't feel overly crowded.  It's hip but not painfully so.  Servers were nice, and the coffee was great.  Banana bread starter was delish, and the mushrooms on toast was really good.  They had some delicious gluten-free bread that my gluten-intollerant friend really enjoyed.Would definitely recommend it!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85yjmSbuLVXLpxd71x-Jqw"
  },
  "t6eHtjMb1c-fQTb86XeWNg": {
    "date": "10/2/2009",
    "text": "I've been going to this place since it opened.  Unfortunately it now gets quite busy (even before the Starbucks 20m away went out of busines - but especially now).Good food, good value.  Ask for a flat white (an Australian variation on a latte) but best of all try the Hummingbird Cakes.  They have recently been renamed \"Lantana Crack Cakes\" and have about 50% of your daily suggested calorie intake but are worth every bit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9uoIBoRccnmcR8QDXCQhdw"
  },
  "hG22ghE1kkNJSHXdwhx9vQ": {
    "date": "9/4/2011",
    "text": "I went to Lantana today with some friends for brunch. We were 5 and at 11.45am, we obviously had to queue, but it wasn't that long. The lady that got our table and menus and the other guy taking our order were both very nice. One of my friend ordered a Bloody Mary and he said he was going to make it himself because he loved the drink. She said it was very good, so it was a nice touch. One of the flat whites in our order got missing and we had to ask for it again, but apart from that everything went smoothly despite the queue and how crowded was the place.The food was very good as well. Everything in the menu seemed delicious and really tasty, I wanted to try the brioche French toast with vanilla ricotta, but felt like eating something savoury, so I ordered poached eggs on toast with a side of roasted tomatoes. The eggs were perfect, but the toast was a bit too chewy. One of my friends asked it he could have some butter but he never got it (?).Overall, I'd try other places before coming back to Lantana, but this is definitely a good place to have brunch on the weekend if you are willing to queue.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efClwtXiP3r3dC-TBqSO8g"
  },
  "IsKedj9vki0B3UnQCjZQWw": {
    "date": "12/16/2009",
    "text": "Why has it taken me so long to find this place?! Being tucked away in Charlotte Place probably didn't help. Another colony-originating purveyor of coffee the way it's meant to be, saving Londoners from the chains. Perhaps it's a bit too small and homely to deal with hordes craving a quick caffeine fix, but why rush? Sit back and let the anticipation build... your tastebuds won't be disappointed. Top notch banana bread too, although very pricey. Although not sampled, I did spy they also serve bottles of Coopers Ale and Bundaberg Ginger Beer.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfJfowUqaeAWy7xej41RRQ"
  },
  "fZ0SvWffFYl1ixWfmUobTA": {
    "date": "3/8/2010",
    "text": "I love Lantana. I LOVE LANTANA. I lurrrve Lantana, there's no other way to put it. Try the baked eggs or the corn fritters, you won't regret it and hey, I hear the coffee's good too!Video link: youtube.com/watch?v=puqh…",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JhA5addOY9mB-vhHIVvkaw": {
    "date": "10/26/2009",
    "text": "A little shop in Charlotte Place where you can find lunch formulas: soups, sandwiches, pastries and hot beverages. I had £6.50 lunch box including soup, sandwich and a dessert. The warm tomato soup was very good. In the contrary, the sandwich was not brilliant (two slices of fluffy bread with cheese), it was everything that was left. The brownie was so-so as well. A bit pricey for this quality! For the same price (or maybe less), your can find much better alternatives in Fitzrovia. The place was a bit crowded and I felt I've been ignored by the waitors for more than twenty minutes. What a shame! Don't go there for lunchtime...",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "VyZnyWWjtSfuP6l3LSOh_Q": {
    "date": "10/3/2009",
    "text": "Now been there for breakfast, lunch and a quick coffee break so all that's left is to try their new late opening evenings.The food and service are excellent and has a real personal feel to it. It is on the expensive side for an informal cafe but they stress the quality of the ingredients and the cooking and so I reckon it's worth it.Certainly my go to place for a relaxed getaway and a quiet nibble in the area.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "k4IkGntyodekuLBCktuc1Q": {
    "date": "8/21/2009",
    "text": "Sitting here with no bread in the house, I can't help but think back to happy mornings at Lantana. This fresh, Aussie-style cafe might require a wait but it's worth it, for breakfasts that deliver on flavour and, to some extent, healthiness. Don't let that put you off though: you can still get sausages and bacon and other stuff if the wine flu demands it. Personally I'd go for homemade baked beans, the poached eggs, as much of that unbelievable sour dough bread as you can handle and some cups of exquisite - as you'd expect with an Aussie barista - Monmouth Coffee. It's not cheap per se, but you get what you pay for and a late breakfast here will fuel you til evening. On that basis, I'd say it's good value. But the memories hurt when you're hungry and toastless",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "qmPClxRDOYYB-4SVzpRHbw": {
    "date": "6/18/2011",
    "text": "One of my friends took me there for lunch. She say that the place was amazing, so I went with very high expectations. The place is nice and cozy, the coffee was indeed good, scrambled eggs and mushrooms were tasty too, but sadly I do agree with fellow qypers about customer service, quite rude, as if they couldn't be bothered to talk to you... smiling and being polite cost nothing but give so much. I'd try somewhere else next time",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "XWP8DYU6q9IBu7YhH2gklA": {
    "date": "7/31/2010",
    "text": "When i first saw the reviews of Lantana (after having been there), i was quite surprised at the generally positive feelings it generated. My experience was not really the same.Lizzie got quite a few of us Yelpers here on a not so sunny summer saturday morning for breakfast. We were seated at a table outside.Since we all arrived at different times, we had only ordered coffee initially. They came and asked, a number of times, whether we want to order food ... all the while claiming that there was no hurry ... and this when the place was not full.Finally when our friends arrived and we did decide to order, they were nowhere to be found. During the whole breakfast, just getting hold of someone to ask for something was a difficulty. On one occasion when someone did come, he was visibly displeased with the starbucks cup one of us had (it was empty).The saving grace was the food. It was pretty good. I was quite impressed by the scrambled eggs on toast with black pudding that i had ordered. The chicken and corn was very good ... and so was the coffee (though Larissa wasn't impressed by hers). But the price was a turn-off. I understand that its located in a prime location in central London, but £5 for eggs and one slice of bread is simply not on.Lantana wasn't merely lethargic in serving us, they were the same in accepting their payment. After we had waited for a long time for someone to come and take the cash, we were forced to go inside ourselves and pay up.I would have given them a 2 star if i had been there on a weekday ... but on a leisurely weekend when i was chatting with friends, i wasn't too perturbed by their laziness. So its a 3 star for now ... and so it will stay, as i am unlikely to go back anytime soon.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "rYXrYdcukbFvXEZjUpNzVQ": {
    "date": "10/22/2009",
    "text": "Reading the recent comments, I'm wondering if there has a been a recent downturn in service? Having read many great reviews about this place, I was more than happy to try it, when a colleague suggested it for lunch on Monday. We were seated swiftly - albeit in somewhat uncomfortably - my seat was higher than my companion's meaning I towered over him. Odd when you consider he is almost a foot taller than me! Presented with our menus. Drinks orders taken, followed by food. All OK so far. And that's the end of the good news. We were initially served the wrong orders, then we waited almost 30mins for our sandwiches, after we prompted a waiter. Lunch was OK, but way too pricey for what you get. Upon finishing up, I couldn't get anyone's attention to request the bill. My colleague ended up leaving me to settle up as he had another meeting to run to. Eventually it was chucked onto my table. And it was the wrong bill. I had to go to the counter to get it corrected, having failed, yet again, to attract a waiter's attention. Till service was brusque, as if the mistake was my fault. If you've been there, you'll know how small it is, so there really is no excuse for 'not seeing' your customers. I do appreciate that it was busy, but so are hundreds of other places in London. Sadly I won't be recommending this place to anyone else.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UG_2IFuHTuiGZocAhhZkBg": {
    "date": "2/24/2009",
    "text": "I wish they let me choose 3.5 stars.  Because this place wasn't too bad, but I wasn't exactly a fan either.I came here because of Time Out's suggestion for cheap eats for lunch.  Since I was roaming around London for 10 days anyway, I might as well check it out (I HATE London roads by the way, I can't find any streets!!)I finally got here, and it's a cute cafe.  Really cute.  And not 'cozy' like I would use for NYC cafes.  The menu was limited, I ordered a portabello mushroom sandwich.  It was nice.  It did not wow me.  I paid 9 quid for it.    I guess I'm way too used to the cheap eats in nyc, where I can get so much for under 10 bucks that this is just way too blah for me.I went to Gregg's and got a chicken pasty after.  Mmmm....pasties.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87lxO1rLLIQhpSZCddc_4Q"
  },
  "6j02lO7ci2rdiP7Qj1IE_Q": {
    "date": "12/12/2008",
    "text": "I had never been to an Australian cafe, and after Lantana, I can say I've been initiated. The food is spectacular; I had lunch there and had a variety of salads with really yummy chicken skewers in a sweet tomato sauce. My boyfriend had the same only the skewers where lamb, and it was perfect.  Also they do delicious coffee, probably the best i have had in London. The only down side, is that the space is tiny so at lunch time it gets really busy, but its worth waiting if you can, the staff is friendly and helpful and the process very fair.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kWV3-pVsyMaIYoVL-Z_uhQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kWV3-pVsyMaIYoVL-Z_uhQ/o.jpg"
      },
      {
        "img_id": "vVQkkpzf3jzIP-MJ7AGxwQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vVQkkpzf3jzIP-MJ7AGxwQ/o.jpg"
      }
    ],
    "user_id": "eN7dzEJM0yL0NgvAbCYbkQ"
  },
  "UYOAtLPe3LpmlHwcZaU7bw": {
    "date": "11/12/2015",
    "text": "The breakfast here is sooo good! So they don't do full English, but that is nothing I want anyway so for me it's perfect. Would recommend this place before the breakfast club at any time, it's also very cozy and a bit more quiet so great for catching up with friends or go on a brekkie date.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdVvFJKeGLtKHNDe2hygCQ"
  },
  "u8h3wDfdnggrz41s7zltZA": {
    "date": "7/16/2014",
    "text": "I had avocado smeared on toast with a poached egg and ham on the side with some greens, came with a lemon squeeze - wonderful. We also had muesli that came with some rich yogurt and roasted rhubarb which was also delicious. A very small place in an alleyway, simply designed, high cool factor, strong coffee. Wish we would have discovered it days earlier. The food is excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Mk9pa4urkOWEGvfeIpmEw"
  },
  "78195Arn_-Sx4chCYoidig": {
    "date": "7/27/2014",
    "text": "We were looking for \"local\" experience for breakfast on a Sunday morning walking from London Edition Hotel. We found Lantana a few blocks away. We had no expectations. Great brunch menu. All four of us ordered something different. All dishes were excellent. Sat at small table outside. Great service, great food, strong coffee and great experience.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GG4yik25IkPvm3ZnlsJUKQ"
  },
  "OWKYqAZIHFIR5dZLFH-55g": {
    "date": "2/22/2013",
    "text": "service here leaves you something to be desired, but the food is good.  i knew when i came back to london that i would have to get a flat white, and theirs was strong and frothily delicious.for lunch, i had the duck and squid laksa, and my friend had the BERT.  the BERT looked great.  the laksa was good, but i was only given a soup spoon, which is kind of hard to eat the noodles w/.  they didn't provide chopsticks, so i had to use a fork and twirl the rice noodles like pasta.  it was a bit oily, but tasty nonetheless w/ lots of duck meat.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rx7DNBmPPShVjlcQidGuTw"
  },
  "gDIPvrau0A_JoIBN7Z8CzA": {
    "date": "8/26/2014",
    "text": "Many can serve good foods, but not as many can serve a great black coffee!Their breakfast selection is what make Lantana a Lantana. I have been with a group and our dishes were different and perfect.I strongly recommend for a tryout.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hynPeVzgHsrMjCEnu40pNw"
  },
  "tvNfEHW7OvQMOpVQ6-fiDQ": {
    "date": "9/13/2013",
    "text": "Very nice restaurant in a great neighborhood. Gets very crowded. We were lucky to get there early on a Saturday before the busy time. We got a nice table outside. I tried the smoked salmon with creme fraiche. It was very tasty, but was disappointed with their house coffee. Seems to be a local favorite in that area. They also have free Wifi.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A70oyVewZF8ZZSlVM-_7Fw"
  },
  "Vbnd5XNMxGnCU5qu08h8OA": {
    "date": "7/17/2010",
    "text": "I met up with the Yelp Breakfast Club at Lantana this morning. It's tucked away on a little side street just off Goodge Street in Fitzrovia.We sat outside, hoping to take advantage of some sun peeking through the clouds - it is summer after all, you know!The breakfast menu did look inviting with a mix of good old traditional British fare (black pudding anyone) through to more American style brunch items. As I was planning on an early lunch, I passed on the food and got a freshly squeezed OJ for £3. I did however try bits of other Yelpers' meals, the best of which was some banana bread.What kept this visit to Lantana firmly in 3 star territory though was the amazingly sloooooooow service. It wasn't busy but trying to flag down servers was agonisingly impossible. I've read other Yelp reviews saying that the wait was long when it gets busy but it wasn't busy this morning.However, despite that, the wonderful Yelp company was entertaining as usual. Lovely to meet Deborah G and of course, the core of the London Yelp Elites. Let's meet somewhere else next time, guys!",
    "rating": 3.0,
    "rated": {
      "useful": 10,
      "funny": 5,
      "cool": 7
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "BN4NTsYYw4f4ARvawRqfFA": {
    "date": "2/3/2012",
    "text": "Lantana is one of my actual regular favourite cafes/coffee bars. I have been there since it's inception and have been thoroughly impressed by it's service, coffee and food through out.The seating area can get ridiculously busy as there is a lunch rush, but fortunately I'm not a 9-5-er so I've never fallen prey to this. Inside it is true that there could be a slightly more homely ambience...Flat Whites are splendid and their cakes are delicious. French Toast is divine.Try it out!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MjE-1lwwmtO3g0sOoug_ZQ"
  },
  "nkyVa-ZFr2F3Q8n-XKURgA": {
    "date": "4/10/2011",
    "text": "Lantana is another great place for a coffee and something to eat in London. I enjoyed a cappucino, and then when I became hungry I opted for scrambled eggs on toast with a tasty fresh orange juice. Does not sound impressing, but it is. The bread is really (!) good! Even the pepper on the table tasted excellent. There is also some seating outside available, what could be nice on a sunny day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TNOawJ5EBL8PRBN5_Rwa4A"
  },
  "FYae80MRnyeJAdaOxQRmRw": {
    "date": "9/16/2010",
    "text": "Definitely good coffee...not sure I would trek across London for it, but if I'm close, would stop here versus anywhere else.  Missed breakfast, so will go back and give that a go too.  On a mission to find the best coffee in London; so far still addicted to my local coffeeshop...Staff was super friendly and good, chilled vibe and banana bread was yum",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4by2v3Yn0h6FSJUSAfwd1g"
  },
  "RiHxAbKaphd8prGVz4umXg": {
    "date": "12/1/2010",
    "text": "I don't want to alarm anyone, but I think this place may have seen it's day.  I don't know... something about the food has just been a bit--'off'--the last couple times I've been.  The corn fritters were burnt the first go 'round.  Last weekend, it was the BERT sandwich... not enough aioli.  Hmm... what's going on here? London can't afford to lose a weekend breakfast place!  C'mon Lantana!  Step up your game!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l7lSiBklNNdbu-QE3B96fA"
  },
  "Exqlx54gKRjh5VsJUhRriA": {
    "date": "11/3/2010",
    "text": "I only ever really go to Lantana for coffee to take away. It's been excellent nearly every time and my colleague and I refer to the lovely girls working there as the Sirens of Lantana as we find it difficult to resist the attraction of the fine coffee. Lantana does have one minus point against it though, and it's quite a big one. I went there and sat down with a friend who had a terrible espresso. We complained and were given another one that was equally bad, but the person serving proceeded to try and give us a lesson in espresso. We both know how espresso should taste, and this was not it. She then tried some herself and agreed with us that it didn't taste right, but we still had to pay for it which I thought was rather cheeky. Lantana only gets 3 stars because of this infraction. It hasn't stopped me from going there, but they need to do better with so much competition in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cue1uXN_0nIQGX-4J7b_BQ"
  },
  "_L7Pt2EwUzY3b93dDCaGwA": {
    "date": "1/3/2011",
    "text": "My friend used to live right across Goodge from here and has been looking for a good Brunch place in London for God knows how long. He finally found one! On my latest London visit, he was uber excited to share Lantana with me. It was packed when we got there at around 1 on a Saturday. That's to be expected. The restaurant is a nice space, just a bit awkwardly laid out, which is very apparent with it's crowded. The food choices all looked wonderful and it was tough for all of us to decide. I ordered the poached eggs with harissa minus the chorizo. It was simply wonderful and fresh. Two of my eating buddies ordered the french toast, which was very sweet and very very good. I don't think I could eat a whole plate, personally, but if you have a sweet tooth... Service was on point when I was there and we were in the mood to linger and catch-up, so that worked in their favor. Nothing to really complain about except the layout of the restaurant and the lack of warmth closer to the front of the restaurant in the winter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7QvDBjYGPyITqTWiO02aaw"
  },
  "U-arbfHPzeZXPuVcucwOeg": {
    "date": "4/7/2010",
    "text": "I'm not sure what all the hype surrounding this place is about.  I travelled from afar during my lunch break to get some good-old Aussie-pulled espresso and found a Lantana sit-in establishment and a Lantana takeaway estalishment.  Of course, I walked into the sit-in establishment only to be told I needed to go to the shop next door (which had just opened a couple of days prior to my visit) for takeaway.  So popular that they had to set up a separate shop just for takeaway business?  Excitement: I was filled with it.Okay.I went next door.The two girls working were Australian and nice enough.  But they were terribly slow.  I wasn't waiting in any queue, yet it took no fewer than seven minutes to receive my long black.Fine.I went to walk outside and some woman behind me who wasn't looking at all at where she was moving bumped into me, which spoilt the crema on top of my long black.  Curses!But not Lantana's fault.And so the imbibing began.  My long black was nice and hot.  But it was merely innocuous.And it was £2!I don't know where Lantana gets off charging £2 for a long black, but that's just excessive and strikes me as very too-big-for-boots, if you know what I mean.For the coffee, which is the backbone of any cafe, I'm going to have to pass.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "AVn2pVZDZAqcuY6nCYDiLA": {
    "date": "2/10/2010",
    "text": "45 minutes queue - fact.  Worth the wait? Standard Aussie brunch and while a good flat white can often be enough to force me on a long foot tapping wait, I had a large problem explaining the others behind me, though hummingbird (like it or not) has the same unexplainable affect on this town... (they also offer hummingbird cakes).  I had the poached eggs which were clearly over-poached and about 3 eager servers dropping by 20 times during the 10 minutes we'd been deciding between bubble, fritters and french toast.  Everything tasted just about the same. Coffee - great, service -  (over) eager, price-reasonable.  I'd queue elsewhere for more flavour....",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "FXBQuV96KKwdSbk5tXH3JQ"
  },
  "OLDTT4gX95juKbOo0sUf8A": {
    "date": "1/17/2012",
    "text": "I've been dying to go to lantana for AAAAAAAGES and I just hadn't found the right company to go with until last week. So 4 others and I rocked up for a lazy saturday brunch post exams. (We don't usually blow our student budget this way...wait..I think i do. LOL)If Australia is all about brunches, I WANT TO GO NOW. :DI expected there to be a queue and there was. We waited around 20minutes before we were seated and we were given a small table usually set for 4, but it's okay, we're 3 asian ladies so we even had room spare. :D I've been reading so many reviews and the main thing that I been dying to try was the baked eggs and i finally managed to. It was really good, the sauce was good, the bread was good, if only the eggs were runnier, I think I would have died and gone to heaven. My friend also ordered the same dish and he agreed that it could've been much runnier. In total, we ordered steak sandwich which looked amazing, poached eggs on toast and also a banana bread with blueberry whipped butter which is on my to eat list next time I go. Another thing on my to try list for next time is the flat white (i've been hearing rave reviews and i had a dodgy stomach on that particular day so i stuck with lemon ginger tea which was FILLED with honey!) My friends tried it and they think it's one of the better coffees around London. Also, I've never been to Aussieland but the people I ate with have and they really felt it was definitely an australian cafe. Success on Lantana's part! Service was very friendly, from the door to the end of the meal. I was expecting to have food staggered, esp after reading reviews here,  but surprisingly even though they were busy, all the dishes came out at the same time. So can't fault them. I'll definitely be back...when i don't have a student budget.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "AD7GPuQOiQ84W7032bvSGg": {
    "date": "1/30/2010",
    "text": "I am a huge fan except for the queue, but I'd say it is worth the wait (about 30 minutes at peak time).   Lovely coffee and great food which makes for a wonderful Saturday brunch.  The menu is filled with things like poached eggs, corn fritters and bubble and squeak with a fried egg, chorizo, buttered sour dough and rocket with tomato chutney (big fan of the chutney)--that is what I had, and French toast with pistachio marscapone which smelled out of this world.  And they have hummingbird cupcakes if you have room (which I didn't).  They have upstairs and downstairs seating, and it just gives off the air of a place where you want to sit with your friends, have wonderful coffee, yummy food, good service and a proper catch-up on the weekends.  Another drawback is that you need to go to the counter for water....that was a bit annoying.A+.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "wZ9WYyfhuaR32DYGXz3DZA": {
    "date": "10/28/2009",
    "text": "I am not sure this could get much more popular. I am not sure why people would be happy to queue for an hour or more to go to a brunch place. Lantana apparently drives people to such madness... Another of the Australian brunch places. Loved by Time Out (I suspect because their offices are close). I am not sure what distinguishes it from its other, less popular brethren (or mates) as whilst the coffee was good the food was less so. The dishes we all ordered suffered from what I am beginning to recognise as a typical Aussie food problem - textureless mono taste blocks is what I shall call it. The food is lightly heated, it melds and pools together, the toast has no crisp, the fritters no carbon. Blah. So whilst it may be good and nutritious it is also akin to baby food not a real distinct breakfast. That said, it is busy, its independent, the service can be great or terrible and it looks cool... Price - £2.20 for a flat white and up to £10 for textureless mono taste blocks",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GgwkjH57TdhrCocAGHhqRA"
  },
  "0k5ywV57eu9B2aHLUzMsGw": {
    "date": "11/8/2009",
    "text": "Yes yes yes!Another place that does that awesome coffee with the pretty leaf design on the top!I now work within a triangle of these wonderful places (am holding out for a pentangle, then the fun can really begin!).Lantana is small but feels airy due to the light colours of the walls and the stripped back feel of the place. You can purchase the art/photography on show (Though I struggle to see why you'd want to; has anyone ever done that? I mean for real? Bought a picture they found in a pub/cafe, write to me if you have or know someone who has, I must study them!).The main event here is the Aussie style flat white coffee, although I can say with some authority that their brownies are good too. Be aware though, that they do contain nuts... sweet sweet nuts!Their coffee is cheaper than the other 2 places I've been and you can sit outside on the heated terrace on Charlotte Place and feel very bo ho whatsit thingamy... it just feels good ok, I don't know why.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RN2GUySYObl5_ytPbxIz3A"
  },
  "4R1JoKkNYM4CWYawebBnkQ": {
    "date": "2/27/2011",
    "text": "Try Banana Bread And Hot Chocolate with Sambuca. It tastes heavenly. Lovely atmosphere and great food as well.For lunch I had Spanish Style eggs ad they were great. I definitely recommend this place.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9x-VVLe2OXvKup6ebwFU-g": {
    "date": "8/8/2013",
    "text": "This is a solid choice for a breakfast/brunch spot in the Fitzrovia area. It's a small, cute cafe with some tables outside and a cozy/charming interior. The menu is decent-sized with items that represent classics but also some dishes with a bit of flair. Their coffee is top notch as well. I recommend the smoked salmon with poached egg dish or the corn fritters with avocado lime salsa.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1ZvE7muOisfVUgnz9NxlA"
  },
  "llBTnE6h_nD_eTsXb955Xg": {
    "date": "3/20/2013",
    "text": "I came here for a nice catch up over lunch and found the space a bit cramped but the drinks and food delicious. I had the special of the day which was a hummus and pita dish with an egg on top. The wait staff were nice but the space in there was a bit cramped. A very tight fit.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "vSkDxq2nngh8l77qfEvuCA": {
    "date": "6/30/2013",
    "text": "The best thing about Lantana is the coffee.  My wife had a black Americano and I ordered a flat white for before our meals.  My flat white looked like it was crafted with care and it had a taste to match - just as nice as any other that I have tried here in London.The brunch menu offerings were also good.  My attention was drawn to the toasted coconut french toast with ricotta, lime syrup and pistachios, so I ordered that.  My wife chose scrambled eggs on sourdough with sides of mushrooms and sausages.  When I got my meal I first noticed how thickly sliced the toast was. There was also a generous dollop of ricotta on each piece. So much food that I thought it may be a struggle to finish it.  So it proved, as it was a bit too much sweet stuff to eat at once. I helped my wife finish off her toast to get a savoury counterbalance.When you turn up, make sure you get someone's attention. It's busy, so you might be waiting by the door for a while otherwise.  It looks like a trendy place and the conversation and activity makes it seem louder than the average place.Total cost for our two meals and two coffees was around £28. Seems normal for London prices.  They didn't take Amex, which was too bad for me.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "mAjVbhlmeoM7NkdX2VRmSA": {
    "date": "8/14/2016",
    "text": "Awesome food!! They have hit the nail on the head with the \"inspired by Australian brunch culture theme\". Legit feels like I am in Australia. I am only disappointed I couldn't fit 2 dishes in because everything looked amazing!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahvoUAh61Rg47jZ1VMjzXg"
  },
  "8czkknon_rpzoqwNPj-RSw": {
    "date": "8/27/2016",
    "text": "Excellent place for breakfast. Would have gone here every day for breakfast if we didn't want to explore more of London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sql438uW-5gE-0YNkrLsSw"
  },
  "e1k8jTbkWfQIOR7IzyOO5Q": {
    "date": "6/13/2016",
    "text": "Rude and close way earlier than listed. Be careful arriving after 5. On the other hand-- plenty great spots all around.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fac2ymxeYW7tu6ysUGzaNw"
  },
  "YHqIz0tMER-yXg_o9s3Vog": {
    "date": "4/28/2015",
    "text": "Cheeky little lunch spot in Fitzrovia. Try the chicken and two salads - it's delish!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8i88aes8vg0rDvE-kAgxQ"
  },
  "pEvxqcfP-fT8yKim6o6Fmw": {
    "date": "8/9/2015",
    "text": "Very good food. Corn fritters are of a high standard. The service however was unimpressive and we werent treated very nicely.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egmLBLfdcWtT1dfxJ5n8qg"
  },
  "_14bDJjRfFPdHOgmZ4avow": {
    "date": "2/22/2014",
    "text": "Nice coffee but the place is tiny and service is not tip (border rude sometimes).Would not come back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vZj87sda0MJg94GgYridYg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vZj87sda0MJg94GgYridYg/o.jpg"
      }
    ],
    "user_id": "jklhtM05Bu_XeQQJt07XPQ"
  },
  "vYlJr4mw5d3p4uCM_c-fVA": {
    "date": "7/18/2012",
    "text": "Quite good quality food and service but both are victims of it's own success. Poached eggs taste like they're poached with vinegar so not the best taste/ texture. For brunch there tends to be long queues, which aren't worth it.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tgkyt49FizbwN9tx-N8d1A"
  },
  "kdp5RzGLRxgtfc5r8jS4Cg": {
    "date": "3/14/2016",
    "text": "Grabbed a bacon and egg sandwich from the \"out\" side of the establishment and it was probably my favorite breakfast item during my stay in London.  Note for the uninitiated, there are 2 Lantanas: the \"in\" which is a traditional eat in restaurant with full menu, and the \"out\" which is a to go counter with a very limited menu.  I'll have to try the \"in\" route next time around.  Highly recommend this place for breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FiSgR0xkYCBQ-HunOFWf9Q"
  },
  "uP8aiOMY8biF15zW_cyfSw": {
    "date": "3/5/2015",
    "text": "Great coffee, great location, very pleasant place. First time: I got there 14:45pm after the big crowd had dispersed and it is cool place to sit and catch up or meet in a very central location with brilliant machiato coffees.UPDATE - Second visit: 8 May 2015: More excellent coffee, light and great space for good discussion, tried the beans and hamhock, with a fried egg on top - really delicious food, left me feeling well fed for the rest of the day!  Recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Z5qeWvGJcGPgeFmn_RCDQ"
  },
  "UbGsjrnswkyI8r3ZK6934g": {
    "date": "6/4/2012",
    "text": "When my favourite lunch spot in the area closed earlier this year, my friend and I decided to give Lantana a try. I was apprehensive at first - it looks a lot like every other demonstratively independent coffee shop, who in their attempt to be special all end up being the same. But fear not, this place may not be radically different from its peers, but it is quite good at what it does.We grazed our way through the menu and were never disappointed. The confit duck leg is probably my favourite, but they've also hit a few high notes in the ever changing array of quiches and salads. Or should I recommend the burger with beetroot? Or the fish cakes...? It's a hard choice among some solid lunch classics.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FSCQerDVYIbgPqXoS-d0TQ"
  },
  "oz4SXDi0erB1JZPXuJVELg": {
    "date": "3/7/2012",
    "text": "As you stumble through the crowds of shoppers near Goodge Street, take a breath of fresh air (and great tea) at this little secret.The Lantana Cafe will supply you with a cool and comfortable setting for you and your friends who struggle with the shopping shakes a place to hide from the crowds. Great quality teas, brownies and cakes I would easily eat after every meal, lovely surroundings, and some amazing staff you cannot go wrong. Now I will admit you may find your delicious beverage a bit more expensive than a chain, but you are paying for the atmosphere and some funny and keen staff.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_b3lE0Xlu4snteeFaVcTlQ"
  },
  "HEPCwQDsfg9_-Kfbu7EOAA": {
    "date": "5/27/2012",
    "text": "Sunday Brunch. My favorite meal of the week.15 minute wait - not bad.  Decor is simple but interesting. Just like the food.Iced Latte w/honey. Perfect.Bloody mary.  A brunch must.Baked eggs w/spicy chickpeas, mushrooms, and turkish bread.  Best part - the turkish bread - wish there was more.  Also wish the chickpeas were actually spicy.The boy had an egg sandwhich.  Loved it.Banana bread w/ricotta for dessert.  Because why not have dessert at brunch?  Delicious. Moist. Banana-y. Nailed it.Yum.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Bc_hZIB-Yhorc1ZjLYZKOQ"
  },
  "Ju08gzz-neaf4lcOe2XyMw": {
    "date": "4/15/2010",
    "text": "My sister and bro-in-law love this place as a breakfast/brunch spot, so when my wife and I were in town they decided to take us there.There was quite a rush when we went, which was around 1130ish in the morning.To be honest, I didn't order anything but a \"smoothie\" which apparently here is some orange juice mixed with some peppermint. I'm used to a different kind of smoothie in America and thus was not expecting this concoction.It was okay, mind you, but just not what I was looking for.My co-inhabitants enjoyed their food but it didn't really whet my appetite (okay so blame me I judged the book by its cover & didn't try any of the food!).Perhaps on another trip will I try out Lantana once more.The staff is VERY friendly though and the overall environs were neat-o  =)",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-qBdY8tMxrygPDku4Ca0w"
  },
  "_kncweGsXZAt4QM0CtWIyA": {
    "date": "9/2/2014",
    "text": "This is one seriously good breakfast. All the healthy and/or foodie things you want and a perfectly cute little place to go with the food. Very helpful hipster wait staff too.Museli was killer and the coffee is the real deal. For this tourist, it was just the thing to fuel a day of sightseeing.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyjBMVB_zE5K4xFNT74etA"
  },
  "oOCGpO82Rm3jYlTs3_RePw": {
    "date": "2/5/2012",
    "text": "I love you Lantana. I didn't know if the queue would be worth it. It was. Maple french toast... corn fritters... yes. yes. yes. yes. yes. ...when harry met sally sort of yes. And they have Gail's bread. You know how I feel about Gail. I'm falling in love with Brunch again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "QdvZqfEJMvOpeWjMQWx1Fw": {
    "date": "7/15/2011",
    "text": "It's summer and you're in Soho (well okay Noho) and you're craving some brunch. Head over to Lantana for some alfresco dining and tasty coffee. They have a great selection of breakfasts with a veggie option and friendly staff. It's not cheap mind, but pretty tasty. The whole place has this cool London feel about it without it being hipster. The coffee is solid but nothing to write home about and the food comes out as and when it's ready rather than all at the same time. It's informal, relaxed weekend dining.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "sZ0Qxjn12H8jjHBPLQW32w"
  },
  "TXBHrUY-W3eYhfHe2jQksA": {
    "date": "9/27/2013",
    "text": "Perfect casual spot for breakfast. The coffee is excellent and the food was delicious. We tried the granola, the hot smoked salmon with two poached eggs on rye and the corn fritters. All were very tasty and I would try the hot smoked salmon dish and the granola again, any day. Come early as the place fills up by 8am.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iZqBMNp2kYSgCweinW6U1A"
  },
  "b3hmVuhL1RuZ3EZaCqaGmA": {
    "date": "9/10/2015",
    "text": "Yum. Cute cafe to eat and get yo coffee fix in the morning. Unfortunately when I went back in August, there was construction going on outside so it was a litttleee bit noisy. But the food and the drinks made up for all of this. My mom's a simple person and ordered scrambled eggs and toast. Those scramble eggs looked SO delicious. Perfect combination of solid and liquid. It just made us want the rest of us to give up our fancy plates just to eat hers instead.Beet stained smoked salmon - Not sure if the states don't really have this or I've never seen it but the salmon was BRIGHT red. A little off putting but tasty nonetheless. Corn Fritters - Yum, delicious, perfectly fried and slightly burnt. Banana Bread - Beautiful to look at, sweet to eat. If you've got that sugar tooth this is the plate for you.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WxDjVi22egcDWxpR0Q8VmA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Scrambled Eggs on sourdough bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WxDjVi22egcDWxpR0Q8VmA/o.jpg"
      },
      {
        "img_id": "qvkvmXomm9Oq9SrZLCA6XA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Beet stained Salmon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qvkvmXomm9Oq9SrZLCA6XA/o.jpg"
      },
      {
        "img_id": "39bDhmMtoi8L38WLuFKAQg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Corn Fritters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/39bDhmMtoi8L38WLuFKAQg/o.jpg"
      }
    ],
    "user_id": "rEsijGi21VI6xbF8A5ZkKw"
  },
  "QPi4PpkF_N8ItF_3cZpMLw": {
    "date": "7/3/2015",
    "text": "Absolutely love this place, could not recommend more! Cute little cafe in the heart of Fritzoria. A couple of places outsidee, so if your lucky with the weather and the place isnt too busy, its wonderfulAmazing breakfast place - but you know that kind of breakfast place that suprises you with courgette bread and corn fritters for example. Not your standard egg benedict... Great place to try dishes that are slightly more different, slightly more adventurous. Only problem for me they dont take reservations, so for brunch at the weekend you will have to queue - and even for someone like me who doesnt like to queue its well worth the wait!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-66vlhEXunonT5jN6Y5W8Q",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Corn fritters!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-66vlhEXunonT5jN6Y5W8Q/o.jpg"
      },
      {
        "img_id": "e7Uza5nmWarhU2yGiH_oGg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Wonderful courgette bread, with out of this world sweet chilli jam and some grilled hallumi. Fantastic combination! Must try!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e7Uza5nmWarhU2yGiH_oGg/o.jpg"
      }
    ],
    "user_id": "vqLOXI3OMXGswm09ijyt1g"
  },
  "Lg4voWgfAy-w_vW6f1PHdg": {
    "date": "11/22/2016",
    "text": "A quirky menu of corn-based breads and pancakes is a treat for brunch. They also do some of the nicest and I think reasonably priced Bloody Marys (6.80).The only downside is that it's inevitably busy and the staff is a tad rude. I expect to be welcomed with a smile, not blunt questions and impatient sighs. Guy with the beard, I'm thinking of you.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYwKBtpBGNC9vqtsUzK26w"
  },
  "S3XI_tYV0MyrTBHXDMKj9w": {
    "date": "11/7/2014",
    "text": "Wowww what can I say about his cute little Aussie place. The breakfast menu is amazing! After spending a good 15 minutes looking through the menu, both myself and my friend decided to go for the grilled halloumi with courgette bread. Perhaps a little on the pricey side after 11ish pounds, but after taking the first mouthful, I had no qualms about the price tag. It was a delicious mix of salty and sweet. Best breakfast I've had in London by far. After hearing how good the cold brew was. I couldn't resist sampling that either. So good, would definitely recommend it.Unfortunately, as I've seen on most reviews, the service left a bit to be desired. But, whilst the service could be improved, don't let that put you off visiting, the food is enough to make you forget about everything else.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QCoRckM2pM639rcVPM3fSQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Australia comes to London. Courgette bread, halloumi, chilli jam, runny egg.. Yum.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QCoRckM2pM639rcVPM3fSQ/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "3G0RxiaxWpBXUzEZeV85aA": {
    "date": "12/11/2015",
    "text": "So you won't hear anything too new from me - at almost 100 reviews at the time of my writing, Lantana has been \"found out\" for better or worse - mostly better I think.  My addition to the dialogue is in the better category.  Good food and coffee.  A clean and unique space stuffed into a fun cut-through.  Only quibble is that there is simply not enough space to work.  I'm a writer, but I'm not a spread-out-all-over taking-up-a-whole-table writer.  I often just use an A5 notebook and a pen.  You can stay as long as you want, but if you want a workspace, this isn't really it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UVUIi0q38pAvsfuEEppe0Q"
  },
  "gr2SnWhNBsBlR3uIHuFkTQ": {
    "date": "2/13/2012",
    "text": "Oh Lantana how I miss you so. Why must you be half way across the world from me!?I was visiting my friend in London and he took me too this cute little quaint spot. The best breakfast I had in Europe was here, the Toasted Banana Bread topped with Labna was out of this world! So good that the following day, I took my other friend (from Australia) for the same breakfast. Pair it with a poached egg & a flat white and I was sitting on cloud nine. Fresh, fresh, fresh! I miss everything about this place. The staff, the location, the decor, coffee, the food, & pastries! I will be back... next time I am in London that is....",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Wy4HdmrrPOUh_hnRhpEbrA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Toasted Homemade Banana Bread topped with Honey Blossom Labna",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Wy4HdmrrPOUh_hnRhpEbrA/o.jpg"
      }
    ],
    "user_id": "5fX9IC0SYx6oivxms2yKfQ"
  },
  "cfvfviu9LebHBnxcyR6Mkw": {
    "date": "10/16/2015",
    "text": "Lovely little spot off the main drag. I met some friends here for a bunch on a Monday. These were close friends I hadn't seen in years, so clearly we were in the mood to settle in, drink loads of coffee and catch up. I had the Smashed avocado & streaky bacon on sourdough toast with poached egg & rocket. It was delicious, the avocado was on point, perfectly ripe and melded so well with the egg and the halloumi cheese. Ambiance in the Lantana is very relaxed, although even on a Monday at 11am it was packed! Only thing I would note is the service was on the slower side, it took quite a while to get our bill, but I think that had more to do with a lack of servers. Who would have thought it be so busy on a Monday! If I may suggest - get on the cappuccino or late roller coaster ... they were phenomenal. I live in the States and frankly even in NYC you can get some pretty shit coffee, but maybe because of the beans or just the skill of the barista, the drinks were top notch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAGrXMLdr0V1GQSlIQzvlA"
  },
  "K_gehkUeC6nrswP3M8GU-g": {
    "date": "10/28/2015",
    "text": "Every dish here is GOOD, but they have this one French toast maple syrup bacon extravaganza thing that is a taste bud rave like you won't believe. It is pure gold. I mean, writing about it right now is making me a little emotional... it's gold, people. The place is tiny and so be prepared to wait a solid 15 mins for brunch, but the staff is quick and helpful, so it's worth the wait. The french toast people. Seriously, do not make me repeat myself. The French Toast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2a_aCbw4L4xDR8bnm3S0A"
  },
  "wfcbhvKaefHWrNvxuAW-xg": {
    "date": "1/26/2014",
    "text": "Nice cosy little cafe, always buzzing so it's best to get in early during peak hours if you want to get a table. The banana bread is really good and portion size much larger than I was expecting  Enjoyed my flat white as well. Warm minimalistic interior decor, which seems to be the trend these days.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H22JsT1-3HmvemRgTPnOpg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Flat white",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H22JsT1-3HmvemRgTPnOpg/o.jpg"
      },
      {
        "img_id": "dqTkfrjANR2PBMsb3ScXYw",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dqTkfrjANR2PBMsb3ScXYw/o.jpg"
      }
    ],
    "user_id": "hN2TXswf4IAW87d6imqFFw"
  },
  "nwvwdTClAOVbM9xtUgNNkw": {
    "date": "10/30/2016",
    "text": "Fantastic place, the food is really good and the pastry is fantastic. We had a banana bread and it was veery good! The brunch is very nice, has lots of options! It is always super busy, so get ready to be in a queue for at least 20 minutes for brunch. But I must tell you it is worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zAQS_l-OOwEOF7xcqtVAzw"
  },
  "owP09QkFnFiO-7G4Bz8GJw": {
    "date": "10/20/2013",
    "text": "Be willing to sit wherever they can fit you to have this food!  Even if it's above the staircase at a fold down table. The wifi password is on the chalkboard.Try the flat white. Carmelly espresso made with care.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NoZcwhWEKXhGrG3pgW1GzA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Banana bread from the counter for dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NoZcwhWEKXhGrG3pgW1GzA/o.jpg"
      },
      {
        "img_id": "N_hpznfJ7q0OQf7kU6tdhQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Salt beef hash with poached eggs, spinach, rocket & tomato jam",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N_hpznfJ7q0OQf7kU6tdhQ/o.jpg"
      },
      {
        "img_id": "PQQu17JAA0aVRQbnlkjGXQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Best flat white in London",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PQQu17JAA0aVRQbnlkjGXQ/o.jpg"
      }
    ],
    "user_id": "oNDAHXeuC1wgmPGcYuY9ZA"
  },
  "R33KB5hpvE7PmKzmkSNvog": {
    "date": "2/21/2016",
    "text": "We chose the carrot cake for dessert.  It's a really moist, nut-filled cake topped with cream cheese icing and more nuts.  To me, cream cheese icing is a must for carrot cake (and red velvet); regular buttercream is just wrong.The carrot cake is served as a healthy slice and being moist is pretty filling.  Since I like a moister carrot cake, I really liked this one.We had lunch, dessert, and coffee here and would recommend Lantana highly.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Z2VkPJpOcBdSbxGKRY8Nw"
  },
  "SBjnJ-FglD84mWLF8iRAbQ": {
    "date": "4/6/2016",
    "text": "Really good week day lunch, but I wouldn't bother lining up on the weekend. Have the avo toast with some haloumi.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bcHYw1g8-52Fe1Dkvl9M7g"
  },
  "YtlhBsUpU-ywI3NrJnjYuw": {
    "date": "4/3/2015",
    "text": "Good brunch menu.  We had the avocado with poached egg on sourdough bread. Very tasty.  The place is very cramped and if like us, you are sitting next to a rude individual who has sprawled all his personal belonging and looks at you with total disgust when you ask to move his things, not fun...Cappuccino and lattes could be hotter. Ours were luke warm. This place could do better.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2J-gl_3T2uhPpM9arlRmVQ"
  },
  "lEJWkMJEUU-TPETwRo2Hmw": {
    "date": "3/8/2012",
    "text": "This review is for the take-away spot.  The young women behind the counter were friendly in a way that those at Tapped and Packed can't seem to manage.  That put me at ease.  The salads, one with endive and one with chickpea, looked fresh and appetizing.  I ordered a piccolo and a righteously dense, home baked-looking, chocolate-nut biscuit.  The total price for my mini nibble was 2.80.  I took my bounty outside, sat under the shop's awning and watched the rain drizzle down.  My only beef is that they serve all their product in disposable containers.  The size of the space also means that three's a crowd and I could image that Lantana becomes a cluster-eff with people crammed in there during warm weather stints.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CPR7gdg-UXNDwTVv0HQcgA"
  },
  "6rlokOBHiXlspq2BE32RPQ": {
    "date": "9/22/2015",
    "text": "Oh man, the avocado on sourdough toast here is probably my favorite in all of London (in my top 3 at the very least!) The coffee is spot on too, so there is very reason why London has claimed this as one of the best spots for breakfast in the city. Everything is done well and presented with care, so it makes you feel as though you're eating somewhere with a much, much higher price tag.   The staff are mostly Aussies (maybe that's changed, but it's not a bad thing) they're super friendly and always willing to accommodate any food allergies etc.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PUjCjl-h44JjtMZfdO7LWg"
  },
  "PVQWZmAXDzvnqHUFrAkGQg": {
    "date": "1/27/2014",
    "text": "Found this lovely little Australian run cafe accidentally while walking around Fitzrovia, and so happy I did! Very cosy inside so would only suggest taking a small group. We ordered the french toast & vegetarian breakfast which were both delicious. I felt like genuine effort and care had gone into our meals, the flavours were amazing, yet both were served quickly. The staff were great, very attentive but not pushy at all, we had a very friendly waitress from New Zealand who was great. Will definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RbVj3RkLc_Mihh2X_uRtJw",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Best vegetarian breakfast. Courgette bread, poached egg, rocket, haloumi & chilli relish!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RbVj3RkLc_Mihh2X_uRtJw/o.jpg"
      }
    ],
    "user_id": "Sv5kkZXq0kajtvIOdBcoYg"
  },
  "Ctfzf_RCL4JBWi8jRIgd-A": {
    "date": "10/7/2011",
    "text": "Perfect lunch spot.  Corn fritters with grilled tomatoes, creme fraiche & bacon complete hit (8.50) the tarte of the day comes with 2 side salads (9.50) soup of the day, cream of mushroom iwth sourdough toast (5.50) and the grilled trout salad (8.50). all very tasty, and although very busy at lunch time, the food came out as reiterated by other yelpers, in a staggered fashion.. i.e. whatever was ready first.  No problem with that.my cornfritters were exquisite, and so were the rest of the dishes... so good my colleagues thought there wasn't enough...probably right... we got chai latte (with honey) but really it was just chai leaves in hot milk with a lil bit of honey... not MY past experience with chai latte, so that will probably not be a repeat.Total bill for 6 (3 soups, 1 tarte with two salads, 1 corn fritters, 1 trout, 2 chai lattes, and 1 hot chocolate) = £58 (with 12.5% gratuity included).lovely spot on charlotte place, with outside seating, indoor, and downstairs seating.  Staff v friendly and bathrooms were in order with plenty TP :) that is always a plus.I will defo be back!g'day everyone!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bwjsMjNnA1fMCFstMCdjig",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. corn fritters with bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bwjsMjNnA1fMCFstMCdjig/o.jpg"
      },
      {
        "img_id": "bg9MS-A7MC6KiPhU2VtZ7Q",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. cream of mushroom soup",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bg9MS-A7MC6KiPhU2VtZ7Q/o.jpg"
      },
      {
        "img_id": "4Qe1UGE7AS2PRf1O2TgTFQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Leek tarte with apple chickory salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4Qe1UGE7AS2PRf1O2TgTFQ/o.jpg"
      }
    ],
    "user_id": "na3UYTLl5dFNrHrOurmM6g"
  },
  "VsF4QR_w_DwC9dz7rECaSA": {
    "date": "11/9/2013",
    "text": "Talk about hype. Lantana is basically a minuscule space with a lot of tables crammed into it (it's certainly a wonderful place to eavesdrop) and a near-constant queue.I've found their flat whites very strong before, but of course that's not particularly unusual. However my friend had a latte yesterday and couldn't actually finish it, it was so bitter. Not ideal for a place that raves about their 'superior' coffee.The staff are polite, but not at all knowledgable or able to be relied upon to deliver the right coffee, let alone to the right table. In a place with hardly any tables, this is quite some feat.The food was good - lots of meat on my beef brisket sandwich, and the Thai green curry looked lovely, so the chefs are clearly keeping up their side of the bargain. Shame the mediocre coffee, dippy service and undeserved hype aren't.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7Y9Xb-jq4t7fbGBFwxqew"
  },
  "tKhPYVvrbuRslra63mNKZA": {
    "date": "8/28/2016",
    "text": "Very nice breakfast spot. I liked it so much I went here everyday for breakfast during my short time in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqyokIQMWTudCnDBzVbN8Q"
  },
  "bNHFSiW4tio1aU8W1lC2_g": {
    "date": "5/22/2018",
    "text": "A lovely cozy cafe for a great brunch! The service is great and the food tastes good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a-V1J2J46biSXHyX5CU0bQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Avocado Toast with bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a-V1J2J46biSXHyX5CU0bQ/o.jpg"
      }
    ],
    "user_id": "Mwej27UKe8AYgutvaqp2WQ"
  },
  "c4w2H_jlFZXat_dn_8k0nA": {
    "date": "8/28/2017",
    "text": "The French toast was the draw that brought me here. Encrusted with matcha sugar, and topped with exactly the correct amount of fruit and yogurt, it was an absolute pleasure to savour. Along with the long black, the alfresco vibe, and the Aussie servers; I really felt transported to the other side of the globe, as far away as far can be, back in Melbourne. I would definitely give a 5 star review, but I felt it was a little costly. Our 2 dishes, short coffee, and a juice came to over £30. Yes, the food was great. But not £35 for two great.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ea_m_34_CIqgfbrZ7tuvNA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Avocado smash with crispy bacon, Matcha crusted french toast again with added crispy bacon, and a great long black.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ea_m_34_CIqgfbrZ7tuvNA/o.jpg"
      }
    ],
    "user_id": "8hlV3OhDILsFhAiK5KK1Sg"
  },
  "1gFSBP6LuFonk_Ea_AwENA": {
    "date": "11/18/2016",
    "text": "Great spot for a breakfast/brunch in Fitzrovia! The setting is very cozy and they seem to be full often. Depending on how busy they are you might be asked to wait for sometime. I ate here alone as I was a on a business trip and it was on a weekend morning and had a very positive experience. Their coffee is great - I had a Cappuccino and it was surprisingly good and well-crafted. I ordered an Avocado on Toast with Grilled Halloumi which was fantastic! Also got myself a pastry to go which was very tasty. I would highly recommend checking this place out if you're in the area and need a solid breakfast/brunch option.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zNN6Xp_TPYy3Fkm4tsm9eQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Avocado on Toast w/ Grilled Halloumi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zNN6Xp_TPYy3Fkm4tsm9eQ/o.jpg"
      }
    ],
    "user_id": "oprY58vreksJSR3uU4KleA"
  },
  "ca5OeUvcWQbJ4kEGTG042Q": {
    "date": "7/3/2016",
    "text": "Love love love this place!! Nice cosy cafe house with good coffee and brunch menu It's quite a small place, but if you don't mind waiting you will get a seat inside. On a nice sunny weather, the outdoor seating would be much better! Very much in love with the setting and the atmosphere of this place, unfortunately it is quite hard to get a seat if you have a big group. I'd say 4 is a good size to occupy one table. For couples you might have to share a table with others if it gets too pack.What we ordered:French Toast - Crispy bacon, blueberries, yoghurt and maple syrup Breakfast burger - Sausage, cheese, spinach, fried egg, hollandaise sauce and side of halloumiLatte and black Americano I'd recommend all the above. The French toast was really crispy on the side, it looked like they added some layer of crust but the toast was fluffy at the same time. The hollandaise sauce on the breakfast burger was perfect and the sausages were juicy (so glad it wasn't dried).?If you're on \"Cheat Day\" and \"Calorie don't care day\" please check this place out!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "L6jBo29cPu7dqced2SmhPA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Guinness chocolate cake + Latte to start the morning",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L6jBo29cPu7dqced2SmhPA/o.jpg"
      },
      {
        "img_id": "CsqMdWc1b7wCVTXjSa_AEg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Latte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CsqMdWc1b7wCVTXjSa_AEg/o.jpg"
      },
      {
        "img_id": "XW0QLef8BbkiIrqVEUIfpg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. French Toast 11 - Crispy bacon, blueberries, yoghurt and maple syrup :))",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XW0QLef8BbkiIrqVEUIfpg/o.jpg"
      }
    ],
    "user_id": "v5XZL6DY0aWq6LEM-vVIOw"
  },
  "d78vww_ZU0GcRTUhdTgvig": {
    "date": "4/16/2016",
    "text": "Was looking for brunch on a Saturday and found this little place. At our arrival there was a line of waiting people but the waitress told us we only had to wait for 20 minutes so we decided to give it a shot - and I'm glad we did! The food was absolutely fantastic and somewhat healthy. I'm not that big of a fan of English breakfast which is to fat and greasy for me, but the breakfast at Lantana has the best from English breakfast combined with some rather healthy components. Had the Full Lantana which is served with two eggs just like you want them cooked - I decided to go for poched eggs. It was served with lovely beans (and I usually hate beans!), sourdough toast, mushrooms, salad and a couple of slices of bacon. My boyfriend had a dish with a lot of avocado and eggs and herbal salad. Fast and polite service from the staff - worth the waiting time!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "N7_r3DAEeX1Z0JsJYuTtjA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Full Lantana",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N7_r3DAEeX1Z0JsJYuTtjA/o.jpg"
      },
      {
        "img_id": "Vq3DmLmqwPpz36uJzz5Eow",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Avocado three ways",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Vq3DmLmqwPpz36uJzz5Eow/o.jpg"
      },
      {
        "img_id": "dG7YgzIQRGm51BDWChuytw",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dG7YgzIQRGm51BDWChuytw/o.jpg"
      }
    ],
    "user_id": "SAtFTp24EZZMqHp6A2Zj3Q"
  },
  "APfKmVN4DjOH4kQK18mNDQ": {
    "date": "3/9/2017",
    "text": "Came back for another brunch. This time on a weekend, and as Lantana doesn't take bookings we waited about 45 minutes for a table.While the dishes are quite expensive, especially when you add extras (which is needed to have enough of a portion), everything I've had here has been delicious.Lantana also has great coffee.This time we ordered the Corn Fritters and the Slow and Low Baked Beans. Both tasty dishes. Service was a little slow, as it was very busy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1J_-VLdEXoTUX5HH1x_MNw",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Corn Fritters and Slow and Low Beans.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1J_-VLdEXoTUX5HH1x_MNw/o.jpg"
      }
    ],
    "user_id": "8WZKjGrl5_wushAzMSnFag"
  },
  "krwl0EWs29Tq8QjsnK0mKw": {
    "date": "8/11/2017",
    "text": "Great breakfast place. I had the avocado toast and a latte. Friendly staff. Clean decor. It's a smallSpace with limited seating.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNj6XqWE9D2lW82-YBmedA"
  },
  "nI-sdhr3E_ej87rOMa9HTQ": {
    "date": "11/2/2015",
    "text": "Craving for some avocado on toast I followed TimeOut (aka my weekly Bible) and went to try Lantana. So, ok, they really do different breakfasts than then usual egg benedicte. They also different avocado on toast. I tried the salmon/avocado and my husband the bacon/avocado. It was good. The bill though wasn't. £11,50 for a toast, some smashed avocado and a slice of salmon. That's a bit of a steal. Breakfast for 2 costed a wooping £32. I think I paid almost the same as the delauney. Comparing food & price I wouldn't recommend it.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4Px04rEb8IZDVRlPdTQKrQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Good but is it worth 11,50? I don't think so. The quest for the best avocado on toast continues.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4Px04rEb8IZDVRlPdTQKrQ/o.jpg"
      }
    ],
    "user_id": "4Ggaq_5gjSj7FYMBmXKx0g"
  },
  "JkRck4AmNvvW8KErrpoS0A": {
    "date": "8/6/2017",
    "text": "The place is small which means that for a group of 6 persons, we had to go downstairs and sat between the kitchen and the restrooms. The breakfast was good but the meals were quite small for hungry persons. The different juices we ordered, were fresh and tasty. Overall it was delicious, so was also the bill",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eM86Js-n8Xek8XGk0yCQgQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Biercher Muesli",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eM86Js-n8Xek8XGk0yCQgQ/o.jpg"
      },
      {
        "img_id": "Na5h4hZZRy2xuAJZ_ZlNsA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Biercher Musli with nuts and fresh fruits",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Na5h4hZZRy2xuAJZ_ZlNsA/o.jpg"
      },
      {
        "img_id": "Cg_lBETByHEnzKGAZl96kw",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cg_lBETByHEnzKGAZl96kw/o.jpg"
      }
    ],
    "user_id": "GZ_f8eLawVB8PC2-kJ6q-g"
  },
  "a9R4VWtV2n1g0EsHSNxhDw": {
    "date": "6/10/2017",
    "text": "Delicious food and friendly staff! Not too long of a wait if you have a small party but definitely worth it",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ja8c5bxbcLFG56iNNWerTA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ja8c5bxbcLFG56iNNWerTA/o.jpg"
      },
      {
        "img_id": "6fCqp8wOL51_rgHOp7YUYg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6fCqp8wOL51_rgHOp7YUYg/o.jpg"
      }
    ],
    "user_id": "ZXoExqPRcHR3SBlPDrxscQ"
  },
  "gj14o_Xf1qy7BhnPqegkgA": {
    "date": "2/22/2016",
    "text": "I was staying very close to Soho on a recent trip to London and I wanted to find a good place to brunch nearby. We initially decided to try out The Breakfast Club as it seems very popular but it turned out to be TOO popular as there was a queue of around 15 people even at quarter to 10 on a Sunday morning. Not wanting to wait an hour for breakfast we settled on Lantana, which was just a couple of streets away. There is a nice relaxed vibe to this place, even though it was very busy when we arrived. We managed to get a seat at the window which was perfect to watch the world go by. The menu is quite extensive and offers a wide range of interesting brunch dishes, instead of your usual variations on Eggs Benedict. It actually took us a while to decide because so many dishes sounded delicious. I ended up picking avocada, poached egg, dukka and courgette salad on toast and added chilli jam for £1 (definitely worth adding). My boyfriend went for The Full Lantana (their version of a full English) and added black pudding. The dishes were very tasty, as was the coffee. We didn't feel rushed and it was a nice way to spend our Sunday morning. My only criticism is the price. I know London is generally more expensive than Glasgow but £34 for two seemed a bit excessive. The full breakfast including black pudding came to £15.50, which I find a bit high. Nevertheless it is definitely a nice place to grab some brunch in Soho without having to wait in a long queue.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0xDg9SEwl5PZFDUQLf5L0w",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0xDg9SEwl5PZFDUQLf5L0w/o.jpg"
      }
    ],
    "user_id": "ivfKrqUuxZuc824Nce6jIw"
  },
  "jOwM34_VCOoXizwsPYhH5Q": {
    "date": "1/29/2017",
    "text": "Courgette bread with egg and chilli jam is amazing. Very friendly staff and fast service. Seating was a little uncomfortable but will definitely come back for the breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i8YA9eLnXXoEtQanLBuo-Q",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Courgette bread with egg haloumi and chilli jam",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i8YA9eLnXXoEtQanLBuo-Q/o.jpg"
      }
    ],
    "user_id": "eV1ox_DFjghD82s1AYhBeg"
  },
  "5QMHSRhyOvjtkchorKZ3Lg": {
    "date": "8/14/2017",
    "text": "Good capuccinos, great food & friendly service! We ate breakfast here today and it was so good we're going back tomorrow. Today we had the avocado toast with bacon, egg, courgette salad, dill & chopped toasted hazelnuts - wow! So many lovely, subtle flavors. I'm a foodie from Berkeley and have had a lot of good food in my day, so it's rare for me to have that \"wow!\" experience. Lantana is special.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8fl72UJjFgDjwoSeJW6z6A"
  },
  "P7NigpN-dj5363EzwbixyA": {
    "date": "3/25/2015",
    "text": "Lovely cafe down one of the few pedestrian-only alleys in London.  I have a feeling this will become a regular haunt when I'll be helping out with an art exhibition across the road at Nancy Victor Gallery.The coffee here is excellent - if you like them strong, my friend described her Americano as sour, but most of us had more than one cappuccino ...The brunch menu is very tempting despite prices around the £10 mark.  For some strange reason the tart of the day was not available at noon despite being advertised - apparently tarts are for afternoons which made us giggle.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r5qIM77K9wzYcASyh9hxHQ",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/r5qIM77K9wzYcASyh9hxHQ/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "W6g8FLnoZTy_dXHxAh_8Ww": {
    "date": "2/10/2018",
    "text": "Food is good, solid portions and interesting choices. Coffee a bit too acidic, but worst is service speed, taking ages to get receipt pay and leave. Especially strange given it's fairly full and they could use the table for next customer. Asked twice to pay - to no effect. Not interested in spending entire day here waiting for a check.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eOEk-1QeMkGVCPyvLrW8Sw"
  },
  "HpkCptD8O2H66pDmig0IuA": {
    "date": "10/5/2015",
    "text": "A pleasant experience at Lantana, though I didn't think it was a big stand-out relative to other popular brunch places.I ordered the corn fritters with poached egg which was overall good.  However, I felt like something was missing - perhaps, I was looking for that special sauce that would make the dish more than just a pile of different ingredients.  My cappuccino wasn't any more stellar either.  All in all, solid but not differentiated enough.Service was generally good and prompt.  Things arrived on time, and they were efficient in getting people seated in this no-reservations environment.We sat outside on a beautiful autumn day, so ambience couldn't have been better.  I took a quick look inside, and the indoor seatings also seemed reasonably comfortable and hipster as well.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "0u29NsBCvhqLHMQ0LMqARQ": {
    "date": "11/3/2015",
    "text": "I caught up with two friends a few months ago for brunch and one of them suggested Lantana Cafe in Central London as it was an Aussie cafe and being an Australia who else could she go there with? Sound logic in place we set off one morning for our long overdue catch up. When we arrived there was a waiting list and after about a 20-30 minute wait our spot in on the list had come and our table was ready so we entered the cafe and were brought to a long table in their downstairs seating area. We were given 3 seats at one end of the table and another group on the waiting list used the other part of the table.The moment we were given our menus we realised this would be a tough decision. Every item on the menu sounded delicious and reminded me of the cafes and brunch culture back home in Australia. We spent a little while musing over the menu but soon came to a decision otherwise we knew we could spend all day as all the options sounded delicious.I however could not go past the English muffin burger in the end 'English muffin w/ sausage patty, bacon, fried egg, hollandaise butter, smoked cheddar, spinach and chilli jam' (£9.50) and ordered a pot of tea for one to go with it. My friends A and C however went our other main favourite on the menu of 'Smashed avocado and streaky bacon on sourdough toast w/ a poached egg and rocket' (£8.50) which I can tell you was a great pick also and the portion of avocado in the dish was on the more generous side which I love to see! The ladies got an espresso and coffee to go with their meals.The English muffin was well put together with fresh and quality ingredients. The portion sizing was also just about right for someone being moderately hungry, if you like a big meal for breakfast I would suggest ordering a side with this just to be sure you'll be filled up. A and C were both impressed with their dish and said the portion size was just right. We watched the other group sharing the table with us order a few different dishes to us and I have to say I do not think there is a single dish on the brunch menu here that you could go wrong with.Service was friendly and prompt, with no request too big or small being a problem. I highly recommend you check this place out for brunch, especially if you are used to the service, portions and brunch menu style of Australia!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eSWrQwGEsGKEVyEmW7Ok6g",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. espresso.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eSWrQwGEsGKEVyEmW7Ok6g/o.jpg"
      },
      {
        "img_id": "p7C8eQSHp4g4VNbR8MF_xA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. cappuccino.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p7C8eQSHp4g4VNbR8MF_xA/o.jpg"
      },
      {
        "img_id": "7VeK-zUpyy0eGeJMrfuS0A",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. tea for one.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7VeK-zUpyy0eGeJMrfuS0A/o.jpg"
      }
    ],
    "user_id": "eWGM8kXW4wZikDjTgx6vuw"
  },
  "LBgvAGeFjXj9lLqPAYdb4A": {
    "date": "11/19/2015",
    "text": "One of the top brunch spot in London.Whoever come here will all suffer the same feeling that that to order. Every single dish here is excellent! I order  corn fritters with streaky bacon avocado lemon creme fraiche garnished with rockets and spinach! It's so good! Well balance and healthy. However I feel a bit over priced for the portion. The space is tiny and the service is quite slow tho.. Prepare for a long queue if u come on weekend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OJ46held8n9eP5pgignOXA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OJ46held8n9eP5pgignOXA/o.jpg"
      }
    ],
    "user_id": "xZJ8yCEqm4xdjWks3SPtsw"
  },
  "00aYeTVH7Gy_GZbvSHTomQ": {
    "date": "4/8/2017",
    "text": "Surprisingly fabulous meal! We stumbled upon this place and glad we did. Food was hot and fast, service was the best!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1U5sky4c-DUUxNZJ244leA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Mashed avos. Yum!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1U5sky4c-DUUxNZJ244leA/o.jpg"
      },
      {
        "img_id": "eIFKbn0rAr0e3eHPrvvCqA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom. Suck hash is great!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eIFKbn0rAr0e3eHPrvvCqA/o.jpg"
      }
    ],
    "user_id": "f2jeYiNbPJi00PNA5bL5fQ"
  },
  "0iEfSrAMq0JnFzrOKjuYmA": {
    "date": "6/11/2015",
    "text": "One of the better brunch places in London, run by Antipodeans .. It is a small space, upstairs is nice and airy though a bit cramped. More space downstairs but a bit dingy. It has some of those small touches I like in a brunch place (eg herbs in the water jug). The slow braised beans are good and the corn fritters too!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t7GMUHjhx5myeajlOMfAFA"
  },
  "qmPno1H1J4-NmQckbBmeow": {
    "date": "3/20/2009",
    "text": "Lantana serves a rather brilliant breakfast, especially good on a hangover, however, it's not really that greasy, kind of healthy actually. No fried eggs, rather poached or scrambled eggs, served with loads of fresh rocket if I remember correctly. It is rather expensive for a breakfast (+£15 but I had coffee and orange juice) but you are getting freshly made good quality food. The decor is a clean, light, bright and quite contemporary style which certainly adds to the experience. It's a bit out of the way (for me anyway, since I usually venture to the Soho coffee shops) situated in a pretty little pedestrianised street in Noho, but word has spread quickly on this place and the last time I went it was completely packed, so yes, better get there extra early. Or extra late. Pros- delicious fresh tasty breakfasts- nice decor - nice area Cons- popular so gets very full",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cJGqi1JWgHQimIZxI0crIA": {
    "date": "10/17/2008",
    "text": "Update I'm actually sat in Lantana as I write this. Using their free wi-fi. I've been back a couple of times over the last month to do some work and it's a lovely place to sit and chill out. Or have a quick meeting. The staff are lovely. Really friendly. I like it here. I still think it's a bit pricey, but a takeaway coffee is still takeaway. If you have time to sit in, it make things a whole lot nicer. I might have to have a brownie too. * I came here for coffee yesterday. I can't say anything bad about the service, the coffee, the food or the atmosphere. I was only getting coffees and brownies for me and the boys in the office and felt totally welcomed while i stood and waited. They drew lovely swirly things on my latte as well so that looked very pretty (then i ruined it by putting sugar in). The brownies were brilliant. It took me all day to eat mine, and there's still one in the office as my friend couldn't eat his. I'd suggest buying one and sharing it. I did nearly come back for lucnh, but as my best mate pointed out, it's really expensive, and as we were still waiting for pay day, it was too pricey for a normal lunch day. And unfortunately that's why I can only give this place three stars. I like it. Really really like it. Everything was great. It's too expensive. Way too expensive. I bought 3 lattes and three chocolate brownies yesterday to take away. The bill was £14.10.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "n6peFdyDLMzdg1lOoqdVTA": {
    "date": "3/6/2011",
    "text": "I had high hopes for this place as barista friends had recommended it. I was hugely disappointed. I don't care if my barista is surly, its their prerogative as they drink too much coffee so have massive mood swings. But its my first time in Lantana, and asking what coffee they have seemed to be a sin (I was hoping for some sort of brew bar as like I said I'd heard good things). So anyway the latte art was sloppy, it was poured from the same jug so the first flattie was too fluffy and it was actually on the cold side. Probably a cold cup. Com'on guys sort it out!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4vpuUo2QFrktFVw3yMs6nA": {
    "date": "10/26/2008",
    "text": "This place is yummy, but they need to sort the service out. Although to be fair they have just opened so I think that's part of the problem. Great breakfast choices, top-notch coffee, and generally a lovely atmosphere. Really good scrambled eggs, definitely unscrambled my head from the night before anyway. I'll be coming back here at some point and hopefully by then the service will have picked up (and they'll have all the ingredients on the menu). Lovely little place in a good spot though. If I hadn't been feeling so ghastly I may have gone for one of the chocolate brownies that looked incredible",
    "rating": 4.0,
    "rated": {},
    "photos": [
      {
        "img_id": "rZc39Ccv8axaVgxIlBskxA",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rZc39Ccv8axaVgxIlBskxA/o.jpg"
      },
      {
        "img_id": "Roh9eaOUy_shReyElXrfOg",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Roh9eaOUy_shReyElXrfOg/o.jpg"
      },
      {
        "img_id": "JqsewgQciYX8bjLcrzTO2A",
        "caption": "Photo of Lantana Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JqsewgQciYX8bjLcrzTO2A/o.jpg"
      }
    ],
    "user_id": null
  },
  "1o125dZDMai7RGVvsl8bAw": {
    "date": "1/15/2010",
    "text": "I really like Lantana - very much enjoy the flat white coffee and the hummingbird cakes.  It's definitely a small space, but I've had no problem finding a spot to sit in the late afternoons... seems like 3-4pm is a good time to stop in.Haven't tried the food yet, but hoping to soon!Another plus for Americans: they will accept  swipe debit/credit cards (without the chip-and-pin feature) without making you feel like a leper!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ia8_6HxPvRxMVTLzjWH-Tw"
  },
  "KwnlLbvZJ9YI3E9adMBAIg": {
    "date": "10/11/2008",
    "text": "\"Lantana\" is a plant introduced to Australia that now grows everywhere there. This place, of the same name, is a reverse transplant: a restaurant with Australian owners, and that brings the varied, fresh, and fusion view of breakfast food that is so popular in Oz. Lantana is small, bright, and open. They put some food out on the counter that immediately fires up the hunger. There are stools at a counter looking out the front window, and a couple of tables outside. I brought in a booking of 9 people and, despite it already being quite busy, they got our orders out in reasonable time. The food was delish: really well-selected flavours, and it looked great. Go for breakfast (until noon M-F, all day Sat) or lunch (after noon). The portions were not gut-busting, so if you're looking to stuff yourself you might need to order a side. But if you want something really tasty and different from a fry-up - see their current menu here (scramblingeggs.blogspot.…) - get in and try it. The coffee is excellent, too, from the Monmouth Coffee Company (qype.co.uk/place/82203-M…) . For those who work near Goodge Street and are in a rush, never fear: I'm told they do takeaway.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3MEiYFVeY5LkqYIDoazt9g": {
    "date": "4/19/2010",
    "text": "This is one of the few places near Charlotte St. that not only makes a proper flat-white but also has delicious, fresh, yet not too guilt inducing treats (such as perfectly proportioned oatmeal chocolate chip hazelnut cookies), so that alone merits four stars in my opinion. But aside from the coffee/treats, Lantana is a great place to pick up lunch. I've only ever eaten at the take away section, as I work in the area, but it's the perfect go-to spot, especially because you can box up the right amount of food that leaves you feeling like you've had a sensibly nutritious but not overly virtuous lunch. They have a rotating selection of three different salads per day (the lemon almond cous cous is delicious, lots of almonds). They also have different puff pastry tarts each day and very good sandwiches. Some of the salads can be a bit heavy on the oil, but in general they are quite healthy: think bases of chickpeas, quinoa, roast veggies. The one thing I will say is that the wraps are a bit lacking in the flavor department (but in my opinion this is the general fate cold wraps) and I havent had much success with any of the soups; they tend towards the watery side and the minestrone I had one day was almost inedibly bland. Not perfect overall, but some real standout menu items.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dB_HwpfBHSQ8IYu2Q89oDg"
  },
  "6EV0w9t501B-puEmwOyejA": {
    "date": "4/22/2013",
    "text": "great weekend brunch place - went there the last weekend based on a recommendation and i was not disappointed.  good food, great presentation and plating.  the place is fairly tiny, but modern and with a good vibe.  service was decent and people friendly. will return for other brunches !",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "9lJiNOBTUXrGzCnS70jdiA"
  },
  "ObDGaGiTqoO1WFZDogkA4g": {
    "date": "8/22/2010",
    "text": "my reply to rs ..who complained how they were treated. Well i run a cafe and we get people who buy a coffee sit and want to read papers and CHILL out all day. They dont understand that the cafe owners have overheads to pay and CANNOT AFFORD for people to CHILL out hours on end. There are places where you can buy a 16oz cup of mediocre coffee read books and papers and stay all day STARBUCKS is the name. I cannot stand cheap skates such as RS .. My hat goes off to Lantana...keep up the good work",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "bvn2b7XhwBFZmxhqQwQmhA": {
    "date": "2/22/2010",
    "text": "It's small, cosy and if you can get a table - don't give it up! Brilliant coffee, wonderful brunch menu, service not fussy. Total highlight for the area - but needs more seats!!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "El9pAgCm6qhpEXtwTbJ4vQ": {
    "date": "8/17/2011",
    "text": "Cute place.. Good food.. I spent a few hours here drinking coffee and working from my laptop.. smaller lunch portions but they are ok :) You can even enjoy a nice glass of wine on the outside seats too.. Gets busy around lunch so better to go before or after :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iOgbyW_rhCn_OqiTGxU9tw"
  },
  "_yNAKecGKV34OQcYBWvbzA": {
    "date": "10/21/2009",
    "text": "Awful, awful service.  We were seated by a member of the staff who took our order and then decided to forget about us.  We only ordered coffees -- no meals, nothing fancy -- and yet 15 minutes later...nothing.  Meanwhile, the same staff member seated another couple next to us, took their order (salads and sandwiches) and served them, while we waited for two coffees!  We tried to catch his attention, but he wouldn't make eye contact with us.  Another server asked us quizzically if we wanted something, and we explained that we were still waiting for our order.  She apologized and then forgot about us too.  We left without being served.  I was disappointed because I wanted to like this place, but the service was a total disaster (and I'm usually pretty easy going when it comes to service...).",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q81dZGMvQ81bShSpBSgX6w"
  },
  "1jlkrTShec5i_NhRxOKIpQ": {
    "date": "10/30/2009",
    "text": "I really like this place but am affected so much by the reviews and feel that I was treated as invisible on my first visit to buy a take-away from Lantana that I am afraid to take friends back there. On my second visit, my food didn't arrive, but I prompted the waitress and she was really nice about it. So I'm torn about going back again. It is admirable that the owner has made an apology on one of the blogs and my sympathy goes to her. I think the laid back vibe of the place can be attributed to the sense of a group of friends who're twenty-somethings running their dream caf and so it's sad when customers get the wrong end of treatment by feeling like they're 'in the way'. Although I didn't experience any of the negatives mentioned in other reviews, it feels awful to read them. I get the sense that the people who wrote the negative reviews were being really gracious too - even apologising for their unhappiness. Wow! That means the cafe has real potential if in the face of my cafe deal-breakers people can be so gracious. My cafe deal-breakers are: being ignored, being glared at, being talked about by staff within my earshot, being kept waiting for longer than 40mins, being told to leave!! Would be interested to hear other people's deal-breakers too...btw, has anyone tried the cafe in Copenhagen called Bang and Jensen -that place is awesome! Peace to all.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "US2lYBjc6nRqsGvGXgH3KQ": {
    "date": "10/10/2009",
    "text": "After posting the review below, I was tracked down by the owner and offered a free breakfast - very sweet. It took me a while to get round to taking the offer up (still pretty annoyed) but yesterday I went - I had good food and polite service. The place was a bit queue'y but nothing to make my blood boil. Coffee excellent as ever. --- 1* When I first stumbled on this place a couple of months ago, I was happily in love and glad to recommend it to friends. Sadly the honeymoon period seems to be over. Despite impressive coffee, an inventive and well executed menu and a playful, elegant interior (surely these three reasons are enough in themselves to suggest I had found a great local), I won't be visiting Lantana again. I won't go into the details here for fear of sounding puerile or melodramatic, but I can summarise with the conclusion that this was the rudest and indeed worst service I have ever received in London. I was enraged to the point of leaving the cafe before placing an order and appalled to be entirely dismissed by noxious, disinterested sarcasm when returning to explain my disappointment later in the day. If you can tolerate being treated with utter contempt, you'll find good things. Otherwise, I recommend finding somewhere with a little more soul, humanity (in fact) and decent manners. A hot spot for hipster masochists.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "x9lwWkEkZXjPOihvFJORBw": {
    "date": "9/14/2009",
    "text": "The Saturday brunch is delicious and the selection is good. I've been a few times with friends and always sat out at the tables on the quiet street and the food has been delicious every time. There are a few seats on a large bench looking out the window where you can get a quiet meal on your own and browse through the morning paper. The interior decor is very simple but this keeps the focus on the food and the company. The coffee here is Monmouth coffee.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GplCb8zG75fZvIqlXzysOw"
  },
  "AcGU_o5qHnPq5Xcg78fC0g": {
    "date": "3/7/2009",
    "text": "My boyfriend and I were thrilled when we discovered this place as we live around the corner and the food here is good, honest stuff (the sort of place you can trust that the sausages are good.) We are self employed so often go in there for brunch or a coffee, read the newspapers they provide, and chill out. The staff were always friendly and the cakes very inviting. We had one issue when a bean-sized pebble was found in my boyfriend's food, but the lady said sorry and that it must have come from the rocket - and that's fine as these things happen. However, this morning (Saturday) I went there to meet a girlfriend for brunch. My friend was half and hour late so I had a 2 cappuccinos while I waited but didn't order 'til she arrived. We both had massive fry-ups, extra side orders after we had finished we continued to order more coffees and mineral water. It got a bit busy, being Saturday and as we were on a table that could seat 4 we were asked a few times if we minded sharing, which of course we didn't. We shifted up but other tables got free so we never actually had to share the table.One time the waitress came over and asked if we wanted anything else as there were people waiting for a table (I couldn't see them) but we ordered further drinks and carried on chatting away. There was a table seating four that was free for ages. Then the waitress came over and seated some people there and said they were a party of 8 and would need our table. I assumed she meant for us to budge up but then realised there was nowhere for us to move to and that she meant she wanted our seats. At this point my friend still had half a cup of coffee and I had a bottle of mineral water so I asked the waitress if she meant she wanted us to go. She said that it was difficult to watch us sit there for such a long time when the cafe was so busy. I was very shocked as we had ordered plenty to eat and drink and still had drinks. As I tried to explain this she said she could move us downstairs and I said not to worry, that we would have the bill and go. She then responded by showing me the hand and walking off! She then went to the counter and started bitching about us to the other 2 members of staff there. When she came back I thought I must have misunderstood and tried to explain that we had been ordering food and still had drinks, and that we were a little bemused and offended by her attitude, to which she barked that I had upset her and she walked off again! At this point the 4 people sat at the table next to us and said their friends wouldn't be there for a while yet (I now wonder if there were more friends coming?) and we just laughed and tried not to show our embarrassment.A different waitress brought us the bill and I said I was sorry (yes I was STILL trying to be affable and I was apologising?!) if I had upset her friend but that I was a little offended and that we are regular customers here and all we wanted to do was finish our drinks and not be kicked out. She then replied very gruffly that yes I had upset her, that the other lady is the owner and that Lantana is her baby, and how hard she tries to make it work. Again, not a very customer -service friendly response.My friend finished her coffee (and I took my mineral water with me) and we left. All in all I feel very hurt that we were treated this way. We were made to feel very unwelcome and every time I tried to speak to the waitress/manageress she walked away making the issue very dramatic and made it look to other people that I was kicking up a fuss. I clearly have made the wrong assumption - I thought this was a lovely little cafe that prides itself on its chilled out, cosy, welcoming vibe. Sometimes it gets busy and I have waited my turn and happily queued for a table previously, and would never expect staff to tell those with tables to drink up and get out. They provide papers and magazines and offer you pitchers of tap water and I assumed that this meant they want you to stick around and relax. This is what I was doing (while still ordering more drinks!) and feel wholeheartedly sad that I have been treated like vermin and cannot go back to my (previously) favourite new place. A note to the owner - do not work in customer service if you don't like people. Try to manage any problems rather than just sticking your hand up and storming off. Furthermore, if you are working hard to make Lantana a success, it might be an idea to be nice to regular customers and encourage them to enjoy your cafe, rather than shoo-ing them away.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "V6xgXlgpToNeGo8HlalLEA": {
    "date": "10/9/2008",
    "text": "I ate here on the weekend and it was brilliant. Everything I miss about Australian cafes - great coffee, wonderful food, great staff and a very cool design decor",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "N398z9eAW-149FNOghAN2w": {
    "date": "10/20/2008",
    "text": "This is the place that I have been waiting for in our work zone. Lovely AND open on Saturdays. Not cheap, it's true, but I think you get what you pay for; high quality ingredients and well-executed dishes, and friendly service. A great start to the day when you have to work at the weekend.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "NeC8Yy1r19kLcbZRmwCbqw": {
    "date": "10/21/2009",
    "text": "I'm sorry to say, I have to agree with neilgrayshon's review. My husband and I went to Lantana today, were seated, gave our order (2 coffees and a brownie) and then were ignored by the staff for 20 minutes. Our original server wouldn't even make eye contact with us when we tried to ask him where our coffees were, though he did manage to seat, greet and serve a couple who arrived ten minutes after we did. Another server noticed the expressions on our faces and asked if we were okay or wanted to order something. We told her we had ordered and were still waiting. She apologized and went back behind the counter...and then seemed to forget about us as well. All this for two coffees and a brownie I literally could have grabbed myself from the counter top! Meanwhile, other people around us were being seated and served. We eventually left without being served. I love to support local businesses rather than corporate giants, but in this instance we were (sadly) better served at Starbucks.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}