{
  "YPCGJnZ0A5eamprc_5-oyg": {
    "date": "5/23/2009",
    "text": "I really liked the place! Dan dan noodle is really yummy. They are spicy but very good aroma. It is hard to get a good quality of noodle dishes but this place is one of the best I have tried. Decoration is very pretty too. I also had meat dumpling with chill sauce, that is super delicious too. I also recommend to try hot soy milk. It is tenderly sweet and helps the heat from the hotness of food. The service is very quick( maybe too quick to take the plate away after meal. the waiter came to our table just a second after we finished the meal) If you want to eat something quickly , it is good place to go. I only did not like the condition to say minimum charge is 8 pounds per head.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "fk7gh4cJ9_3FCfehDW-xLA": {
    "date": "12/24/2011",
    "text": "A friend took me here after hearing great things, however, I'm not quite sure where these great things came from. Service is terrible, I've never been somewhere quite like it, total lack of communication, the moment we finished our food we got the bill, and basically were coasted out. The place is small and cramped and very uncomfortable. I order a pork dish, and well I'm not sure where the meat was, because all I got was the fat cuttings. Poor experience for me overall.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "TKeb1EqBqyW3V02V-IyJqQ": {
    "date": "5/18/2010",
    "text": "Great, cute little Chinatown stop.  Get the Dan Dan noodles for a savory sweet dish!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i8bTOYu9EtY3XNJGt0p55A"
  },
  "65XwY7xx0T_dPbnsYAqc1Q": {
    "date": "2/4/2011",
    "text": "went here on the recommendation of a friend, however, found it one of the worse experiences food-wise in soho. i am sorry to disagree with the other reviewers, but the food was very poor quality, eg the cuts used and the staff were very rude. i felt so embarrassed i took my friends there that felt obliged to pick up the bill.",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "iOjP0y0iZaa8Etf9mDO4qg": {
    "date": "11/21/2008",
    "text": "Recently voted as London Best Cheap Eat by Timeout London. All food arrived in substantial bowls and were filling. I ordered beef noodles and they weren't that spicy at all, despite the chilli oil in the broth, and they could have been more generous with the beef. We were both of the opinion that the pork wontons were a good size and full of flavour. I might go back to try some of the other dishes, like the dan dan mian, as it's hard to judge a place on just a few dishes (I know I do this all the time!). Dinner was £9 per person, including tip, which was very reasonable for London.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "jvvff7w1ePTbsCRNcb4FTw": {
    "date": "8/8/2008",
    "text": "I wish I knew how to say 'Viva la revolucion, siempre!' in Chinese. Maybe it will sink in subconciously or be transmutted into my bloodstream via Dan Dan Noodles the next time I visit Baozi Inn. And there will be a next time A revolutionary addition to Chinatown, Baozi Inn's specialty is northern Chinese grub and offers a change from the near-ubiquitous Cantonese restaurants in London. Baozi Inn somehow manages to come across as well designed, sleek and original as well as conveying the friendly 'family affair' feeling of older establishments in the area. The decor occupies some sort of no-man's-land somewhere between kitsh, chic, tasteless and authentic. I'm not sure how I feel about stuffing myself with delicious northern Chinese noodles below pictures of Mao and propaganda posters of the Great Leap Forward and Glorious Revolution But I hardly have time to contemplate the various ironies of spending five pounds on proletarian food before a steaming, huge bowl of delicious noodles bedecked with eggs, duck, pork and glorious strange vegetables is plunked unceremoniously under my nose. Delicious! I'm a convert, if not to the politics, then to the dish. So, after two trips to Baozi Inn, even if I don't feel like brandishing a little red book, I would be happy enough to pick up the menu for another read. After all, let's not get ahead of ourselves a dinner party is simply not a revolution",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hZ1qac13I_jXxgmYS_Ff1A": {
    "date": "5/15/2010",
    "text": "this small restaurant serves authentic sichuan noodles soups and dumplings. super yummy and the price is right. the atmosphere of the restaurant is a little mainland china style, quite kitsch, but who cares, i am there to have a hearty meal in a non-pretentious atmosphere. have a hot spicy soup there and you will emerge alert and refresh!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BkzXv8XISw-mZGPtT96RNA": {
    "date": "12/15/2011",
    "text": "Bao Zi Inn is much better than the Cultural Revolution.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "2mclkRG8DYLLs3T1NXY42w"
  },
  "N8pQZNZt9j9QJGg6fFzNPg": {
    "date": "5/30/2010",
    "text": "This place is cute and clean. We visited based on Yelp reviews but I can't say that I agree with the glowing recommendations. First off, we were told that dinner was £8 per person minimum, which must not have included drinks since we did reach those totals with beverages (their lemon iced tea was divine! I ordered two!) So we ordered a starter and the waitress seemed satisfied. The dumplings we had were too garlicky. I had a short rib, rice & potato dish that was really tasty. My husband had the spicy beef noodle soup and it truly lived up to the 'spicy' part of it's name! We had food left over since we had to order starters and it seemed to me the waitress was unhappy about that.  Food and service weren't bad, but they weren't better than just okay either. With the plethora of restaurants in this area I wouldn't say I'd come back.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e6MAf4XwtSSqCGWOlvFXYQ"
  },
  "gs3rhw0DpbRVrEmuq2VZ9A": {
    "date": "6/15/2009",
    "text": "I've heard some very good reviews of this Sichuanese restaurant and was keen to try it. However I have a problem sometimes with very spicy food is that it makes me cry and my nose run... Enough of that so I thought I would take a chance and go for it. I entered the place which was pretty empty at lunchtime but that was due to roadworks outside. The restaurant was styled In a retro Maoist communist theme with very small and tightly packed tables. I chose a £7.90 set menu featuring Baozi buns, dumplings, soup won tons and a small bowl of cold noodles. The service was very quick. I started on the thick cold noodles which had a lovely peppery but not too hot sauce garnished with peanuts. Followed on by a soup with won ton dumplings which slightly cut the fairly spicy heat of the noodles. Then there was two Baozi dumplings. One was made from meat and the other was vegetarian which was quickly devoured along with two small dumplings. I enjoyed the food as I was surprised by the subtle heat of Sichuanese food on the taste buds. Finally I had a tiger beer. I was impressed by how little I spent (£10.40). I was pleased that I had gone for an alternative to my usual Anglo-cantonese fare.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 7
    },
    "photos": [],
    "user_id": "JvHImDKFGDU45OsYDEo2JQ"
  },
  "IAxXfqa5dZ89oWLhiNpwhA": {
    "date": "6/8/2009",
    "text": "Now -- I ate at Baozi Inn shortly after it opened, and was very impressed then. After Yee Gan's recent review, I felt I should go back there and write another review -- particularly as I knew I'd be in town on Sunday and needing some food...Before you arrive -- make sure you have cash. Baozi Inn does *not* accept credit cards or cheques!Baozi Inn's speciality is Sichuan/Szechuan cuisine, as opposed to the Guangdong/Cantonese style one usually finds in Chinese restaurants in the UK. The menu is generous, but not extensive -- no lists of hundreds of options, but about 30-40 items in total, including the eponymous \"baozi\" -- steamed dumpling-puddings containing pork, egg or radish, along with larger meals with soup noodles, dry noodles or rice.I went for the pork baozi, followed by the Sichuanese spicy beef soup noodles (noted as a house speciality) and a green tea. Service was prompt, friendly and correct, taking the trouble to reconfirm my order before leaving my table, the baozi and tea arriving barely a few minutes later, and then a few minutes more before the beef noodles. This came to £9.00 in total -- an excellent price for a DELICIOUS and ample meal!Let's be clear -- Baozi Inn isn't a place to hang about; particularly when there is a queue forming out of the door (yes, even on a Sunday) -- the service is brisk. However, it is definitely a destination for authentic Sichuan food in Chinatown -- if you haven't been, go!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "1zYwHE7OJjeZSWxWwNzPxw"
  },
  "4A6fSwPhLJ77zxUn55_tDA": {
    "date": "3/22/2009",
    "text": "Eating here really does feel like you've stepped into Maoist China, only with great street flavour and none of the little red books (though there are posters on the wall featuring children crowding around the Chairman to listen to him). It was also voted as Time Out London's Best Cheap Eats Runner-Up, and probably wasn't all that far from the top spot. I had the Chengdu Dan Dan noodles, a savoury bowl of ground pork and spicy soup that wraps the noodles perfectly, and it had just enough spice to clear up a cold I'd been having for two days. My mate had the Sichuan beef noodles, and her (bigger) bowl looked just as savoury. We also shared some Chengdu dumplings, which may look small (everything comes out at once, so think of it more as a side than an appetiser) but have enough spice and flavour to complement the noodles and, together, will fill you up. Service is brisk, like any Chinatown hotspot. The environment is clean, and the flatware and the stone decor can make you feel like you're in the Asian bathroom section of a home store. We did see a group of 8 next to us, so groups here are possible, but you will get seated more quickly if you keep your numbers to 2, as this is a very cramped place and there are only two small dining rooms. Since you will need water after those noodles, be sure to ask for tap water; we made the mistake of nodding to the question 'still water?', and our bill came out to £18.90 instead of the £14-something we expected.Still, at around £4.50 (price of a lot of the entrees) to £10 (if you split an appetiser with a mate and include tip), Baozi Inn definitely sticks out as a credit crunch way to enjoy a savoury meal.Beware that this place can be VERY hard to find if you a) am stupid like I am and forget to bring a map or b) are not used to walking around the backstreets off of Shaftesbury and Charing Cross Road. From Shaftesbury, the street that leads to it is on one side of the fire station. From Charing Cross, it's north of the tube station, not south as depicted on some (inaccurate) maps (like Time Out's).",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "VsVweTCq1HGFB1Xo5aYS8A"
  },
  "xr7p3_4Q-eoBmLm-hnTnbA": {
    "date": "10/2/2012",
    "text": "Delicious, fair price, good service. I'm definetly going back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfF98k4tuoNZ7avqY3D2RA"
  },
  "FQxCLU_9iZJQqOSMmLBz-g": {
    "date": "4/6/2009",
    "text": "I decided to give Baozi Inn another try, after an initially frenetic and disappointing visit one rainy Sunday afternoon several months ago, so I popped in specifically for a bao for lunch today.Quickly seated, I found the cold soya drink I wanted wasn't available.  Okay, so I ordered the hot one.  Then the radish bao I wanted wasn't available.  Hm.  I chose an egg one instead.  I got some millet porridge to round the lunch off and went to the toilet, wondering if this was indeed going to be any better of an experience than my last.I returned to find all three items I ordered on the table waiting for me.  Prompt.The millet porridge was topped off with some goji berries and was pleasantly bland in the mollifying way.  The bao was big, flavourful, and springy (although I still would have liked to have tried the radish one with the tiny shrimps).  Better yet, the hot soya drink was probably better than any cold one would have been: light, warm and unsweetened.  Everything went down together in one fell soothing and hearty swoop and was complemented by some watchful and unobjectionable service.After renewing my confidence, Baozi Inn will see my face again for some more adventurous consumption.  Especially since I know Baozi can serve it up, considering all the coughing and eye watering going on at the table of visiting North American pensioners beside me.I would have given Baozi Inn three stars, because, well, I wasn't particularly 'wow-ed' by my lunch today, but it gets the extra star for not serving up the same greasy anglo-canto grub as all the other Chinatown eateries.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "HGACAXQmVYNDp7-vcjP3dA": {
    "date": "9/23/2012",
    "text": "Most authentic Chinese food I've had outside of china. Fast service and good value. Meal for 4 with drinks and starters was £60 and we came out feeling like we had eaten a good healthy meal. Don't expect deep fried English Chinese. This is Fred noodles and vegetables, steamed ribs and seaweed. Mmm",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_WXil3QCAH_RrPvy--WqA"
  },
  "lnnyn1T12hchi3d9ZWfbDA": {
    "date": "1/30/2012",
    "text": "Sichuan cooking in a small caff-style Communist-decor themed place on Newport Court, an alley in Chinatown, Soho. The food is very unlike any you'll find in most standard Chinese restaurants. It's spicier, for starters  with lots of chilli and pepper in many dishes. As a vegetarian, there was lots on offer  from simpler, less spicy dishes such as the Baozi bun filled with chives, egg and onion, to much spicier, such as the wood fungus salad, dotted with fiery chili slices. Flavour was great throughout  each dish really sung, with good ingredients. But while food is anything but Chinatown standard fare, service is as usual  surly and over-rushy. Ah well.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UJMAYY7bQAiMhCujI77hew": {
    "date": "6/15/2011",
    "text": "This place makes delicious food. The noodles had great texture. The spicy garlicky wontons were super yummy! I can see how Europeans might find even the mild stuff spicy, but I did not find the food particularly hot. I would highly recommend this restaurant. It is kind of hard to locate, but worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9P7g3DpkrPYGDlw_e2LYQ"
  },
  "Qin_OQvvvnIYX4FmFMdyDQ": {
    "date": "5/8/2009",
    "text": "This was our favorite restaurant in London during our recent trip.  We'd tried a lot of the \"traditional\" London fare, which was all good, but this place really stood out.The egg Baozi we each ordered was larger than a man's fist.  Our noodle dishes were exceptionally tasty.  If we ever return to the UK, this will be one of our first stops!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c23FnTkD4jm77dyYBv5t8w"
  },
  "sHEDA3ghooryD0AoRdpDDw": {
    "date": "1/18/2012",
    "text": "Horrible place. Bad service and food! Do not go there at any rate!!!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kBJ6N_cF11mpzXldcolmQ"
  },
  "Y4LYyHjaf8Zf6prvSQjs7w": {
    "date": "2/1/2011",
    "text": "I've been searching for years for a restaurant 'that tastes of real China' and here it is. I also like the communist style. I loved the interior. I am not into these bright Chinese restaurants, they look all the same to me. I love the dark wooden tables. You do feel that you are being hurried a bit, but then a lot of Chinese restaurants are like that. You kind of get used to it. I loved the new things they had on the menu, lots of things I haven't ever tried before. The food looked fresh and the vegetables look good and they looked really beautiful on the plate. From an artistic point of view, it was great, and you had plenty. However, like others, I didn't like the compulsory £8.50 policy and the hassle that it was 'cash only'. I can't remember seeing this on the front window. It normal circumstances I would have gone elsewhere, but to be honest, it was really good food and I enjoyed having the starter. I think it is the best 'quick' Chinese restaurant in town. We saw some people looking outside and we said it was good and they went in. This is definitely one I would go back to again and again.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rwTH-FEwKCuGlawHnBmrmw": {
    "date": "6/30/2011",
    "text": "I've been here several times, each time solo for lunch, and I am afraid that after a recent rude experience I will not return. I'm Chinese and I used to come here when I get a craving for dan dan noodles (salty and spicy beef soup noodles). Baozi Inn serves up a good quality one (compared to the not-very-high standards of Chinese food in London). The noodles have a great slippery thick texture and the soup is tasty, BUT recently I've noticed that the amount of meat they put in the bowl is TINY. For 6.50 it was pretty stingy, not to mention that there's a minimum spend and I always feel obliged to order a side dish. Anyway my main complaint is with the service. Yes I dined solo, yes it was during weekday lunches, and yes I only ordered tap water for drinks. I expected indifferent or surly service - it's Chinatown after all. But this waitress actually complained to her colleague (in my presence) that I ordered tap water. A man who looked like their boss smirked at the comment. They all clearly thought I did not understand Cantonese. What kind of service is that?? I would not give these people any more business.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "4Mssb-mOT82pvBbSoJcbkg": {
    "date": "3/31/2009",
    "text": "This place is fantastic. It has the reputation for being the only place in Chinatown for serving completely authentic un-Anglicised Sichuanese street food; whether or not that's true, the food is exceptional. First of all the décor: it's fabulous 1950's communist kitsch. There are propaganda posters of Mao, and various other bits of commie memorabilia scattered about what is for Chinatown, in design terms a decidedly upscale little café. Top it off with piped in Chinese Red Army choral music brilliant. The lavatory is even clean. I know, a clean lavatory in Chinatown. Okay, the waiters are friendly in a way that fits with my notions of 1950s communist sociability. That aside, they are efficient, and occasionally crack a bit of a smile. The food is incredible. This place actually makes their own noodles, dumpling wrappers and tofu, and you can tell. I highly recommend the spicy bean curd starter, which is something between a soup and a main, it's a lot of tofu in a gorgeously rich sauce (think hot-and-sour soup as a stew) topped with crunchy soy nuts, follow this up with either one of their famous bowls of dumplings (so good) or one of the authentic Sichuan noodle dishes. The chef is from Sichuan, so supposedly those dishes are better than the Beijing street dishes. I'm mad about any of the spicy ones. The non-spicy ones are very good, but a bit too bland for my palate, but hey, most of you English-types are into bland, aren't you? The portions are small, but the place is incredibly cheap. You shouldn't need more than two small dishes, I mean, you could eat more, but I doubt anyone needs the calories Seriously, try this place out for a quick lunch bite, or as a casual, but trendy and unpretentious little date-place. You won't be disappointed.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3oCci830umOw049BpRZDgw": {
    "date": "1/9/2013",
    "text": "The food here was plenty authentic, the decor plenty communist. Definitely reminded me of how my grandma would make baozi as well as zha jiang mian (Beijing noodles). The price is on the dearer side with bowls of noodles going for around £7.50 but definitely worth it. The baozi are huge and are good bang for buck at £2.50. Will definitely be coming as a frequent visitor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "83Ci2Oztvfug7fXaZX09LA"
  },
  "GaeAoqpRxQqpPDBSQpmhBQ": {
    "date": "9/13/2009",
    "text": "Baozi Inn is a screaming deal on the West End.  For less than £8, you can enjoy their delightful set menu, which includes Baozi buns (two of them), two regular dumplings, a nice cold noodle dish, and a broth with more delicious dumplings.  Dumplings and baozi are definitely the thing to order here- friends we ate with had a more disappointing experience with some of the noodle dishes off the menu.  I would definitely go back though if I was in the neighbourhood, as it's a great deal and seemed very authentic.  Beware though: the staff definitely move at a brisk pace.  This is not a place for a leisurely lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aZGTn42PI10nzs0Amg-7qg"
  },
  "v5NzHkXz2cKVIVI3O8ud0g": {
    "date": "7/20/2012",
    "text": "The first couple of times I went to this place I really loved it. I loved the variety of foods on their menu, the decoration, the ambience, everything. But I stopped going because eventually I found their food to be too salty. It's a fun dinning experience, with all the Mao posters and Cultural Revolution decorations, and red lanterns. The food is good - good baozi (but not amazing baozi) good dumplings, the side dishes are all pretty good. I would recommend their baozi, dumpling, and noodle dishes before their rice dishes.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YqeTzeWqyQwZ4a_prnO2NQ"
  },
  "IWYQ1PEu_JHKSlwW-2lZ7A": {
    "date": "5/14/2010",
    "text": "Everyone should try Sichuanese food. A lot of British folks only experience of Chinese food is very Cantonese, and whilst I'm a big fan of that there's so much more to Chinese food - this is a country of over one billion people who had domesticated the pig about 7000 years ago - and for me Sichuan food is at the top of the vast variety. Gone are bright red gloopy sauces, replaced with many layered dishes: sweet, sour, salty, numbing, warming... So many different flavours and sensations combined into one dish and sitting perfectly together. Whilst Baozi Inn may not be the pinnacle of Sichuan food (it's not even entirely Sichuan cuisine, Beijing gets a look in too) it's damn tasty and cheap and a real one of a kind place in London, which I guess means the UK. My favourite dish is the Fragrant and Hot Pork Noodles, one of the few dishes on the menu bearing a warning red chili next to its name, and it's a well deserved warning too. Cubes of tender pork in an umami rich sauce laden with chili, served on top of the very distinctive wheat noodles served in this place. The baozi in their name is a type of filled steamed bun, the pork filling comes with masses of spiced minced pork and the egg filling very interesting, scrambled egg heavy with garlic, chives and spring onion. Their Three Sliver Salad is crunchy carrot, squeaky seaweed and rice vermicelli dressed in sesame oil with an undercurrent of chilli. So fresh tasting, full of interesting textures and a great palate cleanser - a must order. Chendgu Dumplings with Red Oil are pork in chewy boiled dough served in a puddle of fiery chili oil. The restaurant is nicely decorated, lots of dark wood and Chinese revolution posters (plenty of Mao). Service tends to be efficient and quick whether you're eating in or using their takeaway service, which I do frequently. Noodles cost about £6, smaller dishes around £4 and Baozi maybe £1.20. At lunch a set meal of main dish, salad and soup come in at £8.50, stupendous value for money. For some photos of the food see my blog here: cookingthebooks.typepad.…",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "K6htEc24wQQ4fL9MdX00_w": {
    "date": "11/29/2009",
    "text": "Oh dear. I've got a real problem writing this review. But write I must. One star for MSG - yet I would have loved to give at least 4 stars :-(Unlike so many Restaurants in the London China Town area this North Chinese Restaurant has very friendly staff. The menu has excellent choices and is reasonably priced. We were sitting under a large picture of Mao. I am sure Chairman Mao would not tolerate the adulteration of  otherwise excellent food with harmful, toxic Monosodium Glutamate that was in most of the dishes. The waitress assured me that they use a heck of lot less then the neighbouring restaurants. I just wish I had remembered to ask before ordering.Knowing that MSG has been used to prepare dishes leaves in me the feeling of foul play. Yet I am convinced that all dishes could be prepared using traditional ingredients and spices strong enough to blow your mind. The combinations, textures and presentation of the food was excellent. I love Chinese food and would be delighted to recommend any Chinese restauranteur principled, honourable and strong enough by stating boldly: No MSG here.Until then, I am sorry to say, I shall not return.No MSG please.Thank YouKarl",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kuqkY-jc2H29n_V0JIQa4g"
  },
  "QkztNdjJerBMThM6UYL6Tw": {
    "date": "5/9/2016",
    "text": "Came here for pork buns and dumpling soup and wasn't disappointed! It's cash only, the wait staff is a bit abrupt and the chairs aren't very comfortable but the food was delicious and cheap. Perfect for a quick meal for 2-3 people.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTbJKPjJWtiZg51DeRIDgg"
  },
  "YHjcqTrz1kKe0ChTs3xXIg": {
    "date": "2/6/2015",
    "text": "If you don't mind eating your noodles and dumplings under a big picture of the big Chairman (Mao, that is) and other commie kitsch, this is a great choice for fairly authentic, reasonably-priced Sichuan and Hunan snacks in Chinatown. The Chinese name basically means \"the people's co-op\" and the theme seems to be \"revolutionary nostalgia,\" with little tables and stools that encourage efficient, utilitarian eating - lingering over lunch is something for evil capitalist roaders! And those wonders of capitalism that are credit cards are not accepted, so hit the ATM beforehand. I stopped in for a quick lunch of wood ear fungus with \"mountain peppers\" and Sichuan beef noodle soup while in the neighborhood. The fungus was pleasant - a good example of a very classic dish, although I'm not sure what made the chilies \"mountain\" instead of just regular peppers. The soup was delicious. Excellent, rich broth, lots of good veggies and tender braised beef. However, it definitely needed a kick of spice. When I asked the server for some extra chilies, he brought me less than a thimbleful and it was mostly oil. I had a cold at the time and was coughing, and he laughed at me and said, \"Very spicy.\" I retorted, \"British spicy.\" He said, \"Chinese spicy!\" Yeah, maybe Beijing spicy, but certainly not Chengdu spicy. To be fair, I had been speaking in Chinese and I sound like Borat's American cousin when I do so, so the staff had every right to laugh at me a bit :) But I was still not nearly as bad as the big table of drunk Brits next to me who were throwing pieces of food all over their table in a feeble attempt to eat with chopsticks - pointer: you hold both sticks with the same hand, not one in each hand, guys. I'd stopped in here a few years ago, before I moved to London, for some dan dan noodles, which I also remember enjoying. I'll likely be back - great for a no-frills, tasty pit stop.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKtVaquILDCO9U9rM29m0w"
  },
  "Ygi_aDzFZqlC24o8iBfjaA": {
    "date": "5/31/2012",
    "text": "Baozi inn is one of the sichuan offerings in china town, away from the anglicised cantonese fare. The pictures outside scare people away, like red chilli oil doused meat dishes. It's definitely not for the faint hearted. BUT in comparison to Bar Shu which was CRYING BECAUSE ITS SO SPICY BUT SO GOOD hot, this place is relatively tame. Although, we did rock up at 9.15pm and we tried to try the less spicy things on the menu because spicy doesn't settle well in my stomach when i eat late. (i'M REAAAALLLY an old chinese woman, can you tell?!)Anyways, if you've read my reviews, My dining buddy is my mother. Don't laugh. She's AMAZING and also because she has the ability to replicate foods she's eaten in restaurants in her own kitchen. See where I'm going here? The bad. zhajiang mian. NOT HOT AT ALL. and the pork wasn't minced, it was diced so it all fell to the bottom of the bowl. Noodles were also a bit soggy. The good. sichuan lamb skewers, a bit overseasoned but nice and tender, and it was pretty spicy. Also the spinach salad with soybeans was really yummy, just try to avoid the garlic pieces in them if you're on a date. Eggdrop/seaweed soup was also very good, as were the beijing dumplings. I like Baozi Inn, I'll definitely be back to try their baos. Seeing that it is their namesake. (I'm not a big fan of big buns...lol) and I don't know why everyone was complaining about the wait staff, they seemed perfectly friendly. Quite good for chinatown standards. (Although my mother and I did converse with them in english, cantonese AND mandarin)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nuN9XdmenGHNTxoQ6tDoKA"
  },
  "bVQzVqRqZcs1x6Ux4k1omQ": {
    "date": "11/14/2011",
    "text": "I think its pretty simple when it comes to spicy beef noodle soups:  all that matters is the noodles.  You can rank the type of noodle preparations like this:1.  Knife Shaved Noodles2.  Hand Pulled Noodles3.  Fuck it, no one caresIf the noodles aren't knife shaven or hand pulled then there is no point.  Everyone knows that the broth is crazy oily and you drink it at sever risk to your colon, the beef is unimpressive and the veggies are an afterthought. So, clearly, Baozi Inn doesn't know a god damn thing because their spicy beef noodle soup was delicious even though the noodles were bullshit. Instead, the beef was tender, generous, and complex in flavor.  Seriously brilliant. If they had a dish of that beef served with rice and vegetables it might get five stars.  The veggies were super fresh and similarly outstanding quality.  The broth was average, you can't win em all I guess.  But if you dig spicy beef noodle soup this should definitely be on your todo list.   I still haven't found a go to hand pulled noodle shop in London but Baozi Inn has given me something to be excited about.As for complaints about the service?  Shut up.  Stop going to cheap eats places and expecting the staff to be nice to you when you are only going to pay them just slightly above cost for your meal and they are likely working a 12 hour shift.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6GrokFIVYpmEETAcsqrNxg"
  },
  "Xbm22www-fAo1T19-REzkg": {
    "date": "3/22/2009",
    "text": "There have been some nice little restaurants opening in and around Chinatown of late, which are broadening the breadth of Chinese cuisine. Most of the restaurants and takeaways in the UK offer Cantonese fare, usually in an anglocised form and it's nice (even for a ethnic Chinese person like me) to experience  more of the cuisine that feeds a quarter of the world's population.Baozi Inn is under the same management as Bar Shu just up the road and it offers the street food of Sichuan and Chengdu. Even the decor reflects the origin of the food with stools and an atmosphere that encourages slurping lovely bowls of noodles but not lingering, which is just as well seeing some of the long queues that form at weekends.It's nice to see that there has been little concession made for non-native palates with the menus warning that some dishes are fiery hot and believe me, they are! My favourite dish is a Chengdu favourite -  dan dan noodles (made fresh daily), which is smothered in a tongue-numbingly spicy sauce. Some of the soup noodles aren't quite as hot.The other speciality are the baozi, which give the restaurant its name - steamed dough buns filled with a variety of fillings.So the next time you fancy a change from the ubiquitous anonymous Cantonese places that dominate Chinatown, a trip to Baozi Inn wll make an inexpensive alternative to try.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "OapLWhQI4_Gm32-nYbHmUA"
  },
  "67BVwB5Ppdq5vT_o-xNaZg": {
    "date": "5/10/2012",
    "text": "Food's a bit hit and miss. I can't take much spice in my food but my friends go nuts over this place because they serve a lot of food covered in chilis. Personal nightmare for me. It's a very authentic restaurant although the decor is a bit tacky - lots of retro Communist propaganda posters. Almost trying a bit too hard to assert its authenticity in my opinion.I really liked my beef noodles - just like something I would find in Beijing. Texture of noodles weren't great, but the beef was good. I just wish there was a bit more beef though. Another complaint is that the soup was on the salty side, but otherwise it was a tasty dish. I also ordered some vegetable/pork dumplings - the wrapper was very thick (personally I prefer thinner wrappers, but that's a matter of preference) but a bit tough. They also arrived lukewarm probably because it was left in the window for too long. The restaurant was very busy, so the servers seemed a bit overwhelmed.All the servers were very rushed and frazzled. It's not really a place that you'll stay long and loiter for with people crowded in the doorway waiting for a table!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "LfkMzZ8ZK00vavIiwy0dVw": {
    "date": "11/23/2014",
    "text": "The food is delicious, authentic and fairly cheap. There's a loyalty scheme of sorts, and a couple house specials, like the Chinese plum drink and the Sichuanese spicy beef noodles, which are worth a try. The staff could afford to be a bit more courteous, though. They can be quite curt at times, and often try to rush you to finish the meal or leave the restaurant.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbCbV-LnftW76DADZws4sg"
  },
  "GMP-SJCY9eziBf3_FHImHw": {
    "date": "2/10/2011",
    "text": "Really, people? 4 and a half stars? Has Mao gotten to you? I refuse to kowtow to the commies and declare this place utterly meh. The staff acted like they'd been hoiked out of a Seinfeld episode 'No Soup for You!' My companion on asking whether any sauce came with his dish, as he had remembered it did, was told no, that is the authentic Sichuan way it is prepared and there was no sauce, EVER. Clearly they were unprepared to ask him did he want any or suggest something else. They certainly had a 'screw you, die now please, but not before paying us' attitude. It amused me, because, truth be told, I do like a bit of dickishness. But I wouldn't go back.Why? Because the menu is predominantly meat, the buns weren't great and I really didn't think the food was that good at all. It was average.However, I agree with Larissa G that it doesn't serve up the same old crap as everywhere else in Chinatown. But now I really must go as the villagers with flaming pitchforks are on their way.",
    "rating": 2.0,
    "rated": {
      "useful": 5,
      "funny": 8,
      "cool": 1
    },
    "photos": [],
    "user_id": "zsgH8afv2CDkn93jHtfBUQ"
  },
  "bp_F_pemCKUnrdT9ZU3f_w": {
    "date": "4/12/2012",
    "text": "Baozi Inn gets really busy in the evenings, and rightfully so. The food is pretty authentic and delicious! Baozi are enormous- don't order several expecting them to be the normal kind that fit several to a bowl.There's an egg baozi option for vegetarians, and several other dishes on the menu.Staff were rushing around and it seemed as if our table was partially blocking a door they needed to get to, but really, it was a great dinner overall.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzbrLD-mlyMFGtwKMTO4hA"
  },
  "6aNzkXUdeYpRgS8atF03wA": {
    "date": "8/20/2011",
    "text": "I think this place is just okay.  The special bun - wasn't so special.  I had the spicy beef noodles which was really good but not sure if it was what made me really sick the next day.  The sliced beef starter - I didn't think it was anything special either.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "TTLcuf2_0iIks8G39zdLbA": {
    "date": "3/24/2011",
    "text": "This review is a hard review for me to write. On one hand, the rest of my family really liked it and my dad, who can be quite picky, said that this was real traditional Chinese food.  I can see that. The rest of my family probably would have given it 5 stars.  But since this isn't a review from the rest of my family and is a review from me, I only give it 3 stars.  But for me, the food here was just... OK.  Nothing special or great.  Still tasted good, but I wouldn't come here a second time.The mapo tofu wasn't subtle at all.  I really like spicy food but this mapo tofu was just pure spiciness and lacking other important flavors.  However, the ginger juice spinach was very good.  It went down really well and paired really nicely with all the spicy food that you will most likely be ordering.  Also, the spicy wonton was very good.Overall, every dish, while good, just seemed to lack a 2% somewhere.  Still, this place is worth a visit to see if it suits your taste buds more than it suited mine.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1w9t2N68qJ_N39Y1mGSYrA"
  },
  "UK3FgHB_FzNIPQ4Oizmv_g": {
    "date": "2/16/2012",
    "text": "After a Summer traveling in China, I've been trying to find a place in London that has authentic hand made noodles that I had found throughout Asia.. Coming upon this place is probably one of my favorite discoveries in London!I'm not a fan of the service, but who's really there for the service?! Give me some noodles!! Obviously, I'm definitely a fan of the food - easy, tasty, and no fuss.  Just an FYI - if you're skinting it for the month, there's a certain amount to be ordered per head.. However, it's not too hard to hit that price mark.....when the food comes out to another table and it kind of makes you want to order one of everything to try.I get my usual dumplings and spicy beef noodles - on a nice wintery night nothing tastes better and warms the inside!  If you can't make a decision, try the buns (Boa-Zi) - that one is a no brainer - it's an easy go to. Enjoy!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eL0ZTTGZrpifuB6CosRTUQ"
  },
  "_y0bOlc-jNq7A7mkUFDy0w": {
    "date": "6/16/2013",
    "text": "I went to London for work and had a hankering for authentic Chinese food. I researched some places and chose Baozi Inn based on the yelp reviews. It was a little hard to find and if I walked too fast, I would have completely missed it. The place is pretty small, I guess comparable to other places in London. I ordered a pork baozi and Dan Dan noodles. The baozi was literally the size of my entire hand (not just the palm!) and the meat filling to breading was just about right. It was steamy and the filling was still juicy, I could drool just thinking about it! The Dan Dan noodles are what I like to order at almost every Chinese restaurant, first off its delicious, secondly it reminds me of home, and lastly it is a great benchmark to compare against. These were truly authentic, served with a side of chili oil that I had to ask for. It was so nice to be reminded of home while traveling abroad for work.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Km0JyDQYJa2_aNv4rHg4tw"
  },
  "QGgItrsGqqES-TU9I8-S2Q": {
    "date": "9/5/2011",
    "text": "This is where I tend to go if I want to eat Chinese food. The flavours are completely different to the black bean/oyster sauce Chinese restaurants.I love their seaweed salad and they have lots of small dishes at reasonable prices so that you can afford to try something different.There is a minimum £10 spend per head. Service is curt but overly rude.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "M5THN9pHCovlnU9ZNBO5nA": {
    "date": "12/26/2010",
    "text": "This place is new and I feel is as good as it gets in terms of the food, which deserves 5 stars! The service probably deserves 4 stars because it's okay but not brilliant and because you cannot pay by credit card which is a big pain from my perspective.The toilets, which I think are worth mentioning, are incredibly clean and pleasant. Certainly the best I have found in China Town. These by themselves deserve 5 stars. So, overall, a 5 star rating.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NFi-F1HO_VaoyDWxBDnXXQ"
  },
  "fezlEeHOMjIM8DvnQkaOfg": {
    "date": "7/13/2010",
    "text": "Sorry to disagree with the other reviews here but I found my second visit here distinctly underwhelming. Everything was just a bit off.Service: so-so. Waiter was attentive but the table was not properly cleaned, with a tacky feeling all over.Food: Bland. I had an egg bun and the pork and aubergine noodles. The bun was a little bit hard and dry on the outside and slightly bland tasting, and the noodles were overcooked and in a sauce that was mostly just salt, with hardly any meat in it at all. My green tea tasted strongly of bad quality tap water. Also something odd I noticed was that their food was quite literally superheated. I burned my hand picking up the bun, and 5 minutes after cutting it open it was still too hot to eat.  The prices were somewhat reasonable but I am sad to say that I'll have to avoid this place until I hear of improvements.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kO86Mqo5zhlFg88tX09-CA"
  },
  "8f64OH4H68XuLJquLIQnPw": {
    "date": "8/8/2010",
    "text": "This is probably the best chinese food i've had in central London. Their baozis are the size of your fist. Their dan dan noodles were really good as were their wonton noodles. Try it out!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SiJbi5-NzyJRPgYVlhAorg"
  },
  "TNxGHZBrxcqNvCq3lFA1dA": {
    "date": "12/9/2008",
    "text": "Excellent value for money! We had a drink, noodles, and a pork bun all for only £8 each. The pork bun was massive (almost a meal in itself) and had a generous stuffing of mince pork inside. However, it tasted rather flavorless, although some might say it is a good point as its more natural/original. The noodles are definitely very authentic, with traditional ingredients and soup broth. However, those that are not big fans of Chinese food and Sichuan food in particular might find it not to their liking as it really has not been altered for Western tastes. Otherwise, the noodles come in big bowls and are very filling. Decoration-wise the picture of Mao on a wall inside was a nice touch! The place is rather cramped and groups of more than 6 will be hard pressed to find any tables big enough.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "UT31NF4lceEwsTK2mv4vBA": {
    "date": "2/13/2011",
    "text": "For pictures and more please refer to my blog: hungryinlondon.com/2011/…  I really love the simple Sichuan street food served at Baozi Inn and the current visit was no exception. We are not talking culinary sophistication here but I think it's a fantastic place for a quick and exceptional lunch and you are in and out in less than 30 minutes. Exhausted, frustrated and frozen to the bone after some unsuccessful shopping I was revived by the house specialty Sichuan noodle soup (6.50). For me personally the pork was slightly too fatty but the meat was nevertheless very tasty. The soup tasted delicious and had a good kick to it without making me scream for water in agony. At this particular visit I was defeated by the Cucumber Salad (4:00). I usually pride myself of being able to eat any degree of hotness, in this case however, the Sichuan pepper in this dish was too overpowering and as a consequence my whole mouth was numbed. I have had this better at the Princess of Sichuan recently and also had it better (meaning actually edible) already at Baozi Inn before. Regardless of the killer cucumber salad I heartily recommend this restaurant. It's cheap, it's interesting, it's tasty and the service is comparably friendly for a Chinese restaurant. It's the best place to go to for a hangover cure as hangovers appear to be afraid of dried chili and Sichuan pepper. Also try the Dan Dan noodles, the pork baozi (I love Chinese buns!) and the salads. What am I saying, try everything! (no credit/debit cards accepted)",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "I58WeSx5f8_WGL-R-Qc2YA": {
    "date": "3/20/2015",
    "text": "Average baozi, no sauce, unpolitical and rude staff. They charged an extra tea and didn't accept my complain",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxIDmTp2bEFHbpHCvPq-AQ"
  },
  "5MAauKvrs99j_WxIH3qOjg": {
    "date": "2/8/2015",
    "text": "Baozi Inn is different from any other Chinese restaurant,  and not just in London but anywhere.  Their chef is a genius, the decor authentic, unapologetically Communist and contemporary.  That's why the queue to get in here on some days reaches the end of the block.Their food is absolutely outstanding in freshness and flavour,  but you will not find your average chow main and dumplings dishes here.  Having eaten at Baozi on several occasions,  I have seen more than once people puzzled at the lack of monotony in their menu leave after having sat down.  But that is their loss.Which other Chinese restaurant serves a cold salad starter of the freshest spinach steamed to perfection with added freshly squeezed ginger juice, toasted sesame oil and a few cannellini beans?  Deliciously tasty, and healthy,  too.  Has to be tried, Ginger Juice Spinach won't disappoint.  The Beancurd Salad is equally delicious, nothing here is stir fried into conformity.   Their soup starters are equally unique, very oily, and the chilli there is the hottest anywhere.My favourite dish is the Pockmarked Old Woman Tofu, served with boiled rice.  The sauce is so spicy that the waiter warns you beforehand, and the distinctive, zesty flavour in the red sauce comes through despite the heat.  The seating arrangement is somewhat cramped and uncomfortable in that you basically sit on a plank of wood with no cushioning, which I guess keeps the patrons flowing through as you won't be staying after food for a long chat sitting on a wooden stool.  Service is fast to the point of harassment.   Prices are average, with starters at around £ 4.50 and mains at £ 9.You can not pay with cards here, cash only, and you are not welcome to charge your phone should you need to.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "L5mm--V63mz-1Aa_oo7I2A"
  },
  "qe3FkLzKH8xqYJhG7FVbKA": {
    "date": "7/8/2013",
    "text": "A friend took us here, so I really wanted to love it.  Unfortunately, I didn't.  Nor did my fiance.Baozi's best dish, as far as I could tell, were its dumplings.  The dough tasted very fresh, but they only come in pork.  Otherwise, the offerings were a little uninspiring.  The steamed buns were huge and a little dry.  My beef in spicy broth contained very little beef, no spice, but LOTS of oil.  The broth was basically oil.  My fiance's pork noodle dish contained very little pork and lots of unflavored noodles.  So the food was just sort of... bland.The prices are okay, the atmosphere is cozy, the seats have no seat-backs.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aU6SIg3qip5EXGVDHhPg"
  },
  "f2PnZjRZtYb3T6wX_d8uZQ": {
    "date": "6/5/2016",
    "text": "We had beef sirloin and lamb shank. Lamb was very succulent (falling off the bone). Good spot for dinner in chipping campden.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JW2hZQfJLr5FNyTU-FQS_A"
  },
  "euChore9jP8vpje6_umMAg": {
    "date": "7/31/2010",
    "text": "Baozi inn, Sichuaese street food, have I gone to heaven?  The last couple of years, after reading Fuchsia Dunlop's memoir and cook books, I've had a fascination with Sichuan cuisine.  So getting a chance to try someone else's interpretation was a great treat.  After wondering around near where I thought it was I stumbled upon Baozi.  We quickly got a table, but you can tell space could be tight in this tiny place.  Service was quick and reasonable.  I think the people who might have complained about the service are used to have some kind of relationship with their waiter or something, but I saw nothing wrong with the service here.We got some dumplings (Divine!), some spicy noodles, and some Dan Dan noodles.  All of it extra yummy.  could have had a bit more heat but I'm guessing things are scaled back just a bit for the European pallet.  The sauce on the dumplings was great.But the best, mind blowing thing was the ginger juice spinach.  You must try this when you go here!  It is so yummy I can barely contain myself.  I also like the level of garlic in the dumplings.  A fair bit of smashed garlic added on the sauce that is put over the dumplings.  I'm serving my own that way next time I make them.  Just wish this place wasn't so far away!  Go and enjoy, but tell them you aren't afraid of the heat or the pepper corns and you'll get a good sweat going!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a6sDd6j02dt3QymAD-T9pQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom. yummy garlic and spicy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a6sDd6j02dt3QymAD-T9pQ/o.jpg"
      },
      {
        "img_id": "3bx7ITL5OkeiaWEykZf80A",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Dan Dan noodles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3bx7ITL5OkeiaWEykZf80A/o.jpg"
      },
      {
        "img_id": "ZYx-SfzrvgOWRquNvTZIgw",
        "caption": "Photo of Baozi Inn - London, United Kingdom. ginger juice spinach",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZYx-SfzrvgOWRquNvTZIgw/o.jpg"
      }
    ],
    "user_id": "JMP9JY5JV2HfWn8ClTBb6A"
  },
  "nmS_wo2m4RNpebd79_coKQ": {
    "date": "7/5/2012",
    "text": "After a number of drinks, some spicy food is just what you need to wake yourself up to ride off home...or to the next party. Baozi Inn was just the ticket to meet our needs.Despite it being quite full around 9pm, Pam T and I were seated within minutes and apparently just snuck in under last orders. We quickly ordered a range of dishes including (and I'm spelling this phonetically so don't get on my case) Mai Pao Tofu,  some sort of sliced beef in chilli sauce with chillies, house special dumplings, and I'm sure there was something else that my wine soaked brain lacks the capacity to recall.Overall, the food was delicious with clean flavours, fiery spices, and sweet high notes to complement the heat. The dumplings were slightly gummy and perhaps could have used a few more seconds in a hot pan for my tastes. I demolished the beef, hoarding the tender succulent slices as much as I could. Luckily my dining partner is semi-vegetarian and didn't mind focusing her efforts on the tofu.Service was overall good although our tea did take an unusually long time to arrive. And it was piping hot which, given the warmth of the day, was probably the wrong thing to try to drink quickly. Burned tongues aside, it was a tasty quick and easy meal and some of the better Chinese food I've had lately. I'm definitely keeping it in mind for those times I want something a bit more substantial than a steamed char siu bao from the vendor just outside their door.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "t4_uwfGX38lzl8w_WFmFKg",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t4_uwfGX38lzl8w_WFmFKg/o.jpg"
      }
    ],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "Kw-Xo1k4L8CmmZN-xj1aag": {
    "date": "9/7/2014",
    "text": "Tasty food - TERRIBLE  CUSTOMER  SERVICE.I would not wish this kind of attitude and service on anyone....it is certainly not worth it to endure even if the food was excellent.Our issue: we were a party of three adults and two small children (ages 2 and 4) for a mid- afternoon snack (14:30) and were seated at a small table for four.  When we asked for an additional chair for the two-year old, the waiter said the table was only for four.....in other words: you can leave or not feed one of the kids???Then upon ordering he stated that there was a minimum of £8 charge per person.....barely making a concession that the children could not eat an adult portion of anything.  If he could've stated this policy when we were seated, we would've selected another restaurant.One side note:  we didn't feel too discriminated upon....we observed another patron being scolded for helping himself to an extra spoon.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "a8LyrHfE53qtrxdFSTmv1A"
  },
  "txTKIKtyq6n8h12yY6n1aw": {
    "date": "12/4/2011",
    "text": "Our server looked sceptical when the two of us last night ordered the spicy cucumber salad, dumplings, dan dan noodles, spicy beef noodle soup and mapo tofu. \"Two noodles and a rice dish?\" he inquired with slightly less than a sneer.\"That's right, we're hungry!\" my companion cheerfully replied.He warned us the dumplings would take fifteen minutes. The cucumber salad arrived first, a glorious Sichuanese song of spice, vinegar and salt. I've never eaten spicier cucumbers than these and I adored every bite. Soon after came our drinks followed by both noodle dishes, the tofu and finally, the dumplings.I really enjoyed the dan dan noodles though they were less spicy than most renditions I've had in the past. Given the supreme spiciness of both the cucumber salad and the mapo tofu, I was almost grateful for the respite. Still, the noodles were practically bursting with umami and certainly a dish for which I'd come back to Baozi Inn.The spicy beef noodle soup was fine but not something that excited me nor something I'd necessarily call for again. The mapo tofu, however, was faultless. Quite possibly the nicest version I've sampled in London.The steamed dumplings, though not exciting to look at, were lovely especially with an application from the pot of black vinegar that arrived with them.As the weather in London gets progressively chillier, I can see myself hunkering down in Baozi Inn over a bowl or two of spicy goodness. I'll just make sure to visit a cash point prior to arrival to save myself queuing with the rest of  Leicester Square  post-dinner.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "gjhzKWsqCIrpEd9pevbKZw"
  },
  "vZmcsHFdXvrkaPiS3ks40Q": {
    "date": "1/5/2016",
    "text": "Stop reading this review and make a beeline for this awesome little joint! We enjoyed this more than Baiwei.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSYMJp2nzZUHLLdUUxvhAQ"
  },
  "tq09h0PPyfrjsad8N8GLmg": {
    "date": "8/26/2015",
    "text": "Went to this restaurant because of Lonely Planet's recommendation. To be honest it's a bit hard to find a Sichuan food restaurant in Chinatown because most of the restaurants there serve Cantonese food. I was glad that I've chosen this one - totally saved me from eagerness for spicy Chinese food! We've ordered sour and spicy noodles (酸辣粉), spicy wonton and congee. The congee was so-so but the rest were tasty! Would recommend this when my friend goes to London.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqrBc-0rQViX_RW7dinkMg"
  },
  "SupoilnLwNiK_hsZ30Ky1g": {
    "date": "8/5/2014",
    "text": "This restaurant's decor can best be described as Maoist kitsch, with Cultural Revolution-era propaganda posters on the wall and Communist opera playing over the soundsystem. I appreciated the attention to detail in terms of how the restaurant looks. It's one of the smallest of the restaurants on the block, and can be difficult to notice amidst the flash of the rest of the street. My date and I started with a pork baozi each. I wish we had split one, because I was expected a smaller-sized bun, as one has at dim sum. These were MASSIVE, and had to be picked up with two hands. My date was quite a fan of this place, though, and wanted to have a whole one to himself. The pork was minced and in a thick gravy, fine but underwhelming--I think I prefer the sweet pink cha siu than the kind of pork used here.I had the Dan Dan noodles after, and my date had spicy beef noodles. I preferred my Dan Dan to his beef noodles, but they were not especially memorable--actually, I'm having trouble coming up with anything especially positive or negative to say about them. I love Dan Dan noodles and theirs were fine, but not special. I have only eaten here and at Tokyo Diner in terms of Chinatown restaurants, and I vastly prefer Tokyo Diner. That being said, if you're coming specifically for Chinese in Chinatown, this is a nice, relatively authentic, buffet-free option.One more note: there was a bit of a line outside the door when we arrived, and we were in line behind an American couple who were incensed at the idea of a wait. The husband stalked away towards Shaftesbury Avenue, with his wife following. My date and I were seated at the two-top meant for them.Ten minutes later, the couple stormed back and demanded we get up so they could sit at \"their\" table. As an American abroad I was pretty embarrassed at the scene they were making. Hungry Americans! Let's all do better!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SUJpWth0v5OPFjPkt0H2jA"
  },
  "UwcM_mMiHA-v7InHz633kg": {
    "date": "11/15/2014",
    "text": "Top 10 Chinese in London. Hole in the wall gem. Authentic with Chinese opera music and red China posters on the wall.The Baozi's are great. Cucumber salad is incredible. Pretty much anything on the menu is amazing including the veggie stuffDon't embarrass yourself by asking for Chinese fried rice. Also watch out for the Baozi Nazi. If you dilly-dally with ordering she'll snap at you. Then it's \"No Baozi for you!\"",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hd4NVW-FOxvfSC7Yv4iYXg"
  },
  "93Dl36VbHhkOl8HXD_uKgw": {
    "date": "2/11/2014",
    "text": "Bao zi nothing specialDan Dan -- it's not even the right colorMabo tofu rice -- best dish hereSoy milk mehDumplings pretty goodNiu Rou moan are u kidding me Fen zen pai Hu bland Spinach whatever",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3SBz-sGpkvlWbLQ_jaDWAA"
  },
  "NqqClN0BDItvR37ly88TQw": {
    "date": "8/18/2014",
    "text": "I was introduced to this place by a fellow Asian cuisine-obsessed friend who dines there often. Knowing how much she enjoys a bit of spice, I was ready and excited to embrace the idea. I cannot remember the exact dish names, but we had a chili and cucumber salad, several of their trademark skewers and I ordered the spicy beef noodles. Everything was delicious and came to the table super fast. Just be prepared to leave as efficiently as you've been served--this is not a place where a table can host idle diners digesting their food at a leisurely pace, so you will be expected (a fact evidenced by all the glances coming our way from staff) to pay quickly and vacate.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r-8RJPagzhp7Cephx2ZJoA",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Spicy beef noodle soup.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/r-8RJPagzhp7Cephx2ZJoA/o.jpg"
      }
    ],
    "user_id": "eozhvLAH5HKRNQVncMvI7w"
  },
  "9mjchhsJLhxfjmr_ZUF-4A": {
    "date": "9/2/2011",
    "text": "First of all, allow me to establish my credibility. I grew up in Beijing, where I ate good food everyday and never appreciated it. I moved to Seattle, where good Chinese food was available but rare. I then moved to Houston, where I refused to eat at Chinese restaurants, period. On a silk road trip I had the chance to taste some of the spiciest cuisines known to mankind in Xi'An. I know how a good bowl of spicy noodles is supposed to taste--and how it's not. Baozi Inn knows their stuff. You can tell just by looking at their menu, which is written on individual pieces of bamboo hung on one entire section of the wall. Honest to god I did not have high expectations for Chinese fare in London, but Baozi Inn didn't disappoint the first time and never disappointed me after that. The spicy beef noodles with bamboo was a knockout and satisfied every craving I had. It tasted of home. I might have teared up a bit the first time I had a bowl of xiang la niu rou mian at Baozi Inn. Their soybean milk is homemade (non of that Silk crap), and the small benches and red lanterns remind me of old Chinese movies. It's a great place to bring close friends for an intimate experience, as space is quite limited.The only downside is the waitstaff. There is one lady that is particularly curt who will make you feel like you are doing a huge favor by eating there and that you should finish your meal in a nanosecond to make space for her other customers. You need not be irritated-just slurp your noodles at your own pace and stroll out of there leisurely when you have a full, happy tummy.Seriously, this is real, hearty, humble Chinese food. If you're not any of those, don't come here.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "p0HpSBcTbJsRkF43xIo3Lw"
  },
  "ELvnonRgqRM60xqC6J9FJQ": {
    "date": "11/12/2015",
    "text": "The decoration is trying to imitate a restaurant in 1960 to 1970 China. The price is very reasonable. The noodles are very tasty but kind of salty.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AtZ4VTw7Y6gzoRPI4grRSQ"
  },
  "qRB4hTODeRuu1131H4jeyQ": {
    "date": "4/15/2012",
    "text": "If you are looking for a small cheap place with authentic Beijing and Sichuan Food in London here is the right place for you. We ordered Dan Dan Mian (hot Sichuan-style noodles), Yu Xiang Rou Si (fish-flavoured meat with veggies and rice) and Jiaozi (dumplings). All of them were delicious. The place is cozy and pretty, the service was fast and we had nothing to complain. Although it's right in Chinatown and gets a lot of guests, there seemed to be always a space for whoever showed up spontaneuously. We came back the next day and the food was still the same good quality. A definite recommendation for everybody who wants to sample good chinese food in a friendly atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Clsa6NqhGgjMbZr16oaBA"
  },
  "5TwsJOPOWhfK3JC_3uWkhg": {
    "date": "8/28/2011",
    "text": "3.5 stars really for:1. Having garlicky seaweed salad (not that awful sweet kind that you get at Japanese restaurants)2. Generous portionsUnfortunately, the \"house special\" spicy beef noodles was neither spicy nor special. The wontons were alright but the flavor got lost when drowned in chili oil and garlic :(Bar Shu has tastier broths but WAY smaller portions so pick  your battles...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-4nQ-PHW_U8CCR0S1jT_w"
  },
  "SnMnojw09vknDO0dDEZ64w": {
    "date": "5/12/2013",
    "text": "Another Veggie update (Dec 14)The spinach noodles are gone. The veggie bun seems to be gone as well. They've added (egg) noodle dishes, and put the plain buns back on the menu. I had the winter lunch special: Aubergine & rice with 3 veggie sides. This is good if you want to try a little bit of different things and it's an absolute bargain at £8.90VEGGIE UPDATE! (Aug 14)A lot has been changing the last month or two. There is now a veggie noodle dish! It's Spinach Strange Flavour cold noodles.in Sichuan cooking, \"strange\" flavour is usually with vinegar and Sichuan peppers (which is in the chili paste that comes on top) and you mix it with carrots, cucumbers, bean sprouts and mushrooms. Yum! Be warned, it's a lot of noodles.I'm not sure if it's in the restaurant section or just the take away part next door*, but there is now a \"green bean\" bao/bun with mushrooms and black vinegar. No egg! You can also order a nice portion of the spinach noodles for take away too- for half the price!*As you can't get the giant pork bao in there anymore, just three small ones. You can only get it at the takeaway. --------------I am nuts about this place (pronounced bow-tzer). I've overeaten here for dinner and came back the next day for lunch. The smell wafting about outside reminds me of those cartoon smell \"mists\" that go up your nose and caress you as you follow them spellbound wherever they want to take you.This isn't your standard run-of-the-mill Chinese food that surrounds you and that wows me. There are only a few vegan options, but they are so good I don't care; I would eat the same thing everyday.  First, whatever your diet, get the hot and flower bean curd soup. It's that wonderful smell outside!  Silken bean curd, spicy broth, topped with nuts, fried noodles,and all sorts of textural wonderments. YUM!Get the plum drink! I drank it a lot when I was in China and it was so refreshing.Vegan run down:  Besides the soup, get the cold ginger garlic spinach. Delicious and bright. There are a few other veggie plates, but I can't get away from these two.  Your mains are limited to the aubergine rice plate (hearty & delicious) and the new Vegetarian cold noodles with \"strange flavour\". It may be vinegar, but it's delicious. It comes with chili paste on top too. There is also a hot noodle dish you can get without egg (depending on your server).There are some different grilled tofu and veggie stick options. Because they are cooked next door with the takeaway bao, you can see they are usually rattling around with raw meat sticks before they are grilled and also dipped in the same sauce. So have a peak if you are thinking of ordering them or use your own judgement. This also goes if you have a fish allergy! Notes: Sometimes service can be slow.Drinks can take an oddly long time to arrive.EVERYTHING IS COVERED IN SALT so be prepared.I really want to eat one of the baozi that are as big as your head, but I hear they're pretty darn good.Does not accept card, but the HSBC around the corner on Gerrad Street now has a cash machine.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRAypMPKxLAiFdhhpOGXBQ"
  },
  "fcqQUDNDLUaC0uVXQTrsGA": {
    "date": "8/14/2016",
    "text": "Pricy and worth much less than expectation.  We are new to London and found this place from Google.  The unique decoration immediate dragged our attention.   Some forum says this is a good place with many choices.  When we get there, notice they have one small store for take out and another bigger one to dine in. We choose to dine in, decoration is old Ma fashion which matches with Google introduction.  Then it comes the menu, Bao Zi is 2.5 pound each, while it tastes good certainly expense.  Most noodle is 8.5 pound but so so. We order two barbecue goat meal, small nothing special.   Later on when we walk into the Chinatown, we saw many restaurant with better price.  Definitely will not recommended",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7LTNW04i6Yx4WXS6eSKwg"
  },
  "ZLEhixwzMISSUfsqydkjYw": {
    "date": "6/17/2013",
    "text": "Baozi Inn, you might be Sichuan food but you sure as heck aren't authentic Sichuan food. I'm not even a fan of chili but I found the dishes we tried disappointingly mild. Maybe we just didn't order the right things but here it goes.The starters weren't too bad. We ordered the pea jelly, which came with a spicy(ish) sauce. It was tasty but it should've been ma la (numbingly hot!!!) the chili had a nice bite but the main letdown was the texture of the pea jelly - it was mushy and too crumbly! I've got mad chopstick skillz but I couldn't pick them up because they kept breaking! Whut.. The seaweed salad was good though! Crunchy and you can taste all the different layers of flavours. Not the best I've had but it'll do!Dan Dan mian - once they served it I knew it wasn't up to scratch. The bak choy had wrinkly skin! Noooooo. That's what happens to leftovers after they've been in the fridge all night! Dude, you throw the veg in and it's done in 10 seconds. Whyyyy? :( Plus, the noodles weren't hand-pulled like I thought but that would've been okay if they weren't soggy and overcooked! The noodles had no bite :( and the meat was under-seasoned and was generally a little bland :(( The pork rib noodles also lacked flavour and the ribs didn't taste of much but diluted soup. Not pleased.The dumplings were similarly average, perhaps too peppery for some. Our dumplings in garlicky chili sauce weren't very garlicky or chili-y - the mound of minced garlic could've gone unnoticed and even though you could see the red chili oil, it just tasted like red oil. If they somehow got these simple things right, the flavours would be much richer! But for now, it doesn't look like I'll be coming back.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYMkKm1hlV2eIX9hDY_Q5w"
  },
  "IvXgmlTX5trZAEUxAoioBw": {
    "date": "6/30/2018",
    "text": "The classic chicken noodles at Baozi is one of the best meals I've had since living in London, and it's a  great price.Tons of huge udon noodles covered in a spicy red garlic oil with loads of the best flavored chicken in Chinatown, and garlic pieces that melt in your mouth. I ate my entire bowl in minutes, which caused quite the stomach ache, but there wasn't anything I could have done different considering how delicious this bowl of food was.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDkKFMKw3J34LkqKI51gJQ"
  },
  "mGXiXSHZaQjs4VvHC1jzXQ": {
    "date": "5/11/2017",
    "text": "A friend and I were exploring Chinatown on a Sunday and came here for lunch since I was craving Chinese food. We arrived around noon, just as the restaurant was opening, and were the first customers there. The restaurant was a little tricky to find, as it's in an alley off the main Chinatown roads, and the name \"Baozi Inn\" wasn't written in English anywhere outside; however, my GPS was able to locate it. The inside of the restaurant was bigger than I thought, with 2 rooms of seating. The menu had both English and Chinese. Tea is £1.50 per person, but tap water was free. My friend and I each ordered a house special baozi (filling options that day were pork and vegetarian). We split the pork lotus bun small plate (it came with 2). I also ordered a bowl of porridge (also from the small plate part of the menu) for myself. The baozi is pretty big, and was delicious, as were the lotus buns. The porridge was hot and filling, and came in a small-to-medium sized bowl. The portions were smaller than what I'm used to in America, but my non-American friend was satisfied with the portions. I think the main dishes are also a lot bigger; some other customers at a nearby table were splitting a noodle entrée in addition to getting some small plates.Service was prompt and the food came out pretty quickly; the staff weren't overly friendly and mostly left us to ourselves. The men's/ladies' toilets were only denoted as such in Chinese, but the staff member who gave me directions to the toilets let me know the ladies' room was on the right, so it wasn't a big problem. The staff tended to assume we could speak Chinese at first, but after we responded in English, they switched over too. The restaurant was clean and not too busy while we were there, but more customers started trickling in as we were leaving. There's a £10 minimum for card payment; I was able to use my American bank card. Our total meal for both of us combined was just £12, so we didn't bother trying to split the bill after we found out about the card minimum.I really enjoyed my lunch here and would gladly come back next time I'm craving pork buns.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "et3mlJt85QUuNjrHzu41Vw",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Pork lotus buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/et3mlJt85QUuNjrHzu41Vw/o.jpg"
      },
      {
        "img_id": "xg2R09qjBsedpYbNtMU9DQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xg2R09qjBsedpYbNtMU9DQ/o.jpg"
      },
      {
        "img_id": "KMYCqpuTSnmqhUT9iAJdhQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom. House special baozi (pork) x 2",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KMYCqpuTSnmqhUT9iAJdhQ/o.jpg"
      }
    ],
    "user_id": "sB0UxWOQymWc_UH82lfN7Q"
  },
  "0r5nS3b34OhnbDglkw5EDA": {
    "date": "2/3/2017",
    "text": "I had the pork in chili and it was too salty for me and not spicy enough.I thought the food was just okay. The winter special was cheap tho and came with 3 appetizers.Pics of menus attached.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RNk2I7aOvxDwKmEDybOkYA",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RNk2I7aOvxDwKmEDybOkYA/o.jpg"
      },
      {
        "img_id": "3TN6EH7YtkUVvg-BL0pPtQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Lunch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3TN6EH7YtkUVvg-BL0pPtQ/o.jpg"
      },
      {
        "img_id": "VcLAZ63m8m-eBBc8Ugq8eA",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VcLAZ63m8m-eBBc8Ugq8eA/o.jpg"
      }
    ],
    "user_id": "892lwyzoBlpKt6QD-B0xuw"
  },
  "ueVwwX-0CBgY6-KGGob65w": {
    "date": "1/28/2017",
    "text": "Four stars for the food which was amazing and cheap!We ordered pork baozi and I ate a full bowl of sichuanese beef noodles soup ( which was supposed to be super spicy but it wasn't )It was good and you feel really full after it! And it's really cheap for good Chinese food in LondonBUT the service was really bad !!! The waitress was not nice, made me wait outside ( winter time...) because our group wasn't complete and she didn't want me to reserve the table !!! Not the best to attract customer...Except that food and decoration is nice ! I recommande it if you're looking for cheap and good food",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6bjgAJ-6IaQRZHvZbkcosg",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Sichuanese beef noodles soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6bjgAJ-6IaQRZHvZbkcosg/o.jpg"
      }
    ],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "9nh3bcbdyqMyBkrOinzAHg": {
    "date": "7/23/2018",
    "text": "I went there last night with my parents for dinner, as we were looking for a good dim sum place. We ordered the traditional buns and they were so doughy and barely had any filling. I ordered the chicken and shiitake udon soup and it was really good until I got home. I had the worst food poisoning I've ever had. The chicken definitely was not prepared how it should have been. The service was good, but I don't recommend this place.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IQNaoEu-iZkI4tArnFBV4Q"
  },
  "YnUn9SrN2UWgGlxJoegbdQ": {
    "date": "1/8/2018",
    "text": "My meal here was a disaster. The seating was crowded, the service was harried and unhelpful. The pork wonton soup I ordered contained an excess of dried krill, which were not listed on the menu. The house special baozi was so-so. They said on their menu they accepted credit cards, and even though we hit the minimum price, they insisted on cash. I would not recommend.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WX6DX3QFK_eBu_tEqzhH-Q",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WX6DX3QFK_eBu_tEqzhH-Q/o.jpg"
      }
    ],
    "user_id": "pryvgGeCsIXuxCYfK25mwg"
  },
  "vE6Lm3EqU7WTVW5y9lz7mg": {
    "date": "8/4/2017",
    "text": "I like the dumpling I ordered and seaweed salad and lamb skewers. Recommended all. Will df try something else from this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0ZZ875Z4hUTIMSScWkq4iQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0ZZ875Z4hUTIMSScWkq4iQ/o.jpg"
      }
    ],
    "user_id": "ulIUFqHi_gItpFo4I0P8eg"
  },
  "W3XvKKE2bbD5Xuw_FWudEA": {
    "date": "3/3/2017",
    "text": "Before you went in..the staff will greet you with CASH only. Another typical chinese restaurant. There are some good selection of foods; I particularly like the spicy noodles with pork. For the starter, I love dark Century eggs and the cold salad with chili oils. Good place to have a quick foods and go.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mlhat20jwGPGbIQsJFv_zQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mlhat20jwGPGbIQsJFv_zQ/o.jpg"
      },
      {
        "img_id": "z_C4htKX16Flsn3TWFcQkQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z_C4htKX16Flsn3TWFcQkQ/o.jpg"
      },
      {
        "img_id": "1HoDiLkPnD1NxBaSRTYHeA",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1HoDiLkPnD1NxBaSRTYHeA/o.jpg"
      }
    ],
    "user_id": "9mS7Wz2-qdgmHFumqTBs4w"
  },
  "kRomqCobXiNarT4jPdV8pQ": {
    "date": "12/20/2015",
    "text": "Utilized a Lonely Planet book and found this in the heart of Chinatown/SoHo in London. There was a wait outside the restaurant but luckily with a party of two we were able to get in faster. We ordered a spicy beef noodle soup, pork dumplings, vegetable chicken noodle soup, and spinach with ginger appetizer all for around £30 which isn't bad since we left full!Food was good except the beef noodle soup had lots of fat on the meet but they put a lot of meet into the soup!Definitely would recommend this restaurant for Chinese! Get there early and make sure you have cash on you. Also the staff is pretty upfront and straight forward with you so don't expect your waiters to get friendly.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2Aukvd6bFk5iTaLFMdyMZw",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Spicy beef noodle soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2Aukvd6bFk5iTaLFMdyMZw/o.jpg"
      }
    ],
    "user_id": "ezocVBopFJaUKU_zUFA-mA"
  },
  "V6D8tnuhkgnDKRm3dE-1uA": {
    "date": "7/18/2016",
    "text": "A quaint little restaurant serving northern Chinese dishes, keeping the decor very traditional with it's dark wooden tables and stools, windows and door frames. This was contrasted by the large use of red decorations such as lanterns and firecrackers. Walls were filled artwork showing a huge support to the communism revolution which was a bit shocking.It was a peaceful atmosphere, nice and dark bringing you out the hustle and bustle of Chinatown. It can be a bit too quiet at lunch and the cold service doesn't help and might be off putting to some. However during dinner hours the place is rammed and you often see a queue forming.Three sliver saladConsisted off bean thread noodles, carrots and seaweed which was what gave it that lovely crunchy texture. It was dressed in a lovely fragrant marinade made primarily of sesame oil and a mild chilli oil that gave it the complex flavour which made it very addictive to eat. House special baozi (pork)A very well made bun, milky and fluffy in texture and generously filled with grounded pork inside. The flavours were very balanced and the addition of onions in the pork is what gave it that lovely caramelised sweetness agaisnt the umami flavours. There was the other option of a vegetable bun but we stuck with the traditional pork.Chengdu dumplings in chilli oil and a garlicky sauceOne of the finest dumplings in Chinatown won by the thinnest of the pastry and the generous aromatic pork filling. It was incredible, especially the delicate silky texture of the dumpling skin against my tongue before biting into it to release the juices and umami flavours of the meatball. I love the added greens in the meatball to give it more depth and flavour and the garlic chilli oil just boosted the flavours further and added a good kick of heat to it. Fried egg and tomato noodlesA very light noodle dish offering a clear fragrant chicken broth with a lovely sweet egginess to it leaked out by the juices of the perfectly fried egg, that's still springy and silky smooth in texture. There was an abundance of sliced tomato to give it some nice mild citrus notes. They were also generous with the egg noodles which were lovely and bouncy. Sichuanese spicy beef noodle soupA much more rich and warming soup noodle dish that was incredibly good for it's price. The soup was rich with complexity from the herbs and beef stock in there, packed full of flavour with a good mild heat in there to make things more exciting. Seasoning was perfect which was hard to believe as many places in Chinatown has even had it too watered down or too salty. Beef were tender with bits of fat attached giving it more umami and egg noodles were cooked to al dente perfection.I do very much love Baozi Inn as it is good decent food at very reasonable prices. It's a place suitable for a quick bite or a meal with friends and so you find both the single diners and the slightly larger groups. The place is small though and can be quite offensive to some to do not support communism. The only thing that let me down was the service, the poor manners, abruptness and coldness from the short hair lady staff but lucky the food made up for it.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "tHJKDumTnVfLT39gSOrgfg",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tHJKDumTnVfLT39gSOrgfg/o.jpg"
      },
      {
        "img_id": "rk8XxQ3rnMz0Z_i8b6NUFg",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Menu cover",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rk8XxQ3rnMz0Z_i8b6NUFg/o.jpg"
      },
      {
        "img_id": "eusOaLpTxcEv22-31Fmlag",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eusOaLpTxcEv22-31Fmlag/o.jpg"
      }
    ],
    "user_id": "GhmA0xBVIxxlfOhnEiUyIQ"
  },
  "XYHRjC_CbRXOir8gusI0Cg": {
    "date": "2/9/2017",
    "text": "We all have our own versions of comfort food and fresh, hot bao is one of mine. Today it is cold, blustery and damp in London and I stumbled upon this place while walking to the train station from a meeting. I first noted the Baozi Inn signage and looked in the window to see lots of people crowding in for bowls of piping hot dumpling soup. Then, I noted that adjacent to it was a small little shop with a forlorn woman sitting behind the counter and a small steam cabinet full of fresh pork and vegetarian filled bao. 2 quid each (cash only) and she puts them into a white paper wrapper. They were warm, steaming actually and quite large although 2 quid seems a bit on the high side to me. They certainly worked well as hand warmers in my coat pocket but I couldn't make the train without ripping into one. I am a purist so I bought the pork ones because vegetarian bao does NOT exist in China (neither do solar gardens, Subaru's, or Jesus sandals) and can only imagine that this was somehow a result of the London Chinatown granola club or something. What I got was steaming hot with chewy dough and juicy pork filling that was quite tasty. It really hit the spot even though I had just eaten lunch! Am saving the other one for a midnight snack when I awaken jet-lagged in the middle of the night bored and hungry. Will definitely go back to grab more of these meat donuts when I am back in the area.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "4W5UE3j5IoLgzSYrL-ZXdw",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Pork bao hot and fresh",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4W5UE3j5IoLgzSYrL-ZXdw/o.jpg"
      },
      {
        "img_id": "bUBX1QthWb5WBg-BLUKmog",
        "caption": "Photo of Baozi Inn - London, United Kingdom. Line at the front door",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bUBX1QthWb5WBg-BLUKmog/o.jpg"
      }
    ],
    "user_id": "WHe5tyJbVpkvO_3meMUrdg"
  },
  "kcJiOmmt4FXpLEpFrX0RQg": {
    "date": "10/12/2017",
    "text": "It's hard to find good Dan Dan noodles in London, but this place is probably the best I've had here. The pork bun was also good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e53cYSPf4v51YmPH2_ludw"
  },
  "MVT_8Uz9PIwneNzCjpjsvQ": {
    "date": "3/17/2017",
    "text": "Visiting London and decided to drop in based on online reviews. Definitely not the expected experience. First--cash only. Second, service was horrible. They were significantly more polite to their non-Chinese customers, and we were definitely on the colder receiving end of service. Not only did we have to change our order (because suddenly an item was no longer available on the menu) but they also forgot to place the order for one of our party, didn't realize until we flagged them down, and never apologized/brusquely set down the order a while later. Lastly, the food was okay; not a tourist trap but also not particularly authentic either. The portions are not worth the money or service; the appetizer of lamb skewers might as well have been only the skewer. Overall, not worth the hype. Your money (and time) would be better spent at one of the many other shops in Chinatown",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZ-U5BSPpE5kQe7-DYNDXQ"
  },
  "OitRfr_qy9XVrA4rQ39spg": {
    "date": "1/12/2017",
    "text": "+ Skewers had good flavor+ I really enjoyed the pork buns, though would prefer a higher pork-to-bun ratio. still, super savory and juicy~ Maopo Tofu was solid. Right amount of peppercorns, but wouldn't write home about it",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5fZxBSecRRJEUZJds6P6Q"
  },
  "ZbBWZHJvVAR68aNUVtAzbA": {
    "date": "1/1/2015",
    "text": "菜还行，服务很一般，只收现金。酸辣粉很过瘾，凉拌百叶很脆。饺子和包子都一般，麻辣烫的食材和汤汁的味道都不够好。如果你想尝试一下文革风格的餐厅，可以去一下这家或者附近的\"大跃进\"。各种大字报，海报，红灯笼和红歌，还挺像模像样的。我们的服务员态度还行，但有点不靠谱。明明可以点麻辣烫却告诉我们不能做了，上饺子也不给醋，问她要放在豆浆里的糖答应了却忘了拿。吃川菜的话还是隔壁大跃进味道比较好。",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sY_uz6P1sux3tKt1TEGqjA"
  },
  "PiQKD5Zy-bIbw0ySlUCJFg": {
    "date": "8/17/2017",
    "text": "This place is overrated. Dumplings and boa are at best average and over priced. Portions are small, service was okay and ambiance was authentic. Don't know how this place is Michelin rated. Would definitely not be back.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4OWA9XIUPYVSoujw_nIbQ"
  },
  "1o-dqIoDSbdkY7lmEo30QQ": {
    "date": "1/18/2016",
    "text": "For those familiar with Northern & Northeastern Chinese cuisine, this is a must-go in London's Chinatown. You'd be pleasantly surprised by the decor - at least I was, having not seen such an earnest attempt to emulate the revolutionary era by a Chinese restauranteur in so long (not even in mainland China, let alone the Chinatowns in the US). We ordered practically everything on the menu - skewers, noodles (they've got an assortment of local noodles from various regions in China; and for those who know, they're very different), baozi (buns), jiaozi (dumplings), cold skin noodles, hot spicy stews....loved the skewers and the baozi especially. Prices are really down to earth as well. Not sure how those unfamiliar with the cuisine feel, but for us it was like a trip home.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DAhNjw2W4IL2C0Gqa2EZjA",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DAhNjw2W4IL2C0Gqa2EZjA/o.jpg"
      },
      {
        "img_id": "cf-AAxwzk863dARtcwk1BQ",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cf-AAxwzk863dARtcwk1BQ/o.jpg"
      },
      {
        "img_id": "luUl7JiTMYyU6BEPsw4g3w",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/luUl7JiTMYyU6BEPsw4g3w/o.jpg"
      }
    ],
    "user_id": "AoFSDwZ5ER-tDNrmVzCyIg"
  },
  "ewJLrnx7DfTT52FHxZGmlQ": {
    "date": "6/6/2017",
    "text": "Braised pork noodles really tasty. Beef noodles abit bland however good overall experience",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "YVY9UGJ2iBvUqTHtO6bmaA"
  },
  "KyBP3p_9tkj6ybz4xMWFTA": {
    "date": "3/31/2014",
    "text": "Very interesting food, but while I'm glad I came here I'm not likely to ever become a regular because if you do not particularly like fish or red meat then your options are vastly reduced! Most interesting looking dish i have had so far this year award goes to the gelatinous eggs I attached as a photo.They squeezed 3 of us onto a two person table. While this was a bit annoying, especially if anyone on the table behind wanted to move... And arranging the various sized bowls and plates that arrived took some arranging...would I have preferred to wait another 10-15 minutes for a more suitable table? Probably not.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bo1KHxKb7Iq12wtE-pXv0w",
        "caption": "Photo of Baozi Inn - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bo1KHxKb7Iq12wtE-pXv0w/o.jpg"
      }
    ],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "Zou-B52bQp4iYJ4-VEaOvA": {
    "date": "5/4/2014",
    "text": "This place is my religion. Called Bao Zi Inn in English but '人民公社' - 'The People's Canteen' in Chinese (a tongue in cheek joke about life in communist China during the latter part of the 20th century.) This is, in my humble opinion, the one of the more authentic of the Chinese restaurants in Chinatown. Its menu is small and modest and consists mostly of noodles, dumplings, cold salads and individual rice dishes. The restaurant is small (don't bring a large party here!)I come here often for lunch and order dan dan noodles, zha jiang noodles or beef and bamboo noodles. Their noodles are excellent and very authentic, certainly the best I've eaten in the UK. Some of the spicy dishes are very spicy so beware but if you're a fan of Sichuan cuisine, maybe ask them to add extra chilli is it's not quite THAT authentic. ;) The fact that this place is always filled with Chinese expats and students longing for a taste of home should be pretty telling. Do not expect to find the kinds of dishes you've become accustomed to at your local takeaway or at many of the other restaurants along Gerrard Street.The seating isn't very comfortable but this place is really designed for a quick meal rather than a long drawn out affair so I've never found t to be a particular problem. Service is curt, not rude but it's a Chinese restaurant after all so I don't complain about service unless someone has been actively mean spirited in some way.12.5% service charge is included. Minimum charge per person is something like £8 so that you don't come in and just order a bowl of £7.50 noodles. Get a pot of tea and everything will be under a tenner. 2 people can enjoy massive bowls of noodles or a rice and meat dish for a very reasonable £16-17. What's not to love about that?",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "llrwTkcI8u1hRADL-5Lj_g"
  }
}