{
  "f7SrfucwXK_3Kgw7C6JWeQ": {
    "date": "6/1/2013",
    "text": "Decent lunch, good coffee (plus they give you water), but on our visit on Saturday afternoon the service was very slow. The waiter was perfectly nice but everything just took rather too long, so leave yourself a lot of time.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZStpPAlH6n7HnwL6F9XPw"
  },
  "BE8AqSlsymTum2tveX8D3Q": {
    "date": "7/2/2012",
    "text": "Great place for coffee and sausages for Sunday brunch...menu a little limited, but that's the Europeans for you...not rushed off the table at all despite it being busy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tlOVgfsDiv_MNf2ov-oK7A"
  },
  "VjUlKqJDH_56qkprV1owug": {
    "date": "6/12/2011",
    "text": "So I did get back here because the line at the Breakfast Club we deemed to be too long.  We could have waited the line at BC, because at least that place knows what service is unlike Kipferl.  Interfaced with two wait staff--yes, the same bad guy from the previous review and a surly woman.  The food took forever, had to hail them for the bill, and they just well, sucked.  The clincher was that when the guy described the Austrian Farmer breakfast, he neglected to mention a couple of ingredients, one being mushrooms, and mushrooms are the one food I despise.  So I was grumpily picking out mushrooms.  Oh, and it was so hot and stuffy in there.  Thoroughly disappointed.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "OhluM1JtO1Wh7pZZ3hZ0aQ": {
    "date": "4/30/2014",
    "text": "Delicious meal with friendly staff, even when they're busy with a full house. Huge portions so no danger of going hungry, yet still managed to squeeze in a slice of Poppy Seed Cake topped off with lovey coffee, which comes beautifully presented with water and a tiny Milka - totally worth the squeeze.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lQFXpfUmI5Ut4Y8Ty05Chw"
  },
  "awPNyasn7xxsvvxhoxltlQ": {
    "date": "4/1/2012",
    "text": "Lovely place to have authentic Austrian cuisine. The goulash and the Kaiserschmarren are fantastic, the schnitzel is very good (although when I went there last, it kind of lacked the evenly golden colour you would expect in Austria..). Good beer, friendly atmosphere - a must-visit for all expat Austrians and everyone who loves Austrian cuisine. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lE_KIx-f7NDLmDw4MqYGkQ"
  },
  "GgIvDlCmUFw8mxWoqG9Www": {
    "date": "9/9/2011",
    "text": "I visited Kipferl some weeks ago and I liked it! Not like a viennesse coffee house but still good. I ordered a apfelstrudel and tea. Both really good. The staff was friendly and on my way out I bought a bottle of wine and Mozartkugeln. For me its good that they are so near there I live so I will certainly go back! And I can speak German with them which is good and also makes it feels like I'm back in Austria.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "vwOqBUDT0kdrNf6mt55eiQ": {
    "date": "4/8/2011",
    "text": "Would you like \"wos hinter die kullissen schiabn\"? Come again? - The above is a Viennese idiom for \"eating\"...the literal translation being \"to put something backstage\".Anyway, this has little to do with what I want to talk about in this review - namely the opening of Kipferl's new location in Angel - after they sadly closed my beloved store near the Barbican. In fact, I was a little sceptical when I found out that they're gonna open a new and bigger store in Angel: would they be able to make it as cozy, intimate and charming as the original location? Would they be able to keep up the good service and the high quality when opening a bigger store?The unanimous answer of my multiple selves is: YES! In fact, I like the new location even better: the design is modern, yet tasteful and cozy. Everything is impeccably clean and proper - yet that doesn't mean it's sterile and cold...it's in fact a very inviting space and I can easily imagine having breakfast, lunch and dinner here in one day!Additionally, I really appreciate that the owner of the Kipferl has very high standards and knowledge when it comes to providing excellent service. I was overhearing today how he was training his staff (that just started today) and what he told them was exactly what I have internalized after many years of working in the 5-star hotel industry! In fact, I was feeling this tingling in my fingers again - this tingling of wanting to own my own café one day! And guess what...I would want it to look, feel, smell, sound and taste like Kipferl!Now, I'd like to finish up with a final lesson in Viennes: \"an Elefontn auf da Blosn hobn\"...the literal translation being \"to have an elephant sitting on your bladder\"... and indeed I now have to run to the bathroom after all this Viennese coffee I've been drinking...ba ba!!!",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "k85nLSjxlHRM0qSeyikNLg",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k85nLSjxlHRM0qSeyikNLg/o.jpg"
      },
      {
        "img_id": "ETUJsGVdCGUewmwEAEGnRw",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ETUJsGVdCGUewmwEAEGnRw/o.jpg"
      },
      {
        "img_id": "EI9jiwcwrHFhfL4wlqAGbA",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EI9jiwcwrHFhfL4wlqAGbA/o.jpg"
      }
    ],
    "user_id": "Cqw4fJYJwkufdQSmLXEnug"
  },
  "FfgcqDfXo51ApJ5M6DdyxQ": {
    "date": "5/29/2016",
    "text": "This is a truly outstanding Austrian café with excellent food.Don't believe any reviews on this site from people who 'found the queue at Breakfast Club too long and so stumbled in here'. If you are someone for whom Breakfast Club holds appeal, please go and calmly queue for two hours to eat your third-rate breakfast burrito and leave us in peace.Don't believe any reviews on this site from dodgy Americans with nerd glasses who 'stumbled in here because the takeaway queue at Coffeeworks was too long after my jog from the City'. What you WILL get at this stunning blend of laid-back tradition and youthful modernity is tasty meals (recommended: Schnitzel, Spinach Dumplings, Rostbraten, among many others) and quality drinks. (Don't expect Italian-style coffee; this is not Caffé Nero after all, Austrian coffee is considerably different). The service is usually excellent. The Hungarian and German waitresses are especially good. My one regret? They have recently pulled Stiegl beer from the menu. BIG MISTAKE, PLEASE BRING STIEGL BACK.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6xftJbQuCX9v8kY-wo8B5Q"
  },
  "AHymreBUwkSZ01JRLPntIw": {
    "date": "4/12/2015",
    "text": "Came to Kipferl for dinner with friends.The hearty Austrian food was delicious and the wine very nice! The atmosphere was relaxed and unpretentious with a lovely service. Definitely planning to come back to try the cakes and coffee!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c2k3j_9lWKF83AY7p3em_A",
        "caption": "Photo of Kipferl - London, United Kingdom. Delicious spinach dumplings, they come with a side salad!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c2k3j_9lWKF83AY7p3em_A/o.jpg"
      }
    ],
    "user_id": "vfHm4vC5wCNGRX84-Ws6Sw"
  },
  "SLljz5V5kSz7Ul-ssG28aQ": {
    "date": "2/28/2014",
    "text": "Perfect service, extremely friendly the coffee we had was of the highest quality at a very reasonable price. Decor is very homely yet unique will defiantly come back for a cake next time",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n8sJKlxXSGTeqfMytMpytQ",
        "caption": "Photo of Kipferl - London, United Kingdom. HOT soya latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n8sJKlxXSGTeqfMytMpytQ/o.jpg"
      }
    ],
    "user_id": "KeB4uBqHFMVdO875jPUUkA"
  },
  "Y20kOBoz_e2LDvdqscwmdA": {
    "date": "11/14/2013",
    "text": "I admire in my Austrian friend her incredible efficiency. That's not exactly why I like to do weekend work at Austrian café Kipferl, but the fun yet functional environment does keep me motivated and focused. It also helps that there is no background music to compete with my thoughts--just the comforting whir of the milk steamer, and the occasional clattering of plates being stacked in some doubtless efficient manner.The crowd fit right in--some for work, some for play, all for pleasure. Art supply and art book-wielding, bespectacled and sneakered, chatting and computing--anyone is welcome. I even saw a small girl in one rocking princess outfit.My starter-sized spinatknödel was an oily comfort, a good holdover between lunch at The Narrow Boat and dinner at Meguro. I'll come back sometime else to try the spätzle, when I want to kick up the fun over the functional. And I'm considering wearing my princess outfit for that occasion.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhHdA-UuG5DG1XYXfClPtQ"
  },
  "DLvV3tHUJ-9QY-Bz4H_Z8A": {
    "date": "5/3/2014",
    "text": "The one thing in London that I haven't been able to find is a great cup of coffee. Even the Starbucks tasted off. Caffe Nero was okay. The hotel was awful. The work joe tasted like coffee'd up tea. It's like New York that way. You would THINK that there would be good coffee everywhere but it just isn't the case. I hadnt yet found anything to compare to Vivace or intelligentsia or...well, any of huge amazing Los Angeles coffee places.This place came the closest. The coffee menu is depicted by color, light to dark roast. As is done in Austria, I guess. The pastry, gluten free, was very nice.The side chocolate was a perfect complement. And the waitress was terrific. Helpful, funny, almost non existent except when she was needed. And she seemed to be handling the entire place alone.For her alone this place gets the 4th star. I would probably be a regular if I lived here,",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HaupboeTfO8e6SW_RirrTQ"
  },
  "2b6cJgQxtx1FsHF6OG8kMg": {
    "date": "6/7/2015",
    "text": "We enjoyed a lovely breakfast at this Austrian place. The menu is not enormous but enough to find something you like. We enjoyed the omelette that was delicious aside with some good coffee, extra ham, cheese and some bread roles. Will go there again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ei7lKSvBMMr9bPPdmadhA"
  },
  "2kiiLGVdg3RdTVjUG0jcCg": {
    "date": "11/23/2014",
    "text": "who knew i could find such wonderful austrian food in london. cozy, cute and affordable cafe in islington.what i had:- frittatensuppe (pancake soup): just like it tasted in austria! the broth was flavorful and the pancake strips were just right. i could eat this every day.- spätzle: this is quite a large portion served in a cast iron pan. very simple but tasty, and the melted cheese adds a great flavor to the dish.- goulash: the meet was very tender. this was also served with spätzle (although no cheese on this spätzle) but it tastes amazing with the sauce.- espressokuchen: a gluten free espresso cake with a very light texture. would definitely order this again. if you're looking for a great austrian meal in london - this is the place to go!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHAreG3KixFTfxtzjCMtGQ"
  },
  "xmEAHB5C5fbrvvTbV1bz7w": {
    "date": "6/15/2012",
    "text": "Great Austrian restaurant near Angel. As a Schnitzel-addict, this place is absolutely essential for me, since it is the only restaurant in London that serves decent, authentic (and very reasonably priced!) food. Apart from the Schnitzel, the Goulash is excellent, too. And if you have any room left after your main DO try the Kaiserschmarrn - delightful.Also good for breakfast/brunch, but it does get very busy, so worth calling ahead.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zEnlbAUD4-7Nkl7BJqHC8A"
  },
  "m_T9eHs7bb1NXX1W74v-kA": {
    "date": "2/16/2015",
    "text": "Very good service, quiet place for dinner! The beer is also very nice and you should definitely try the cakes!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DetPqwxuNWJPUI2xL6UrCw"
  },
  "C4nIybFcvxLCc-8-rK1mDQ": {
    "date": "7/22/2013",
    "text": "I get this cravings for the German sausages once in a while, so we went for Saturday lunch. The service was soooo slow and believe it or not, they ran out of frankfurters by 12:30pm. So we ended up with Hanagrian spicy sausages which weren't spicy. They came boiled lukewarm and with small slices of rye bread, pot of grated dry horseradish (what's the point?), mustard, pickles (wonderful) and horrible overcooked bland saurkraut which was the worst I've ever eaten. They charge £2.70 extra for this awful saurkraut and pickles, so just order without. Scnitzel smelled and looked good. We will try it for dinner one day.I hope they do something about the slow service. One guy was serving 10-12 tables at the back. There were other guy serving at the front and two ladies behind the counter but God knows what they were doing. We ended up taking our bill to the counter to pay. They do need another serving staff at peak times.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU-ZbzQ-GLDoqOIzNTuT0A"
  },
  "ZTnPWn5FWN2SOCxsNvz9hg": {
    "date": "10/6/2012",
    "text": "Did you know about Austrian soul-food? Well if you didn't, Kipferl will educate you in it. Hearty Austrian dishes will hit the spot on cold blustery London evenings (or afternoons). With a charming location and cozy interior, Kipferl is the perfect place to take a date. Be sure to book ahead as it fills up quickly! On a personal note, I went once having made a reservation via open table. Due to some sort of error the reservation hadn't been recorded. However, the host graciously seated us anyway (the place was quite full) and made no sort of to-do about the whole thing. Lovely service (and great coffee too!)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lK_32lYJ-p_fjc01G-DPLw"
  },
  "GNvcTBymkuAsAOERRxuaUg": {
    "date": "4/8/2012",
    "text": "I have been trying to grab a table here for *so* long.  Anywhere that serves Kaffee und Kuchen in Angel is on my must visit list and Kipferl's Kuchen looked particularly mouth watering through its windows on Camden Passage.  However, every time I tried to pop in it was full, forcing me to find satisfaction elsewhere.  Yesterday, there was finally room and we were escorted to a little table with a good view of the cake selection.As other reviewers have said, Kipferl is Austrian all the way.  As a result, coffee comes in a few unfamiliar forms.  I can't remember what I had but it was a bit like a big Macchiato or a short Cappuccino (depending on your point of view) and was a perfect accompaniment to the Sachertorte which accompanied it. Service was brisk and friendly and the atmosphere was filled with the contended noise of cake munching.  Clearly, this place is popular for good reason.I haven't tried the restaurant part yet which serves (surprise surprise) Austrian fare.  However, if it is of the same standard as the Kaffee/Kuchen part it looks a good bet to me for a weekend meal!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXcEvJHocUnXLGl0xILYgw"
  },
  "b30ak-5P603GdKFFkmF1Rw": {
    "date": "7/4/2012",
    "text": "2 days after a great weekend in Vienna I went antiques shopping in Camden Passage and stopped for late lunch at Kipferl, totally randomly.  The place is very simple but stylish. Popped in, got a menu, received a big smile.  As I went through the food I realised I am in an Austrian place and had a nice chat about it with the waitress.  Food was delicious and service very efficient with no fuss about it.  I enquired about their beers and they were able to describe them all.  I went back 4 or 5 times, took friends there, my parents on a pre Sadler's Wells show and each time it was a success.  Good portions, good food, good location. Few annoying points though: the noise from the bathroom, the draught from the door at the back of the room where it is freezing in winter, and the take away cakes a bit too pricey.  I've been back and I'll go back again.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XAX-01tTWWBCj6W28CMbYQ"
  },
  "4fo-3IALDJGyxYL3fRrxjw": {
    "date": "10/12/2014",
    "text": "Bought a take away coffee on a Sunday afternoon and it was so burnt, took a few sips but had to throw it out. The service was friendly and the place seemed ok for brunch but I can only judge on what I experienced. Won't be back here. Coffeeworks a little further down Camden Passage is excellent, go there if you want nice coffee.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8LrChRAVcrJix3D7tWupg"
  },
  "gjfuv2tCCDRDLPVUAU1mZA": {
    "date": "5/8/2011",
    "text": "Note: There is nothing German about this place - Austrian *all* the way. Ok, I'll be honest, I'm not a German/Austrian border-guard food scientist. I haven't the faintest idea what makes Austrian food Austrian and German food German. But I will blind you with my science of analyzing a damn good coffee, and I can happily report that Kipferl's Viennese coffee takes the knodel. (The Austrian type, NOT the German variety, mind you.)There are few better ways to while away a Saturday morning than sitting in Camden Passage, sipping a Viennese coffee and munching on a giant cheesy sausage... and that's no euphemism, folks!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "BUB_t_Rvzs1yPEzZipkWjw"
  },
  "fkzTNBXTKJXCq6llIzDN0Q": {
    "date": "10/29/2015",
    "text": "Mixed impressions.  Kipferl's website creates an expectation of a nice Austrian/Viennese cafe.  In the flesh, in that department the restaurant falls a little short.  Ambiance is nothing special.  On our visit it was particularly noisy and uncomfortable.  Service was fine but again nothing above average.  We ordered the Bauernfruehstueck, spinach dumpling, salmon and eggs, and the chicken salad. All were reasonably well-prepared.  Our neighbor ordered the Schnitzel which looked good.  But still we were underwhelmed....maybe because of what we saw on the web.  On the other hand, if you happen upon Kipferl with no previous knowledge, you might be pleasantly surprised and intrigued by the bakery and menu offerings.  Recommendation:  don't shy away but temper your expectations.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPnQCddff1qC-3P4jSM2ZA"
  },
  "XPt6lznYhJOUQ_19fWvpJQ": {
    "date": "7/24/2011",
    "text": "Great place. Since it opened I have been there multiple times. The food is great and actually really Austrian. Service is friendly and it is just a lovely modern-Austrian atmosphere.The only negative thing that I experienced last time was that they served an otherwise wonderful cheese omlette in the pan. I did not mind the pan, I actually liked it but the pan had this metal taste that you sometimes get with metal pans. For me that taste reduced the great taste of the mountain cheese omlette. The other small thing that I would change with the omlette is not to put balsamico vinegar on top of the mointain cheese omlette. I ordered it twice and the second time they did that. I don't think it is actually a good match. But these really are minor issues, overall the place is a great addition to the food scene in islington!The above was my first review. After going there many more times. I have to say this is truly a wonderful place with great value for money!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jixUt1oDmKTaEz2mVrGhEA"
  },
  "oNIjOgLHy_RENqEoX8FkWA": {
    "date": "9/15/2012",
    "text": "Since returning from Australia I have found it hard to find a decent coffee in London, but Kipferl delivers just that. Coupled with delicious cakes and friendly staff it is a perfect break from Saturday shopping.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KWl1p1brcAH-XiXP6R1wqg",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KWl1p1brcAH-XiXP6R1wqg/o.jpg"
      }
    ],
    "user_id": "zxhsIA7ahP6QL1iYgfyStw"
  },
  "ldEOo4ssH0Lwd8QaE0Aaiw": {
    "date": "4/14/2011",
    "text": "I am a bad Austrian. After one year and about 130 posts, I have not blogged about a single Austrian restaurant/cafe in London. I have been wanting to go to Bistro Delicat in Battersea forever, but somehow it just never happened. The other noteworthy Austrian etablissement in London is Kipferl. A little cafe just behind the Barbican it has achieved some critical acclaim for its cakes and coffee. Now, while walking through the Antiques Market in Camden Passage last weekend, I stumbled upon a second Kipferl. What is 'Kipferl' you might wonder, after you probably have unsuccessfully tried to pronounce it. A Kipferl is a very Austrian thing, it is something to eat and it's all about the crescent shape. HungryinLondon is not only about fun but also about education, therefore here a little history lesson for you: The Austrian Kipferl is said to be the ancestor of the French Croissant. Marie Antoinette, the daughter of the Austrian Empress Maria Theresia, married Louis XVI and brought her favourite bakery with her to France. As opposed to the French croissant however, the Austrian Kipferl is made of brioche and is much lighter. No Sunday breakfast is complete in Austria without a Kipferl, it is usually halved and eaten with butter and honey or jam. Some people (I am not one of them shakesindisgust) dunk it into their sweetened coffee or hot chocolate. The second most famous Kipferl is the Vanille-Kipferl, predominantly eaten in the pre-Christmas and Christmas period. Every housewife has her own secret Vanille Kipferl recipe (I shall post my mum's if she is ever going to tell me) and this Christmas cookie (mainly consisting of butter and sugar) is main reason why most Austrians are 3 kilos heavier after Christmas.Photo from The Hungarian Girl The Kipferl in Islington now, is a new and shiny cafe/restaurant, all white and wood with loads of natural light. It also has a few tables outside in case the summer ever comes. As I was just coming from a very extensive lunch, I only had a coffee, which was very nice. Particularly with the little Milka Chocolate, which is by far the dominating chocolate brand in Austria. The Austrians among you will probably recgonize the plate: It's from Aida, a Viennese coffee shop institution. You have one on almost every corner and it is characterized by grumpy waitresses and 70s style furniture (not in a cool way but in an old way 70s if you know what I mean). I couldn't help feeling a pinch of nostalgia upon spotting these plates. There is a nice selection of Austrian cakes to choose from (I actually can't wait to try them) and a small selection of Austrian dishes such as Tafelspitz, Wiener Schnitzel and Kaiserschmarrn. I am a bit homesick at the moment, so I was thrilled to find my favourite Austrian newspaper there, and it was even the current one! Kipferl also sells the Austrian beer that I used to get drunk on as a teenager. Finally I know where I will get my Styrian Pumpkinseed Oil ('Kernoel') from. The pitch-black oil is beautiful on salads but interestingly also works with vanilla ice. I am intrigued and happy about having found an affordable, friendly and authentic Austrian place in London. I shall certainly be back!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "RC0VA01TXXDt75B8Tk_T6w": {
    "date": "7/24/2017",
    "text": "Made a reservation for 9 am, when they opened. When we arrived, we were the third party to be there and we were seated immediately. Atmosphere was quaint and the restaurant was small. Service started off a bit cold, but this was likely due to the store just opening. By the end of the meal, the server was much more friendly.Coffees and breakfast meals were the best we had during our stay in London. Everything was well prepared and cooked properly. As we ate, we commented how we wish he had found this place earlier in our trip so that we could have come back a second time.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_1VPTCgxTL6CL3b1Gf6xgQ"
  },
  "7JpRJiHl96Nfg857danL-A": {
    "date": "8/27/2018",
    "text": "This review is only for the coffee and the pastries. I did not have anything else from the menu and would love to update this review once I get a chance to revisit for a full meal. I love Austrian cuisine, and the people that work here are so nice, but I was not super satisfied with the coffee and the desserts at Kipferl. First off, for a first-time visitor, it's not very clear whether they prefer that you order at the counter or that you sit down. I also noticed that they were busy, and service became kind of slow (the table next to me waited for 15 minutes just to get their menus).I got the apple struddle and a cappuccino. The struddle was fine and I like the recommendation to order it with a side of cream:) However, the cappuccino was half foam in an already-small cup. Traditionally, cappuccino should be 1/3 espresso, steam milk and milk foam. The ratios here were way off. Like I mentioned, I want to try the menu here before I make a conclusion, but the first impression wasn't great.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CUoYGTlW1CYS-nJ5vAUGPw",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CUoYGTlW1CYS-nJ5vAUGPw/o.jpg"
      },
      {
        "img_id": "lDA4hjo7XnvaZ0_q41DyvQ",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lDA4hjo7XnvaZ0_q41DyvQ/o.jpg"
      },
      {
        "img_id": "Gp4q3YAfSrybNQPYSPbhYA",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gp4q3YAfSrybNQPYSPbhYA/o.jpg"
      }
    ],
    "user_id": "ToEoV4wvbSIHQVpR-rLtMg"
  },
  "ob444ikkqWql94U0CjVsTA": {
    "date": "12/14/2015",
    "text": "I love great coffee. I love excellent eggs. I love Austria. So, as you can see...Kipferl already has a lot going for it in my mind. I had a few moments for a brief stop and took my chance on charming Camden Passage to finally enjoy Kipferl. On a weekday morning it was gloriously pleasant. Nice service, great food, and requisite Austrian-quality coffee (they take a lot of pride in it, as they should). Super clean interior, loads of natural light, and those goddamn eggs were gorgeous. Pictures speak volumes (see below).",
    "rating": 5.0,
    "rated": {
      "useful": 16,
      "funny": 6,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "VddPIkMt0zhckCWtp5YgEg",
        "caption": "Photo of Kipferl - London, United Kingdom. Ham and eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VddPIkMt0zhckCWtp5YgEg/o.jpg"
      },
      {
        "img_id": "h4xwhbP4mUClvCGVY4bVmg",
        "caption": "Photo of Kipferl - London, United Kingdom. Iced cafe latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/h4xwhbP4mUClvCGVY4bVmg/o.jpg"
      }
    ],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "qNlggqF31H2TZe6NtZALcQ": {
    "date": "5/7/2016",
    "text": "This'll be an efficient review because everything was on-point and nothing gets a wordy grumble.I will throw in the anecdotal evidence of Kipferl's delicious authenticity by saying: an Austrian friend gave this cafe the thumbs up.The coffee here is delicious. I love the touch - similar to how Australian Coffeehouses do - of having an ombre coffee menu, with the stronger coffee options indicated by the darker colour.Being of fine Eastern Euro stock, if there's a sausage and kraut, Imma go for it. Here there is the option of four different Austrian classics, but my preference is the sausage that is boiled and then quickly griddled (the other three are just boiled). The snap of the sausage is fantastic, and the plate comes with sauerkraut (yes), rye bread, pickle, and the most perfectly grated fresh horseradish and mustard. It's filling, but not overwhelming, and very reasonably priced around 6.50.I didn't get dessert, although the neighbouring table did, and I regret it. The classic apple strudels and sachertortes that you can find in Austria. I'm keen to return and try the ice-cream topped with pumpkin oil (?) (!). The space itself is bright and surprisingly spacious, with a few tables available outside. Staff friendly and super-attentive. Good buzz, but not too loud.Yelp note: double points for the option to do halvesies on many of the entrees and get a \"starter size\" portion. That helped encourage testing of the spinach dumplings!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "CkqmyV3UWUd70oM3F-PahQ"
  },
  "CJWDneVvPK4R-XIVpJwlhQ": {
    "date": "10/5/2016",
    "text": "This place is very simple and understated.It looks like it only serves coffee but it also does brunch, lunch and dinner. I have dinner hear and tried the spinach salad with bacon with was really good as it also have roasted pine nuts. Yum! I went for the veal in mushroom sauce dish as a main and it was extremely tasty. We shared dessert- the vanilla ice-cream with pumpkin oil and seeds which was delicious and the chocolate cake with apricot jam which was ok but not great. The staff are really friendly too!I def would recommend this place. I am want to go back and try the snitetzel.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pMxAeLHIklIgwyJ_gDdBCw"
  },
  "13CITPOdlYXBKy5vndbPXQ": {
    "date": "2/23/2016",
    "text": "Seek and you shall be rewarded. Hidden away high up on this charming little alley of a long side street Camden Passage is a feast of small shops, Bars, places to eat and boutiques. It's almost romantic dare I say in the guise of something Parisian amidst Angel.What you will find is a charming Viennese cafe called Kipferl. I've never been to Vienna (though it is on bucket list) and I had read that this is one of few places that come from their homeland. In fact, upon asking the ever so friendly bar staff who had greeted me as I gazed upon eyed at their cakes, they stated that this was the only Austrian cafe in London. Perhaps, but I was here and I had liked what I had seenThe friendly Hungarian woman bar staff was charming and had explained the cakes. I don't like sweet stuff, especially chocolate would you believe. I opted for the Jewish Apple Cake - dairy free 'Apfelkuchen. Cinnamon, apple and savoury. Check. Not quite Austrian but I love this type of cake. Also opted for melange. I have no clue what it was, but a cross between two coffees with a bit of cream on top.I liked the decor inside and it was bigger than you think from looking in. Not sure if it's hugely Austrian. Maybe would have liked it even more wooden? Or maybe I'm being somewhat stereotypical. I haven been remember.  It was a wooden feel but more modern. Either way it was nice. I'll stop rambling. Even so, the staff were lovely, the food and  coffee great. A lovely find here. They even have me a delicious bit of cake for me and my friend when I asked for bill. I even heard a fair few German speaking inside which is good sign. I will be back for sure. Well done folks.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "9fR1mBnkngw-OWfVhh2vfA",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9fR1mBnkngw-OWfVhh2vfA/o.jpg"
      },
      {
        "img_id": "L8fvv9Q3M6Snkunq-yFEdw",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L8fvv9Q3M6Snkunq-yFEdw/o.jpg"
      },
      {
        "img_id": "Sg5GnYCvzyDI9ZPF9hUEJA",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Sg5GnYCvzyDI9ZPF9hUEJA/o.jpg"
      }
    ],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "mFcSV_eQ8Q5pgjkADC0qlg": {
    "date": "3/26/2016",
    "text": "Good for a dessert? Definitely!It's a very stylish cosy Austrian cafe near Angel station!I visited the cafe at 2pm so it was a bit crowded but we were sent to a table after 5 mins wait. Actually 5 mins wasn't enough to enjoy looking out over their beautiful cakes in the showcase. There were around 10 types of mouth-watering cakes including today's special, Easter carrot cakes which had a small carrot-shaped decoration on each cake. Although I was very intrigued by the cakes, I ordered a liver soup and hot chocolate first. The liver sausages in the soup was nice and I liked a rye bread which came with soup. I was going to order a sacher torte but I was quite full after I ate the soup. I'll order a cake first next time!The waitresses were friendly but I was a bit disappointed when a waitress took away a glass for water without asking me. Maybe we stayed there too long??",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-QM_g_opykqFVcF1JxG3Yg",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-QM_g_opykqFVcF1JxG3Yg/o.jpg"
      }
    ],
    "user_id": "9rqmoNhTI5Sd7zI2UYe-mA"
  },
  "-UuvbqN5M6lSQDAZnnx3OA": {
    "date": "3/3/2018",
    "text": "Disappointed experience. We go there often, the food is good. On Saturday we arrived at 9am when they should have opened. We were standing in front of the door with our kid at -2 degrees (3rd March 2018), they saw that we wanted to come in but ignored us and just kept preparing the tables. At 9.10 we left. This is just unacceptable.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9B7uTMbp74z0eY_5jf6yg"
  },
  "rfB0FJLZryf4Kg4wjqnj2Q": {
    "date": "6/30/2016",
    "text": "Had a really excellent schnitzel here recently. Sides were good as well, and the place was massively chill.  Interesting wine list and good beers, what more could you ask for?Perhaps closer to my house but hey, I could move.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "T3p2sDKZlWNSFC6-axt_XA"
  },
  "_i1lCUVfdL5kquSPNRhFtQ": {
    "date": "5/15/2015",
    "text": "Always filled with German speaking patrons.. a great sign!I'm addicted to their sausage with sauerkraut and their cakes. And the coffee comes with a piece of chocolate and a small glass of water. Really fun!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q2zg05Pdue9ToUIBjoaMPg",
        "caption": "Photo of Kipferl - London, United Kingdom. All coffees should be accompanied by a piece of chocolate!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q2zg05Pdue9ToUIBjoaMPg/o.jpg"
      }
    ],
    "user_id": "2dCkG0BtubmhVsoPxCZQKw"
  },
  "j7ZHeCnrtZIDRG42RJn6dQ": {
    "date": "6/17/2013",
    "text": "Ooooh how did I not already know about Austrian cake!? We met up with some friends in Angel, and one of them insisted that we come here, partly because he is Austrian, and loves their coffee/cakes, and partly because he thinks the waitresses are cute. There wasn't any space left inside, but we nabbed a table on the doorstep to enjoy some of this lovely (chilly) summer day. This place isn't perfect - they were pretty slow to serve us, and then brought (and charged us for) an extra coffee. The waitress insisted that we ordered 3 cappuccinos, although we really only ordered 2 (I know this because I don't drink coffee, and never have, she must just have assumed I wanted to drink something. Ah well.) However all three cakes were looovely, so I still think this place is A-OK. Now I have discovered this land-of-cake-joy, I am sure I'll come back here again, and I'll probably have to increase my rating if they don't bring me an unwanted drink again!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LwAOADN2jb8pOh30dkRtjg",
        "caption": "Photo of Kipferl - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LwAOADN2jb8pOh30dkRtjg/o.jpg"
      },
      {
        "img_id": "VUAqvSAavWbD8ZqbzRUFmw",
        "caption": "Photo of Kipferl - London, United Kingdom. Austrian caaaake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VUAqvSAavWbD8ZqbzRUFmw/o.jpg"
      }
    ],
    "user_id": "93vyTaJgzQRQO4Zs9Cg_pw"
  },
  "2zC5bOWepDjk-5Q9_7YESg": {
    "date": "3/21/2016",
    "text": "the food here was okay. The salmon was extremely tasty but everything else seemed just normal, standard fare. The eggs were well cooked and the skillet with sausage and potatoes was good, but a little heavy. Overall an average place for breakfast.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IEzBl-Xuw-SW6dDJ6ugMdQ"
  },
  "r8JbaLFijRW3CnMA2RVe6Q": {
    "date": "1/4/2015",
    "text": "There seems to be a shortage of brunch places in London, because every single place my friends and I tried to go in was full and The Breakfast Club had a line outside in near freezing weather. Finally we ventured into Kipferl that seemed to have a more reasonable wait. It is a Viennese Coffeehouse, and I know very little about Viennese food except schnitzel, so quite curious to find out more about the brunch that they offer. The place is clean, simple and feels quite welcoming. As soon as you walk in, you are greeted with a whole case of lovely cakes and pastry. Judging from the name of those cakes, they seem to be some typical Viennese favorites. We finally got seated and the menu was decent for brunch. You can have a simple Viennese Breakfast, which is a continental breakfast with bread rolls, coffee and OJ, or eggs, or French toast. If you want to go for more typical Viennese dishes, you can opt for some sausages or schnitzel. I went for the sausages with sauerkraut which I thought was more German, but I guess Austrian cuisine is quite akin to German cuisine. Two spicy sausages paired with a generous serving of sauerkraut made for a decent brunch. I think this will be a great place for an afternoon coffee with some Austrian cake.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G6Fnt9P9ZFFB-35fx287wQ",
        "caption": "Photo of Kipferl - London, United Kingdom. Nice latte",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G6Fnt9P9ZFFB-35fx287wQ/o.jpg"
      }
    ],
    "user_id": "l6Yh_hwYzqnt4EzSiCqJDQ"
  },
  "_fWDvi8OAprDJoWmk2BltQ": {
    "date": "8/25/2015",
    "text": "Stumbled on this by mistake when attempting to hide from the rain. The staff were really friendly and got us sat down straight away. I had no idea what to expect and some of the food options sounded kind of alien to me so I went for the French toast with bacon. For a very reasonable price the portion was massive and for the first time ever I actually had too much bacon! (If that is possible) The atmosphere was really laid back and we stayed almost 2 hours without being rushed or hassled. We were sat next to a balcony that looked out over other houses. It was really cute. I would definitely recommend going here. I have no idea why their queue wasn't bigger!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t28u8vMYcqEMw0VQ1K_uiQ"
  },
  "tBjc37T5Li-XthNQiKHMrw": {
    "date": "10/4/2016",
    "text": "What else to say apart from the best schnitzel in London! Love this place, the prices are reasonable, the food is excellent, mind you I only ever eat their schnitzel there but I am a bit of an addict!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kLQK9S3CvyOAKcQeRfU0Tg"
  },
  "9IAAcY0-cl_LFcxcDOAdPQ": {
    "date": "11/30/2015",
    "text": "Ate here for breakfast only. This is a nice modern place to enjoy coffee and hearty morning treats.  Calm and chilled out. The espresso was nice and bitter. The yoghurt and granola came with a generous amount of fruit and a glass of orange juice. There were lots of cakes and some of the other dishes looked inviting.Would love to come back and just relax here.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "Z0XZp-r5vSNDazid7v-KWw": {
    "date": "2/1/2014",
    "text": "If you wandering around Camden passage after a lazy afternoon of antique shopping, then Kipferl is a great place to take a load off and indulge in some classic Viennese tea house fare.The place was quite busy on Saturday afternoon and tables don't turn over too fast, however, it gave us a great change to inspect all their cakes which looked amazing!After sitting down we ordered some teas which arrived Viennese style on a tray with water and milka chocolate.   The wife ordered a slice of Apfelkuchen which was apparently delicious and I ordered the sausages with sauerkraut, pickles, rye bread, mustard and freshly grated horseradish.   Next time I'm going to also indulge in some of their Austrian beers too.Overall this is a really nice relaxing space, with reasonable prices, and I'm looking forward to coming back again....Also if you really like the food you can buy it straight off the shelves.  We observed 2 Austrian girls buying enough food for a family feast including 2 bags of sausages, Viennese wines, beer and entire sacher torte.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "i0xodziJd_PNCOLXJukY9Q",
        "caption": "Photo of Kipferl - London, United Kingdom. Tea ...Austrian style!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i0xodziJd_PNCOLXJukY9Q/o.jpg"
      }
    ],
    "user_id": "hocMbHWc5r3hIMcXaSNdYw"
  },
  "vnjwb7slCft0dW0hyMSSUA": {
    "date": "1/31/2014",
    "text": "Sunday afternoon. We were looking for a really and warm cup of coffee around Angel. Everything was closed. We looked on yelp (yeah!) and the app recommended us this Austrian place. We could take a sit straight away (although there was a queue for dinner)We sat next to the cake display (lucky us), so we could not go without trying a couple of cakes with our coffee: Espresso cake and Sachertorte (an Austrian classic). The coffee was OK but the cakes: OMG (specially Sachertorte). The espresso cake was a little bit dry but worth it anyway. The staff was really friendly and sweet (even though it was Sunday).The place was cosy and tidy. Not really overdecorated. They sell some Austrian products as well (they have a small display for it, really cute)It was more than worth it :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NsB0PHjGKPBbG6HA7k2PgA",
        "caption": "Photo of Kipferl - London, United Kingdom. Cakes, cakes, cakes!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NsB0PHjGKPBbG6HA7k2PgA/o.jpg"
      },
      {
        "img_id": "oPRAAJsG5Z_65iNzizXddg",
        "caption": "Photo of Kipferl - London, United Kingdom. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oPRAAJsG5Z_65iNzizXddg/o.jpg"
      }
    ],
    "user_id": "DGoywFBFTa0QK35X4plszQ"
  },
  "3bzcLlJ9x6oMc1RutW4r7A": {
    "date": "10/10/2016",
    "text": "This place isn't massive and it has a cosy feeling about it..  We got there earlier (we had made a reservation) and immediately we were taken to our table.  I have to say everyone is very polite and friendly!I realise now that I should have gone for the schnitzel but I decided to try the pan fried noodles instead!  It was really delicious and the portion was large that not only shared my meal but was still very full afterwards!  I also tried the green salad which was also delicious.  The only thing I wasn't enthused with was the dessert, we ordered some ice cream (that was yummy) and chocolate cake which was dry and not great.  Nevertheless, I would certainly recommend this place!!  I know I have to go back and try to schnitzel!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j1aFAPUVrY1abbfo4Dcu4Q"
  },
  "Vf8h7RJkYlohXPZSHYCaFA": {
    "date": "4/2/2015",
    "text": "I love Kipferl!Being German myself and having travelled to Austria a few times I can only recommend this Austrian Coffeehouse. Fast and friendly service, nice decor, and amazing food! I absolutely love the breakfast choices they have, but would definitely recommend to reserve a table! Its always busy!Their Wiener Schnitzel and Kaiserschmarren, or Topfen mousse are to die for!If you havent been to Kipferl yet, give it a try! I can only recommend it!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T1C5_tV7OzHqSu65AIXucg"
  }
}