{
  "bvFlitA2W7iG23ExmvXE0w": {
    "date": "7/14/2011",
    "text": "Agree with previous reviewer Jiak that the pancakes are somewhat overpriced. Service is very welcoming and professional.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "OqIedr4wkitZ9zK-Ew3_Hg": {
    "date": "3/29/2011",
    "text": "Came here with a friend a while ago. We had a half price voucher to this restaurant and decided to try it out. The crepes was good, but nothing really jump out at us. Staff was friendly. It's quite expensive for a place that serves crepes.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-3EIkUKFcN40-LOFQDTSzg": {
    "date": "7/1/2009",
    "text": "my friend and i were going to go to a fancy restaurant in the vicinity but decided, thanks to a coin toss, to come here instead. we hit it right at the start of lunch time so i think there was maybe only one other table occupied.they have a great selection of sweet and savory (or should i say \"savoury\" ;) ) pancakes, which pretty much are ginormous crepes. i got the set menu, which included a soup and pancake. the soup was a creamy carrot and was quite good. the pancake was, iirc, chicken and feta, and there was absolutely no way i could finish it! you can fold it twice to make it look like a big pizza slice (visually much more manageable than a 12\"+ plate) but good luck getting it all down!a wonderful value for the money in a cheery setting. getting a table by the big window on a bright sunny day certainly didn't hurt, either!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "krD7DRYglFFSrcwBTbMyBA"
  },
  "4zkVL1ZuhRpSgVP8VwIb2A": {
    "date": "3/17/2013",
    "text": "Don't go to this place. Just horrible pancakes . Bad bad food. Never again!!!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "eD2HT2wdGFpx2E52J_xSig": {
    "date": "8/18/2015",
    "text": "I dream of pancakes; My Old Dutch pancakes, of course! The savory pancake filled with chili is a feast of the highest caliber, and a large one at that! Bring an empty stomach, and you may want to order guacamole with the chili pancake (which may cost a bit extra). It is well worth it. The cherry beer is delicious, and the decor of Dutch clogs and other art on the wall is fun!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPEtnHIqnLJTrJ1I-zr0DA"
  },
  "kbocljFHrDEPQ3sTzLnM3w": {
    "date": "12/1/2015",
    "text": "The second Branch I've visited, just as good as the first. Huge crepe portions that don't disappoint and delicious butterscotch pancakes.The service is fast, the staff is friendly and great location in a live area. Definitely a filling breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DSXQALSYgrTHprFnqGY8xg"
  },
  "RElVF01GZkXLY_LDRk67Mw": {
    "date": "11/16/2015",
    "text": "Absolutely delicious food and great service, clean, good seating not even so noisy in there. This is one of my favourite breakfast joints in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_QcQ9BAjcLYFbInQUjnuQ"
  },
  "BpgfOrwwoEjKsSn9vO4hng": {
    "date": "8/7/2016",
    "text": "Now been there twice once I had a crepe with ice cream that was sweet and the following time I had a breakfast crepe. The breakfast crepes I thought really lacked flavor and need some sort of sauce in them but the sweet crepes are great. They are known for their famous crepe with Hershey's cookies and cream",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FDuDxB4DqfEAWwWMQhj60w"
  },
  "_zvN2K7zsN0qNsB5A-KAnQ": {
    "date": "3/27/2013",
    "text": "Great quick eats.I had the chicken caesar salad, while my colleagues both had the chili with pepperoni.  The salad was delicious and quite healthy - I'll definitely be going back for it.As for the pancakes/crepes/gallettes, my colleagues were amazed and somewhat overwhelmed.  The portions, as everyone else mentions here, are huge.  But as an American, I thought, great, they're american sized  NO.  They come out on the largest plates I've ever seen - basically the sized of a medium/large sized American pizza.  Two people can gladly share one.  I definitely recommend for lunch, just watch out on the carb overload if you order some pancakes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8HRSgP6qUYHBusR-SvQ6Q"
  },
  "_RjaK7Qn-UVBewFI9RPXCA": {
    "date": "2/1/2014",
    "text": "Nice and cozy decoration. Good service. Good food. I strongly advice you to try pear cinnamon pancake (or should I say creppe). Anyhow, it is little bit pricey, but definetely worth tomcheck out once in a while.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0duCIZZbdds0mkWBOAeEjA"
  },
  "c6grXRseUwCB_4SwvCqgoA": {
    "date": "1/12/2011",
    "text": "Yuuummmmm.... pancaaakkessss *drrroooll*Anything you want to smack onto a pancake, you can here at My Old Dutch! My friend took me here once and since then I've been in love. It provides something different compared to the same old boring restaurants you find on the high street. The branches I've been to seem to have the same feel to it; quite homely with a touch of Dutch of course. The menu seems straight forward enough, with the option of customizing your own pancake if you'd like. I personally love the chilli con carne savoury pancake as my main and the traditional poffertjes for dessert. Otherwise, you can just come in for dessert!! P.s. They also do 'Monday madness' aka pancakes for £5!!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "gEoUWUWvk8Sr1ps3SbyS_g"
  },
  "atZ7G5ebbDCXlBnUDcb1TQ": {
    "date": "10/22/2013",
    "text": "Pancakes for dinner. Always a winner! Quite a variety from savoury to sweet.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UpjdWjg7Uxv8rK9IebPdA"
  },
  "FFzR79Z-wddR8fcg-dK5FQ": {
    "date": "1/11/2015",
    "text": "Wonderful place to go for a quick bite.  Sweet pancakes are amazing.  Super huge, but super light. Service was great, we were in and out quickly.  Husband got traditional pancakes, and liked them also.  Extensive savory pancake menu, we will be back for dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ikND3fM1vVftE9zwYgDO8A"
  },
  "bIk5Ma4sunWS0vYnajbrEA": {
    "date": "12/28/2008",
    "text": "Just a little walk away from High Street Ken tube, you will find a warm and vibrant pancake house, which is perfect for anyone, like taking a partner, friend or kids along to.It is spacious inside and has plenty of seating, and though on each of my visits it has been packed full of people, there has always been a spare table to dig into my pancake. Just to add, the pancakes are huge, and you have a choice of savoury or sweet. They take great pride in all what they do, the service is fantastic, and really friendly, and if you fancy something else other than a pancake, you have a few salads to choose from as well as other types of traditional Dutch starters and deserts, though I myself have never seen the point of going to a pancake house and getting a salad, they do look quite nice.This place is traditionally Dutch, in its décor and by its menu, the beers include Amstel, Hoegaarden, Grolsch, and a selection of fruit flavoured beers (cranberry, strawberry & passion fruit) made with real fruit.I have only ever been with friends for a nice tasty pancake, but it would be perfect for a day out with the kids to hold a little party etc. Its great in here!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Euebp6cQaeK6KAY_dk66g",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_Euebp6cQaeK6KAY_dk66g/o.jpg"
      },
      {
        "img_id": "kapCGsWpyb1z7S7sAEtfqg",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kapCGsWpyb1z7S7sAEtfqg/o.jpg"
      }
    ],
    "user_id": "A3tbiT99rP4J2J4RPbYBUQ"
  },
  "panEv6z8lFuHmCCXyQk3JA": {
    "date": "12/15/2013",
    "text": "Great full English breakfast pancakes!They didn't have any orange juice tho and hence the four stars. Simple nice place. Will definitely go back for breakfast. I didn't try the sweet pancakes so I can say anything about that.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wB5b3CVrqj3ZuX99m3gMkA"
  },
  "KeVIjWev6Wk4YL5X1hw19A": {
    "date": "10/19/2010",
    "text": "I love Pannekoeken!  On my last trip to London, a business associate suggested dinner at My Old Dutch.  The pannekoeken were excellent--just like the ones my Oma used to make.  Lekker zeg!Een pannekoek met kaas en spek, alstublieft!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt6OQh_bCQsgZNTRzM8Zqg"
  },
  "ZqE_TxmwJFiU069oDyj_Fw": {
    "date": "5/21/2011",
    "text": "I really love this place! I went once with my parents and we all got the asparagus soup (it is to die for), and it came with delicious toasted bread. We also got sweet pancakes, I got strawberries, chocolate sauce and cream. Delish! I can't remember what they got, but I know they thoroughly enjoyed it. I just went again with my husband tonight and it was SO good!! I got the asparagus pancake (it had olives, asparagus, cheese, spinach and red onions. The spinach and red onions were fried into the pancake, while the other things were topped on it. It was incredible. My husband got the My Old Dutch pancake. According to him it had chicken, ham, peppers..and he can't remember what else, but he also thought it was fantastic. In fact he thought his was better than mine!The pancakes are GIANT. I wasn't able to finish my asparagus one off, but my husband was more than happy to take care of it. The service is great here. They are super speedy and very pleasant. They also have a loyalty program, if you buy 9 you get one free. So glad this place is just around the corner from our flat!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fwg3QSA0hX2VqVqZliTLRw"
  },
  "P2UQloAKkOnXQJ2W95BUTw": {
    "date": "1/2/2011",
    "text": "The best casual restaurant for pancakes that I've found since moving over to London. Inexpensive and tasty - about 15 different varieties of sweet and savoury choices at My Old Dutch, with an equally large variety of non-pancake dishes and beers for those looking for something different. Be warned, the pannekoeken here more resemble European Crepes than American Pancakes. But even transplanted Yanks will find these massive discs of dough addictive and delicious. That the coffee machine was out during my last visit here was a bit troublesome; but, unless it's still out the next time I go, will just chalk it out to bad weekend luck.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "faK-VaDldjRT0IR0xgHM1g"
  },
  "aNr7XZssc4kvBKH_3_rLgw": {
    "date": "8/17/2012",
    "text": "I saw this place the day I arrived while walking to the hotel.  I didn't get around to giving it a try until my last night in town.  I wish I'd tried it sooner.  The waffles are delicious.  I will make it a point to stop in again the next time I'm in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nWAc1PNh1Ee-ugW1a3JDZA"
  },
  "hfIPO59mnPgcOzOzsfD6kw": {
    "date": "7/17/2010",
    "text": "I've been craving pancakes since I ran passed the place on the first Saturday night during my stay (obnoxious club promoters were luring in some of my friends, but I got away). Since then I've been here twice. I gotta admit, I liked the savory Chicken Curry pannekoeken (Dutch for pancake) moreso than the sweet Nutella. They gave me too little Nutella!However, as a bonus, they have a great selection of European beers to choose from. I'm fond of the Belgian Cherry myself.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QMDBx5JniWfeL26ZdnaCPA"
  },
  "vO6IMi_0Nj9vvMyvfRlqDw": {
    "date": "6/18/2009",
    "text": "I came here on Monday for their \"Monday Madness\" promotion where all pancakes were 5 quids!  I wonder if the promotion is the reason, but service seems to be extremely lacking that day, very unlike the time I visited the one on King's Road.  With that complaint out of the way, I have to say the milk shake I had was delicious, thick, rich, HUGE, just the right sweetness (you don't get that in a lot of shakes) so it's actually possible to finish the thing without gulping gallons of water along the way.Needless to say, you don't know what you've been missing out on if you never had their pancakes.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yusFoixLtDbFP8ZAmOLTRw"
  },
  "nZQWaonjkMJZmelX9JNoJg": {
    "date": "7/5/2014",
    "text": "There's 4 people here and it took more than 30 minutes to make me a damn pancake? I understand if it was busy but this is some bullshit",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aL1MUJAIS2yQdMnk-iIvGw"
  },
  "c_taatgQsp4pTZHS-vZLIw": {
    "date": "2/15/2010",
    "text": "I have always heard of this place and was excited to see one open in Kensington. I went with my boyfriend and were so happy to see the menu was alternative. You could have a full english breakfast on your crepe or a sunday roast! They are basically full meals, on a crepe - crazy! When our crepes arrived, they were HUGE, fortunately they have extra big plates for them. I cannot quite remember what I or my boyfriend ordered but we both said our crepes were... alright. They were fun because they were very generously stuffed, but the taste was nothing out of this world. I think I would have preferred a good crepe and a good sunday roast instead of trying to combine both and coming out with something - alright. We were absolutely stuffed though so we couldn't order a sweet option. But looking at the next table's order the sweet pancakes look amazing! I would definitely go back for the sweet pancakes, not the savoury.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "f6gBSJ0D8Q0PimQ59nUCyg": {
    "date": "3/14/2012",
    "text": "I always thought that the americans invested the pancakes, but my old dutch. My oh My yumyum",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EPZgvseP4zud5ffwjHlsUw"
  },
  "VR0x3K44hZBslrJ_xJFpBQ": {
    "date": "6/19/2017",
    "text": "This a great pancake house in the South Ken area (not too far from Kensington Palace itself). If you're craving American pancakes, they have a wide variety of sweet options, but make sure you order the BUTTERSCOTCH PANCAKES! These don't taste any different than regular American pancakes but they are nice and fluffy. Their \"SWEET PANCAKES\" and \"SAVORY PANCAKES\" are actually crepes - so if you want crepes, order one of these, they're massive. If you want American pancakes, order the Butterscotch pancakes. I personally always get a Butterscotch stack with chocolate chips and Maple syrup (I don't believe the syrup is real Maple syrup but we can't have it all). These are great if you really need a fix :) A word of advice for people who are confused when you see your crepe (aka sweet or savory pancakes), yes they are laid out flat on the circular plate. Put your fork in the corner of the crepe and roll it. This is the best way to eat these crepes. I recommend for Butterscotch pancakes. I have personally not tried their crepes but they do look amazing! The apple juice is also quite nice :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "iqsvf5ix0XtjLqenmGQ_Og",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Chocolate chip butterscotch pancakes with maple syrup and strawberry and cream pancakes with maple syrup - great!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iqsvf5ix0XtjLqenmGQ_Og/o.jpg"
      }
    ],
    "user_id": "9HDcePTfUCZCOGwsFDdc_Q"
  },
  "RD5mrbs9lzmy_-ywvsMAew": {
    "date": "10/14/2018",
    "text": "Bring a hammer and chisel for the pancakes . Pancakes were tasteless.  Service is slow",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnS2uNh5Tu9gRxFlCpAKeA"
  },
  "i81BYlyuZJXy9iG7d4wr2w": {
    "date": "11/5/2017",
    "text": "We came for breakfast before going to Kensington palace. There were not many people eating while we were there and we received our food within 10 minutes of ordering. I got butterscotch pancakes which were great and my friend got sweet pancakes with fruit. The sweet pancake was HUGE and was actually more of what we call a crepe in the states. You could easily split it between two adults. I wish we had time to go again because the food was so good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qN1p0BOp6Vx8gf4JLbV5Iw",
        "caption": "Photo of My Old Dutch - London, United Kingdom. The sweet pancakes. Can easily be shared by 2 people",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qN1p0BOp6Vx8gf4JLbV5Iw/o.jpg"
      },
      {
        "img_id": "Ah93q3I9kRHXpDMSnVzUCQ",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ah93q3I9kRHXpDMSnVzUCQ/o.jpg"
      },
      {
        "img_id": "kt8KfYBuSNPdIx7YDsyI0w",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Great pancakes!! Butterscotch pancake with strawberries, blueberries, maple syrup & cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kt8KfYBuSNPdIx7YDsyI0w/o.jpg"
      }
    ],
    "user_id": "lhcA7w4mJe3EYhZuDNxUxg"
  },
  "FH3AduYH88CvKIKTxs_ZGA": {
    "date": "5/1/2017",
    "text": "I always been here with high expectations and in hope that the next thing I order from the last time will be better. In fact I'm slightly supposed the average rating her is 4*. In terms of taste of deserts, it's not any different to any other place. In fact pancakes and waffles are arguably better at Snowflakes or even at the kios's in Oxford Street opposite Selfridges. It's cheaper as well. Service-wise it takes ages to get staff attention to order but but food comes pretty quick (once you've spent ages trying to order).The mains aren't too bad but I think in future I'd go for the veggie option as the chicken, salmon or meat always come out salty. At least the veggie option simply tastes like a pizza on a pancake. Overall it's not too bad. It's descent for a sweet desert after a spot of shopping at High St Ken.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8mjnQ8-4GuN6jvdEkLnB2A",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8mjnQ8-4GuN6jvdEkLnB2A/o.jpg"
      },
      {
        "img_id": "NbwTeVodI4lzN0YNFi-CkQ",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NbwTeVodI4lzN0YNFi-CkQ/o.jpg"
      },
      {
        "img_id": "TEXUwIlbV0w7kfrfZyU24w",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TEXUwIlbV0w7kfrfZyU24w/o.jpg"
      }
    ],
    "user_id": "nizVN60pdsIsjB8X3ao25w"
  },
  "f8Kk7PIORlfo5T_L4yfP-w": {
    "date": "11/13/2016",
    "text": "My boyfriend and I were looking for brunch/lunch and stumbled upon My Old Dutch. It was decently full (Sunday noobut we managed to get a table right away. Our waiter was very friendly. I was looking for something savoury so I got the Eggs Florentine, it came with spinach, cheese, red onions and 2 fried eggs. My boyfriend was set on getting something sweet so he got a chocolate one which came with scoops of ice cream and chocolate syrup. These pancakes are HUGE. I laughed as they placed these gigantic plates in front of us. However, the quality was not lost. Mine was delicious. Everything was spread out nice and evenly and I didn't find it dry at all. The boyfriend also gave 2 thumbs up to his. We both couldn't finish ours which is disappointing because I hate wasting food but too much is better than too little! I saw other tables also struggling to finish. Not the cheapest place but not bad, plus you get a huge portion. Would definitely go back here as they have so many options on the menu that I feel like I need to try more!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Q0xajInb7sn16bYM4KoQGg",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q0xajInb7sn16bYM4KoQGg/o.jpg"
      }
    ],
    "user_id": "-gF-g56lIhrKKYAff1JuFA"
  },
  "yvrLVtUl3rETTyd4qHyB9w": {
    "date": "2/26/2017",
    "text": "I was ready to hate this place. In short it's really good and great value for the area. Huge pancake, the gluten free one tastes great too. The banana milk shake was perfect, a proper traditional American shake. 5 stars.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "66shfYks1AMuXW0Dhofvqw",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/66shfYks1AMuXW0Dhofvqw/o.jpg"
      },
      {
        "img_id": "wA0opWtZWjuD7bMDxll1mQ",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wA0opWtZWjuD7bMDxll1mQ/o.jpg"
      },
      {
        "img_id": "P7sw04mQ1iqZJVs4pYH0bg",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/P7sw04mQ1iqZJVs4pYH0bg/o.jpg"
      }
    ],
    "user_id": "q_ae2p8uyMDSm9zKqN6Btg"
  },
  "KliGHCi6eyH8uZjIlb7Xlg": {
    "date": "10/9/2016",
    "text": "Enjoyed a tasty sweet crepe here for brunch. Came here on Saturday and it was super busy. Didn't have to wait too long for a table and there's a couch by the door. I created my own crepe with pear and Nutella. My friend went for maple syrup. She had to pay extra for a second portion of maple syrup as it wasn't enough for her. She loves maple syrup. I would go back again but maybe on a Monday for the offer!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j5-HWQ-GVRTQk9NSV_8_Og",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Pear and Nutella crepe",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j5-HWQ-GVRTQk9NSV_8_Og/o.jpg"
      }
    ],
    "user_id": "94-fFKPk8QCk3DSOts_Ctg"
  },
  "anKMcbC_-w6ZZl56K1W_TA": {
    "date": "9/20/2017",
    "text": "Best Breakfast in Kensington Area. We ate here 3 times within our 4 day stay in London. They make Crepes with anything and everything you want and most importantly it is very delicious. The Staff are super friendly and the restaurant is very clean.  HIGHLY RECOMMENDED.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Dcd0RFKoguCaa25h2FsKQ"
  },
  "_bWegy8PWHqRcUBcrs3Dog": {
    "date": "9/2/2015",
    "text": "My Old Dutch pancake house attracts attention with its colorful orange design at the entrance, making it hard to pass by without popping in.We went in for a late evening and shared one savoury and one sweet pancake. The smoked duck pancake came pretty quickly after ordering, it was quite satisfying even though the duck bits looked like bacon and tasted like sausage. The second pancake was a banana, chocolate and nut one with ice cream and hot chocolate, but my friend and I agreed it looked better than tasted.The do Mad Mondays with £5 for a pancake, so could be worth a try, otherwise their pancakes are way overpriced for the service they offer.The waitress was a bit rude and it felt as if she was annoyed, so really the place lost some points on the service.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1eyBlyUuQKa2MeK06PJ00w",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Smoked duck pancake was quite satisfying even though the duck bits looked like bacon and tasted like sausage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1eyBlyUuQKa2MeK06PJ00w/o.jpg"
      },
      {
        "img_id": "tIfQWv5-MLnHfY8ye0uthA",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Banana, chocolate and nut one with ice cream and hot chocolate, both my friend and I agreed it looked better than tasted.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tIfQWv5-MLnHfY8ye0uthA/o.jpg"
      },
      {
        "img_id": "azLWklBFYsoILVL51qAe4g",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Pancake house attracts attention with its colorful orange design at the entrance, making it hard to pass by without popping in",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/azLWklBFYsoILVL51qAe4g/o.jpg"
      }
    ],
    "user_id": "yNz6YWwxNUI_ekxZvk3Hdg"
  },
  "uqsMc1eud5K9oJ9F7CJeww": {
    "date": "2/3/2017",
    "text": "We are so happy to have found this place for breakfast!  It was amazing and delicious!  Huge menu and great service.   Lattes were perfect as well.The perfect alternative to a full English breakfast if you are from the U.S. and not a fan of such.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-AswK6uec1M8Nl_4rAF34A"
  },
  "1-pJ6el0WN4lrfmjcipfTQ": {
    "date": "9/25/2015",
    "text": "Delightful little breakfast joint. Very good service. Chicken Curry Pancake was delicious. The cappuccino was perfectly prepared.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "qW4UGwU7DDXiiDdV6iwqBw",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qW4UGwU7DDXiiDdV6iwqBw/o.jpg"
      },
      {
        "img_id": "IomGXxpZcUBKbAtCmdrzWg",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IomGXxpZcUBKbAtCmdrzWg/o.jpg"
      },
      {
        "img_id": "YAamzWKBMyA1KZHyVRGyUQ",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YAamzWKBMyA1KZHyVRGyUQ/o.jpg"
      }
    ],
    "user_id": "BNa8fgYjLDVqRDJ7lYwtYg"
  },
  "zEtAwg0f6Ivm1GSnvgTN4A": {
    "date": "5/28/2015",
    "text": "You can't go wrong with Nutella or Cheese crepe.  It is very thin and delicious.  The place looks just like a cafe in Amsterdam with wooden clogs on the wall. It is a great family place for a snack or to have a fast lunch.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Rf8Ysl3pv7GByQF30nwsA",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Nutella and banana crepe",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5Rf8Ysl3pv7GByQF30nwsA/o.jpg"
      }
    ],
    "user_id": "lpaNy-FJJeq6in6-rShFsA"
  },
  "JUp5TbzaR_gCVkzyOCYkFw": {
    "date": "6/18/2013",
    "text": "On the go all day and it had been getting late... We all been there to where we're guilty of grabbing a packet of crisps and not eat real food..I needed something to eat. Right then and there. My first choice was closed so I stopped in and I'm glad that  I had.. and waited for a bit.If you're looking for American pancakes or crepes- you can find both here made to order- smaller and larger portions are optional.I usually make my own crepes at home with lemon juice and sugar- rarely would I order a savory crepe since most turn out greasy and or soggy..Lemon and sugar is my to go to crepe- but I wanted to have something different.These guys also offer Gluten Free..I went with the Lite Options end of the menu since it was late and had to still trek home, something I loath on a full stomach.Ordered the Tricolore: Mixed melted cheese with chopped tomato, basil leaf, Feta,mixed herbs and spring onion..I'm not a fan with food being loaded with cheese, but it was very lightly topped ,basil didn't over power the crepe.. light on the ingredients which was just right without feeling guilty of late night eating.Try their Lattes!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4hnHt_kBvNvJ0lDFqHQxFA",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Latte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4hnHt_kBvNvJ0lDFqHQxFA/o.jpg"
      },
      {
        "img_id": "PjmzjuIiO8x14nTi3t4IRA",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Tricolore Savory Crepe, Mixed melted cheese with chopped tomato, basil leaf, Feta,mixed herbs and spring onion..",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PjmzjuIiO8x14nTi3t4IRA/o.jpg"
      },
      {
        "img_id": "lCzxoTdrf54Ddk_9hd2TCg",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lCzxoTdrf54Ddk_9hd2TCg/o.jpg"
      }
    ],
    "user_id": "18VDWSkSPCvCf5F4CLwWuw"
  },
  "nMJihxsRDgNzDamqMjPXww": {
    "date": "3/28/2015",
    "text": "Culture and class; what else do you need, besides good food? Well, look no further as you have all at this homy and pleasant outlet of the Dutch land in central London!The pancakes are as authentic as in Holland, and the price is right too. A great variety of sweet and savoury pancakes, and a good selection of drinks too. Definitely going again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IUsXRj5iTbxwOj6nI41NHg"
  },
  "QN-0bpwd2AMFWCARijFXLA": {
    "date": "11/27/2010",
    "text": "Forget IHOP, London has My Old Dutch. Dutch pancakes rock. This location is right around the corner from Kensington High Street station making it a fantastic late night stop.Whether you want savoury or sweet, they have a pancake to satisfy your desire. I really enjoyed my four cheese pannekoeken, topped with mozzarella, halloumi (?), cheddar and gouda. Excellent with just a touch of ground black pepper. I was really tempted to have the sweet nutella pannekoeken, but it was dinner time and I also wanted a beer. Sweet with beer just didn't fit my mood.And talking about beers, they have an amazing selection of \"fruit\" beers ranging from black cheery to mango to banana and more. I wasn't quite courageous enough to try one of those, so I had a really good Vedett. Professionally poured from the bottle, it was perfect offset for the cheesy pancake.I can't wait to return and try that Nutella, but they might convince me to have one of the others. Peaches with cream ? Banana, nuts and chocolate cause with ice cream? Oh, the choices!",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QynZRWGvEP65xcCXHUwfDw",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Late night Dutch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QynZRWGvEP65xcCXHUwfDw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "g9Fch7YdmS7b6GzFz3mPTg": {
    "date": "9/29/2016",
    "text": "What a terrific find!  As an American I thought it would be hard to find breakfast after 11am.  But this place had wonderful choices.  Lots of decadent pancakes.  Very tasty and good prices.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jOjNpIXzurYiRZMgFjj4-w"
  },
  "j9P6RDqy8fWGWmsPxVPYjw": {
    "date": "7/2/2016",
    "text": "UNREAL...AMAZING, CANT GET ENOUGH!!!!I love this place, this is my Go-To place for breakfast when I am in london.  The Service is amazing and the food quality is fantastic,  they have a large variety to chose from but i love anything with CHOCOLATE!  Thank you all for always making it an amazing experience!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D0xCP0PHXZEvk3hjqYxtag"
  },
  "kmDZeteEAph-pnvzQgLAvA": {
    "date": "10/10/2014",
    "text": "Always happy to pop in for dessert! I had my favourite sugar and lemon sweet pancake while my friend customised his own - vanilla ice cream with nutella. Topped it off with a warm pot of mint tea -- can't think of a better way to end a cold night!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xJ002EPwsfTpIIzH5Xslqw",
        "caption": "Photo of My Old Dutch - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xJ002EPwsfTpIIzH5Xslqw/o.jpg"
      }
    ],
    "user_id": "rRjr7N6zGB10XP7kd8q8-g"
  },
  "5aATRQUp6qxpaxa3kOOQUg": {
    "date": "6/2/2015",
    "text": "Service was excellent. The people there are extremely nice and helpful. I love how on both occasions that I've been here they always had the place nice and clean. They're always right on to what needs to be done, but I have to say...we ordered the waffles from their menu and they were barely warm. Yuck! Also, they were as tough as cardboard. I'm not saying I'll never go there again but I will certainly never order the waffles. I mean, why have them on the menu. If they're going to be pre-frozen?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ogfh8MoIC78374ag38I-g",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Waffle with banana, nuts, ice cream and chocolate sauce",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2ogfh8MoIC78374ag38I-g/o.jpg"
      },
      {
        "img_id": "MZFOGaZjpqNJk1uwScn5mA",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Waffle w/caramel and ice cream",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MZFOGaZjpqNJk1uwScn5mA/o.jpg"
      },
      {
        "img_id": "nJlsT4onXirXydI5yWUD4g",
        "caption": "Photo of My Old Dutch - London, United Kingdom. Clogs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nJlsT4onXirXydI5yWUD4g/o.jpg"
      }
    ],
    "user_id": "IvHuyLgMSirAwDNYMURsfA"
  },
  "vi-QZ_zRNy951JAap4WB7g": {
    "date": "4/15/2016",
    "text": "The pancakes are good, but sometimes I felt that there are not enough staffs and you need to wait for a long time for the service. The service is not as good as the food.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzTZEk6KSAnZ-fNU_Pt0Qw"
  }
}