{
  "xIK3nV4UNlMEGJ7uJ8860A": {
    "date": "5/24/2016",
    "text": "Fabulous fabulous fabulous. I've never seen and tasted such delicious tapas in all my travels. Exquisite!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XtLvoDOU2o3d_xMvvSTApw"
  },
  "yqFIdK0xiyyjUIMthIPi0Q": {
    "date": "5/10/2017",
    "text": "A great tapas bar in the heart of London, had a great Cuarto Ray's wine, friendly Spanish service, full of local people, best tapas ever. Must go",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OtudKKCaWhfgX4LKwqJWJw"
  },
  "fKo0Mtp8HK6SIevsCS6GOQ": {
    "date": "1/29/2016",
    "text": "Let's start by saying the food here is five stars. Really good dishes with tons of flavor. While they are small(ish) plates they are rich and filling. My wife and I ordered:House vermouth- £6 vermouth is now one of my favorite drinks. This one was mixed with soda water which isn't how I like vermouth but when in Rome...good aperitif thoughOlives-£3 generous portion. Although manzanilla olives aren't my fav, still a good nibble to start with. Bread and olive oil- £2 maybe should have gotten pan con tomate but this was excellent. Bread was like the bread in Spain, warm and fresh. We had the above while we waited for the second seating. We arrived just after 5 pm an already the bar was full. But luckily we sat in about 30 minutes. And hey in Spain you never seem to sit. When we sat at the bar we were given specials which were mostly the seafood of the day. Let me tell you, these go quickly so order ASAP if you want one. After perusing the regular menu we settled on:Fried artichokes- £5 this dish was done right mostly the artichoke heart and lots of flavor in even without the excellent dipping sauce. Omelette- £7 when it came it didn't look like much but when we cut into it there waters potatoes and a flavorful rich sauce that tasted a bit like Worcestershire Chicken wings- £ 6 this was our favorite dish. Three full wings with probably the best dipping sauce I've had this year. Smokey tomato with some zing. A little like salsa but not as watery. Would love to return just for this sauce. Quail- £8 two breast and leg combos cooked more in a sweet raisin and but sauce. Also very tasty and much easier to eat than they look. We didn't have room for dessert but finished off with a sweet sherry £7. When we ordered the waiter asked if we had tried Pedro Jimenez before and gave us an eye of wonder when we had. The seating is all around the bar where they prepare the food so you he to watch them and their banter which is great fun.So why isn't this a five star place? Because it's just not Spain. It's new and has a Michelin star and is in the west end , not some hole in the wall in Madrid where all this would cost €20. So overall great food great drinks. Highly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "MXFLmHc0pGdjTlOpMADeXg": {
    "date": "4/1/2017",
    "text": "Our favorite restaurant in London.  As close to perfection as possible. Fennel salad with pear, John Dory, ribs, and small clams were all amazing",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJy6jw54U32Ws_NUD3d5iQ"
  },
  "mraJxrEt0BpYJ9rDa_WeDw": {
    "date": "1/24/2015",
    "text": "I have had a love affair with the original Barrafina since 2009.  And I hate you all for now knowing about it and going as I used to be able to rock up and get a seat and now I wait two hours.  The same is happening at this new second locale, but the space is a bit more conducive to the wait.  I like this second locale because there are new and different menu options.  While you still can get the mind-blowing tortilla and the spectacular courgette flower there are lots of new options.  Amazing artichokes with aioli, ox tongue, chicken wings with mojo sauce, and not to be missed are the cod fritters.  They also have a large number of specials with lots of fresh fish prepared in interesting ways.The donuts for dessert are quite a treat as well.  Please don't go so I can always get in.  Thanks!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "bFDkJiHcbAl6tBvYfXrluA": {
    "date": "3/23/2015",
    "text": "It has been several days since I visited Barrafina, but I am still dreaming of their food. This may be due to the after-effects of the two bottles of sherry that we drank between three of us, but I prefer to think that it was the excellence of the fare, and the simple joy of watching all your food being freshly prepared in front of your eyes.We had to wait 40 mins to get a table, which didn't seem totally unreasonable given we arrived at 8pm on Saturday evening. Pleasingly you can get a good selection of food as you wait, so you can be half-full by the time you take your seat at the bar/table - perfect if you are a person like myself who becomes unreasonably grumpy when the blood-sugar levels start to drop!Probably the highlight of the whole meal came as we were waiting for our table - the innocuously named 'banderilla', which included an extraordinarily scrumptious soft-boiled quail's egg wrapped with an anchovy; it sounds so simple, but it was truly marvellous! I'd also recommend the jamon de bellota, crab croquetas, scallop ceviche, and the rhubarb pudding thingamajig, but there are another dozen dishes I'd love to try on another visit.The service was perfectly pitched, and achieved the rare feat of being simultaneously casual and attentive. Apparently several of the waiters were 'gorgeous' - not being that way inclined I didn't really notice, but one of my friends was very taken by a number of them...The only catch? Three of us managed to rack up a bill of £240 - not ridiculous, but perhaps unexpectedly large. However, if you like to look at hot Spanish men cooking delicious food then this is the place for you!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "33b-xbtWzFo_lVrFqHvZXQ"
  },
  "172WNBT8VaZxz6l2LzktJQ": {
    "date": "3/28/2016",
    "text": "This is a serious tapas place. They know their business and I can actually say their food is even better than many places in Spain I've been. It is great to see the Chef running the kitchen in front of your eyes while witnessing how fresh their ingredients are. The branch I went was very clean with excellent service. Price wise, definitely you get value out of every penny you spend here.  Their wine list is not extensive but efficient. They are missing one star because it is a bit uncomfortable to get a seat due to the limited space.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_eSw6fcFmlPvhKHjKBWLgQ"
  },
  "awywMhlHGZ6LLn2SgppJUg": {
    "date": "12/20/2014",
    "text": "Absolutely amazed with this place... My husband was not very happy till we sat down to eat.. After which he couldn't stop praising... The service, food n wine... Will defy go back ..",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6maBM_N70oVCDDxTe7GKWA"
  },
  "FGKI-0jsFQi-ceniFGP0jA": {
    "date": "10/23/2016",
    "text": "This is probably the best restaurant we tried while in London. Everything was cook to perfection and the staff was very friendly. The atmosphere is very casual, but the food is fine dining level. I can't wait to go back. Don't forget to try the seafood rice and the mojo!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "45vFTOHdJ53oGHgmmAjZBA"
  },
  "p3J0mUyhXNAmlmXYNB9LgA": {
    "date": "12/28/2014",
    "text": "I went to Barrafina with my company for our annual Christmas party, so I can only speak to the experience of a private party in the downstairs bar area. I don't have any experience with their standard menu or service.The space itself is really nice - there are bathrooms away from the main restaurant, so we weren't likely to bother anyone. It's a nice touch, as private parties can get a little loud. There was also a coat closet, again, nice touch.Our menu was a series of tapas to start with a mix of seafood (which I'm told were fantastic, but I don't eat seafood) and veggie plates. We had bread with olive oil (excellent bread), crab croquettes (highly rated by my colleagues), sweet roasted peppers (good, but underwhelming), fried artichokes with aioli (very yummy), gazpacho (best I've had), and a platter of cured meats that was very nice.Our mains were a choice of pork belly, a vegetarian option (roasted vegetables on toast - much nicer than it sounds), or a fish (highly rated by my colleagues). I had the pork belly, and it was very good. Fell apart on your fork, and seasoned very well. The sides served with it were a hot potato dish (excellent) and a salad of fennel, pear, radish, and dill (also excellent). Dessert was an outrageous chocolate tart with a marscapone ice cream. I absolutely loved it.Overall, the quality of the food was very high. The seafood was raved about around me, and I really enjoyed the meat dishes. The vegetarian plates were a bit hit and miss, though. They were good, but not outstanding and not really anything special. The sauces and gazpacho were fantastic, though. High marks for seasoning and flavour.I would go again, but I reckon if paying myself I might feel a bit frustrated with the dishes that miss their mark.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NGz-IM5lOk5-5-tv4Nu4ZQ"
  },
  "Mrsxm2k-blvIShNLoScV7A": {
    "date": "9/14/2014",
    "text": "London's really kicked up its food scene in the past few years.  Barrafina... the atmosphere, food, and service were excellent.  My friend had put his name down and instead of waiting an hour, we were able to get a table within 1/2 hr on a Friday night.Between the three of us, we ordered a bottle of white wine (Flowers and Bees - really nice, crisp and refreshing taste), 8 dishes and a dessert.  Standout dishes in no particular order except for the monkfish.If the monkfish is a special on the day you visit, definitely get it!  So friggen good.Iberica pork ribs - a nice smoky flavor, fall off the bone consistencyTheir artichoke and aioli was simple yet had lots of flavorThere's this endive dish that is also really nice.Pan con tomate - simple yet so good (really decent sized portion too)Tortilla - that caramelized onion was quite niceThe flan!  Oh flan... there was definitely vanilla bean in that dish.Unfortunately a shrimp allergy prevented me from trying those dishes but our counter neighbors got it and the dishes looked and smelled wonderful.The portions here are way bigger than any tapas portion in the states (weird, I always thought that the portions in the states were ridic and Europe had \"normal\" portion sizes).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_I4S9ZWAoJ2PDippwT605g"
  },
  "Z3AAQx3XNXrAwS9ITmlnUQ": {
    "date": "7/24/2014",
    "text": "I am obsessed with this place. I could seriously stuff my face all night in here.  But alas, I have only two stomachs (one for mains, another for desserts).Hearing that Barrafina had recently opened a second location, I decided to rush over for dinner on a Friday night. Normally this would mean a 2 hour wait at the Soho Barrafina, but Covent Garden Barrafina was ready for me. It's more like Charing Cross Barrafina, but we won't deal with semantics now.We ordered:Toast and Alioli £3Stuffed Courgette Flowers £7.8 (singular courgette, but such a lovely stuffing of ricotta and honey)Morcilla and Piquillo Pepper Tortilla £6.8 (BF concluded it was the best tortilla he's ever had)Arroz de Marisco £9.8 (beautiful risotto-esque dish complete with seafood)Razor clams (Market Price, not sure how much it was but came with 3 razor clams with beautiful sauce)Beef meat skewer (not sure how much it was, but was grilled perfectly)Pimientos de Padrón £5 (this was a bit oily, but I still liked it)I dipped into my second stomach a bit after indulging too much in the dishes we ordered, so didn't have room to order Dessert.  Next time I will have my eye on the flan... and the Artichoke dish... and the Jamon... and the other Tortillas...",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVEZUCVWL2CxJpZKQoHKyQ"
  },
  "FrEVI_II79ZjG6I-UKjQnQ": {
    "date": "10/26/2015",
    "text": "Excellent in every way.  Food first:  so many wonderful tapas choices - seafood, vegetable, meat - endless varieties.  Seated at the counter, you observe the wonderful preparations of everyone's selections.  The service is spot-on, knowledgeable, friendly, and efficient.  If we were in London for more than 2 days, I would absolutely eat here again.  Can't miss!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yv-rpKLNtqDf1CMhI4ezVg"
  },
  "qvpPpPeJyjU03tHHgH5kug": {
    "date": "7/30/2015",
    "text": "Friend and I first went to the Barrafina on Frith street, but there was a giant line and they let people in in ~hourly waves, so we decided to walk the few minutes to see if this location was any better. No line and insta-seats! Yay! The staff were all authentically Spanish and provided some amazing service and recommendations (made sure my glass was never empty). These are not the common tapas you can get at the other spanish tapas bars in London... some regional authentic stuff that's hard to find elsewhere. Everything we ate was amazing and beautifully served. We were getting food envy just by looking at our neighbor's orders... and it's hard to figure out when to say stop to tapas. In one of my dreams, I would just be sitting at the Barrafina bar. all day. eating tapas.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qnrq6N5x10bToGqjIrtIPg"
  },
  "8Z9HFL5XHESjQ7e-YUmTVg": {
    "date": "7/17/2016",
    "text": "amazing service, excellent food, good wine selection. All at reasonable prices, what else can you ask for.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uYjBmAUyyUQcRz0H0QVF-Q"
  },
  "jCarm7-sl9Ns7cnVp34Bwg": {
    "date": "4/10/2016",
    "text": "Great food, lots of seats at the bar where you watch the chef's prepare.  Fun for a child too, if they like that kind of thing.  Should note that it's a loud and high energy sort of place, very fun and exciting.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jPeOLVzTeLsOVWZTkQVSA"
  },
  "MJD0c2BtFMuIInHoIS9u3g": {
    "date": "12/15/2014",
    "text": "I enjoyed the layout, atmosphere and experience of being seated at the bar and watching the chefs/preparers live in action, being able to have a conversation with them about the food, preparation and learning more about Spanish Tapas.   Friendly, young, fun and good looking.  (however, I thought the price the plates commanded warranted a more polite attitude - too often they were in their own little social world behind the bar and getting their attention was too much work when required).  The food was pretty good but not especially memorable (the seating arrangements and cute Spaniard boys behind the counter were more memorable) - I especially enjoyed the Sardines however.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYkBryZYNh5DkYqsVojsTA"
  },
  "CIwAlZ6FBGHWeqPZTWc9Ww": {
    "date": "3/21/2015",
    "text": "Spanish tapas bar with a twist. Modern venue with a lovely set up. All eaters are sat overlooking the kitchen. All dishes looked amazing and the ones we had certainly tasted amazing. Tortilla with ajetes, gambas and mushrooms and the escalibada were among my favorites. Look out for specials, ours were really nice too! Both the menu and the wine list just have a decent size and the selection is fantastic. We had a nice Rioja Crianza to go with it.The milhojas was big and a great dessert to finish an amazing tapas experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MHaS8pyvQQ6oyeG8m_fxKA"
  },
  "QVCzyrwkl6gJdtTEoxICsA": {
    "date": "12/31/2014",
    "text": "Great food and awesome staff.  The best food we had in London during the seven days holiday. The prawn is worth every penny and the pork ribs too..... Lastly the desert is great too. Don't miss it on your trip to London. (Just go).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VTAPrQgFK9S6fMhpZ1oW3Q"
  },
  "mEI6SQPMmNFQULToeRlvnA": {
    "date": "4/11/2016",
    "text": "London's answer to Barcelona's best tapas bars. From the atmosphere, to the service and the food, except nothing but perfection. So sure, you might have to wait to get to perch on one of the red leather bar stools, but trust me when I say it's well worth it. Plus crab croquetas and a glass of crisp white wine make the wait feel much shorter!cakeandwhisky.com/2016/0…",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B2CkrL-UQlgPeIby8qy7aQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Doughnuts at Barrafina Adelaide Street",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B2CkrL-UQlgPeIby8qy7aQ/o.jpg"
      },
      {
        "img_id": "R3cHogVvEJaT9g6Sb3l8dA",
        "caption": "Photo of Barrafina - London, United Kingdom. Iberian pork rib (get it!) at Barrafina Adelaide Street",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R3cHogVvEJaT9g6Sb3l8dA/o.jpg"
      },
      {
        "img_id": "b8xOoskM63je5y_8b6iybg",
        "caption": "Photo of Barrafina - London, United Kingdom. Cuttlefish & chickpea at Barrafina Adelaide Street",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b8xOoskM63je5y_8b6iybg/o.jpg"
      }
    ],
    "user_id": "q38wOlIWVCo5wGsPIa_TzA"
  },
  "vdLAM-a61fjkcanJujQIRQ": {
    "date": "9/11/2017",
    "text": "It's hard to say what was the best, the wonderful staff, or the the food you live to eat. Absolutely everything was wonderful. Prepared before us by individuals who look so happy. They answered every question. Living in Louisiana I look for restaurants that are unique and above the bar.. and they exceeded my expectations .Just remember to save room. The desert is fantastic..",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GrxNdLKgWjIOEHL8ptgRFg",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GrxNdLKgWjIOEHL8ptgRFg/o.jpg"
      },
      {
        "img_id": "HG2n1cEPSb60RbEHogjANg",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HG2n1cEPSb60RbEHogjANg/o.jpg"
      },
      {
        "img_id": "pae7XqD29HzJcTHt_Z2bIA",
        "caption": "Photo of Barrafina - London, United Kingdom. Save room.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pae7XqD29HzJcTHt_Z2bIA/o.jpg"
      }
    ],
    "user_id": "CzDwKSeciGJlHqqBbRcU-Q"
  },
  "BA9u6zB84U_IXHa-OPE_Cg": {
    "date": "1/20/2015",
    "text": "Stumbled upon this place at 9 PM on a weekday and was pleased that it was half empty. I think we've all been intimidated by the popularity of the older branch in SOHO that I couldn't believe I finally get to try Barrafina, at the much less crowded Charing Cross branch. Shared 5 dishes with two other girls, we were all beyond full when we finished. Everything was delicious and I remember myself fiercely protested when our server attempted to take away an almost empty place - there's still some sauce at the bottom!  Our server was patient and friendly. It'd have been a 5 star experience if not for the glitch when we settle the bill - we were charged for 2 bottles of sparkling wine instead of two glasses! I believe it's an honest mistake but we'd have paid £15 more each if my friend didn't catch it",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3h3TXsNmViX_wzXnCBbz4w",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3h3TXsNmViX_wzXnCBbz4w/o.jpg"
      },
      {
        "img_id": "udCz7lZ0sonlyx7Mg__CRQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Pear boiled in red wine (dessert)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/udCz7lZ0sonlyx7Mg__CRQ/o.jpg"
      },
      {
        "img_id": "NHQJxopX21jtgxhf-2DQkg",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NHQJxopX21jtgxhf-2DQkg/o.jpg"
      }
    ],
    "user_id": "sY_uz6P1sux3tKt1TEGqjA"
  },
  "X6BTsbe0wV7XPcTovc3bhA": {
    "date": "7/9/2017",
    "text": "The best tapas we've ever had - bar none! This Barrafina (there's two others) has a relatively small number of seats, so be there when they open or be prepared to wait. One way or the other it's worth it.The food is exceptionally good. Everything is cooked or made right in front of you. The chef inspects every plate before it is served. I saw several plates redone to his satisfaction before they were served.It's a lively place with call and response by the staff. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9enZX8lqOMQHazeG3UhgCw"
  },
  "hlSX8cvcuBG-eR47Qi9QNw": {
    "date": "6/9/2016",
    "text": "This places fires on all cylinders. Get there early as line-ups are unavoidable. Super efficient kitchen putting out every plate with attention to details. My favourite was the Spanish spot prawn which was flown in on the day. The tuna tartare with avocado moose was delicious. The endives with anchovies and bacon was good, as was the Tortas/quiche. Pretty much what ever you order will be served with great talent and effort. Bring your check-book as it is not cheap but worth the price of admission.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tvCcluwsze6Vow8gS5joPQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Soho location",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tvCcluwsze6Vow8gS5joPQ/o.jpg"
      },
      {
        "img_id": "UPY3iUkPglSzL5KoZrNbww",
        "caption": "Photo of Barrafina - London, United Kingdom. Seafood on ice.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UPY3iUkPglSzL5KoZrNbww/o.jpg"
      },
      {
        "img_id": "_ZiHcsOJUA0dwYgp69UxWw",
        "caption": "Photo of Barrafina - London, United Kingdom. Pan de tomate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_ZiHcsOJUA0dwYgp69UxWw/o.jpg"
      }
    ],
    "user_id": "B1YiexaiQzK-KOVveQuR_Q"
  },
  "qJUiybCsx_vd-XJWcN8ZAA": {
    "date": "1/31/2017",
    "text": "Completely overrated and over priced. There are much better tapas places in the area. I've had the worst courgette flowers, like ever. And our waitress was useless, hardly spoke any English. Don't believe the hype unless you're into mediocre food and tourist traps. I feel so disappointed by this place because i really wanted to like it!",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "7p2jcoaUm5Q3oh68s6Lm2w"
  },
  "P_sC_RpEla83n-rZFZGicg": {
    "date": "5/5/2016",
    "text": "Barrafina serves really delicious food and has wonderful service. It can be quite tricky to get a seat because the space is small and everything is served at the bar, but the staff made a real effort to make sure our group of three could sit together - even asking other customers to scoot down so that we could get seats together! The tapas are pricey, but the food is very high quality. I especially loved the fried artichoke and the crab croquetas. Sitting at the bar means you can see every other dish being prepared right in front of you, so we definitely ended up ordering some extra food when we saw something fantastic being whipped together!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "BpHoMr3yBlv-bhB-_dZarA"
  },
  "srqmW_-gK0A-ZLrNGkeu-A": {
    "date": "2/12/2017",
    "text": "One of the most authentic and exquisite Spanish restaurants in London! Tried the lamb brain for the first time, it isn't what everyone would go for but certainly a remarkable experience. It was deep fried with a texture of an oyster, and the chilly tomato sauce on the side really brings a good contrast with the dish. We also ordered the scampi, padron peppers etc. In general they are all finger-lickin' delicious and the atmosphere was ambient and staff were very welcoming. Can't wait to go back again!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Xd_sTBpHcql0_17QrnzAg"
  },
  "8gO9eFvnzSft8X0TbSH-Fw": {
    "date": "5/31/2017",
    "text": "Exceptional service, really friendly and helpful staff.  They were great in offering suggestions, helping pair wines, pace meals, and understand what to order. Watching them keep everything straight with so much going on was really impressive to watch!The crab croquettes were a great nibble. We shared the Jamon iberica which paired very well atop the pan con tomate (order a piece per person). But the real show stopper was the pork ribs. Yummm. The meat just fell from the bones in all the right ways. Many others around us got the stuffed courgette flower  (zucchini for fellow Americans !) which was stunning in its presentation ! We showed up at about 545 on a Sunday night (before a bank holiday) and had about a 50 min wait, although we were quoted an hour 20 so this was quite ok! They fill up immediately when they open and don't take reservations or names. But they have a great system and will set you up with a spot to wait and order nibbles or drinks with complimentary still or sparkling water. The wait went quickly and we were able to watch what others were ordering and it helped us decide what we wanted to get when we were sat. This restaurant is all bar seating along one winding bar top, but it looks like they have a space for entertaining downstairs you can rent out.Highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fvt3GnBm8C-oVKSucy3PMw"
  },
  "enNvXU7NO43rkSutZNAmMg": {
    "date": "5/19/2017",
    "text": "THE GOOD:Fantastic presentation.Unique variety and well-prepared tapas.Good atmosphere.Lively bar style seating.Good location.Open kitchen allowing you to see the passion that goes into each dish.THE BAD:Minimal libation offerings other than wine.THE UGLY:Nothing of mention.OVERALL IMPRESSION:I recommend this restaurant to anyone looking for a variety of delicious, well presented and cared for tapas. This is a great place to go for both a pre-dinner and a dinner meal though can be quite busy so arrive early.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sbdzqZwlWc4WXQ4FA0hVgQ"
  },
  "B-qPOGnPSNppkRhDUYUtXQ": {
    "date": "4/30/2017",
    "text": "I can't wait to come back to London so I can return to this wonderful establishment! The queue moved quickly and we were counter-side dining in no time. The staff recommended their favorites, we ordered them all and enjoyed every last bite. The house red wine was delicious and priced fairly. This is a must stop when in SoHo, London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKXibiPNULOD_xyG_cSgWg"
  },
  "KC9qu4_VSU2GHchNhXpKeg": {
    "date": "3/6/2015",
    "text": "Outstanding Spanish fare prepared to a very high quality. Highlights; the mussels, pork belly, calcots(seasonal), tuna.Be prepared for quite a bit of ambient noise and to sit at a bar.An experience well worthwhile.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o4fX4RPaovJfle7ubAD_tw"
  },
  "IsWkrc_-egKLzEWebHNgGg": {
    "date": "2/14/2016",
    "text": "Came here in New Year's Eve in 2015, and eating here was never a mistake. In fact, it's the best decision of the year. Service here was on point, even though the place was full. The wine selection was very nice as well.The food was incredible, really amazing taste in the tapas. The Shoulder Iberico, the Tapas de Entrecot Gallego and the Bocadillo de Calamar is a must.All in all, a must try in London.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8xfFgI1yZiJq-IDK13GJBw"
  },
  "kbAJBmcttZP5ny-rOmIlWA": {
    "date": "6/8/2015",
    "text": "I was lucky enough to discover Barrafina (the one in Soho) on a trip to London several years ago.  I make sure I return every time I come back to London.On this particular trip to London whilst walking from our hotel to the Golden Jubilee footbridge we stumbled upon the newer Barrafina near Covent Garden -- very close to our hotel.  Wonderfully (and as expected), this Barrafina is as good as the original with the added bonus of it being less busy than its Soho sibling (only a 30 min. wait at 7:00pm on Sat. night).Being a Spanish tapas restaurant modeled after an old-fashioned American diner, Barafinna is perfectly suited to my preference for making a meal out of shared small plates at the bar.On this evening we started with a bottle of The Flower and the Bee Coto de Gomariz (Spanish white) and Marcona Almonds. We then proceeded to order an amazing round of small plates: lightly fried fresh Anchovies (special); Fried Oysters (special); Prawn & Bonito Carpaccio; and Crab on Toast.  Every dish was an amazing mix of tastes and textures expertly prepared and presented.I already suspected our meal would be amazing due to my previous visits to Barrrafina in Soho and I was not disappointed.  And my girlfriend, who'd never been, is dying to go back.  Luckily, we are in London for several more days.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bsRe1KKyDXCc37JclfeYIQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Razor Clams (special)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bsRe1KKyDXCc37JclfeYIQ/o.jpg"
      },
      {
        "img_id": "kZ4IwQ2-YR2B_ZlIDohfFQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Stuffed Zucchini Flower",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kZ4IwQ2-YR2B_ZlIDohfFQ/o.jpg"
      },
      {
        "img_id": "qnKoBNCuCN-ibjdlSWuDRQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Calamari sandwich with chips.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qnKoBNCuCN-ibjdlSWuDRQ/o.jpg"
      }
    ],
    "user_id": "oHiAmHNkea-uc_JHl14HMg"
  },
  "8Ibaa1cOQHFSVii6zo6o5Q": {
    "date": "10/22/2015",
    "text": "I came here for the excellent yelp reviews and stayed for the tapas, atmosphere and service.  Where do I begin?  Let's start with the tapas.  Disclaimer: my coworker and I were very hungry so we tried an absurd amount of tapas.  I recommend all of them.  Full list: -Pimientos de padron-Manzanilla olives -Crab croquetas-Queen scallop ceviche-Artichokes, aoli-Pan con tomate-Some amazing jamon tapa that was on the special menuI can honestly say that every single one of the above was very good.  If I had to narrow it down, I would get the artichokes, pan con tomate, and crab croquetas. You will not be disappointed (or hungry)!The next thing I loved about Barrafina was the atmosphere.  The bar style seating made it easy to interact with our server and order dish after dish with his expert recommendations and we were able to watch the chefs in action!  Great place for a date or dinner between two friends, but would be difficult to have a conversation with more than 3 people because of the seating.  It was well lit and had a decent volume level which are both very important to me. Finally, the service was outstanding.  Our server, Nico, had a contagious smile and attitude that made the experience that much better.  He is always laughing and you can sense the passion he has for his job.  It showed in the expertise he offered too.  If only every restaurant had a Nico!Bottom line - just go here. I can't think of one reason not to.  But keep in mind it is relatively small so you may have to wait - it will be well worth it!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0OlWmrENKsxnqn5FEYaMBw"
  },
  "91Ird8EqiHI2n4t2TrZCyA": {
    "date": "8/11/2016",
    "text": "For a Spanish tapas outing in London that you will want to repeat over and over again, try Barrafina. The menu has a great variety of different kinds of dishes: meats, fish, seafood, vegetables, rice, pasta, cold, hot, spicy and sweet.... All in small delicious bites. We tried many different tapas, and we liked one more than the other. The flavors are incredibly good and at times the combination of ingredients surprising. Staff was friendly and service good. Drawbacks: very loud and crowded restaurant. They do not take reservations and the line to get seated can be long, any day of the week. Do not go there expecting to have a quiet meal. But when you savor the first of many bites, you forget it all!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PWMln1zL_AE2qmRNYi2CiQ"
  },
  "9P2w9-IXl-NH-0DKIUvSPg": {
    "date": "10/14/2014",
    "text": "Love the counter top seating. Love the convivial and communal atmosphere. Love the bustling open kitchen and the fragrances of the tapas dishes being prepared fresh in front of you. This is a fantastic place for a lunch or dinner with one or two friends. any more than that and you're unlikely to find seating together or get a stiff neck trying to speak to each other.The extensive and varied menu is arranged by category (meat, seafood, vegetarian, fried, breads, cold cuts etc) which works really well.Delicious pan de tomate - toasted bread rubbed with garlic, very fruity extra virgin olive oil and tomatoes. Perfectly crunchy, fragrant and fresh.Arroz Negro - cuttlefish and squid ink paella cooked perfectly slightly al dente, with two juicy crispy king prawns on top. The paella was sufficiently moist without being runny or saucy.Cod fritters - how special can fried cod be? They certainly made it yummy by stuffing them full of meat that was juicy somehow with garnished with slivers of peppers for a little kick.Tortilla - perfectly formed, firm on the outside, soft and gooey on the inside with onions, egg and potentially a white white reduction. Delicious.Love this place and will be back regularly.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BQDdLJqmVpH8R7LD466IKQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Cod fritters",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BQDdLJqmVpH8R7LD466IKQ/o.jpg"
      },
      {
        "img_id": "8jh6LzRR4wnyWY1UflTzdQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Pan de tomate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8jh6LzRR4wnyWY1UflTzdQ/o.jpg"
      },
      {
        "img_id": "tvsx9vNsbRf1HkAZZaXcJg",
        "caption": "Photo of Barrafina - London, United Kingdom. Tortilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tvsx9vNsbRf1HkAZZaXcJg/o.jpg"
      }
    ],
    "user_id": "CcMH2bObppn53U-9FK3foA"
  },
  "e0F-6vmjjCPooktSuz1uiA": {
    "date": "7/4/2015",
    "text": "Delicious food! Not simply the traditional Spanish tapas, very fresh fish and few new dishes made the different. Really enjoyed sitting on the bar to witness the vibrant cooking team, their passion resulted in the wonderful food in front of me. Last time I visited this venue was 8 years even before Barrafina opened. All interesting memory with totally new content.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "q4iA-scSadWfdFustj3g7A",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q4iA-scSadWfdFustj3g7A/o.jpg"
      },
      {
        "img_id": "KsxYb8eq1fimT8AouwsB5A",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KsxYb8eq1fimT8AouwsB5A/o.jpg"
      },
      {
        "img_id": "G2u4ny8tl3LYXbp9MFQ9kw",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G2u4ny8tl3LYXbp9MFQ9kw/o.jpg"
      }
    ],
    "user_id": "Civg8uGnh9_fiHuyzSZKbw"
  },
  "BPFTmPNzEadUhCax8LA6GA": {
    "date": "8/16/2015",
    "text": "I was walking around Covent Garden with a friend late Friday evening, intending to just grab another glass of wine somewhere, when we stumbled across Barrafina, which has been at the top of our to-dine lists for ages. Luckily, with the opening of two new locations (including this one), the Michelin starred restaurant has become a lot more accessible, despite its no reservations policy. We were given an estimated wait time of 45 minutes, but you spend all of that at one of their many window ledges, with a menu of \"para picar\" bar snacks and a wine list, so what more do you need? Plus, the para picar is also part of the main menu, so it's like eating your first course while you wait.We got an order of crab croquettes, which was absolutely lush. It was oozing with crab, as opposed to crab cakes that are generally more starchy and solid. We also got a bottle of red wine, the Old Vines 2012 Espelt, that was beautifully smooth and one of the best wines I've had in a long time. (One bottle ended up not being enough). The wait time flew by and before we knew it, we were seated at the bar, surrounded by Spanish people on either side. A lot of the clientele seem to be Spanish... it can be argued that they get somewhat better service. In any case, that's when you know you are at a very authentic restaurant.Since we'd already had a bite to eat earlier, we refrained from ordering the whole menu, but it would have been rude to not get at least a few dishes. We got the Spanish tortilla with prawns, garlic, and mushrooms, though I didn't note any prawns, and it was more of a dark, flavorful, almost soy sauce tasting version of Spanish tortilla. I would definitely recommend it. We also got one of the seafood specials, which was described to me as a fried mini dover sole. That was ok, but difficult to eat because of all the bones. Meanwhile, I had massive food envy at the Spanish girls next to us who ordered chipirones, basically fried calamari - should definitely have gotten that. Lastly, we got the Iberian pork ribs, the star of the show. It was basically like a beef stew type of sauce with braised onions and carrots, and the short rib falling off of the bones. So amazing. And a very generous portion size, much larger than what you would expect for tapas.We sat at the bar for quite a bit, talking with the staff and the fellow diners seated next to us. I think it would be difficult to come with a group larger than 3, simply because it's difficult to make conversation with large groups while seated at a bar. We did not feel any pressure to leave, and there weren't many arrivals after us because the restaurant closes at 11 PM (must be disappointing for diners accustomed to Spanish dinner time). But now that I know how pleasant the wait experience is, I would definitely come again! It was infinitely better than my time at Social Wine & Tapas, where you are crammed in a tight lobby with no food or drink until the very end. Barrafina was amazing, can't rate it highly enough!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "2hoaETjwATEziQP04ONuQQ": {
    "date": "8/8/2015",
    "text": "I've heard really great things about Barrafina but our meals were really of two halves (or 2/3 and 1/3).  If there is one thing I could impart from my experience to you, it'd be- don't eat from the vegetables section (both our choices bombed).  Go to Nopi for your veggies desire- coz the veg dishes were merely ok (basically it sucked compared to our other dishes, and the comparison in my POV is how I feel everytime I order meat at NOPI- not their strong point at all, and none apart from the chicken I actually felt like I would order again).Fantastic:  Scallop on a blood rice pudding with a slightly curried cream (special for the night, oh my... I wanted to marry it)Prawn and bonito ceviche ( I could pickle myself in that sauce too)Chicken wings with some type of well-sexual harissa sauce (Oh, why can't all men be like this in bed)Good:Suckling pig (not crispy or thin skin enough, perhaps it's coz we got the trotter? In any case, not worth the price tag, I mean, this ain't got nothing on a Chinese suckling pig)Chicory in a salmorejo sauce (Perfectly... OK.  Bit DULL. Again, spend your money elsewhere)Not recommended:Mushroom carpaccio (£7 for 1 poxy sliced mushroom with a bit of garlic and salty oil, SERIOUSLY?  SERIOUSLY ARE YOU KIDDING ME? LIKE, I CANNOT GET OVER THIS)Alameda sherry- they poured me the wrong one by mistake.  It was FREE and we couldn't finish it.  Wayyy too almondy and pungent, I would recommend going the full hog for a PX if you want a dessert sherry.  It's like having a PX without the sex appeal.We split a house cava (was told an 1 hour wait, ended up being only 30 minutes) and I had a La Gitana as well.  Perfectly quaffable.  House cava had the virtue of being organic.For £100- well some of the dishes were wayyy overpriced (YES, MUSHROOM I AM LOOKING AT YOU).  I would definitely be back to try the fried food and other numbers on the menu, but will also definitely be getting my 5-a-day elsewhere. Probably won't recommend you to bring your vegetarian friend with you to this one...Also, 5 dishes between 2 would be plenty unless you are feeling particularly greedy.YES.  THAT FRIGGING MUSHROOM LOST YOU A STAR.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yBvTTA0p7ZoRNl-7N1mB1w"
  },
  "deBe6djuZbuH0anWz7AgLw": {
    "date": "10/15/2018",
    "text": "Go early and get ready for a queue.  But the wait is worth it, plus you can order small bites and drinks while you wait.  This place is counter service only, but that just adds to the ambiance in my opinion.  The food is simple, the ingredients are fresh and the service is attentive but a bit slow (but still fast by Spanish standards).  Standouts for us were the fresh seafood dishes we ordered off the daily chalkboard: the clams, octopus, and prawns.  But don't skip the Spanish Tortilla or the Octopus which are favorites on the menu.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4z90PGJhsRSBrxByOCR2VA",
        "caption": "Photo of Barrafina - London, United Kingdom. Amazing octopus.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4z90PGJhsRSBrxByOCR2VA/o.jpg"
      },
      {
        "img_id": "U94Is0R7RSedR8L4TEZa6Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Giant prawn",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U94Is0R7RSedR8L4TEZa6Q/o.jpg"
      },
      {
        "img_id": "OFQpGNmdBasDUI00sqr9qg",
        "caption": "Photo of Barrafina - London, United Kingdom. Clams were epic",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OFQpGNmdBasDUI00sqr9qg/o.jpg"
      }
    ],
    "user_id": "GN1Z4kG8oqc21EX9OWOs8Q"
  },
  "cH6gZcMm_kB1bKAUUFYQ6g": {
    "date": "7/5/2018",
    "text": "My experience in Barrafina at the Covert Garden was ok. The food seems to have similar taste. Nothing really stand out. The dishes I ordered was good, just that nothing is profound. Here's what I ordered:Cuttlefish croquettes Queens scallopMonkfish fritters",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hz2Ih3RPbbZj7n9NBGZvwg",
        "caption": "Photo of Barrafina - London, United Kingdom. Monkfish fritters",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hz2Ih3RPbbZj7n9NBGZvwg/o.jpg"
      },
      {
        "img_id": "91AAcD73k-ZsZFXAsq3uUQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Queens scallop",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/91AAcD73k-ZsZFXAsq3uUQ/o.jpg"
      },
      {
        "img_id": "Ny3n8R_AsoIsNq90XmtGHA",
        "caption": "Photo of Barrafina - London, United Kingdom. Cuttlefish croquettes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ny3n8R_AsoIsNq90XmtGHA/o.jpg"
      }
    ],
    "user_id": "in62N6kF0gazXhi2Y7tI7Q"
  },
  "b2tjiv3IkX4cA6noBR5bfg": {
    "date": "6/12/2018",
    "text": "Had a very enjoyable meal at Barrafina late on a Friday evening. Came with a friend who had been before. Was told on arrival 20-40 minute wait, and it was 45. Not too bad as we had a drink and our starter of Cuttlefish Croquetas stood at the window where theres a convenient shelf built exactly for this purpose. All the seating is at the bar with views of the food being cooked. We ordered 4 tapas between 2 of us, being assured by the waiter that this would be sufficient. We ordered John Dory, Octopus, Quail and Suckling Pig. I would say it was all delicious. The Octopus was not really for me though my mate really enjoyed it, for me it was just a bit too chewy. A 12.5% service charge is automatically added to the bill, bringing our total to £128. The food was great, but for me that was just a bit too expensive for what we had. In summary great food, but star lost for long wait time, high prices and auto service charge.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnLkZGnuTP7_1lhUowhC4Q"
  },
  "GeAG0fIUS41w1UTF8YN-vA": {
    "date": "6/6/2018",
    "text": "Although there was an ordering snaffu and my food took longer than expected, the food and show behind the bar were worth the wait. I had the stuffed courgette flower and the Tapa de Entrecot Gallego. The sweet honey flavor of the flower played well with the tang of the cream cheese, the steak was well seasoned, and the potatoes perfectly crisp yet tender. I recommend going alone, people think it's lonely but you get sat more quickly, make friends at the bar, and get food faster -- which sounds more lonely now?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vYeQFpX6b-7GIxL6_7cdHg",
        "caption": "Photo of Barrafina - London, United Kingdom. Stuffed courgette",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vYeQFpX6b-7GIxL6_7cdHg/o.jpg"
      },
      {
        "img_id": "hqMqDXmMfelEcvGJw84Jfw",
        "caption": "Photo of Barrafina - London, United Kingdom. 10.5   Tapa de Entrecot Gallego",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hqMqDXmMfelEcvGJw84Jfw/o.jpg"
      },
      {
        "img_id": "j9Let9ZFsFPscHGLv2M-lg",
        "caption": "Photo of Barrafina - London, United Kingdom. 10.5   Tapa de Entrecot Gallego",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/j9Let9ZFsFPscHGLv2M-lg/o.jpg"
      }
    ],
    "user_id": "khMy2utlvRq3nY5oAe0reg"
  },
  "vjXaQEW3TgWHJF2c-jKlJA": {
    "date": "9/30/2017",
    "text": "There's usually a wait but there are plenty of places to stand and have a drink and a couple bites while you wait for a seat at the bar. There are plenty of options for vegetarians. I especially loved the pan con tomate, and the freshly made tortilla. And definitely save room for dessert!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tD1aI8ywHEDOgART8UfEWQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Dessert",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tD1aI8ywHEDOgART8UfEWQ/o.jpg"
      },
      {
        "img_id": "GQul09rnxpQZMI56uNPntg",
        "caption": "Photo of Barrafina - London, United Kingdom. Tortilla",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GQul09rnxpQZMI56uNPntg/o.jpg"
      },
      {
        "img_id": "XJDKOsh4a4o4mVeWigV1mw",
        "caption": "Photo of Barrafina - London, United Kingdom. Pan con tomate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XJDKOsh4a4o4mVeWigV1mw/o.jpg"
      }
    ],
    "user_id": "3UfaNU33lD86wnyAIwyhzA"
  },
  "iBEN6JL8yyNMq5YJ23Dkbg": {
    "date": "5/9/2017",
    "text": "We came with another couple and sat for probably 4 hours and ate and drank till our hearts content. It wasn't as expensive as I thought it would be ~ 40 quid per person. Think about it- that's actually amazing! And it was awesome to come with another couple because we could try more food! We all sat at the bar and the waitstaff was very accommodating- actually they were fantastic. I'm not sure if there is other seating downstairs or if everything is bar seating. Here's what we ate. Crab coquetas- creamy and delicious on the inside, and crunchy on the outside Pan con tomate- nothing like pan con tomate in Spain (I'm such an expert) but still deliciousArroz de Marisco- delicious! I thought it tasted like paella but maybe it's not. Full of flavour and the rice has that nice texture that paella has. Stuffed courgette flower- oooooh yes this was delicious. Super crunchy on the outside and a creamy surprise on the inside!Judion, fennel and smoked salmon- Very lovely flavours. Fresh, crunchy, healthy, deliciousYellow Chicory, Don Bocarte Anchovies and Salmorejo- Another fresh and delicious dish. The price is pretty steep on this one but it was a nice addition.Milhojas- the most delicious dessert!!! layers of fluffy pastry with the creamiest custard in the centre. YUM!This was a fantastic experience with great drinks, delicious food and wonderful people.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "zfTd1d5JKWdFdagM_5vesw",
        "caption": "Photo of Barrafina - London, United Kingdom. Crab croquetas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zfTd1d5JKWdFdagM_5vesw/o.jpg"
      },
      {
        "img_id": "er6Fn2vfY74KRxAl4s5yFA",
        "caption": "Photo of Barrafina - London, United Kingdom. Pan con tomate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/er6Fn2vfY74KRxAl4s5yFA/o.jpg"
      },
      {
        "img_id": "aWskkeTDqRPxUVWJd5os8Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Arroz de marisco",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aWskkeTDqRPxUVWJd5os8Q/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "IKrJRGjoa-9__S6SklmHEA": {
    "date": "5/11/2017",
    "text": "There are 3 different Barrafina locations in London; all have slightly different menus. The one on Adelaide street serves the signature lamb's brain, so obviously that's where my coworker and I went. This Michelin-starred tapas restaurant makes it to almost every list of London's must-try food spots. They serve authentic Spanish tapas that are great for sharing. However, because the dining area only has counter seating, it isn't ideal for parties larger than 3. We came for Tuesday dinner at 19:15 and were seated in a little over an hour. The wait is indeed quite daunting, but you will be rewarded with a flurry of small plates that are both delicious and creative. // Classic Tortilla (£8.00) - 3 stars// Milk Fed Lamb's Brain (£10.60) - 4 stars// Stuffed Courgette Flower (£8.50) - 4 stars// Crab Croquetas (£6.80) - 4 stars// Oyster, Lime & Chillies (£3.90 each) - 3 stars// Herb Crusted Rabbit Shoulder (£9.50) - 5 stars// Mackerel Special (£15.80) - 4 stars",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "dlfOpWn4jHVyTzABx1G8pg",
        "caption": "Photo of Barrafina - London, United Kingdom. Classic Tortilla (8.00)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dlfOpWn4jHVyTzABx1G8pg/o.jpg"
      },
      {
        "img_id": "gPZbJZxTp230TAzkSwgLxg",
        "caption": "Photo of Barrafina - London, United Kingdom. Herb Crusted Rabbit Shoulder (9.50)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gPZbJZxTp230TAzkSwgLxg/o.jpg"
      },
      {
        "img_id": "mjKmSeUdSPWi_Et6JOzOQw",
        "caption": "Photo of Barrafina - London, United Kingdom. Mackerel Special (15.80)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mjKmSeUdSPWi_Et6JOzOQw/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "D22ravRiEHhZj_hXObIyGw": {
    "date": "4/26/2017",
    "text": "One of my favorite dining options in London. I've visited the original SOHO location numerous times and decided to try this newer location. This location is roomier with more seats at the counter. Still not an ideal place for parties larger than 3 for it is counter seating only and first come first serve. Service is prompt and very friendly. While a small thing it may be meaningful for some that the water (still or sparkling) is on the house. The food is as good as the SOHO location. My favorite are always the razor clams and the chicken wings. The wings are baked at high temps so that there is little fat left in the crispy skin. It is served with a bed of tomato based sauce. The Chicharrón is not pork rinds instead it is a dish of super tender pork belly slices. The pork literally disintegrated in my mouth. The ox tongue is fanatically tender and the potatoes are pan fried with some Dijon mustard that gave it a little extra flavor.  The quail is grilled to perfection and accompanied by pickled vegetables. I think there isn't a bad choice on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "uhauZJJ1WSuMkG0ag24kxQ",
        "caption": "Photo of Barrafina - London, United Kingdom. Tortilla (potato cake) mushroom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uhauZJJ1WSuMkG0ag24kxQ/o.jpg"
      },
      {
        "img_id": "2YKUtUaBRUFYvwLGT6X2Nw",
        "caption": "Photo of Barrafina - London, United Kingdom. Flan",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2YKUtUaBRUFYvwLGT6X2Nw/o.jpg"
      },
      {
        "img_id": "y9jT7hAI3pWQMZd-oN8Qcg",
        "caption": "Photo of Barrafina - London, United Kingdom. Skate wing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y9jT7hAI3pWQMZd-oN8Qcg/o.jpg"
      }
    ],
    "user_id": "7iVssN7pU_mptEGnPabrJQ"
  },
  "gWrZSDZFZBTGBoagJ1e3yA": {
    "date": "5/21/2017",
    "text": "We came in just for a small snack. The crab croquettes were small but very good.I had a tortilla based on an article recommendation. It was my first Spanish tortilla and was pretty good! I have never had one before so it's hard to compare with others. The water was free and service was friendly!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fX-rT19sMhYO7LVidRv3MQ",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fX-rT19sMhYO7LVidRv3MQ/o.jpg"
      },
      {
        "img_id": "D0kwMgbChVZHhTCGjQOQ7Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Classic tortilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D0kwMgbChVZHhTCGjQOQ7Q/o.jpg"
      },
      {
        "img_id": "j2ggdu2c7Q2xjn-njSRE7Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Classic tortilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j2ggdu2c7Q2xjn-njSRE7Q/o.jpg"
      }
    ],
    "user_id": "k97c4eriYUeMG_cGw8rYLQ"
  },
  "WKpViC7J7Qdqb1SVcCbM2Q": {
    "date": "1/25/2017",
    "text": "I have been to many of the top restaurants in London and if I had to choose one for exquisite food and great, friendly service, Barrafina would get my vote every time.  This is a simple but exciting dining experience for everyone.  It offers small plate dining in the best Tapas tradition.  They also have a solid wine and beer menu.This is a small chain in London but it is quite refined.  The staff works in perfect synchronization and with enthusiasm.  The dishes we had were delicious and perfectly prepared.  We started with the crab croquettes, bon bon date with pancetta, Iberian ribs and then the doughnuts with chocolate sauce.  We added some vegetable dishes along with a nice carafe of Spanish Albareno and the meal was heavenly!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bIvmjSThoOOB4AD3qvtLbA",
        "caption": "Photo of Barrafina - London, United Kingdom. Careful preparation",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bIvmjSThoOOB4AD3qvtLbA/o.jpg"
      },
      {
        "img_id": "nqlSdYptLTmQmui4bNR9Qg",
        "caption": "Photo of Barrafina - London, United Kingdom. Exterior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nqlSdYptLTmQmui4bNR9Qg/o.jpg"
      },
      {
        "img_id": "bXIkmJYzDKW1Ow7jH9iw_Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Interior",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bXIkmJYzDKW1Ow7jH9iw_Q/o.jpg"
      }
    ],
    "user_id": "Qy4qBiz_ZjNaEl8-uNmhwQ"
  },
  "iidfzxqxJRFeVRT_-sS3Wg": {
    "date": "10/22/2017",
    "text": "If you want to beat the queues, this is a great branch of Barrafina to come to. We arrived on Saturday at 11:55 AM and we were the third table to be seated. They very kindly placed us in a corner table so that our two-year-old could run around when she was done eating without escaping the restaurant, leaving my husband and I to enjoy the dishes in peace.  The menu is different to the other branches.  Yesterday we had the pork ribs that the server had recommended it was smoky and full of flavour. Crab croquetas were full of crab and creamy goodness, and the seafood rice infused with so much rich seafood flavour.  Very friendly staff and great service!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JjYd36lOBG-HyscQkvI7cQ",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JjYd36lOBG-HyscQkvI7cQ/o.jpg"
      },
      {
        "img_id": "HplQzy1vFSfXkqV7SKn9Vw",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HplQzy1vFSfXkqV7SKn9Vw/o.jpg"
      }
    ],
    "user_id": "3OBQXcE6lwfKNk9Sg9b8RA"
  },
  "5tb1FvFQzWbjHPC8I906YQ": {
    "date": "4/17/2017",
    "text": "Hands down the best Spanish food I've had out of Spain.In the case of some dishes it's even better than some I've had in Spain.Especially enjoyed the seafood rice (this is not a paella!!) and the tomato salad on specials. I am a sucker for croquetas and these are excellent.Also enjoyed a glass of cava which was not overpriced! Most everyone cooking/serving is Spanish except for a couple of Italians. If you want real Spanish, look no further.Also, unless you have a pea-sized stomach you won't leave here for less than 40 per head.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "R66Qa-iXumkzBkjkA-rgaA",
        "caption": "Photo of Barrafina - London, United Kingdom. The menu. Pig ears were sold out :(",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R66Qa-iXumkzBkjkA-rgaA/o.jpg"
      },
      {
        "img_id": "1s_4e3tri5P7hjzl-MbhgA",
        "caption": "Photo of Barrafina - London, United Kingdom. Stuffed courgette flower - excellent. Pimientos del padron deliciously oily/salty but somehow still light?",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1s_4e3tri5P7hjzl-MbhgA/o.jpg"
      },
      {
        "img_id": "FZitzQWQUXhTYfEEtqwdCw",
        "caption": "Photo of Barrafina - London, United Kingdom. Divine special croqueta - menorcan smoke cheese - forgot the name",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FZitzQWQUXhTYfEEtqwdCw/o.jpg"
      }
    ],
    "user_id": "vN740jaTqpOOZd47PqkkSA"
  },
  "MRnq1FZZwvJAAOFmBB4H1A": {
    "date": "12/27/2017",
    "text": "This was excellent!!! Besides the waiting for a table, the food and wine we ordered was amazing. We had the charcuterie ham, was the best ham ever had it literally melts in your mouth. The quail eschebeche was a very interesting combination. Even the olives were delicious.The Meal was a 10/10",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j33Vx1wLAdNzlN1VGrC8-w"
  },
  "2cnvvm8i5LUk0MbVtth4SQ": {
    "date": "6/10/2016",
    "text": "What I love about Barrafina is that the tapas menu is really different from most of the tapas restaurant in London!The food is great and the vibe from the open kitchen is so cool!My fave dishes were the seafood ones we had: grilled razor clams and arroz de marisco.We also tried as starters the crab balls (very good, you can really taste the crab) the fuet platter was good but nothing special but the Iberco jamon was really good according to my friends (Im usually not a fan of Iberico ham so Im not a good judge on that)Other dishes were: some pork stew with peas and ham! bicadillo de calamar which I really digged. Fried chipirones (a classic, good but nothing special) and the tortilla with morcilla and piquino peppers.Overall all dishes were solid so you can easily order anything and be happy.Wine selection is also not your classic wines which is good if you re into trying out new things. We had the red wine called El Mago and it was superb went really well with all the tapas even the seafood onesThey have a specials board too!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F3vMaix959aNQ24-VX_D1g",
        "caption": "Photo of Barrafina - London, United Kingdom. Pork with peas and ham.  The crackling was superb!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F3vMaix959aNQ24-VX_D1g/o.jpg"
      },
      {
        "img_id": "KsGEDEcJZfYp8jAade645Q",
        "caption": "Photo of Barrafina - London, United Kingdom. Tortilla with Morcilla and piquino peppers. Tasty",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KsGEDEcJZfYp8jAade645Q/o.jpg"
      },
      {
        "img_id": "K-7a2Xt94J1Ea_jg07hhLA",
        "caption": "Photo of Barrafina - London, United Kingdom. Arroz de Marisco: delicious! The calamar was a bit salty but not unusual for Spanish food.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K-7a2Xt94J1Ea_jg07hhLA/o.jpg"
      }
    ],
    "user_id": "zIwNjkIgOcJgPxFC1Is0Zg"
  },
  "8CwnYq78bXU0bzXmoHe8xw": {
    "date": "7/23/2017",
    "text": "Light lunch: 3.75/5Friendly service, good food and nice ambience.Repeat: if in the area and have no other plans, perhaps.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0uNxhZAFbkalQImzJ6UDUA"
  },
  "JXb2fVD7YrRwb8PhtR_C5g": {
    "date": "9/18/2017",
    "text": "One of my favourite restaurants anywhere! Excellent food, amazing service and very lively and entertaining atmosphere! If you have to wait a bit for a seat, there's a reason - everything is so good and freshly prepared, the wine and drinks are great, and the chefs and other staff make you feel special and at home at the same time! There are thousands of restaurants in London and I have been here many times, and this is one of the few that I make a point to dine at (maybe more than once per trip). Love it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dE_EM7VHBN7wk8kR-6K33w",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dE_EM7VHBN7wk8kR-6K33w/o.jpg"
      }
    ],
    "user_id": "mlrMUJ6JLfA6u9JmHIx78Q"
  },
  "mNQTbTfVa0yh_p9KhzM0ew": {
    "date": "11/18/2016",
    "text": "Authentic Spanish, and delicious food, with some extra fusion dishes that you wouldn't traditionally find in Spain (like donuts and crab croquettes). This is not a cheap meal, and will probably run you about £45-50 per person, but you'll get a good variety of food. The layout of this place is not conducive to large groups, so don't come here with more than 3 people. 2 is ideal, and you can do 3, but the seating is all along a long bar, so it's difficult to talk to a larger group (and even more difficult to get a seat to accommodate everyone).GET THESE (I listed them from my favorite to least favorite)Crab Croquettes (2 for £6.50) - They will increase your order to 3 and price it accordingly if you need more per order, because sharing 2 croquettes amongst more than 2 people may be challenging. And these are delicious enough that you won't want to share one. It's cheesy, creamy and has crab inside and then deep-fried. I loved these and would recommend it.Iberian Pork Ribs (£13) - This was the best dish of everything we ordered, and my other 2 dining companions agreed. I was skeptical before we ordered, but the meat was flavorful, tender, and just fell off the bone. I'd highly recommend this dish.Tortilla Classica (£7) - Pretty standard tortilla espanola, but served fresh which I always like vs. the cold tortilla. It was really good and worth an order.Artichokes & Aioli (£7.80) - These were deep fried artichoke hearts with an aioli sauce. They were delicious.Arroz de Mariscos (£14.50) - Paella with seafood done right - tasty, not salty, and the rice was not over-cooked or mushy. I'd recommend; the portion size will feed 2-3 people.Jamon Iberico (£15.80) - This was a last minute addition and it was delicious, and some of the best jamon iberico I've had. A bit on the pricey side, but there's a generous amount of meat.SKIP:Crab on Toast (£8) - I found this to be a little weird and mushy in texture. It was crab mixed with tomato on toast -- I'd personally skip this, it's also hard to share.Donuts & Chocolate Sauce (£7) - I typically love all desserts and I love anything with chocolate but this fell short for me. The donuts were dry and they were soft and fluffy. It was almost too dough-like, and the chocolate sauce on it didn't help the dryness. I'd pass and go find dessert elsewhere4.5 stars for this place - it's authentic Spanish tapas, but be prepared for a wait. It's not inexpensive, but for the quality of the food and for the variety that you'll eat, I say it's worth it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K-7kWgZvvqdFHMWsADlO_A",
        "caption": "Photo of Barrafina - London, United Kingdom. Donuts and Chocolate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K-7kWgZvvqdFHMWsADlO_A/o.jpg"
      },
      {
        "img_id": "-Hrs3VHhq7TqDT_j3o507g",
        "caption": "Photo of Barrafina - London, United Kingdom. Iberian Jamon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-Hrs3VHhq7TqDT_j3o507g/o.jpg"
      },
      {
        "img_id": "JWvV72m4bIHpV53zaChb3A",
        "caption": "Photo of Barrafina - London, United Kingdom. Iberian Pork Ribs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JWvV72m4bIHpV53zaChb3A/o.jpg"
      }
    ],
    "user_id": "cSNER_qF_bb1t7kN0kZ44Q"
  },
  "sNk2OjfDZi_XvyHNgyyylw": {
    "date": "1/29/2018",
    "text": "This is one of my favorite places in London, either going by myself on business travel or with a friend. Easiest to find a spot when you're just one or two. Even as a single diner you're made to feel welcome and catered to. The food is delicious and the small plate format is great for tasting several items and for sharing. The wine list is varied and reasonably priced and the waiters are open with advice and providing a taste before you make up your mind. Friendly, service oriented staff makes sure you are satisfied with everything you order. This is a fun place to try items you might never have tasted before because everything is fresh and well prepared. My favorites, after starting with a cava and marcona almonds and olives, include oxtail over whipped potatoes, a roasted Jerusalem artichoke special, fried baby artichokes, mussels, sweetbreads and rabbit. Only seating is an the counter with an open kitchen. So maybe not the best for a large group. I've been to the Barrafina at Drurie Lane and another near Charing Cross Station. The menus were slightly different but both were excellent and you can't go wrong.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUDQCBMsNc8_tMXxMXOSnQ"
  },
  "IV9qYTqXoxuZKc8I0HLOmQ": {
    "date": "6/10/2017",
    "text": "Oh my godness, this place is a must do in London. Each item we had was amazing:Started with croquetas, stuffed courgette flower, arroz dr mariscos, tortilla de morcilla, and much much more. Everything was delish. The servers/chefs are incredibly friendly and great at recommending!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0njU8w_0YGTTts_bH54mDQ",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0njU8w_0YGTTts_bH54mDQ/o.jpg"
      }
    ],
    "user_id": "ZculhLDJob2UQT_ydGjznw"
  },
  "nn8CKggGqnhY2J_N-d-Zfg": {
    "date": "6/24/2017",
    "text": "Although the wait can be long, it's absolutely worth it as this is probably the best tapas bar in London - as good as the better ones in Barcelona or Mádrid. Super helpful and friendly staff.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WX4pgWc3KPGCI2NrdbtGMw",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WX4pgWc3KPGCI2NrdbtGMw/o.jpg"
      },
      {
        "img_id": "me-G4ms75yJVIhNZ3Zo-TQ",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/me-G4ms75yJVIhNZ3Zo-TQ/o.jpg"
      },
      {
        "img_id": "GWWtkX4np-hkCuZ3R3KHMA",
        "caption": "Photo of Barrafina - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GWWtkX4np-hkCuZ3R3KHMA/o.jpg"
      }
    ],
    "user_id": "Y4pO9yZociD96rtJ5vRyDw"
  }
}