{
  "d9_rQLMs0japgoKbacrWQg": {
    "date": "12/19/2010",
    "text": "Really good selection of 'natural' wines and friendly helpful staff. Food is good though not particularly gastronomic. We like to go for the wine & cheese.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "yRH7oiZh0HbYqUVYJko9mg": {
    "date": "2/12/2010",
    "text": "Simply perfect. I was hesitant to write this review and keep the place for myself. Amazing service, great selection of wines.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "PqIJACMHGcccrqXffKbXrA": {
    "date": "8/30/2009",
    "text": "I've been to Terroirs over half a dozen times and I can't find anything to fault. The food is wholesome and earthy: the smoked eel, the garlicky snails with bacon and superb rillettes are a must, but everything is worthy of consideration. The wine list is brilliant, sympathetic mark-ups, unusual but quite delicious natural wines many made with very low sulphur dioxide. This wine bar/restaurant is buzzing; the sight (and sound) of happy diners is proof of its success.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Y29pNtgfuWG62iGlXRSR4g": {
    "date": "4/29/2009",
    "text": "I don't normally associate great food with winebars but this place does stunning classics! Everything I tried on my visit was top notch and the bone marrow with truffle and mushrooms on toast was among some of the best stuff Ive had in the city. Also ordered a 'slightly sparkling' Italian white which had a distinctly off-pink hue - really lovely stuff and they do them in 500ml bottles too, so you can go ahead and try all kinds of different things in one go - awesome. Some people do complain about the rude service ( they are abit snotty to be honest) and the slow food (yeah it became noticable after it took the waitress 15 min to take our order and the wine only came when the rest of the food arrived) but on the whole, it's still a pretty amazing wine bar, well worth a visit for food and for wine. Price wise is so-so, the small dishes are not cheap (£7 to £9) and their dujours hover the £13 mark. There is an option for a £10 lunch plus a glass of wine, but aside from that - Terroirs is a real gem.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Yq9HWaAKv-BCUbfhcV6iBA": {
    "date": "6/1/2010",
    "text": "OK, now this is a strange review. I actually want to give this place five stars. Even though I didn't eat anything and I only had water. For fairly dull reasons, I'm off the booze at the moment (those of you who regularly read my reviews will be shocked by this). But, after coming out of the theatre last week and feeling like chatting about the fabulous show I'd just seen, I jumped at the opportunity to find out what all the fuss was about. All the fuss about this place is deserved. We perched at the bar, and felt instantly at home. I wished we'd got there earlier and had time to stay. Even at the bar it's the kind of place you could spend all night (although some bag hooks wouldn't go amiss). I did have a sip of my friend's Cote du Rhone and it was fabulous (organic too - their menu has little cows by the happy wines). Was mad at not being able to drink. The food smelled amazing, the bar staff we very handsome (especially the man with the curly hair) and they didn't bat an eyelid when I was drinking nothing but tap water. Dead sexy wine glasses too. I want to come back here and try everything. The bar snacks looked good value, the wine isn't that pricey. I'm smitten, and the only thing they've given me is a smile and a glass of water. Well done Terroirs, well done.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ZlSDYk58SJx80CRhewD-sw": {
    "date": "12/3/2009",
    "text": "Terroirs is a sophisticated little wine bar, situated in what can be a somewhat touristy area of London (near Trafalgar Square, by the Charing Cross Station). The space is small, and the rustic wooden tables are very close together (it's quite easy to eavesdrop). The wine list is outstanding, and not only includes regular wines, but white and red \"wines of the moment.\" There are also small plates and pairings to go with the wine if you choose. We ordered a 750mL of Teroldego Rotaliano, which is an Italian wine from the Trentino region. After we let it breathe for a few minutes, it was absolutely divine. We also paired the wine with a few cheeses. Anyone who knows me should know that wine and cheese are the way to my heart. I could not have been more ecstatic. What I did not like (and have deducted a star as a result) was the stuck-up waitress. Not only was she condescending about the wine we selected, but she was also trying to one-up us on which cheeses to pair with the wine. Sorry, that doesn't fly with me!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmFA9cOEjURO3rnseA7W9Q"
  },
  "ca_HQozXBviZfKexdVieFg": {
    "date": "6/12/2010",
    "text": "As a veggie (flexi veggie), I was a bit worried about going to a French restaurant but being as it was my carnivorous boyfriend's birthday and as I'd heard nothing but good things about it, we gave it a go, and I can't recommend it highly enough. We booked ahead, which was just as well as the place was rammed, but even so, our waitress was really attentive and we didn't have to wait long for anything we ordered. The food was simple but delicious and the wine list, a little overwhelming but with a good selection of reasonably priced bottles. We finished off the evening with some of the best cheese I've ever had and I'm already looking for another excuse to come back.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KDFip_zuTZ-D62kz6jwjgg": {
    "date": "3/19/2010",
    "text": "Full review at thehappinessprojectlondo…  This is up there with my favourite places for after-work dinner that isn't expensive, serves amazing food and lovely wine, and will let us chat and mange to our heart's content. I loved the rustic, arty, chilled French atmosphere  with people eating at the bar and the cute table settings. It felt friendly, cosy and relaxed  perfect. The menu is French tapas-style which I'm a huge fan of  there's nothing better than sharing food with friends and chatting about how it tastes, a real bonding experience. We ordered 4 cold/warm tapas and 1 larger hot plate between 3. We started with the duck rillettes; endive, gorgonzola & spiced walnut salad; snails, bacon garlic & parsley and king prawns a la plancha. Duck rillettes were gamey and fatty, delicious. Snails were salty, garlicky, earthy, and the endive, walnut and gorgonzola salad  a classic that I always love, but this was especially good due to the strong runny cheese and herby salad dressing.King prawns a la plancha was meaty, melt in mouthy, sweet and lovely sauce. For apres, we really stuck to our diet plans and ordered the bavette steak. It was really lovely  pink, tender beef and juicy roast potatoes on a bed of shallots. My only complaint was that I could have eaten more of it, and not sure about the crouton thingies that came with it. As expected in a French place, the wine list is great. I liked how you could order a 500cl bottle (pretty much half a bottle really and totally acceptable for a detox school night)  we tried the Jurancon which was really nice, but next time I'd like to ask their recommendations for what wine to try with the food. Oh yeah and then we had a bitter chocolate pot for pud. It was yummy  sticky, soft and rich. Then the bill came and all this lovely wine and food came to £72 including service or £24 each. It was at this moment that I decided to come back here every week and eat my way through the wine list and menu until the buttons pop off my jeans. We're definitely going back on a Friday for a wine and cheese fest for a start. I've eaten some pretty terrible meals round the corner for far more, so we really couldn't believe what great value this place was. Only downsides? Not sure veggies would find enough food on the menu  but this is pretty typical of French places, oh and you might have to book a table in advance for peak times, but what do you expect for this sort of value. I'd also probably order one more tapas plate to fill me up.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "FzK5cZomi36rSY-mr1jNHQ": {
    "date": "5/15/2014",
    "text": "Excellent food.  Engaging wait staff.  Recommended wines matched well with the food.   Good value for the moderate price.  A little noisy, but that was because the house was full and all seemed to be enjoying their experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTfdSBZXeQ9qKfJXtSzFGg"
  },
  "NxQMUFu7uMD7Mz9r3a_KCw": {
    "date": "10/19/2009",
    "text": "Terroirs - Pics at The London Foodie(thelondonfoodie.co.uk ) A recent visit to Le Manoir de Raynaudes, in the South West of France, has re-ignited my love for French cuisine and all things French. I have since then signed up to French language classes and am devouring Julia Child's memoirs My Life in France. The best part of this francophonisation process was finding Terroirs, a French bar and restaurant opened in Central London about a year ago. Having been to Terroirs before, I normally try and sit at their zinc bar to watch the chefs at action and for a more relaxed dinner. The menu is short but offers an excellent spread of fish, shellfish, duck, cheese and charcuterie. This is a place to come with friends and share various dishes over a few bottles of excellent French wine. In my last visit, I ordered a small selection of dishes together with one of my favourite bottles of wine, a 2007 bottle of Marcillac @ £18.85 (Dne du Cros, Philippe Teulier, Marcillac). Terroirs' wine list is most impressive - it contains about 200 wines of which 20 wines can also be served by the glass. You will be assured to find a bottle to suit every budget and taste. The menu is divided into 5 categories  Bar Snacks (Duck Scratchings £2.50 are fatty but very moreish, Bread & Butter £1.50, a must), Small Plates (for sharing like Steak Tartare £7 or a Whole Dorset Crab and Mayo £12), Cheese (Rocamadour £3.50 is divine), Charcuterie (Duck Rillettes £6 is one of my favourites), Plats du Jour (more substantial dishes like Brandade de Morue £12 or Slow Roasted Belly of Pork £13) and Desserts @ £5. My suggestion would be to order bread and butter, which are heavy and chewy, accompanied by a selection from any of these categories. One of the dishes I order at every visit, is the Snail, Bacon, Garlic and Parsley @ £7. This is served on a slice of toasted bread with a delicious Pistou dressing (just like Pesto but without pine nuts or cheese but more garlicky). The combination of flavours is sensational, I just wished there was more on my plate! Another favourite, Duck Rillettes @ £6, is rustic French cuisine at its best, and better avoided when on any diet. Originally made with pork, the meat is cubed or chopped, salted heavily and cooked slowly in fat until it is tender enough to be easily shredded. It is then cooled with enough of the fat to form a paste. They are normally used as spread on bread or toast and served at room temperature. Potted Brown Shrimps @ £7, also served on toasted bread, was very good. Seasoned heavily with nutmeg and paprika as potted shellfish should be, the flavours partnered well with the Morecambe Bay shrimps. The Pan Fried Girolles Mushrooms with a Duck Egg at £7 was also delicious. The mushrooms were meaty and full of flavour, and the runny duck egg was an interesting addition. Other dishes that I had tried in previous visits and that I would also recommend are the Steak Tartare £7 (well seasoned and fresh), Pork and Pistachio Terrine £6 (quite rustic and a substantial portion), Selection of Charcuterie £10 (nice cuts but not good value), any of the cheeses £3.50 (they are all superb), and Duck Scratchings @ £2.50 (fatty but very good). I have been impressed by Terroirs in all my visits. At £53.27 for two including an excellent bottle of wine, this is one of my favourite restaurants in London at the moment, and I simply cannot recommend it enough. Verdict  Rustic, hearty and delicious French cuisine to share, and coupled with the best wine list in town. Great Service and reasonable prices make Terroirs one of the hottest tables in the Capital.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Wfvo99af2sDkzB4PqdAHpg": {
    "date": "2/16/2012",
    "text": "Terroirs is poised perfectly in covent garden for a cosy dinner and a big glass of vino with a mate or lover. This is the perfect French wine bar with rustic dishes like hearty rabbit stew on wooden tables. Bustling and vibrant, you will not want to leave especially on wintery nights. (Monikasays.com)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "zostZIz7u0Z0txWFkpDCNA": {
    "date": "7/5/2011",
    "text": "Great food, wine and service in handy central location. You will pay for the quality. Better for couples or smaller groups.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VKkMrnf64pHRf-zUAwy4kA"
  },
  "HHiJlVVMRQMftBrg1B3b6w": {
    "date": "1/2/2011",
    "text": "Scrumptious, wholesome, uncommon drink and eats to be had here. One could take hours reading the wine bible and coming to a selection. I love wine but am by no means an expert, and was intimidated at first with all the Frenchery about the place. However, both times we visited Terroirs- once at the bar, and secondly with friends at the upper floor, I found the wait staff to be very pleasant, patient, and their good-natured advice made the wines and foods even more accessible. To top it off, we had a famous actor sighting (he was ushered through quite quietly to the back). Highly recommend Terroirs.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0d1Qa6dckkZ9UTK_1_eNTw"
  },
  "CzTSLLV71E1oM7OqaoFRkg": {
    "date": "5/8/2010",
    "text": "Very nice place just off the busy Strand and Trafalgar square. Good French food which is not too pricey (£6 starter and £14 main). Service in this instant was fine despite previous complaints. Only reason for deducting a star was that the meat was not good enough quality to be cooked as medium rare (only way they offered to prepare this particular dish).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttrfh9Yznq87BjTmcoYqbg"
  },
  "Nw30gqNsH85uoO4g4hfPfg": {
    "date": "2/17/2011",
    "text": "A great example of getting the little things right: attentive, cheerful staff, interesting well sourced wines, many served by the glass or carafe and superb, well executed, unpretentious, tasty food. Most people come here for the wines but for me the food is the real draw. If I were to have 1 niggle (and it is the only one) it would be that £14 is a bit steep for some black pudding, mash, egg and mushrooms, however it was one of the best boudin noir,smooth, creamy mash, duck egg and wild mushrooms that I've had, so retract that last bit!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "UN5s5OerE48FBsxaajkCrg": {
    "date": "7/6/2010",
    "text": "Had dinner here before heading to the theater (We were seeing Red at the Donmar Warehouse so this review is several months old). My wife and I loved the place from the moment we entered. We had a friendly Italian waiter who took great care of us. I ordered the butternut squash soup, the bread and butter, the boudin noir and the bitter chocolate pot for dessert. Each course was prepared well and the boudin noir was especially useful in treating the hangover I was fighting from the previous night's festivities. Obviously wine is the focus here and we enjoyed reading through the lengthy list and had two bottles of Italian wine that we enjoyed.Overall, I loved this place and would definitely recommend for a casual, wine focused meal.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQcQkCtCfGh4W3xYTuB90Q"
  },
  "ZKkQoZn-LOX5le8MgmREZA": {
    "date": "10/14/2012",
    "text": "Solid approaching interesting French bistro cooking. Great flavours. Wine list is superb and well priced.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ueRJqh2wGdUf9LY9IzzDMg": {
    "date": "6/20/2010",
    "text": "Great place. A really good wine list, full of interesting and reasonably priced alternatives, exclusively (IIRC) from France and Italy. The food also is great - not sure about the main courses as I've always gone at lunch or pre-theatre, but the sharing starters are great if you do three (four if you are hungry) between two. Really imaginative and exciting. On my last visit I nearly had a disaster as I was told I would be in the basement - I hate basements. Happily, this one was done really well and was cool (on a hot day) and atmospheric, as opposed to cool and damp - Terroirs' done it again!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "cueXoZjClot3bbx5WLgvJw": {
    "date": "8/7/2011",
    "text": "I don't drink but my companion enjoyed the house white.  The food is very good, rather pricey, and the portions are strangely sized (a huge plate of rillettes - of which one doesn't necessarily want to eat huge amounts- compared to a sardine dish with only two sardines when one could happily have had four).  Nice place, good atmosphere, friendly service.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgEJ0a6fxqUiFuXC9fMf9A"
  },
  "uI_mlunSe67vvvo1GenZig": {
    "date": "5/29/2011",
    "text": "Undoubtedly the best part of this restaurant was delicious food and wine; however, the atmosphere and service were excellent too. Love the decor in both floors. Strongly recommend the natural wines and the duck confit. Love Brawn, its sister restaurant in Shoreditch, too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T5UtaHeH7TSR_a5zOY-0UA"
  },
  "Pkeea5qevOYwXlbGJTJoJQ": {
    "date": "10/21/2009",
    "text": "My husband and I had a lovely dinner here last weekend. When I called to make a reservation, I was told they were fully booked -- but had space at the new \"restaurant\" downstairs. I'd never eaten upstairs, so I didn't have a preference, and I can happily report that we were treated to a wonderful meal downstairs! We ordered two small plates for starters and had a main each. Everything was delicious and really reasonably priced. The squid in particular was fabulous. We also ordered the tarte tatin \"for two\" -- scrumptious, but large enough for six, I'd say! The staff were extremely friendly, though, and wrapped up what we couldn't eat so that we could take it home with us. All in all, a wonderful experience!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "80nW5nyRrsPu0xgHt0RYNA": {
    "date": "2/27/2009",
    "text": "Terroirs has a lot going for it - more pluses than minuses, thankfully. It's so easy to get ripped off or be disappointed in London, so it's great to have a place that lives up - and down - to its reputation. So far the critics are divided, and I can see why. Good things first: super atmosphere, utterly delicious, gorgeous food, huge wine list with very attractively priced wines. It's decidedly French, but some dishes nod towards Spain. The food is its number one saving grace. The small dishes to share are intelligently priced, generous rather than picky, and frankly inspired. For example, the Basque piperade with chorizo was really rich and creamy, and the smoked eel intensely juicy and complex. Other slightly less accomplished dishes include the tartine of snails which was perhaps too garlicky but in general every dish we tried was harmonious and amusing and very easy to share between three people. Things to complain about: the service is erratic. Not so much the individual attitude, which is not exactly graceful, but its organisation (lack thereof). The place was packed, and it feels understaffed. Poor service is fairly consistentl across the UK - there just isn't a service culture here (as opposed to the USA, Spain, France or Australia, all with distinctive and laudable approaches to service) and sadly Terroirs is no exception, even if they are all French. Perhaps that is the reason, I don't know. The other reservation I have about Terroirs, paradoxically, is the wine list. The wines themselves are of a very high quality - the two we chose were near sensational - but the concept is devilishly difficult to absorb. The so-called natural wines idea - i.e. organic and/or biodynamic - is pretty problematic to start with (this is not the place to discuss it), but having to wade through a huge list that is organised in a way that is conflict with convention is totally tiresome. It took me 20 minutes to intepret and begin to see what sort of wines might be suitable for us. I had to read endless paragraphs in miniscule font size and flip from one page to another to grasp the context in order to find the marks of identity we all look for in wines to make an informed choice. Grape variety (practically unmentioned) and exact DOC would be a good start. Instead they appear to be reinventing French wine geography and group the wines according their idea of the natural wine landscape. This is really taxing on the person trying to make a choice. They should bear in mind that the New World has been very influential in making grape variety central to wine choosing, and it wouldn't hurt to list the varieties and their percentages next to each bottle. Asking for help, I just kept being told how good each wine I pointed at was, or they just repeated the name of the wine with better pronunciation. Hopeless. That said, the wines we did have were delicious. Recommended? In spite of these gripes, most certainly, yes. Great place.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "9f1E8EtMDGz24vt5-Pl99Q": {
    "date": "6/9/2009",
    "text": "Great French food at reasonable prices,definitively value for money. Very good wine selection and friendly atmosphere.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "eYMDstjhxGpYM_5zE3zXjQ": {
    "date": "11/17/2008",
    "text": "This has to be the best wine bar in London (apart from Vinoteca in farringdon - but it's definitely on a level par). The food is excellent and the wine list (all natural wines) means you dont get hungover, however much you drink. Im really impressed with the range of the menu given the size of the kitchen. I had the foie gras mi cuit and it was one the best things I've ever eatern in my life. I shall definitely be coming back here again. Especially to try more of the deserts - the crepes with salted caramel were perhaps the most delicious things i've had since i went to El Celler de Can Roca in Girona, Northern Spain",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "JsDaZjJO00rPppCwcW-0Ww": {
    "date": "6/3/2012",
    "text": "I thoroughly enjoyed my visit to Terriors.  I sat at the wine bar where I was overwhelmed by the knowledge and generosity of the bar tenders.  My friend and I were given 3-5 tastes of various wines along with great suggestions and explanations to help navigate our decisions.  It was almost like a wine tasting session!  For food, we had the pea and sorrel soup, which was perfectly seasoned (not to salty), and had a nice smooth consistency without being to thin.  For dessert, we were recommended to try the panna cotta with raspberries.  This was not extravagant, but simple, well done and delicious.  The raspberries were undressed, which was a nice tart counter to the sweeter and perfectly vanilla-y panna cotta.Great atmosphere, service, and eating and drinking experience and at a fair price!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8pO7fbeFK-gUzn2eXrB2Q"
  },
  "qLnSefIy7F6eyvAkYqxHog": {
    "date": "8/2/2011",
    "text": "Divine! I had been aching to come here the moment my plane touched down in Heathrow, but I had to go to Berlin, and my aunt's in Surrey first. In fact, I was so desperate to make a stop at this fantastic little place that I split up from my sister, and without a cell phone, ran my butt over to Charing Cross.First thing I loved about this place was, finding it right next to the exit I had taken out of Charing Cross tube. Nothing like finding your personal holy grail by seeing it right next to you when you're ready for a map reading quest. Be sure to ask for the William IV St exit, which looks unused/inaccessible but it will save you a lot of trouble!Gorgeous decor, dimly lit without detracting from the food.I came here for wine. I came away with two bottles - red and white - of organic wine. I also had a wonderful conversation with a server from Spain, who spoke French very well as did the rest of the staff. I loved hearing the servers and hosts make quick exchanges in French as they attended to guests.Organic wine is not to be confused with biodynamic. Biodynamic wine is the product of vineyards that simply allow nature to tend to the grapes without any form of intervention - even irrigation is out of the question - so that the final yield is likely to be a lot smaller, and therefore you pay a pretty penny.Absolutely enjoyed poring over the wine menu. I was given gallant service, in the form of pleasant conversation and useful tips over selecting a wine. I sampled 2 to 3 wines for free before making my choices. Already opened the white over dinner with family celebrating my sister's graduation from law school. It was pure. Just liquid gold, smooth and excellent with a sweet finish. The beauty of this white is that it was bottled at least ten years ago, without the preservatives that have been argued as essential to keeping the wine.I am still waiting to open the red, a vino di anna 2007. It says on the bottle that it does contain sulfites, which I should  have checked earlier. I wonder if sulfites are additives or natural to wine as it ages? I had tried it at the bar though, and it 'smelled of the farm', just as my server had said. Loved it, can't wait to go back on my next visit.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g8Rq8G4FMZEYvE5wnJFcaQ"
  },
  "g1d-yD28MtrLXHf_nBKZJw": {
    "date": "10/19/2013",
    "text": "Wonderful and surprising experience at Terroirs.  Came in for a glass of wine and sat through a full meal of small plates, each amazingly good. Due to not booking ahead, we found two seats at the end of the bar and found the entire team in the kitchen to be friendly and informative, even while slammed. The same goes for the bar and wait staff.  The quality of food and service was worth a repeat visit on our final night in London and again did not disappoint. Definitely worth a special trip.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-mTCK7bKK4q8xxr1a_Xxvg"
  },
  "ujtfrgh_3JIbYW4A5pNaEQ": {
    "date": "11/9/2013",
    "text": "Wine is good ... as for food dishes if u dont like salt and a lot of salt make sure you tell them in advance. Soups salty: bean soup salty,  rabbit soup salty. Fish dish salty. Grern salid fresh just order dressing in side...But wait....Pork chop nice...  oysters solid.. cheese tasty. .. and wine is as good as u order. Things without salt overdose 95% other stuff was like a salt lick... :( nicr place good date place just know what u order. ..",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5XPUIKzeg_ueYBbDsn8ktA"
  },
  "joiFpv1QpwxUpMuiD4wyYg": {
    "date": "2/23/2011",
    "text": "It was 11:00 PM, we had just come from a concert at Cadogan Hall, and were absolutely starving. Two lost (and hungry) souls wandering the area around Embankment, looking for some good eats. After a few potential options, Terroirs appeared. The windows were steamy, the restaurant full, and the menu incredibly inviting.Even though it was late at night, we still had a 15 minute wait, which seemed to indicate the popularity of the place. Not only was the food well worth the wait, but we were able to order some top notch champagne to keep us busy while we salivated over all the food being served around us. Finally, we were seated, the real fun began.The beauty of Terroirs is that, while there are entrees to choose from, the menu is largely comprised of small plates. We ordered the pork & pistachio terrine, fresh bread and butter, the steak tartare, clams with garlic, the smoked duck with beetroot and hazelnuts, and a Floating Island to finish. Everything was absolutely amazing. The only reason why I docked a star is because we definitely saw a mouse run across the floor at one point. Weirdly enough, this didn't distract me from how good the food was -- I just convinced myself that we were sitting in a real life version of Disney's Ratatouille. Fooling myself? Probably. Still delicious despite this hiccup? Absolutely.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "b5ukXoLyfPmKJ4x_LhapWg"
  },
  "5kqEWEGeiqCq-PRUFvCtCQ": {
    "date": "2/18/2011",
    "text": "I went here for lunch in January and had a blast. With the sun shining, we sat in the window of the upstairs restaurant and pawed the menu with glee.My perfect way to eat, just order a selection of dishes and share away.We started with the duck rilletes (a coarse pate) and pork & pistachio terrine with bread. Both were absolutely divine, just the right side of salty, heavy on the meat and with little fat. The bread was crispy and fresh, with lashings of butter and a decent red to match.We also ordered a selection of cheese (both soft and hard), plus some mixed charcuterie. The quality of both was extremely high, and I probably could have sat there all afternoon tucking in. Sanity got the better of me though and I left feeling full, satisfying and happy to pay the bill.The waiter/waitresses were also very attentive, and weren't too upset when we realised we'd over-ordered and had to cancel a few dishes. That says a lot.I'll be back in a heartbeat!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P27bQcSOCsiRsv5wKwO3uw"
  },
  "XdVxqZdsLJ9v5eiXxnNg1g": {
    "date": "2/6/2014",
    "text": "Went to Terroirs on advice from the Yelp crowd.  Cool little place not far from the National Portrait Gallery.  Sat at the bar and was waited on by a very sexy French bartender.  Had a charcuterie to start which was excellent.  The steak and fries followed - the rare steak was excellent, the fries just okay.  Two glasses of wine as well - the Spanish red by the glass was excellent.  Last of all was the chocolate pot - very rich and good.Nice local-feeling spot near a touristy area and not that expensive.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IvqYQzNwEi5KeWcJfZB_gA"
  },
  "WGcPzalIVoOe8YjT7rBD2g": {
    "date": "6/20/2010",
    "text": "Great place.  A really good wine list, full of interesting and reasonably priced alternatives, exclusively (IIRC) from France and Italy.The food also is great - not sure about the main courses as I've always gone at lunch or pre-theatre, but the sharing starters are great if you do three (four if you are hungry) between two.  Really imaginative and exciting.On my last visit I nearly had a disaster as I was told I would be in the basement - I hate basements.  Happily, this one was done really well and was cool (on a hot day) and atmospheric, as opposed to cool and damp - Terroirs' done it again!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "wIQJsxXJil49gOuCQV_-Jg"
  },
  "UIlsme__3qIAS2LGcEsYyw": {
    "date": "9/23/2012",
    "text": "Amazing wine list. If you're into natural wine that's THE place to go. We could try a few wines before we made a choice and he consultation was excellent. Food was very good but not outstanding plus it's quite posh.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sz56DbuDSP5Rdd3b1rC0Bg"
  },
  "9PMzi-3AVYUdAfD0I5Rm3A": {
    "date": "4/14/2010",
    "text": "Well well well, I think the first two lines of Thomas W's review is spot on!The food and drink were very nice - from the gorgeous artichoke, to excellent mains of bavette and pot roasted quail. Wine was also very nice, some fabulous choices by the glass, carafe, and bottle.The problem with Terroirs, unfortunately, is the service. I think I had my chair kicked five of six times by almost every member of waiting staff!  Things deteriorated when I ordered two glasses of Chablis, and I was rudely told that it was white wine. I'm no Robert Parker but in general I like to think I know a little about wine.All said and done, I'm pretty open minded. It was a Saturday night and all of the tables were full. So I would go back.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "QUy07NDS9YZkgzYyzM75iA"
  },
  "P3mjn-h7tWSAAQFRjOcRdg": {
    "date": "5/1/2011",
    "text": "Excellent food, excellent cheese, excellent wine, excellent dessert, excellent service, excellent price- enuf said. The Duck rillettes, cuttlefish and snails were excellent too - if I may add.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VyTf8D95YijgYS2lD13ccA"
  },
  "ezyPS-f-F_jcG3Jc_0g1cQ": {
    "date": "9/18/2010",
    "text": "First night in London, decided to find something in the Michelin guide because it's always great. And it turns out we found an excellent restaurant. While the guide said this place was pan-European, it turns out it was French. All staff and even the owners are French. There are a few non-French dishes, but the character of the place is definitely French. We spent the entire night speaking French with the incredibly friendly staff, and sort of forgot where we were. It was kind of strange to have a French person come and ask you (in English), \"So, how is your meal? Is everything ok?\" C'est pas francais. But it is excellent!The name of this place is well explained on a chalkboard describing their philosophy -- to find small-production wines that reflect the terrior of where they came from (the land, the culture, the winemaker) and many are biodynamically grown. The wine sets the stage, and the food is a beautiful compliment.We started with a great bottle of Spanish wine from the northwest region somewhat near the Duoro river. For your meal, you can choose starters (such as charcuterie, or cheese) which could also make a great way to have an after-work drink and snack. To this, you can add small plates or large plates. We decided to go with all small plates. The terrine with pistachios is excellently done, and bacon-wrapped. (French? Not sure. Delicious? Definitely.) But it did have cornichons on the side. Stand-out dishes included the crab (perfectly cooked, with delicious homemade mayo), escargot on bacon (yes, turns out there is a way to improve on the French classic), and mushroom (champignons). For a dessert, if you're loooking for something a bit lighter, try the St. Pierre (a pyramid-shaped goat cheese). It's plenty to share for two if you're not hungry.Gluten-free notes: So... the naturally gluten-free formula does not work here. The staff may be French, but the kitchen adds croutons. A lot of dishes come with with croutons or on toast. Be sure to ask. They are incredibly nice about it and very happy to make a crouton-free dish.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ui0A8-hrpEPuEUG8EGBNaw"
  },
  "kg3JbK4JHYKg1aI4kqfbyg": {
    "date": "2/12/2012",
    "text": "if I actually lived anywhere near this place, you would find a permanent imprint of my ass on one of the barstools downstairs. the wine list is FABULOUS. I love that they offer booze by the glass that  you can't find elsewhere (flight of eaux de vie, anyone?).  the food is DELICIOUS. the steak frites were the best rendition of any I have ever tried. the duck confit was magical. husband and I watched a guy carefully unmold (housemade?) pate, tenderly slice and inspect it for symmetry, before allowing it to touch a plate. the best part was the service. I don't think I've encountered sweeter. the bartender/sommelier/my-new-best-friend downstairs is a true treasure.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "t4UQLKHArLbcpWUSWXrFDQ"
  },
  "FX6fJHR9K-llkGSidYpngw": {
    "date": "1/21/2010",
    "text": "Mmmm.  Good(ish) food and yummy wine.Our Charcuterie selection, duck breast salad and taramasalata were delicious, though the steak tatar was overly mustardy, capery and stringy (not recommended).  The Carafe of wine that my sister choose was good, well balanced and well priced (it was some sort of italian, I wasn't paying attention).  Good selection of wine with many offered at the carafe level (great if you want several different wines).The service was slow and unfortunately our food arrived wayyy before our drinks which was like breaking the cardinal rule of eating in a wine- foody bar.  And yes, annoying people around you with their annoying and stupid conversations will annoy you coz they are whispering in you ears.  Nope.  Nothing is private in this little, tightly packed bar.Why 4* then?  Well this was saved by our greediness to order dessert- cheese for the sis and salted caramel crepes for me.  It was my turn to choose the wine and I just being a lazy cow and couldn't be bothered so asked the manager to match for us.  It was SUBLIME and both were matches made in heaven.Just for that, a well deserved 4*.  Not sure about the other servers though... they seemed a little bit busy and overworked.  This equal people in bad moods ignoring you.It is very busy so booking is strongly recommended.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "yBvTTA0p7ZoRNl-7N1mB1w"
  },
  "-RLdsr1MBU0KF6ntzZN_qA": {
    "date": "7/19/2010",
    "text": "I've been to Terroir twice and it has been an excellent experience both times. The food is simply fantastic and the wine list is excellent. I've sat in the upstairs area* both times and thoroughly enjoyed it both times. The first time we tried the fantastic Bavette and this last time we tried the pork belly and quail. The prawns, pates and eel are all excellent too. My girlfriend is French and she really enjoyed the food/experience. The wine list is excellent and I've tried 2 fantastic wines (despite no prior knowledge and a lucky dip approach)I would throughly recommend this place. * there are 2 main areas with different menus. Upstairs is more relaxed and offers a wide range of foods (almost Tapa's style but French) whearas downstairs offers larger portions (like main meals).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "pryoJ1DPlbcLaf79Vypr2w"
  },
  "87f7kR7nTz8WHnmtLM_S6w": {
    "date": "9/8/2010",
    "text": "Natural wine.  It is a movement, and Terroirs certainly is at the forefront.  We came here for lunch.  Since I am rose crazy this summer, I had to try the 2008 Vinudilice from I Vigneri di Salvo Foti.  It is from the Etna DOC in Sicily, which I have never tried before.  Let me just say, intense minerality, robust body.  At the end, the dark murky wine reminded me of cider.  Very interesting.Of the food, the Charcuterie plate was outstanding.  It was pretty much an amalgamation of all their deli meat products, including a particularly delicious country pate.  The standout though for me was the Cantabrian Anchovies, Shallots & Unsalted Butter.  I had heard of wrapping an anchovy on a ball of butter to serve as an hors d'oeuvre.  So the platter arrived.  The anchovies were artfully draped into a tall stack.  There was a tangle of sliced raw shallots on one side, and grilled crispy bread on the other side.  And the piece de resistance (drum roll), an approximately 2-inch high cylinder of butter at the center of the plate.  So I made crostini out of it, slathering the bread with butter, then the anchovies, then a few shallots on top.  It was a flavor and texture explosion in the mouth.  I made a mental note to rush back to the hotel and finish the rest of the mouthwash I have with me.  After the meal, we asked the barman if anyone's ever finish the entire glob of butter.  The answer was no.Why 3 stars?  Terroirs is a fun little place for drinks and a few noshes.  It is a tiny place, so make sure you have bookings.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pQLx8nN2P4WGvUTotNw0cw",
        "caption": "Photo of Terroirs - London, United Kingdom. Cantabrian anchovies, shallots, butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pQLx8nN2P4WGvUTotNw0cw/o.jpg"
      }
    ],
    "user_id": "FA4RzyvtOWxluc-M0QXMSQ"
  },
  "_dlsJv7bauRZ_NG1NpO0WA": {
    "date": "7/18/2013",
    "text": "Liked it so much here  classy restaurant where you can feel like a true star. The customer service is excellent and I think they're training the staff in some special courtesy course  they are very polite. Also, the wine list is long enough for every taste and the food is delicious.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "-AwZBPtek3tFYnSJlKHAjw": {
    "date": "2/23/2010",
    "text": "I really like this place.  Warning, book ahead!  There is not a lot of open space to loiter or have a drink at the bar.  And you probably need to book a bit in advance as this place is popular.  I thought it was going to be uber-chic and dark, but it is down to earth, approachable and brightly lit.  The food was very good--the waitress described every cheese in detail and we were thrilled with our cheese selection, cod roe, smoked duck breast salad, steak tartare, and escargot.  This is not a place for the timid eater!  Washed down with some good wine and topped off with a delicious chocolate pot....fab.We scored with a nice table in the corner--felt very home-like and private.  New place on the A list!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CFFKDmDsNOwhhUYd6O-wBA"
  },
  "izjK_5x8tUzUt0IBwewvPw": {
    "date": "5/30/2009",
    "text": "Having read the enthusiastic reviews in the Guardian/ Times we went here for a friend's birthday meal.  This is normally the beginning of a story of how bad the meal was. Well there were certainly bad elements; it was as hot as a Bikram yoga room as they haven't yet installed a/c which coupled with an open kitchen makes it toasty on a hot summer day and the pictures hadn't been nailed to the walls yet and one fell off and gouged one of my fellow dinners. Forget the distractions though, it was simply fantastic.  The wine list is excellent.  Diverse, approachable and drinkable.  I am, however, always more interested in the food and it was a layer above any other wine bar I have been to in London.  The duck fat 'pork' scratchings were fat heaven.  The tapenades were spot on.  The other dishes were also similarly exceptional.  The highlight for me was the bone marrow and mushroom/ truffle oil on toast.  The puddings were, to common accord, outstanding and made the birthday girl ecstatic. I can't wait for my next excuse to go",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "GgwkjH57TdhrCocAGHhqRA"
  },
  "RAhRf4ZSrJEIekz4f1lSfg": {
    "date": "11/24/2010",
    "text": "Great food - fantastic wine in a good atmosphere. Think of this place as a wine bar that does great food and you cant go wrong. Waiting staff were very knowledgeable on the wine and I would recommend getting some advice from them. I will go back!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "su0r8AvRAvSWXKpWSxOSFw": {
    "date": "2/21/2013",
    "text": "Thank you Yelp Mobile --- to the rescue!!!!!    Trying to find a decent place to eat in London and you saved me with this awesome French Wine Bar.Came with a friend to celebrate her birthday here  --- and while the upstairs was completely crowded, we were offered a table downstairs.   Downstairs???   yes, this place has an AWESOME downstairs bar -- its quiet, romantic and very very awesome!   We got a table near the bar and tucked out of the way of the traffic that flows through here.The wine list was crazy long -- like 30 pages, at least!   Wines from everywhere!!!  We settled on a nice bottle of Italian Sangiovese -- totally awesome!   Add in some little plates of cheeses and some nice charcuterie --- and its game on!!!Totally awesome -- what other place could you land in London to eat awesome bits and bites, drink really awesome wine and .... wait.. is that Parliament on the speakers????  yes, yes it was -- they play 70's funk music along with some other rock and roll on a REAL turntable with vinyl albums!    whoa!   So, next time you are in London, come here.  Ask to be seated DOWNSTAIRS and you'll be thankful you did -- trust me :)Protip:  you can't get here from the A4 -- its a bit difficult to find, but OH so worth it!!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "9z87JubGpLEvl5nYRyXB2Q"
  },
  "oc_X07JDq7FQdTZE4mDX_A": {
    "date": "2/26/2014",
    "text": "One of my favorite London restaurants. I've eaten downstairs on a few occasions (still need to try the upstairs!) and have always loved it. The ground floor and downstairs have separate menus, and the upstairs is generally more casual and serves small plates. The downstairs has a very intimate, cosy feel. Terroirs has a great wine selection and the food is always perfect. I've had the duck, charcuterie, and steak frites and would recommend all.Terroirs is one of my favorite spots to bring out-of-towners given excellent service, food, and reasonable prices.Definitely check it out! Would recommend booking ahead.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uJX434DN-_mIPBVVxn9AQ"
  },
  "7SEZ-0MMUOV3kOpw2Gttsw": {
    "date": "7/17/2014",
    "text": "I came here for dinner and it was a very enjoyable experience. The food is lovely. I would recommend the quail btw. Service is amazing. They really do look after you.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tk0mgkDurcGeCrvLgWA9nQ"
  },
  "ShR9eg5z3lpw2x8fLMjWLQ": {
    "date": "5/7/2015",
    "text": "Really enjoyed the atmosphere, with professional staff and a nice selection of wine and cheeses. The prices were a little high for my budget, but that's on me, and not the restaurant. Would definitely come back. Also much bigger than it looks from the outside.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FZ-s6urV2V_cHFmUT6Nt_Q"
  },
  "VG960W5-68MvzFbqKaxn-w": {
    "date": "1/17/2013",
    "text": "Off-piste organic wines, small producers, rare finds. Fantastic tapas, friendly service, what more do you want?",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "txv4eHEvr6JCVeS-v0khgw"
  },
  "SYEAHWZrp0gNSdcYXRyV6A": {
    "date": "6/22/2015",
    "text": "Had a late lunch and a number of small plates. Sardines and beef marrow were very good, but my wife had issues with the escargot in a very, very green sauce. Had a dessert of rice pudding (mediocre) and dark chocolate ( excellent). A good wine was had. Service was iffy.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkRWSwoGUVYo2raipZRrJA"
  },
  "9CeqJU_sFJBStgcrI2oidw": {
    "date": "9/9/2012",
    "text": "I've only been for the wine so far but always oggle at the food. The wine menu is fairly extensive and actually can be quite reasonable for some decent bottles. Top tip, check the wall to see what kind of day it is... the wine astrology board will tell you if the biodynamic wines are in leaf or root days and you will want to make sure it's a leaf day. Always bustling, always friendly. A great place to stop for wine.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "iBvTgMpdb3ki6APv0pS1og"
  },
  "Y-vMCgkz0pNQDv_HoWB9Ag": {
    "date": "9/27/2012",
    "text": "We enjoyed a nice tapas-style late dinner here for three of us one night after a performance.  The place was bustling, the food was delivered pretty quickly, and everything tasted great.  Everyone's favorite was by far the corn soup.  It was quite delicious.  We also got one of the charcuterie meat selections and one of the cheeses.  Well, the cheese was a tiny little wedge.  Like, maybe 1-2 bites worth.  But the waitress did warn us it was small.  And we had to pay for the bread, which isn't something I enjoy doing, and the bread was good, but not spectacular.  The steak tartare was good and typical, but a fairly large portion which I appreciated.  The artichoke was also a hit, with an interesting mustard-based dipping sauce (I typically go for mayo-based).  We were all quite satisfied.  It looks like they change the menu often, so I guess don't get too attached to anything.  A fun hip place to grab a drink and some bites.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5ZXT4BQB-C1XjUpKmh7kaQ"
  },
  "xku0taYcF6Nmhkc-WQgO9Q": {
    "date": "4/1/2014",
    "text": "I actually found myself here by accident but it all turned out to be a wonderful evening despite me being under-dressed and way too tired to be nice company. However, the friendly attitude of the staff and the fast seating of our party made up for the start of my good mood that went on through the whole evening. There were five of us and we ordered seven sharing plates for the whole table. The food was so good that we soon went short and ordered more. I will only say that all of it was exceptionally delicious and beautifully presented. Wine list was way too long for me to comprehend so we went with the obvious choices and recommendations by the waiting staff. I had a lovely night and I guess everyone would in a restaurant like Terroirs.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "R24Tu1z6ck1M3LdE7eVbKg"
  },
  "cgUVaNyDOZ7J6TDODALigw": {
    "date": "5/6/2014",
    "text": "Terriors is a lovely French wine bar near Trafalgar Square. The Parisian inspired interior bustles with activity leaving you invigorated. Lovely food selection- especially cheeses and plenty of appropriately paired wines to sample.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5-QG9KGdwsYciZkiWVt2KA"
  },
  "EcEpEbi9PjLPGV7ilzL5Dw": {
    "date": "3/31/2013",
    "text": "A mid-afternoon bottle of Champagne was shared between five of us, so that's a tenner each. It was good, and while the disinterested waiter poured, we chatted in the slightly cramped but reasonably comfortable upstairs area.We would have liked to have ordered desserts, but were told there was nothing before 5.30pm.Lacks atmosphere, and the drinks can be a bit pricey, but it was pleasant enough.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SD8boNGHvEcsw6wPp1xYBQ"
  },
  "IAeTvzR-NdvW3WFWLmAQnA": {
    "date": "3/14/2012",
    "text": "We found this place via Yelp (thanks Yelpers!) as it was time for some lunch while we were waiting for our entry time into the Lucian Freud exhibit at National Portrait Gallery.  We. Were. Blown. Away.There is a certain passion evident here -- we had the simplest of dishes (baked Vacherin cheese, sausages from the Pyrenees, served with steamed potatoes and a green salad).  but OH the quality. it was perfection.best of all was the very knowledgeable service.  the place is a wine bar after all -- and when we asked about the Rhone wine (for which I have a particular fondness), she steered us to an 'amber' wine from the Jura region, because she thought it would pair better with the rich cheese & sausage.  It was great advice -- the wine was interesting (slightly oxidized with nutty flavors like a dry sherry), but i probably wouldn't have chosen to drink more than a small glass -- UNTIL I tried it with the cheese, where you could see that magical wine equation at work -- 1 + 1 = 3 highly recommend including this place for lunch when visiting any of the museums at Trafalgar Square.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "JeS7ciQNAY6seqFVrhsIuw"
  },
  "j_t8CHoCgvOCEctsy-WVag": {
    "date": "5/15/2010",
    "text": "A lunch to talk about the Slow Food movement, where else could it be held? The organisation is fascinating, a rapidly growing federation of groups dedicated to pushing the Slow Food agenda and promoting the enjoyment and protection of locally produced food and styles of cooking. Entering the restaurant, despite the beautiful sunshine outside, I was shown down to the very back room of their basement restaurant. I'm sure it's gorgeous of a winter evening, but really not what you want on a sunny Friday afternoon and so I was very glad when the Maven arrived, took charge and demanded that we move back upstairs. The wine bar menu is short, though not annoyingly so, I'd eat anything on here. There are around 10-12 small plates and then another 4 Plats du Jour. We started with a shared plate of large, gently flavoured, almost sweet Cantabrian anchovies (from the region around Santander). Taken with a thick layer of butter and thinly sliced shallot on brown sourdough toast, they were a very worthy start.   Of note, the Maven went for the whole Dorset crab, which looked to be a beautiful beast, but was served undressed (and this unmentioned in the menu or by the wait staff). It's not the biggest deal, and by the appreciative noises from the other side of the table seemed to be worthwhile, though it's certainly worth knowing before you order.The pork caillette for my main was a great call. It's a rustic pâté of pork, herbs and spinach wrapped in a thin intestine like a sausage or a squat haggis that comes from the Ardeche region of Southern France. Oven cooked and served with a thick, salty gravy, crushed potatoes and julienned carrots roast in (no doubt a locally sourced) honey it was a satisfyingly solid meal. With the talking, and the appropriately summery Corbieres, one star among many on a wine list I'll be back at very soon, we passed on desserts and, eventually, waddled off into the late afternoon sun.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KeH-8kvJHnxvU_iMKjm0-w",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KeH-8kvJHnxvU_iMKjm0-w/o.jpg"
      }
    ],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "tp8brOX6rDYeXiNLfYQ-Sg": {
    "date": "11/1/2011",
    "text": "**Warning - this review contains a lot of exclamation marks.**I found myself in the area on a Saturday afternoon while a little tipsy and in need of nibbles.  The Yelp app brought me here.  Thanks, Yelp!I walked in and the hostess informed me that the kitchen was closed (damn!) but they were serving charcuterie and cheese (yay!) so I took a seat and ordered a sparkling rose because sometimes you just have to.  Bread and butter came out at once and the latter was actually at room temperature.  I know this doesn't seem like a big deal, but I detest cold butter that is impossible to spread.  (Side note, does anyone remember the episode of Cosby when the wife, Ruth, tells her friend that when she's made at her husband she puts the butter in the freezer before giving it to him with his morning toast?  I have no idea why that scene is firmly planted in my head, but it is.  Why?!?)  Not only was the butter the right temperature but so was the cheese and the red wine.  The pate was delicious (and the serving was enormous!), the saucisson yummy, and the cheese!..oh the cheese.  Additional excitement was found in the water glasses (so light!) and the fact that the bathrooms have washcloths to dry your hands instead of paper towels.  That always makes me feel strangely fancy.  Plus, if you ask for tap water they bring an entire bottle.  That's always an extra star in my book.  What can I say...I know what little things I love and Terroirs gave me all of them.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "YXOnf6nNB6xA1xtkTxFUEA"
  },
  "h2L2glY7eZfm7Jj5XVzTcQ": {
    "date": "11/2/2011",
    "text": "Better than as good as it gets--transformative!  SIX STARS.  And I didn't use Yelp! to find them, but I am to register my enduring satisfaction.In my previous review lexicon I shared a 3 tier experiential rating on restaurants:1. Good enough to make me full2. I was entertained3. I've been transformedI tend to only comment on the last category of experience, those venues where service and comestibles come together to transport me to somewhere else more desirable than where I entered from.Terroirs is all that and more at every level.Ok, there is a context to this reverie: I missed my Eurostar chunnel train to Paris today.  And I was still hankering for a fine slice of French food, and it was then I happened upon Terriors within a few blocks of my hotel (and the sixth star I give here is that the restaurant is located a few steps from Trafalgar Square and the National Portrait Gallery).I ate lunch and it was delicious.  Yet their food was significantly improved upon by the depth of French door and waitstaff behaving as if I was a fine fellow--they greeted me with aplomb and welcoming smiles... even though I was clearly American.  And I suggest here that you will be immediately transported into a reverie of what eating great food in France could be all about but seldom is--welcoming.  So the beginning was good, but could it continue?Yes.  Added to the seemingly magical dispositions of staff was their great service (professional yet not intrusive) plus a simple elegance of the menu that clearly changed daily and seasonally by the ingredients available--ahhh, freshness and authentic feel at every level.  This is my great secret recipe for a real repast, for sublime sating.  And it was all here.  But that was lunch.  I felt so good about lunch afterwards that I was not sure if I imagined the whole experience (and wandering the National Portrait Gallery and staring into the sacred faces of Newton, Coleridge, Byron and Blake and Wordsworth did little to ground me)...  Perhaps I've reflected on a feverish distortion of reality?  I contemplated such uncertainties on return to my hotel.My colleague, a sincere Francophile and harsh critic of less than stellar success, returned later and we discussed dinner.  I was curious for confirmation so I suggested Terriors.  We went and she was equally delighted over dinner.  And so was I.So this led me to another theory about transformative food experiences:French food is actually less determined and damaged by place and provenance of ingredients--it is utterly dependent upon the skill of staff and chef to achieve alchemy, a complete transformation of raw ingredients into a much removed sublime complexity that is nearly ineffable.  Every plate was something delicious you could never imagine on a market counter--it was all in the combinations of ingredients, grace of preparations and delivery.This is a vastly different value proposition than offered by the best of other cuisines, such as Italian and the far eastern exotics that are utterly dependent upon local ingredients.  The successes of these cuisines are entirely made by getting out of the way of the ingredients through artistic simplicity--let that ripe tomato and buffala mozzarella smile with just a light touch of basil and olive oil, etc.So if you are hankering for simple goodness, linger where ingredients are grown and locally finessed; but, if you want sublime alchemy on a plate, then find wherever the French are actually living that mission to historical standards that have replaced modern cynicism and arrogance, or perhaps where they never existed in the first place.And that my friends, is a place called Terriors.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "T09LsNFIF983q27h0WFrPA"
  },
  "U7DppvOkSv5XC-ZmLO9N9g": {
    "date": "12/23/2011",
    "text": "Brilliant rustic french dining! After reading the top reviews on here I suggested it for a quiet catch up with a friend. Reservations were easy to make via email (much preferred as its a bit awkward making reservations on the phone where all the work people can hear you and know you aren't working) and we were seated immediately. My main gripe with our table is that it was tucked away in a corner which was top points for privacy but hell when it came to flagged down the waitress. It took us almost 30 minutes to finally get our orders in despite asking a couple of the other staff if we could order.Sharing is caring, so we orded 3 dishes to dig into. To start, the pork & pistaschio terrine. This was one of the best terrines I've ever had. As Vikki C said, it's rich from a meaty sense with just enough fat to hold it together. The bread is fresh and crunchy (although why they needed to charge £1.50 for it I don't know). The portions are quite big at probably twice what you'd normally get at a restaurant.Next up was the Tuscan chopped raw steak. It's basically steak tartare although a rougher chop and lacking the spice of the mustard or the raw egg. Super fresh tender meat that melted in your mouth so nothing to complain about there. I prefer tartare for the sharper flavours which would have helped with the terrine but still happy with it.Finally, we ended with the bavette (seared skirt steak) with roast cubed potatoes and chanterelles. This was my favourite with the meat bloody and juicy with a delightful charred crust on the outside. I loved the mushroomy sauce and proceeded to get extra bread to mop up every last bit. When the plate leaves cleaner than it was at birth, you know you enjoyed the dish.Other thoughts. It was pretty busy on a Wednesday night so I would recommend reserving a table if its for more than 2 of you. The upstairs and downstairs areas have different menus so check it out online before reserving. The wine list is ridiculously long but the waiters double as fairly knowledgeable sommeliers so be sure to ask for help if you need it. Price wise, it's quite reasonable for the size and quality of food (terrine and steak were each around £8 and bavette was £17...we were quite full).Overall, it would have been a been 5 stars except for the long wait at the start to order and being charged for bread and butter.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jmRTZNhlLjNzWuL_xa5JQw"
  },
  "CLDhpMndD_q2fHCQF8qREw": {
    "date": "4/3/2012",
    "text": "We found this place via Yelp and unfortunately were incredibly underwhelmed.  After heading to Paris the next day, I would like to give it only 1 star in comparison but it may be unfair to compare it to an actual French restaurant (despite what they claim to be).We stopped by without reservations to have small plates and wine.  We had to wait 40 minutes for a table and received very poor service from the bar during that wait.  Once we were seated the service wasn't much better and I wasn't impressed by anything on the menu.  The cheeses and the wines we had were just marginal, which was disappointing considering the 'caliber' of this restaurant.EVERY restaurant and bistro that we went to in Paris had better everything than this place.  I know there have been a lot of positive reviews, but I'm sorry - I don't understand why.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rrvRwSN7aa4XSTndxjAUbg"
  },
  "NeRElTjZ39byKtkytlFU8A": {
    "date": "4/10/2012",
    "text": "Am I one of those people that writes reviews of places that I actually didn't get anything at, but was so disgusted at the level of service that I give them a terrible review? (While I feel that this question is in some ways rhetorical, the answer is yes, I am that sort of person.)We walk in at about 5:30 on a Friday afternoon. There are maybe 10-12 people in the place. Two are at a table, one more is at a second table, the rest are huddled around the small bar. We tell the waitress there are two of us. We ask if we want to sit at the bar. Well there is clearly no room at the bar, so we say no, we'd like a table. She looks at the seating chart. The phone rings. She freaks out, looking back and forth from the seating chart to the phone, disgusted that the phone is ringing. Finally she says she can get us a table if we are gone by 7:30. I say that should be easy, as we just want a bottle of wine or two to warm up from the cold.Her response? The only way to sit at a table is if you're eating, and we have to go to the bar. We go to the bar. There is no room at the bar, so we just leave. I get that sort of response if the place is bustling with people, and there's only one table left, but they want to save it for someone who might be eating. I don't get it when practically every table is empty (probably due to their inane seating plans), and they are worried that the table won't be free in time. Clearly, it will be free in time, and clearly, if someone comes in sometime after us, you probably won't give them the table, because of your insane ability to figure out whether or not people will be finished in time.It's unfortunate, because we don't drink cheap wine. Seeing how empty the place was, our bottle of wine would probably have been enough to pay one of their employees for that hour, who were probably just standing around not working anyway.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "7bRzxiZuDsRSTlcCSgdC8w": {
    "date": "12/16/2014",
    "text": "The wine is overpriced, the menu is short so they should have it right every time. Unfortunately the partridge was still quite raw. Friendly staff couldn't make up for the fact that we had to wait too long for our food. A shame as we rather enjoyed our previous meal there.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ue_aBPBH9ToWeY1CvtHcFw"
  },
  "hPFUj9qXpTtpMAHa9nXHTg": {
    "date": "10/21/2011",
    "text": "We went to Terroirs on Monday night and was busy.  Ordered a glass of wine at the bar and waited for 10 minutes.  We had a few different kinds of salamis and cheese and beef tartar - all were very delicious!  Busy but very cozy atmosphere. Love to go back there again to try more stuff on their menu!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "huTfpB63_Ln0QDoZQYJ9eQ"
  },
  "PcbK1DovRBdiqPpdUpv4Bg": {
    "date": "6/28/2018",
    "text": "One of my fave little finds on my last visit to London not too far from the Embankment and Coventry Garden tube. Really good small plates of food and good natural wine, mainly small producer, boutique, artisan, organic. Pricing is reasonable in an otherwise very unreasonably priced city. Terroirs hosts a bunch of winemaker events and posts other wine-centric fun stuff on their website. The wine people that work here know their shit which I appreciate bc I like learning from and drinking stuff recommended by professionals that know their shit. Good stuff.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "yyQwWUW7jmUwAWrBk63glQ",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yyQwWUW7jmUwAWrBk63glQ/o.jpg"
      },
      {
        "img_id": "kegYSxA-A05PNcz3EI176w",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kegYSxA-A05PNcz3EI176w/o.jpg"
      },
      {
        "img_id": "UST1MxNd0WWdCD9laoJNUA",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UST1MxNd0WWdCD9laoJNUA/o.jpg"
      }
    ],
    "user_id": "4TCOItk-gIJROyNA5ftZ-Q"
  },
  "-QyuLx0Md2enn1Hn9YiMig": {
    "date": "7/14/2016",
    "text": "The perfect escape on a rainy Summer's day - of which there are too many in London this year ...  Terroirs is very cosy, and very French, your quintessential wine bar, in an ugly side street linking Trafalgar Square and The Strand.I love the comfort of French places even though the menu tends to pose a bit of a challenge.  As a recovered vegetarian I am still rather squeemish about many meat and most seafood dishes - the first thing I read was duck's hearts ...  so, the choice by elimination began.The smaller tapas-style plates didn't quite sound tempting or filling enough and we both opted for the main course of Grey Mullet.  Now, samphire is about the only vegetable in the world that I am not keen on ...  and I'm not normally one of those customers who demands lots of alterations to a perfectly rounded dish ... very embarrassing to be turned down!  But all was fine in the end and I was glad to have taken the risk, mixed in with puy lentils the salty seaweed actually worked a treat - this chef knows what he's talking about!!I am also not normally a big fan of desserts but there was something utterly irresistible about the salted caramel chocolate pots.  Divine, the most sumptuous chocolate mousse with a layer of liquid caramel at the bottom - wow!  Our heads were already buzzing from the rose wine we ordered (despite outdoor temperature and rain, it is Summer after all!!), this sugar rush sent us over the edge - those puds should come with a health warning for the fainthearted!Staff were very attentive and it didn't matter that we had trouble spotting them, no aprons or uniforms here, no striped t-shirt or beret in sight.  They all looked so casual, we expected them to join any of the tables around us - they blended in perfectly with the diners.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "7PFVkbcMS88hlliThHrSDw",
        "caption": "Photo of Terroirs - London, United Kingdom. ... after",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7PFVkbcMS88hlliThHrSDw/o.jpg"
      },
      {
        "img_id": "CWKX6pISVuFTrDybb2jV6g",
        "caption": "Photo of Terroirs - London, United Kingdom. Grey mullet on puy lentils and samphire",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CWKX6pISVuFTrDybb2jV6g/o.jpg"
      },
      {
        "img_id": "i1ckNLXLORASID-JsJ49HQ",
        "caption": "Photo of Terroirs - London, United Kingdom. Chocolate pot with salted caramel - before",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i1ckNLXLORASID-JsJ49HQ/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "1zHNNtfIQ_U9-fMMimMWgA": {
    "date": "11/18/2016",
    "text": "I could not get enough of this place! I already am planning my next reservation, and what to order. Although we did get seated about 15 minutes past our reservation time, the wait staff was attentive and friendly, they also gave us a fantastic table on the upper balcony that didn't feel like we were too close to anyone else.As it was just two of us, and we were there more for the wine and cheese/meat, we didn't get any mains but the food around us looked amazing. Next time, I want to order the tartare, the oysters, the steak? or pork chop... everything!We ordered: the mixed selection charcuterie, as well as the herve cheese - a strong softer cheese - (looks small, but we almost didn't even get through the whole piece) and the beetroot and goat cheese salad. That has to be one of the best beetroot salads that I have had. The goat cheese was whipped-like, light and absolutely delicious. ALSO the bread.. keeps coming!!!! And it was warm! Yum!Waitress recommended a couple of wines for us, and we took her recommendation and got white to start. It was a great choice and we loved it. Crisp and citrusy. I wish I remembered the name. We went by the glass and got two glasses each.Total pp was about £25 each and we were more than full.Seriously cannot wait to go back....",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Lb4xFCkeNUP0cEr6jCdDvA",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lb4xFCkeNUP0cEr6jCdDvA/o.jpg"
      },
      {
        "img_id": "KTObPRF8-8OCAURaAlmJjw",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KTObPRF8-8OCAURaAlmJjw/o.jpg"
      },
      {
        "img_id": "SdRhyI__9MeGiNOCCDAzbQ",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SdRhyI__9MeGiNOCCDAzbQ/o.jpg"
      }
    ],
    "user_id": "INBn9mSvn4Qt9u5dKkOXFw"
  },
  "O_W8Rweue2wWwwBcoH1xHA": {
    "date": "7/14/2016",
    "text": "Great service, ok food  Pros:Great, attentive staff Good ambience for a small get togetherCons:Food is mediocreFood delivery is a little slowOk wine selection",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Cekpdh_OBgh-VhOlHaXEhg"
  },
  "YuAafNjL_Mej60ynTK0HMw": {
    "date": "8/6/2015",
    "text": "A charming and atmospheric place for lunch. We were seated on the first floor, on one of the tables opposite from the expansive windows. Not only did we enjoy fantastic cuisine and warm friendly service, we were able to people watch Londoners going about their business from the comforts of our table.The food was elegant with each bite a treat for your taste buds. Yummy crusty bread with butter was presented to each table. We ate it with our order of Pecorino Saldo (Sardinia) cheese.A small plate of Duck Rilletes was a perfect amount to share. The duck was very tender and the cornichons helped cut the richness of the meat. The Snails on toast with garlic, parsley, and lardo was an incredibly rich and flavorful dish. Fragrant garlic, succulent snails, and heavenly lardo made this a filling excellent dish.We also had a plate of smoked trout (I think it was trout) that was on a plate of something crisp and green. It was a light and bright dish that we desperately needed after such heavy plates.Of course everything was washed down with a carafe of white wine from Terriors extensive wine list. I loved how the wines are sourced from artisan growers who cultivated the wine in a sustainable/organic/bio-dynamic fashion. The bill was about $70 USD. Not bad for wine, 3 plates, and cheese. The two of us were quite stuffed after our meal. Tourists around the National Gallery/Covent Garden/ Leicester Square should definitely meander towards here for an excellent dining experience. Terriors is well deserving of their Michelin Guide bestowed status of Bib Gourmand, a title given to restaurants that offer high quality food and service at a good value for budget savvy diners.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-h79xbKWiYDR8ZwEaNqzrQ",
        "caption": "Photo of Terroirs - London, United Kingdom. Smoked fish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-h79xbKWiYDR8ZwEaNqzrQ/o.jpg"
      },
      {
        "img_id": "VYwj47yUm91Z-w_O7FFamQ",
        "caption": "Photo of Terroirs - London, United Kingdom. Pecorino",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VYwj47yUm91Z-w_O7FFamQ/o.jpg"
      },
      {
        "img_id": "AheNA4_GmKn5o4tMj23F-g",
        "caption": "Photo of Terroirs - London, United Kingdom. Snails on toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AheNA4_GmKn5o4tMj23F-g/o.jpg"
      }
    ],
    "user_id": "G45p3odftGYzPRkFfCWhVQ"
  },
  "bZGxDRrf7k__2DeIIutfGg": {
    "date": "9/29/2015",
    "text": "Terroirs has been on my to-eat list for a while, and when my friend told me that they had the orange wine that's become trendy and I've been dying to try, it became an immediate priority. It's just around the corner from Trafalgar Square and Covent Garden, and I must have walked by it dozens of times, but had never realised it was right there. We went on a Monday night and managed to get a reservation just hours before arriving at 8:30 PM by calling the restaurant (OpenTable showed no availability). It was impressively packed for a Monday night; I didn't see a single empty table in sight.The menu is quite simple, with a selection of charcuterie, cheese, small plates and a few plats du jour. We opted to order a charcuterie platter, a burrata dish, and some grilled squid with a spicy romesco sauce. They also gave us a lot of bread to eat with our charcuterie platter, which had very generous servings of the pork and pistachio terrine, duck rillettes, and some salami (there is no description on the menu, but this is probably not for those who prefer straightforward prosciutto and salami!). I really enjoyed the burrata and we decided the squid was our favourite dish and the most unique / interesting, but really, they were all stellar. As for the orange wine, we got an amazing lesson from our waitress about its flavour profile and how it is made. There is also an interesting little blurb in the wine list. The wine list is an exhaustive list, with many types of red and white wines from all over the world, but the waitress said the place was known for their selection of orange wine, as they have an entire page dedicated to it, whereas most places would be lucky to even have a bottle. We went for a 2006 Venezia Guilia Pinot Grigio, as it was one of the few made from a familiar grape, and found it really enjoyable. The only thing I wish they would change was to not give us a red table and better lighting so I could actually appreciate the fact that it was orange!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "DuXus13KhuWpPTegD2ZmfQ": {
    "date": "7/26/2016",
    "text": "Heard good things about this restaurant so decided to give it a try without reservations on a Tuesday night. Unfortunately the manager told us when we arrived the wait would be around 20 minutes long. At 55 minutes, we checked in were rudely addressed by the manager that it wasn't their problem they underestimated.I understand if you're off by 15-20 minutes, not if you're a popular restaurant and off by 35 and decide to add on attitude \"because you can.\" Having already bought a bottle of wine, would have expected some level of service beyond walking away from the client. For this level of arrogance, would expect this to be a far better restaurant than quite a few of the reviews have indicated.One additional star for the wine we bought while waiting. Honestly though, save your time and money and go elsewhere.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fG9ACC-u5MufRHtt_nqmLw"
  },
  "RiT9G7GriOIPn_kEZCJvbg": {
    "date": "3/1/2016",
    "text": "Good little hidden gem, above average food, attentive service, cozy interiors, and knowledgeable staff. The one little drawback would be that our first bottle of wine - a smoky white retailing at around £70 - was quite corky but the staff claimed that it was the taste of the vino and wouldn't change it, despite our protests. It was definitely corky, as we're fans of that wine and know it quite well. Also, by 11 pm they had finished ALL the desserts save for the rice pudding, which was just ok. Would I go back? Perhaps, but there are far greater places in London, in my opinion.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "k2a_aCbw4L4xDR8bnm3S0A"
  },
  "UcBgHmtHqUk_QnDvNpJLbQ": {
    "date": "5/16/2016",
    "text": "After a recommendation from a friend, we found the menu not consistent with that posted on the web site, in fact, if you are looking for a meal DO NOT come here. The sever while apologetic was over worked and not timely. The food itself was over spiced and the kitchen could not allow for any deviation because \"we are too busy\". The manager was un-apologetic to the point of argumentative when we suggested the menu was misleading. The atmosphere is loud with thumping music not conducive to enjoy wine or food. The wine list was exhaustive however the wait staff was too busy to answer any questions.The couple making out at the bar provided a bit of comic relief.I would avoid this place.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p5kBycr9N5JPklvN6P3xIA"
  },
  "wWI-_8WJuvgtI4tBzG8geA": {
    "date": "12/9/2015",
    "text": "Arrived here on a rainy Saturday afternoon. I had been standing out in the freezing rainy London weather, and had decided to meet the girls here for a few drinks. I walked in drenched, cold and looking very vague, haha, and the bar staff could tell. But they welcomed me with open arms and assisted in sorting out a table for when my friends arrived. Everyone is super friendly here, and very attentive. It didn't take long for me to have a bottle of red on the table and ready to drink. They have a huge range of wines, and it can feel a little overwhelming trying to find the right one. But have no fear any of the staff will help you out. The venue has a great homey feel to it, and it would be perfect for a date night. I did notice a few dates happening, and I felt slightly under dressed.Even though we overstayed our initial one wine, the staff didn't pressure us to leave. Once the table needed to be turned around for dinner service, they gave us 20mins warning, which was plenty of time to down a glass each. Would definitley head back here again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b8GKq58rrMvGrX_XyGVi9A"
  },
  "3SXqiMCqbEGgWU4IRK5eyQ": {
    "date": "11/15/2015",
    "text": "Amazing gem in the heart of London. The place is really cozy and beautifully decorated. The food is good and the service is friendly. Highly recommended, would definitely visit again when in London :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iokxLWzHZSZAHix_suVy7A"
  },
  "PhjcdluZ-7HsgEO4q1nZDA": {
    "date": "11/15/2015",
    "text": "Two for saturday night at 8:30, was expecting a long wait, but seated immediately. The food was excellent. Place was busy. Had to wait a bit between courses, extra long for dessert. Otherwise, it would have been a five star experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fU7ObuX_pJBAvYuAsBuzUg",
        "caption": "Photo of Terroirs - London, United Kingdom. Charcuterie selection",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fU7ObuX_pJBAvYuAsBuzUg/o.jpg"
      },
      {
        "img_id": "Tk-0asjJ6OoAVM-5gTwRaA",
        "caption": "Photo of Terroirs - London, United Kingdom. Octopus",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Tk-0asjJ6OoAVM-5gTwRaA/o.jpg"
      },
      {
        "img_id": "-x_2_7v_ZgdmMiMvcAyzug",
        "caption": "Photo of Terroirs - London, United Kingdom. Marrow !",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-x_2_7v_ZgdmMiMvcAyzug/o.jpg"
      }
    ],
    "user_id": "24NOzaXYKQ5AtCmuP51uxA"
  },
  "A4SJBw1lH3vfhA_rVDfiVg": {
    "date": "9/18/2015",
    "text": "I've been here twice, and it was excellent both times. This time, we came in for \"a quick glass of wine,\" and were having such a nice time that we cancelled our dinner plans at a different restaurant and stayed to feast on charcuterie and langoustines, paired with some cool, funky wines. As others have noted, they focus on natural wines from small producers, with an emphasis on France and Italy, but some wines from other places. We sat at the bar both times, and found the servers to be highly knowledgable and extremely friendly. They let us taste before committing to a glass and clearly were passionate about their work. We started off with a glass of their special amphora negroamaro from Puglia, which was everything a natural wine should be - funky, complex, something you would imagine sipping while sitting in a medieval monastery full of beeswax candles laboriously copying ancient texts. It paired beautifully with the charcuterie selection - a delicious pork terrine with pistachios, some salami and duck rillettes. Also had a glass of their Vino di Anna from Sicily, which paired particularly nicely with an Emmentaler cheese. We went in an unusual order and had seafood and white wine second - some langoustines paired with a chardonnay from Jura. After dinner, we had a few glasses of some of their other wines - an orange wine from Emilia-Romagna and some of their special reds. What I love is that they have so many rotating specials, so you never know what you could discover. This is a place to come with a small group of friends or a date to taste and enjoy some unique wines in a lively but relaxed setting - it's kind of the opposite of Gordons (which does have unique wines, but it's more a place to DRINK wine rather than TASTE wine). For sure worth a visit for any oenophile.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bKtVaquILDCO9U9rM29m0w"
  },
  "JYc_PJxiMKCSuSWpsRy7yg": {
    "date": "5/16/2016",
    "text": "One of, if not my favourite place in London to go for lunch. Amazing and well considered food menu and wine list. Friendly and knowledgable staff who are enthusiastic about good food and wine. The lunch special is amazingly good value. A gem in the heart of central London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zk_BU8rFGuc_v3SiVWvuKg"
  },
  "Tw-qsYNMnWm_Zb4Qj6tlqQ": {
    "date": "11/16/2014",
    "text": "Exceptional experience. Lively atmosphere. Fabulous food and wine. Unassuming staff. Lovely. Will return.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yu97Og9074BtC5q97OOwGA"
  },
  "t1UGX2cWejCDIkalVg9RVw": {
    "date": "4/30/2014",
    "text": "Shared a bottle of wine and small plates before going to dinner. The wine was an orange wine; it was from grapes with an orange color. Great ambiance. Would like to return and recommend it to others.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "3OAkpYTgzgt3phm76l86LA"
  },
  "PIAb4w3yYe516TKBl-abHg": {
    "date": "6/13/2014",
    "text": "I'm so in love!  I sat at the bar which is located on the ground floor and was treated to the most charming, informed and informative server ever!  She guided me by describing the selection of four cheeses perfectly, three of which were incredible.  Next I died and went to heaven eating the world's most intense, decadent, authentic artisan butter, apparently from a small farm in France located between Brittany and Calvados.  The bread was so fresh, but alas was simply a delivery vehicle for that butter.  And let's not even try to describe the combo of bread, cheese and that butter!  Life changing!I then had perfectly blanched asparagus spears topped with the softest shaving of boiled egg, fresh herbs, lemon zest, capers and olive oil.  Every restaurant should have a diva veggie dish like this one.  My main course was a pair of sizable lamb t bone chops served with romesco sauce and these mini leek cousins that I am determined to find back in L.A.  Another perfect dish!There are several sister restaurants which I plan to explore on my next visit, but only after a repeat trip to the mothership!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t61bpRaVEHOWgl35HzOREQ"
  },
  "LsFGImpH7sRJ3tvQEccEaQ": {
    "date": "11/28/2015",
    "text": "Post theatre dinner. Sat at bar. Swift and great service. Chef came over and talked to us about the food options gave great advice. Had the duck rillete and special pate. Both were great - tasty and full of flavour and texture. Prawns were juicy and the simple salad was great with a delicious dressing. Barman recommended wine and allowed us to taste. He even found a drinkable Chenin blanc. Great food and atmosphere.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UglmPVorcPvq1IIDLuefFg"
  },
  "S809QkHwRFIf6ZdTnuh8LA": {
    "date": "10/13/2014",
    "text": "We took a client here for a Thursday lunch and the food quality is utterly superb. Great range of dishes and we tried absolutely everything. Delicious. It was quite busy so we were tucked in the corner of the restaurant and it became quite hot, but otherwise I really like this place. The restaurant is trendy, vibrant and clean, staff always coming over to make sure we were taken care of. The client had a great time too, will definitely enjoy coming here again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y_2-KLAyfditovY_OmSbVw",
        "caption": "Photo of Terroirs - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y_2-KLAyfditovY_OmSbVw/o.jpg"
      }
    ],
    "user_id": "M1Lt6xzFriw1p2fzbGIVgg"
  },
  "0JBP4DgXyPRDZa_Okk3q6w": {
    "date": "6/21/2014",
    "text": "This is such a hidden gem in London! Tucked away in a side street close to Trafalgar Square, you will definitely walk right past it if you dont pay attention.The lunch menu is quite different from the dinner, offering a selection of cold meats, small plates and some entrees. We had a selection of charcuteries, smoked duck and brawn small plates, and langoustines and veal in tuna sauce ( or something to that effect... The nice waiter tried his best explaining the different dishes to us in his very heavy French accent), all shared between 4 people with fresh and yummy bread.I cant say there was a favourite, cos everything was done to perfection!Oh, and they have a VVV extensive wine list!The bill came to £75 incl SC, which is very decent in the heart of London.Mm, cant wait to go back to try their dinner menu!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sNR_3vWC5ncKp6aur1QoXQ",
        "caption": "Photo of Terroirs - London, United Kingdom. Cute decor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sNR_3vWC5ncKp6aur1QoXQ/o.jpg"
      },
      {
        "img_id": "f8adSj2S-0Kk1d18Be0qZg",
        "caption": "Photo of Terroirs - London, United Kingdom. Brawn something something, cant quite recall... - small plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f8adSj2S-0Kk1d18Be0qZg/o.jpg"
      },
      {
        "img_id": "DvAQ3CvgL6Nbz7R5IOoGLQ",
        "caption": "Photo of Terroirs - London, United Kingdom. Smoked duck small plate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DvAQ3CvgL6Nbz7R5IOoGLQ/o.jpg"
      }
    ],
    "user_id": "n_wfsGOYejvc4tiIhRvVZA"
  }
}