{
  "j9q0X_39238ETHZTzfTYKQ": {
    "date": "6/30/2016",
    "text": "This restaurant rivals some of the best San Francisco restaurants I've eaten at, which I think are some of the best in the world - imho.  The eggplant tempura and hummus while simple was fantastic.  The atmosphere is rustic and cozy.  We only ordered vegetarian tapas but I would highly recommend any of those.  We went right after Kinky Boots at the Adelphi (awesome show!) So it was super convenient.  Highly recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "r13Y2q2Dnr6dtVfcg1-Q6Q"
  },
  "I5Lf-CXYf3nmowlT2425TQ": {
    "date": "5/18/2017",
    "text": "We ordered all the favorites the waitress recommended, and they were very good! Chicken skewers, fried calamari, mushroom toast, green peppers, and garlic oil shrimp were all wonderful! The service was fast (10-15 min for dishes to come out) and servers were nice. The atmosphere was cozy/upscale.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LuT_KrlWPv3QsW6JGHBIrA"
  },
  "evRQa0_Ays-5hYVqv5jF5Q": {
    "date": "6/5/2017",
    "text": "So this place is AWESOME! Reasonable prices, decent wine selection, not pretentious, great atmosphere! Get yourself to The Port House!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "93abhtdRw8bAZl3I2ZCWFg"
  },
  "AA222yNF9MyHzlNmhcC4-Q": {
    "date": "5/27/2015",
    "text": "Buzzy tapas place. If you're lucky you can sneak one of a couple of seats outside and watch the world shuffle by while you sip smugly. Do the white port and tonic - the very elixir of life itself! Inside is dim, candlelit date-worthy cosy and bare brick. Never tried the food, but looks/smells good.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "adHDDsErXNLp0F2IOlp4QQ",
        "caption": "Photo of The Port House - London, United Kingdom. Swig",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/adHDDsErXNLp0F2IOlp4QQ/o.jpg"
      }
    ],
    "user_id": "exPokip_gRHRpzfar1OvsA"
  },
  "zDi2--CaT0JI2JOi6jiDJg": {
    "date": "4/5/2013",
    "text": "Yes, yes, yes, yes this place is absolutely amazing! From reading the only other review of The Port House, I'm assuming it's not been open very long, but it's already a winning formula for me. I came in here last night for dinner because it was right next to the Adelphi Theatre which is where I was heading afterwards! Upon arrival I loved the place. Candlelight, leather seating, bare stone walls, and fantastic staff. My waiter Eric was not only smouldering Spanish in an Enrique Iglesias way, he was also a fantastic server. Upon arrival I was handed the drinks menu, a special gin menu, and a large glass bottle of water. I love some complimentary table water. I ordered a Hendricks and tonic off the gin menu, which came in a huge fish bowl type wine glass, and was delicious. From the menu I ordered Patatas Bravas, deep fried cubes of potato in a fiery tomato sauce and garlic mayo, Confitado de Pato, confit duck leg served with a membrillo sauce, and Lubina, pan fried sea bass on a bed of lentils with a cream reduction. After ordering, the 3 small dishes came out within 20 minutes. I love tapas food on a normal day, but this was the best without a doubt I've ever had. The duck was slow cooked to perfection, and the quince paste that came with it was sticky and sweet and gorgeous. The potatoes were soft and the sauces were lovely, and the sea bass was cooked exceptionally well and fell apart into the beautifully cooked lentils and cream reduction. I was probably making inappropriate noises whilst eating this magnificent food. I rounded my meal off with a raspberry sorbet, which was a bit tangy but the raspberry flavour was intense and delicious. My bill came to a phenomenally cheap £30, which I couldn't believe. Normally excellent food is expensive, no? Definitely get in here, I will be coming back.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mISF1f6HMdbF6RMVNnwzrA",
        "caption": "Photo of The Port House - London, United Kingdom. World's largest G&T",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mISF1f6HMdbF6RMVNnwzrA/o.jpg"
      },
      {
        "img_id": "DYFJ8Y4Ejvvkjx81rxTEEQ",
        "caption": "Photo of The Port House - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DYFJ8Y4Ejvvkjx81rxTEEQ/o.jpg"
      },
      {
        "img_id": "kk6mo8J36bMkPqBUDIIONA",
        "caption": "Photo of The Port House - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kk6mo8J36bMkPqBUDIIONA/o.jpg"
      }
    ],
    "user_id": "VFhor53ZPCDw6EELQkSHLg"
  },
  "BcFHBJ-uWD3zbBFHAfh0rg": {
    "date": "7/7/2016",
    "text": "Seriously wonderful food!!! The duck confit and battered shrimp were incredible!!! Good value as well!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oMqjjo2GxQ7t_-mgDGX4Q"
  },
  "LgLT2diD5ngb94gSDaSQbA": {
    "date": "6/19/2015",
    "text": "Great little place, if you are a port lover you cannot miss a visit here. Great selection of limited ports, ok food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yc2LK_hwvzwPNf-oAOioLg",
        "caption": "Photo of The Port House - London, United Kingdom. Port wall!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yc2LK_hwvzwPNf-oAOioLg/o.jpg"
      }
    ],
    "user_id": "B98CA1BO-gzMp0D1wV6rTQ"
  },
  "SpN7FaBW-jJ_xv0gDKifTg": {
    "date": "4/13/2015",
    "text": "I have walked past this place so many times without realising that it was actually a tapas restaurant and not a wine bar as I had originally thought.A work colleague suggesting going here for one of our office ladies lunches so no pictures unfortunately. There were 7 of us and we each chose two dishes but we just shared everything between us. I can't remember all of the dishes that we chose but mine were the plato de carne caliente (hot spanish black pudding, chorizo & pancetta) which turned out to be a HUGE portion and the Brochetas de Gambas al Ajillo (prawn skewers with garlic and chilli) which were absolutely astounding. Special mention also goes to the asparagus and calamari too!As it was lunch no alcohol was involved but the wine list here is pretty impressive so there's definitely something to please everyone!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vwgvK7fyM9ahSZzdKuksZA"
  },
  "3BHGZWX3baIxuc4f6JeBCg": {
    "date": "6/28/2016",
    "text": "Happened to step into this tiny place right after catching Kinky Boots at the Adelphi (it is literally right next door).This was such an awesome find as the drinks were excellent (it's all about gin and port here) and the food was just the right size and delicious.Highly recommend for a pre-theater light meal and surely for a post show glass of wine and cheese plate.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAyh4xsLi5h3bo-__pWUeA"
  },
  "mnicSIDdRIxhuqxNgYRPYg": {
    "date": "11/15/2015",
    "text": "Dropped in for a glass of wine which turned into 2 bottles. Then we started on the Tapas and did we enjoy. We were looked after by 2 of the best staff ever Marco and Jenny thanks guys for making our evening better.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GfhhlfjoVii7x1apl9MmcQ"
  },
  "ztW8n30NnAEXCRJKVy4_Yw": {
    "date": "8/3/2015",
    "text": "This is our second time here--try the fried prawns--seared pork belly-duck confit--- yum!!    Lots of port but we just had wine.  Many choices in tapas-- this is a must!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBpTvGs92fnFGluePTl9mw"
  },
  "v9HsSE0I1AwI27qi4brnuQ": {
    "date": "5/21/2015",
    "text": "Fantastic little place! We were visiting London for the week and looked up a Tapas restaurant and chose this one. The first thing we noticed when walking in was everyone having a gin and tonic in large bubble glasses. They were delicious! We ordered several different plates and loved them all. The cheese and meat plates allow you to try each type offered by the restaurant.  The fried pepper with sea salt was the perfect amount of salt. We also loved the papas in a spicy tomato sauce and garlic aioli. The service was very good when we first arrived. As the restaurant got busier it was a little slower, but that was to be expected.We spent a few hours here enjoying drinks, food and friendship. The lighting and atmosphere make you forget about what's going on outside the doors. Highly recommend checking this place out!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ei1PuoZLz_FSg2qdarz0VA"
  },
  "iJAtxUJ5ySujrB6iqt1ipQ": {
    "date": "12/29/2014",
    "text": "I'm normally way too lazy to write these reviews, but this place was so impressive this just had to be done. After a mistake on my part in booking a restaurant, we tried to look around for somewhere good to eat, and even though the place is tiny, it really is a gem.The cured meats are delicious, and they give you crackers and pickled peppers that compliment them very well. For those that aren't very familiar with cured meats, you might wanna start slow since the flavor is strong. Unless you're an adventurous foodie, then just go for it.But for something more filling, we went for the lamb stew. It is quite rustic, as you'd expect, but it was truly delicious. It was seasoned beautifully and tender.We then went for more exciting dishes, getting the salmon and foie gras. The foie wasn't nearly as rich as I normally expect from foie, but nonetheless it was delicious. Can't go wrong with foie and apples. The salmon was draped on top of a light yet rich mayo with a kick of what I think is wasabi and/or dill. These two were probably the highlights of the meal, and these particular dishes we went back for seconds and even thirds.Feeling fantastic about these first couple of dishes we started to have the confidence, mood, and appetite to order a lot more. On top of these were the scallops, baby squid, sea bass, and duck, all of which were done with technical excellence and a great attention to detail, such as seasoning the garnishes.This place really is fantastic, and I would no doubt visit more often, and with a friend or two, if we didn't live across the Atlantic ocean.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "74buMfxSVtxLUSv-iYRSSQ"
  },
  "ohrEGYjYoUWxppZbnw39ag": {
    "date": "11/15/2015",
    "text": "Popped in for a quick glass of red with my other half. We ended up staying for 2 bottles. The tapas in the bar is a fantastic idea as you can sit and graze all evening. The atmosphere was good and the staff very friendly. We will definitely be popping back in ;)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGBxNy0SMhLyZMkn0CsuYA"
  },
  "TgsOfU-NxmGVsfGlbV2B3w": {
    "date": "7/25/2016",
    "text": "Great food and atmosphere. Service was impeccable. Perfect for a pre-theatre bite or an after theatre drink (or anytime really)! Lemon and garlic chicken was surprisingly amazing! And be sure to partake in a gin ballon!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nw_vfE2L_OnKgnTgW0Gx6w"
  },
  "LhZulMuSbBWv35HdXv0H1Q": {
    "date": "1/25/2015",
    "text": "Looking for a glass of wine and dinner, came across The Port House on a Tuesday evening.The space is long and skinny, with immediate bar seating if available. Atmosphere was lively and relaxed. Walk past the bar to the reception area, and saw there's a dining area on the other side. Very intimate feel with nice warm hues of candles lighting up the space. Service is friendly. Got seated when estimated time was reached. Everyone was busy, but helpful. I asked for recommendations and the server was great.Ordered the the Pisto with Fried Egg, Chipirones a la Plancha, and Spanish Tortilla with a glass of wine from Portugal. I asked the server if it would be too much, she initially said it would be fine. Later came back and told me she didn't put in the Spanish Tortilla order in case the food was too much, but would be more than happy to place the order once I saw the dishes come out. I thought it was super great of her to do that.Overall food was flavorful, vibe was nice and intimate, suitable even for a party of one. Looking forward to trying the other dishes on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X7ts8GuilbJ1KwUcnFCgPA"
  },
  "scWtXmqwSMJdB98OBLKFaw": {
    "date": "8/30/2015",
    "text": "I wish we had found this place earlier in our visit to London! We only had 2 nights left on our trip when we discovered this little gem! Located almost directly across the street from our hotel - Amba Charring Cross. We stopped in for a late lunch and loved it so much went back for our last meal before leaving for the airport. We had many different tapas and loved them all. Here are some of our choices - deep fried prawns, slow cooked duck confit leg, a trio of croquettes, duck canelloni, and some other items I can't recall. Everything was fabulous! We sat at the bar and helped ourselves to delicious roasted and salted marcona almonds. I don't know if we were supposed to help ourselves, but no one was there to stop us! Yummy! We loved it so much, we stood outside for 10 minutes waiting for them to open up for lunch so we could have one last meal before heading for Heathrow to return home to the states.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6EWVaAEKtCiCarrTBJW1fg"
  },
  "Cm1PjypN-fHncSsM28LH9g": {
    "date": "11/29/2015",
    "text": "I've been meaning to try this restaurant for a while and headed here on a Saturday night with a friend. We waited for about 10 minutes to be seated. The ambiance was nice and the wait staff were prompt and friendly. The food was excellent as was the bottle of wine we chose. Will definitely be heading back here in the future!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JY_EFUFP0zLVndHOCZ43uw"
  },
  "dkbUMdezVY_tan0wjrDLbg": {
    "date": "5/20/2015",
    "text": "Really good tapas, try the baby grilled squid and the foie gras.  Combined with great gin cocktails - the most extensive list of craft gins I've ever seen!!!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCwQPmna5JTBRMfqGV4Tew"
  },
  "n45WsH8ljZBmqvhDB3E4mA": {
    "date": "8/1/2013",
    "text": "A hidden gem in London.  Great gin drinks to start your meal.  Super good tapas dishes.  And great port choices to finish things off.  Had the albondigas, prawns pil pil, chicken skewers and lamb chops, all were excellent.  You will be happy you chose this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KZ3VRMhJ9lNxFnDKw1G8g"
  },
  "rVm7vPD7tgXUcGqrjE15ZA": {
    "date": "8/30/2018",
    "text": "Wonderful place in the heart of the West End, Covent Garden area to enjoy some great drinks and tapas. It's quite unassuming from the outside, but inside the wine cellar vibe/decor was very welcoming and appealing. We stepped in at about 7:30 on a Thursday night to see a few groups waiting for tables. To avoid the wait (which actually ended up being quite short ) we grabbed a couple of seats at the bar. Then we opened a tab, and leisurely drank and sampled various tapas. Though they specialize in wines/ports/sherries from Spain and Portugal, they have a good selection of other adult beverages as well. The tapas menu has a large variety of choices to suit whatever your tastebuds are currently craving, including vegetarian. Everything we had was good. A few favorites, though, were Patatas Bravas con Alioli, Albondigas, and for dessert- Crema Catalana.All of the bartenders and servers we dealt with were very nice and helpful. They seemed to enjoy their jobs, their coworkers, and their customers, which is quite refreshing!This was probably our favorite restaurant of the many we visited in London. So enjoyable! It will be a must visit when we come back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKm1rwtlp11o_cOq4UtqJg"
  },
  "51KkBL7-j9aFpGNzSsE3bQ": {
    "date": "8/30/2018",
    "text": "I wish I had found this place on my earlier trips to London Great food, central location, nice environment inside. The staff was friendly and helpful with suggestions.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1638pjC1Xwcq4PIfvdFE5A"
  },
  "L7ILMYu1qR2YLlBkr0HeGg": {
    "date": "12/27/2017",
    "text": "Decent tapas place.Their grilled octopus was delicious. As as the crusted prawns. The bruschetta was okay and the bread with tomato paste and ham was not particularly good. The green salted peppers were excellent. The beer selection is a bit lame and the service was decent but not great.Still a decent place for a reasonable price.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMBGIYFzuVWnxR86NzKVIQ",
        "caption": "Photo of The Port House - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gMBGIYFzuVWnxR86NzKVIQ/o.jpg"
      },
      {
        "img_id": "AP--g8606_SQSI3hseHnWg",
        "caption": "Photo of The Port House - London, United Kingdom. Tapas menu (front)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AP--g8606_SQSI3hseHnWg/o.jpg"
      },
      {
        "img_id": "565sTgOqo2QQOs2UZzbQFQ",
        "caption": "Photo of The Port House - London, United Kingdom. Tapas menu (back)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/565sTgOqo2QQOs2UZzbQFQ/o.jpg"
      }
    ],
    "user_id": "1Iv3fyJSC5qk1zpzhPUdWA"
  },
  "U5B8r7_ecgdJ63_FL5dALw": {
    "date": "10/1/2018",
    "text": "Loved it, great ambiance and food and wine were great. We had the croquettes, chiparones, prawns, and stuffed peppers. All amazing. Also really enjoyed the red port flight. Don't judge by the look of the place outside, the inside is a pleasant surprise",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg5FSz-KOiYxZD_o5_B4_Q"
  },
  "lEYoAKnvu5Jw07hGQ462CA": {
    "date": "7/25/2018",
    "text": "Great little gem of a restaurant, breaded shrimp and garlic shrimp plus tomato bread and salad. The staff was friendly and the atmosphere really inviting, just a little cramped though. I recommend this place for a fun meal.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwBlTdqJBJDbveOesS_fmA"
  },
  "IK583Jw82y3ZEPd9qy1K8g": {
    "date": "7/5/2018",
    "text": "Excellent food with carefully balanced flavors.  The atmosphere is intimate and romantic, with pillar candles on every table. Order the creme brulee for dessert; you won't be disappointed. We will be back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lwkelZMgAIWvQBS3C5tkWA"
  },
  "8JM2UgODgLhFSr74pKLhUg": {
    "date": "11/6/2017",
    "text": "Went to the Port House for our first visit to London. We like the idea of tapas so we could share numerous dishes. We had the Piquillos Rellenos con Espinca which was red pepper stuffed with spinach and shallot cream filling. It was the best part of the meal. We also tried the Octopus (Pulpo la Gallega) which brought the rating down to 4. It was very tough although the spices were tasty. We also had the Tostas de Habitat y Feta which were veggies and feta served on toast. It was very tasty. The wine selection was great and the service was very good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FM3hremwwIZCDmqlkUm-fg"
  },
  "YukijVsj6cLtTY41aHJ3DQ": {
    "date": "11/14/2016",
    "text": "This is exactly the kind of place you hope to find when you're walking around in London after everything else is starting to close.  The food and drinks are excellent, the servers are friendly, and the atmosphere is quiet and intimate.We worked our way through several courses of cured meats and cheeses without finding anything we didn't like.  They've also got a flight of ports for those unfamiliar with the drink (like me).  Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "srRV6cQqV3ZD_Q_prcjkWA"
  },
  "AgY3lVxBOwVOB0KsaG5dAA": {
    "date": "6/3/2017",
    "text": "The best place we ate in London without question. We enjoyed many tapas, wine, and I had a Hendricks gin and tonic with cucumber. The food and drinks are top notch. We've eaten at many fine dining, tapas, and wine bars across the US. The Port House tops them all. Sorry Julian Serrano. Because of our Texan accent, the waitress misunderstood one of the dishes we ordered. They took care of it without question. Don't miss The Port House whether you're traveling here from abroad or a local.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hweW0Xj8DLnLMHtd0Qo9uQ"
  },
  "_XMu-pPFAVPGVSym5SLt0Q": {
    "date": "10/18/2017",
    "text": "Great atmosphere and a wonderful selection of wine! I wanted to like the food more than I did. It wasn't bad but it wasn't amazing. We ordered crispy pork belly, calamari, steak toast, black pudding toast, the croquette sampler, and creme and chorizo stuffed peppers that were lightly breaded.  The chorizo peppers were definitely the best.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vQGRJ9uCoD0KjzhDQtqc2w",
        "caption": "Photo of The Port House - London, United Kingdom. Croquette sampler",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vQGRJ9uCoD0KjzhDQtqc2w/o.jpg"
      },
      {
        "img_id": "r87Eu7Tcj8dX86c8MRd0Yg",
        "caption": "Photo of The Port House - London, United Kingdom. Calamari",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r87Eu7Tcj8dX86c8MRd0Yg/o.jpg"
      },
      {
        "img_id": "yTCita_OWU-78yS0bClp0Q",
        "caption": "Photo of The Port House - London, United Kingdom. Steak toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yTCita_OWU-78yS0bClp0Q/o.jpg"
      }
    ],
    "user_id": "OgN4idEKRHFRBuTZ2yqCGA"
  },
  "SUIMcS3QsPaHlAa7duRg4g": {
    "date": "8/2/2017",
    "text": "ATTN ALL:  Do not pass this one up. Incredible food, incredible drinks and Incredible service. Our first night/meal in London. Fabulous find and leaving full, warm and HAPPY. Affordable Tapas and a welcoming atmosphere. Great music and conversations all around, but at the perfect volume. Lucky to get a street side view upstairs!!  I think I'm in love.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_UcdloU9guDHVs0Y8oRaag"
  },
  "MQYYDtjBFxQL509pUjU0Cw": {
    "date": "8/25/2016",
    "text": "Great times can be had at The Port House. It's an awesome place to take a date, or just catch up with a friend. The inside will make you think you've been transported to an old wine bar somewhere in Portugal or Spain. With plenty of tapas to choose from, tastings of Port, a pretty extensive wine list, and even a menu of different types of gin and tonic, I'm sure you'll find something to eat, drink, and be merry about.We started with some peppers, a cheese plate, and some jamon, and didn't need anything else after that, but we were convinced to take a look at the dessert menu. Sure, why not. It's totally ok to split something, right?The Portuguese pie (Pastel De Natas) was incredible, although the waiter said next time to definitely try the Churros Con Chocolate - not sure I'll be able to resist!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "bqKmPP3nPycZvMBpDrVJxw"
  },
  "taVh999Uy7aTr45XjYfdNw": {
    "date": "9/12/2017",
    "text": "Perfect place !! Love the brick walls. Love the tapas, just small enough to have space in your belly to try everything. And I tried many plates, all to my taste and size. Will come again and will recomend to everyone I know.  ( If I was to open place on my own it would be something like this )",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7V3oM9fyw0rvuBbQeEkQA"
  },
  "IYQFA75H9kIw4cfLHiTjxA": {
    "date": "7/28/2015",
    "text": "I can't even count the number of times I've passed by this lovely place and thought... I should stop by in one day.  My husband and I had some time before meeting friends for dinner in Covent Garden so thought it was FINALLY the opportunity to check this place out.  It's quite a narrow place but definitely bigger than you expect it to be.  It's quite good for groups of 2-4 but probably not more.  They had a great wine selection but interestingly enough felt more Spanish rather than thinking it was more of a Portuguese place.  Really nice place - especially getting the vote of approval from the Spanish husband!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C1WsGwpZzMxKJSKsDwlDPw"
  },
  "TE8ELCj191mMc52VUzDxrQ": {
    "date": "5/9/2017",
    "text": "Tapas were delicious - would go back just for the ricotta/spinach one! We had some great spanish wine with a mixture of tapas to share. Great experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hV-ud83BXVvpctT04CfYaw"
  },
  "InYTKV1UY531axaQE6VSRg": {
    "date": "10/28/2017",
    "text": "Strongly recommend it for the wonderful tapas. We also enjoyed their desert hugely, particularly the butter scotch ice cream and chocolate fudge.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYVpNsmjZQquNDT7llNgWQ"
  },
  "oummHIf5Eq8kZISk8vlNPw": {
    "date": "5/23/2016",
    "text": "Food was great, the atmosphere was great, service was terrible, and they got one of our orders wrong. All I wanted was to try that damn Manchego sauce and went 0/2 on getting it. Holy shit the Portuguese custard pie dessert just enlightened me a bit",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Ows2YXVTHvPOQOTLhgwTQ"
  },
  "d1CnwhZ34NwM9pTUkxVjig": {
    "date": "2/1/2017",
    "text": "This used to be one of my favourite restaurants in London. I'm not sure if it's under new management, but today the food was severely below average, people who walked in 10 minutes after us got food before our order had even been taken, and the manager was exceedingly rude to me. Will never go again. This place believes it is much more than it is.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Nj-E_I5eA0FTptJmBZbaw"
  },
  "GcPTxDcYdvo8j33bmG2L_A": {
    "date": "5/22/2016",
    "text": "Cozy atmosphere. We went later in the evening and the restaurant was around 3/4 full. The servers were a bit rushed taking orders but I'm sure that's because of how busy they were late in the evening. We started with a couple glasses of wine and a gin+tonic (one of their specialities). Drinks were delivered promptly and they took our orders. The food started arriving shortly there after and the entire table agreed on just how delicious the food was. The pork belly I'll highlight was awesome. Crispy outside and amazing taste. The seafood and other meat dishes are equally as tasty. We ordered a second round of tapas. And finally desert, the churros and creme bruele. All around a most enjoyable evening and a great value including the 5 drinks and cocktails, food and desert. Would recommend without hesitation.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSITBUczTDlUO2M0VpeeuQ"
  },
  "DN_dbDYX7AEfY73rBFdgng": {
    "date": "10/11/2015",
    "text": "I'm a fan of the gin drinks (served in balloon glasses) and the calamari. The mushroom and chicken croquettes are very tasty. I found this an excellent establishment to catchup on some email in a charming atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0Y7P42DgCjCN4gOHpL91Q"
  }
}