{
  "7D4VjB-0gbsvJ_fU79nsgA": {
    "date": "10/15/2014",
    "text": "Very pleased at the service at Micky's. I When a friend and I from Sweden popped in for lunch we expected fast food type fish what we got was nice big fresh tasting cod. Not sure if that is the usual for fish and chips places but I have no complaints. The food was hot, fresh and just plain good.Not fine dining by any means but truly delicious and when I am eating a fast lunch all I want is something that tastes good.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_soNJR2wGGsj9LPQb0heQ"
  },
  "ADQ_1IgZBWKsT_-w9R2jNw": {
    "date": "4/30/2014",
    "text": "I stopped in this little fish shop before catching a train from Paddington Station, and I was glad that I did. The fish was very well cooked, perfect texture, and breading was crisp and light. The chips were perfect cooked, light and tasty. Price was very reasonable and well worth it. I will definitely be stopping in again! Definitely recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dx6iClLEbs5OlgrozXegbw",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dx6iClLEbs5OlgrozXegbw/o.jpg"
      }
    ],
    "user_id": "bBmcdqGkoI8qpl032yrUEQ"
  },
  "sMdnkjhxaQblSo7-vQmEuQ": {
    "date": "2/15/2015",
    "text": "Okay, to say it's been a while since I've actually been here is to put it mildly. The last time I actually bought their fish and chips was in the summer of 1978 when I was studying at the Stanford university campus in England, which was nearest station served by trains that came out of Paddington station.Al I really remember is that the fishing trips are great, but you had to eat them while they were warm.  They wrapped them in the London Times, Lord have mercy on anybody and let them cool down so the grease sould coagulate.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kWwK-RkzcZwdXz2L7NmiZg"
  },
  "pYwtDDn2O3567Dns7wQleg": {
    "date": "11/28/2012",
    "text": "Wow. I like this chippie. Nothing spectacular, just good food, good portions and good prices. If you're in the Paddington area this is recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WnQYZu3YdLzCXmhEpfQgDA",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WnQYZu3YdLzCXmhEpfQgDA/o.jpg"
      }
    ],
    "user_id": "l0cy8SVCUhRaJh1J-O2hBg"
  },
  "eILRnCHBO2E3j4p_02nPJw": {
    "date": "5/7/2012",
    "text": "As a vegetarian with a fish phobia, I've been in way too many fish & chip shops. While I can't really testify to the main dish, I can say that this joint is simple, clean and has ample seating.  It's also ridiculously cheap. Vegetarian options are borderline laughable but not absent.  They have a vegetarian burger, which is one of the McCormick (I think) patties made out a bag of mixed frozen veggies and potato.  On a bun.  That's it.  They also do eggs, and of course there are peas and beans and chips.  If you're looking to take visitors for this quintessential meal at a culturally-appropriate venue, you're not going to have gourmet vegetarian food, and what they offer is really just fine. Plus, you can't be too mad about your patched together vegetarian dinner when the whole shebang costs £3.20.I've taken two groups of visitors here and they were both big fans.  They said the fish tasted fresh and mild and the batter was crispy and tasty.  My mom said that the fish she had here was unquestionably way better than the Rock & Sole Plaice, which was probably three times as expensive.Service is friendly but venue-appropriate.  Go up to the counter to pay (and you can order up there straight away if you know what you want).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gf1UQyDGfNI_xfoxqItpmw"
  },
  "nMEw0Hsknyq-7Cu0s3T1pQ": {
    "date": "5/25/2011",
    "text": "Cheap and cheerful!  Often packed with regulars and the odd sneaky hospital worker munching on sinful goodness.I was with two friends, and they felt rather peckish before an event.  Not having much time, we dived in from the rain.  They ordered fishcakes, cod, and chips.  Knowing I was going to be eating elsewhere that night, I was reluctant to order anything.  My plan was just to sit there and watch, willing them to eat faster so we wouldn't be late!However, the (very reasonably priced) food came, and the waitstaff took a pitying look at me.  My friends were feasting, and I had nothing in front of me.  He ran away quite quickly, and before I knew it, he returned with a large plate of free chips and set them in front of me!Now that is thoughtful and good customer service with a personal touch.  Double thumbs up.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 6
    },
    "photos": [],
    "user_id": "Wat-EbSRqNzmr61Jz8XaJA"
  },
  "y2WSD41RqUbLB9jj2sIp1w": {
    "date": "6/27/2012",
    "text": "So went here with pretty high hopes but just wasn't as good as the other chippers we've been. The service was friendly but the crispness that you want in fried fish just wasn't there for us. They were very sweet when we ordered coleslaw and they were out offering to pop down to a different store and get more if we wanted to wait a few minutes. As much recognition as they have, perhaps it was just an off day?",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1amzGJ1lnJB1tBmWP9QeOw"
  },
  "KMGJzznSmYisKDn6pW75FA": {
    "date": "9/13/2014",
    "text": "Not a fancy place but they have very good fish and chips at a good price. check them out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yGaiD5vhA--N4j48jcfAVA"
  },
  "ban8JWI0-dn3eVmuzG6kXw": {
    "date": "2/5/2014",
    "text": "Great place to grab a quick snack or meal. Always has been fresh crispy and tasty. This is always on of the first places i stop when I'm in the area. It is a bit out of the way but it's worth the walk",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XP_vxDI5ZOYjSDPIEZLeDQ"
  },
  "S7IHb8-VEzI540jh0eWY6A": {
    "date": "4/1/2014",
    "text": "Fish. And Chips. And beans and peas and OJ. The little chippie shop around the corner, nothing fancy, does its stuff right. Just the right bit of greasy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2rKE0odPNpGUtlqx4W1kwQ"
  },
  "bIfz9DXKi1P2OzG_I4Jwzw": {
    "date": "2/16/2011",
    "text": "My friend's and I were visiting London and staying at a hotel in the area. Relying on public transportation and walking to get around, we probably passed by this restaurant a hundred times. The smell of fried food wafts out of the restaurants doors, and on a cold day, it's impossible to resist the temptation. We must have eaten here two or three times over the course of the week. Each time the food was hot, crispy, golden brown and delicious. Service is what you'd expect from a small-divey-order-at-the-counter-hole- in-the-wall fish joint and the prices are very reasonable. If you're a tourist like we were and staying in the area, I recommend this place.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EHjp3-183IXI-sC0yluZwg"
  },
  "7kbEMvvFLTukyTkcgg7wag": {
    "date": "12/13/2012",
    "text": "i shudder at the thought of fish&chips.  it usually tastes too fishy and the texture makes me want to vomit but i thought i should try some while i was on holiday.i loved micky's!  so crispy, so fresh and totally not fishy!  their portions are ridiculously huge.  i couldn't even finish everything since i was full quickly.  i am grateful for yelpers with their positive reviews.  definitely did not let me down.i will definitely head back here when i visit again.  staff was friendly and service was quick.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEHeL7n8wsz6OZWzZvzmpA"
  },
  "m34T7AQkmFTkM0aKCx877A": {
    "date": "9/26/2013",
    "text": "Came here by chance after visiting a friend at ST Mary's hospital. Small eat in or take away cafe style. The person serving is nice, not so smily but was helpful in choosing what to order. The Fish is really good and the chips are huge portions. I found this one of the best qauilty and fresh fish and chip shop in the area. The cafe is not so comfortable seating. Good value for what you get in Paddington. If I am in the area again I would come by to Micky's Fish bar.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dzzen8H6n0FR-y_5hR5-9w"
  },
  "Y35zrxuA1r-te88KpnuiDA": {
    "date": "4/24/2014",
    "text": "Was looking for authentic fish and chips during my time in London and read the great reviews about MIcky's. As it was only a block from my hotel we walked over and ordered some food to go. A large order of chips, cod, and scampi. Everything we ordered was cooked perfectly and was absolutely delicious. While you might walk right by this restaurant without even knowing its there (right across from st. mary's hosptial) I highly recommend going inside and grabbing a bite to eat. I was not dissapointed and was happy to get my fish and chips from Micky's!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqfQFRAD19LdEp63-3qAQw"
  },
  "z6Vpjzk0qBqh5XFil6knCQ": {
    "date": "9/23/2011",
    "text": "I work just across the road from this chipper and can say it is really very good! Chips are real potato chips, nice and fat with crispy bits.. mmm....curry sauce on the side is lurvley for a Friday Lunch treat;-) Recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "GS8WLnKBUO6hlD_Iww22Gw"
  },
  "GVUyrSDKRsIuxqMbNk6Bgg": {
    "date": "7/10/2012",
    "text": "Fish that I ordered (cod) was dry. Tasted as if it's been sitting under the heat lamp for a while... and this was right after they opened at 11am!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgyfES0ybcm-TkwoZtlkHQ"
  },
  "8bHm3qk48mMpnav4AJi8ow": {
    "date": "10/9/2011",
    "text": "I love this place. Whenever I pass by, I get a kebab-Meat N Chips!! I finish every scrap of food. Im hungry just thinking about this shop. Remember! Get the meat and chips, ask for garlic sauce and lettuce and get a cold can of coke. BINGO!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mE386ef9P4nt-EQPn-ljog"
  },
  "YiQgp_C5hnk315xuLFT0Tw": {
    "date": "5/16/2013",
    "text": "I have not had any better fish and chips anywhere in the UK. They have a few tables, but also do a large take away business. Fish is fresh and tasty and the batter is crispy. Perfect! Located about a block from Paddington Station. We have eaten here many times on our various trips to the UK.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "21_JsUl32YN_arROhOvBng"
  },
  "zr4w_vN9V8VoCOG7m5nJuw": {
    "date": "5/14/2009",
    "text": "The hotel concierge recommended this place when my boss asked for a fish and chips place. (On the way to London I'd been chanting, \"fish and chips\" and got him thinking about it too.) The coolest thing about Micky's was that it was a neighborhood joint. It was a small, hole-in-the wall type joint with just a few tables. Locals came in and out in their jogging clothes. Kids were there with their friends. We sat in the corner and had our fried haddock and chips and talked about work and camping trips. The fish was a bit on the cool side (like its been sitting out for a while) but the chips were piping hot. The food was AOK (it may be blasphemous to say, but I like the fish and chips at...OMG... I can't remember the name of the restaurant we always go to for lunches back home... what the heck... anyway - the fish and chips there... oh and we had some good ones in the center of London at a place called the Red Lion a couple of years back) but the experience of eating at a neighborhood joint was fun! And we even got some McDonald's coffee on the way back to the hotel (I dropped the ball and didn't search for the nearest Starbucks when I got here...)",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1xmifaySPgPpD47xBvqzsQ"
  },
  "Z-FH8eflKdGkMf3O3t0ckA": {
    "date": "5/22/2018",
    "text": "A few observations:1.  They insisted on making my order fresh after I ordered - already they stand out because they care about quality and freshness.2.  Everyone was polite and thanked me for my order - customer service is important to them.3.  The cod literally melted in my mouth and was beautifully moist and flaky while the skin was nice and crunchy and fresh.  Very high quality product.4.  The mushy peas and curry sauce were flavorful and delicious.  It didn't take like some microwaved crap like most chippy places have.5.  It wasn't too greasy like most chippy shops.  It must be the flavor of the oil, it tasted nice and light.Also, the place was extremely busy so you know they have a good reputation.  I like this place even better than Kerbisher and Malt and it is half the price.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kQek0Ft9uFPRuxP9Z3g5-A"
  },
  "V1rtK5dfaUh5c8_ya1wb9g": {
    "date": "10/9/2018",
    "text": "Fish was overcooked, fries were unimpressive, mushy peas were not included.  This is a typical touristy fish and chips place pedaling overcooked fish at an overbooked price.  The counter service left something to be desired, and the guy at the register overcharged me.  The lady cleaning tables was friendly, nice, and quick and brought condiments over when she realized that I did not have any.  This place was empty when I walked by, and I can understand why now...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_qq4WiJgaxgmdclopDXvw"
  },
  "nP5L4YNMkLPMXGL6XBBHCQ": {
    "date": "3/13/2018",
    "text": "We made special arrangements to visit this place, due to my friends previous visit a year ago and it's BBC award. However, things have changed for this Paddington Fish and Chip shop. The venue was clean and renovated recently. The waiter was quick to serve us. We ordered Haddock and chips with a diet Coke. Within minutes the server had our order and regular cokes. He quickly changed them to diet when we corrected him. I started in on the fish, it was definitely cod. It lacked the flavour haddock has. My friend asked if we could have tartar sauce and the waiter brought one small dish for three people. The chips were perfect, crispy on the outside and soft on the inside. The table did have malt vinegar which is a plus. But this place did not live up to my other stops and this was supposed to be the best of London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "t_xjVte-iQ77znLAo6vKdg"
  },
  "p_pK9EcSURkmEbi5_S-DDA": {
    "date": "7/12/2018",
    "text": "I'm not a fan of the fish and chips here it's a good size, but it just costs a lot and the drink portion was small.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6ahy3NzHOjdPf7U8mTsuw"
  },
  "XV3Y9NtlPOzRE6mmS7m6FQ": {
    "date": "7/19/2018",
    "text": "very fresh and affordable. i think they also have very good chicken too. i wished they also served beer.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhy31enUUtFTHc1u7znwDw"
  },
  "ThYHI-51jOGwbAQBjIjDKg": {
    "date": "11/19/2016",
    "text": "After a rather disappointing experience at the Garfunkles just around the corner, I decided that I would go and check out some other place to have a bite to eat. Despite there being a few options around Paddington I decided that the best option at this time would be a traditional English fish and chip shop. Okay, I had had plenty of fish and chips in the various hotels that I had visited but I was really interested in seeing what their basic fish and chip shop was all about. As it turned out it wasn't bad, though it certainly wasn't like any of the fish and chip shops that I have experienced in Australia. Sure, they have takeaway, but not to the extent that that have at home. Rather it was more of a sit down restaurant that specialised in fish and chips. In the end it wasn't bad - not fantastic, but not bad either.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8qhKK4HIQdd3geCL8mzqvQ",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8qhKK4HIQdd3geCL8mzqvQ/o.jpg"
      },
      {
        "img_id": "J1uumWdmm4kBZBATEZjdzA",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J1uumWdmm4kBZBATEZjdzA/o.jpg"
      },
      {
        "img_id": "88TP172-ixMrBhNm9b1Jwg",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/88TP172-ixMrBhNm9b1Jwg/o.jpg"
      }
    ],
    "user_id": "DY6s438vFKfblXEWxG0S1g"
  },
  "PQAHVFvD9hZDgj8hKVKnfQ": {
    "date": "5/22/2016",
    "text": "Saw good reviews on this fish and chips place in the neighbourhood at a reasonable price. When I walked in the decor was not outstanding. The server greeted us straight away. We ordered the special of 6 pounds. You get what you paid for, the size of the cod is small and the batter was not tasty. Instead of soft drink for the special you can replace with juice or water which u liked. We sat there for a little while and didn't feel rushed.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GzgEo5Fy1thls7BBfrKFUA",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GzgEo5Fy1thls7BBfrKFUA/o.jpg"
      }
    ],
    "user_id": "obijr6vOAPxzhkwzS957yA"
  },
  "omFs3HX8C-AZkxt9Fa3hIg": {
    "date": "6/21/2017",
    "text": "although I don't live in England, I've eaten a fair amount of fish & chips. this place was just okay, but one of my British colleagues seems to think it's great so maybe I'm missing something. it's certainly a good value, £10 for a plate and cold drink is pretty good for lunch. staff isn't friendly, but not rude either. might come back for lunch, but tbh, fish & chips isn't at the top of my list of food choices, even in England",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "jj7qARHi2gfTZY87v2RQsw"
  },
  "01G4YZdPvmaeLe34KZHtrQ": {
    "date": "5/20/2017",
    "text": "I literally just finished my food so I can offer a fresh review. I was pretty excited to eat here after reading the good reviews. As I walked in, the servers seemed a bit rude and rushed. I decided to sit down to eat.I ordered the Micky's fish platter. Although the menu says it includes peas and bread, I did not receive them with my food. After I asked, the server brought me the bread but not the peas. I know I could have asked again, but like I said, the servers seemed rude, and I really shouldn't have to ask twice for a part of my meal.As for the food, it was alright. Honestly, most of the food seemed frozen and the taste was unremarkable. I was just surprised because the reviews were so good. Overall, I probably wouldn't eat here again. If I did, I would iust stick to basic fish and chips.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXd7t8-acvzETrmInXtP2g"
  },
  "2FXTMDbRWKSfvM93uJVUVQ": {
    "date": "8/7/2017",
    "text": "I thought this was a great place. Wife and I had cod and chips which was an enormous amount of food, we should've split. The kids had nuggets and chips and the chicken was fantastic. We thought they portions were very adequate. Service was a little rough but they made up for it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8km5dF7fDXZqIkmnB-oGYQ"
  },
  "o6MTaI0rfJfF4NEK5ruQWg": {
    "date": "11/13/2015",
    "text": "It's an inexpensive, typical chippy located in the heart of Paddington. I had a massive craving for fish and chips and one lunch break, I slipped by to check out this place. At 5 pounds for a small cod and chips, I was very impressed.The chips were ok, not the best, but thick and like proper chipshop chips should be. The fish was beautiful really flaky and delicious, my only criticising is I wish there was more fish and less batter.. But only a minor grumble...",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uMHPyAV1WCldrP22pTDuCg",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom. Fish and chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uMHPyAV1WCldrP22pTDuCg/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "zyszAJRCr6IXkcaFnxIn1A": {
    "date": "10/4/2016",
    "text": "Micky's has been on my f&c list for years,  I visited on a much more frequent basis while staying in the area years  but since I make my digs in Redbridge (about 90 minutes by underground) it's a schlep. I will stop when in the area but I wouldn't  make a special trip it's not thattt good. The fish is usually served hot and tasty with not to much of a grease level and chips are also pretty good. One thing I hate are the plastic  portion packs of sauce. The service is fast and hassle free.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xca3XaX66luta0w6XLqbxg"
  },
  "f37J-4vW_ih3XDE8TyfZNw": {
    "date": "7/31/2015",
    "text": "I used to eat here until I came down with a bad case of food poisoning that I attribute to my meal at this place. I have never been so ill and feel that this place stole 5 days off my life. My advice is do not risk eating here.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ocBn-fcF2f5Ap77hQkzlLg",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom. I won't eat here again.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ocBn-fcF2f5Ap77hQkzlLg/o.jpg"
      }
    ],
    "user_id": "peSdYAXVxiUKhcO0NECPBA"
  },
  "iwAnocdXqLDDfdEcl6tdoQ": {
    "date": "12/9/2017",
    "text": "perfect place to go and get a heart attack. if you are going to serve this bad oily stuff at least make it fresh.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qoVOmSLRkQ9v-IkxVrktQ"
  },
  "XGXZV3UgGh2eBKWxNxr2hQ": {
    "date": "11/26/2013",
    "text": "It took me a while to get to Micky's because it's located all the way out in Paddington... not very central. Due to the long ride there, my expectations got higher but I was quickly surprised by how grungy the place looks. It's actually more like a stall, where there's a bar to serve food and several little tables to eat. It's not the place to impress guests or to sit down for a while.But for the inexpensive price, the food was not that bad. You get a big piece of fish and it was delicious, but you don't much else. Tartar sauce is served in a little Heinz packet, which kinds of makes the food seem like fast-food fish. Quality fast-food fish. Just keep your expectations in check... this is something quick and easy so if you're in the area and want to get something fast but good, it would be fun to swing by.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "E4a5uCdnnTGUahABx8kXHg",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E4a5uCdnnTGUahABx8kXHg/o.jpg"
      }
    ],
    "user_id": "M1Lt6xzFriw1p2fzbGIVgg"
  },
  "mvCdQ5PBTlXfjoG8yLSN4g": {
    "date": "7/10/2016",
    "text": "This was my first taste of London and I swear I hit gold! The fish was incredible the perfect combination of batter, crisp and juicy. I recommend 100% a must try spot!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-9KYbg6JvyWeSqZhZ_DCfQ"
  },
  "NnrzW0wEgHtHZF1bTcGK1Q": {
    "date": "3/1/2014",
    "text": "The decor, as many other folks, is pretty plain. Solid colored walls, some paintings of fish, wooden tables that stand on their own and chairs you can sit in. Each table has salt and pepper (in different style shakers) and some vinegar. There's also a standup menu on each table as well. I should've looked at that first before ordering. There are dine-in specials. Being a bloke from California, I wasn't aware if that's par for the course.I got cod and chips. It was fried and oily, but not overwhelmingly oily. Kudos to the batter that they use to fry the fish (they use groundnut oil). It wasn't overly thick, making it possible to really get an overall similar temperature throughout the fish and fried part. The fish was also flakey and didn't have that \"old fish in the freezer\" taste, which is pretty common.Fish, while good, lacked seasoning. I had to add a little bit of salt. It's like it lacked any kind of fish flavor completely.The chips were also of a good temperature and not overly oily. The way they were fried, however, did not leave them to be very crispy. They definitely weren't soggy, but I always expect a delicate crunch to my chips/fries.Service was questionable. Man behind the counter was staring off into the corner of the building and didn't address me when I walked up to the register and said hello. It required a second hello for a response, but he still didn't look at me until I started getting out my money. Odd, that.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MH35_LP9UvWWEiiyXocqVQ"
  },
  "IuUV7VCu1N8jp3Gmh0VRFQ": {
    "date": "1/25/2015",
    "text": "Good place not bad prices the fish was really good nicely fried and had a nice crunch to it. The chips were good but I wish I had more of the fish. The restaurant itself was really clean and the guys behind the counter was nice. I didn't quite understand the piece of bread with butter on it. It literally was just a piece of bread with butter on it and to me looked rather pathetic.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mbwBdJMENyHMldLl5gkgEg",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mbwBdJMENyHMldLl5gkgEg/o.jpg"
      },
      {
        "img_id": "nidkVehRMEu3vdfq3TFX5w",
        "caption": "Photo of Micky's Fish Bar - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nidkVehRMEu3vdfq3TFX5w/o.jpg"
      }
    ],
    "user_id": "eHaNR6IWBQTBeZy9IrfgfA"
  },
  "7AEEGGVa3WZryILc7zi9JQ": {
    "date": "10/13/2014",
    "text": "Went last night to after an abortive attempt to leave the pub, went on Alex S's recommendation when it turned up on Yelp. It's a simple chippy and filled the bill as to  a place to grab some food. Fish was hot and served quickly, and seemed for the most part to be made to order. The specials were good and a decent amount of food for the price, the big platter coming with cod, scampi, whitebait, prawns and calamari along with chips and a drink for £8. My friend wasn't impressed that when asking for an orange juice, he got a juicebox in return, but all in all I think we were satisfied. I think we'll still be on the hunt for a post sunday skate place to eat but this will do in a pinch.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "ToGxQEmwIfRdoPo9YMnUAQ": {
    "date": "11/24/2014",
    "text": "This is a no frills place but the chef cooks up a really great fish platter. Portion is huge and food is really fresh. Delicious stuffs they make here! The signboard says that they've been featured on BBC, I believe it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Orj8ngg5u5Hu128G1Wv4bQ"
  }
}