{
  "SwiwvVqxiDt7f-uqXAcwfA": {
    "date": "5/23/2017",
    "text": "Such a simple breakfast, but so so good! Came here the morning after landing in London and was pleasantly surprised. My boyfriend and I arrived slightly past 8am on a Saturday morning, but there was already a short line. The place is CASH ONLY, so be sure to have some on hand. While in line, we started chatting with a frequent customer here who recommended a couple of typical English breakfast items that were good here. Bubble and Hash which is basically mashed potatoes with cabbage and black pudding which is basically blood sausage. Although black pudding doesn't necessarily sound appealing, it was actually very good as was everything else. We both got the breakfast deal which included bacon, eggs, toast, choice of beans or grilled tomatoes, and choice of tea or coffee and added all of the extras to share including hashbrown, mushroom, bubble and hash and the black pudding. The breakfast was so simple, affordable and delicious that we made it back here TWICE during our 4 day stay in London. Definitely recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfGeUthaBCFIHjkMRn6zAA"
  },
  "B6Bjl2QBpyn-iIQ3hNbF7A": {
    "date": "9/26/2016",
    "text": "I'd heard a lot of good things about Regency Cafe, enough so that I made it a priority to go during our London trip.  We chose a morning when we had a Buckingham Palace State Rooms tour planned since the cafe was roughly in the vicinity.  Yes, there was a line, but it moved quickly.  The small woman with the loud voice wasn't there, but the owner was, a very pleasant if rather no-nonsense guy.  We got our two set breakfasts, one without eggs but with toast, the other with hash browns and bread.  The slabs of buttered bread were ENORMOUS; I couldn't even begin to finish them even though they were very tasty.  I love English breakfasts so I enjoyed the food, but if I must be honest I had just as good food in other places.  If I were staying in the area I'd be hitting it up every day.  If you're not in that area, though, there's no need to go out of your way for it.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ErrIKOGmp1jC1EBfEapyAQ"
  },
  "nrY2N_zZ7n_vv1Wlk7JMSw": {
    "date": "2/28/2016",
    "text": "Proper greasy spoon breakfast hidden away in Westminster (tables and chairs bolted to the floor and everything).Great value, tasty food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G0412JLaiwFvS7msE-6BaQ"
  },
  "KpBUDOJF0cvMEwaIsEluUw": {
    "date": "6/8/2016",
    "text": "The real diner experience. IN LONDON. Basic simple place, don't expect grandeur, but good food and best bang for your buck this place has. MASSIVE meal sizes for wee prices. Most impressive thing about this place? The lady who takes your order's VOICE! Loudest voice ever that booms like a projected announcement for the whole world to hear (Necessary, when it's bustling and for you to hear your order is ready over the surrounding conversations and noise). Once you get used to that, you won't get distracted from your food and won't have to halt your conversations with others anymore. Note this place only takes cash!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Qnrq6N5x10bToGqjIrtIPg"
  },
  "N1GHiCy5hoEg1CflUnrSzg": {
    "date": "5/13/2016",
    "text": "Having worked a short walk away from The Regency for over 7 years you'd think that I would've been here more than twice...but you'd be wrong. Today was my second visit to this brilliant cafe. A cafe so brilliant that you have to get her well before 12 to miss out on the massive queue out the door.We arrived around 11:50 and had to wait about 20 mins to order out food. The rule is that you order before you sit down and this rule keeps the tables ticking over nicely.The lovely lady at the counter is a bit Jekkyl and Hyde... Very polite and softly spoken as you're ordering but a booming \"builders cafe\" voice when calling out the orders ready to be collected. This all adds to the great, bustling atmosphere.One this occasion I opted for the Set Breakfast (egg, 2 bacon, sausage, a choice of beans or tomatoes, a choice of bread or toast and a choice of tea or coffee) with beans, bread, extra hash browns and black pudding and a cup of tea. I was disappointed that I had arrived too late for the bubble and squeak. All meals are customisable for a price so you can pretty much combine most things on the menu as far as I can see. It took less than 10 minutes before I heard \"Set, beans, hash browns and black pudding\" hollered from the countered and I was sat down demolishing a brilliant all day breakfast. All the ingredients are high quality, nothing tastes cheap and you're guaranteed a full belly at the end of it.I will always come back to The Regency. It may take me 4 or 5 years between visits but I love it today as much as the first time I went.Oh, and did I mention that a rather famous scene from the film Layer Cake with Daniel Craig was filmed in there...?",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "VF3-orqv6RY8eEB1zM42Bg"
  },
  "Snt4EwhgErWh0AmVsgn8Wg": {
    "date": "7/19/2015",
    "text": "Has every right to be considered an institution.It's one of London's most famous restaurants yet seems to refuse to cater to the hype.  Excellent food made with *love* with a truly authentic atmosphere.  Avoid prime meal times to avoid frustratingly long lines.  One star off as they don't honor requests for the eggs to be cooked scrambled (this is the only way I eat eggs, and Ive never heard a restaurant downright refuse to make them this way.)A must-do in the West End!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-oKGuwxcN2YIa1TFAfsXtA"
  },
  "Eut4EwQOS6jTNnyJS-yCHg": {
    "date": "10/22/2016",
    "text": "Hearty meal, no nonsense. Yummy and filling!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbn_cQdVX97SEg1qNtP69A"
  },
  "AqQlwUxwVSM73ZlZXN20-Q": {
    "date": "9/28/2013",
    "text": "Finally! I've had Regency Cafe on my bookmark list for ages, but since it closes at 12 on the weekends and I like to sleep in, it hasn't happened... until now and boy is it worth it.I can understand the 12:00 close for breakfast. They seem to have a constant queue of customers craving an English brekkie and have it timed perfectly as they seem to run out of food at just about noon. Upon arrival, the queue seems a bit intimidating, but it's one of the most efficient queues I've seen in London. The main guy takes your order, fixes your drinks and makes the toast while also yelling out orders for pick up and doesn't miss a beat. He knows exactly who's ordered what and obviously has rapport with repeat customers. If you're a local, it's the place you want to be on a Saturday morning.And then there's the food. It's simple, but it's delicious. I had 2 eggs over easy on 2 toasts plus sausage and hash browns.... REAL hash browns, not potatoes, hash browns. Hit the spot, perfect fry up, and definitely worth waking up early for.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aQO7q11zicTDHjknhV8wRw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aQO7q11zicTDHjknhV8wRw/o.jpg"
      }
    ],
    "user_id": "nOQlGpgqq2MBCuEzxLMm4g"
  },
  "hc5b0CLi7H08-nFUMB3jhg": {
    "date": "10/26/2013",
    "text": "The quintessential English cafe - perfect.Traditional cafes are a dying breed, all too often shunned in favour of a chain coffee house churning out lattes and pastry. It's a real shame as when they are this good they surpass any other breakfast on offer. For six quid the full English, complete with bacon, sausages, egg, beans, tea/coffee and bread/toast is out of this world. I'd recommend adding the homemade hash browns for an additional 90p. As in all traditional cafes the coffee is crap so stick with the tea.We were so stuffed afterwards that we had to walk our bikes for half hour before cycling back across town. I'm still full now 4 hours later!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XxEPdjP-GuLt7ff0UfJ3ew",
        "caption": "Photo of Regency Cafe - London, United Kingdom. My mate Pottsy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XxEPdjP-GuLt7ff0UfJ3ew/o.jpg"
      },
      {
        "img_id": "6G5OAbZs-RF9IENnUBro4w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Amazing amount of food for 6.40",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6G5OAbZs-RF9IENnUBro4w/o.jpg"
      }
    ],
    "user_id": "vqw44UwJzI2DbhduLexI3A"
  },
  "6wuX1jo2QywsveD7rNWxDA": {
    "date": "10/8/2015",
    "text": "More happening than the great revenge scene in Layer Cake - solid fuel for working people. Had no issue navigating the engaging cafeteria ordering scheme - it was a great experience and the food was on point. Orange yolks are signs of quality sourcing! Well worth navigating to when in town.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rlhse3-nVp1AasnejDcXWQ"
  },
  "mf9DCQSFRqffOjoZfu31JA": {
    "date": "10/3/2013",
    "text": "This is the UK version of the Seinfeld's Soup Nazi. The queue is out the door, everyone knows the process, and no matter how hard you studied the tips on yelp, you feel the pressure of having your S@&! together by the time you reach the counter. Organized chaos. As you wait in the queue rehearsing your order in your head, you look around and people watch, and you can't help but think, why doesn't he just ask for your name like Starbucks ? Moreover, you start thinking, how am I going to get a table for 8? Somehow, it just happens. The micromanaging type A behind the counter is making it work. Mushroom and onion pie with beans and chips were our orders. Kids ordered spaghetti bolognese. Family was happy and it was the perfect place for our first meal in the UK. Arriving at 12:30 was rush hour, but by the time we left at 2, you could have your choice of seats. Yes, even the one where Daniel Craig filmed his role.  If you have that friend who takes forever to order, this place is not for them. If you want to Baptize your way into the British cuisine, this place is a must. Great to pop our cherry, First Meal in UK.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Djp1AgwSG-gd8bq9V1ftiA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Queue out the door at 12-1:30",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Djp1AgwSG-gd8bq9V1ftiA/o.jpg"
      },
      {
        "img_id": "dBalsghk4FlMEZJjCYGR4Q",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Classic British  !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dBalsghk4FlMEZJjCYGR4Q/o.jpg"
      }
    ],
    "user_id": "8MCPA2HbOLScDu80ptHHjQ"
  },
  "ydxiBg4cBUa4WBTnAM-rcw": {
    "date": "1/15/2016",
    "text": "This place is an absolute gem.In the last two weeks my colleagues and I have been in here five times, and are gradually working our way through the menu!The breakfasts are great as you would expect as are the puddings.Today as it's Friday we decided to go for fish and chips. It was 10.45am but who cares!Now normally I am slightly cautious about ordering things like fish and chips from a cafe ie not a chippy but this place is something else. It was honestly some of the best cod I have ever tasted, so fresh and perfectly white. Very good.The place has a wide spectrum of customers including tradesmen, office guys and the odd tourist who has read about it.The prices are freakishly low and the service is friendly and efficient. These guys seriously know what they are doing!If you have any sense give your usual boring chain coffee shop a miss and come here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBARxR-X1xykTlrEmkRzDg"
  },
  "8IdtvEgmk4DGpJXEuHJ7-g": {
    "date": "2/8/2015",
    "text": "Tourists!  Here is the system at Regency Cafe (from the viewpoint of another tourist):1.  Wait in line.  Don't worry, it will go fast.  Also, while waiting in line, do not worry if you don't see an open table.  There will be an open table by the time you order.2.  Order from the person at the counter.  You should probably order the set breakfast.  If you do so, you will have three choices: (1) coffee or tea; (2) beans or tomato; and (3) bread or toast.  You also have the option of adding on hash browns, bubble and squeak (basically hash browns with additional vegetables), or black pudding (you don't want to know, but you should be eating it).  If it's Friday, consider the fish and chips.3.  Pay the person.  In cash.4.  You get your coffee or tea right at the counter.  There are also napkins on the counter.  There is silverware in the tray to the left.5.  Find a table.  I told you there would be an open one.6.  Admire the old school ambiance.  British Vogue loves to shoot here.  There are pictures to prove it.  Read testimonials from fancy chefs who sing the praises of Regency Cafe.7.  Check out the patrons here, who are from all walks of life.  Regulars, tourists, blue and white collar.  Even the fancy ladies of Burberry headquarters, a block away, can be spotted here.  Probably hungover.  But wearing badass shoes.8.  If you ordered toast, this comes out first.  The person at the counter will bellow when the toast is ready.  Her voice is loud.  You should hear it.  Walk up and get it.9.  Likewise, when your food is ready, the person at the counter will yell out your order.  In the US, the person taking the order usually yells out the order to the cooks; not so here.  Here, the yelling is directed to the customer to get their food.  Your food will be distinguished by whether you chose beans or tomato, and whether you added anything on (e.g., \"SET BREAKFAST, BEANS, BLACK PUDDING!!!\").  Walk up and get it.10.  Eat.  Happily.11.  Trundle home and take a very satisfying nap.12.  (Optional) Write a Yelp review.",
    "rating": 5.0,
    "rated": {
      "useful": 31,
      "funny": 25,
      "cool": 14
    },
    "photos": [],
    "user_id": "-6Zx1EfDAK0L1vitjeZIvg"
  },
  "LoeZk58tZQqqIq8FDuscSw": {
    "date": "5/28/2013",
    "text": "This is the place to go for breakfast, especially if you are coming in or out of Victoria Station. Was visiting London for a day and found this place since it was close and was pleasantly surprised upon entering to find a wonderful atmosphere. The menu was wonderfully priced (for London that is) and all the food was amazing. I got the traditional English Breakfast for about 5 pounds and fifty pence which included baked beans, an egg, sausage, bacon, tea, and toast. Then I also got three hash browns for an extra 90 pence (which were definitely worth it!). I am definitely making a point to come here next time I can get to London!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GgXwgy-2kS4oN4MfBUMNCg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Storefront",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GgXwgy-2kS4oN4MfBUMNCg/o.jpg"
      },
      {
        "img_id": "tNyDdGtHmYp36KoUPOAygw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. 5.50 includes bacon, sausage, beans, and egg (Tea n' toast not pictured). Hashbrowns are an extra 90 pence and a must.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tNyDdGtHmYp36KoUPOAygw/o.jpg"
      },
      {
        "img_id": "1o8RhsgNpbwRmGujqf5z3A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English Breakfast for two complete with Earl Grey tea",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1o8RhsgNpbwRmGujqf5z3A/o.jpg"
      }
    ],
    "user_id": "8QKL_d5jq4s8RbwW4Uo09Q"
  },
  "sRYHnMGPMzoWBx3p5tzBEQ": {
    "date": "4/23/2015",
    "text": "There can be a long queue at Regency Cafe sometimes, but the line moves pretty quickly. You can also take the opportunity to see what's on the menu while waiting in line. There is a lot of variety here, from hearty English breakfast foods to small snacks to lunch meals. I waited about ten minutes in line, and ordered the sausage egg and chips meal.( As a potato enthusiast, chips are an absolute must for me when it's on the menu) My food came out in less than five minutes, and everything was hot to the touch! Tables are immediately bussed after people leave, making seating inside a lot quicker and easier.  The food was great; portions were huge and I definitely left with my stomach full and satisfied :)",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "P311xYbFhtiJ5wOszKwdrA"
  },
  "lXC17wdZu-hg0wDaBYySvw": {
    "date": "9/21/2015",
    "text": "Staying about a block away, this is the sort of spot you hope to find on holiday. It has a very local vibe and ordering can be intimidating, but I felt it added to the charm of the place. We got the \"set\" breakfast, traditional English. Everything was spot on. Going tomorrow for the pie.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G_ogPSyiQvJbt5QdR5mgqQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G_ogPSyiQvJbt5QdR5mgqQ/o.jpg"
      }
    ],
    "user_id": "TZvCNLYiQjvj4XTuRSVAjg"
  },
  "1oMQtvqRcVDwt2pbRQ6Uzw": {
    "date": "7/13/2016",
    "text": "So this place is one of those joints that when you are walking by, you see a line out the door. It's an incredible experience with great breakfast food and the line didn't take too long. Also, the lady who runs the place has the biggest voice I've ever heard. Go just to hear her call out your food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5UzVDYAoJSax6GcQGFy8Q"
  },
  "RMgXggyRv6IKtcGJnQe0ag": {
    "date": "2/21/2014",
    "text": "YES! Go here, breakfast is good, not too expensive and did I mention it was good? If you're in London, go to Regency Cafe, have breakfast and walk it off to the typical London attractions which are a fee minutes from Regency Cafe.The place is small, so be ready to wait for a table if it's full. I got there and ordered the full English breakfast, there were some tables open, as soon as I got my breakfast it started to get packed.I would love to go back and have more breakfast at this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yXTBlf0HTpz16ephA0TkNA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yXTBlf0HTpz16ephA0TkNA/o.jpg"
      },
      {
        "img_id": "70zLkEH39qPi-ZaSW8Dj_A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English breakfast with hash browns and black pudding added, those are extras.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/70zLkEH39qPi-ZaSW8Dj_A/o.jpg"
      }
    ],
    "user_id": "BG75RcNfDSFbRjSthSELUA"
  },
  "Zj1fdv8YsY5HmG3ecgUesg": {
    "date": "2/22/2015",
    "text": "The main woman here had the loudest, most impressive calling out voice I have ever heard. You have to hear it to believe it and it's worth going for this alone. Went here with a big group of colleagues for breakfast the other day and can say that this place is probably best suited to smaller groups of 2-4 since the tables are all fixed in place and you can't move them together. But still had a good time and the place had the right sort of good morning non-nonsense vibe to start the day off right.What everyone else days is also true: HUGE portions of unhealthy food, reasonable prices, really fast service. Not quite sure why this place is so popular (and had no idea it was a tourist spot??) but it does have some sort of je ne sais quois that makes it special.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "T40u1FJXOOYs3rmOnwGm6A"
  },
  "M1sbMB4OMr5ttSfsU7mkZg": {
    "date": "7/20/2015",
    "text": "I almost have no words to describe how good this English breakfast is. we walk in, and the place is full of cops eating breakfast..a good sign! a full breakfast is around 7 pounds and we paid extra for hash browns (worth it). get your coffee and toast before you sit and make sure you pay attention and get your food when it's called, it comes out quick! you must go here for English breakfast, more than once if you can. If I ever return to London, this will be my first stop.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wekoBbbxJz2GRTepRnDsfw"
  },
  "0_jRV5JgLL-v1Xx1ZHOcbg": {
    "date": "3/7/2017",
    "text": "I always wanted to go to this cafe because of the movie Layer Cake(what an underrated movie). Nevertheless get there early(but there will still be a line). We got there about 9 and by the time we left at 10:30 the line was atleast 50 people deep OUTSIDE. The line inside moves  quickly and I was impressed that the small staff handled so many people so efficiently. The man who was the manager/order taker/owner was so impressive with how he was so fast yet so kind when it came to ordering. The breakfast was so good! I will certainly everytime I come to London go to the Regency Cafe for breakfast. P.S. It is not that far(walking distance) from MI6.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "a6yo7I61A8RM5auM2zStTA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a6yo7I61A8RM5auM2zStTA/o.jpg"
      },
      {
        "img_id": "4UBDeOjM2IQshCwyNVde3g",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4UBDeOjM2IQshCwyNVde3g/o.jpg"
      },
      {
        "img_id": "wB1yZdNBLtUsbHnWlOtUDg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wB1yZdNBLtUsbHnWlOtUDg/o.jpg"
      }
    ],
    "user_id": "2QSXSNngsLskRD3zib7YHQ"
  },
  "W8mGDDSObxCHg4gf7pjd4w": {
    "date": "6/14/2017",
    "text": "This place is the place to get a proper English breakfast! It's affordable and close by to Buckingham Palace. So if you decide to visit the Palace you might as well stop here for breakfast.  A breakfast special included 1 egg, 1 sausage, 2 bacon slices; a choice of tomatoes or baked beans, toast or bread and tea or coffee! I opted for baked beans, toast and tea! It was so freaken good! I added hash browns for 90 pence and blood sausage for another 90 pence. In all my boyfriend and I spent 15 pounds for breakfast! This is practically a steal! The interior has a retro dinner feel and lots of locals come to this diner. The owner was nice and the food came out quick. Tip: order first and pick up your own food. Free seating.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "59fdOHR5ZUQSdK6aJ6WVvA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. 1 egg, 1 sausage, 2 bacon, baked beans, hash browns and blood sausage.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/59fdOHR5ZUQSdK6aJ6WVvA/o.jpg"
      },
      {
        "img_id": "msCt-gXEdExLxTg8p0krWw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Proper English brekkie",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/msCt-gXEdExLxTg8p0krWw/o.jpg"
      }
    ],
    "user_id": "G4eUAMP3bANRVAczmOJhkQ"
  },
  "wafuao6jdsaWc5nG3vrtSA": {
    "date": "4/28/2017",
    "text": "First the loooong line, then the rush to put in orders, then the search for an open table, then the unbelievable timely freeing up of a table, then the loud yell to come get your order ...and then the prize - huge portions, just as you like it, very tasty and satisfying breakfast ...All worth it ...Loved it! And note, this place is cash only!!!!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_RCIigvozRT1CPs_L1UgeQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Eggs, sausage, mushrooms, chips, beans on the bottom, scrambled eggs, bacon, sausage, tomatoes, mushrooms, beans on top",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_RCIigvozRT1CPs_L1UgeQ/o.jpg"
      }
    ],
    "user_id": "n77a8pr9OK4uBxyKulF2zw"
  },
  "tGlR4H7r49q0zxGkbzo6Rg": {
    "date": "5/5/2017",
    "text": "Delicious full set breakfast - super cheap. Fun local neighborhood and a very welcoming host/owner. This is a MUST go if you are in London. You won't find a better full English breakfast anywhere - especially not for £5.50!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4FQjXSj7gn7UgV-G-v6aRw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4FQjXSj7gn7UgV-G-v6aRw/o.jpg"
      },
      {
        "img_id": "WWh6A4-hWFFipeeVeazKyg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WWh6A4-hWFFipeeVeazKyg/o.jpg"
      }
    ],
    "user_id": "6KUinM1BcoD_ozvFSPSevQ"
  },
  "RXr-ZT67YxNjTArSdIuNKQ": {
    "date": "12/1/2017",
    "text": "This was our first time in London so we wanted to try out some fish and chips. It was amazing. Fresh cod and the fries were good. We also had the breakfast plate which was pretty tasty. Great tea. Although the line was long it went by pretty quickly",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIIZnshVQU2923hFl-Umcw"
  },
  "G2vyRMUPjgb2PQ8VNYXcGQ": {
    "date": "7/22/2015",
    "text": "If you're visiting London, you NEED to stop and eat at Regency Cafe for brunch! I'm not a local, but I wanted to try this place after reading all the reviews raving about this \"authentic London institution.\" I couldn't agree more!The line was out the door, but moved quickly. The older man at the register was taking orders, cashiering money, expediting food, and pouring coffee all at once! He even called out our orders by name! Even though the environment seemed rushed, he was still attentive enough to make sure I got my toast, coffee, and juice :)I split the full English breakfast (7 pounds) with an extra order of hashbrowns, bubble & squeak, and orange juice! I'm American so I've never tried bubble and squeak before (baked potatoes with onions in cream?), but it was pretty bland and heavy. The sausage was really yummy though, not too fatty--and I'm not even a fan of sausage. The bacon was salty, but it tasted good with the soft egg and crispy hashbrowns.It's also walking distance from London Victoria train station!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "V8jW-sfZErqLsgscUTzd2g",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Everything was delicious, but you NEED to try the fresh orange juice and homemade sausage!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/V8jW-sfZErqLsgscUTzd2g/o.jpg"
      }
    ],
    "user_id": "a2sRVwRBfmgrIafe9NXpzA"
  },
  "1iaf2kUZVZucuw6V29HF1w": {
    "date": "4/30/2017",
    "text": "When we decided to visit London, we decided to see the sights and not plan any meals - instead, we would simply consult Yelp when our stomachs started growling, and take our chances.  And that's how we wound up at the Regency Cafe.  I love diners, and Regency Cafe was exactly what I wanted.  A diamond in the rough, a great little art deco cafe in what appeared to be the middle of nowhere.  I ordered the standard English breakfast with eggs, beans, peas, bacon and toast.  Although the bacon was a little on the salty side, eating it with the toast solved that problem.  It's difficult to screw up an English breakfast, so it would be unusual for someone to make it great or to fail at it, so what makes the breakfast at Regency Cafe worth it is the atmosphere.  First, there's Marco shouting out everyone's name to pick up their food from the counter.  Then there's all the photos of Tottenham Hotspur players on the wall, but I let that slide since they have just as many Muhammad Ali photos on the wall too.  It wasn't too crowded when we ate mid-morning, so there was no difficulty finding a booth and getting great service.  The crowd consisted of some business folks, a few construction workers, and some regular joes having breakfast.  Since I love diners, I thought it just reminded me of other 50's era diners from the U.S.  Then a few days later, our cabbie told us the movie \"Layer Cake\" was filmed there.  Of course - a pivotal scene from that movie just made it more awesome!  We didn't have time to visit a second time, even though we tried, but I made sure to rent Layer Cake when we arrived home so I could relive a great breakfast at Regency Cafe.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhKPTru9Av_lP5OfNMbc4A"
  },
  "NTBwETE4xAozcPsT69w-rg": {
    "date": "8/2/2016",
    "text": "I am constantly looking for reputable places to eat especially now that my parents are here visiting. This restaurant was close to their hotel in Pimlico, plus gave us the ultimate English Breakfast! Between the three of us, we got two breakfasts, and my dad (who is super picky and insisting we only eat fruit), loved the experience and food.Our total was 13.25 (ordered an extra drink and had a tailored vegetarian plate), so for less than £5 per head you get a very satisfactory breakfast. I give four stars as the food and coffees/teas were bog standard. This is definitely a great staple restaurant.Note: construction is being done on the pavement right outside the restaurant; if you want some tranquility, or even a warm, bustling atmosphere, this is not the place at the moment!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "blvTUoOZmi1vvRFBuy8PUg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Veggie breakfast: roasted tomatoes, baked beans, hash brown, mushroom, bubble and squeak, and of course a fried egg!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/blvTUoOZmi1vvRFBuy8PUg/o.jpg"
      }
    ],
    "user_id": "3miraQMHj70ioXXPXZ8krA"
  },
  "vpzMX8pofleDeToWH8pMpw": {
    "date": "6/6/2018",
    "text": "I will never look at breakfast the same again. Top notch at a low price. The only other breakfast I've had that beat this one cost x10 the price (not exaggerating!)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_cNmZO8WlZOEM7Q7bVquw"
  },
  "Uk15HqNnvuP2IA-UnST6Rg": {
    "date": "9/29/2017",
    "text": "Highly recommend Regency Café! The service was EXCEPTIONAL! I was visiting from California and I wanted to try something new which he was a little worried I may not like because American corn beef isn't the same. I ordered the set breakfast with a half side of corn beef. When I was served they made it exactly how I imagined it in my head lol. Everything we had was delicious and their orange juice, is a must have.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "JKq4PiiQL5XP42_uG_hR5g"
  },
  "zvOfNbQ4vYe1AsyRSw7poQ": {
    "date": "1/19/2017",
    "text": "**Tip: CASH ONLY!**Definitely a must-see if you're in London! A classic British breakfast experience, featuring: charming diner atmosphere, long but fast-moving lines, cheap and large portions, and a woman behind the counter with the most impressive booming voice shouting out orders. You can eat a full British breakfast for just around 5 pounds - definitely a steal. I recommend adding on hashbrowns and bubble & squeak (vegetable mash). Don't be disheartened by the long lines -- it moves quickly!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZQl_Og7b0u7HFHmnA-BZJQ"
  },
  "-6cpQQaExYXTOY-bHOxCbA": {
    "date": "10/18/2017",
    "text": "Husband and I went here for a quick breakfast during our trip to London. Such great food and the prices cannot be beat. With much research we always made it in early to beat the crowds. We changed it up a bit every time we ordered and so far most items on the breakfast menu was amazing. Try out that orange juice in the glass bottle. It's delicious.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bwHV8GXIGls_qCWBgF7WHQ"
  },
  "AhQJVxpo7bLydrxTTM7SVw": {
    "date": "4/18/2017",
    "text": "A neighborhood gem of a diner stuck in the 60's and 70's. And that's a good thing! Feels like a place that Rocky Balboa would feel very comfortable in. No nonsense menu, but also friendly to tourists. I feel as if I finally had an authentic English breakfast here. Had the set deal of the day... 1 sausage, 2 bacon, 1 sausage, tomatoes (or beans), toast (or bread), and tea (or coffee) for 5.50. Not bad at all. And bubble &squeak for 90p on the side. Seems like a good deal for 6.40 pounds.Highly recommend. Cash only, as previously mentioned and no wifi.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l2xLHGnrQ6lyjncUgX2pIg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l2xLHGnrQ6lyjncUgX2pIg/o.jpg"
      },
      {
        "img_id": "DSQNinsGCrbIgNqPwm-0cA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DSQNinsGCrbIgNqPwm-0cA/o.jpg"
      }
    ],
    "user_id": "2e6qllm70lpRutyiyrr1ew"
  },
  "QbPubNaTld8AgvLaBCovGg": {
    "date": "10/17/2016",
    "text": "We came here just right before the lunch crowd so we're able to get a table in a few minutes right after we order.They have quite an extensive menu ranging from breakfast to daily specials. We've all ordered the full English breakfast set at £5.50, a pretty good value consisting of two toasts with butter, two pieces of bacon, baked beans, sausage and a fried egg. Hash browns are add-ons. This place is different from any of the other usual cafes. They are not packed with tourists only but a good balance of locals too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kdf0rRonRaEVUEzU_ZnrnQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kdf0rRonRaEVUEzU_ZnrnQ/o.jpg"
      },
      {
        "img_id": "1Os378La2OgVpi7vK8jcIw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Os378La2OgVpi7vK8jcIw/o.jpg"
      }
    ],
    "user_id": "n12OUy0T4NlgEKH0MB3BVQ"
  },
  "cwdVda4qASq6kbhrme0NcA": {
    "date": "10/29/2017",
    "text": "Excellent full English breakfast at unbelievable prices. Make sure you know what you want to order when you reach the counter. This is a no nonsense cafe that is run with military-like precision. We loved our breakfast and we found the cafe absolutely charming.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9XMuUjD0LDwF8QAQgLdJQ"
  },
  "X-ismWbi5ncY1SzQbRDAMQ": {
    "date": "6/9/2016",
    "text": "An english breakfast at The Regency is a quintessential london experience.  We came here on our last day in London, and we were so happy that we saved it until the end of our trip.. The ordering experience is different than anything we've ever experienced in North America.  There was a lady who single handling was in charge of the whole restaurant.  She was so efficient in working with the kitchen to get the food out to the customers as quickly as possible.  The diners were locals, the vibe was cool.  For food, we had the broiled tomatoes, hash browns, sausage and bacon.  The only complaint was that the food was a bit salty, but other than that it was delicious.A trip to London wouldn't be complete without coming here, we enjoyed our entire experience.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lBBVIPMvA1wPK9Ysldo26w",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lBBVIPMvA1wPK9Ysldo26w/o.jpg"
      },
      {
        "img_id": "XNrdmRiGYhkumrQvCy3PIg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set Breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XNrdmRiGYhkumrQvCy3PIg/o.jpg"
      }
    ],
    "user_id": "3UY0P5vAPTavFNTqqE2nVw"
  },
  "Bm7X5CESV0XTL5sxRfhDiw": {
    "date": "3/29/2018",
    "text": "Very popular, cash only, and inexpensive.  Order first, then choose a seat.  We stood outside because the line was so long, but it was worth the wait.  The food was cooked quickly and the staff was great.  The curry was great (make sure to eat it with mango chutney!), burgers fresh, and \"pasty\" was light and flaky.  Go there!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCWEmhFVvVgz7Q4Aeq4Pgg"
  },
  "MSUHJkXdzG_mdfxM8f10cw": {
    "date": "10/8/2014",
    "text": "This place is the real deal.Massive quantities of food at a low price.  Piping hot hash browns, full mugs of coffee, more baked beans than you can finish in one sitting.  The decor is vintage and lovely.  The waitstaff are caricatures in themselves, friendly and sharp at the same time.As another reviewer mentioned: order at the register, get a seat, and wait for your order to be called.  If you're not sure if it's yours, just go up and ask!This is a great London scene and great food, not to be missed!",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WTlcdZEYN9-IJ7gtXda8-A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast is served!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WTlcdZEYN9-IJ7gtXda8-A/o.jpg"
      }
    ],
    "user_id": "THYpRh7VFqLMOH6w197YlQ"
  },
  "PMVrAselHbdSs6-nUr3Mdg": {
    "date": "1/22/2016",
    "text": "My fiancée and I were very lucky to be staying close by to this place. And since our dollar doesn't go very far here, we were very happy about the wallet-friendly prices they had here. We knew it had to be good when we walked in. Local people everywhere: cops and construction workers abound. The man at the register was quite friendly and the food -- the full English breakfast with hash browns was something I'll never forget. I try to make it back home now but you better bet that when we return to London we'll back!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uzKgxSipSeRHvMxC1Z4r9A"
  },
  "I6G2sOYF5nXUqqfiP_PyDA": {
    "date": "4/28/2016",
    "text": "Has the classic diner and greasy feel, coupled with good eats.  I had the set English breakfast with black pudding.  The baked beans were delicious and the black pudding, to my surprise, was on the money - crisp on the outside and not too strong of a flavor.  It was only £5.50 plus £0.90 for the black pudding and it included either a coffee or tea.  My favorite part, aside from the food, is the feel of the shop!  The cashier is a really friendly person with a loud voice.  It makes for an enjoyable experience and definitely authentic diner restaurant.  Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDqapHpalzHTd-wWvAb86g"
  },
  "EbEyIhK8g3akek2F5so0mg": {
    "date": "7/6/2013",
    "text": "Really really friendly and helpful staff and yummy food, even for vegetarians!  I am very happy we went here. (Cash only, no bathroom.)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U1fYcbo-hRYKm4gIrVqz2A"
  },
  "Yp6NtXpy6hCNZYolno3mHg": {
    "date": "8/5/2015",
    "text": "We had a full English breakfast at Regency Cafe this morning. The cashier wasn't as brusque / mean as Yelp reviews led me to believe, but he did raise an eyebrow when we ordered to go because we were running late to get to Westminster Abbey. I didn't get the near-religious fervor that seemed to surround this place; the food was just okay, as expected. It wasn't bad for what it was, but there's only so much one can do with bacon (not the thinly fried slices we're used to) and beans. I ordered a side of black pudding as well, which was okay.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAUllOqzhwuKQoys5h5odg"
  },
  "GsedcmkUkNpqukfzx3DxxQ": {
    "date": "1/12/2011",
    "text": "Great breakfast deal and the most perfectly cooked eggs I've ever had.  Delicious all around, and I wish I could have eaten here every morning.  Make sure to order first, THEN sit back and enjoy your delicious English breakfast amongst the businessmen, local police, construction workers, and students.Not sure why it keeps being referred to as a greasy spoon.  This is not your Phillips 66 gas station diner.  I've eaten at my share of greasy spoons in the states and unlike those diners, Regency's food has finesse.  The eggs were prepared so perfectly and delicately I could've photographed them for Food & Wine.  The wheat bread was so fresh and grainy, I could've eaten the entire loaf by myself and had my boyfriend roll me home.",
    "rating": 5.0,
    "rated": {
      "useful": 10,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eUaBnG-cdLRsLJNou8Qslg"
  },
  "B6b0wa13DVlyfTz039m4DA": {
    "date": "3/3/2013",
    "text": "No frills, working class cafe. Just good food and BOLD service. You'll have to go here to see what I mean about that. :)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Lj88Y_78VbCBWSe1Yxctg"
  },
  "LvoaUX0yxAJCWIVtshiX1g": {
    "date": "6/8/2014",
    "text": "Delicious local place in London. Good coffee and delicious chips! Omlette was also good!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgUJWQkPejak8JXqFi03_Q"
  },
  "0XvjLNzYeAh8qyCP8LZ4PA": {
    "date": "9/19/2015",
    "text": "looking for a place for breakfast? this is THE place.we had a very traditional English breakfast - eggs, sausage, toast, coffee, bacon for two only £10. We wait about 20 minutes on the line and it was worthy! Marco, the owner, is amazing!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tRrJ6aGUbFF65xDfg5TWgg"
  },
  "27R1MvFzs9G9gmbs2VvIHQ": {
    "date": "12/7/2013",
    "text": "Absolutely fabulous! Best full English breakfast I had in all of London! And such a reasonable price!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WEo__Lap_3akg_Na9zdyTQ"
  },
  "RfpZi90vi9wW8x1dY41i7g": {
    "date": "6/25/2013",
    "text": "We walked like 30 minutes from our hotel to get to this place because it was so highly recommended.  (There's a newspaper clipping by the register that says this place is one of the top 5 restaurants in London.)  Um.... ok.   I can attest to the fact that London has some pretty freaking amazing food, but if this is in the top 5, I am seriously confused.  Perhaps I don't understand the \"English Breakfast?\"  Perhaps this place just has the best \"English Breakfast\" in London?   All I know is I'm an American for whom American brunch or diner food is the gold standard of breakfast dining, and this was definitely not either.   It was definitely an experience and had a lot of charm and character and was a great value.  It just wasn't mindblowing and was really the kind of food you could make for yourself  on a Sunday.  In London.  Or anywhere else.  Confused in America.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cxE_WzaaI0ThcYfczt2x8Q"
  },
  "MbQTnhbUkBPKCtqFFyuHwg": {
    "date": "1/31/2010",
    "text": "I am so glad someone introduced me to this cafe. The line was off putting at first, but then you saw how it all just flowed like clockwork. The line may be out the door, but by the time you order, there is a table waiting for you. This is not a place to dine, this is a place to eat. Even during the work week, people can have a nice greasy fry up for lunch - and they do! The petite woman behind the counter cheerfully takes your order and then in an amazing turn barks it to the kitchen in a low register with a full use of daiphragm and projection. If I can find the video, I'll upload it.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "RIzRaqOBNUrJxpNQXzTp0A",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RIzRaqOBNUrJxpNQXzTp0A/o.jpg"
      },
      {
        "img_id": "f11xJQcdaB5TW7lkSZQqfQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f11xJQcdaB5TW7lkSZQqfQ/o.jpg"
      },
      {
        "img_id": "p36RcWAQdO_WvOvghYQZfw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p36RcWAQdO_WvOvghYQZfw/o.jpg"
      }
    ],
    "user_id": null
  },
  "runJjEve-hISFK5c9qLidg": {
    "date": "8/16/2014",
    "text": "The wife and I really enjoyed the Regency's breakfast- definitely worth checking out if you're in the area!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bXZcpIbmiIFeOPaFE9Ge1g"
  },
  "pU47YNvHO9XmxKpSacHrcQ": {
    "date": "1/26/2013",
    "text": "On our trip to London and Berlin, it was tough to find good local (cheap) eats that didn't involve something from Asia. This place was kind of a sweet spot for getting some authentic British food. We took a little walk from Big Ben to get there, but it was well worth it. A couple of tips: dont sit before you order and eat and get out. They are generally really friendly, but operate like a well oiled (greased?) machine to keep the food going and the tables empty during lunch hour.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "tpxVjgV1yCatoIR-IFtBwQ"
  },
  "bW8LrC-58tir-cZ01ofeXQ": {
    "date": "3/30/2013",
    "text": "My mate and I were wondering around Regency Street when we noticed this nice restaurant. We had the English and you would think that its the same everywhere you go, however this place adds something special to it. I don't know what their secret is but it was delicious",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qsgFvCdWQ91wEHyG3nnv4g"
  },
  "MF3hMzsZP492AloyvKTchg": {
    "date": "6/5/2013",
    "text": "There is always a long queue but it's worth the wait. Once you have finally reached the counter where you can place your order, the food comes quickly. The scrambled eggs are light, tomatoes and mushrooms are well grilled. The atmosphere is friendly and the setting interesting.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Od5Paa7dAJ1O-valwIungA"
  },
  "4AIvsEX_4Ulm8aXalx4JNQ": {
    "date": "6/12/2015",
    "text": "A highlight for our food experience in London.  Basic food but done well and the prices are very reasonable.  There was a line but it moved efficiently and the restaurant was timely cleaned for new patrons.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY2_wSs2i3G3rbuhUtsDsw"
  },
  "tkEWiJSnZ7Byb09LjRmk_Q": {
    "date": "5/12/2013",
    "text": "Came here for breakfast early in the morning and we ordered the set breakfast deal (2 bacon, sausage, tomatoes, toast, and tea for 5.50 euro) and egg, 2 bacon, mushrooms, and bubble and squeak.  You order your food first then you find your table.  I liked the diner feel to this place and when your order is ready, they just yell out what you ordered and you go to the front to pick up your food.  The bacon they use is different from the states.  I definitely like London's bacon better.  We also thoroughly enjoyed \"squeak\", it's basically potatoes and bell peppers.  It was oily at all.  Usually potatoes are cooked with an immense amount of oil at diners.  When we ordered the eggs, they didn't ask us how we wanted it but I was glad it came over easy.  They were cooked perfectly.  Lots of locals come here in the morning and a line had been forming while we were eating.  Despite eating this meal early in the morning, it was so filling that I wasn't hungry until 2pm.  I would definitely recommend this place.  It's a corner restaurant so it shouldn't be too hard to find.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "HEncape8aii836Zf6pO9Iw"
  },
  "ToKn4szDeOhD2RtyytiPug": {
    "date": "8/4/2010",
    "text": "I am a huge nerd and had to come here because Layer Cake was filmed here. I had NO expectation about the food and thought that it would be just a greasy diner type of place. With that out of the way here's what I thought...This place is incredible. I got there around 10am and it was packed. Soon after I ordered there was a line out the door and it didn't slow down during the 45 minutes I sat and enjoyed my breakfast. I ordered the breakfast special, also my first full English breakfast. I received a HUGE plate full of baked beans, 2 sausages, an egg, 2 large strips of bacon, and 2 pieces of toast. I was a little scared of the baked beans at first but then I dug in and found that the mixture was delightful plate of heart stopping greatness! The sausages were something different, I can't really put my finger on it but it was almost if the filling was breaded or something...probably the best breakfast sausages I've ever had. I thoroughly enjoyed everything on my plate then sopped up all the leftovers with my toast and downed the rest of my tea. This breakfast really made my day and in fact I didn't have to eat anything until my dinner later that night, which is a whole other story (Fifteen London). I'm so glad that Matthew Vaughn introduced me to this place in his movie. Now I'm stopping in on every visit I make to London.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "J26T-evEh24F-1b8ukGoCQ"
  },
  "9Ey7XiBFIvtZ9yP8hVN2ew": {
    "date": "9/21/2012",
    "text": "My first and only true English breakfast.  A bit on the saltier side but I liked it.  It is nothing fancy.  It really isn't that much different from what you might find in the U.S.I liked the chill old school atmosphere.  Supposedly many films and commercials have been shot here.I was expecting it to be crowded but it really wasn't crowded at all.  I definitely recommend coming by for breakfast.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "owR6ag12ApME7gl5BgURsg"
  },
  "Q-7v9sUhiWDts0guOJdI_w": {
    "date": "7/9/2015",
    "text": "Great set English breakfast in a no-frills cafe. My husband got a burger he really enjoyed. Good service, too.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YxFcHVxR8l3fMsqxGmJyHQ"
  },
  "y7Wj29deeDTevw9KVgMMtg": {
    "date": "5/11/2015",
    "text": "Good food, great experience, very reasonable prices. We got there around 7:30 in the morning, so we didn't have to wait long for our food or at all for a table. It's clearly very popular with locals, which I always take to be a good sign.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "--HCNwho-zAc2Unwhp4vpg"
  },
  "67VlZH1CBi8sWH6vuF_kZA": {
    "date": "12/10/2012",
    "text": "Classic greasy spoon fare, and I mean that in the best possible way! The food is tasty, plentiful, and really well priced. The usual range of pies, full English breakfasts, and they're all good.If only this were nearer work I'd probably go there every day. It's like taking a step back in time when you walk inside.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8EGzwVEXVjVxOibEBnJTyA"
  },
  "BIyP9tijtA9yfgRfh2JMpA": {
    "date": "12/2/2015",
    "text": "It was one of the best experiences I had in London. Breakfast was amazing and the atmosphere was perfect.  It's a local place with local food. We had \"special breakfast \" for like 7$. Will keep you full for the whole day:)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUi7fWJdqbaPQ0Fs6HtmmQ"
  },
  "EDn8TJZmu0wGraszoKmN3A": {
    "date": "3/26/2012",
    "text": "This place is awesome, If you want a home cooked meal, or Just simply good food.. this is Your place, came here 5x during my 3 week stay, Just for the breakfast alone.. it was about 1 mile away from 1 aldwych place (My Hotel), about every other day i wood walk to this place. taking different paths. Enjoyed the Walk & loved the food.Any & everyones Fav Breakfast place!!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7Kw8b5_Oaf0moR0SS4FqLA"
  },
  "Mg7YyAqVby02baTUYoKNlg": {
    "date": "9/25/2015",
    "text": "Thanks Yelpers for helping me choose the perfect spot for an authentic full English breakfast! Taking a flight from Copenhagen at 7am, by the time we ended up here it was 12:30. So we were good and hungry. I took tips from all the reviews on how to order because this definitely is not the place to hem and haw at the menu. The line wasn't out the door but there was definitely a wait...beneficial to my husband because he had to absorb the menu. I did a great job ordering and got the set breakfast, black pudding (which sounds more appetizing than blood sausage), chips, beans and tea with milk. This is A LOT of food!! Hubs got the omelet with chips. So amazing and filling! We walked around London all day and didn't really get hungry until around 9 or so. The ambiance is fantastic! Oh...didn't happen to get my order taken by \"the guy\", but the lady working the desk was super sweet but could belt out an order like a drill sergeant!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gT-qzldqXWVIWEyQKvbrww"
  },
  "4Exvt2dces1dcD4dMS3JVg": {
    "date": "2/25/2014",
    "text": "Just perfect. Regency Cafe does exactly what it sets out to do. I wish there was a spot like this in my neighborhood. Expertly cooked farm eggs with bright orange yolks, delicious English bacon, toast with salted butter, and surprisingly excellent coffee with steamed milk included by default. Oh, and it's quite inexpensive, with breakfast for two coming out to £9.This is the kind of place you could eat at practically every morning. I can't wait to go back.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HWlw6tmDA3qDhHatR_9zfw"
  },
  "EIvvslM0TYyjY5cnXsLFAg": {
    "date": "10/16/2011",
    "text": "Mutants exist and one of them is working at the counter of this fine establishment.As I perused the menu and tried to decide what I wanted, I felt my soul shake, yes my soul.  The woman working behind the counter, clearly using her mutation (because she's like 5'3\") let out a booming call for set eggs, grilled tomato and bacon.  The normal patrons of this restaurant weren't phased but I spotted her from a mile away.I watched her closely as she took my order and asked me in a very polite voice whether I wanted coffee or tea.  I chose coffee and sat down.  Once again, the place rumbled when she called out the next order.When my breakfast finally was ready, I tried to be there and prompt but I picked up the wrong order.  This resulted in her telling me very loudly that I grabbed the wrong plate.  It's not her fault, it's her mutation.Perhaps she's a weird love child of Sebastian Shaw and Banshee?  She clearly absorbs energy, stores it and then transforms it into earth shattering sound waves.The breakfast was incredible.  Who knows what mutant powers lie in that kitchen?  Clearly the place was built by mutants because any normal structure would have crumbled by this point.A war is coming my friends.  Which side will you be on?",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 35,
      "cool": 7
    },
    "photos": [],
    "user_id": "mzL0zHFGyd9866OUljq49g"
  },
  "ESm_dkBJPfP3bY6oPUyOIw": {
    "date": "1/3/2015",
    "text": "Great system at this place and the guy behind the counter taking orders is wonderful. Straightforward and to the point yet extremely friendly and down to earth. Joking with customers whether they be regulars or tourists. We were the only tourists in at that time of day. People from all professions came to this joint for all types of breakfast dishes. I had the traditional set breakfast (2 slices of bacon, egg, sausage, beans, toast, and coffee) all for 5 pound 50 pence. CRAZY CHEAP for close to the city of London itself. Wonderful service, wonderful people, amazing food, and great price. I would go everyday if I could.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LK8MLy8d01vRy3eRer-vRw"
  },
  "aZwaDDIDfLmzmYhIjRrM1Q": {
    "date": "9/15/2011",
    "text": "The rules:1. Order at the counter before you find a seat.2. Now take your tea and find a seat.3. Wait for your order to be called. Listen carefully.4. Go to the counter.5. Pick up your plate with impromptu napkin gloves - it's hot.6a. Listen for your toast to be called (if your order came with toast).6b. Pick up your toast.7. Eat.8. Say thank you if the counter man acknowledges you when you leave. It's polite.",
    "rating": 5.0,
    "rated": {
      "useful": 23,
      "funny": 14,
      "cool": 9
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "IPQJMmuX9-qyYqD0YpPsdw": {
    "date": "3/18/2015",
    "text": "Wanted a nice traditional english breakfast, saw that this place was highly rated, and now i no why! Fast service, reasonable price and HUGE portions and of course everything was delicious.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rbitb_oNoqxMcuPaEs-BmQ"
  },
  "QsagfEFZ25alWxiDPpgssQ": {
    "date": "3/10/2015",
    "text": "Perfect for some breakfast scoffing! YUM! You can't go wrong here!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sin8VS7EfirnLvt-fpIQog"
  },
  "FdOg7YJCbvFuSIiZBGN8JQ": {
    "date": "6/18/2014",
    "text": "Must for anyone visiting London. Simple good grub, inexpensive and a place locals go!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "irwBmBepuB9FCv2IXVvqcA"
  },
  "O2LjDFO-RrQA7T-eeMrw_g": {
    "date": "11/10/2015",
    "text": "Unbelievably poor service. Breakfast with an attitude. The man at the counter is very rude. It wasn't crowded at all. Walked up to the counter after glancing at the menu. Ordered the set breakfast deal and all I got was a blank stare and a \"I don't understand.\" He told me to have a read and asked the person after me to order. After ordering it again I watched as he interacted with other customers. Specific ones he was very friendly with. Telling them to come in and take their time looking at the menu. Other times telling people they could not sit down until they ordered when another group did the same thing but did not get the same treatment. As for the food, it was overly salty and just mediocre. Nothing special. Highly overrated. If I had known I'd get breakfast elsewhere.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMZ1PMoQtsP7pOsvhSyUoQ"
  },
  "4w8rOEm99zUWk4sXAP3RlA": {
    "date": "10/15/2014",
    "text": "I don't quite get the hype - it's good, but not that different from loads of other caffs. Solid, decent, honest food. Probably not worht the wait, to me.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Rb1cZiuhBPILcHxfbInig"
  },
  "aOCQmvhcqCkRcTIPd0zc9A": {
    "date": "7/27/2014",
    "text": "Fast,hot and tasty , what's not to like?...I had a good honest breakfast for a fiver, happy  as Larry, though be prepared for the petit woman working at till, she makes her voice go so low when she shouts out the order it's a strange sight...well worth a visit",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYvjo8AM32y72_IyQJ-9CA"
  },
  "l75AuBonKhzbRfcKIhkq7A": {
    "date": "3/27/2014",
    "text": "We went here twice while in London because it was so good. Much better than pub food and cheap! Get the set breakfast with mushrooms and the bread. I also recommend the buttery bread pudding. It is huge so be prepared to share.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2dm1AtZmAzRwDGVQSR90lw"
  },
  "__0DwiAJcgp30k1ukW5aAA": {
    "date": "1/18/2015",
    "text": "Delicious and low priced. The personnel was very friendly and we got our food quickly despite the fact that it was really full.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Y_PrZpS63OMbn0407MTyA"
  },
  "pbWm3heOJxaugVmi6SoqtQ": {
    "date": "7/6/2011",
    "text": "We who are about to dine, salute you! The Regency Cafe is undoubtedly one of culinary jewels in Westminster's crown. First there's the 1940s original tiled interior, large windows and classic sign, which have featured in car adverts and the film Layer Cake. Then there's the moulded seating, complete with brown sauce, salt, vinegar and ketchup bottles for diners. Next there's the guy who takes your order, politely and respectfully noting your desired dish, and then later proceeding to announce its arrival from the kitchen with a bellowed \"PIE AND CHIPS!\") across the cafe when it's ready. And finally, the food, which is in a class of its own for honest, greasy spoon grub. Two dishes deserve special mention: First, the thick, roughly cut chips, which are deep fried on the spot. I don't know of many other places in London that come close, fish 'n chip shops included. Second, the bread and butter pudding which is likely to be like no other bread 'n butter effort you've encountered before: a collosal serving of approximately 5 slices of white bread with generous amounts of butter, sultanas and cinnamon in between, doused in hot steaming custard. It's quite simply the best bread and butter pudding I've tasted: my colleagues unanimously felt likewise.Prices are impressively competitive too - main dishes don't cost much more than a fiver and the bread and butter pudding a scarcely believable £1.60. It's not surprising then that this place is hugely popular at lunchtimes, with a queue of students, builders and office workers often leading up to and out of the door. It's best to arrive before 12:30 if you can, but even if you have to wait (and to be fair, the queue does move quickly), it's going to be worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "mstoSlPZ3PcjsSR1bdXRcQ"
  },
  "SrILbKBoG6xAIVz-0iCwJw": {
    "date": "3/30/2015",
    "text": "wow. believe the hype. the bacon is the best bacon I've ever had in my life. and the service is excellent....they really care about you as an individual customer!! i'll definitely be going back!!!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "qb9CP95Jvmn509eKEZRHNg": {
    "date": "7/24/2012",
    "text": "This is a great and hardy place to eat breakfast. I like the relaxed diner atmosphere and the unpretentious wholesome food. I had the bacon, sausage eggs, hashbrowns with beans and my husband had the eggs benedict. Yummy.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TEtlCQdTxN08ZLhahXcUhQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Front entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TEtlCQdTxN08ZLhahXcUhQ/o.jpg"
      },
      {
        "img_id": "pJOvZl7grhMDBZxRsBGYhw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Eggs Benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pJOvZl7grhMDBZxRsBGYhw/o.jpg"
      },
      {
        "img_id": "wA4DwFBGsx4n9MqNCOySNw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wA4DwFBGsx4n9MqNCOySNw/o.jpg"
      }
    ],
    "user_id": "eHmlxL9Jme-CvuV5SqQVwA"
  },
  "Vd0108MAWMN9Xp3qvGF_DA": {
    "date": "12/2/2014",
    "text": "I ordered the full breakfast and it delivered exactly as I hoped for. The tea was nice and strong too. Definitely worth a visit if you're looking for some quality English breakfast food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AMTKwBXQhX7cU6qvgNyAAg"
  },
  "wC9RZPZNfxyPxL0Ze_3_ng": {
    "date": "9/28/2015",
    "text": "We are staying at the Conrad St. James and when I asked the hotel for breakfast recommendations they said Regency Cafe noting that it is not a fancy place,  but a great place for a good traditional meal. They hit it on the head with the description. Tons of character. Make sure to try there chips, they are awesome.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pEh5J7ebqcWCezuYPyDPiA"
  },
  "eKKJ8fmZ9TlUql_qcqi1cQ": {
    "date": "6/28/2017",
    "text": "I thoroughly enjoyed having brunch here. Like others have mentioned - it's cash only and you order at the counter before you sit down. The cashier was friendly and is a wonder at multi-tasking. Good sense of humor too. I got the set breakfast (£5.50) and at the recommendation of other Yelpers, added on the hash browns and black pudding (90p each). The food came out very quickly and was delicious! Definitely can pass on the recommendation of the 2 add-ons. I thought the cost of the food was a great deal. And that's coming from a frugal accounting graduate who's been backpacking across Europe for the past 2 months. The diner has a great atmosphere about it, was clean, and the busboys promptly cleaned the tables. And to top it all off, the cashier said a thank you to each customer as they headed out the door.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkCFX2Ngqe6LFz6h7XkMTw"
  },
  "nHCTL_xw5o6DPH9nJgc5ew": {
    "date": "7/12/2018",
    "text": "If you want to hear the owner cursing at one of his staff then this is the place. I have never heard the F word so many times, he even managed to add the 'c' word at one point.  We didn't stay.  I don't want my children hearing that sort of language.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "8VBlmF1QXQxJQSSk1R81sw"
  },
  "Pc0L5Lh_QfKnKEb-uuI2ww": {
    "date": "1/31/2016",
    "text": "The hubby first spotted the Regency Cafe when he watched the movie Layer Cake. He looked it up while we were recently in London and as the reviews were good, we ventured down to Victoria for our fix of a traditional English breakfast. All the tables were full when we got there, but the turnover moves quickly that we were able to get one once placing our order. Our breakfasts were generous size portions and they make great tea. Overall this is a fast casual diner and worth trying especially if you're in the neighborhood.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JETIrf-G3cXFAFhH99PWsg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Counter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JETIrf-G3cXFAFhH99PWsg/o.jpg"
      },
      {
        "img_id": "jIZWrpjdJj8metfpYaduaw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jIZWrpjdJj8metfpYaduaw/o.jpg"
      }
    ],
    "user_id": "_GWmEzZxFSoPClcG8yL_yA"
  },
  "D2z--ReXflbhc1S_AY42kA": {
    "date": "4/25/2018",
    "text": "Great ambiance. Excellent service. Lot of great selections for everyone's taste. We didn't have to wait too long although the place was packed. I highly recommend it for to everyone.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OGtljO67xXNLhFtsBoOKrA"
  },
  "ZWbnxjw3zDUWTfBOCTzhpg": {
    "date": "8/2/2017",
    "text": "Hands down the best breakfast I had when I was traveling in U.K. for two weeks. If I could, I would come here every other day for breakfast.I ordered my full breakfast set with some add-ons. And everything was cooked fast and almost to perfection, the beans, the mushrooms, the tomato, the sausage... Yum! It felt heavenly to munch on a plate of hot delicious full English breakfast.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kI4O4JSUL_upV0zH2EXxyg"
  },
  "TwgCFIXWcfll1EUzA7Wc7w": {
    "date": "8/4/2018",
    "text": "We stumbled across this place after watching the changing of the guards. Very much a  local place..and judging by the crowd...very popular. Some quirks in terms of \"cash only\" and \"no seating until you get your order\" but it works pretty efficiently and keeps things moving. AWESOME traditional English breakfast and food was served quickly and hot. Was also great for people watching and it was clear we were the only tourists in the place. Will definitely go back on my next trip.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ot52lGaZPfAep9ibNcO34A"
  },
  "of99y02p4zXyCv9M4YN-ng": {
    "date": "6/28/2017",
    "text": "The restaurant is very disappointing.  Everything on the table including the silverware was not clean.  The place looks like it needs a good scrub down.  This place has a high rating and is cheap but we couldn't eat some of the food because it was that salty.The only thing we could eat on our Full English was the toast and the eggs.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rY5xOvVSZSjgZ_dlf8TL7w"
  },
  "y-5zI8-Pba-mHYEJAG1LwQ": {
    "date": "11/3/2015",
    "text": "Situated off the main road sits this cute little corner diner.  What brought us here was its awesome reviews and because we were starving for some good breakfast.  Walked in at 9AM on a weekday and it was packed....don't people work???? lol the menu is simple and straight to the point. i went with just the usual \"english breakfast\" as they call it. But this was their combo special which comes with 1 fried egg, 2 bacons, 1 sausage, baked beans and toast (choice of white or wheat) or just bread and coffee or juice. i asked for an additional egg because.....we eats just ONE?   the beau went crazy and ordered the liver sandwich which is exactly what it is, pieces of liver stuffed between 2 white pieces of bread. he also ordered orange juice which comes in a jar and they give you glasses to fill them in. our order total came out to ￡10.50 which may seem like a GREAT deal.....until you convert it...and realized it actually cost $15 (-_-) that's London for ya.other than the price, the food was wonderful and the service was really friendly. theres this lady probably in her 40's that works the counter and man, she's a beast! taking all the orders, grabs the beverages, prepares the toast and bellows out your order once its ready! the only thing she doesnt do is go into the kitchen and cooks the food!the people working here are genuinely really nice. just a few notes: its cash only, there are no restrooms here and order first before grabbing a seat!",
    "rating": 4.0,
    "rated": {
      "useful": 9,
      "funny": 2,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "Tooh5y01iIlpkUfGreFH0A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Liver sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tooh5y01iIlpkUfGreFH0A/o.jpg"
      },
      {
        "img_id": "OEkRMOcsoKGjfjKf32NJOA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast, eggs, bscon, sausage, baked beans and toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OEkRMOcsoKGjfjKf32NJOA/o.jpg"
      },
      {
        "img_id": "d0qzocyiRG4XV2A8e2eRuQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast, eggs, bscon, sausage, baked beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d0qzocyiRG4XV2A8e2eRuQ/o.jpg"
      }
    ],
    "user_id": "5bgsQymr8HDT3tyC1N3Uhg"
  },
  "77tDX8-SwNlNWK1uUB2Ygw": {
    "date": "1/23/2017",
    "text": "What I Ordered: Bacon/Cheese sandwich on white bread.Flavor:  I never imagined something as simple as a bacon/cheese sandwich could taste so good.  I'm from the US so I'm not used to this thicker type of bacon, that's more akin to pork chops and I LOVE IT!  The bread tasted very fresh.Service: This is one of those places where they know the food is so good that they can afford to have bad service.  The guy at the counter will scold you if you dawdle while ordering, so just be prepared for that.Atmosphere: Old timey mid-century looking diner.  You feel like you stepped into a time machine back to the 50s.Price: Good for what you get.Location: Not really near the city center, so the Uber drive there was a bit pricey.Other Comments:  There will be a line when you come here, but it moves fast as they are very efficient in getting orders out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "U2LMgRU23olgot7cb-zO2A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Bacon and Cheese Sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U2LMgRU23olgot7cb-zO2A/o.jpg"
      }
    ],
    "user_id": "Do08txZUCuxwSoHgVGGlqA"
  },
  "WLY5YLSxw83ZuRZKGg6RiQ": {
    "date": "7/25/2018",
    "text": "Got the \"Set Breakfast Deal\" and was pretty good (: comes with 1 egg, 2 bacon, 1 sausage, your choice of tomatoes or beans, bread or toast, tea or coffee and have extra sides for £1. Total comes out to £6. Only downside is if you choose toast and want jam it comes out to extra. (They charge for Jam). The owner is very amicable and attentive. Would recommend if you're looking for an English breakfast",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qph_OoFi0rCXV59PGvxgoQ"
  },
  "bzo4ec9cQUEdRdiBOE3plg": {
    "date": "8/2/2017",
    "text": "Amazing full English breakfast. This is the best place if you're in London and want something easy, quick, and simple, but high quality. The staff is friendly and helpful, and the tea is piping hot. Everything is checked off for a great place for breakfast.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Ajuj1T9FrLGPBPVutvTaAw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ajuj1T9FrLGPBPVutvTaAw/o.jpg"
      }
    ],
    "user_id": "QVtBWZrlPak0yo29CW7nVw"
  },
  "3bYWsCWr0BGH8lc35hXfag": {
    "date": "7/19/2017",
    "text": "Great breakfast!! Good price for a traditional English breakfast and fortunately I went close to lunch so it was a little difficult to find a seat.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bmwNBd4YyQvO7ar5DOsdCA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bmwNBd4YyQvO7ar5DOsdCA/o.jpg"
      }
    ],
    "user_id": "WMhIsOLUnEYUmQWfSyxvhA"
  },
  "50ujU3KJ9uOQbAHU-ZZgeA": {
    "date": "3/19/2018",
    "text": "Great food, very friendly and quick service, affordable prices. My husband and I stopped here for lunch on our last day in London. We both had a large burger with chips, with a coffee and a chocolate sponge (served hot with custard). Everything was delicious! And all for under 15 pounds , which seems like a miracle in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ePsRcyYOs3YSMciZQcJ1w"
  },
  "TSeEF8IklPfOxksVhqkMHQ": {
    "date": "12/19/2015",
    "text": "Very good English breakfast for excellent value. Menu is quite standard -- and you get the flexibility to either make your own dish or order the set deal. Ambience is quite low key -- what you would expect of a local English breakfast joint. With that said, there is a certain gravitas this place exhumes with all the frames on the walls of celebrities having been and gone, autographs, etc. Service is good -- the line moved by relative fast. Nonetheless, I do think there would be a way to make the system more efficient. Overall, very good option for your local breakfast experience.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QByKxi-w6M5gkIMsCZNLMQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QByKxi-w6M5gkIMsCZNLMQ/o.jpg"
      }
    ],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "zOG3BAem1Qmj9Y7AcnGMSA": {
    "date": "2/12/2018",
    "text": "Some of the best value Fry ups in London, and worth going for the experience alone. Your order is taken and when it's announced it's called by an announcer with s booming voice. You then get to eat in the delightful cafe which feels like it's not changed since the 60s surrounded by civil servants, off duty police officers and a variable crowd of characters",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yppT5T3SVMT8XTm6U_Bd-Q"
  },
  "6_qGX_ddUJPrC6fdzVZRbg": {
    "date": "7/7/2017",
    "text": "I mean, I don't even like fish and this place was outstanding. Perfect way to sit by the shore and enjoy a beautiful day in Brighton.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AfAvEKggpPpgifmKdHQRTw"
  },
  "PdFloopXqpXdat4_HfgzJQ": {
    "date": "12/12/2016",
    "text": "Omg i came into this place and the first impression is the magnificent voice yelling the orders.  We ordered a traditional english breakfast with blood sausage at the very famous breakfast cafe.   Lost of memorabilia on the walls. One of the posters is the victory of cassius clay vs Sonny Liston.  The food is fresh and very tasty.  Love the blood sausage    Very reasonable prices.   I will be back whenever in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gUpFoozHv4v1_dK99MxEEQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gUpFoozHv4v1_dK99MxEEQ/o.jpg"
      },
      {
        "img_id": "PrXdAuyyWtI2px4q6qUelA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PrXdAuyyWtI2px4q6qUelA/o.jpg"
      },
      {
        "img_id": "Mm0utyLP__kSDWbFnk5WMg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mm0utyLP__kSDWbFnk5WMg/o.jpg"
      }
    ],
    "user_id": "qGnQZCS2Layx0oL7HbgrIQ"
  },
  "qSYdvSzHmyIQAQtVTTS5LA": {
    "date": "10/18/2016",
    "text": "I love me a good English breakfast and nothing was as good and affordable as Regency Cafe. I spent 10 days in London and went to an English breakfast eatery every other day (I am not a heathen!) and this by far was the best one.The location is small, on a corner street, and the tables were pretty full when I got there. The fine people of London are considerate and they move fast so other folks can get a table. I saw other people come up to a large table and ask if a spot was taken and they accommodated without hesitation.What gets me is the owner of this place. A fit, small, and short-haired older woman who can bellow out orders like a football captain. When I first walked up to the queue, I thought some big burly chef from the back was calling out the orders but it was the lady running the registers!I ordered the set breakfast which consisted of eggs, bean, sausage, bacon, and toast. For an extra 90 pence each I received hashbrowns and a fried tomato as well. Total damage done with Tea and Orange juice was just 8.90 pounds. Wow! If you're looking for a traditional English breakfast, this place is the bees-knees and I hope I threw enough British lingo in this review to make me sound like I am a native ;-)Cheers!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "MIfzkVI4LYmLaXYv9wnA7Q",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MIfzkVI4LYmLaXYv9wnA7Q/o.jpg"
      }
    ],
    "user_id": "3aEJ4MkEMEuXDgsk_4VoXA"
  },
  "eGavlSxr28hJ5C7rDDjlDg": {
    "date": "7/1/2016",
    "text": "I came here for breakfast today and it was an experience! There was a queue coming out of the door at around 9am when we got there but it moved pretty quickly! So the premise is, you queue up to order and then take a seat and when your food is ready, the lady taking your order shouts it out! The funny thing is, she is very softly spoken when taking your order hit as soon as the food comes out, her voice totally changes! I ordered the breakfast for £5.55 and for an extra 90p had a block of bubble and squeak on the side however you can also order a portion of hash browns (3 pieces) or black pudding. The breakfast came with 2 pieces of toast and butter, a fried egg, one sausage, two rashers of bacon and beans and a cup of tea or coffee. I also got an orange juice which is ordered in straight from the dairy and served in milk bottle which I thought was quite novel. The decor is like an old fashioned cafe, white tiles on the wall and plastic chairs with random pictures adorning the walls. I loved this place and I really want to go back and have some lunch there!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "_P9zOQ3Ai0Zcc1cVaoo8cQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_P9zOQ3Ai0Zcc1cVaoo8cQ/o.jpg"
      },
      {
        "img_id": "JmibcM2wYn7zk0W7oaTLEw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JmibcM2wYn7zk0W7oaTLEw/o.jpg"
      },
      {
        "img_id": "Qkpj7OfX-loFGb83rgxcxw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qkpj7OfX-loFGb83rgxcxw/o.jpg"
      }
    ],
    "user_id": "kBBz82cIigaK1hi-hMeYyw"
  },
  "zjGq774eRfH66oIK88awUA": {
    "date": "3/9/2017",
    "text": "**Cash only!!*If I learned anything during my stay in London, it's that the English are a no-frills people, and this cafe is a perfect example. I researched a bunch of places before hand but then decided to just walk around until i found a nice pub that served breakfast. But then i rounded the corner and saw the Regency cafe and boy, was it meant to be.What we got: the traditional English breakfast: egg, 1 sausage, 2 bacon, beans, toast, tea/coffee (ADD ONS: the black pudding and hash browns- these are a must!!)Everything was beyond amazing, who knew i could fall in love with a hash brown??You have to go.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3T_Sqi-CBtgOkYCBVo2I1g"
  },
  "612SdrBHaOUAvu7IK-uKSg": {
    "date": "3/12/2017",
    "text": "Line out the door.  We stayed in the neighborhood for three nights and there was always a line out the door. There is no hostess and no seat saving.  You line up, order you food and somehow a table frees up in time for your food to come out.  Came here for breakfast and the food was solid.  Big English breakfast, eggs, bacon, sausage, beans, toast and coffee...not fancy but great local atmosphere.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nx1DS8Cjkqh7NvcfIETi8A"
  },
  "VgCPg0cOSmDdwFKnR82C6Q": {
    "date": "6/30/2016",
    "text": "This is our first introduction to English culinary. We trusted yelpers to send us to the right place. Overall, food was good but not great. I ordered the chicken and mushroom pie and hubs ordered eggs Benedict with salmon. Yes, it's not expensive but it's a \"cash only\" place and it sucks for hungry tourists who don't have the currency. But I'm glad we tried this yelper's fave!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EHg4dsYarMlAuGOEO8iBAw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EHg4dsYarMlAuGOEO8iBAw/o.jpg"
      }
    ],
    "user_id": "WTKu3IW8EmCW5qTvzJxKYg"
  },
  "nsevXdo4YH-SyPWJF-Wu8g": {
    "date": "12/21/2015",
    "text": "This is definitely a good value, and in London where everything is so expensive, it's quite nice to be able to really find something that will satisfy your cravings without emptying your walled. The english breakfast is great. You can get all of the staples and trimming and probalby won't spend more than 15 lbs. Regencey Cafe is also quite accessible from the touristy areas. You have to walk, but the area is quite nice and easy to navigate. while the food is good, i've never been a big fan of the english breakfast, so I wouldn't have come here except for the fact that a friend wanted to, but it was totally worth it. You can tell the staff has been doing this for awhile. The orders are put out rapid fire and while a bit abrasive, the attitudes of everybody are actually more confident and rather warm once you get talking with them. The facilities are pretty average if not below it, but what do you expect from a diner type restaurant? I would drop by anytime you are in the area. It is well worth it. It might not impress anybody, but it'll beat almost anything else you make at home hungover.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H9JykZqKIxzO9kUojHzEwA"
  },
  "WV2B44zcSbz0joeO4JeeXQ": {
    "date": "11/22/2015",
    "text": "Rude service, no toilets, and a non-cosy atmosphere? Why four stars you ask? - Best breakfast in London for a good price!- It doesn't get any more british than this.- Sitting in Al Pacino's place. If that's not enough, almost no tourists there, really great find!",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5iQRUBbpQHUQYj28R-NeQ"
  },
  "MZo8ElrZY0MkJpX11JphZw": {
    "date": "4/1/2017",
    "text": "Absolutely fantastic.  Great breakfast and the bubbles and squeak are a must have add-on.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GtRUzGY1FeWPUMNmWeZqjQ"
  },
  "gQpj89C6xhrmuskHV-b_AA": {
    "date": "1/13/2017",
    "text": "This cafe was a 40 min ride from my our hotel and we had to come here two days in a row! You truly feel part of Britain society when you come here. The service is quick and good. The food is definitely a British experience. First day i orders the English breakfast with blood sausage. YUM! a very hearty meal indeed. Second day i felt a little more adventurous and ordered the steak pudding, which turned out to be a mini pie, lol! That was good as well, but i preferred the English breakfast.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TprqNCUop3hvvsqPexb-9Q"
  },
  "hm4wybIk-VSgqaZoTZRAVA": {
    "date": "9/21/2012",
    "text": "I'm renting a room walking distance from Regency Cafe, so when I hopped on Yelp to see what's good in the area, this place came up.  I came here for lunch around 3pm a couple of days ago, and was really torn on what to offer.  My exchange went something like this:\"What's good here?\"\"Everything.\"\"I was thinking about a burger or a salad.\"\"Get a steak pie.\"\"OK.\"I'm paraphrasing, but I pretty much go with what the staff recommends if at all possible.  I wasn't disappointed, as you can see from my picture.  It was delicious, though I think I probably would have preferred a salad that day.  It was a ton of food for the price, though, and I can't believe how packed this place was.  Definitely wish I had come for a full English breakfast as that just sounds so good.  Next time.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ssItvP3RpcYTG5QE4Pr-vQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Steak pie, chips, & peas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ssItvP3RpcYTG5QE4Pr-vQ/o.jpg"
      }
    ],
    "user_id": "1O638BDK_fWuxgTVJwff-A"
  },
  "YJchUCAV65_guHbzsGJ4dw": {
    "date": "5/15/2016",
    "text": "After an 9 hour flight, I needed to get my first British breakfast fix and Regency Café didn't disappoint. Great staff makes everyone feel welcome. I would come make back for the great food and atmosphere!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_bClq67sw8bvUXe3mzIOyA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Ah my first meal in London, after a long 9 hour flight. Well worth the wait",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_bClq67sw8bvUXe3mzIOyA/o.jpg"
      }
    ],
    "user_id": "pm5nb--StPhg2kmTmgH6zw"
  },
  "Bfg1zLuALs7Wt3AhftN-UQ": {
    "date": "9/23/2017",
    "text": "Outstanding full English breakfast for an incredible bargain. They also offer other items, such as  breakfast sandwiches, corned beef, etc.  The hash browns are amazing.  The portions are hearty and you can easily share entrees.  The service is no nonsense but very friendly, efficient, and accommodating, as in, you should know what you want by the time you get to the front of the line to keep with the pace of business but they will also make whatever you want.  Want a full breakfast with beans, a side of grilled tomatoes, and hash browns, tea, no milk? no problem.   the lunch menu looked equally appetizing but we didn't have a chance to eat lunch there. would go back in a heartbeat.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkDQHbGiocK9EejxZ0b07g"
  },
  "FMBkXZkLpTf2fuPsVYkqKw": {
    "date": "3/24/2017",
    "text": "Been here a few times and it is safe to this that this is good value for money and staff were polite, considerate and helpful. The food was nice and had that classical English breakfast aroma. For me I enjoyed the eggs, sausages and bacon. The eggs were particularly interesting, and were not the sort thing I would encounter. Having said that, the meal was great and I would pop down here again :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvnCBUocclLUZ01isDtnbA"
  },
  "AxjACfPN03IQYQvRFgczyA": {
    "date": "9/6/2014",
    "text": "Terrific British caffe with a hostess/order taker with an unbelievable shouting voice. The set breakfast comes with 1 egg, 2 bacon, sausage, beans or tomato, bread or toast, and tea or coffee all for £5.50. Black pudding, bubbles and squeak, and hash browns can be added for 90p each. GET THE HASHBROWNS! They are worth it.Order at the register first, grab a seat, and remember what you ordered so you can go grab it when it gets shouted. Enjoy!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gv7awuNj_DS6m4JCPidFuQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast with beans, toast, hashbrowns, and black pudding. 7.30",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gv7awuNj_DS6m4JCPidFuQ/o.jpg"
      },
      {
        "img_id": "_apwyWQSIskQykdTFX0orQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. The line and a feel for the ambience.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_apwyWQSIskQykdTFX0orQ/o.jpg"
      }
    ],
    "user_id": "7rIH8xNsFDiArzVob19ORQ"
  },
  "LqeScGXR4k68exfAKPHrNg": {
    "date": "7/5/2014",
    "text": "Classic, old school, timeless - it is an amazing place. What makes this place special for me is the front man - hard core, old school, great working man, someone you would expect from a film  - he stands for the place, he manages the place... Everything about him is about the place.  What a timeless place - loved it!I was there for breakfast - the menu is old school, expect nothing fancy but good old cupper, simple coffee accompanying simple eggs, bacon, sausages and beans... And it is absolute value- you would struggle to eat more than £7 pp with drinks for breakfast. Definite must try - if you are driving, remember all curbside parking is free on weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "6_u_Q43fvenTqqGqS947sw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Busy counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6_u_Q43fvenTqqGqS947sw/o.jpg"
      },
      {
        "img_id": "aqRYDEHnxc8aqCeiy-NB-w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast deal",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aqRYDEHnxc8aqCeiy-NB-w/o.jpg"
      }
    ],
    "user_id": "cNT93-GajYp36jMu7alv2A"
  },
  "svY3uUOZ-_A0khNBcbP0LA": {
    "date": "12/4/2014",
    "text": "Totally top notch! Quality ingredients, consistently excellent! Regency Cafe serves the best cooked breakfast in London. After three years living in the United States, I returned to London in July 2014, got off the plane at 7am and went straight to the Regency Cafe for, at last, a taste of home. Best cuppa ever!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "61U_T2wkJUKDMtyDLLxDyw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. \"Sausage, beans and chips!!\"",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61U_T2wkJUKDMtyDLLxDyw/o.jpg"
      }
    ],
    "user_id": "fnbI5tcAddXrf7Z2Hk3gzw"
  },
  "V_sR2sFS39BDG1SsT5hrQg": {
    "date": "3/25/2014",
    "text": "My only mistake was waiting until my final breakfast to eat here.2 eggs, 2 bacon, mushrooms, and Earl Grey tea for £4.70.  The only thing special about this place is that the food is fast and excellent.  Cash only, very inexpensive, and quick.  I came at an off hour so I didn't have a wait, but I can understand why it would be packed otherwise.A really small place, right on the corner, you can nearly miss it walking by.  You walk in, order, and find a table.  Then you wait for them to call (and I mean loudly call) your order to go pick up at the counter.There's nothing I can find special about the food, its just really good!  No special preparation, no frills, but I think that's probably the point.  It is the best breakfast I've had here.  If you're near the area you must go.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WVIYk-xqf9JgpJovZcFRHA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Eggs, bacon, mushrooms, and Earl Grey.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WVIYk-xqf9JgpJovZcFRHA/o.jpg"
      }
    ],
    "user_id": "oWMu0DVnrKjkEd98D2uEFg"
  },
  "8dMHbQLBqucPddEMAEB3Jg": {
    "date": "1/28/2014",
    "text": "Ever since this little cafe was listed in the Wall Street Journal as one of the yelpiest places in London, I had bookmarked it. Alas, months went by without me converting that bookmark into action...and I was already afraid that by the time I would finally get there, the place would be so overrun that it'd lost its yelpiness. (As I've witnessed many times when hidden gems get written up by major publications.)I am happy to report: all good. The place is (still) amazing and the owner still loudly shouting out the orders when they're ready. In a parallel world, this guy would be an opera singer for sure, with such a baritone voice; imagine Pavarotti shouting \"two eggs with beans and hash browns coming up!\"Here's a tutorial on how to order:* make sure you've got cash on you* you need to place your order before grabbing a seat, so get in line* while in line, take advantage of this and watch the folks rotating behind the counter and in the kitchen; it truly is the perfect human assembly line* get the set breakfast and customize it as you like (if there's two or more of you, I recommend getting a bottle if fresh orange juice as well)* once you've placed your order, go find a seat and listen to your order being shouted out* enjoy your food* afterwards I highly recommend a digestive walk along the nearby Thames...May this place stay like this for a very long time...it's timeless and perfect as it is.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Cqw4fJYJwkufdQSmLXEnug"
  },
  "b555i6NkRgtZ9C_hX_1pJw": {
    "date": "1/15/2014",
    "text": "Wow! What an incredible breakfast spot! Beats the hell out of any diner back in the states.You order at the counter and then seat yourself. When your order is up, the man taking orders calls it out and you go and fetch it. This was quick! Under ten minutes from when I placed my order till I was eating it.They offer a variety of breakfast specials, or a la carte. I chose the fried tomatoes,  mushrooms, hash browns, chips, and 2 eggs. Also a cup of tea and a bottle of orange juice. The eggs were perfectly cooked. Not runny in the slightest but still with a soft enough yolk for dipping. The mushrooms were savory and well cooked, the tomatoes also. Hash browns and chips were fried just right; crispy and delicious. Writing this review is making me hungry! I'll certainly be back in the morning. I went in around 11:15 am, brunch... not too crowded but definitely busy. Ample seating and good atmosphere. The portion was very generous, and the price was unbeatable. My entire meal cost about £7.30, including juice and tea!",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "bnEnZKkOu2HpS1h-DidN1Q",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Making me hungry looking @ this mornings brunch. I want to eat it againnnn",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bnEnZKkOu2HpS1h-DidN1Q/o.jpg"
      },
      {
        "img_id": "i3MiyAeJhjr6qysRjxSf7w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. My brunch! All for under 10 (change on the right) :]",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i3MiyAeJhjr6qysRjxSf7w/o.jpg"
      }
    ],
    "user_id": "YxRqYqU4N5tutt_dysx_AA"
  },
  "446JXgtJDyt8w9JLphm5pQ": {
    "date": "3/18/2014",
    "text": "GO HERE FOR A GREAT ENGLISH BREAKFAST. So much good. The set breakfast comes with one egg, two pieces of bacon, one sausage and either beans OR tomato and either toast OR bread. Toast is just white toast and bread is thick white bread with butter on it, served cold. Also comes with coffee OR tea. Add hashbrowns that are sooo good and also the bubble and squeak. Set breakfast with one side is only £6.90. Order at the counter, and pick it up to bring it to your table.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "a63UOipKLHnQ4TMOVW2xuw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a63UOipKLHnQ4TMOVW2xuw/o.jpg"
      },
      {
        "img_id": "zt_qgAA8et2ob4mjqC8nFQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zt_qgAA8et2ob4mjqC8nFQ/o.jpg"
      }
    ],
    "user_id": "7-4HyBXshIHWt17XPyZz9w"
  },
  "WI5TVRhuaw88kcNhr3Mc0g": {
    "date": "11/29/2016",
    "text": "Very autenthic place, love it! Every time i come to london i m going for a fully english here, especialy after a long nite out.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kRFSYVoy2QREJ6odNr6sbg"
  },
  "_LvVPth3M0cRoMVs5UbBdg": {
    "date": "7/15/2015",
    "text": "This place is next to my flat, so I thought I'd finally give it a try before noon (they close sharply at noon). Super rude service, and okay food.  The woman behind the counter is a real yeller, with a very deep voice, which I think adds to the charm.  A lot of yelpers (even my brother) talk about a man yelling, maybe there is a male who also does this?This is how my experience went:Arrived with cash (no credit accepted), waited patiently in the queue for 25 min, practised how to orderme: I'll have the set breakfast, with tomato her: and you? (to my friend, the second I finished my last syllable)I wasn't done yet. I want a side of hash browns. So, when my friend finished ordering, I said \"and also, can I have a side of hash browns please?\"  She rolls her eyes, sighs, writes it down, looks rudely at us, and asks \"anything else?\" with her hands in the air (like a 'hold up' style). RUDE. Keep in mind, the lady was very cheerful and patient with the man ahead in queue, who kept amending his order. My order was over in 12 seconds - he took a minute or more. You wait in queue for a bit, and it stops moving periodically - pretty sure they intentionally delay the queue so that tables clear up (makes sense). So, you can always find a table, no problem. The food - nothing to write home about. The bacon was way overly salty. The tomatoes are canned.  The sausage was ok. Egg and toast were good. I added one star for the Ok food, but the service was shit..however it seems to be hit or miss judging by the way others were received.",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oJUXOQPQ_G52VkJyf3oOQ"
  },
  "nCttpRyiDFpT_LF-taTmLQ": {
    "date": "7/20/2017",
    "text": "I came here last year in September 2016 and I still think about this restaurant on a weekly basis. My boyfriend and I just booked another trip to London for January (from California) and I'm pretty sure we're coming back just to eat here. Six more months...sigh.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PslaPxNAp_kW4FCg-4GzTw"
  },
  "OIxTcctMwxi6UQDlN4Ai2w": {
    "date": "11/9/2016",
    "text": "I was so glad this was my last meal in London before leaving for New York. This place looked so authentic for a quick and easy British breakfast. My boyfriend and I came here around 11am on a Thursday which was good timing because this place looks to be constantly busy, full of locals and tourists. A long line quickly formed after 11:30 but the execution and delivery of food is rather quick once your order is put in. Order first and then sit. I ordered the breakfast deal which included an egg, sausage, bacon, beans or tomatoes, bread or toast. I got an add-on of black pudding and hash browns which was absolutely delicious. Everything was really delicious. Simple yet full of flavor and tasted freshly cooked. For a meal under 10 pounds, this was well worth it. The hash browns were nice and crispy, bacon was salty and well-cooked, beans were soft and plentiful, black pudding was black and delicious for the more adventurous eaters. A great last meal. I would definitely come back again if ever in the area.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "KXGhuZYgVhgCIIuqXIGT1Q",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast set with extras of hash browns and black pudding",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KXGhuZYgVhgCIIuqXIGT1Q/o.jpg"
      }
    ],
    "user_id": "QZ3grLRAy7do7inT4OcltQ"
  },
  "ZziSu1sCijpxQ7t4r5vOTg": {
    "date": "8/21/2017",
    "text": "I was told a perfect British breakfast could be found at Regency Cafe. Don't know if it was perfect but I do know it was the best I have had! The \"set breakfast\" was one fat, tasty sausage, two bacon (more like ham slices), cottage potatoes, grilled tomatoes, egg, and toast. I ordered squeaks but didn't get them. I guess I could have complained but my plate was full enough without them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fi5NS_bBeVPalEPoqJRMKw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fi5NS_bBeVPalEPoqJRMKw/o.jpg"
      }
    ],
    "user_id": "A_ojXrCWxddFBS50umN2fQ"
  },
  "J2TgS_vJG9XTyg94NqMH1w": {
    "date": "9/30/2016",
    "text": "If you're in visiting London, you have to take in the full English breakfast once. And there's no better place to do it than one that's been serving up plates of gloriously greasy breakfast staples for 7 decades.The line will likely be leading out the door when you arrive: don't fret, turnaround at this tiny cafe is very quick. The Regency Cafe offers up a pretty sizeable menu for breakfast, but most people seem to get the 'set breakfast': fried egg, bacon, sausage, beans or tomatoes, bread (toasted or not) and tea or coffee for £5.50. Extras, like hash browns, black pudding, or bubble and squeak (fried potatoes, cabbage, and veggies) are only 90p more.Once you order, stake out a seat and wait for the lady at the counter to bellow out your dish. Pick it up, return to your seat, bask in full breakfast deliciousness.",
    "rating": 5.0,
    "rated": {
      "useful": 14,
      "funny": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "gJKhQVGFTzyvDQBNEOoaig",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast: egg, bacon, sausage, tomato, black pudding, bread and butter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gJKhQVGFTzyvDQBNEOoaig/o.jpg"
      }
    ],
    "user_id": "dqo-o6O847KTF3NDADxxDg"
  },
  "lqRYJm0Z7JwS612Vh_-HSQ": {
    "date": "6/2/2017",
    "text": "Food: I am regular customer here and have never been disappointed! The food is always to a good standard and there are plenty of options on the menu. Their English breakfast is one of the best in England you'll find! The fish and chips on a Friday are a must! The fish is very fresh and they have a variety of different types of fish. The chips are the typical English 'chippy' style! Other items on the menu are also delicious such as their chicken fillet burger and the mushroom and chicken pie. Price: Very affordable and reasonable, given the central London location. However it is cash only (with no nearby cash machine!)Atmosphere: Very traditional and old English cafe that hasn't had a refurbishment since it's establishment by the looks of it! Their are plenty of locals and the cafe has a very homely feel. One of the only remaining 'old school' English cafes! Highly recommend this for a visit!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t7wPKoFP0l848hrG_-7eHQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Customised breakfast. 2 eggs on toast, baked beans, mushrooms and hash browns.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t7wPKoFP0l848hrG_-7eHQ/o.jpg"
      }
    ],
    "user_id": "VWj4IIUv2Dg5jMv3UXvuiA"
  },
  "ZlcYlfYgVapRvaCchDm1Jw": {
    "date": "7/3/2018",
    "text": "Very famous place; one concern would be hygiene.  The guy at the register, a gray-haired older man about age 60, 5'2\" in height, touching the money, touching the cash register, touching the toast, touching the plates, very hot day and reaching in his shirt at the gap in the front of his belly, then taking a wet washcloth and wiping stuff down, then re-using it.  Watched this for about 30 minutes. Never saw him wash his hands. I'm sure it is probably fine, most people have good immune systems, and they likely get a pass due from health department as they are an icon, but a bit concerning.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qP64I9wJc2uKl4nIkLWzkA"
  },
  "xAWoxeEYhRSeQfBeGg0whw": {
    "date": "9/29/2016",
    "text": "CASH ONLY!  Plan to wait in line to put in your order and have it bellowed out by a wonderfully enthusiastic owner.  It never seems like there will be a table open by the time you put your order in, but have no fear - the turn around time is quick.  I got a proper English breakfast, vegetarian style, which would be an egg, baked beans, toast, grilled tomatoes, grilled mushrooms, a side of hash brown and a cup of rosy tea. It was perfection and cheap!  FYI closed on Sundays even though it says open online.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ZZEr5uMLgtGEYk31kXq4RQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. A proper English breakfast (vegetarian)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZZEr5uMLgtGEYk31kXq4RQ/o.jpg"
      }
    ],
    "user_id": "STAlhmm3saZDehwqzEg5wg"
  },
  "aWAXgwF5MyX-u2u3vqItjw": {
    "date": "3/2/2018",
    "text": "Very authentic British breakfast experience for a tourist. No frills. Very yummy. Hearty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R3-ZmOYZUZZJ_WtyhpRyag",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R3-ZmOYZUZZJ_WtyhpRyag/o.jpg"
      },
      {
        "img_id": "1QOw6qE1fnygWDawbBcqZw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1QOw6qE1fnygWDawbBcqZw/o.jpg"
      },
      {
        "img_id": "4GTx8PsPER3v-_rpiC168Q",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4GTx8PsPER3v-_rpiC168Q/o.jpg"
      }
    ],
    "user_id": "Bxs8d0jlm5379eOk6aMrdw"
  },
  "8iOkv65jXRV-aLmAzyvwZQ": {
    "date": "10/3/2017",
    "text": "Best meal I had in London!!!! It doesn't really get better than delicious yet affordable food. Be sure to have cash though because it's cash only. We went a little before noon and the place was already packed with a decent line that never got much shorter the entire time we were there. The menu is pretty simple. I got the egg, sausage, and beans with a side of hashbrowns (which is like 3 pretty big hashbrowns btw) and a tea. All of this was maybe £5??? SO GOOD. My +1 got a dish with tomatoes and he still talks about those tomatoes, they were that good. Seating always looks full AF but people are coming and going so often that everyone seems to find a place to sit by the time their food is ready. It helps that you can't sit down until you've ordered.The guy taking the orders has this great booming voice that we were all in awe of lol. We loved this place so much HIGHLY RECOMMEND. Also, this place seems to be a local hotspot so get ready to feel authentic AF.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "V7aQv84xyP5Coz5xIZcVow"
  },
  "4teNySMIH-xMF0nhTKmcMQ": {
    "date": "10/2/2016",
    "text": "We wanted to eat here every day during our stay. Unfortunately it didn't work out with some of our plans. But we still ate there three times. The line can be crazy but it's highly worth it. I was always worried about getting a table but it seemed to work out each time. I loved the lady who takes the orders. She was so polite and helpful, but still made the line move along efficiently. Her ability to belt out orders over the loud crowd was incredibly impressive. And the food. Oh my, the food. Just to die for!  If you want a good, no frills, solid, delicious, satisfying breakfast (do I need more adjectives?) that will last you until late dinner, get the set breakfast. Go ahead, add in some hash browns. You've earned it. I dream about those rashers. And the sausage- mix it with the beans. Oh man. Yes please. And let's not forget those perfectly poached eggs. And to wash it all down a perfect cup of tea. All for a very cheap price! The value is just incredible.We had no idea when we stumbled upon this place that it's one of the top rated restaurants in all of Great Britain.  We truly hit the jackpot.America, please learn from England. This is the way to do breakfast. It does not need to be fancy and overdone. Also, can we please get some rashers over here?",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-7IdaTGhhEzuB5NBmGF3ew",
        "caption": "Photo of Regency Cafe - London, United Kingdom. The main event. Full English Breakfast. I couldn't even wait to eat my eggs on toast before I took the picture. Sorry not sorry.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-7IdaTGhhEzuB5NBmGF3ew/o.jpg"
      },
      {
        "img_id": "XxTnoihqcHjMqyKAjOXJ8A",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XxTnoihqcHjMqyKAjOXJ8A/o.jpg"
      },
      {
        "img_id": "-nBlkwsGNDtAOz4YfpAZFg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Cheese and onion pasty with chips. Amazing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-nBlkwsGNDtAOz4YfpAZFg/o.jpg"
      }
    ],
    "user_id": "clirF7pph8EPEoMtvrcj0w"
  },
  "a1DJjz_cmrtb3vsBuT5j_g": {
    "date": "6/13/2017",
    "text": "Want to eat like a local? Check out Regency Café, and order the Breakfast set! Eggs, bacon, sausage, baked beans, toast, and coffee for less than £10. It can't get ant better than that!Staff is friendly, food is good, what more do you want?",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7PrRxw-BPE7PecErexbWew",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast set.... delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7PrRxw-BPE7PecErexbWew/o.jpg"
      }
    ],
    "user_id": "4K54tLH9Ant0fIKrOmQA8Q"
  },
  "qEMu4_41EO2F0-KJetLtPA": {
    "date": "12/20/2017",
    "text": "Such a great place for breakfast or lunch!  Definitely a local hotspot.  Cash only and you bring your own plate to your table.  The line can get long.  For the type of food and the experience it's as good as it gets!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JF0gQUKMnsn3KqkW5cK4Ew",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Front of the place.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JF0gQUKMnsn3KqkW5cK4Ew/o.jpg"
      },
      {
        "img_id": "M0UolvZa88KI6AKON5_R-g",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Typical breakfast here.  I cleaned my plate!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/M0UolvZa88KI6AKON5_R-g/o.jpg"
      }
    ],
    "user_id": "kyG14FyCWmVW3Uefs_GE_Q"
  },
  "mnyOLE9hUPV8yjQSd0VVJw": {
    "date": "10/25/2017",
    "text": "We had to stop in to get a proper English breakfast and, this place did not disappoint. I really enjoyed my meal, especially the eggs, toast, sausage and tea. The beans really threw me for the loop but considering the bacon, this meal will keep you full until dinner. Aside from the meal, we were quite entertained my the lady taking and passing out food orders. She is very soft spoken during the ordering process but once the food was ready to be picked up, she transforms into a public announcement system speaker. She definitely keeps this place running in tip top order.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JqZNeHVGE2Er1DilS5iEA"
  },
  "Km1nej_o2rk-BnZMqZBLMg": {
    "date": "6/21/2018",
    "text": "This place was absolutely phenomenal. The food is absolutely amazing and leaves you very full. The best part of it is, is that it is not a gimmick. The prices are more than fair and definitely super affordable. I loved it here, and if I ever find myself in this part of London again, I'll be coming back for sure!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uSnlEXeTMXzpC1ZK-DchaA"
  },
  "AfQcOcVyGzCC7Yujb2w-YQ": {
    "date": "6/11/2018",
    "text": "Take the set breakfast if it's your first time here as a visitor.  Get to try the whole set.  classic and lovely taste.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Th6nR_3NPMSlAy2Jp-Qjsg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Remind me of HK a bit.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Th6nR_3NPMSlAy2Jp-Qjsg/o.jpg"
      },
      {
        "img_id": "sNoiDumlrwwm0fCtQJ2Hnw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sNoiDumlrwwm0fCtQJ2Hnw/o.jpg"
      },
      {
        "img_id": "C5UxU5KqcYSzhIubs60hzA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. delicious, local, classic haha",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C5UxU5KqcYSzhIubs60hzA/o.jpg"
      }
    ],
    "user_id": "KnoveQySEqEU8HflqlpJ1g"
  },
  "-_b6LLPZWDXwVpUv2tNzPg": {
    "date": "5/30/2018",
    "text": "Great service and incredible food for a reasonable amount of pounds. The seating system is a little weird but works great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vhsyw4tM3lvgvM8CT-L0w"
  },
  "5yz7qy1EEAJbaeOAHTXzeQ": {
    "date": "2/19/2017",
    "text": "Regency Cafe has a very homey vibe and seemed to cater to lots of locals, which was exactly what we were looking for. We got two dishes:- egg and chips- sausage, well done egg, beansA couple of odd observations:- The texture of the scrambled egg was so odd, it was so fluffy that it looked like soft tofu or pudding/custard, especially as you slice through the egg. It was strange. The egg was also rather unspiced, but maybe thats the norm and its best left to the consumer to dress the egg.- The size of each dish was rather disproportionate. The egg and chips was a heaping plate, while the sausage, egg and beans was lacking.Regardless, it was a relaxing spot to have breakfast at an affordable price.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eCcP_PZzRzeg7qI0mHK71w"
  },
  "hCv8s6jl3-3Nupg1T7DYxw": {
    "date": "2/17/2017",
    "text": "Ordered their Friday lunch special, lasagna, chips with ham and two eggs. All of them were great! It was my first time trying fish and chips in London and the Friday special left me a great impression! Lasagna also so soft and full of the creamy and cheesy flavor!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Da89YhHbX6C5y9LZEZFnHA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Friday lunch special with cod and mashed peas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Da89YhHbX6C5y9LZEZFnHA/o.jpg"
      }
    ],
    "user_id": "7jmAvbN-jAuFDJNhyX0qxQ"
  },
  "W_sKa6DjsDsp0srW60xQJw": {
    "date": "7/22/2016",
    "text": "We got here at 11:50am. Just before the lunch rush crowd. So missed long line. Breakfast huge portion. Bacon a bit salty. Counter lady very loud as it necessary to tell orders ready, but very very nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dMkE6MpmdU-7TE-4vyfejQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Omlette with mushroom and onions. Bacon. Black pudding",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dMkE6MpmdU-7TE-4vyfejQ/o.jpg"
      }
    ],
    "user_id": "YIcsghXvNE_kpOD1AkY79A"
  },
  "Txov97sNP-p7wPbp1-Usyg": {
    "date": "2/7/2017",
    "text": "We headed here as our last stop before heading to the airport in London.  We shared the eggs, sausage, bacon, hash browns, toast, corned beef.  The eggs were really unique in that they had this texture kind of like flan or crème brulee.  Hash browns were decently crispy on the outside but undercooked in the middle.The corned beef was not edible as a side for breakfast.  Weirdest taste and texture ever.  Bacon was good as it was more like pork belly than bacon.  Sausage was not memorable and the stewed tomatoes were not something I could swallow.  Overall, it was a-ok, but I'm sad we wasted our last meal in London here as it was not a 5 star meal.  We also Uber'd across town for it.  Cheap eats, yes.  Foodie destination...no.  A-ok experience.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RswJ-bCVsf82yJAvhTEZeA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Corned beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RswJ-bCVsf82yJAvhTEZeA/o.jpg"
      }
    ],
    "user_id": "7DmUbNOJgTMYOX_Ap_Ja_w"
  },
  "f7LpfGUVmuhPlLw-bmcGow": {
    "date": "6/6/2016",
    "text": "Headed here for breakfast after a set of disappointments in the morning and this breakfast really perked us up.It is such a lovely space, well lit and welcoming. Given the summer like weather (finally), the doors were open and even at 10am, we saw that it was quite full inside.Based on advice from previous reviews and tips, we knew exactly what we wanted before we reached the front of the line and had cash ready for payment.Full English and corned beef with a side of mushrooms with orange juice. (The full English comes with tea or coffee) The mushrooms were really really good. The bacon was thicker than the really flimsy ones you get st some places, but not too thick. Sausage was lovely and the eggs, cut through the saltiness of the meats.There were a lot of chips and we could not finish that, I also saw them left over in a lot of other plates around.Bread is white, coffee is standard- with or without milk. This is not a fancy coffee place where you can order a low fat soy Macha latte. It's down-to-earth food, served up with all the affection of a harried mum in the kitchen at breakfast time.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_Pq298GxOn6UmqAwc7tqCg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Pq298GxOn6UmqAwc7tqCg/o.jpg"
      },
      {
        "img_id": "SbMqrTV79p7lDaRrT3fwHA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SbMqrTV79p7lDaRrT3fwHA/o.jpg"
      },
      {
        "img_id": "TNRUTI7IKdDaf4YZn1FQWg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Corned beef with extra mushrooms",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TNRUTI7IKdDaf4YZn1FQWg/o.jpg"
      }
    ],
    "user_id": "kKM1IGrc4nCuvfv968NigA"
  },
  "ob4XYyls_lFBBf_r3c2_2w": {
    "date": "7/14/2015",
    "text": "This seems like the kind of place my grandfather might have liked. I'm not used to eating beans for breakfast and British bacon is new to me, but I'm going to miss this kind of food when I go back to the states.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UXPDrJTxY7fk_5qofAJSBQ"
  },
  "F-O-un2hyEojLYhssptw1A": {
    "date": "8/29/2015",
    "text": "Great spot for traditional English breakfast. Staff are nice and keep the place humming. Reasonable prices for tasty food. Food is really good, but it's not remarkable or of a quality that you couldn't get at other good breakfast spots. Would certainly go back if in the area but wouldn't go far out of my way for it.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U09n1zRA0hBsD4sMhlNtDQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Proper English breakfast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U09n1zRA0hBsD4sMhlNtDQ/o.jpg"
      },
      {
        "img_id": "3lYsI1LpGsc6vwZG4_EVOQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3lYsI1LpGsc6vwZG4_EVOQ/o.jpg"
      }
    ],
    "user_id": "03FwU4BcyHJnft4uVlx9NQ"
  },
  "6tZ8ds_D5s63pBwKb-ThVw": {
    "date": "9/26/2013",
    "text": "The best English Breakfast in England! There's a reason why there's always a line here, and it's simply amazing to watch how people are moved through from order to table, even with that long constantly-moving line. Get your English Breakfast with Bubble & Squeak (potatoes with veggies placed strategically under the egg)!Overall, the Law of Diminishing Marginal Returns does not apply here. I could eat that breakfast every day for the rest of my life and STILL love it! :-)",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnMXB6oio2FfkmD8S_QmsQ"
  },
  "-I39ljM3Dw9CYuBKbWk5aA": {
    "date": "7/28/2015",
    "text": "Fast, good value, full portions. I came here for breakfast and the line moved briskly. Eggs, toast, chips and sausage were good.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4T-dt5G8Uo-6nIB7BYu0LA"
  },
  "loO2BdzzBicpQoFRsdE3IA": {
    "date": "9/19/2015",
    "text": "Love love love love this place.  Plain but the food was amazing.  Just as recommended by others on yelp.  Glad I took the chance and will definitely visit again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wd_ue8_5UNqPeoEgrEDxoQ"
  },
  "ec7SyVsZM7QJWCDS8l75tQ": {
    "date": "9/28/2015",
    "text": "This place is great! Bring cash, get in line, and be ready to order. Have a seat and listen for your order to be bellowed out by the counter person. The food itself is just good honest fare. There's certainly no posturing or pretending to be fancy. Heck, I took a bus back the next day instead of eating at one of the many places nearer to where I was staying.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xOKgC9WkEGgpEdk73kJ1zg"
  },
  "YoykZSQOOyGlBq4dATOnEQ": {
    "date": "8/29/2016",
    "text": "It doesn't open on a bank holiday today. Please don't put a \"open\" here. Hope no one walk here then find nothing to eat and feel so disappointed like me.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bk8z0tX6ysCiXkl6YqxdHA"
  },
  "d1AFj9obwKSHKyGmJft2Qg": {
    "date": "9/30/2014",
    "text": "Is the food good? I guess, I cannot say but my husband really liked what was on his plate. I'm from Paris, France but live in California. I've been in London a few times and I love this city. I was really excited to take my husband for the first time for our honeymoon. I did all my research of where to go eat as my husband and I love to eat. When I saw the good reviews and rating on yelp, well I wanted to give it a shot so we went one morning. Unfortunately that morning I didn't feel like sausages, beans and stuff like that so I was looking for something that would make my sweet tooth happy. When I asked for a slice of cake, the guy behind the cashier (I think he was the owner) rolled his eyes at me, was irritated with me and made me feel so uncomfortable and so stupid for asking a simple slice of cake. Apparently the cake was only for lunch so I had to order toasts and eggs but I was so upset that I didn't even touch my plate. I would never go back and I do not recommend this place if you want to have a nice time and a good experience. They need to work on their customer service!",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "L31bR1F1c9T6HFGoo7sU5w"
  },
  "MsM7wQgsv2P9-h5BS329KA": {
    "date": "5/6/2014",
    "text": "Took the breakfast deal with eggs, sausage, beans, toasts and a  milk tea and added a pint of orange juice for 7£ total. This kind of breakfast will sustain you till mid afternoon, it's simple and effective : just how I like it!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sv0WP0V7o8Z1musn_pYMhw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breafast deal with an extra pint of orange juice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sv0WP0V7o8Z1musn_pYMhw/o.jpg"
      }
    ],
    "user_id": "L5LJYpoBgWrN7ZrBs8cR3Q"
  },
  "nKvk_3lUgn52IyUnLtoV6Q": {
    "date": "4/25/2016",
    "text": "This is exactly the right place to eat a Full English if you're touristing in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfxU7xGazFv3KJIuIOFxeg"
  },
  "LAjcbNwFUDJwwGCiijOdrg": {
    "date": "6/3/2015",
    "text": "A must go! A traditional \"Greasy Spoon\" where the bacon is perfect, the eggs are fresh and the service is excellent.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9eJ08A5-V0dLf_ZXHyBm_w"
  },
  "jOMPafDR5jCCMvVh4b6Bsw": {
    "date": "9/6/2012",
    "text": "One of the reasons why I wanted to visit London again from Los Angeles was because I wanted to try Regency Cafe.Yeah, I'm a Layer Cake fan, so I HAD to come here. I tried it a few days ago and I fell in love. I gave my order and in a few minutes, it was hot and ready. There was so much on the menu, and a long long behind me, so I got the egg, sausage, and chips, which was fabulous. Everything was prepared perfectly, and the chips were amazing!! I definitely want to come back again before going back to LA.Regency Cafe, I wish there were 6 stars on yelp!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "PgnMF7reUjWEejkdRk4dPw"
  },
  "3GJNd8oUJmM8GCKBqdy-pg": {
    "date": "4/17/2015",
    "text": "The best breakfast in london.  You'll never be disappointed with  what you order here. The set breakfast with tea, toast and beans: best of British. Orange juice served in vintage milk bottles and the lady serving at the front, who's voice needs no microphone is a staple here.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "faZ_3SYVN7EHlFb06RE-ZQ"
  },
  "c-znI27zq6B07YPLT5YcIA": {
    "date": "8/25/2014",
    "text": "As all the reviews say this is an institution. The food is all freshly cooked and no nonsense staples. I always have the chicken escalopes-wonderful! Chips are crispy and dry. Service is brisk and there are certain rules you need to adhere to-like not taking a seat until you have your food! The orders are shouted out by the owner in a voice which would drown out a sergeant major. If you want to come at lunch time best get there a little later as tables are at a premium.  Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jv8cyOBx-2Ay_vaj5rOygA"
  },
  "yrYa6IKIf_h9SBJMtUHP9g": {
    "date": "11/21/2014",
    "text": "A favourite place to go for lunch, with faultless food and prices, and owners that are full of character. The only negative is that there aren't more tables for 6, which meant we had to split up, but there's not much the owners can do about that. I had chicken escalope and chips, it was crispy, huge and delicious, and only set me back a fiver, with a 50p pint of squash to wash it down.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AQCCtgg_IXVjgKR5PlMdQ"
  },
  "bOOUBNMtkD_pipPjVenJ8Q": {
    "date": "11/24/2012",
    "text": "Such. good. breakfast. You can complain about how overpriced London is, but this place is a good way to get away from all the pretentiousness. Just good, old fashioned, breakfast food. Know what you're getting before you get to the register to order, and make sure you pick up your beverages and your toast before you sit down. Do not attempt to snag a table before you order, because you will upset the balance of the place. There is always a table available by the time you've ordered, just by virtue of how the place is run. Don't be that douche who hogs a table before you've even ordered.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aKAGlmoKsgnQ8Avh86-SOg"
  },
  "BXQi6_nYhT2kCipv2HZgMw": {
    "date": "10/8/2014",
    "text": "As authentic as it gets not just for the food but the experience of eating at a cafe/diner in London. From the gruff man working the register to the classic eggs, sausage, bacon, beans, and toast breakfasts, this was a worthwhile stop for a casual morning bite. I knock one star for having no bathroom for guests.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nyGNCMYE9ai15oTCtt2acQ"
  },
  "mSuoxcCio24fVskQGKrQbQ": {
    "date": "5/27/2015",
    "text": "A real greasy spoon! Great place to get a proper fry-up.Its a great place so it's not unusual to need to queue, but the service is great so it goes down in no time at all. And the food is worth any wait entailed.Writing about it makes me want to go back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hcGna-OEuQ7Adz41az6yg"
  },
  "m3EGhGaiY75zu3QSdJqjPw": {
    "date": "4/21/2014",
    "text": "I have taken a while to get around to this review. This place was so memorable. I was watching the new Bletchley circle this weekend and I was crazy with excitement to see it on the show. When we travel we like to experience what the locals enjoy so on our trip to the UK last year my hubby found it on yelp and loved the description of the owner. We took a bus and had a  wonderful experience. The owner is a character. We still tell everyone about his great way of pouring the tea. The food was typical British breakfast food. We cannot wait to return to London and I want to go back to experience this place again. The street outside looks like a movie set and I love the way the place inside looks untouched for 60 years. I am sure there was minimal set dressing required for the Bletchley circle plot.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "xog7RpO1g8oqmpy8CC1XRQ"
  },
  "w_tWfhJCSBQPowEk9pkdig": {
    "date": "2/27/2015",
    "text": "This was actually a very nice experience. It is busy with plenty of locals. The breakfasts are of good portion size. I am not a coffee drinker, but it was actually very tasty. I would easily go back to this place for another breakfast the next time I'm in England. A note to all: there is no public restroom in the restaurant itself. there is a public one not too far away, but I say go with your hands washed. :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyf2DKtNhfjycXZXAge0XA"
  },
  "xV4oPelRUyVnoWB5SMMfkg": {
    "date": "1/20/2015",
    "text": "Great tradiation British pub! The full breakfast is £5, a great deal for a large amount of food. The way the place is run with one cashier shouting the orders adds to the charm in my opinion.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sh9gNKffIASM_RutYE9LgA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. The full breakfast is 5, a great deal for a large amount of food.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sh9gNKffIASM_RutYE9LgA/o.jpg"
      }
    ],
    "user_id": "_xRfIwkp6oYE3jJ76zuq4Q"
  },
  "qccGksYIb-pPD5sBRZMsaA": {
    "date": "6/24/2014",
    "text": "My work colleagues and I are regulars - we like to find excuses to come. The ambience is uniquely brilliant and the food is great. The steak pie is made in house and is a favourite. The sausages are not just the standard frozen cylinder types you get in some cafés but a decent butchers sausage.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jBqJ32j3nsyugAhuh0h2bw"
  },
  "88iHNIBt_6p-jHB574JLVg": {
    "date": "5/6/2014",
    "text": "London is expensive city for tourists, however Regency Cafe breaks the mold. It's where value meets true unadulterated goodness. You'll find an efficient staff who cranks out a full proper English breakfast with all the fixings and great coffee.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qfWDX-MHOMCVC6IJ0e9xqQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. You want this, trust me.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qfWDX-MHOMCVC6IJ0e9xqQ/o.jpg"
      }
    ],
    "user_id": "NEpRRdK0vgo5eL3F8peFAQ"
  },
  "dZ_aJo9Nl8IBHjMk7xhiyQ": {
    "date": "9/16/2015",
    "text": "Proper English breakfasts served all day, served quickly, served hot, served in a clean environment full of character and above all tasty and vfm.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "INVx3MKlgB_uMR4KmuYAgA"
  },
  "DMZHe8RI8nMoYBSt_3RuIg": {
    "date": "8/18/2012",
    "text": "Five stars are deserved just for the birlliant vintage atmosphere this lovely cafe emits even when closed. A friend showed me the way on a recent walk, and I can't wait to go back during opening hours. I never thought proper greasy spoons would become such a rarety in London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A4OtipaRVBv0EKGWslEnjA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/A4OtipaRVBv0EKGWslEnjA/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "N2pYO060BApkRXfRJy7z6Q": {
    "date": "11/4/2015",
    "text": "Lov the food and layout of decoration , very traditional English style, many locals go there",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtN_MjFgj640f3jyl0xnRw"
  },
  "LAEofxQqCWKdsSaFknJeAg": {
    "date": "11/7/2013",
    "text": "Regency Café is a full English breakfast experience. I'm an extroverted person, but I get oddly nervous about ordering food at a busy counter, particularly as a US expat. This is probably because a) the whole restaurant can hear that my whiny American self wants extra bubble and squeak with no mushrooms, and b) the person taking orders has exactly five seconds of attention for my complicated order.It was an early morning business meeting, so I had other things on my mind to outweigh my counter fright, and the restaurant was mostly empty anyway. My valiance was rewarded generously with a heap of complicated order fry-up--complete with runny yolks (and charmingly runny hot chocolate).Don't be intimidated by the Regency. Be brave, ask for what you want, and you shall receive!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hhHdA-UuG5DG1XYXfClPtQ"
  },
  "-h912IlCS9qndJSPSw6euA": {
    "date": "12/13/2015",
    "text": "Amazing food, excellent people, great experience.  Being an American in London for the first time I wasn't sure what to expect.  Everyone from the staff to the cafe patrons were helpful.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdkveRkAeeilSviYhz-TUA"
  },
  "xl9MQa3iaHj3ZVCFSGpV2w": {
    "date": "10/31/2013",
    "text": "Wow. I was staying with the friends in Vauxhall and we were looking for breakfast. Pull up Yelp and what comes up as #1? Regency Cafe. Good reviews, nice pictures, close to us. Meets all our criteria. Little did we know what we were walking into.We must have gotten there at the right time because by the time we got our food and sat down, the line was out the door. Even if we would have needed to wait in a line, it would have been worth it. This restaurant is just about as cute and British as they come. I wanted to go back every day of my trip, but knew I needed to explore other places.You can get a pretty traditional full English breakfast but I opted for some a la carte offerings. My friends wanted to experience the full English and they really loved everything on the plate. There wasn't a crumb left when they were done. I got some chips (fries) with my breakfast because it was on the menu and really, why not? I mean, we eat hash-browns and home-fries with breakfast, so why not regular fries. I am seriously considering starting to order this in the states. If you are in London and want a great breakfast, go here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OmIpIfTXP3i61FyEi4gPJg"
  },
  "zbIcbzGi1gAh4VK8KacHWw": {
    "date": "8/18/2015",
    "text": "Regency Cafe is a greasy spoon great place for a full English breakfast !!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9XZNVJHQZvzTz0wVrx0M2Q"
  },
  "slPKu8y5GKZUHYfI5X-t2A": {
    "date": "12/6/2016",
    "text": "Stumbled across this place while trekking from St James to Pimlico. This is a proper cold school cafe, staffed by real gents! The food is top notch and even offers liver on breakfasts (takes me back years). Great value and a great setting, bathed in history.......almost expected to see Michael Caine and the Kray twins walk in! Don't miss it if you get the chance. Kirk",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9VYEQxZoVHjvLHV9cW52Tg"
  },
  "Qs9btyPULjN-BJCGS39fyA": {
    "date": "9/12/2011",
    "text": "Very solid English breakfast. It's close to a lot of the sights, and getting breakfast is pretty simple - go to the counter, order, and then grab your food when it's announced. Sticking to the basics is simple - you get one over-easy (or as it appears to be called in the UK, fried) egg, British-style bacon, sausage, baked beans (certainly not something I've eaten at breakfast usually, or even in a while), and toast. The price is reasonable by UK standards (5.50 pounds), and you certainly get a full plate's worth of food. The meats are done well; in particular I was a fan of the sausage. Everything else was pretty standard by my tastes. Aside from the price (which is expensive to us Yanks with the depreciating dollar), I do wish we could've been served a simple glass of water instead of tea.All in all, though, a very solid breakfast joint, and I'd come back if I wasn't looking for anything too fancy.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CJmtS1Uk1KSsY2MWol_E7g"
  },
  "MTQyYOWmtQWqZBWIsPdsyw": {
    "date": "11/8/2013",
    "text": "As one reviewer said, it's a classic English greasy spoon. Every few Fridays we head over for fish and chips. Clean tasting food, not greasy, with a great crunch! I'm still startled by the little lady's big voice. Arrive early (11:30-12pm) to avoid the line!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Nojbzdj6az1Kw2SMMoF6lg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Friday's Special: Fish and Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nojbzdj6az1Kw2SMMoF6lg/o.jpg"
      }
    ],
    "user_id": "6K7XUKatdjtfbBLxFVScnQ"
  },
  "_aYKiNOdShs4MonJ7xlGbw": {
    "date": "11/26/2016",
    "text": "Loved it. Old school but also cosy, seems like the perfect place for an authentic, quick and cheap English breakfast: sausage, bacon, eggs, beans and roasted tomatoes plus delicious bread with butter. The ordering experience is interesting, and given that the place is constantly busy, necessary. Would definitely have breakfast here again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_3uGifP8_xHKa8X7XKU_Bw"
  },
  "ZB0yitokr7WUvkaXS76RRw": {
    "date": "9/7/2011",
    "text": "\"Set breakfast with beans!\"I'll always remember hearing this shouted while I ate my bread and butter pudding. This is a real British diner type place where locals go regularly. We went for breakfast though we heard dinner was great too. It is a bustling place and not for someone who is super fussy. The bacon was awesome! Service is incredibly friendly and efficient.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NfHDvT0wU6EZlOT42UgEPg"
  },
  "q88v2Osb8pedNBia5FJQdw": {
    "date": "1/28/2013",
    "text": "Came in for breakfast on Saturday. This place was something of a letdown. There's a long line, there's not much choice in breakfast (it's pretty much just full English breakfast and Eggs Benedict). I got the Eggs Benedict because I had eaten sausage for 4 straight days prior. It was a very mediocre Eggs Benedict. NYC places would treat Eggs Benedict as a work of art. This place treated it as a chore. It did have a sort of charm, though, as did the man fronting the operation. He was a very English guy, with an unusual amount of charm, energy, and efficiency (yet still quintessentially English) He was taking everyone's orders and coordinating the kitchen folk, and seemed to love his life and his job. Stand-up guy! The food is prosaic, as is the ambience, decor, and the uniforms of the worker. Only in England could you find this, but it's beautiful. I will have to come back and try an English breakfast.",
    "rating": 3.0,
    "rated": {
      "useful": 8,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "9uf4g85B_gz2W4d_GZI-Wg"
  },
  "vJaQR1flLz89n3CY9X8hYQ": {
    "date": "8/5/2015",
    "text": "I was in London for a day. My brother had been here months ago because of the reviews on Yelp. Told me I had to stop by. I had the beans with egg and bacon with toast. Absolutely delicious! The host, Marco was an awesome gentleman. Thank you! Will be back again whenever I visit London again",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WFYa6MPsLsbaEWv09voVUA"
  },
  "WSygBEJ6dmAW5Sc9vW50UA": {
    "date": "6/29/2011",
    "text": "Often the places I try on Yelp let me down. This one is not even close to disappointing.Indeed, this place embodies why you come to yelp. To find awesome services.You've missed out if you don't visit this place.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kFS9ZKNO-earRi4XJCeoHg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Just as it should be",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kFS9ZKNO-earRi4XJCeoHg/o.jpg"
      },
      {
        "img_id": "2JiLW894m6_LfFaz87yMHw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. The special.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2JiLW894m6_LfFaz87yMHw/o.jpg"
      }
    ],
    "user_id": "M-mbXeHjJrx8RpxZ19UH5g"
  },
  "EiK1Wa6lTtWbpeALBQi52w": {
    "date": "6/18/2016",
    "text": "The place is terrible!! One of the worst place I ever been for breakfast!! Salty food, dirty glasses and rude staffs!! Very disappointed!! It's good value if you don't mind about the quality of food and service. The cashier/staff is also using the same hand for getting the bread and taking money from you.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vvvXT1Q23woF2jfH1qR-Hw"
  },
  "bG-aOaYUHizll3Y2_NyccA": {
    "date": "9/7/2015",
    "text": "The Regency Cafe may very well have been the best dining experience that my wife & I had on our recent trip to London. It's an authentic no-frills English breakfast & lunch spot where you queue up and order from the counter, where a woman (who sounds like she belongs on the stage of the National Theatre) bellows out the ready orders. We had a traditional English Set Breakfast with \"tom-ah-toes\" and hash browns -- DELICIOUS and a great price!! It's an experience you shouldn't miss if you are an out of towner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jYSP5jlcmlLPssRPjZSB4w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Interior of the Regency Cafe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jYSP5jlcmlLPssRPjZSB4w/o.jpg"
      },
      {
        "img_id": "j8SMOIg5iWFI5Ae1SiJB1w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Regency cafe exterior",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j8SMOIg5iWFI5Ae1SiJB1w/o.jpg"
      },
      {
        "img_id": "jwdMZG1XKfHEUR0BcL5ONA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Coffee, English Full Breakfast with tomatoes, toast and a split order of hash browns",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jwdMZG1XKfHEUR0BcL5ONA/o.jpg"
      }
    ],
    "user_id": "f7wFbq7TBGLDNzs2uWKBWQ"
  },
  "EkkJll302SlV1T8jnXf68g": {
    "date": "1/7/2018",
    "text": "After multiple trips to London, this has been the best food, service and location I have found for a meal.As an American, the best part of going to the UK for me is being called \"Love\". Don't ask me why. It is likely a combination the wonderful sense of familiarity you get when a term of endearment is sent your direction and far too much exposure to British literature, TV and movies.Not only was I called \"Love\" by the proprietor, this place FELT like love. It felt like home, like I had just sat down at the table of Nonnatus House, or made my way in the The Burrow, or that I could soon be accosted by Mrs Bennet telling me that Netherfield had let at last!Sadly, I was sick when I found my way into this slice of heaven. AND YET, I had what I would call the best egg sandwich of my life. Thick slices of white bread I wanted to rest my head on, and eggs cooked to perfection, with fresh ground pepper and salt. I have dreamed about this sandwich almost daily since having it.I love that the tea comes out of a big urn, and that the menu is simple and hearty. I love that it feels like you are part of the family when they call your name to get your plate. I love EVERYTHING about this place. It will become a mainstay of all my London visits, and it should be a definite stop for you, if you're in the city.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "S7x7eGloiPZ1gjJpej6HrA"
  },
  "ScqC_irSOZltGkaA6GpkGA": {
    "date": "8/1/2018",
    "text": "Short walk from the Doubletree hotel. Traditional English breakfast. The owner runs a tight ship, which is appreciated! You order your food THEN find a seat. Don't try and find a seat first, you'll get yelled at! Lol Food was great! Quick service! Line can get long, but if you are looking for a traditional English breakfast and coffee at a low price this is the spot!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UHg-RKnCthB4vHQcBClmUw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Scrambled Eggs, Ham, Sausage, Beans, and Toast!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UHg-RKnCthB4vHQcBClmUw/o.jpg"
      },
      {
        "img_id": "0pLkt9Zsr9qiOrvKVOzzhw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Coffee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0pLkt9Zsr9qiOrvKVOzzhw/o.jpg"
      }
    ],
    "user_id": "BtnYqxEmEwO8IQOJLchEww"
  },
  "WUTYR_qcO3HCW1lTrHE_xg": {
    "date": "7/21/2017",
    "text": "Classic, traditional, cheap/affordable English breakfast. What else could you ask for?Visiting London for the first time and I just had to try a full English breakfast at least once. Worth checking out: I'll definitely come back!Great customer service - even though I could barely understand their infamous British accent... So embarrassing on my part. People there were so nice and cool! Get in line, order your food, get a table, and wait until they call for you when your food is ready. Just that simple. I came early on a weekday (around 8:00 am) and there was no line whatsoever.Ordered the set breakfast with the egg, sausage, bacon, beans, and toast and I added black pudding for extras. The food was good and homey. Good portions; I barely finished my plate. So simple, yet so good and satisfying.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "67H9aBRyCKClNxa9LTgQ7g",
        "caption": "Photo of Regency Cafe - London, United Kingdom. English Breakfast with Black Pudding and Tea w/milk",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/67H9aBRyCKClNxa9LTgQ7g/o.jpg"
      }
    ],
    "user_id": "z7ufQbkr_Pp1fdVUnhU0XA"
  },
  "WL_xegVN7VhauQSDlqyI-w": {
    "date": "7/7/2017",
    "text": "I don't know what I was thinking- I have very few pictures of this place. Wish I took more pictures. Their English breakfast is delicious. And the best bang for your buck. No actual vegetarian option, so I did a lot of adding and switching with my other half to create one: beans, has browns, eggs, bubble and swueemThere were a bunch of options, most of which I didn't understand, but they were patient as I fumbled through choices for coffee or tea, with cream & sugar? toast or bread (bread is lovely), bubble and squeak...? What? As you can tell from above, customer service was great. It's kind of confusing because you don't get a number. They just call out your order and you go and get it.Since we were clearly from out of country, we just kind of sat down and wandered up every time something sounded like ours. The lady just glanced at us and shook her head until it was ours, and then she finally said, yes, this is yours. But not horribly. Just matter of fact. It's definitely an experience worth having, even though there's not really a close bus stop. The food was well worth it.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_9vNkA7M_lXqsJeYlrpUrg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Tea- no cream or sugar. Toast & bread. Bread was different. Soft. Great texture.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_9vNkA7M_lXqsJeYlrpUrg/o.jpg"
      }
    ],
    "user_id": "A1xJX2E-YtUPp-5npQcjJA"
  },
  "UEIWy2qpFJNnvBxMvKziwA": {
    "date": "7/25/2018",
    "text": "Had the set breakfast and added black pudding and hashbrowns. It was outstanding! Small cafe with friendly staff. Highly recommended.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jHUH2zmyfAF7ZpvaFTSXlA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jHUH2zmyfAF7ZpvaFTSXlA/o.jpg"
      }
    ],
    "user_id": "tYJCik85MNMQtNisvUkXPg"
  },
  "DkmAsaozpmbdHbGELwPMnA": {
    "date": "1/24/2018",
    "text": "Wow! This is the spot to have the traditional English breakfast and it does get very crowded after 8:30 am in the morning! We went and got the traditional bacon, bread, beans and eggs, my bf got tomato instead of beans and both broadened our horizon! They are good of course but it is the experience of eating traditional English breakfast with Londoners that we love and cherish a lot. If there is another opportunity I will definitely go back to London and go to regency cafe again! Oh please note this place is cash only but does not shadow any beauty of this little historical great restaurant!!! There is even a picture and autograph of Al Pacino on the wall, how awesome is that?!!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "adpgbHFTfeLS3phzuyWF4g"
  },
  "koBPgrSuKQbRWPDGLjCSQA": {
    "date": "4/21/2017",
    "text": "This place was incredibly good. Unlike a few of the other reviews, I actually didn't have any problem with the service. I came here by myself on an early Monday morning with two weeks' worth of luggage; I had just gotten off of an overnight bus from Paris and was absolutely famished. I ended up sitting at a 2-top table relaxing and planning out my day for a good three hours, and never once did I feel rushed by the staff.I did already know what I wanted to order (breakfast deal + hashbrowns), but the workers were still friendly and one thoroughly recommended the black pudding. Everything was absolutely delicious! Ratings of individual foods:Black pudding - 5/5 (love that stuff)Hashbrowns - 5/5 (served super hot and so yummy, but let's be real.. when are hashbrowns not good)Tomato - 5/5 (always a sucker for a good grilled tomato)Egg - 4/5 (fine. it's an egg)Sausage - 3/5 (a little oily and salty for my taste)Toast - 3/5 (always meh in my opinion)Bacon - 3/5 (also very oily and not hot enough)Coffee - 6/5 (don't know what it was about this coffee, but it was absolutely STELLAR! they sprinkle some sort of cocoa / cinnamon on top that takes it from good to great)Overall very impressed with this place. You'd be hard pressed to find a better place in London for an affordable and delicious English breakfast!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "riQHQYoc40fpuvij33j76g",
        "caption": "Photo of Regency Cafe - London, United Kingdom. set breakfast deal + hashbrowns + black pudding",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/riQHQYoc40fpuvij33j76g/o.jpg"
      }
    ],
    "user_id": "btdMwcbzwNPbsCcI-cLl4g"
  },
  "vAsX3idH1XPCvdHKFLdpJQ": {
    "date": "9/20/2018",
    "text": "Fantastic food, fantastic service. The line was really long, but it went really fast. We are already planning on going back during our stay. Highly recommend!!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhBig4X8nllRHqh23J1tqg"
  },
  "6005a9KhP_PQ-VU7Q0oVBQ": {
    "date": "8/27/2018",
    "text": "Cheap food and delicious. Can get super busy in the mornings and lunch. Always have to wait but service and turnover is fast. For breakfast i get their ramen with spam and egg but for lunch i love their baked rice with chicken mushroom cream sauce",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SYYSRmBFbitfmphIJohNXg"
  },
  "UTlPxPom9dbeAiWzpLAiaw": {
    "date": "1/4/2018",
    "text": "Walking into Regency Cafe was like stepping back in time. This 70's diner serves simple meals for all day long. My bf and I had an early tour to get to on our last trip to London and Regency was on the way to the bus station so we stopped by for some breakfast. We were surprised at how much we liked this neighbourhood gem that we came back again on our last day. As a Canadian tourist, this is one of the few restaurants that served affordable food without breaking our vacation budget. If you're coming in the morning, it's filled with locals and construction workers because of how early it opens. I loved sitting by the window and people watching while I ate my first meal of the day. Being a tourist, it's always interesting to see how others start off their work day in a different city. If you're coming during the lunch hour rush don't even attempt to hold a table - you're not allowed, there will be a sign saying this. When I say lunch hour rush, I really mean it - expect a line, sometimes extending outside the doors and around the corner. You're welcome to come grab lunch and dine-in, but I would watch the time to make sure that you're not overstaying and being respectful of other people who want to sit and eat. There is no table service here. You order at the cash desk, and wait for your order to be called. I don't believe they call numbers so I would recommend that you remember what you ordered :)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vip_-l5LZeUXAcna9mxAHA"
  },
  "yWi9BAwfQkT6ATxuf9wq9A": {
    "date": "10/29/2018",
    "text": "Walked for miles to get to this café. Cash only. No alternative. Gruff attitude. ATM in nearby shop not dispensing cash.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cs5Qz9q9Wlryq6H8z2iEOw"
  },
  "ujTYR2P2k_yFUG6CNKT_fQ": {
    "date": "6/19/2018",
    "text": "Honestly, this place is amazing! The staff was great, food was outstanding and the price cannot be beaten!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PZEdefFjBKX0zenBBrWtdw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Best English breakfast ever! I'd come here everyday if I could",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PZEdefFjBKX0zenBBrWtdw/o.jpg"
      }
    ],
    "user_id": "wRnBIBV84sFvAVltMAlsXw"
  },
  "OCVcKgOSxMif6CSvVJSUnw": {
    "date": "8/31/2018",
    "text": "Amazing food and staff. The lady taking orders has the voice of a powerful engine ! Awesome I really enjoyed the time here . Must visit again",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FSMKQ9qpthmNNJ6WZcF45g"
  },
  "ZzW6QmvNowG5l7gtPQrDCQ": {
    "date": "11/30/2017",
    "text": "I didn't really anticipate this place being my favorite meal in London - but it was pretty much no contest. After some decently pricey meals in Europe, Regency Cafe is an absolute steal for some ridiculously well done breakfast. We ordered a big plate of breakfast and an carafe of OJ (which was only 50p!!! Why am I being charged like 8 dollars for orange juice in the US?).Our breakfast had Eggs, Hash Browns, Sausage and Bacon, Black Pudding, and Tomatoes along with a side of toast. It was a little too much for us particularly because of how heavy everything was, but it was DELICIOUS.Sometimes I don't really know why breakfast can taste so good. Everything is simple. But they absolutely crush it with their execution.I wasn't sure about black pudding having never had it, but it was quite delicious. I'd compare it to eating sausage with a little bit of an earthiness to it. The tomatoes were key as the acidity helped with all the heaviness of the greasy meats. Everything else was just great.I'd definitely encourage people to try and show up early. When we left a little after noon or so, the line was stretching up the block with probably 100 people waiting. We managed to arrive when there were only 20 or so people in line. Seats open up almost perfectly in time by the time orders are made and filled, so don't panic if it seems like a booth won't be available in time.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KbwOwQZTOfrtaeJdmucALQ"
  },
  "nUGkFedEBMotgJnefS4bJA": {
    "date": "5/3/2018",
    "text": "This is such a traditional English diner. We've never had \"bubbles and squeak,\" or \"black sausage,\" before. I liked the bubbles and squeak! Service is quick. This is great for your typical diner breakfast! Cash only!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m7JCHsC7_zX21Xr_TnmiyQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m7JCHsC7_zX21Xr_TnmiyQ/o.jpg"
      }
    ],
    "user_id": "3x-mXkR_IKimAcwxF6ZrxA"
  },
  "X5AC1u7gOPNJqIFxMsBJtA": {
    "date": "4/11/2018",
    "text": "The food was good. The lady behind the cash register is making a show when is yelling for the orders. It was a first time for me to try Black pudding and it's not for me, but the rest was good. For 6£ you get egg, bacon, beans or tomatoes, sausage, toast and tea/coffee. Its cash only!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ArR7_WPQHKsGUjeAGFcypQ"
  },
  "pkjO7v1pS8qsE529iCWq-Q": {
    "date": "10/10/2017",
    "text": "I'm probably gonna get a ton of hate for this, but the English breakfast here was way too salty! I would rather shell out a couple extra £s for something a little more decent. Sorry. :(",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tBBdUXWAQay6rb0nz05lZQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set Breakfast Deal (5.50)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tBBdUXWAQay6rb0nz05lZQ/o.jpg"
      }
    ],
    "user_id": "9yBMl0rSAB2odhSc6y4BZA"
  },
  "mrl4USAe-HWmZ3E1FEe07g": {
    "date": "2/27/2018",
    "text": "Inexpensive English breakfast (at 6 GBP)This is obviously quite a popular place--for that. CASH only",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H3bwp9vhosg3UuH-J9FXKw"
  },
  "8kNcPVDvLXDzWz3ggYfcjg": {
    "date": "3/14/2018",
    "text": "More happening than the great revenge scene in Layer Cake - solid fuel for working people. Had no issue navigating the engaging cafeteria ordering scheme - it was a great experience and the food was on point. Orange yolks are signs of quality sourcing! Well worth navigating to when in town.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QXgu1DiH7_CgVDmYYpXXw"
  },
  "tpnm-Q2j4yF1DWuZt3rcSg": {
    "date": "6/11/2017",
    "text": "Came here for brunch at around noon and there was already a line out the door on a Friday. Note that this spot is CASH ONLY. Wait in line to order and then find a seat. They will call your name once your food is ready. We order the set breakfast deal with toast, tomatoes, tea for 5.50! Also added hash brown and it was so good! Definitely recommend checking this spot!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "512KoGDEzgEHsvBdYi2j3A",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/512KoGDEzgEHsvBdYi2j3A/o.jpg"
      },
      {
        "img_id": "vw2SkJmofRspFZWy29i0VQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vw2SkJmofRspFZWy29i0VQ/o.jpg"
      },
      {
        "img_id": "H1ZEXFia0LGD6U2-yfqJoA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H1ZEXFia0LGD6U2-yfqJoA/o.jpg"
      }
    ],
    "user_id": "ewQQUh_ayibtPbm8JFlLrw"
  },
  "FfNsbxIVWwV0xsHBM2zuWw": {
    "date": "6/24/2014",
    "text": "My Mum sent me a link to The Regency about 5 years ago, which just said \"JUST HEARD ON RADIO THIS IS GOOD PLACE FOR BREAKFAST.\" So, the next time she ventured into the City, off we went to the backstreets of Pimlico to find out how much we could rely on Radio 4's recommendations. Turns out, they really know what they're talking about.It's incredible. A beautiful cafe of a certain vintage, it's all the better for not having been updated. It's unbelievably popular, but I've never struggled to find a seat (and we've been back a fair few times since). The clientele is a mixture of tourists, workers and locals, most of whom look like they're regulars, which is a great sign. I've only ever been for breakfast, but as it's the best full English I've ever had in London, I assume the rest of the menu is also fantastic.Every time I've been with my Mum we've had the same argument - she is convinced that the counter staff wear microphones, as there's no way they can project their voice like that (she's wrong). When you go, you'll know what I'm talking about. Just trust me when I say, definitely order before taking a seat - hell hath no fury like the Regency staff scorned.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7Y9Xb-jq4t7fbGBFwxqew"
  },
  "MzOAOfq9Is5SU5n3JzXZIA": {
    "date": "9/24/2014",
    "text": "Amazing! Felt very much like a place where locals go. And it was delicious! A must go breakfast/lunch spot while in london.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HR1GjzpfsljyjNXTWBX1bQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Sorry we were hungry!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HR1GjzpfsljyjNXTWBX1bQ/o.jpg"
      }
    ],
    "user_id": "7Mhu4IDUQ3R0gW9CZsg54g"
  },
  "JL_GFNp9pgVM31y3oIefNw": {
    "date": "4/12/2014",
    "text": "This place is ridiculously good.  I had the English Breakfast and it was divine.  The hash browns were dark and crispy and the eggs were fantastic.  Can't go wrong with some tea either and I actually enjoyed the beans as well.  Would highly recommend a visit here next time you're in London.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "j5mI694mCMYEPsHEGtz2yw"
  },
  "lytr04MURkOoLnCDjrvvdg": {
    "date": "3/7/2014",
    "text": "Very affordable, good value cafe with the standard British breakfast and lunch food. I had to come here for my last lunch in the neighborhood before we moved offices to the other side of town, because I hadn't tried it yet, and I'm glad I did! The lunch crowd is rather busy, so you may need to share a table with someone else if you're only one or two people, but I didn't mind too much.Many tasty-sounding choices, but I settled on the vegetarian version of the eggs benedict (normal but ham-less) and chips (because according to reviews they are fantastic). I really enjoyed both, but made the comedic mistake of putting sugar on my chips instead of salt. It took me a while to realize my mistake, too, because the salt shaker was hidden - I thought at first that the chips were just really sweet. Then I finally found the salt shaker and had the second half of my chips in a sweet-n-salty style. It's interesting, you should try it sometime!",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 8,
      "cool": 6
    },
    "photos": [],
    "user_id": "VTHNbsEN_tmd7_--2Wv6LQ"
  },
  "P5M-bp1qpZ-Vr_USeCs0AQ": {
    "date": "5/30/2016",
    "text": "Food was awesome and so was the counter clerk! Despite having a line out of the door, he still made the transaction very personable and funny. Quick food and service! Friendly staff and reasonable prices! I would definitely go back!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lt58KLXo3qJW8u5tDTaYpQ"
  },
  "4IJyAtnLFyaTCpFi_4qZUQ": {
    "date": "12/7/2015",
    "text": "This place is definitely Greasy Spoon.But the food is so so good! Watch for the hostess. She has the most impressive voice of them all! I was so taken aback that I forgot to order the dessert I was planning to have along with my meal. I got the home made steak pie and chips and it was very very good, as far as British food goes. It's limited seating, yet very popular, so be prepared to share your table with others. I went on a weekday mid morning and they were busy, but the line wasn't out the door and they got through very quickly.Cash only.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBhF0NuQGaNEX4yffCoVmw"
  },
  "JTCQbSxPouroSkoANu8beA": {
    "date": "5/24/2016",
    "text": "The English seem to have very low standards for breakfast. My bacon tasted like fried liver, the coffee was in no way coffee.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xc1s5KzPbbwS7PKspzAbJw"
  },
  "ZoU4axznnAiXaBOMPJQ4PQ": {
    "date": "5/18/2015",
    "text": "If you are looking for a great English breakfast for cheap then this is the place to go! Has a small diner feel to it and you can't beat the prices. Seriously the best fried egg I've ever eaten in my entire life.  My only regret is that we discovered it on our last day in London and not on our first. You will not regret eating here!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xvh3xxZ1r6otSiN3HIcBrw"
  },
  "gefwqdPu_O4-eNOWvRTk4w": {
    "date": "5/13/2015",
    "text": "One of the best full English in London! Always a treat to pop in before I go to Tate Britain.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eC3DmMUo8JhOmuvrNGXlHw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast at The Regency",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eC3DmMUo8JhOmuvrNGXlHw/o.jpg"
      }
    ],
    "user_id": "SZSnKR6F--q2mIZPJI59Lw"
  },
  "UYC5fiHLMAK5XYeMdyiZzw": {
    "date": "7/22/2014",
    "text": "This cafe has never let me down !The best brekky in London and last of dying breed . well worth every penny and quality on a plate .Took a friend there the other day who was telling me about his local cafe , who then had to admit it's the best brekkie he has had :)))))))))))))Try the hash browns ( My fav )or anything else for that matter is quality produce and can actually taste it .well recommended .",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8uNXvmaY2Rqy5t7VoTAKww"
  },
  "EGixliUrFtJX55kiAItzjg": {
    "date": "3/31/2014",
    "text": "This place is deliciously good ans so welcoming. One of the major complaints we have had at a lot of the restaurants we have tried here has been the service. This is not the case at Regency. It's a simple restaurant with an amazing owner (guy at the register) and great overall vibe.The owner patiently waited and helped us decide what to eat. It was affordable (cheap actually for London) and there were so many things we wanted to try. We had baked beans, the bubble and sqeak potato, black bloody sausage, regular sausage, eggs and coffee with milk (comes with a dab of chocolate powder melted) . All delicious and hit the spot.Tables fill up fast here, but everyone is so nice that is here. We want to come back and try other dishes. Perhaps we will!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CcioG0EHGphZLnNYj-6PyA"
  },
  "06z87bi-PYKFyEDl00BIgg": {
    "date": "5/29/2014",
    "text": "When I was in London I found this place through yelp and thank goodness! The most authentic British pub, it has a history, run by GREAT people with good energy and the food is amazing. Not only that, the price is great and you get a good amount of food too! You def won't leave hungry!If your looking to eat a traditional British meal while visiting London, come here! You won't be disappointed. **bangers and mash  **Shepard's pie **bubble and squeak***coffee",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "soLStDwK2FbxSWIq_w31zQ"
  },
  "MH0GR5gdU3Db3sJqTuCsuw": {
    "date": "8/16/2014",
    "text": "Incredible. Queued outside on Saturday at 10am but had food within 15-20mins - when I left people were still queuing out the door. But great atmosphere - I enjoyed waiting and watching. The food itself is very good - beans, bacon, sausage, egg, beans. Delicious bread, solid cup of coffee. Staff are friendly; it feels like you're in London in the best way possible. I'll definitely come back.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fbve4GuRYq9CKRPd9lJmHA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fbve4GuRYq9CKRPd9lJmHA/o.jpg"
      }
    ],
    "user_id": "evMRPv4Xw2IchjnxR-7mIw"
  },
  "EL9V_b6YY45nmTAvikdsFw": {
    "date": "4/14/2014",
    "text": "An amazing iconic caf! You enter to the sounds of a well projected below of orders up by jimmy. Both him and his female counter part have the most amazing support voices that ring across the hoards of taxi drivers and builders.But don't be mistaken their food is great. They make the best bacon sandwiches of all time. Amazing bread and lots of brown sauce. That is the key. You can sit in the same seat where Daniel Craig beat the man with a teapot in the movie Layer Cake, while enjoying our fry up. A must visit Caf, I that exists",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EO-uLAD-V849Fo_4xcx6Ow"
  },
  "yRL3FnHQ03sI8pIrVY5YEw": {
    "date": "2/12/2016",
    "text": "Great place to eat a typical english breakfast ! Good system of service, very quick and the man taking order is awesome. I def recommand this place if you're visiting London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7h7HvqiPvje3RKSlC9iLZQ"
  },
  "dEDdfxSbtYTQdKH7CpK6CA": {
    "date": "2/10/2016",
    "text": "We absolutely love this place. Great food, fast service. What more could you ask for?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jcV6a23JKrFc_F9Fd8SeVA"
  },
  "GLqt5pQwSQ2c19okiNB6uQ": {
    "date": "5/8/2014",
    "text": "This place is great!  The portions are off the chart and the traditional English I got was spot on. Will be back!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ous_YNsgfC1EQBcIQW1xOA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Ous_YNsgfC1EQBcIQW1xOA/o.jpg"
      },
      {
        "img_id": "VwzrbfyZeuCUfruu7OLFjw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VwzrbfyZeuCUfruu7OLFjw/o.jpg"
      },
      {
        "img_id": "0kZlaDvxRUPJ9534eSSGUw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0kZlaDvxRUPJ9534eSSGUw/o.jpg"
      }
    ],
    "user_id": "RnUtyB0AN0omJECH1YAhdg"
  },
  "5-8cKOS7g28WfjARxar2Aw": {
    "date": "1/2/2016",
    "text": "Great full English! Be ready with your order and follow the rules - don't grab a table until you have ordered. Eat up and leave. We didn't think there would be a table for us given the length of the queue but there was. The system just works. The food was out quick, hot and delicious! Will definitely be back.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dOODbYoJHUgHRZeolgJUvA"
  },
  "w2lB8s2ZEf7n2pqMKat1YA": {
    "date": "1/2/2016",
    "text": "Really good, we had the burgers and chips. We were really impressed, everything tasted amazing! This place stays packed for a reason, seriously worth a try. We hope to go back and try their breakfast!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xetgENmU-oO3P2VK-w_IfA"
  },
  "6c5ehSMLbkcQB5HHj3WsNw": {
    "date": "1/1/2014",
    "text": "Really fast paced restaurant and you order first then seat yourself. I like the atmosphere it really gives me a good london breakfast feel to it. The breakfast is definitely different from the american style diner breakfasts but I am probably more used to the american diners.Ordered the standard breakfast meal which came with bacon (looks like peameal bacon). I usually hate beans but these beans were pretty good. Picked the bread and not the toast and it was very good. Was just bread and butter.Not sure what the brown sauce really was but t went well with the meal. Great for vegetarians as there was beans and grilled tomatoes and of course eggs :) Choice of tea or coffee as well.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Goa5tRkCURz-53WZAABBEw"
  },
  "IAb8rCw0-PsuqMrmMD2ABA": {
    "date": "11/5/2018",
    "text": "Wowza...what a find.  Want to know where the locals go for breakfast.  Look no further.  Don't get me wrong.  You'll find your share of tourists like myself.  Regency Cafe is no secret and definitely shouldn't be.  The food is brilliant and highly affordable.  Don't be afraid of the long line or grabbing a table.  Trust the process.  It goes quickly and seats will be available for you once you're done ordering.  Get the set meal, add all the sides, pay 9 gbp, and enjoy the rest of your day.  Seriously, the amount of food is massive and probably one of the best breakfasts I've ever had.  They were out of bubble and squeak the day I went so my sides consisted of black pudding, hash, and mushrooms.  Everything on my plate was cooked and seasoned perfectly.  I can't speak highly enough of my meal.  I was also full all the way through dinner time.  This spot is a MUST if you're in town.  If you want real English breakfast, make a stop here.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wrzS6Oaxz-r-Waj6qhyygg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wrzS6Oaxz-r-Waj6qhyygg/o.jpg"
      },
      {
        "img_id": "9fqAF8vggRcPTkM1SRz8dA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9fqAF8vggRcPTkM1SRz8dA/o.jpg"
      }
    ],
    "user_id": "Dj77pkw_EZJvR-F4RIf_BQ"
  },
  "MPfyK5QbftGjNiSe1HTMWQ": {
    "date": "11/3/2018",
    "text": "Review #900! Regency Café was one of the shining stars in my London dining experiences. I forgot whether I found them from searching on Yelp as I was finishing my tour of Buckingham Palace or via a bunch of lists of Must Eats in London, but they are well worth a trip!One thing to note, don't come on a Sunday! They're closed on Sundays! We came back to London last year (2017) and had just finished visiting Buckingham Palace (again! We had the one year pass that barely expired that day.). We walked to Regency Café and thought we heard the familiar loud bellowing from their female employee that calls out the order. Oh, we were wrong. They were closed that day. =(So let me take you back to our first visit in 2016. We came close to 2 pm and it was still pretty packed, though the queue to order was not too bad. We ordered the steak pie with potatoes and vegetables (£4.30) and the chicken escalope with half salad and half chips (£5.80). Make sure you order first before trying to grab a seat. It worked out that way as more tables freed up after we were waiting for our order. We got our order shortly and dug in. Having not eaten since that morning, we delighted in discovering the food was great along with the price. Hence, we tried coming back the next year and didn't coordinate our trip plans accordingly with their business hours. We'll try again on our next trip to London!",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "wV4uhvJGok8nOR56Ex5mAg"
  },
  "4eVXOwxf_8KD2M-h2iF2Dg": {
    "date": "9/8/2018",
    "text": "Extensive variety. Could be super busyOrdered the set breakfast which was served wellFor additional information, they are cash only and I am reducing one star on account of them not having a restroom . Which food location doesn't have that ??",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_bISbcE6CtsT7qLkDu1aw"
  },
  "SGStgDgFHPmEV0cvoF-qJA": {
    "date": "6/7/2018",
    "text": "As soon as my boyfriend and I landed in London, we were cranky, jet lagged, and starving. We decided to come here because it was walking distance from our place and we were craving a traditional egg breakfast. I ordered the eggs hollandaise with spinach and my boyfriend got some kind of English breakfast platter with eggs, mushrooms, sausage, beans, and toast. Great food at a reasonable price!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b8qmVtLgFwA6pOAVG5Zc-g",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b8qmVtLgFwA6pOAVG5Zc-g/o.jpg"
      },
      {
        "img_id": "bs0nu-hVwngyj7gAjWgs_A",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bs0nu-hVwngyj7gAjWgs_A/o.jpg"
      }
    ],
    "user_id": "gBXTKk0iMUblYx3ukpqPvQ"
  },
  "et_9ZgTvyS-J9oMPvThlYQ": {
    "date": "11/13/2018",
    "text": "Great experience tucked away from the bustle of tourists. Full english is the only way to go. Order first then take a seat and be sure to know your order before you get to the counter. It was amazing watching the staff work keeping track of everyone's order while keeping the line moving.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ilzreQkaWgmawdYRWX3V2w"
  },
  "vgIKMf3zBxtUC0RRuYgoHA": {
    "date": "5/18/2018",
    "text": "After a long night of drinking, and getting out of The Bletchley so late that it was impossible to find an open restaurant, we both woke up famished (and a bit hung over, really). My husband found The Regency while I was fixing my hair, and we decided the quick walk from our hotel to the restaurant would do us some good. We knew we needed something filling, having only eaten one meal the day before, so we had high hopes for the English breakfast.You have to place your order at the counter - and this place is cash only, so come prepared. The guy working the counter was a seasoned pro with a good sense of humor. He took our order, called out the names of the people whose orders were ready, got us our coffee and popped bread in the toaster for another order as we stood there, money in hand.We did both go with the set English breakfast, adding on the black pudding because we're pigs. That kitchen was going at a breakneck speed, slinging beans and eggs at a record pace.The food was hot and filling, and fairly standard. There are several tables inside, but the only one that was open when we went to sit down faced the door. It was a cold blustery day, so every time that door opened, we froze a bit. Nothing can be done about that, but it was unfortunate.We did leave feeling much more human than when we walked in. We definitely got our money's worth with the amount of food and the speed at which we were served. It's a nice little neighborhood shop that seems to get its fair share of \"usual\" customers.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "JZcyCsBdXIctj48Rky4F1w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. English Breakfast with added Black Pudding (90p)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JZcyCsBdXIctj48Rky4F1w/o.jpg"
      }
    ],
    "user_id": "-ZqPTpx9TyyvdAWbajdilA"
  },
  "329yJebwj9UimN1elJX7vQ": {
    "date": "8/4/2018",
    "text": "Cheap comfort food will never do me wrong. I ordered an egg w 2 bacon (£2.70) with mushroom, fried tomatoes and black pudding (extra 90p each). I can't believe that I'm going to say that I love this bacon more than bacon back home in the states. It's thicker so you can actually have a chew on the meat, it's delicious with the huge mushroom slices they serve.The black pudding surprised me because I've heard what it's made of but thought it tasted just like potatoes with oats inside. This place is the perfect venue to try traditional British food if you're visiting, especially for those on a budget.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XTzEowiXsbSfIAhYBLeV-w",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XTzEowiXsbSfIAhYBLeV-w/o.jpg"
      }
    ],
    "user_id": "pOLqrWCflFJUwXNCOX_sow"
  },
  "hi3iK9PMQY75LgZzk29FSw": {
    "date": "7/4/2018",
    "text": "My goodness if I was in London for another week, I'd come here for breakfast every morning.It's got that local diner feel and you can get a full and satisfying meal for under 10 pounds. I ordered the full breakfast that came with eggs, beans sausage, toast and coffee. I also ordered the black pudding. I was eating all this myself and almost didn't make it. My left over was one slice of toast which was tasty but I couldn't fit anymore in my belly. There is high turn over so you don't really have to worry about not finding a table. I didn't see anyone share tables as one person left for another person to come in and settle down. Make sure you order before getting a seat! It's worth the minimal wait.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JU4_6w-HrW4mRZ4A2axfSQ"
  },
  "J_LCfdWNznfCzjOZis0gtA": {
    "date": "7/7/2018",
    "text": "Your popular local neighborhood breakfast spot in London. The menu is on the board behind the cash register. There will be a line but be ready to order as soon as you make it to the cashier. They move quick here. The rules are, you cannot take a seat until after you order. So there's no saving tables. Once you've ordered, take a seat and remember your order. The cashier will yell your order when it's ready for pick up. You go through all this trouble because this place has the Best English breakfast!!! Cash only.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SGs12iF8JhPr8N7IanGHqg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SGs12iF8JhPr8N7IanGHqg/o.jpg"
      },
      {
        "img_id": "9tDJiUzNQugevtb8o-ejyA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full Set with bacon and tomato. Add ons are the hash brown and black pudding",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9tDJiUzNQugevtb8o-ejyA/o.jpg"
      },
      {
        "img_id": "uQI2HDfpYjqeoI40mRU7zw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Chicken pasty. Not good. A lot of dough with much inside.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uQI2HDfpYjqeoI40mRU7zw/o.jpg"
      }
    ],
    "user_id": "5yaop88X5l6H5xHLnNAW4w"
  },
  "0SlP03HJ0b1XePimOJEYsA": {
    "date": "5/28/2018",
    "text": "A true working-class establishment. The staff are efficient and get food out at an impressive pace.A great spot to go to for a proper English breakfast. I ordered (along with a lot of people in line) the set breakfast which is a convenient customizable breakfast with all of the essentials. I also got the white coffee (coffee with cream).We were in and out pretty quickly. All in all a great place to experience.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k4OUD_gDgVeNFbpH1LyZaA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k4OUD_gDgVeNFbpH1LyZaA/o.jpg"
      },
      {
        "img_id": "JB9snpKkVcFaDZuMWQroGA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JB9snpKkVcFaDZuMWQroGA/o.jpg"
      }
    ],
    "user_id": "dyg1408HFTqgOkRr-kdLkw"
  },
  "DOaLyNG8ErCE4yYfSgoCkQ": {
    "date": "5/21/2018",
    "text": "You want a proper fry-up? Look no further than the Regency Cafe! I recommend all my friends to go here for your typical full English breakfast.This is the real deal: their breakfast is no frills but oh so good (and oh so many calories haha). I've cooked hundreds, maybe even thousands of eggs in my life and ate even more but somehow the Regency's fried eggs taste so much better than anywhere else. Is it the eggs? Is it the cooking technique? Someone please enlighten me!When I was here recently, I noticed how unique this place really is: it fills up quickly in the mornings and it attracts all sorts of people, from construction workers to men in fancy suits mixed with a lot of tourists. All of them stand in line and are united in their love for this breakfast institution. How often do you see that?Maybe I should write a letter to the world leaders to tell them to take the Regency cafe as an example on how to unite people but in the meantime: Move over Avo on toast & granola! I am eating at the Regency Cafe!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tliQ8H9xcGN8iVl55nx_g"
  },
  "UJNXmnav_3AYv88zIrDy4Q": {
    "date": "10/30/2017",
    "text": "Oh goodness. I was so close to not trying out the traditional English style breakfast because I'm not a huge fan of breakfast in general. I also don't care for beans. But my husband and I decided to go because -- come on now, look at how popular it is! Look at the reviews .. how can we forgive ourselves if we didn't give it a try?We went to Regency Cafe for some brunch before we left London so we got there at around 11 am. We were lucky that when we got there, the line was not long. Keep in mind that you have to order first before you sit your butt down. No such thing as saving seats! My husband and I got a breakfast plate with bacon, eggs, sausage link, tomatoes, hash browns, blood sausage and tomatoes. We also decided to share an eggs benedict, as well as an orange juice. The breakfast plate comes with coffee or tea and it is an AMAZINGLY good price. I think it was maybe $6-7 USD? It comes basic (bacon, eggs, tomatoes or beans, sausage link) but you can add hash browns, blood sausage, etc. They also had lunch menus on the items if you aren't interested in breakfast. And they have a different special each day. Forget the eggs benedict -- the breakfast plate was where it's at! Everything was so DELICIOUS. It just hits the spot -- filled with savory goodness. The only issue is that it is a bit on the heavy side of things and after a while, everything becomes really salty. I had to take a pepcid after the meal because when a meal is too greasy, I start getting nauseous. I would probably suggest you sharing the plate with someone else. Oh and do try to come before the rush. The line gets REALLY long. It literally goes out the door and down the street. It gets especially busy during lunch hours. You'll see business people coming here to grab food on their lunch break. Regency Cafe is definitely the place to come for the proper English breakfast. Cheap, delicious, and quick!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HIbQ8iAjJLL8ofJBLKXJDA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Eggs Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HIbQ8iAjJLL8ofJBLKXJDA/o.jpg"
      },
      {
        "img_id": "zzDiKVVq9vl0JCD54-MvKg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast with bacon, sausage links, eggs, tomatoes, hash browns,  and blood sausage",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zzDiKVVq9vl0JCD54-MvKg/o.jpg"
      },
      {
        "img_id": "_nfXpiQ1jkGIj6_kOJhbtg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_nfXpiQ1jkGIj6_kOJhbtg/o.jpg"
      }
    ],
    "user_id": "oqTZC9WriodTCby6jl0LfQ"
  },
  "DAz3t3g55rAcXAqKr1GM_w": {
    "date": "8/11/2018",
    "text": "I'm a breakfast person so this was a must visit for me, all i wanted was a traditional English breakfast. We took the Underground to St James station getting lost along the way, we exited the wrong part of the station as usual. When we finally arrived this place reminded of an old school breakfast joint, English style. I had the eggs, toast, sausage, ham and beans. I'm not big on pork and beans type beans , but not bad. I ate my wife sausage and ham so I was in heaven. The lady(maybe owner) had a set of lungs, when your order was done you could be down the block and hear her yell in her unique way, but very nice too. Good food for a good price, a rarity these days.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SikcCXviUh0tP-oBkNvZuw"
  },
  "TwMFdIoyi1YIwrmI0NaJxA": {
    "date": "9/6/2018",
    "text": "You know it's a great place when the local crowd is willing to wait 45 minutes in line to order their food, which is affordable, tastes great, and made with care.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P54bqi3ZdCA7P8ajcqVXUA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. They make a fine fish & chips here!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P54bqi3ZdCA7P8ajcqVXUA/o.jpg"
      }
    ],
    "user_id": "WN1RxjwXI1xLy6ZeEZ7Vig"
  },
  "x2uRKaOecyftN2nCZRh1Xg": {
    "date": "10/24/2018",
    "text": "Great place to eat a full English Breakfast...I encourage you to get the special with a side of Bubble and Squeak...Bring Cash as no CC accepted.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "stKkFY5j3rmklSNBbwUHUg"
  },
  "lfjPstQxa5LN__UZFd3Geg": {
    "date": "8/24/2017",
    "text": "Why 5 stars? Because this was my first meal in Europe and it did not disappoint.   ---   ---   ---For the rest of my life, I'll never forget:\"DOUBLE EGG, BEANS, TOH-MAH-TOE\"As you enter the facility, you hear some guy yelling out orders at the counter as they're ready. It's a bellowing voice that echoes through the halls of our the building and your brain. It's like going to breakfast AND the opera. Much to my shock, as we get closer to the front of the line, I realized that it was a woman yelling out orders! It was shocking and impressive that she was able to go so deep with her baritone. And the absolute best part was that she would go from her gladiator to a gentle/normal voice so seamlessly when taking your order. \"...BEANS, TOH-MAH-TOE, and yes, you had the hash browns as well?\" It was amazing. If you're reading this and don't understand why I've spent all this time talking about this woman yelling, you just need to see it for yourself.Aside from the entertainment, the meal was great too! And cheap! I ordered the set breakfast, which was bacon, sausage and egg - while adding on beans and toast. Two things stood out to me about this: bacon in Europe is different than bacon in the U.S. and in a good way. It;s large and thick, more so like ham than bacon. But it's very flavorful, and I definitely wish we had bacon like that over here! The other thing that stood out was that I'd never had baked beans for breakfast. I wasn't sure if I'd like it, but I ended up being a huge fan. Maybe it's something I need to try on occasion while I'm at home.This was one of the cheapest meals we had in Europe and definitely a memorable one!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "saSNDtnSvKewfesC0aqH0w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Chicken and mushroom pie",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/saSNDtnSvKewfesC0aqH0w/o.jpg"
      },
      {
        "img_id": "9oDxv0IZKrfZW6DBGRWLHA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast with beans and toast",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9oDxv0IZKrfZW6DBGRWLHA/o.jpg"
      }
    ],
    "user_id": "pou3BbKsIozfH50rxmnMew"
  },
  "afPiaX47Vm5zzMkO2EhJTw": {
    "date": "5/19/2018",
    "text": "I cannot say enough good things about this place. Amazing prices, staff, options of food, etc. My husband and I ate here 2 different mornings because of how much we loved it. We got lots of food for both of us and it was always around 10 pounds. Way cheap. I loved the toast, hot chocolate, fresh orange juice, cute little shop, beans, bacon, it was all good. They don't wear gloves when handling the food, so they touch money and then your food...so that was my only complaint.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XuSGtngtYcA-9pgiW3GmIQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XuSGtngtYcA-9pgiW3GmIQ/o.jpg"
      },
      {
        "img_id": "FJlIPunbwkTOWKXxG5WyPA",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FJlIPunbwkTOWKXxG5WyPA/o.jpg"
      },
      {
        "img_id": "jHFMDTgsnOjQB-17Ix6Cdg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jHFMDTgsnOjQB-17Ix6Cdg/o.jpg"
      }
    ],
    "user_id": "4I4KA-ft8RgALk1Y5XIquQ"
  },
  "0pOi-_EJux42Znkjhe7fPg": {
    "date": "11/5/2017",
    "text": "This was my first greasy spoon experience, and it was a good one. I got the set breakfast with beans, toast, and tea. I also added black pudding for 1 pound, totaling to 7 pounds. I tried to add bubble and squeak but they were all out, which was disappointing. I went at around 12, and there was only one person in front of me. By 1, the line was out the door!The employees were all very nice, the food was decent, and it was reasonably priced. This is a great place if you're looking for standard English food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tr4ZXc0aua-1ZFMYEHOQaw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. set breakfast with black pudding (7 pounds)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tr4ZXc0aua-1ZFMYEHOQaw/o.jpg"
      }
    ],
    "user_id": "gS2ApQ039FJx-Yd-F5nw9A"
  },
  "E5V_76bFJwWYYM66-xNUtg": {
    "date": "10/18/2018",
    "text": "The theater of this place is amazing. Queue out the door at all times yet somehow there's always a table available after you place your order. The woman at the counter shouting when your order is ready. How she's able to make tea and toast, take orders and yell out when they're ready is something to be seen. The cooks in the back with griddles full of eggs, bacon, sausage, bubble and squeak, black pudding and more. And, of course, triangle hash browns. We loved it so much we went twice during our 4-day trip.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zX6G6J_ckTcFtJeBOtUfVg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zX6G6J_ckTcFtJeBOtUfVg/o.jpg"
      }
    ],
    "user_id": "SPSplLR4a73zdGl-g96boA"
  },
  "NSSWX_jIyBVgX0wL6FKWvQ": {
    "date": "3/5/2018",
    "text": "Yuuup.  This is the breakfast joint from Layer Cake, for the scene where that guy who has no idea what's coming to him is gorging himself on the full English breaky.  This place is more of a novelty than a serious place for breakfast.  It has a nostalgic cafeteria like feel with quick hot and filling food.  But not my type of breakfast or lunch.  And that's coming from a gal who likes her full English from time to time.  Good for when you are on the run or want a quick lunch with your co-worker.  Sausage was fine, but very burnt and bacon was perhaps the saltiest I've had by far.  Lady working the counter had an amazing voice belting all those orders.  Part astonished and tickled, at least the experience of it all made up for food taste.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "unO1U4PV7C4dN5CYZfdaTg"
  },
  "SgUhuwCansFDBHVB0LcPQw": {
    "date": "5/20/2015",
    "text": "A friend who has been coming here for the past decade took me here one morning, before I had to begin a day's journey back home. I recognised the interior from various TV programmes and photoshoots that had taken place here. The interior is what you'd expect of a traditional British greasy spoon, a look that has been hijacked and reproduced by overpriced hipster eateries across the city, but you can always tell an original! The prices here can't be beat, and though its a greasy spoon, vegetarians aren't forgotten!There's little more I can add to the glowing reviews above and below. Delicious, generous portions of food, served efficiently, and GREAT value. I'd recommend getting here in the mid-morning, before the queues. Best chips I've had anywhere in England, and I adore a good chipper. As you take your fill, drink in the classic interior and the characters sitting at the tables around you. Be polite, don't gawk, don't take too many pictures. Afterward, admire the nearby 1930s Sir Edward Lutyens' buildings on Page Street, and stroll to Tate Britain to take in a dramatically different facet of British culture.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8Xof4_oSpVcuiWCrrfy5A"
  },
  "R2jhO6mSUnruiXY0a4JgGg": {
    "date": "8/21/2016",
    "text": "Hands down the best breakfast I've found in London after having lived in and traveled here for over 15 years. Such a traditional English breakfast with a locals-only atmosphere without the pretension. A few straightforward choices will lead you to a solid and satisfying breakfast that deserves a visit no matter where your journey starts.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qu4xe5Lp5L6NTuG5PV3NIg"
  },
  "v88F2OGsxeRq2chZt6eVtQ": {
    "date": "7/8/2015",
    "text": "Oh man, this place is so inexpensive and delicious and full of locals and it's been in movies and the lady yelling out orders has a magnificently loud bellow...go here. Avoid the Westminster tourist traps and pop in here for a full English breakfast or fish and chips or steak and kidney pie.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvEg0-9JrJZl_Agvu7etMA"
  },
  "c0ti4_GZtbaLj5pysk8lCw": {
    "date": "2/16/2017",
    "text": "We were brought here by a friend who  lives in London on a Saturday morning. We had to que for 25 minutes to  be served but people seemed very willing to wait. Don't think I'd wait that long again if I was going here but I would return if there was a shorter questions.  Food was good and at a fair price",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYpSYragJXQYpV-TLqdz7A"
  },
  "83Gq08rSkoySDxw8lzkcsA": {
    "date": "12/9/2014",
    "text": "IF YOU want for quality, consistent and excellent food especially for breakfast, dine in here at Regency Cafe. Being a foreigner here in London, my girlfriend guides me to experience an English cuisine and here I got everything on this plate so genuine. Their coffee tastes great set with beans, toasties, hashbrowns, sausage, pudding - all you have it for £7.30 to have your breakfast.See and you'll have quantities of food on a plate at a convenient price. I notice as well the ambience of this shop as vintage and you can look back its humble beginnings. Alisha also told me in our conversation that Layer Cake was filmed here, I wonder if some locals do notice that anyway.One of London's great food scene that any foreigner, like me, shouldn't miss. All staffs here work very efficiently and friendly to their guests from all walks of life. I'm sure that I can take another dip of coffee here the next time around.",
    "rating": 4.0,
    "rated": {
      "useful": 7,
      "funny": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "bClsM72ILRccuTIyZ38pYg"
  },
  "TnnSxcBSYLcc4TBe7O0TLQ": {
    "date": "3/28/2015",
    "text": "I came here for breakfast. Food was very good. Service was fast. I would come here before 9 am to beat the breakfast line. Pay before you sit.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1uO9Vlwcpfp1FPSANVRJg"
  },
  "DkMhOHKKWBLRFGTee3wkIA": {
    "date": "4/28/2016",
    "text": "Came here after landing in London for the first time we were very hungry wasent impressed at all. This is just a place to have food and eat that's it,  don't expect too much quality of the food but you get what you paid for, I didn't try them on breakfast. Staff is nice, food not good very average to bad. If you can stay away better.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DY9P0BtOroPneMvQMvNn4Q"
  },
  "g5CFkgeyU0Psufxq4TYXmA": {
    "date": "1/6/2015",
    "text": "Simply simple and great breakfast.  There is no fanfare but only genuinely made authentic good food.  Good vibe with customers from all walks of lives (businessmen, construction workers), locals and tourists. I had the full breakfast and added black puddings.  The tomatoes were so so good.  Black puddings were great.  Crusty breads as well.  Decided to go for the tea (with milk) over coffee and that was the right decision.  So good that we went for a 2nd round of tea!  My husband had full breakfast and added hash browns... Which was great also!2 breakfasts + 2 extra teas = 15 pounds.  Hard to come by in London!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A1k7dnouXbBjfNgNU0BcKQ"
  },
  "QpnVT6Zl0aPm37QH_tLjeg": {
    "date": "6/23/2015",
    "text": "This place is a hidden gem I recommend to my friends when they are in town. Nothing beats eating a great English breakfast with the locals. It is a small place, but so worth it! Generous portions as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qQdxj_eYkJFAPuYTQAmi5A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Yum! @ Regency Cafe",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qQdxj_eYkJFAPuYTQAmi5A/o.jpg"
      }
    ],
    "user_id": "NDZed2s46e06hl6xykd2AA"
  },
  "nyBjvaUPIHGelal2CR-Chg": {
    "date": "1/24/2015",
    "text": "I wanted a \"traditional\" English breakfast, and saw this was a high rated eatery, so I decided to check it out. I got there about 15 mins after it opened and the place was very busy already. I ordered eggs, bubbles and squeak, hash browns, sausage, bacon, tomatoes, and toast.Everything was amazing.Have a hangover? This breakfast is greasy, it would be a great remedy....but also don't  eat here if your tummy is weak or you are on a diet. Everything was cooked perfectly, and was really good. I will say, I was not expecting the bacon to taste so different from that in US. But still really good..It was about a mile from the eye of london, but totally worth the walk.Yum!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GpT-6hyHMC2aTA3XwbSIWw"
  },
  "gHO-Cf9ipwuLQq86uTrh3g": {
    "date": "10/10/2012",
    "text": "Quite perfect breakfast and diner actually. I was a little intimidated at first because it looked heavily populated with locals (or at least regulars) but when I stepped up and gave the main guy my bumbling order, he was very patient and kind. After that (and asking where we were from which pleased him) I felt as welcome as anyone in the place. Then came the food. When I picked up the plates, the locals at the counter said \"THAT'S a breakfast.\" Yes it was! Eggs, tomato and mushrooms, hash, sausage, bacon and toast! A proper full English just as I like it! Delicious and filling! I wish I lived here to frequent this place much more. Quite possibly the perfect diner!",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "81e1OAYxYZt7XNdUFTKNwQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English: scrambled eggs, hash, bacon, sausage, tomatoes and mushrooms!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/81e1OAYxYZt7XNdUFTKNwQ/o.jpg"
      }
    ],
    "user_id": "M2Bdj6qgYurSVTrb1MmQXg"
  },
  "R8SLdYgDGHuTALiEde9L6g": {
    "date": "3/6/2015",
    "text": "Regency Cafe is the quintessential, greasy spoon - a great place for a full English breakfast.  For about £5, you get an egg, bacon or sausage, tomato or beans, toast, and coffee or tea.  A cheap and filling (and meaty) way to start your day!  Also, the women behind the cashier's voice is magical.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CyvDkwLor-zt9-jr-gBqcA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CyvDkwLor-zt9-jr-gBqcA/o.jpg"
      }
    ],
    "user_id": "XXkCMNVqdbwrFxxjcoOGAw"
  },
  "VrBc6PR4opkqIAJAwOE7kw": {
    "date": "11/15/2014",
    "text": "Verdict: When in need of proper/authentic English food this is as good as it gets!Pros:- Proper and authentic English in all regards. Food as well as ambiance.- Price. Especially when quality is taken under the consideration. - Great and several options for those who are not into full English breakfast. I hate beans in tomato sauce!- The kitchen efficiency and organization is fun to watch while waiting.- The cakes: b&b pudding or layer cake are to die for. Perfect to share!- The set of lungs on the cashiers calling the orders to be picked up: they could hold jobs at the Opera!Cons:- This is where tourists need to go but sadly it's way off the tourist usual tracks.- As tourist or newbie you need a manual first on how to order or behave.- Almost always busy so not for the timid who can't share tables with strangers.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "3D_anpWE4Gp1z0Lt0TF6mQ"
  },
  "FK9KyU4p51Fu9DM-PJz6hQ": {
    "date": "5/17/2016",
    "text": "You walk in and the place has this great retro vibe to it. You order at the counter and wait for your order to be called out. I ordered the English breakfast and it was fantastic. The price was good as well (about 5.50)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KpS5Hl5eoXlqZgFtP4k9GQ"
  },
  "HbiO7XrV2b3x0d1RUhNOgg": {
    "date": "9/25/2014",
    "text": "Really loved this place! Went with a friend today for the first time and we really enjoyed our meal. I had eggs, sausage, beans, toast and coffee and she had a cheese sandwich. Both came out really quickly and we're very tasty. There was one guy working the counter but he was really efficient and friendly. He made coffee, took orders and seemed to be running the place. The place was a mix of office workers, construction workers and tourists but the place in general did not feel touristy. We went on a Thursday. We will definitely be back again!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xMxBbsfrSrI9To5W0209Ow",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xMxBbsfrSrI9To5W0209Ow/o.jpg"
      }
    ],
    "user_id": "SWxOnbmZTwW_DVSbLAuwzg"
  },
  "VH8uFhlAoL3D66xBUJEXKg": {
    "date": "5/19/2015",
    "text": "My husband and I went here for a typical English breakfast after seeing all the good reviews on yelp. It was great. The food was good and came out very quickly. It was not very busy when we were there but they still seemed quite in a hurry to take our order and get the food out. It was a fun experience!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ysASyVlA7kwTmgncB6dYRg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. English breakfast with black pudding added. Cheap and good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ysASyVlA7kwTmgncB6dYRg/o.jpg"
      }
    ],
    "user_id": "qecevyPPhjRUMHTIyZJCIA"
  },
  "qjMpCzdpSG3LOIteU5iP5A": {
    "date": "7/9/2014",
    "text": "This is one of the last of a sadly dying breed; the true English cafe.  This isn't some silly gastropub or fancy \"nouvelle cuisine\" nonsense. This is genuine English food at it's very best. Perfectly cooked and incredibly filling and delicious comfort food for very little money.  I've never had a better breakfast in London at any price.  Period.My ritual for arrival in London: Get off plane, get through customs and immigration, go outside, smoke cig, get my butt straight to the Regency Cafe and eat my face full for something silly like £6. If you're not there for breakfast, order the pie.  Londoners know this, but it appears that us yanks have bombarded the reviews for this place so this is for the Americans:O R D E R    T H E    P I EI prefer the beef, but I'm told the chicken and mushroom is also perfect.  Get it with chips and beans. Eat it. Revel in the perfection that it is. No trip to London is complete without a trip to the Regency Cafe.  For those of you who live in Westminster, I am truly envious. Oh yeah, read the other reviews for the ordering process and it's cash only.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "APLtrYOOc9iWfuf1gk5Qaw"
  },
  "gpSlI8MFR0lvAqNtmfYffw": {
    "date": "11/12/2013",
    "text": "Quite easily the best London Caff fry up in Zone 1...Every stereotype is fulfilled: value for money, diversity of customer, strength of the tea and portion size! Plus the service is tremendous, anyone that can remember your name and say farewell like you were an old friend in a packed cafe should be congratulated. Anyway onto the fare:The set breakfasts are something to behold;With Sausage, perfect bacon, fried egg...(They aren't that 'set' and can be tailored quite a bit with ) choices of beans versus mahoosive tomatoes, toast or bread etc!It should be noted that the extra Hash Brown isn't just for one it's for a whole potato worth of them! A must for any London visitor or resident alike, grab a milk-bottle full of orange juice to wash it down with at the wall table.Trivia: The Regency is where the Layer Cake tramp bashing scene was filmed!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yy1n45s4a6RxJuit8TlnRA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Two set breakfasts: amazing!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yy1n45s4a6RxJuit8TlnRA/o.jpg"
      }
    ],
    "user_id": "LXsXu03ADiSM396PT2Ar7w"
  },
  "vI6r3njXIizzknytsMyo8A": {
    "date": "7/10/2016",
    "text": "I love this place as a breakfast institution. Please follow the rules and order FIRST before sitting. The woman behind the counter is amazing. You gotta get the fry up--- calories be damned. Its a great mix of Londoners, locals, and tourists, and don't be afraid to share a table",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiSPrn4c7nn0RMeN9xow4Q"
  },
  "hSKniNehKhPNG7hQJHVICA": {
    "date": "6/5/2016",
    "text": "English hospitality at it's finest. You get such an authentic local breakfast diner. The staff is very friendly and welcoming and the food is fantastic. I had eggs and chips. I also had a coffee too,great stuff. When I go back to London I will make this one of my stops to get some good breakfast.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkxMhbqa6aW3uom0LAUefA"
  },
  "DJwFx_TnKRYPGXYJDrHWtA": {
    "date": "10/24/2008",
    "text": "This is a famous greasy spoon right in the heart of civil service country - the Westminster/Victoria border - and just a few minutes from Channel 4. It's black and white art deco interior has seen it act as location for various TV and film productions, most notably in Layer Cake and there is the usual mix of patrons spread across the social strata - labourers next to office execs next to students. As for the food - there's roast trout in quince jam, pheasant roulade withonly joking, I said it was a greasy spoon so what do you think they serve? And it's absolutely fine for that. More interesting to go for the decor and hustle-bustle atmosphere than the food but then, when that's all you serve, you have to distinguish yourself somehow.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "nRQqgNpkOyN54r6DKIvKNw": {
    "date": "2/25/2012",
    "text": "Sometimes only a fry will satisfy The Regent Cafe is what people think of when they imagine a 'proper greasy spoon'. Decent priced, decent grub for the hard working men and women of the post war years. Formica tables, gingham curtains, a rattling coffe machine and cabbies sucking up industrial strength cups of tea. OK it's 50 years on now, but the Regent hasn't seemingly changed much from that socialist post war ideal, albeit that the brickie can't have a smoke after his ham, eggs, fried slice and the cabbie squeezes in amid more monied Pimlico residents and trendy Asian tourists (the latter location spotting from photoshoots in Japanese Vogue and appearances in Brighton Rock.) A full breakfast with tea, toast, extra hash browns and black pudding comes to a princely £6.80. You'll struggle to finish it, even if you have just come off a building site. Plump properly porky sausages, decent (if slightly too salty) bacon and bright yellow eggs belie the low price.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "8quiQuCM-8aBGGD3E1mcJg": {
    "date": "11/27/2008",
    "text": "I was a frequent visitor to the Regency Cafe in the Nineties when I worked around the corner. At this particular place of work, there was a lot of after work boozing going on, such that it did not seem to be ten minutes from stumbling out of the pub at past eleven, waking up and being on the way back to work in the morning with a thick head. A quick stop at the Regency to get fuelled up would help see me through the day, indeed several colleagues remarked that I was the paragon of effectiveness, all thanks to the Regency and despite the heavy nights. Eat in or take out. My favourite - bacon and egg butty, or sausage and egg butty, the sausage neatly sliced lengthways to ensure ease of consumption at one's desk. Eat in you can't beat the fry ups. Probably still the best cafe in Westminster.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "a9QChlvHhmSW6foZDQ36uQ": {
    "date": "12/5/2008",
    "text": "My absolute favourite cafe in London. Woohoo indeed, this is as good as it gets. The Regency is decked out in its original Edwardian tiles, both inside and out, so that when the baritone voice of the lady who takes your order rings out to the kitchen staff, it echoes around the interior like a cavern. Its the normal satisfyingly greasy fare, all cooked and served in a classic fashion by the clean and proud-looking staff. Always busy, the clientele are a mixture of builders, suits and students, all tucking into their bacon rolls and egg'n'chips, knowing real quality when they see it. My only complaint is that the Regency is located too far from my Hackney home to visit more than occasionally, and that it's opening hours don't stretch to the evenings or weekends.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZXU5C5DdmLEnYvvoLv7hSA"
  },
  "ctunR05G0RGdaJSDe1w59w": {
    "date": "10/3/2011",
    "text": "substantial meal for a reasonable price.  if you're a foodie, this is probably not the place.  but if all you require is the basics, this is your place. the coffee was rather watery, but that's my only complaint.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8oaJ7Tzo_Xlt5NoR85D20w"
  },
  "YLpfs9kpRMsPVppJxr93PQ": {
    "date": "3/12/2014",
    "text": "glad i read the reviews before i went.  the place does indeed have a \"soup nazi\" feel to it.  and yes, that tiny woman yells the orders so loud.  impressive they know exactly who ordered what even when the food orders are the same.  very affordable, huge portions that keep you full all day.  it was my first english breakfast and i loved it.  the hash browns and sausages are sooo  good.  we went every morning and 8am and never had to wait in line.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8unSL8U_EtHzNn7B7o2IQ"
  },
  "7p_jsm9tEnR7GxWfjj0uPw": {
    "date": "12/28/2008",
    "text": "I would not classify a greasy fry up as one of my meals of choice, therefore it took years of walking past the Regency Café several times a day before ever experienced it from a culinary point of view. This is what you would call a builders café, but probably due to its location in the heart of Westminster alongside those customers who have just left the building site around the corner, you also et a fair helping of suited local business men and women who cannot resist the café. It does definitely have a certain charm about its Edwardian décor and unpretentiousness. Even if only for the comic factor of being sat amongst yellow jacketed and hard helmet wearing men and hearing \"Hannah's egg and beans\" being called out over them all, I rather like the Regency Café.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JY9GzXCZn4OVMqg07Wql2g"
  },
  "vigoEknDH3uJeW-VPDQjTg": {
    "date": "4/9/2008",
    "text": "Regency Cafe was the first place I was taken to eat when I first arrived off the plane from Heathrow. And I still remember that sleepless morning fondly!What better introduction to the English way of life than through a typical and traditional London cafe, indulging in a lovely full english breakfast?For £4.99, a full english breakfast consists of toast, tea, 2 eggs, sausages, bacon, and your choice of baked beans or grilled tomatoes (Beans please). Juice is an additional charge. Not the cheapest of breakfasts in London, but the quaintness of the place and the size of the breakfast is absolutely satisfactory enough!Popular with the middle-aged locals, this gingham and formica furnished cafe is also popular with film buffs, having appeared in many British TV Shows and Movies.Regency Cafe is also famous for the way in which you are served your order. No table service, it's pay as you order, to which, when ready, your meal order is called out by a raspy thorated woman with a voice completely unlike any other. She's well-renowned and it's worth going just to hear her unique call!The food is ready in unbelievable time, so be prepared to eat and leave! Not for lazy weekend brunching and paper-reading, although you can try if it's not too busy!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "ag2JbdJUiiuOIuCPKsM4WA": {
    "date": "11/22/2008",
    "text": "Proper British0style caff halfway between Westminster and Victoria. Everything you expect from a great greasy spoon - big portions, good solid fresh-cooked food, a great line in fried breakfasts, and tes you could stand your spoon up in. Highly recommended. Oh, and if you've seen the film Layer Cake, with the delicious Daniel Craig, this is the cafe where XXX and Morty have a very special breakfast with Freddie Hurst.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "8WzRvnHcR8UPRWjBf_RIpw": {
    "date": "11/17/2008",
    "text": "Good lively atmosphere in this well known bustling cafe. With all the usual menu choices you'd find in a cafe, as well as a daily specials board. The orders being called out is famous! Very fairly priced considering its central location.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "HXfJcWcePJ4Ti7LB1q7sOw": {
    "date": "11/20/2008",
    "text": "This is a brilliant example of an English 'greasy spoon'. It's located not far from The Tate Britain so if you're planning a visit make sure you plan a stop at this traditional English cafe too. The interior is all tiles and formica tables, great food ranges from any combination of eggs, bacon, sausage, chips, beans, fried slice etc that you can think of. Strong tea, good toast and at lunch time, anything from pasta to scampi, pies and school dinner style puddings. They shout the orders are they're ready which can be disconcerting when you're standing in front of the person shouting it, but it all adds to the atmosphere!",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "BJDCv_Z38oYlL0joeoCJjQ": {
    "date": "10/30/2008",
    "text": "I really liked this cafe, so homely and really friendly lady. Hot Chocolate was Cadburys and made with milk.a bargain at just £1. Being open in the evenings is brilliant as it's difficult to get honest British food at a reasonable price anywhere after lunchtime. Noticed a lot of London cab drivers in there too.and they know where the best places are !Didn't have anything to eat this time but food looked great so I will be back for a good traditional meal with a pudding and custardyum.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "3FOrQB0vYKLk2h8R_KJANA": {
    "date": "5/15/2017",
    "text": "The pub was packed and had a weird rule. Basically you can't sit until you order. I told my husband to save us a spot and the cashier basically shouted that we can't do that because it was the rule etc etc. He was quite curt but his efficiency made up for that exchange. He was great at his job and got the orders out fast. The food was fantastic. I'm not a fan of British food but I loved it. We had sausage peameal bacon beans and grilled tomatoes. The toast was ok the hash browns great and you get 3 for 99 pence. The coffee was so good. I asked for white and he basically made me a latte. Overall this place lives up to its rating. I'd definitely recommend for someone who wants a great English breakfast.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L8HqLggN3zNY56wWfh7vTw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L8HqLggN3zNY56wWfh7vTw/o.jpg"
      },
      {
        "img_id": "eAZoQPFqqMFCY-FMW09f1g",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eAZoQPFqqMFCY-FMW09f1g/o.jpg"
      },
      {
        "img_id": "XjeXVDSHDhT2SeX2lg1U0w",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XjeXVDSHDhT2SeX2lg1U0w/o.jpg"
      }
    ],
    "user_id": "UnlrkIgodDiNitZidgStbQ"
  },
  "mo7hwVM7y_cjlCFthdwJtQ": {
    "date": "7/12/2016",
    "text": "Love love love this place! It's truly a hidden little gem. Tucked away in a neighborhood away from the noisy city, I found this place on Yelp and made my way for a full English breakfast. The staff is nice but the food is terrific. Get the full breakfast with black pudding with beans. The tea is delicious And the lovely little lady behind the counter has a ferocious voice when she yells out your order. I love it and went early enough on a Thursday morning (11am) to beat the crowds.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NcR48_9U7kTPolg9CjnbRQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Love this lady! She's a riot",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NcR48_9U7kTPolg9CjnbRQ/o.jpg"
      },
      {
        "img_id": "9P7wDF_yXZFmZ1l5CpRrPQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9P7wDF_yXZFmZ1l5CpRrPQ/o.jpg"
      },
      {
        "img_id": "JyRZbC1d0-D6CFZDkN01ZQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English breakfast with tea",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JyRZbC1d0-D6CFZDkN01ZQ/o.jpg"
      }
    ],
    "user_id": "wIGqfA1HoIsHZVSEEICIiw"
  },
  "b-dgVq2x8ogLrcRtW_Ahxg": {
    "date": "11/14/2016",
    "text": "Good food, charming atmosphere.  Best part of it was the gent behind the counter, he could have come out of a novel. Extremely polite and pleasant with a deep booming voice to call out orders that were ready, you couldn't help,but imagine backstory for him.The food was good, classic English breakfast fare.  I would certainly make it a point to stop in here at least once on future trips to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nY--mgzBtN_U0_ee5w-pSg"
  },
  "5XRjQdG8Rx7V9b7c3GuILg": {
    "date": "11/6/2016",
    "text": "Outstanding place! we loved the English breakfast they had, the meal was colorful, the homemade sausage was tasty, the beans are great! A must definitely place to check if you want to get a good heavy english style breakfast. A+ to the cashier guy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Felk-l073izjlMMa4Ig7CQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. (Big) English breakfast for a cheap price! A place to visit if you are nearby, good starting place for tourist.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Felk-l073izjlMMa4Ig7CQ/o.jpg"
      }
    ],
    "user_id": "zOfMupAagkUu4dObTk75YQ"
  },
  "XLFKZZbRCG6APzoSTiWRfA": {
    "date": "12/9/2017",
    "text": "Yes it's quite a distance if you're not already in the area but boy is the food and prices oh so GREAT! The menu is pretty straight up: either tomatoes or beans with your full english breakfast or toast (I can't remember the other option) LOL but it was crazy good. You have to pay before you sit down which is good because it keeps non-eaters from occupying tables which eating patrons need. Plus, it ensures that queues are kept to a minimum. Will definitely visit this gem again when in town; btw, our visit was the 2nd week of Nov. 2017 for reference.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRuksWOriTnU_pFT_hWcoQ"
  },
  "dMZXVM08EqSZZ4Nwucwf9g": {
    "date": "6/9/2017",
    "text": "Excellent cafe. Unchanged decor since the day it opened in 1946. Cheap and cheerful. Great food with a smile. Formica tables and framed photos from the days of yore. Good coffee. Every cafe in the country should be like this!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AvtdjzfmBxUwa44Nwo5hoQ"
  },
  "VgQFsQ_OaG-8zMEQQSurhw": {
    "date": "5/14/2015",
    "text": "The rave reviews are not hype. This is truly an extraordinary spot for breakfast. It would be worth twice the price, but let's be glad that's not necessary.My one comment on previous recommendations: I would gently steer you away from the hash browns, unless you're really fond of pressed-patty, somewhat McDonalds-style hash browns. They're perfectly fine for what they are, but they are what they are.Everything else, though? INCREDIBLE. Best in class (and even well above it).Update: My five stars are for breakfast. I've been back for dinner now, and it's solid but less spectacular diner fare. Come whenever you want: just order from the breakfast menu.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ESNH-SjGrSFr7nO6v3x6sw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. \"Set breakfast tomato hash browns!\"",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ESNH-SjGrSFr7nO6v3x6sw/o.jpg"
      }
    ],
    "user_id": "eFnIOPQZwoMK36USZ2nchA"
  },
  "rG89IGflQinq1ooNWqoQPQ": {
    "date": "6/9/2016",
    "text": "Affordable classic British staples from breakfast to pudding with a few pasta entrees thrown in. Particularly enjoyed the black pudding and sausages. Nothing fancy, just solid greasy spoon food made in house and at a really good price for its location (where else in Central London is quality fish & chips from four choices of fish 6.95?). Long lines constantly, for this reason.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "71XStF5U0kmJw2Iym9fclQ"
  },
  "EiDbBGcAbxwOhIJ87xNqxA": {
    "date": "9/25/2015",
    "text": "Super great food and super inexpensive. Typical English breakfast. Great local feel. Went for lunch and breakfast and both were tasty.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d_pLISLoZcuYXxo6aH5P2A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Chicken Escalope with Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/d_pLISLoZcuYXxo6aH5P2A/o.jpg"
      }
    ],
    "user_id": "L-kRY_7Jm012fjIciYsLkw"
  },
  "uOK2Lm0rfjEWhp7eSJqB0w": {
    "date": "4/6/2016",
    "text": "Great atmosphere and great food. We had 2 breakfasts with additionnal hash browns and black pudding with coffee for 12.80. All is very tasty, only sausage is not as good as in Poland. ;-) Come before noon if you do not want to stand in the queue. Make sure you order before taking a sit. Cash only.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7wDhZ2Vgz6oMMi1jif1iJQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7wDhZ2Vgz6oMMi1jif1iJQ/o.jpg"
      },
      {
        "img_id": "jjdttUt16RnKJwgF1us2FQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jjdttUt16RnKJwgF1us2FQ/o.jpg"
      },
      {
        "img_id": "3Ldreu_hqjnp2pWuuqEPCw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3Ldreu_hqjnp2pWuuqEPCw/o.jpg"
      }
    ],
    "user_id": "fVSN_jMwW56kDWQBmXuXVw"
  },
  "NNWwZz7UiALTtRNAWTL91A": {
    "date": "7/3/2016",
    "text": "First stop to get food during a trip to London. My friend and I split a set breakfast with an added side of hasbrowns. Definitely just the right amount of food for both of us and at a great price. This place gets pretty busy. After I had placed my order first there was a long line behind me, but food comes out fast. Definitely would recommend!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4CsSaSGBXeU831g6b6QR3g"
  },
  "flB5uEjtY5MFQ60UY2cqlg": {
    "date": "8/12/2016",
    "text": "I really miss having this kind of neighborhood greasy spoon feel back home. The food is good, even with me not being a fan of English sausage. The woman at the front has an amazing power of vocal projection :). VERY affordable, as we had the set breakfast, and the sausage/beans/eggs breakfast and OJ (which is great btw), at about £9,50 if I remember correctly... But definitely under £10.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6JNnWk0BirtxY1gSz65frA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast of Eggs, Bacon, Sausage, Beans, Toast and Tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6JNnWk0BirtxY1gSz65frA/o.jpg"
      }
    ],
    "user_id": "5afGvFrrEsJfq9c-OxmULQ"
  },
  "uDKqhC6jc2Humo272mfK6A": {
    "date": "5/14/2017",
    "text": "This place was so good! I checked it out for breakfast with my boyfriend and we went back the next day because it was so good! I loved how they called out orders so old school like a North American diner and the baked beans are a must! Food came out so hot and fast this is a definite must see!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9khG00hfXFBrCPsQcepcw"
  },
  "CxNcyM4L6CTdw0ASXaUm5A": {
    "date": "7/6/2016",
    "text": "Well well well.  It's a travesty that I have worked pretty much round the corner for 3 years and never dined at this amazing establishment.  The queue alone outside the door for breakfast demonstrates the appeal of The Regency Cafe.  We decided to go on a Friday morning which when we arrived before 9am the queue was already out the door.  Good signs.  The system here is rather than jumping on a table and waiting to be served you are to queue and order your food and then find a empty table.  An odd system you may find but it works very well.  Once we ordered the food it arrived very quickly and my word - value for money is achieved!  I ordered the set breakfast with hash browns and bubble and squeak.  I can confess only one of these extras is needed.  The portion sizes are amazing and the breakfast was delicious.  I thoroughly enjoyed the eggs and sausages as well as the orange juice that came in a milk bottle,Very old school and a great touch.  This is a great British cafe with amazing food and minimal fuss.The service is great and I would recommend to keep your ear out for your order!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fFBd9FVj3TIxpPPuHE-91w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Set breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fFBd9FVj3TIxpPPuHE-91w/o.jpg"
      }
    ],
    "user_id": "H4Yb9Cah8GDn4rSL9BucPg"
  },
  "rot-qHkVi5O8Hiw9t55AYg": {
    "date": "1/9/2013",
    "text": "We were jet lagged and looking for a place that opened early enough that served a hefty breakfast. Luckily, we were within walking of Regency and braved some stormy weather to trek over to the cafe. I ordered the eggs, sausage, tomatoes plate and it did not disappoint. It was so hearty that we didn't feel hungry till late in the evening (pretty much went from 8:00am to 6pm without eating -- only a couple cups of coffee to ward off the drowsiness).Lastly, I'd point out the economical value of the meal. After coffee and tea with our meal, the total was under £15. For a city where an average meal is like a highway robbery, I'm glad a place like Regency exists.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EW4hJztflbFmUubEgDRgGw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EW4hJztflbFmUubEgDRgGw/o.jpg"
      }
    ],
    "user_id": "dBS3ds0NNa5YXNqfLEBcZw"
  },
  "t-YbKGqFLgbOk2xp47MO_g": {
    "date": "11/13/2016",
    "text": "A good local and worth the travel. they have a system which works really well. You can only sit down once you have ordered your food and then at this stage, you have to wait until your order is called out.The breakfast is great an you can mix your order to your own preference. Good quality food is made throughout too. Make sure you remember what you order.On certain days they have their specials, such as Fish n Chips on a Friday. besides the breakfasts the steak and kidney pie is one of my faves.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kygcj402c1SAop8T3Y-LZg"
  },
  "FDeS6JDVOiL4JuJXyPyxAw": {
    "date": "4/1/2016",
    "text": "Great.The real English diner.Fresh food, huge portions and affordable prices.The coffee they serve is filtered, that is the best coffee you can have while eating their delicious food.You need to get in line so you can place your order and then you can grab a sit, sip your drink while waiting for your order to be ready, everything is served freshly cooked. Loved it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_p_zkklKskaiCBd-QZqMhg"
  },
  "F8jN-u2806gLBL9Wui7BPQ": {
    "date": "10/8/2014",
    "text": "So after years of knowing about the Regency Cafe, my best friend and I finally paid a visit.Things were definitely in full swing and a long queue snaked to the door when I entered at 8am. I joined the queue and thankfully this moved very quickly and before too long I was putting in my food order. There is a menu, but I think pretty much most people go for the standard English breakfast. If you are going to do this you have to take a few really tough decisions -Tea or coffee?Bread or toast?Tomato grilled or not?Once this is out of the way, it's plain sailing. Choose your seat and wait for your toast/bread order the surface and go back and grab that! Once our breakfasts surfaced, we tucked in. I've eaten a lot of full English breakfast in my time, but this has to rate very highly up there. It really was the perfect blend of just enough salt just enough grease without being too over the top. One of my biggest complaints with cafes, is that they use crappy ingredients to cut corners, but I was happy with all of the produce that they served here.As I visit more and more places around the world, I truly despair of the corporate homogenisation that is occurring throughout the globe. What happens when finally the only place to get coffee in the UK is a Starbucks, Costa or Cafe Nero? What happens when the only place to get lunch is a Macdonald's or a Pret? Even the small businesses that were once quirky, are now becoming more and more prevalent. Places like the Regency Cafe are the true gems that we have as they offer great value for money, individual style and friendly, if somewhat shouted service!",
    "rating": 5.0,
    "rated": {
      "useful": 16,
      "funny": 6,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "Wy42BgyhbeZSVm8dsJFHCg",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wy42BgyhbeZSVm8dsJFHCg/o.jpg"
      }
    ],
    "user_id": "sM8whPZ_aXovg9MxnDOPCw"
  },
  "09BuzfsoV4KAi1k8a89gUw": {
    "date": "1/5/2015",
    "text": "I'm struggling to find the intense appeal of Regency Cafe. Part of me feels obligated to rave and gush about it because it seems like a London institution, but I can't get on board with that 100%. You have to wait in line to order before you can sit down at a table. That's not a problem since the line moves at a tolerable rate. I think it contributes to control of their limited table space. There is certainly value in terms of the amount of food you get for the price. Coffee or tea, eggs, tomato or beans, sausage, bacon, and bread or toast. A massive plate of food! Maybe I'm just not accustomed to this hearty of a breakfast, but it just seemed extra greasy and extraordinarily heavily and nothing particularly special.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RlemeW9HuYVBJ3n15bueeQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Beans, egg, bacon, sausage, toast. Very salty~",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RlemeW9HuYVBJ3n15bueeQ/o.jpg"
      },
      {
        "img_id": "z0FKN2K5sHYQbk5GcKpAIw",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Where you place your order and pick up your order",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/z0FKN2K5sHYQbk5GcKpAIw/o.jpg"
      }
    ],
    "user_id": "9wMwzjUajQLsrH8KzSQ3ow"
  },
  "mBoErJTkE2_avlD7CIFSLg": {
    "date": "3/14/2017",
    "text": "Very friendly host. Efficient and streamlined. A good start for any day of the week. Enjoyed the eggs, chips, fried tomatoes and coffee. Easy on the budget. Remember...cash only!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVbJ0kEFmDBzHeWXhByUbA"
  },
  "oJmmsRwjkrLO7IaIAZQDfQ": {
    "date": "1/21/2016",
    "text": "No frills review for a no frills place. Long line that moves sporadically, it's certainly just a workingman's cafe, that everyone else found out was great - so filled with all kinds of people including families tourists, locals, etc.They come here for the food. Well done normal items - we had the full English breakfast, add hash browns. Great choice, it's a ton of food. Nothing is spectacular, but everything is done well. This is the best breakfast sausage I've had since moving to London.Be prepared to wait, be prepared for a little chaos, but overall worth the trip!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "HwG16CeyMMRdCxWErQh4hw",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HwG16CeyMMRdCxWErQh4hw/o.jpg"
      }
    ],
    "user_id": "LqXbk6riZoRXKaRwbJMMyQ"
  },
  "IPg2LRewX2dUY3MuqAzNWQ": {
    "date": "12/23/2016",
    "text": "You're telling me that you can get a full set breakfast here that won't break the bank in the heart of London?! This place has long lines out the door, but it is extremely worth it for the opportunity to eat here. You can get a full set breakfast with sausage, bacon, a fried egg, hash browns, two slices of toast, and baked beans, all for the low, low price of £5.50.Be prepared to listen for your order from the lady behind the counter (who has an amazingly loud voice) and make sure you don't dilly-dally in line. This restaurant is incredibly efficient and anything that causes you to make them slow down will get you a scolding.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AFWF5hcNPoMT6pdcrxEE7Q"
  },
  "KqG60GoykJRhCT0UIPZrMQ": {
    "date": "7/1/2014",
    "text": "Is the food delicious? No doubt. Might be the best hash-brown I've ever had. The sausage, the toast, all amazing. Is it worth getting yelled at for no good reason? Absolutely not.Why did I get yelled at, you ask? I made a huge mistake, I suppose. I ordered English breakfast with some toast, but I had no idea the toast doesn't come at the same time as the breakfast. When I went to pick up the breakfast platter, the guy who's dispatching the food asked if I also ordered a side of toast(furiously). Said yes, and he pushed the toast plate over and yelled \"I've been shouting for you to pick up your toast for the past 10 minutes!\". OK, I'm sorry that I didn't know every rule in this restaurant, but hey I brought cash, I waited in line patiently, I said to-maa-to instead of to-mae-to... I made an effort but that did not prevent me from getting scolded. I can understand how they are trying to maintain the quirky culture, the attitude is a part of the charm. But I just want to have a nice meal without hearing so much shouting in the background, and I'd prefer not getting yelled at. It's just not the place for me. Sad face. It's really too bad because I loved the food and I lived so close by, but I never went back.",
    "rating": 3.0,
    "rated": {
      "useful": 14,
      "funny": 11,
      "cool": 4
    },
    "photos": [],
    "user_id": "sY_uz6P1sux3tKt1TEGqjA"
  },
  "r9UV4zua0xq_Vl0aiZEK-w": {
    "date": "10/7/2015",
    "text": "Finally, after several years of hearing about it, I made it to the Regency for lunch today.It was all I had been told, a very British caff with a pretty big variety of food. I decided to get the homemade steak pie and chips. The man who took my order was very adamant that I should have vegetables - but from what I could tell, they really only have peas or beans, and I didn't want either. He was also insistent that I had gravy. I caved and said yes to the gravy, and he conceded that I could just have half gravy.We grabbed a table and about 5 minutes later, I heard the call of 'steak pie and chips for the young lady'. Young lady? Don't mind if I do, thanking you!So he was right, it was nice with the gravy. And half gravy meant that my delicious chips weren't made all soggy by a ladle of gravy. The steak pie is the only pie they make on-site, and it's really nice - the meat is tender and there aren't any fatty bits. It's pretty plain, with the filling being some sort of tomato-based sauce (American readers, it reminded me of swiss steak). It was a solid choice!So yes, for the café it is, it's a 5*. Charming service, quality food, and at a good price.",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "IiojkDLHYdkfTJlINzUv-Q"
  },
  "SuoaBkNLhLkdl3QvSaKRoQ": {
    "date": "3/24/2018",
    "text": "Would recommend this place.  It was quite busy when I attended, however service was great.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0ekutyQNsfuHe6LEKxC0w"
  },
  "tImiCedTU0NxXoexuW3NqA": {
    "date": "9/11/2015",
    "text": "The highlight of our week in London.Honestly, this place is brilliant, typical greasy spoon. And they do it damn well.We went twice, the first time there was a line out the door (queued for about 15-20 minutes) the gentleman who I believe owns the business works at the front counter, I had the set breakfast with beans and tomatoes with hashbrowns. It comes with tea or coffee, and bread or toast.After you order, you find a seat and wait for your order to be called out.After reading reviews I was worried about the apparent rudeness of this guy, but honestly, I think he's great!He remembered my name the second time I visited, and was joking around with me.The food itself is brilliant.It's the kind of food you just want to eat while curled up in a blanket watching TV.Will definitely return without a shadow of a doubt the next time I'm in London.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fALZZ9t2FT0T_Gd0k0ACMg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Front: Set breakfast with beans AND tomatoes, hashbrowns with tea and bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fALZZ9t2FT0T_Gd0k0ACMg/o.jpg"
      }
    ],
    "user_id": "_mYEZDLsOV8NaCK9jZj5fQ"
  },
  "ECJc1QmTM_2eRbznxGR7jw": {
    "date": "6/4/2017",
    "text": "A small little restaurant where you first place your order before getting a seat. This place gets real busy with locals and other people that are visiting, tourists. Line for ordering moves fast, but if you want to get a seat.. there might be a wait time. On the other hand, the lady who takes your order and calls you over was amazing. My friend ordered and she said the lady's voice was regular but when she calls out, it was a whole other tone. Decent experience. Inexpensive meal and filling. Food may be a hit or miss, but still good enough to try for the experience of being in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CSPixjKRnW7dUgi2i4cvTw"
  },
  "ghbQYQb-AH-yxoDGQjWv9A": {
    "date": "10/4/2016",
    "text": "Loved this place! Came here on a Friday afternoon for breakfast at around 11:30am. The line was not long then, but about 20 minutes later it was out the door.I had the breakfast plate (eggs, sausage, toast, tomatoes, and hash browns)...it was very good, quick, and piping hot.My boyfriend had the fish and chips, which he said was great!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0YI0fA3naGahJHRH6RnDzw"
  },
  "hKSGmeG46DwVfPbNzVMP9Q": {
    "date": "2/14/2018",
    "text": "I asked for utensils, said it several times. Then the owner kept saying what like he didn't know the word. I said you don't know the word? He said yes I do. Then he called me a wanker. I called him out on it. Very rude!",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jc12rBNegszvAYKPPJdNQw"
  },
  "OyZ7LP86vPx4SRJsoyHLfQ": {
    "date": "6/17/2017",
    "text": "Took one star off because they only accept cash and 2- the guy was a little rude. Not being from there I wanted to try a full English breakfast but I don't eat pork or beef so I ordered that just without meat. He was like don't tell me what you don't want tell me what you do want l, kind of in a rude way. I don't know what's in a full English so I read from the menu on top. He also pushed my bag as I was getting my money out. I didn't know it couldn't be on the counter. My bad. Anyway the food was good, toast was great and love the beans. Price wasn't bad either but I had to go take out cash.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e-upHL4v806CxGZUSMgfBg"
  },
  "UxPLplXTIoHfIuP6s2XANQ": {
    "date": "8/10/2017",
    "text": "Absolutely delicious breakfast. We stayed in a hostel near by and stumbled upon this little cafe while exploring one morning. They have a system down pat that serves you quickly. \"Set breakfast\" is right around 5 pounds and you get a traditional English breakfast. I'll certainly make a stop here whenever I'm in London again. Would recommend to anyone.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6Ef7aX2tLScVa0HOh_B0A"
  },
  "Tb9G4IPjz61M25XlKvcdMg": {
    "date": "10/8/2016",
    "text": "Huge recommendation if you like authentic english breakfast and locations that are also attended by locals. Its vibe somehow reminded me of Katz Delicatessen in New York. An absolutely no-frills restaurant - no recommendation if you prefer modern & hipster places. Only cash payment!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "cZGF2M2MzC3x-NdPkOiHVQ",
        "caption": "Photo of Regency Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cZGF2M2MzC3x-NdPkOiHVQ/o.jpg"
      }
    ],
    "user_id": "RlhcmONxxCr5D61NZR6lzQ"
  },
  "q8T5wp1eEKBicjLF09ePDA": {
    "date": "10/24/2015",
    "text": "LOVED THIS FIND.  I had earmarked this place after seeing glowing Yelp reviews and, after a delayed flight, getting lost, and waiting in line for 40 minutes... I was so happy I didWe both had the breakfast set with an additional order of hashbrowns.  It was delicious AND the entire place was bustling with local customers.  If you get the chance to go-- DO ITFYI, the establishment is cash only",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TtX2zCvbIxH2aC6SCt8ILg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast set (toast not pictured) with beans and a side of hashbrowns (90p extra)-- delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TtX2zCvbIxH2aC6SCt8ILg/o.jpg"
      }
    ],
    "user_id": "hKK4lgxt8hTPhuLLz-B_Ow"
  },
  "8lcz7gLb4ZzqFnhAisxuzQ": {
    "date": "12/11/2016",
    "text": "Fast service, very welcoming manager/owner. The toast was a little burnt but I'll let that slide considering that everything else was great. Don't worry if there are no more seats/tables. Right when you finish ordering, there will be a table that will vacate. I promise you!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G3ZMs8rzKbkyqgFqe3OYcA"
  },
  "eo5XFb-nbDmG0lBDm-FqKQ": {
    "date": "6/1/2015",
    "text": "Absolutely terrible. We wouldn't come back if they paid us. I've had dozens of English breakfasts in my life, and I've been to nearly hundreds of greasy spoons, and this is on the bottom ten of them. There's a queue, which usually signifies good food, but not in this case. People come here because it's famous and/or convenient, rather than the food itself. The staff is rude, and they literally yell at you. The food is standard at best, the setting and the decor are lacking, and there isn't a moment's peace, because the whole time there's a staff member yelling out orders at the top of their lungs for people to come and pick up their food. If I were in the military, or in prison, I imagine it'd be something like that. Just absolutely not worth going to, at all.",
    "rating": 1.0,
    "rated": {
      "useful": 3,
      "funny": 6,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-X_0C65L_Oy7hY8STEbm8A",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Average English breakfast.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-X_0C65L_Oy7hY8STEbm8A/o.jpg"
      },
      {
        "img_id": "tQN7d4YeRCj6vMrpKeSYUA",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Worst Eggs Benedict I've ever had. Sauce was basically meted butter with some salt. English Muffin was stale. Rest of breakfast was average.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tQN7d4YeRCj6vMrpKeSYUA/o.jpg"
      }
    ],
    "user_id": "xT00YR_cianCNXwv8FwvAw"
  },
  "JInNzHeGmjde_fd2ss2kVw": {
    "date": "6/24/2017",
    "text": "Any time I am in London I have to go to Regency Cafe. Incredibly affordable and an excellent breakfast. I have always had excellent service. Definitely the best greasy spoon in London.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlJc3xknuvI1WV2hWHKCHw"
  },
  "GOhA3Mawo9J9LX1X7m83Bw": {
    "date": "6/21/2017",
    "text": "Pretty good. Classic British food. Highly recommend. The space is cool! Waiters are nice. The food is ready fast. Great food!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vOcrK0NnJ_v2bgAGRzSSdg"
  },
  "KOQ7GqMGtLWuJAZf2Qf2IQ": {
    "date": "8/20/2015",
    "text": "As an American, when visiting London, my English boyfriend would not let me leave town without having a Proper Full English Breakfast.  While neither of us are locals to the London area, going to Regency made me feel like I was.  It is the kind of place that brings together all walks of life, there were construction workers, business people, students and just a dash of tourists thrown in for good measure (but only a dash).  It is a place I can imagine going to once a week for a coffee and a hangover cure.  My boy and I both got their full English with add ons, me getting the Bubble and Squeak and him with a black pudding.  I got tomatoes on mine and he got beans.  Both were delicious, both were fantastically inexpensive (which is always welcomed in a city as expensive as London).  Even my man, a guy who knows his way around cooking a hangover full English to be sure, was seriously impressed.  Nothing fancy here, just solid, tasty food with an in-and-out fast food kinda attitude.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "b6xn1bgZB9OOq8p7BQbipg",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Full English with tomatoes and bubble and squeak. Get yourself some of that b&s!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b6xn1bgZB9OOq8p7BQbipg/o.jpg"
      }
    ],
    "user_id": "lnvSYXrrasjg96Ei5oVJ8Q"
  },
  "uKviXv777kuD7rT-sinpNw": {
    "date": "4/13/2015",
    "text": "Good for that morning fry up. A heavy night before and an all day meeting nearby on a Saturday, I decided to treat myself. Bring cash and get in line, do not save a table for your friends, do not hold the door open, know what you are ordering, you have enough time to plan this while in line. Oh and listen for your name, do not make the cashier angry by having to call it multiple times.The breakfast is hearty and arrives quickly, I went for a full English, with beans, toast and tea, with added extras of bubble and squeak, black pudding and hash browns. To be honest the bubble and squeak didn't do anything for me, but the pudding and hash browns really hit the spot. Eggs were cooked with proper runny yolks and the rest of the plate was went down a treat. The idea here is to get in, eat and get out, it's not fine dining, nor are you entitled to keep your table for ages. As greasy spoons go, it's good, but unfortunately a little too far for me to go for breakfast on a normal occasion.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "7LDWCOLV_KjP_RO0bn8PUA"
  },
  "ruZ0s5n1N8y0AXsH92_f_w": {
    "date": "6/17/2017",
    "text": "This is a great place. Small, simple, fast, and excellent food. The Old traditional English breakfast was as good as it gets. Don't go there for quiet ambiance, go there for simple, great food and friendly staff.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMu7jZwTthEOdhwb81wSQw"
  },
  "JA1Dd5-T250T92_oTXqvoA": {
    "date": "5/2/2012",
    "text": "I was looking for a decent full English and was originally going to go to The Breakfast Club, until I heard that they specialise in American breakfasts. I'm glad I chose the Regency Cafe (near Pimlico station) instead.The set breakfast goes for £5.50: egg, sausage, bacon, beans or tomato, toast or bread, and coffee or tea. You can add extras like hash browns or black pudding for 90p each. You'll likely have to queue up at the counter, place your order, grab your own utensils and find a seat amongst the suits and construction workers, then listen for your order to be called. There are specials throughout the week: shepherd's pie on Tuesdays, curry on Wednesdays, and fish & chips on Fridays, for example. There's quite a selection of other dishes as well. The cafe feels like its stuck in another time--nothing seems to have changed in decades, and that gives it a certain charm. While you wait, have a look at the photos on the walls showing the cafe throughout its history.The food was exactly what you'd expect in a full English. Everything was tasty, and it was served up remarkably fast. I will say that the fried egg looked somewhat plastic-like, although its appearance belies its taste, and that the bacon was rather on the salty side. Certainly worth a visit.",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VSIRSf2WfYgFxLMHHck1vg"
  },
  "CzuO-YDiv-XAlMLj26c46A": {
    "date": "11/30/2012",
    "text": "Before our trip I did a bit of research on yelp and told my two friends we had to come here since our rental apartment was nearby.  The first time we came it was busy but it seems it's always busy.  The line moves pretty quickly, and you must order before you sit or else the man taking orders will let it be known.  It's a little embarassing.  The menu seems limited but everything looks good you want to try it all.  The English breakfast is standard:  sausage, bacon, beans, tomatoes, eggs.  It's all very good and a good start to your sightseeing day.  I love their chips aka french fries and hash.  The second time we visited I ordered chicken and mushroom pie.  That was very comforting considering the cold awaiting outside.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "eNzai9sZPYC812Gmd81_QA"
  },
  "JXr2TGZrMYrTjYv9URmxfA": {
    "date": "3/20/2015",
    "text": "Solid English Breakfast. Not too greasy. Good coffee. If you want to go low carb, they can throw swap some avocado instead of potatoes.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhrOhUgB9T6jk7yfJ-nNXA"
  },
  "wZxsy_7wsQI66yG0zic0Lw": {
    "date": "11/19/2014",
    "text": "The only bad thing about Regency Cafe is that it's in London and I'm in California. I was traveling with a friend, whose favorite meal is a traditional english breakfast, so after reading a ton of yelp reviews, I decided we had to come here the morning of our flight back home. Good god did we leave happy. It's a super casual spot, but you'll see a wide array of clientele, including guys in suits and guys in construction hats. The food is impeccable and crazy reasonably priced considering how expensive food can be in London. We had the traditional english breakfast, with tomatoes, hash browns, mushrooms, basically everything extra you could get. We also got the special of the day, shepard's pie, which I couldn't resist even though it was breakfast time. I dream about this place and am devastated that I can't hit it up every Sunday morning. Please, if you live in London, go for me, ALL THE TIME.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ovdu6JsesZc1x19gsWSprA"
  },
  "Wr4LeqIzahsiFbe0fqJLLw": {
    "date": "2/7/2015",
    "text": "25 minutes in line, looked and smelled like a great greasy spoon. FAIL! At the register realized they don't take any cards. No sign on front door to that effect but they have a Yelp loves us sticker! Will take care next time to read location specifics that aren't always accurate...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9vj9sBKm-QX796Y-on4XA"
  },
  "KwumPvO_tK_f3EL4sagsfQ": {
    "date": "1/5/2010",
    "text": "Not knowing what a \"greasy spoon\" is (I'm American), we ventured to this breakfast diner hesitantly. I'm so glad we did! We split a very large breakfast special. The sausage was amazing, the bacon was thick, the eggs were fresh and the hash browns were dripping with grease. If ever in a need for a hangover cure, this is the place to go. Albeit we were yelled at for taking too many napkins, we saw this as all part of the local charm.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "R1ABomhycK6En1YJuaef3w",
        "caption": "Photo of Regency Cafe - London, United Kingdom. Breakfast Special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R1ABomhycK6En1YJuaef3w/o.jpg"
      }
    ],
    "user_id": "Kn7GDiJHkzMCspkR_36mqw"
  },
  "GTt7KU1joK8OjwRKQtdZ8w": {
    "date": "8/7/2013",
    "text": "Good value, breakfast is just under a fiver but greasy...I have experienced better!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4JW1l0sg6MI-wK0Yi_ecKA"
  },
  "AO9FNTa4bg-7FYD9zeUlPQ": {
    "date": "8/12/2013",
    "text": "Lovely little coffee shop  they serve the most delicious English breakfast I've ever had. Eggs and bacon were perfect and the coffee  freshly roasted.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "hYyfOaOa4tt-uwgcn15y6A": {
    "date": "6/9/2012",
    "text": "Ate breakfast here each morning I was in London a couple weeks ago. The food was great, the coffee was hot, and the voices of the workers were priceless. As others have said, they seemlessly alternate between a soul-vibrating \"ENGLISH BREAKFAST WITH BEANS\" announcement, and \"how can I help?\".If you're in the area, you have to go here. You get the feeling that this is what London used to be like - you know - before it became like every other megacity.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTgYEMJXWVikjlL0L1-mJA"
  },
  "wbJv6KtxgcfG_udwjJOYwg": {
    "date": "7/18/2012",
    "text": "Brilliant, gorgeous old school cafe.  (incidentally it was also the setting for the scene in Layer Cake where Daniel Craig tips tea over the tramp's face).",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Dqnj3tF6Pe-9Ss4ahO3tug"
  },
  "w01xdtN-r3z0J88jJW3RRg": {
    "date": "6/22/2009",
    "text": "This place is as authentic a greasy spoon as it gets. I live in the area and only get to go at weekends but from what i've experienced the food is great, especially if you've dragged yourself there with a hangover. In fact i reckon it's the best place for a decent brekkie in the area!The decor doesn't try to be 'retro' or kitsch' - this stuff is originall! The cafe is so visually striking it has also starred in Layer Cake and a VW ad.",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 6,
      "cool": 8
    },
    "photos": [],
    "user_id": "iGQlfbgvMuTC0XApmbG5tA"
  },
  "E83Us7NUYHYE8QKUXtQ8Aw": {
    "date": "5/3/2013",
    "text": "After reading all these great reviews, I had to visit this restaurant. We came around 6pm and ordered our food around 6:30, we had the chicken raviolli with potato and side salad. This filled me up and next time I am in Regency Street, I will definitely try some of their other meals as well. They looked really nice",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAyjqhQkEqgn3CExccEQcg"
  },
  "HUh85ZGW9MXSgK7ORmCYUw": {
    "date": "3/26/2013",
    "text": "I am a fan of the Regency Cafe, especially their English Breakfast. I always find something wrong wherever I go but the breaky here is awesome, The eggs, bacon, sausage mmmm yummy.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JGW2js6hleK6A3ZOYWugTg"
  },
  "zDq8nZfOXKwfw8oeJHsH6g": {
    "date": "8/3/2012",
    "text": "Solid English breakfast for a very reasonable price! Come hungry because it is a lot of food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAnlw-UAVYka6-nP0nSlsA"
  },
  "gcaOXWz-E64aws6bxD414A": {
    "date": "1/29/2009",
    "text": "\"CHICKEN, CHIPS & PEAS\" This is a fantastic British cafe.  I'd call it an old school diner myself.  Lots of charm to this joint that looks as if it's been transported from a movie set with actors included.  You can call it Edwardian but I don't know what the heck that means.  Wait in line, head to the counter and place your order.  Mostly diner type food; burgers, pastas, omlettes, roasted chicken and everybody is having chips (fries to all you stateside wankers).  When your order is ready the same guy who took your order yells out whats ready in a booming baritone voice.  CHICKEN, CHIPS & PEAS.  Great stuff.I think some of the locals were pissed because I was sitting down before ordering my food, a supposed no-no.  Damn Yankees.  Once I got my chicken, chips and peas I realized why the place was so damn packed.  A line was there when we arrived and the line was still going strong when we left.  The chicken was crisp yet moist and tender inside, covered in a nice pan gravy.  The chips aren't your daddy's french fries, they're more like roasted crispy potatoes.  If you've eaten proper chips you know what I mean.  The gravy had a sheen and tasted home made.  I gooped up every last drop on the chicken, the chips and the peas.  Proper British food to start off my all British day.  Go you Irons!!!",
    "rating": 5.0,
    "rated": {
      "useful": 9,
      "funny": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "op8FmScVlXFkVcqmyAlD3w"
  },
  "UFFpooMOQjfcKw8FjnfJYg": {
    "date": "1/15/2012",
    "text": "Definitely worth the walk away from the \"touristy\" areas. Other reviews have captured the atmosphere better than I can after just one visit - but I will be coming back here every time I'm in London, I guarantee it. The shepherds pie was good but the Cornish pasty was absolutely to die for. Good pastries, too.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZIk6IoBNnwJiwTCbBDk42Q"
  },
  "CiSwehQ1_NXB8WtXZLSfUw": {
    "date": "11/29/2009",
    "text": "Vintage formica. Love it. Great atmosphere and NOT a tourist joint - mostly locals and tradesmen (plumbers, gas fitters, etc) getting fuelled up in the morning. You should see the number of small vans parked outside in the morning! All the more reason for tourists to come and check out a genuine piece of London in the heart of Westminster. Bacon sandwiches are made wth slices of bloomer bread i.e. not a factory square loaf and bring your false teeth if you wear one because the bloomer bread is lovely and chewy. I still cannot get over watching people order and eat chips with their fry up breakfasts in the morning (before 10am)!!!! Queues at lunch time are long and a testament to the Regency's popularity. Check out their displayed boxing and football memorabilia too.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Oq--YfMa_2rBikEpDUbleg": {
    "date": "9/18/2009",
    "text": "I'm happy to report that the Great British Greasy Spoon is alive and well in Westminster. The Regency Cafe is certainly no secret, with a queue that stretched out of the door for the duration of my visit. Inside, tiled walls are decorated with movie memorabilia (although strangely no mention of Layer Cake) and the noise is almost deafening. What at first appears to be total bedlam is, in fact, an amazingly well organised operation. \"How does this work?\" enquires an American lady, \"What do I do if there are no seats available when my food is ready?\", \"Don't worry, there are always seats ready\" is the confident reply from the waiter. He was right. Quite how this places works so well I can't quite fathom, but work it does. At the counter a diminutive lady shouts out orders so loud that I can't hear myself think. Well cooked, hearty grub flies out of the kitchens to feed the queuing hordes. The Regency Cafe is a real find, and I loved it. I suggest you try it too - there will always be a seat for you.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "M2a_OCowDuom3nvT5dIq9w": {
    "date": "4/13/2013",
    "text": "Just awesome. The opposite of tourist fare.  Best possible English Breakfast experience--and I didn't even know about the Layer Cake scene until getting back home.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-nZXLQpZz89g8s-2uFyuQ"
  },
  "rJPIRYX4taxWrH-cssSrpg": {
    "date": "1/5/2013",
    "text": "I would go back to London just for this! The breakfast is a must with a good strong cup of tea. This place opens early and it caters to a mix of people from construction workers to businessmen.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ISoj-bv_ek4GXW5sGoigxA"
  }
}