{
  "vSNWdAVNZX9o-4LmMTWtLg": {
    "date": "7/30/2011",
    "text": "We probably would not have called in here if it was not for the 5 star reviews. And I don't think we will visit again. Its probably the place you visit once but if you are really struck you may use it as your local. It was 4 oclock and I was surprised to find the place empty apart from a couple of people at seperate tables. The wait for tea and coffee for 4 was 25 minutes, which I could not understand although it was worth the wait. You do get the free small saucer of Kurdish soup and a coiuple of spoons to sample and I guess if it takes your fancy you go for a full portion. to me it was a minestrone. The 3 stars are because of the toilets, not a pleasant experience, but there is a waiting room. At least I have found out where the traffic wardens hide away till the end of their shift.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EO6mSZL5otS3akXHrBFSsA"
  },
  "eDeGpph85zQdPMQ_MciGWw": {
    "date": "4/21/2009",
    "text": "Met a friend already there. Can't believe I never knew about this place! One of the owners who works behind the counter is actually an interior designer and did most of the work here. It is a charming place. We whiled away the morning to lunchtime with no pressure to go if anything to stay! It is also a deli and has a superb collection of teas which they can recommend as well as smoothies and juices. I ended up buying four boxes of different teas! I had a Kurdish soup which despite not being a soup fan (find them not filling enough) filled me completely that I regreted asking for a pitta bread. The other brother is a right charmer, giving out soup, juice and hot drink samples. If your in Camden and want to escape the bustle without ending up in a chain. This is the place if you like a middle-eatern, african design slant.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EqigsmqoXiQ3xBg9d6UINg"
  },
  "gxsMdsfJoGhbf_477U_Zmw": {
    "date": "1/25/2011",
    "text": "Cute, little laid-back cafe. I really like the forest-like interior; you can sit on tree stumps while you eat your hummus, veg and falafel. It was like walking into the set of Ferngully. I had the falafel meal and the acai and pomegranate juice. The portions were quite generous and all the ingredients were fresh. Felt healthier and refreshed right after the meal!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mwJEd2Pp9bFfNGo1rZ9NvA"
  },
  "-H4IRegLbDbqKdiOHCmjXw": {
    "date": "12/31/2010",
    "text": "Nice vegetarian cafe near the Camden markets. I thought my falafel plate was good, if not stellar, and a little over-priced for what it was. The place is decked out in some sort of hippy arabic style that is actually quite charming. This is more a simple cafe than a restaurant. It's not a place to go with someone for a serious sit-down meal, and I didn't find the food so amazing that I am likely to cross town to try it again anytime soon, but if you are in the area this is a great place to chill-out and have a simple (but tasty) veggie meal.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-KqJs1MDCT5eqbmgnEvRQ"
  },
  "ntdRQlj46AS0NydfnnyIQw": {
    "date": "2/20/2010",
    "text": "Thanks for the tastiest maciatos in Camden!  Perfect on a rainy day to escape the Camden traffic.  Very unique rustic ambiance that takes you away to somewhere on a holiday far far away.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cyYzH4lnBhzK7BfNOLl7UA"
  },
  "_N3-PdGXCcXeL0Ni-XN05A": {
    "date": "2/18/2012",
    "text": "Was there on a Saturday afternoon with friends, lovely interior and atmosphere but: 1) it took them 15 minutes to make 3 cups of cappuccino, even though the cafe was almost empty; 2) the cookies and brownies we bought were at least a couple of days old.  This really spoilt the experience of an otherwise cool coffee / quick bite spot.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6NCjOy0wEwbuwiUhGAzPig"
  },
  "o4mzpzrDQE1HZstHdIC6AA": {
    "date": "1/20/2009",
    "text": "Must have walked past this place a million times and not noticed it but very glad have found it now. Half shop half cafe, plus a bit deli as well! Went for breakfast but all a bit healthy for my liking so had an espresso which was one of the best coffees I have had in London - proper rocket fuel. About to leave when the lovely guy who works there told us he had prepared us a taster dish for free! Walnuts covered in delicious plain yoghurt with date syrup on top. It was like heaven. Also did the trick of keep us there longer and we ended up spending a lot on various things like a really good Egyptian hot sauce and aforementioned date syrup from Basra. He also chucked in a few free chocolates for us. Looking forward to going back and getting a falafel wrap.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "CuBiKO0c49XJmE1PXFiXig": {
    "date": "6/5/2011",
    "text": "This place was recommended to me by some (meat-eating) friends who frequent it. We all got together for a meeting there on a rainy morning in May and my first impression was to be very charmed by the atmosphere and the decor. Tree stump stools to sit on, a woven basket where we put our umbrellas and potted plants and herbs growing by the window. We went up to the counter presenting the food deli-style, and as my friends ordered their usual favourites, to help with my decision the guy at the counted handed over a little dish of soup for me to try, which was really veg-ful and hearty. I went for a plate piled high of salad, roasted aubergine, sprinkled seeds and a whole bunch of stuff. A full meal, just over £5. I hadn't eaten anything that day until then, it was a pretty late breakfast for me, and a very satisfying, fresh and energising one too. I tried some of my friends guava smoothie, just to taste - really sweet and tasty stuff, I recommend it. We actually stayed for hours just chatting about our projects and (perhaps since it wasn't busy at all that day) no one minded at all. I'll return next time I visit the area, particularly for lunch type stuff. Check it out if you want a cute and rustic veggie experience.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OpxudVCFUZZ1_5o8CLYsg"
  },
  "mb-FHwM-OBAKmW6gP3sk6A": {
    "date": "4/10/2008",
    "text": "You can't see the name from the street, but it is easy to find as it's over the road from the entrance to the Stables Market and up towards Chalk Farm. It is a small organic shop with chairs and tables outside it. At the back inside is a beautiful cafe area with tables and seats sliced from huge trees with polished rings and bark. Newspapers and cookery books are available so you can sit and read. It is the sort of place you can sit in for an hour or two undisturbed, or chat to the staff. The owner is very friendly and always offers me dried dates and figs as I leave. The best thing is the incredible hot chocolate, more like hot chocolate soup. Expensive at £2.45 for a large cupful, but so wonderful it's worth it. I find it a soothing, quiet retreat from the crowds of Camden market, and I keep going back for the hot chocolate.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "1UD_1ghCF_jPUaZYxP2r4A": {
    "date": "9/29/2008",
    "text": "Agree with previous reviews, this place is a real find. We had two cups of their own-blend, South American coffee and were seriously impressed with it - we asked if we could buy a bag, they ground the beans and filled a brown paper bag for us. Sitting in the cafe at the back is great with the tables and beams carved from old trees - nice touch!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "sadggjOdrCOXPZMN9IvjUw": {
    "date": "1/14/2008",
    "text": "An alternative to the Camden Town Fresh & Wild, particularly if you want to sit indoors. Healthy foods in an exotic (Kurdish) atmosphere, courteous and friendly service. I often shop there for bread, snacks and takeaways but on a couple of occasions have had a meal with a friend in the cosy, dimly-lit area at the back of the shop furnished with log seats and cushions. Very romantic, if you're that way inclined, or just lovely and warm. With nice weather, though, you can do the F&W thing and sit outside, opposite Camden's Stables market.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "Y7y47_BiKlw_8qjs7jy5hg": {
    "date": "8/29/2010",
    "text": "Amazing coffee, great staff and a genuinely cosy vibe! Go there if you haven't been! :)",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "oVQJs4jwE7XVuZvgOdOhzg": {
    "date": "4/17/2012",
    "text": "It's like walking into a quirky hipster jungle hangout, except cooler, and the food is cheap and the drinks are fun. I figured out what type of place this was from 1) the soulful 20-something girl panicking to me randomly about all the work she had to do (she was studying there, cool); 2) the free soup to sample that the server offered us, which was really just a free bowl of soup that the customers in line communally gathered around with multiple spoons.I had spicy hot chocolate and a falafel plate. LOTS of food and it's yummy. Would love to come back and study there.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tkZFQpxEQhhSPLO1SAV6hw"
  },
  "2ZVg7yAgPEWCKqIEqnOcLg": {
    "date": "7/1/2011",
    "text": "Well everyone knows this is the friendliest place in Camden ... you can't fault them on much. It's warm and welcoming ... good selection of food and drinks. ... it's just really expensive for portion sizes! There is lots of competition when it comes in Mezes in Camden and i end up in the market with massive plates of veggi goodness for less than a little plate is there.Nice meeting place for friends. Lovely on a hot day sitting outside ----- the sun perfectly hits here at lunch. Perfect for after work drinks in a chillest environment or morning coffee and a smoothie to cure a hangover. And seriously i love the owners more than any other place around!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sN6Vui8DpOFNfuoDBI1Oxw"
  },
  "SZp_Lv9nqhNeES3lC3Sngg": {
    "date": "11/9/2012",
    "text": "'My Village' excels at providing outstanding service as well as outstanding atmosphere, the vibe is truly welcoming, those guys that run the place put their heart and soul into it and it comes across! Coupled with delicious organic and natural nutritious 'homemade' foods and drinks Whenever we go we feel like we are in a little wood clad rustic oasis outside the regular London hustle and bustle, It's rare to go in and not be offered some delicious treat to sample. There are unusual special ties such as smoothies made with the fruit of the cashew nut, there are tasty juices, amazing felafel's, soups and salads the food isn't over seasoned. a superior teas collection, wonderful wines- and colourful friendly clientele.It's hard not to pop by when in the area, it seems they are constantly evolving with life to nurture and implement all sorts of scrumptious delights that keep us coming back for more- they really put the spirit of an attitude of gratitude into all they are and do, and that's why I'm so happy to write a review~ check it out!",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5b0rb6QkMKdME4rhYWfJkA"
  },
  "lwLhhKCtBZ9l2z0QD3Rdng": {
    "date": "4/15/2014",
    "text": "Pretty decent vegetarian nosh. Prices are OK - but you can't leave without trying the spiced iced moca coffee. Devine.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NB4EP_cB5PgALrw82aDlXQ"
  },
  "xRKKCQbuTXKAaOdRS9iLhQ": {
    "date": "11/27/2010",
    "text": "Great happy atmosphere, friendly staff and good food. I really enjoy my soups, especially on a downer of a day. I got a bowl of their soup of the day, which was a mushroom rice with bits of corn and red pepper and fresh herbs.  The mushrooms were nice and chunky and the soup base was thick and delish. A bit of brown pita on the side and a freshly squeezed oj and I was set for lunch.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8MZXYfhV9UzuSkmm74Ng"
  },
  "aIB40dE7K-35xRjDYYVoNg": {
    "date": "3/24/2010",
    "text": "As intelligent human beings we may fool ourselves into believing it is ok to eat that bag of cheesy Wotsits (Cheeto's for you Americans) or that King Size Mars Bar. Yet deep down you know it is bad. But then there is cake. Sweet, moist heavenly cake. I can't go without that. How about if you can have your cake without the guilt? How nice would that be? Well you can at My Village Cafe. There are always at least five different freshly made vegan/vegetarian cakes to choose from. Some may be wheat free, dairy free or have no added sugar. I sampled two today and both were delicious. At £2.95 a slice it isn't cheap, but I love this place for its selection of healthy hot meals, salads, soups and smoothies that can be enjoyed in scenic surroundings and spiritual bliss.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "mx0AZEmzuFg9ZQ2i0Fak4w"
  },
  "B1H-l0zn_uNovn31jFLflw": {
    "date": "8/1/2010",
    "text": "One of my favourite local cafes. Now that I've moved from Chalk farm I miss it terribly. Part cafe, part food shop. Super cute atmosphere with wooden tables, chairs, magazines, just very comfy and warm. Great music. The owner, a Kurdish/Korean man is super nice - always gives us hot chocolate or soup samples in little shot glasses. I love their soy hot chocolate and how they have no surcharge on soy milk.They sell vegetarian food only - very simple fares, felafel rolls and salads for very affordable prices. I think the felafel rolls are 2 pounds. Love their homemade soups as well. Yummy and healthy. The ice chocolates are amazing as well.Wish they serve more breakfast type food.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0WtY-wfWtFiuOl1go_xFA"
  },
  "3aehrv1ut9TvqmU8pQ7U6w": {
    "date": "11/12/2012",
    "text": "Really tasty food, great variety of meals, wicked smoothies. Camden is my home from home when I come to London. Pretty hippy-feeling (not a bad thing, really).  I always seem be surrounded by rude, gawping customers whenever I visit though, which has put me off somewhat. But hey, that's irrelevant I suppose.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VfnVnWOcs2EvkiJpf1kb_A"
  },
  "nAM-O5kRHEk3zWBiQUKdPw": {
    "date": "12/24/2008",
    "text": "It is so good that this place opened- it has resurrected a row of depressing shops (it is right next to an all night sauna) and there isn't anything like it in the area.The brothers who own the shop/cafe are very friendly and keep a loyal and regular clientele  happy by giving ot extra little bits whenever you buy anything from there- I have been there probably 10 times and each time I leave, they always give me a fig or date. They have a big selection of Vegan cakes and deserts (which don't taste Vegan at all) and they freshly squeeze juice to order. They have a wide selection of dairy-free products.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5H6KTLHbFAnWiOr_9fUbHQ",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5H6KTLHbFAnWiOr_9fUbHQ/o.jpg"
      }
    ],
    "user_id": "-AuZkeiKZ8bio3Q6UItNwQ"
  },
  "uPDwpyyD6qUtNFXnMX_XOA": {
    "date": "11/6/2009",
    "text": "If there is one place you should stop for some tasty, healthy food and drink on a day out in Camden I recommend that it's here. My Village Cafe is not just about the great food, going to this cafe is an entire experience for all of the senses.It specialises in organic vegan and vegetarian food, and sells packaged products as well as freshly made hot and cold food to eat in the cafe area at the back. The tables and beams that make up the cafe area are carved from old trees, and there are all sorts of interesting lanterns and other objects hanging from the ceiling and on the walls. The interior walls have been stripped down to reveal the bricks and lovely, dark wooden shelves line the walls to display the food products. The front window has blue fairy lights draped across and fresh fruit and veg tumble down a display making it look like a harvest festival offering.Newspapers are left out for diners to have a read of whilst eating, dates and figs are given as a complement next to the till, and the exotic tea bags can be used over and over again without any extra cost. These sweet touches make you feel really at home. As for the best thing on the menu, you must try the chick pea soup. Warming, wholesome and lightly spiced, last time I was there I even heard several people complementing the chef and asking what ingredients were in it.The owner is incredible; friendly, attentive and creative (he designed the place himself) and always welcomes you with a warm and generous smile. I really get the feeling he has put a whole lot of wholesome love into his darling little cafe.",
    "rating": 5.0,
    "rated": {
      "useful": 5,
      "funny": 2,
      "cool": 5
    },
    "photos": [],
    "user_id": "SazNhsqh0aCMKkn55MXjBQ"
  },
  "tmn_WMpvc1WcLlk8qpAt4g": {
    "date": "6/14/2011",
    "text": "This place is a real gem! Met some friends there on Sunday night. You can't tell from the outside just how spacious it is.  As I was standing at the counter wondering what to order the guy behind the counter gave me a small glass of banana chocolate milk to try. When I went back up later with a friend, we got given a sample of smoothie & a little plate of 'Grannie's homemade soup'.  I had the Halloumi Wrap, which my friend cutely calls the Halloumini wrap. The food was lovely . Later on I had a glass of red wine which my friends were surprised by as it's a veggie bar & you might not expect them to serve alcohol.  We chatted with the French guys on the next table who were playing chess...and stayed till they started dimming the lights and getting ready to close. All in all a lovely place to while away a few hours with friends...definitely will be back soon",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "t6Ddodr6ei4HGM8lEykC_Q": {
    "date": "11/14/2008",
    "text": "My Village has a certain rustic charm and the back of this shop is all wooden with benches. I like to come here and buy a prepacked falfel en route to my hair appointment sometimes. This store also sells cold bottled organic peach juice and doesn't take the piss with the price. I am a bit boring with my food (read it as health conscious) but there is also an assortment of cold dishes (the attendant serves you) including at least 2 varieties of falfel balls. I like to see the calories on the food so I get the cold ready -to -go sandwhich. This is not a bad place to stop and have a bite to eat if you feel like eating in. The staff are nice enough to take your prepacked sandwich (like mine) heat it up for you and put it on a plate. I know the calories then and it is hot. Nice.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9FHN8N4fdnPX5b5NYONEig",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9FHN8N4fdnPX5b5NYONEig/o.jpg"
      }
    ],
    "user_id": "6nUELLdYcIv52k9_yLMHrQ"
  },
  "S4pFkm2KGlXZIhml8azanQ": {
    "date": "12/11/2008",
    "text": "Delicious tea, stunning decor that makes me think of a tea shop in a moroccan souk (bazaar), and the great feel of Camden Town's crowd. It's a recipe for success.We went for tea and loved it. Definitely one of the best places to crash for some quiet time after visiting the market. The loo is a bit horrible and in the basement, so I'd advise you only visit if in dire need of amenities.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xr6_n6hM1CraIfPZvZjmMQ",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xr6_n6hM1CraIfPZvZjmMQ/o.jpg"
      }
    ],
    "user_id": "nD-jmtxTaLuimmYpwlQ3ZQ"
  },
  "a-gBtSKr8SPpeUSathwQHA": {
    "date": "7/7/2010",
    "text": "Went in here for some coffee while Queue'ing at the Roundhouse (which we SHOULDN'T have had to do because we had tickets, but that's another story altogether...) and left with a huge smile, amazing coffee and samples of EVERYTHING in the store.The people who run this place are super nice, make amazing soups and offered to teach US how to make them, at the price of one bottle of wine... Deal, Sir!I've always passed this place but never really thought about it other than, 'my, that's a cute place.' It's now my go-to for coffee places in Camden simply for the atmosphere and being amused by the staff (in a good way of course!)P.S. try the Mocha Banana shot...mmmm, boy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rMWgld8tuHE3vHE93TJLxA"
  },
  "dDCY0SAXnh0rvVnuQe7ZEg": {
    "date": "7/30/2012",
    "text": "I had the falafel wrap to take away. It was enormous! tasty and only £3.75! I want to try and Nutella cake next time...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hzt2Rv6SHaZZEb-4peqEPg"
  },
  "iTsgmjYXao1VozheUsySUw": {
    "date": "8/26/2009",
    "text": "My favourite Saturday after yoga spot. It is so lovely - the staff is very friendly and food is delicious. The best is the soup - every time I have it is better and better. Salad selections, great juices and cakes to die for. It has cosy sitting area at the back and every time I brought someone in they were impressed. It is unlike any \"trendy - pretencions\" organic cafes in London, this one has a heart to it!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XOHt6k0WiQoWcxzc6-ZEbg"
  },
  "gQ51X8QoEvzDqzbKjyMdRg": {
    "date": "9/29/2011",
    "text": "Really nice owners, fresh, yummy salads/mezze, fresh carrot/apple/ginger/mint juice and an earthy, warm atmosphere. The music always seems well picked as well. I can't eat at many restaurants without paying for it later (food intolerances), but here I can eat most things, and it's satisfying and tasty.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zAD8msHAmkuOkTPpLXE4PQ"
  },
  "xgJZXaE-ueK6bDfN0_EVHg": {
    "date": "8/4/2014",
    "text": "Came here several years ago on my first trip to London. We had arrived in town at 6am and couldn't check into hostel till around 3 so we were wandering around for hours, ended up here exhausted and we sat for 2 hours with no complaints from staff. A helpful patron at the table next to us even helped us map out the next couple of days of our trip! Such an adorable shop I just spent 45 minutes trying to find this place for our trip again next week, can't wait to come back!!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "56oWu2_8nErsUJkfcbdkjg"
  },
  "gs64lmmoKs9ttgB_rh5fbw": {
    "date": "4/7/2010",
    "text": "Awesome food, lovely staff, free tasters and hot water refills with your tea! They also have eco products for sale. Would definitely go back again as it had a chilled out atmosphere and quirky decor.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LMzEIVGjYAcOYoDQiioNng"
  },
  "RECJVPaVIWc0xEFixGagxg": {
    "date": "12/31/2010",
    "text": "This is a nice little veggie cafe that also doubles as a little store. The owner is very friendly (and will probably give you some chocolate creations to taste), and the place itself quite charming, although I must admit that personally I am not a huge fan of their decor (a bit too hippie-style for my taste). The food is good, but nothing too special. Worth a visit if you're in the area.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UnLIvR1AyM9JD2RgQfY5Lg"
  },
  "Jd8gi6MIZ-b0QygrnnDxxA": {
    "date": "10/22/2018",
    "text": "Amazing food, cute comfy, interior and such nice wait staff. A bit expensive, my salad was £10 but not bad for London",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D0r2ODLzWY3i_oCV278Z3g",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/D0r2ODLzWY3i_oCV278Z3g/o.jpg"
      }
    ],
    "user_id": "bixOFcqZ00eAsR3zt9QXHQ"
  },
  "--IU7JNsPS3-EWz2J3V5Bg": {
    "date": "5/5/2017",
    "text": "Very cool place right down the street from Chalk Farm station. I had the falafel plate and I really loved the falafels- yummy in my tummy. I find it difficult to get a falafel that is soft and warm. Maybe I'm just looking in the wrong places... The ambiance is certainly interesting. It's like you're living in a tree, or something. Haha! They are very nice and eager to give you samples of daily juices and coffee drinks.",
    "rating": 4.0,
    "rated": {
      "useful": 5,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "rSPu1DIuxPpiexF5RaB3AA",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rSPu1DIuxPpiexF5RaB3AA/o.jpg"
      },
      {
        "img_id": "3I_zx3zmqDmv0kzlyyKSZg",
        "caption": "Photo of My Village Cafe - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3I_zx3zmqDmv0kzlyyKSZg/o.jpg"
      },
      {
        "img_id": "s8Var0-kUa9XbS6FnWqtxQ",
        "caption": "Photo of My Village Cafe - London, United Kingdom. Falafel plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/s8Var0-kUa9XbS6FnWqtxQ/o.jpg"
      }
    ],
    "user_id": "ya0gjXEHjpvuLIFybCajcQ"
  },
  "yQBdprmHFl0r5p99k51vXw": {
    "date": "7/1/2017",
    "text": "LOVEThey always have a variation of what they call Grandmas Soup which is basically their soup of the day. Everything from mango carrot stew to vegan chili. Always warm and filling. I was first introduced to this place by my friend Angel who swears by their spicy mocha, and with good reason! It's the perfect combination of sweet with a kick of spice but not too much.Outdoor tables are great for people watching but not so great if you're not a smoker. The vibe in this place is always so zen. The lighting is dim, the music is relaxed. In fact, I always resent the groups of bargoers who interrupt the chill vibe by coming in and looking over the wine menu only to realize there loud group is better suited elsewhere.They accept credit cards but under £10 costs you 50p. It's technically self service but they'll check on you. Free samples of soup as spicy mocha are always the best. All vegan but you don't sacrifice a thing. A relaxed departure from the bars of the area. I always find myself back here.Quote on the walk says it all.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gh7a3aAOlB2zMRocFzGEZg"
  },
  "L17Hjf3ZdVgtca6bAnlHDw": {
    "date": "4/15/2017",
    "text": "Very cool little cafe with a really hipster nice environment. I would definitely recommend checking this out if you are ever in the area. The drinks where delicious which was the only thing I tried all the food that I saw looked amazing as well. Everything looks nutritious, fresh, and delicious, definitely a good choice when you are surrounded by relatively unhealthy fast food",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "XaMqLuuK-95DVohhdE7xvg"
  },
  "br-1TrF2Es7jBnSpacPF6g": {
    "date": "1/27/2017",
    "text": "Honestly, I don't know why this place is ranked so high. The dominant experience I had in My Village Café was hearing a 'waitress' or 'hostess' complain about how she wasn't paid enough. You'll notie the quotes because the entire hour that I was there, she neither 'waited/served' or 'hosted'. Meanwhile, my food was slowly prepared and I was called to retrieve it from the counter, rather than being brought to me.The quality of the food was simply mediocre. I jumble of vegetarian fare was thrown onto a plate that was too small. One simply could not eat without spilling food over the side. I did not order a salad, yet that's what I received... mostly spinach and rocket, with stale hummus dumped on one side next to falafel.This place would be good near a university for students low on cash, if only the prices were halved. Otherwise, it's a venue for those seeking a bohemian atmosphere and have some extra cash to burn. The two stars are for the potato and spinach bites, which were actually good, and the interesting ambience and decor that transported one out of London. However, I'd prefer to be transported to somewhere with better food and service. I will be going elsewhere next time for a vegetarian lunch.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 10,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ZRUoUDNKCCknaP_yvhMAA"
  },
  "xs9LBUpur_A3X_Y6zP2H5w": {
    "date": "12/6/2016",
    "text": "Why is it that Camden offers so many wonderful options for Vegan food? It may have something to do with the vibe in that area, a lot of true hippies - people that are opposed to animal cruelty - don't mistake for hipsters, the younger generation that always know the coolest places to be. I truly think this is known to those who go looking for it, as it is away from the Camden market spectacle. Can't rave enough about the fresh juices that they offer, so many different options and then look at my falafel meal, have you ever seen anything that colourful and nutricious! If I had my way I'd lock myself here in the basement and never leave, wonderful people, wonderful food - a must go to for anyone keen on having good vegan food!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CDNWfgJm4Gudli-qERKOxg",
        "caption": "Photo of My Village Cafe - London, United Kingdom. Falafel meal - you be the judge!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CDNWfgJm4Gudli-qERKOxg/o.jpg"
      }
    ],
    "user_id": "_YYSx_zGOSltv3VXZ6PLWw"
  },
  "Bv3m4lz9TS35cFhvhs9fJA": {
    "date": "3/7/2015",
    "text": "Omg the service is slow! 15mins and still no drinks... We were drawn in by the street style cafe, especially since it's a gorgeous day we wanted to sit outside. We are in a bit of a rush though and these people are just taking forever.. Let's hope the food makes up for it! Oh dear! The food that drew us in looked so much better than it tasted. Was pretty bland, potion sizes looked a lot but actually when it came U see it was all just filled up with salad leaves. Some people next to us had pieces of cake and coffee and the slices were massive, but not sure about the taste.Wouldn't come here again",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BFkC-6-fcBZpHB0YsmQ3zQ",
        "caption": "Photo of My Village Cafe - London, United Kingdom. Haloumi meal",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BFkC-6-fcBZpHB0YsmQ3zQ/o.jpg"
      },
      {
        "img_id": "ymN4eB6a0X4arnl-e4yedA",
        "caption": "Photo of My Village Cafe - London, United Kingdom. Salad bar",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ymN4eB6a0X4arnl-e4yedA/o.jpg"
      },
      {
        "img_id": "EkjTCpXNzxFWi4cK1xhxqA",
        "caption": "Photo of My Village Cafe - London, United Kingdom. Street cafe style",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EkjTCpXNzxFWi4cK1xhxqA/o.jpg"
      }
    ],
    "user_id": "Mm5kSf5aIA41ocS7N6M_NQ"
  },
  "vqTUgdEjoL3n6xsW5UM0gQ": {
    "date": "7/26/2014",
    "text": "Stopped in today and got the spinach/potato balls which are pretty great as well as a hearty helping of the curried lentils. Even my nonveg husband was surprised at how good it was. Also got the aubergine spread which was only okay- the smokiness is a bit overpowering. The Nutella cake has strong orange notes in it; I didn't taste any Nutella so while I liked the dense nature, I thought it was only OK.The pinged star is for the snotty attitude of the Italian cashier. I'm learning more and more that customer service is a foreign concept in Europe =/",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OoDYh7DK_9tpOneTacTlaQ"
  },
  "q9Q3j7l98x4FsF5eAIWdDA": {
    "date": "3/8/2014",
    "text": "If it was MY village, there wouldn't be so many cows in it. This is literally the cheesiest vegetarian restaurant I've ever been in. Who puts cheese over falafels? KURDS.Well maybe not, I've never been to the border area of Western Asia and the Middle East so I am not for certain how much cheese exists there. I once I had a dream I was in these parts. I was wearing the wrong traditional hat and clothes; and everyone was laughing at me at border inspection when my little plane landed.Anyway, this Kurdish vegetarian restaurant was perhaps more interesting in an ethnographic sense - the decor was very effectively un-western in a way that appeared actually authentic. I last went here about a year ago and the servers/workers were wearing headscarfs and traditional garb, similar in a way that seemed like something that they'd wear any day of the week.But the food, the food had something left to be desired - it was cheese-filled (not printed on the menu) and jejune, I actually felt like nothing from this village came into existence outside of a plastic container at Sainsbury's. It was very, in American terms, blah.But really, I will keep in mind to ask for a falafel with no cheese if I find myself in Northern Iraq.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "e6K4JQZEltqZ6o7uhq2kTQ"
  },
  "Gl05WL_pLF4mmV-KbZd6hQ": {
    "date": "3/10/2016",
    "text": "While the decor was interesting, the food was decidedly not. When I go to a restaurant advertised as vegan/vegetarian, I expect some innovation. I ended up with a middling falafel plate with salads I barely touched. My friend was likewise disappointed with her food. In a pinch, this cafe would be okay, but I wouldn't go out of my way for it.",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m4eDMRCuJhSb8oQT3V4N0A"
  },
  "-tkRJWT-yawiolnYSI6XUg": {
    "date": "11/4/2012",
    "text": "What a great find in the middle of hipster-ville. The milkshakes are really yummy, with flavours like cardamom and chocolate almond. The lattes are strong and really tasty Turkish coffee. The falafael meal is really large and made with fresh veggies and sauces. The staff is also really lovely and nice, though can be slow at times. The ambiance is like that of a hippy bar at burning man. Its a sweet spot for a bit and a coffee.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IFz_4XymbJ8eonWGcc3qkA"
  },
  "GOQ5-m3PZnUgjbymf-RfIQ": {
    "date": "10/30/2014",
    "text": "Popped in on a Wednesday evening for Hot Drinks but actually had food as the place looked so interesting.The hippy and bohemian look won us over, boy did we regret ordering as the wait was quite excessive and the results were very ordinary.Lovely staff but they were quite clueless and not sure if they were running a cafe or a commune.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "WTRs67C5NxoM2uwKGNH6-g"
  },
  "exMfU1L4wpE3eAMqAicPUw": {
    "date": "10/11/2015",
    "text": "Great cozy wooden atmosphere! Nice service! Amazing display of fresh foods (took me ages to decide on sth). Really good coffee!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OrshufVZpnJOAWtccg6hMg"
  },
  "4WD5TPaLu1xOCAobLAiG8w": {
    "date": "12/10/2015",
    "text": "Lovely ambiance, very unique. Was there with my colleagues last month after office, it has been an wonderful experience. You really need to have free time to enjoy the meal here. They have variety of vegan options and everything is delicious. Service is slow but we did not mind given the ambiance and some books to read. Owner is very funny and talkative who keeps you feel welcome all the time. Would recommend if you prefer veg/ vegan food.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzJ0PqZAXtBUUU9XY6ygxQ"
  },
  "h-sU7f0aeINITALaolA2Og": {
    "date": "12/19/2013",
    "text": "love the place! If you are a veggie, you know how when you go out sometimes, you really REALLY wish you brought your own food with you because what you ordered is absolutely DISGUSTING? Well, this is not that kind of place! I have been to  MVC about 4-5 times and every time i got the mot delicious food prepared for me then and there! try their juices. the staff are beautiful, too, delivering great service.it's a quirky little place that i just want to come back to over and over and over.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tkzWc6pqwccL5w08DRHfPA"
  },
  "7KiiXZpkd0VvcpYCIuGTrQ": {
    "date": "10/28/2015",
    "text": "Nice spot for vegetarian/vegan Mediterranean lunch. I went twice in two days when staying nearby this week because it was so good. Really cozy and comfortable, friendly counter staff, and really good food. I had the My Village Meal the first time (£7.45 eat in £5.50 takeout): the salad was fresh and crisp and tasty, the flavours in the rice and the fareek were really nicely balanced, it felt healthy and all tasted delicious. Today I had the Grandma's Soup, a broccoli and spinach soup which tasted freshly made and was hearty and healthy and warming, and served with pitta bread. I added a few falafel for 60p each, and a pot of houmous for £1.35. Both times I also had a spicy iced mocha, with coffee, chocolate, ginger and cardamom flavours, which was also delicious. New favourite spot around these parts.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2iOYrnPmitAly7Ku7L5Fg"
  },
  "_t23yWP177ld_vsLHi3Uow": {
    "date": "2/8/2015",
    "text": "My favorite place to eat in London. I visit London twice a year and try to eat here at least three times.  The staff is very friendly and all smiles when you enter.  The prices are very reasonable considering the amount of food you get.  Everything is so fresh and filling and you leave feeling like you did your body a favor. I took my whole family there last week and everyone loved it.  Americans love to chat with strangers and my dad more than anyone.  The owner was quite nice and chatted with my dad for a bit about the food.   Five minutes later he brings us a plate of grape leaves for everyone to try.  It was a sweet gesture and worth the five stars.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c7lHjdHOxnoAphIXtHOKHQ"
  },
  "2KU1A10cKyQ95tyec6WL2g": {
    "date": "4/5/2015",
    "text": "Great and amazing vibe! Lovely food and service! No wonder I am there all the time whether is celebration or friends meet up! Oh...wait...Coming! Love",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vsjca3EPlkIiwaNkEdeVsg"
  },
  "2u-D7JmwTRzoDB26H5qmqw": {
    "date": "6/14/2012",
    "text": "What an unusual quirky eatery I have stumbled on here! I couldn't even identify half of the things the things on my plate but I reckon I it must have had about 10 of my 5 a day in it!While the food was primarily healthy and secondarily tasty I did enjoy my meal and am sure to be back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "89CBxRWFAaA1k2UufxVUCg"
  },
  "xR9rRR4-bjxKB2bDB9ObTA": {
    "date": "2/25/2013",
    "text": "I've loved it here from the first time I was taken here!The food is delicious and healthy, and I really love their mint tea too  it's so fresh, and often staff offer to refill your glass with hot water so you get a second cup of tea for free. Although the decor isn't quite to my taste it's really comfortable and cosy.Staff are very friendly, and often give samples of various items for free. Such a mix of people come in here that it's also a great place for people watching. Very relaxing and informal environment, I love it!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  }
}