{
  "KzEkIgBMOJ0mKt7JY2Uaxw": {
    "date": "1/15/2015",
    "text": "Went to the hotbox for dinner with some old friends. We had a drink in the very cool bar downstairs which did an awesome range of cocktails. The bar was quiet when we arrived but very busy by the time we left. The food in the restaurant upstairs was one of the highlights of our holiday. The pork ribs were finger licking good, the beef was some of the best I've had, succulent and to die for. Service was friendly and excellent - the young man who served us was more than happy to explain menu items and suggest good combinations when ordering sides. I wish we had one in Australia. Definitely recommend to anyone looking for a great meal with friends.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XBz48Im03GFtlYHkkNVjIQ",
        "caption": "Photo of HotBox - London, United Kingdom. The smoked selection - pork ribs, beef short rib, sausage, chicken thigh and a jalapeno coleslaw side. Perfect amount of food.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XBz48Im03GFtlYHkkNVjIQ/o.jpg"
      }
    ],
    "user_id": "HPAsFp97o5QTBbzdLPk7jw"
  },
  "cTnxibBk86I9PS4Zp_4l1Q": {
    "date": "8/3/2015",
    "text": "I came here for brunch with a few friends after having come across the name on a few London food blogs. They recently started taking reservations, so we made one just the day ahead and arrived at 11:30, when the restaurant was only half full. This place is known for bottomless brunch, but having had a late Friday night, we passed and I got an iced americano instead, which came served in a beer mug (the coffee itself was average). I was torn between the eggs benedict with pork belly and the beef rib taco, and I ended up going with the latter with a side of guacamole. I was served two medium sized tacos that were solid, but coming from California, probably not the best ones I've ever had. I thought guacamole should have been standard. My friends got the truffle egg toast, the roast corn & crushed avocado toast, and the buttermilk pancakes with bacon. I tried some of the truffle egg toast and thought that was outstanding and unique, and I was told that the pancakes were also some of the best my friend has had in a long time. The music got really loud and clubby by the end of our meal, which was not so great for catching up. I've had better brunches, especially where I can hear my friends and I'm not sitting on benches like a canteen, but they've done the food well, for sure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TADwzxpWw_NBIXNXbk4vNg"
  },
  "9jJl-jcg-W6WEPPk0H3E9w": {
    "date": "6/25/2015",
    "text": "The pulled pork was very juicy and tender with a hint of spiciness, very flavoursome and robust. But the star item was still the smoked pork ribs, once again it was sensational, it had a big smoky flavour with the perfect balance of sweetness, spiciness and saltiness. It was a very fine piece of rib and one of the finest I have encountered in London. To sum it up, Hotbox is a great BBQ joint but there are misses as well as hits, price wise it is not cheap with side dishes costing up to £6.50 and the main cost anything from £10 to £24. A great addition to Spitalfields but not one that I will return in a hurry.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zylBQiBTm35gwcPVFz_9ew"
  },
  "w3M4GpK0PtZ5KlixQnG_Ag": {
    "date": "9/13/2016",
    "text": "Best burger (and in general, best meat/smoke meat) I've ever had in London!! Place has a very cool vibe, very hipster joint but the food was just stellar. In addition to the huger topped w pulled pork, HIGHLY recommend the bone marrow appetizer!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rS49-sqbnXzMWZ4Ah--dqQ"
  },
  "sD2_xg432QnSDve87qHxqw": {
    "date": "6/12/2015",
    "text": "The website, place and vibe are cool. But if you've tried bbq in the south of the US or e.g. NYC, the meat just is way below par...! Also the jalapeño cole slaw tasted very awkwardly of sesame. A pity.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CPyB0Waz_SVIBolf8sbujA"
  },
  "G06NXm52PfmYzVm61bNb4A": {
    "date": "10/8/2016",
    "text": "I'm giving this restaurant 1 star for one reason - music blasting from speakers surrounding the dining areas. The loud music drowns out all attempt at conversation. We were 3 for dinner (with a reservation) and seated in a corner, directly under a speaker.  We had to shout to be heard. We asked a couple of waiters if they could turn the volume down.  One did and within a few minutes it was back up to the same level. We asked to move to another table when told by the waitstaff that they couldn't adjust the volume because their \"boss\" wants it that way.  The table we moved to wasn't much better since speakers were everywhere and everyone, including a large party of 15 middle-aged men next to us, were shouting.  Even my 26-year old daughter, who loves bars with loud music, hated it and thought this was unacceptable for a restaurant. What a shame since the food is tasty. The blasting music prevented us from relaxing, enjoying the food and making conversation.  My daughter lives in the neighborhood and will never return.  I'd like to point out that the diners in this restaurant were not young. A much younger crowd was downstairs, in the bar. So blast the music there, not upstairs.  Restaurants are noisy enough without managers (young ones, I presume) who decide that their customers should be to subjected to a noise level that rivals a club.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cCqu4CJ0CZ7JkOdjzH2BVw"
  },
  "-9rmv_ls22f6tfHDhx_vOQ": {
    "date": "2/24/2015",
    "text": "The best bbq I've had in the city so far. Seating is banquet style. Servers are hipsters to the core. Bar downstairs is a completely unexpected surprise. Go if you are looking for great food. Beef rib is amazing.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TOxvXx-3ks1HkExJFB-kEw"
  },
  "g_dK6IZPrMd-KELa1LqTHA": {
    "date": "1/27/2016",
    "text": "The ribs and mac n cheese are really tasty.  I would say it is quite pricey but what isn't nowadays.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wsLgrPCxuolg-PQU5n_hlg"
  },
  "fC-gJ5Ugrt9kZG-0H7VB4g": {
    "date": "7/12/2015",
    "text": "The food was so tasty, I'm drooling just thinking about it! I went with workmates and we all ended up getting different things from the menu, including sides. Safe to say, everyone was completely satisfied. The meat is very tender, flavoursome and hardly fatty. We also got the deep fried oreos for desert, which seems odd at first, but they were surprisingly good. I also recommend the cocktails. The bartender knows his stuff! My only gripe was that the tables were quite tight. But I will definitely be visiting again!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y26R1AivW1_6M9JYrhRBEw"
  },
  "vBz9oev0GDTwQZNsHqKCdA": {
    "date": "1/17/2016",
    "text": "Went for Sunday brunch last weekend , and, full disclosure, did not order the bottomless drinks, although we did sit near the bar and saw some solid looking cocktails come out. I ordered hash plate, and my wife ordered the avocado toast. Both orders were reallllly good. Mine had lots of different meats, spices, and potatoes. My only complaint was that the potatoes were too large and not fried enough. The wife's avocado toast was flavored well and on sourdough bread. Our friend ordered the pancakes which also looked good. For our two dishes, the total was £14. Not a bad deal for a sit down brunch with such high quality food.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Gb78aM_aRxU8LUYb-gnTMA"
  },
  "4gh63gvOpEZ0JKvc2_6HCg": {
    "date": "10/11/2017",
    "text": "This was our best meal in London - darn good BBQ, too! We have had plenty of BBQ all over the USA but this one was right up there! Their food presentation was also excellent! Prices were pretty reasonable- especially for the quality of the food.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKT5ebQx1BcDAvJM-SYy5g"
  },
  "iHu53_IrG5f_JJUlzQCXMg": {
    "date": "6/18/2016",
    "text": "Not impressed, at least with the pork ribs.I've been on a barbecue kick lately, as it fits in perfectly in my LCHF diet, hits the \"taste of home\" craving, and is generally delicious.  So I've been working my way through the slew of BBQ joints around Shoreditch, and I stopped by Hotbox last night to get takeaway after a good rock climbing session.First off, there's a vestibule before entering the main restaurant space with two guys.  The first guy (a bouncer, I guess?) asks me if I have a booking.  No, I just want takeaway, please.  He directs me to the second guy, seated up a few steps at a little table.  \"Yes?\"  Can I get some takeaway?  Hang on, he'll have to ask if they're doing takeaway, as they're very busy.  OK, fine.  Goes through a door, asks a woman standing there.  Yes, takeaway is okay, what do I want?  Uh, I have no idea, can I see a menu?  Woman sighs, \"OK, but not everything is available.\" Not sure how I would have known that.  She retrieves a menu and rattles off a bunch of stuff that they will deign to give me in a bag to take home.  I order the pork ribs and corn.  It's the same price as a full sampler at another place up the street that I know is very good.  Hmm.I got my food home and dug in, and immediately noticed that the \"dry rub\" ribs were coated in sticky BBQ sauce.  \"Duh?\" I hear you saying, but I picked them partially because it said dry rub, which is more compatible with my diet.  Whatever, I can deal with some sauce.The next thing I noticed was that there was a ton of fat on the ribs.  The obvious ideal for BBQ is \"low and slow,\" which should render most of the fat away and let the rest meld with the meat.  Not so in this rack - there was a big globby layer of fat between strips of meat, so much that I had to grab a knife and excise it.  Read that again - I needed a knife to eat my ribs.  This is not a good sign.Finally, the flavor and texture just weren't very good.  There was a hint of smoke on the edges, but it didn't reach far into the meat, and overall the rib meat was fairly chewy rather than tender.  I don't need my ribs to completely fall apart, but these seemed like 2-hour ribs, not 16-hour.  On the other hand, the elote-style corn was very good, well grilled with tangy and flavorful sauce and an extra lime on the side.  No complaints there except for maybe the £4 price tag.All in all, maybe I was spoiled by going to a BBQ festival in the States a few weeks ago and eating the real thing, but this just didn't live up to my expectations or the not-cheap price tag.  I'll be going back to some of the others on my list, but not Hotbox.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pqzn0IbsW8EGlAAk3lmk1A"
  },
  "HWzsKjEQV0LxVX1y2RHxtg": {
    "date": "9/7/2016",
    "text": "I found the bbq chicken too expensive for what it was. It was decent, but a little bit dry.On the other hand, the green salad was great.My co-worker had the burger and he said it was good.And two of my co-workers had the ribs, and had opposite judgements about them. That's all.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhBc_39bdMKJ2YNwkl9Rzw"
  },
  "DeAwKp4XpfOIfVQQQ8lFrg": {
    "date": "7/16/2015",
    "text": "I think I may have had the best ribs ever here. With the scotch bonnet glaze, I was really worried they would be ruined by being too spicy. Fortunately these fears were unfounded. The glaze had a fruity sweetness to it and a bit of kick in the end. I love it. Pulled pork, I've now discovered, isn't really my cup of tea. I did however really enjoy the sweet potato fries. I'm normally not much of a sweet potato eater but my god these were good. I really want to try out their brunch menu, however since I'm here for work I don't think I'll be able to since I'm working when they do brunch.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Zma5kNEj5r_0Bh3dNHVL4w",
        "caption": "Photo of HotBox - London, United Kingdom. Mixed smoked meats",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Zma5kNEj5r_0Bh3dNHVL4w/o.jpg"
      },
      {
        "img_id": "f9OmX6HYu6P7nhqrwGM0Kw",
        "caption": "Photo of HotBox - London, United Kingdom. Beef rib",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f9OmX6HYu6P7nhqrwGM0Kw/o.jpg"
      }
    ],
    "user_id": "5qTrcegdgGFSni5x9A-slQ"
  },
  "UdUOafRWySE7Tyuh4xSmSQ": {
    "date": "12/9/2014",
    "text": "Yay a new restaurant in Shoreditch! This place just opened and it will surely be a welcome addition to the local rotation. The communal wooden picnic tables give the place a nice relaxed ambiance, though they're a slightly uncomfortable seating option.Service was great, friendly and attentive, but they're clearly working the bugs out: the servers were running around refilling the tables' teeeenie tiny water glasses. With hot BBQ and really good pickles, probably a good idea to leave a pitcher or get bigger water glasses... but I'll cut them some slack.Food was solid, 3.5-4 stars. Really good baby back ribs, delicious pickles, and sweet potato fries.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1s_rru1pyxFQXN8LXdM94w",
        "caption": "Photo of HotBox - London, United Kingdom. Liquid brunch for 25 GBP",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1s_rru1pyxFQXN8LXdM94w/o.jpg"
      }
    ],
    "user_id": "tVzRazhbqEw-QXYOAINgJg"
  },
  "FPohCXk9j3tHnAP_ytsKRQ": {
    "date": "6/18/2016",
    "text": "I first came upon the HotBox brand at various Street Feast events in 2014. Superbly BBQ'd meats with a great selection of pickled relishes to garnish. A real treat.I was excited to hear that in 2015, they were opening a restaurant on commercial street in Shoreditch. My friends and I visited as soon as we could and we were not disappointed.Super cool exterior, minimal signage, hard to find. A real underground, exclusive vibe. Waiting times were minimal but you always had to wait for a table. The underground street food scene was buzzing with the arrival of this place and it's patrons were flocking.Waiting was and is still no issue. The uber cool underground (literally) bar Forty Six & Mercy serving terrific beers, wines and cocktails. Relaxing, chilled vibe and a pleasure to wait a small time for a table to become available.The restaurant is, as many are, social seating but there is still plenty of room (and there needs to be). Portions and indeed dishes are very generous. Platters of meat of all varieties, chicken, pulled pork, ribs, burgers, all superbly complimented with terrific sweet potato fries and slaw.My recommendation then, as it still is, is to mix and match your dishes. Don't go too crazy with your \"main\" meat. Go small and add from the extras. My dish of choice, the pork ribs with a link sausage or pulled pork on the side. The slaw is a must. Heavily salted meats need to be accompanied by something to refresh and relieve the palette.First impressions were that this place was awesome. Terrific vibes, perfect food, achingly cool to the smallest detail (the bill would be presented with a small clothes peg). However......This was 2015 and we came and came and came back again. The experience never changed. Great food, cool clothes pegs bills, good portions etc etc but that's the reason I'd give this place 3 stars. It simply hasn't changed.The underground foodie scene has moved on and the city boy, tourist money has moved in.The menu is almost identical now as it was then. There is seemingly nothing fresh happening with this brand. Why change a winning formula I guess but other places mix things up from time to time and to be honest it will be to these other places I go until HB do something new.In a nutshell, go to HotBox. Enjoy a great dinner in a super cool restaurant. Then, move on and find the newest hot restaurant on the block.....",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0ouUFuqL60D77zF-Ej-rQ"
  },
  "XUJ1I8k9YectDoQ348hfgw": {
    "date": "11/27/2015",
    "text": "Having pored over all these other reviews for this place, I decided that ribs would be a good option to go for.There is currently a new menu so you can't go all in with the smoked selection anymore. They have pork ribs (4 fat pieces at £16) or beef ribs (3 pieces for £22) both of which are excellent, with just a little devilish fat stuck onto it to make the pork ribs juicy, and a very soft and tender beef rib which sort of melts in your mouth. Tap water came without prompt. I didn't like the chicken wings they felt a bit too salty. Sweet potato fries were yummy and not too greasy.The place is very chic and would be a good place for a date! Coat hangers abound all over the place (woohoo!), toilets are downstairs after you walk past a really pretty looking bar and bar seating area with comfy sofas and everything! There is even a DJ deck space in the corner!Service was slightly weird. The waitress came at the correct times to ask whether we needed help, if the food was good, or alternatively giving us a few minutes to decide on what to eat, but her face told a different story. It just looked like she didn't want to be there rather than the smiley happy waitress we would all love to have!All in all, it's a good place to eat ribs, but the price is slightly eye watering for a few ribs. (Take note though you will end up super full!)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "qhJEA-T_q-0qp-0v0_81Ew"
  },
  "I9GYVu_TfzeMEq1Uf2KAXQ": {
    "date": "5/14/2015",
    "text": "I ordered the Beef Short ribs and mac and cheese. Holy moly. That's one delicious piece of rib. Super tender and full of flavour. But surprisingly, for someone who gives up on a burrito half way through - I was super hungry after my 20oz rib. I'm suspicious that it wasn't actually 20oz or maybe I was just really hungry that night. Should have ordered the Smoke Selection and another side. Still - really good food. Reminded me of the BBQ I've had in the States. Will be back for sure.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VD0jfC6UZqg2VN1ocaB5kw"
  },
  "LwVcNac1KRpLFG48zj8tpA": {
    "date": "10/13/2015",
    "text": "Hotbox is a casual restaurant serving BBQ smoked meat. The menu is not massive but if you find you can't choose which meat to order, then consider the smoked selection consisting beef short ribs, pork ribs, chicken thigh, hot link sausage and pulled pork.Overall each meat was nice but the ribs had to be the best. The pulled pork doesn't compare to other places in London.None of the smoked comes with sides and only served with some house pickles. My favourite would had to be the sweet potato fries.It was not cheap to dine at Hotbox after adding sides with the smoked meat and drinks.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gQJp6mwCMRCBLXDsF_cGAQ"
  },
  "QLKgYiXG_VHdgSd7knxpCA": {
    "date": "6/28/2015",
    "text": "I haven't been to this location yet but I did get to try the Smokey Bandit sliders at Burger Fest 2015, and wow was I impressed! I loved the combo of burger patty and delicious tender short rib, and the fresh green chimichurri sauce complimented the meat perfectly. I can't wait to try Hot Boxes burgers in full size, and I've heard the ribs are amazing too!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1vJE20-l24c37th32zU4nw",
        "caption": "Photo of HotBox - London, United Kingdom. Smokey Bandit sliders!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1vJE20-l24c37th32zU4nw/o.jpg"
      }
    ],
    "user_id": "BpHoMr3yBlv-bhB-_dZarA"
  },
  "DhpfabYvsFHyVKcr0E4Ctg": {
    "date": "1/5/2015",
    "text": "Hands down the best bbq I've had in London - which to be honest isn't saying much - so let's just say some of the best bbq i've had. ever. full stop. We popped in on a Saturday night and were seated straight away. The service is super friendly, young and attentive.  If you want to get yourself in the mood - check out Hotbox's twitter feed before going in and you may see the cuts they are posting from the day.  I went with 3 other people. we all had a couple cocktails to start (experimental, delicious cocktails) - The meat was phenomenal, smoked perfectly and tender all the way through. I had the chipotle beef rib tacos and cannot rave enough. Don't forget sides - the mac and cheese is out of the world. Ham Hock Pinto beans also a winning side.And to finish. Deep friend oreos. I kid you not. I completely American-style overstuffed myself and groaned the whole way home. But one thing is for sure, I'll be going back!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "zwVYz5sXfeaxdbRr7nXb7g"
  },
  "GFeGJXO4cT6AEfPgWFhjdQ": {
    "date": "10/18/2015",
    "text": "Came in for brunch - hash with fried egg was good as was the pork patty burger.Service was friendly and quick. Not a fan of sharing tables but will return for the evening menu, which I think will hit the spot.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-mgSf7nyMgE25k3m6DV_Q"
  },
  "1FOhbe3gjayxHklj-_SvzA": {
    "date": "4/27/2015",
    "text": "HotBox's unlimited boozy brunch is absolutely fantastic.  I was incredibly blown away at how wonderful the food and the staff are at this place.My boyfriend and I planned a massive brunch to catch up with all of our friends.  The six of us in total found Hotbox's boozy brunch and we were ecstatic to come and try it.  The menu is modestly priced and was absolutely divine.I ordered the chicken and waffles and was highly impressed by this dish.  The chicken was juicy and cooked to perfection on a crunchy and soft belgian waffle.  I highly recommend trying this dish.I also had shared the mexican corn dish with my friend.  I thought it was tasty and a yummy veggie treat after a heavy main.Most importantly, the unlimited booze deal is great!  You would think that the waiters and waitresses here would hold back on giving out alcohol, but if anything, it seemed like they promoted our alcoholic behaviour!  Drinks would be refilled and poured constantly for us and and our friends.  You can choose between various recipes of Bloody Mary's, Prosecco or Mimosas.  I ended up quite cheerful at the end of my experience.  I can't wait to overindulge again at Hotbox!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OepicbUeYRwxGWM_rp1JRw"
  },
  "gPCnKRZcG2jGB-Cw6LyAUQ": {
    "date": "1/20/2016",
    "text": "Death by meat in this incredible barbecue spot just off Brick Lane. For a second I thought I was back in Nashville, Tennessee. Their meat is tender, their mac and cheese cheesy as it should be and their cocktails are fun and zingy. Wash all that grease down with great craft... And walk it all off. You'll need to!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HBQ-PMxjmTw2rF6swl5i4A"
  },
  "ldJvmuRxGkURPikaj2btGg": {
    "date": "5/10/2015",
    "text": "I'm a carnivorous sort of person. Given that, HotBox could very well become my second home.My friend and I split the Smoked Selection, which included beef short rib, pork ribs, chicken thigh, sausage and pulled pork. Initially I was a bit disappointed as I had come for the pork ribs, but they were running low so they weren't offering them as a main by themselves. Two things made up for this though. Firstly, the waiter was very friendly and helpful and gave useful suggestions regarding what we should choose. Secondly, the selection meant I was able to try ALL the meats, which it turns out was a Good Thing. Particular standouts were the beef and the pulled pork, both of which were very moreish and divinely melty. The pork ribs were fine, though not actually the stars of the show. I also enjoyed the chicken, especially considering this is pretty much an afterthought for me in this kind of place.Very importantly, though, the ham hock pinto beans were RIDICULOUSLY good. I can't stress enough how revelatory they were. It's rare for sides to stand out, but in this case they almost stole the show. I would happily eat these on their own, maybe with some rice, for a fantastic meal. Also had the grilled elote (corn on the cob) - they were tasty as well.It's got a good vibe, great good, lovely staff and gets many thumbs up.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1IpZks_GTP79WPbO7OvPow"
  },
  "TONMykRK7kAldJhpyInwlA": {
    "date": "8/18/2016",
    "text": "Went here last night with a Nudge deal and had the Iberico rack of ribs, mac and cheese, sweet potato fries, and the IPA of the week.  The food is absolutely to die for.  The ribs were perfection.  Excellent seasoning, smoked to a T.  Then we hit up the bar downstairs for drinks.  The bartender was an absolute doll and there was a happy hour special of any spirit for 7 quid.  Safe to say we had a few drinks too many.  Will make this a monthly staple - cholesterol levels be damned.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "inNtY0lRginGSE6wOl_OBA"
  },
  "4aQ7HUjjCK6oNyiGYDOBGQ": {
    "date": "4/17/2016",
    "text": "Great food.  Little spicy so be prepared. Wait staff was very accommodating. Loved the ribs. Too much food   Should have shared.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6SbumyV0FnvMW89pPCEFnQ"
  },
  "k08_0GpuMiHwK541JnMQaA": {
    "date": "6/21/2015",
    "text": "Got the meat platter. Juicy tender and tasty. Some good fries too. Not much more to be said. They know their BBQ and I've been to a lot here in London so was impressed on this visit.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "GR28xeoGYAFL_xRI3lmk5A": {
    "date": "12/14/2014",
    "text": "I was meeting two other friends in this area and one of them suggested this new place. The decor was dark, mood lighting to full effect, the staff were very friendly and obviously had knowledge about the food and were passionate but I felt they were a bit on edge and felt a bit rushed to make a decision to order from the menu. In regards to the food I went for the meat selection, while presented perfectly the food was nothing special.. I mean, the meat tasted good, but it tasted like meat I've had in any grilled place on kingsland road, the price was reasonable for the area. I'd go back again but it didn't blow me away like i expected it to do.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQMZHPFE0WUsPz7flhymrA"
  },
  "8UCe6GEQ7FUC6FmldcVqfw": {
    "date": "10/24/2018",
    "text": "This was my second brunch since moving to London and it didn't disappoint. The pictures of this place did it justice. From the neon light sign and minimalist decor to the crunch of the chicken, everything was on point. A friend and I popped into hotbox for Sunday brunch. There weren't any tables available but they have high tables along the windows which are perfect for people watching while brunching. Who doesn't want a boozy brunch right? Unfortunately, the 'liquid brunch' here is 25 pounds just for unlimited mimosas or other brunch-y drinks. Typically, I've been to places that usually include food and drink in their bottomless brunch. If you're not going to drink more than two mimosas, it's not worth it. We ended up ordering two mimosas each (saved a few bucks) and \"waffle chicken\". For a bit of an appetizer, we got fried pork belly. My diet definitely went out the window on this day lol The chicken was golden and crunchy and the waffle was done just right. It was quite fluffy and thick ( we ordered extra syrup) just like a waffle should be.HotBox is definitely a winner! I'll be bringing people here as my go-to brunch when they're visiting London!Keep up with my food & travel adventures - instagram.com/briyoumetr…youmelunch.com",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "f4uczQtVRe9p-zBlGhEseQ"
  },
  "XdM0X3kkiM3HzOUF_6mANQ": {
    "date": "4/23/2018",
    "text": "In my opinion, this is the best bottomless brunch in London. I thought the food was good, although nothing to write home about. What made brunch great was the exceptional service. The servers were very attentive, and we were never left with an empty glass. They're pretty strict about the 2 hour limit so it's important to keep track of when your time starts. Overall, impressive brunch and can't wait to come back!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChpJXNhUFl4AK0huG2xb4A"
  },
  "lc3zuvvWUq4VCioMJK-C_w": {
    "date": "8/7/2017",
    "text": "You best be ready to sit on benches at this hipster restaurant because that's all there are.We went here in search of sticky toffee pudding, having seen in some article that it was one of the best in London. The pudding didn't taste of the tea or dates advertised in the menu, but it was quite good and served with a complementary (and complimentary!) scoop of vanilla. The flavor of the one we had a Poppies' might have been better.  But Poppies' was served with a half scoop of half melted ice cream, so it's sort of a draw.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Mu6wz7_d6OBgRqkl4_NaXw"
  },
  "U2UKvmKY9QTyOUZLzT_vLQ": {
    "date": "5/25/2016",
    "text": "Fun casual restaurant with good food and service at a reasonable price. The food was very tasty including the short rib which just fell off the bone and the iberico pork. Certainly would reccomend it.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ad9edww_zHzbMcf2m39CQQ",
        "caption": "Photo of HotBox - London, United Kingdom. Fall off the bone short rib",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ad9edww_zHzbMcf2m39CQQ/o.jpg"
      }
    ],
    "user_id": "f7QuSTleFEnUE-oEj1aLWQ"
  },
  "lk0aRFcWmr2z7WGP4CUtPQ": {
    "date": "11/29/2017",
    "text": "Nice ambience, very good food. Their pancakes are really good, as well as their burgers. Coffee was good too.  Definitely worth going back to.Warning, you should make a reservation beforehand.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FC9jExtPmQciAFUjbqvS2Q"
  },
  "tFHlOpPtWQVPyYO9H81Srw": {
    "date": "10/25/2015",
    "text": "Top quality food. I was between the smoked selection and the tacos, I'm so glad I went for the latter as they were incredible. The pulled pork side was pretty special, and the Mac n cheese was lush. Great looking place too with good service. Decent prices (for London). Good choices on drinks as well. Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "4YfhRMNfEWA_NBELeHSR7g",
        "caption": "Photo of HotBox - London, United Kingdom. Cool vibes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4YfhRMNfEWA_NBELeHSR7g/o.jpg"
      },
      {
        "img_id": "vHdmHbd9SDuBVjfS1174JQ",
        "caption": "Photo of HotBox - London, United Kingdom. Not had this since Maui. Yep.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vHdmHbd9SDuBVjfS1174JQ/o.jpg"
      },
      {
        "img_id": "bIIg6mpr2BamMWKmNggoCA",
        "caption": "Photo of HotBox - London, United Kingdom. Ems pulled pork burger and Mac n cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bIIg6mpr2BamMWKmNggoCA/o.jpg"
      }
    ],
    "user_id": "ZpMiutGgkr2VIb44Fmd4cQ"
  },
  "FRAj9ZUT1cVYAPOLjFnz1A": {
    "date": "3/13/2018",
    "text": "I found this place to be excellent! We had chicken wings, Mac and cheese, the meat sampler and the fried Oreos. The service was friendly and all the food was well received in our group of 6. Would return next time I am there.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IStCrjhVSpxW3AqxrlWc_Q"
  },
  "SgOQTocjdoAMC9ZH3BfQJg": {
    "date": "4/8/2015",
    "text": "So I've had hot box twice before going to their newish restaurant at pop ups in Dalston Yard & Battersea last year Both times it was amazing!Bbq done well and reasonably pricedBf and I were planning on going out for dinner in Shoreditch and had a few options but the deep fried Oreos swayed me!The food was good! Bf had the selection which looked amazing (I'd shared similar with him before at a pop up) and I had the beef tacos which were tasty!What let it down was 1) the price and 2) the hyped up Oreos They were really greasy and not all that tasty :( real shame!We also had to wait for ages for a tableI would have rated 3* however you just can't knock the meat they serve!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eiNYf0kdz921rXbjcfK9wg",
        "caption": "Photo of HotBox - London, United Kingdom. Inside the Oreo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eiNYf0kdz921rXbjcfK9wg/o.jpg"
      },
      {
        "img_id": "jIFu3DjvB_HfQRASmepSng",
        "caption": "Photo of HotBox - London, United Kingdom. Deep fried Oreos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jIFu3DjvB_HfQRASmepSng/o.jpg"
      },
      {
        "img_id": "kTJc9fjRmtMNr4ZGemVgog",
        "caption": "Photo of HotBox - London, United Kingdom. Beef tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kTJc9fjRmtMNr4ZGemVgog/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "dThLIb994yqbfpAPdzhTPg": {
    "date": "7/2/2017",
    "text": "Amazing meals and drinks! We had the egg truffle and the eggs Benedict with pork belly. The seasoning and food presentation were perfection! We were greeted and seated within 5 minutes .. vibe of the restaurant was great! Definitely a must if you're in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YcR-UK88x_xMyB60kMkDfg"
  },
  "bb5mX1mi0n6FMWO0P4KwTg": {
    "date": "10/6/2016",
    "text": "I joined a larger company of about 20 people at HotBox. It was delicious and the logistics worked well considering the challenges of such a large party. We ordered some starters to share, I tried the prawn, the chicken wings and the taco. It was all delicious, but beware that the prawn is surprisingly spicy. My favourite was the taco, a very well composed little course.For the main course I ordered the smokey bandit burger with a side of sweet potato fries. This was a very tasty and well made burger. My colleague from America sitting next to me had a bit of a challenge eating with his hands, this was clearly a course you are expected to eat with knife and fork. It was a loud environment, the music was kind of sharp and added to the problem, so that would be my one minus.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAcT_3HOivhVKLP0MNHPSQ"
  },
  "LQqsXRq8J9VdfNy7X5i5vQ": {
    "date": "6/7/2015",
    "text": "The ribs are good. Amazingly good. That's all I have to say. Go here and order ribs.Pity the prices are high - £16 for ribs!!! With no sides included. That's why my review is 4 stars instead of 5.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2fjgvviatKXfPyZYVaI3DA"
  },
  "7uIxSuFGAu7SdGXlIyN9ag": {
    "date": "5/25/2015",
    "text": "Came here for brunch  and couldn't find the place at first as there is no sign outside. The seats are wooden benches which gives a nice rustic feel but not very comfortable as the tables are quite low with high seating . We also tried the unlimited booze for £25. Mimosas were great and I liked that you could taste the orange pulp . I ordered the Eggs Benedict and my friends ordered the buttermilk pancakes with bacon and the egg truffle . Great tasting food and awesome music playlist ! Kudos to the dj! Will definitely come again !",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "lEOK4hQYTFl22bVN-RBrMQ",
        "caption": "Photo of HotBox - London, United Kingdom. Mimosas for all",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lEOK4hQYTFl22bVN-RBrMQ/o.jpg"
      },
      {
        "img_id": "tkaQrWfi4uSd-oDppcqmnQ",
        "caption": "Photo of HotBox - London, United Kingdom. Buttermilk pancakes w/ bacon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tkaQrWfi4uSd-oDppcqmnQ/o.jpg"
      },
      {
        "img_id": "hiXaltqLd0Hib9l6tyZLdQ",
        "caption": "Photo of HotBox - London, United Kingdom. Egg Truffle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hiXaltqLd0Hib9l6tyZLdQ/o.jpg"
      }
    ],
    "user_id": "9_aZ6AFCEtFX5Uu2LZuwHg"
  },
  "Pn8hBQHfl7R7gly8JAgjPg": {
    "date": "4/24/2016",
    "text": "I am giving 5 stars based on my short rib selection. It was one of the most tender flavourful portions of beef I've had in London at this point. The outside of the beef was almost smoked to perfection and the inside was tender and juicy (cooked to medium rare). We also had the bone marrow as an appetiser which was very good as well. Overall, the atmosphere was fun but a bit loud. Beer selection was decent. Highly recommend for BBQ in London.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "qnshPwBUTcVTn-8eh74BmQ"
  },
  "f8ACwy7x6uK7MwrRpuZ67Q": {
    "date": "7/5/2016",
    "text": "This is hands down some of the best BBQ food I've had in the past year. I've tried to sample the goods in every city I've visited, and this stands up with the greats.I had the short ribs with some sides and my buddy had tacos. Tasty as!!! The drinks were particularly nice too - I remember being a bit merry :)The staff were super helpful too. If you manage to have Mark looking after you, you're in for some good service. It's definitely on my \"must-visit-again\" list. Thumbs Up!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EBbLNu385b88Q8QkwzyHWA"
  },
  "BeVJPxKegRuPGD-pBQnmSw": {
    "date": "9/13/2015",
    "text": "OMGWTFBBQ!I've been here a few times now and the food has always been excellent.  The first time I went for the smoked selection - ribs, pulled pork, a sausage and a chicken thigh.  The highlight was definitely the ribs, but the rest was great too.  On my second visit I opted the Smokey Bandit, a burger topped with more beef in the form of slow cooked short rib and some cheese.  This was also excellent.  I'm yet to try the beef rib, which looks huge, so will be next on my list.  They do a pretty good selection of beer as well.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IFFOuzMMLqvQIvPKURIP8A",
        "caption": "Photo of HotBox - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IFFOuzMMLqvQIvPKURIP8A/o.jpg"
      },
      {
        "img_id": "868Dl_yFxW-mi-J9v_btMw",
        "caption": "Photo of HotBox - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/868Dl_yFxW-mi-J9v_btMw/o.jpg"
      }
    ],
    "user_id": "jkD0eejAIYjqiAbWw8BzMA"
  },
  "yaZyBb61kccKbd3cFCkemg": {
    "date": "4/25/2015",
    "text": "Oh dear Lordy this place is good - great food, Cool vibe and top staff, serving the fate with a smile and a spot of random French!My beef taco was a delicate treat, hints of spice and Chipotle flavours working well with the tender beef, complimented by the kimchi on the side. Sides of greens and sweet potato fries were top notch. Good beer selection - Yakima Red makes me happy.My dear companion hit the pork roll which was far more bbq-y in contrast. Again the pork was tender and the bbq flavours were excellent, less of a delicate dish and more of a taste explosion!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VrA8n_SL335ycA-vXo1SWA",
        "caption": "Photo of HotBox - London, United Kingdom. Tacos and pork roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VrA8n_SL335ycA-vXo1SWA/o.jpg"
      }
    ],
    "user_id": "VE4DD-IK4qn8K73WL-iCQA"
  },
  "9lEbhw7JZI831Sh-UL6yZQ": {
    "date": "11/4/2016",
    "text": "Having just moved to the UK from America, I was a bit worried about whether the BBQ in London would be any good, but I needn't have been. We arrived on time for our reservation and was seated right away. The tables are picnic style tables with bench seats. We all started with a cocktail, there was just a small section of 4 on the menu but they were really good. To eat, I went for a selection of sides and had:- pulled pork - really good! Well cooked with a nice BBQ sauce- mac and cheese - another good dish and a reasonable size for a side- jalapeño slaw - good but it was dry, just vegetables. Some people also found there were too many spicy red peppers - sweet potato fries - a good sized portion for the tableThe price was reasonable and service attentive. We weren't rushed in any way and we stayed at the table for a couple of hours after for drinks. Would recommend!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uyAqdLyscWWJ0KSpyXt4eQ"
  },
  "pXpp0EDVcEOosrFyzLADVg": {
    "date": "5/18/2015",
    "text": "I want to write so much about this place. But that will waste both mine and your time.So I've created a nice list to help you decide.Reasons for: Amazing smoked meats, amazing marinades, amazing original hot sauce, amazing hot sauce that is slightly spicier than original hot sauce. Good staff, water constantly topped upReasons against: Oily tasting water? (To be fair after getting topped up the water tasted normal). You will be slightly disappointed with BBQ from other sources.So in summary GO TO HOTBOX.PS. I will be back to try the Brunch menu. K, Thx. Bye.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nuoqkbjCAfZasq7cGdUviQ",
        "caption": "Photo of HotBox - London, United Kingdom. Deep fried Oreo balls with ice cream",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nuoqkbjCAfZasq7cGdUviQ/o.jpg"
      },
      {
        "img_id": "VNS4vrM_hKBHpoVb1sAl2w",
        "caption": "Photo of HotBox - London, United Kingdom. Smoked selection",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VNS4vrM_hKBHpoVb1sAl2w/o.jpg"
      }
    ],
    "user_id": "juc9DPG-RMJC1Y6xzWy5zg"
  },
  "csTNyWzVbeqTROGV1ZKAiQ": {
    "date": "4/25/2016",
    "text": "Location:  A bit odd.  It's right on Commercial Street and from Aldgate East tube station, there isn't much to see on that street.  It's pretty grime-y. But it's a quick walk from the stations, so not bad.  But what else can you expect for East London? Atmosphere:  Ok - overall.  It was a bit too dark in there for my liking (the bar downstairs actually seemed brighter) and the music was SO loud.  I was there in a group of 4 of us, and we felt like we had to yell to hear each other.  Decor is very simple. Drinks:  small drink menu, but they have a great 7 or 8 beers on tap.  I love that they had a Meantime Red on tap  - so yummy! And good prices.Food: Excellent.  As an American, my BBQ standards are high.  And their Beef Short Rib was some of the best meat we've ever had.  Their bbq sauce is also phenomenal - and super unique.  Their pulled pork had great flavour - but was a bit greasy.  And their hot link was supurb.  Mac & Cheese was a-ok - lacked a good cheesy flavour. Overall:  Pretty good.  I'd go back as you get a lot of food for your money.  I think it'd be a great place for a big group of people to have a good loud time.  Their dishes are really large too - so great for sharing.  My husband and I split:  the short ribs, side of pulled pork, side of hot link and side of mac&cheese and it was too much for the 2 of us!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "ZMEzuu4xBtz2xG44nVq0Aw": {
    "date": "2/2/2016",
    "text": "I am a vegetarian so this place specialising in BBQ and smoked meats does not seem like a great choice, however on weekends they cater for us veggies too with their brunch menu. Initailly i had reservations about trying Hotbox only because of the meat heavy menu but the swanky dark exterior made me think it was aimed at the city boy crowd, which is not really my scene but inside all that preconception was lifted with the rustic decor and super friendly staff. There were 12 of us sat along the long wooden table and though we all arrived at separate times food arrived all at once so that we could enjoy eating together.I had the Huevos Rancheros which is one of my absolute favourite breakfasts and this one did not disappoint with a rich spicy tomato base, runny fried eggs, creamy guacamole and densely delicious masa taco on the side. The portion was so generous I couldn't actually finish my bubbling cast iron bowl, but as always my friends were there to lend a hand.Most of the dishes were served on plain plates, or wooden boards tying together perfectly the simple yet stylish industrial feel.This place is well thought out serving up quality food I only wish I wasn't limited to visiting at weekends.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "odu5O38ScNSd4ARp1SriZA"
  }
}