{
  "8qVxc79UVJynT2Q6O1QxmQ": {
    "date": "11/19/2008",
    "text": "Ok, i THINK i found the one with the correct spelling, but it doesn't matter if your after beigels, bagels, or biegles Basically if you're in the brick lane area there's only one place to eatactually there are two, next door to each other, but both of them are beigel based. This one is the one slightly nearer the bottom end of the street. Whilst the actual beigels themselves are a bit better in the other one, the fillings are much more generous than they are in the one next door, although if it's salt beef you're after, next door is the place as the salt beef in here is a scary looking grey colour. The cakes in here aren't generally as good as next door, but the chocolate log is simply amazing - the gooiest heaviest cake of all time! Finally, the other one tends to feel a bit more rock and roll late at night, possibly because all the cops tend to come in here instead (it's wider). This is the bake for me, if only for the more generous servings and friendlier staff.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "rYuuZDNnQuST1voWhMeS_Q": {
    "date": "3/7/2012",
    "text": "This place is so good. Opens late, good for after nights out. They put the cream cheese on really thick; they don't scrimp! I had cream cheese and salmon, and it tasted amazing. They do different combinations of fillings, too. A big plus are its cakes and pastries. I had a red velvet cupcake and it was nice and rich, and had lots of icing. yum. Definitely coming back again, and good for broke students like me.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h7VbK5XXJFH_VH_V2P5HWA"
  },
  "rI58epFUb1e045kQfvf_vQ": {
    "date": "10/21/2009",
    "text": "After having a wild night out with bounce of my mates around brick lane, we went to beigel shop right after, it was really nice to have a warm beigel at night somehow, the salted beef taste superb... I like this place more than the one in Selfriages.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "W9l-TyksY-1DVTMc8rm82w": {
    "date": "11/10/2008",
    "text": "I have to admit I'm not much of a bagel fan... or at least I wasn't.  After working a Saturday job at the top of Brick Lane, the Beigel Bakery was my regular stop for lunch.  I usually opt for salmon & cream cheese and perhaps an apple turnover for desert.   Not the best I've ever had, by any stretch of the imagination, but not bad, and extra points for being open 24/7.It's rare to go in when there's no queue, so they must be doing something right!  The staff aren't particularly friendly, probably bored of indecisive customers trying to decide which bagel to have.. .",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2aNLypxAxXuj_PQTfjdT8g"
  },
  "4P7dieE4QYgiHUDOPVZx6A": {
    "date": "11/10/2008",
    "text": "Somehow the 24 hour bagel shop on Brick Lane has become legendary. There are an impressive number of crates filled with bagels behind the counter but what it offers is nothing more than it claims, bagels 24 hours a day. There is no aesthetic appeal, you simply walk in transfer money for bagel very swiftly and you are back outside the shop within a minute. For a mid shopping snack or a late night after party pick up, with prices starting at well under a pound, what more do you really need.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JY9GzXCZn4OVMqg07Wql2g"
  },
  "L-f53-wx1TJhUanamORooA": {
    "date": "11/10/2008",
    "text": "I live close by this place and every time I am on my way to home, I really have to work with my self not to stop. Well at least not every time. And still I pop in almost every time. The bagels are just too tempting that I loose all my self discipline.I have to admit that the first time I tried these bagels, after all the hype, I was disappointed. They are nothing like their American relatives, and not stuffed with all sort of creamy fillings. In stead these are pretty plain and simple ones, but as I noticed later, also very addictive. The place it self is very scruffy and you can't really praise the customer service, and it is just take a way. The best plus side is the price. Cheap!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FfEv9dd3pf3Diog86rus7A"
  },
  "XckGOFc4LSKTIDwYs8gNnQ": {
    "date": "1/21/2008",
    "text": "just next to beigel bake lays this lovely beigel store. the salted beef is not as good as the infamous one from the beigel bake. but everything else is way better, and the staff is much more friendly. the beigels can't yield all the filling the lasses cram in it and you may have trouble trying to stuff it in your mouth, if that is any problem for a starving lagered up brick lane-goer.they have a sound variety and the prices are reasonably set.appart from beigels, they do soups, teas, samosas, spring rolls and a thousand of cakes. another option is buy plain beigels for the incredibly price of 18p and try your experiments at home. but it does never taste as if bought there. whyyyyyy?it opens 24 hours and is just a must if you turn up to brick lane, where you may find all type of characters lining up. a place for everyone...very justified sucess",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "naky-dw6y6S04AhIBKlJkQ": {
    "date": "4/18/2010",
    "text": "Moving from NYC to London for two years, it was important to find a decent substitute for H&H and Tal's. Here it is. Open all night for that bagel craving after the movies at Rich-Mix. UK1.80 for a bagel, a smear and smoked salmon. UK3.00 for a bagel with corned beef or in the local vernacular smoked meat. Worth the trip to either this storefront or their competitor two doors up Brick Lane.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L1udvYenz63qk0WbAB8DFA"
  },
  "VU6ehHbd6GIU20yDPvL-YA": {
    "date": "11/16/2008",
    "text": "I find it very difficult to choose between 'white sign' or 'yellow sign' beigel shops. They both have their charm (or lack of it) and masses of choice. So seeing as i'm not weilding a huge King Soloman sword i'll call it a draw but with the proviso that 'yellow sign' this one, does the best cream cheese and egg beigel, not together! Whilst 'white sign' wins with hot salt beef and onion beigel. Yum-tastic!!!",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "j4C9zdgJjLuraqLnWont0g": {
    "date": "11/20/2008",
    "text": "I love this place (and i think my other half may just love it more than he loves me!!). Whenever I happen to be on brick lane, I try to make the effort to buy a hot salt beef n mustard bagel from here .they are totally gorgeous! The prices are pretty reasonable, I think the last time I went there it was around £2.50 for one.",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7JuRxrvkYoutQs-6Woc2Ng": {
    "date": "8/19/2009",
    "text": "this place helped me gain 5 lbs while living in london for 2 months.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fo8YcQMawFdZt4sslERq5A"
  },
  "eL3t-EFFB01V4fV6hJczqw": {
    "date": "2/18/2010",
    "text": "Britains First & Best Beigel Shop Est 1885 (as it say on the sign) is an excellent 24 hour bagel bakery. I usually go there in the middle of the night for smoked salmon and cream cheese bagels. Always fresh and very cheap. Good variety of other kinds of food too. There is also another 24hr bagel bakery a few doors down called Beigel Bake (qype.co.uk/place/46809-B…) .",
    "rating": 5.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "KSL2ttSgL0DnJZhnSI_ntQ": {
    "date": "1/18/2014",
    "text": "TOP STREET FOOD PICK IN EAST LONDON! But only if you but the salt beef bagel. The cheesecakes and other confectionary are a honeytrap - the entice you in with their pristine appearance, only to feel slightly wronged after the act is done. Go for the salt beef and you will be hooked.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hD15GhDY6GN7GUEUzJKtIg"
  },
  "B9dtDH7msq3OqqpQ58MNWw": {
    "date": "6/10/2011",
    "text": "I was on the more sober side of drunk when we decided to get the famous late night salted beef filled weirdly spelled bagel sandwich. And from what I can remember it was tasty. Anything with pickles at this point in my lessening stages of homesickness makes everything taste better. London you do not incorporate pickles in enough things. Get on that okay? okay. I think this was the rowdiest, dirtiest, yuckiest street I have encountered so far in my times here. Made for interesting viewing while waiting for my friend to order us the tasties.I would like to come back here and try to really taste just the bagel itself because the meat mustard pickle flavors were distracting me from my bagel experience.Overall decent place to go when you need something quick and fatty and yum to soak up some alcohol in your system at 2 o'clock in the morning in East London.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSVTAoYbpjQiP4OTUnp2vQ"
  },
  "725o4HQozjhgCvA1iNBEsQ": {
    "date": "7/25/2013",
    "text": "The salt beef bagel. Delicious and cheap. One of the perfect eats on Brick Lane. There is not much to say about the shop itself or even the service, it is pretty mediocre. I had read great reviews on here and had been meaning to try it for months. The salt beef bagel is awesome and good value for your money as the sandwich is packed with beef. The only downside is the pickles. Weirdest tasting pickles I've ever tried, which was a disappointment to me. Without the pickles, its a fantastic eat. You must give this one a try.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HEOkH2CXCEg00NggPwB-ZA"
  },
  "c1VGe3Qn_Lpq4jF94VfWCw": {
    "date": "2/22/2010",
    "text": "THIS PLACE IS DANGEROUS! Must avoid at all times! Why?It is best value for moneyFillings are superbSelection of yummy cakesBEST VALUE FOR MONEYSO SPOILT FOR CHOICE!I was there the other week and the thought of a salmon and cheese bagel is making my mouth water!Next time I go there and order my 2 x salmon & cheese bagels, chocolate eclair, samosa and tea.... I hope all the weight I gain will go straight to the \"certain areas\" that needs filling (can I get a Jennifer Lopez and Shakira to go please?).",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "sgnQLQ7dePY3iF_BPyMfNQ"
  },
  "5mxwlhxSJ8ZY3z6CCjoDxA": {
    "date": "6/27/2010",
    "text": "I live across the road from this Bagel store (yellow) and its competitor (white).Lifetime consumption of bagels from both stores +100.Which one is better? By far, this one -- with the yellow sign. The bagel bread is superior and generally fresher. The white store's bagels are too sweet.Plus, this place has a greater option of fillings. The salmon in the popular salmon+creamcheese is fresher here than white.Ask for bagels fresh out of the oven and still warm -- its worth paying twice for these, much yummier.As for the rest of the stuff -- cakes, pies etc -- best not to touch. They look tempting and are cheap, but generally not so nice.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HlFmrT2pMGUaKR_D3AEpIQ"
  },
  "oi23rIZRDDeFIwzT1re2qA": {
    "date": "4/6/2013",
    "text": "Very awesome little shop in East London. A super ghetto hole in the wall that has a line out the door. They make delicious bagel sandwiches. Price is really low and you get large portions. There isn't any seating so you need to walk the street while trying to enjoy this masterpiece bagel.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqNQAWIdlZZcYfVmgdapAg"
  },
  "NgnivY-8cTkt_dORwNSJUg": {
    "date": "3/21/2011",
    "text": "As a very local resident to both shops I have to say that lately I have been frequenting this shop more than the other for a few reasons. 1. They make Beigels to order and it doesn't leave you second guessing as to how long something has been in the fridge. 2. They have more choice of fillings. 3. They are cheaper. 4. The staff smile more. Well these are the main reasons I can think of. If I want something cheap and filling I prefer to come here, especially if I want something like a cheese salad beigel. The smoked salmon and cream cheese, as well as the salt beef are really good from here too. But sometimes I find myself partial to a sausage beigel which I know is slightly sacrilege but sometimes it is just what is needed. As a non Jew I feel I can eat one with a slightly clearer conscience. Regardless of what you put in your beigel, there is a bigger choice and you will find something that will work and not go against your cultural heritage. I haven't eaten many of their cakes but that is because I am quite fussy when it comes to cakes and pastries. Ultra cheap cake and pastry tend to not be of the best quality from what I have experienced. Also of late I have been trying to learn how to bake for myself so I only try and buy what I couldn't do at home.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "MvOGaxn5xduwO2gy0wYpvw": {
    "date": "11/5/2009",
    "text": "In the interests of science and lunch a friend and I went here about half an hour ago, ate a salt beef beigel / bagel / beagle and then went straight into Beigel Bake a couple of doors down and had another salt beef beigel / beigelle / baggle.  The results of my findings:I just put on 2lbs, my friend looked like an eel that had swallowed a football.Food:-Beigel Shop: £2.90 a generous portion of tasty salt beef, the beigel was ever so slightly sweet and ever so slightly over cooked, almost crunchy, the mustard pleasant but not nose tingly.Beigel Bake: £3.30 at least twice as much salt beef, so much so that the beigel itself was open at about 60 degrees.  The beef itself was slightly saltier and slightly beefier.  The beigel was cooked perfectly and not as sweet., which I prefer.  The mustard was more generously applied and had that lemon juice up the nose feel that I love.Ambience:-None in either place.  Shop looks slightly more like a commercial bakery, Bake looks slightly more like a retail place.Conclusion:  If you can stretch the extra 40p, I'd go Beigel Bake (the place with the white sign two doors along ).",
    "rating": 3.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "yN9lcO61Xdzyhsh0Qx7IPg"
  },
  "luZJU_qbIeTX-7vKM7gh1Q": {
    "date": "11/4/2008",
    "text": "Well I've got to give this shop five stars (whereas the other one would amass 4.5) based on the fact that their cream cheese and smoked salmon beigel is absolutely scoff-tastic and I have calculated the precise time it takes me to swallow one whole (8.2 seconds) but I challenge any big mouth to beat that. You can choose from from both plain and filled (egg, cream cheese, herring, mountains of salt beef), with a selection of tasty traditional breads cooked on the premises and magnificently moreish cakes (gimme that muffin) that soak up impending hangovers and put the blinkers on come downs for Shoreditch's jilted generation. These Jewish beigels are smaller than their tasteless, pre-packaged sisters in fridge freezers nationwide, having a rich brown on the top and with a slightly sweet cream coloured dough inside that is more chewy than Kingsmill. Verdict --- there is no better place to invest small change and crumpled notes anywhere in E1. Oy vey. Quick history lesson to follow: In the late 19th century, the streets around Brick Lane were dramatically transformed by an influx of Jewish immigrants from Eastern Europe. New synagogues, kosher butchers and restaurants opened, and a rich Yiddish culture emerged, with its own newspapers and theatres.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "j3CIIgmycPMRCW2xmjxrvQ",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j3CIIgmycPMRCW2xmjxrvQ/o.jpg"
      }
    ],
    "user_id": null
  },
  "iNbEA9-IufTf3xJ9DR0RJg": {
    "date": "3/17/2012",
    "text": "I think I was a Jewish New Yorker in another life. I'm obsessed with bagels and needless to say I felt the necessity to eat here when I found myself hungry on Brick Lane yesterday.For what I had and the price I paid, it was excellent. I had a bagel (beigel?!) with cream cheese and chives. Not huge, but for £1.30 was a good price for something that wasn't a Tesco sarnie (I eat way too many of those, being a poor, busy student). I can't comment on their other fillings, as nothing else is vegetarian except the egg salad and the variety of add-ons, which I should've had. I could have done with some pickles. But that's another story. If you're a veg looking for something not-so-creative, simple and delicious, this is a good place, but if you want something that could rival a meat-eater's bagel, avoid. You're better off finding somewhere more vegetarian-friendly. However, I would go back. Their baked goods looked delicious and it was a good bagel. :)",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "aCAts_CcDx0bpPNSsnDs7A"
  },
  "b8QJl2jyPH8x0QV-9LymKw": {
    "date": "12/23/2007",
    "text": "There are two Beigel shop in the same street and really closed of each other but I prefer this one.They've got a lot of different food to put in their beigels. If your combination sounds strange like prawns and cheese they will make it. (this doesn't mean that I chose this one) Tuna is a must but for me the simply cheese and if you are lucky with a hot beigel Yummy! Nothing can be compared to it. If you don't want beigels, no worries there are also croissants, soups, cakes and some other pastries. If you are having fun in Brick Lane area and the party seems to finish late, you can have beigels for breakfast or dinner as it opens till late.",
    "rating": 5.0,
    "rated": {},
    "photos": [
      {
        "img_id": "_3zV3yaWqPpmE-D-L6lmhw",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_3zV3yaWqPpmE-D-L6lmhw/o.jpg"
      }
    ],
    "user_id": null
  },
  "UF9e3etZkLPkIGHvoTjyBQ": {
    "date": "1/9/2012",
    "text": "best bagel shop ever!! the bagels are fresh and delicious. i would get either a salmon & cream cheese bagel or a hot salt beef bagel. the lines can be long (especially on the weekends) but it's worth the wait. when my family comes to London, i am definitely taking them here.make sure you go to this place, with the yellow sign, and not the one right next door with the white sign - they are not as good.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2h8wdBgud2n8hQbV0zN-XQ"
  },
  "yWvUYAsJU9RMIIw-GYgXtA": {
    "date": "6/15/2009",
    "text": "I am craving for a chicken/coleslaw bagel right now. Or maybe salmon cream cheese. Or maybe just a raspberry muffin. Oh, and a chocolate brownie. BECAUSE THEY SELL ALL OF THEM AND THEN SOME!So damn cheap (1-2+ quid for a bagel with filling, 50-90p for dessert stuff), a good selection of fillings and random nibbles (samosas, pies.. although i wouldnt go for those). I've come here plenty of times for an afternoon snack, drunken gorge session, or for a small lunch. The fact that is open 24/7... thats my 5th star right there.Go to its sister store Beigel Bake for the salt beef sandwiches -- they're much better there. And now I'm going to write a review for that.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "jWogrkf0PMfP9UoiXULKuw"
  },
  "5wfsilKL07LPkDRwuKWb4A": {
    "date": "5/12/2010",
    "text": "This place is pretty awesome.Its super cheap and you can satisfy your belly with some A#1 class grease.I wouldn't travel for it, but if you're in the neighborhood check it out.  If you live nearby you already know about it...",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMRJaNrtR4g2C7ZzJsrFOw"
  },
  "QA4oC6z-SDQ1hGEqa76KmQ": {
    "date": "1/2/2009",
    "text": "The BEST bagels in London. Hands down.Need I say more??",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-WzurMIIijS0QN9PdXKJ3g"
  },
  "SR19VIS0bKNxss-kMvyDJw": {
    "date": "6/19/2009",
    "text": "For filled bagels / beigels, this is probably the best bet on Brick Lane. The ideal combo, of course, would be the bagels from the white shop with the yellow fillings but you can't have everything. Personally I'd say the white salt beef is the best, but for sheer variety - and the beer absorbing joys of a turkey, cheese and crispy bacon bagel - this is the better stop for late night snackery. On busy Fridays, you can often find me queuing here for a takeaway before joining the line at the other one for the plain ones to take home.",
    "rating": 4.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "AN-h9lxeS0Fi82jxjYLCzA": {
    "date": "5/20/2009",
    "text": "What I love most about the Beigel Shop is that it's opening hours are 24hours. You can go there anytime and have some nice food. I really love their bagels, but also their other food is nice! If you're coming from a party nearby just stop by - there are always some people in the early morning, so you won't jsut have a nice bagel and coffee but probably as well some nice communication with people from everywhere!",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "z5-JxFzJh7-htvbsVy9LHg": {
    "date": "12/12/2009",
    "text": "Despite being 3500 miles away from the epicenter of bagel action, a surprisingly good bagel experience. Plus, one of the cheapest things you can probably snack on in this city. My 6pm beigel purchase wasn't piping hot, just room temp, but was pleasantly chewy and filled with an appropriate amount of cream cheese & chives (not a two-inch thick slather as seems to be the American norm). Apparently you DO get a two-inch thick stack of salt beef when you order that on your bagel, which I didnt, but you can bet its on the agenda for my next visit.",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2DHkTqYVW1PpmusOrIB-YA"
  },
  "x2Ct2nrJXKKJccpq70mVlg": {
    "date": "11/11/2008",
    "text": "Its difficult for me to resolve my feelings about this place (and its bagel-dyslexic cousin two doors down - I can't tell them apart). The reason is that, without fail, almost every time I've taken advantage of their ridiculously cheap bagels, I've been 'one over the XIII'. Thats a little tipsy for those of you less versed in the doings of Asterix.So while the salt beef and salmon & cream cheese-filled bagels always hit the spot, my palate is usually too drunk to know what has hit it. I imagine that in a more sober state, I would criticise the general cheapness of the experience - the salmon sure ain't wild or organic, and the tea can taste like its brewed fom sawdust.But it's opened 24 hours, you get to watch the bagels being dipped in water and laid out on trays by the dozen as you queue, all the while knowing full-well you are participating in a Brick Lane ritual. Not much to ask for £1.20.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZXU5C5DdmLEnYvvoLv7hSA"
  },
  "1j0oZg-q__jswuC_TAFEDQ": {
    "date": "2/5/2010",
    "text": "A hang over from the days when the East End had a large Jewish community, The Beigel Shop is by far the better of the two bagel 24 hours bagel shops. Friendly staff, freshly made bagels (they're melt in the mouth amazing when just baked) and a giant selection of toppings. I love this place and have to stop myself drifting in each time I pass it out of sheer bagel lust.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "efqtPTzH75_Iig4qYUgkAA"
  },
  "tOVacBWakwUgHbHS88M3_Q": {
    "date": "9/12/2013",
    "text": "Salt beef competition winner in London according to our small Swedish taste panel! However by the smallest margin possible.If you into the classical old school mom and pop beigel stores and culture this is one of the main two contenders to visit in East London. It is cheap, tasty and with great opening hours. Chewy, richly filled and delish beigels to try and die for were, aside the salt beef, the plain cream cheese and the salmon according to us. But I also enjoyed the sweet bakes such as the chocolate éclair and brownie.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "3D_anpWE4Gp1z0Lt0TF6mQ"
  },
  "s4I7H0eI-dpC216tqcvvjQ": {
    "date": "9/9/2013",
    "text": "After hearing all about this little 24 hour bagel shop I thought it was time to try it out.  I had a salmon bagel and it was very reasonably priced.  I was slightly disappointed that there wasn't more choice in fillings, but it did taste good.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mw81aVQdsfiVXOq2Kgl8EQ"
  },
  "q59QoszbHxzVQMEjMttN8w": {
    "date": "7/5/2013",
    "text": "Allegedly the best salt beef bagel in Brick Lane (their competition being....one other shop just down the street).  It's cheap, no seating, i didn't even see any napkins, and it looks transported out of the 1950s.If you eat at American delis, this place won't astound you as it's very similar.  But my boyfriend has been talking for ages about the salt beef bagels so I had to try one.  Salt beef is corned beef, and the beef at the Beigel Shop is plentiful and has to be made in house, right?  It tastes excellent with the spicy mustard and chewy bagel.it's nothing you can't get at a Jewish deli in Amurrrica, but if you're thousands of miles away, go here for those familiar flavors.  Good luck finding napkins though, you will need them.  Great to have a bagel on the go while strolling down Brick Lane.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yaBIVHDxaUBN2YHQ8-YiuQ"
  },
  "XP4HmsN8t7nBoLcMRG2wIA": {
    "date": "12/30/2013",
    "text": "I had heard about this bagel shop from some friends and had been meaning to visit it for a while and Saturday provided the perfect opportunity before I checked out the street art around the area.Where do I even start? Definitely lived up to my expectations! People think that bagels are just bread shaped in a circle, but they should be so much more than that. These bagels were just that perfect amount of dougheyness. I had mine with cream cheese topped with smoked salmon. I would say that mine could have done with a bit more smoked salmon, but I saw my friends and hers was fully loaded. However, seeing as the bagel was only £1.60 I can't really complain. All I needed to complete this perfect meal was a Ribena...wait, that was also sorted!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixDTSuqPIwfeWfn25P_lMw"
  },
  "eH0DAYJflXRiUZrwA03S1A": {
    "date": "11/3/2015",
    "text": "Not your New York bagel, but the salted beef was incredible! My only bagel comparison is to a New York City bagel. It was smaller and more condensed. It was not as fluffy as a NYC bagel. It was also sweeter. The salted beef really made this bagel! It made me forget about my usual cream cheese bagel. The best part is that this bagel place is one of the few places open late in London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nfpfw1Ht1I8DdK9oZj-OnQ"
  },
  "ojiALRs0t5krCD8YUz-v_w": {
    "date": "1/19/2014",
    "text": "They are in pretty strict competition from the other place, but I've found they're both pretty good!chewy bagel + generous salt beef + spicy mustard = heaven! especially after a few pints! :-)",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLbwfdARYoLoybL_mUxEPA"
  },
  "6NMsuP_PiqfzIROuQb92-Q": {
    "date": "12/7/2012",
    "text": "Are you a student? Living life on the cheap? Hungry? Go to the Beigel shop and grab you're sell a nice bagel and i'll wait here... NO really, go ahead get a big bite then come back and read this...Got a bit right? SO GOOD HUH?This is one of the places my friends who went to LSE told me to come to for cheap eats. Brilliant! They are the smart ones and all they would know. It's an absolute crime and I think impossible to just get cream cheese on a plain bagel and just walk away. Or just ridiculous. You pick. All their combinations are delicious. and did I mention CHALLAH!!!!!!! *raising the roof*Tis the season, do it!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzvjtFHnrZZenTvjbShNkg"
  },
  "gahlLNpliWNElILc9X5H_Q": {
    "date": "8/19/2013",
    "text": "So, I went back to try the Salt Beef bagel here so I could compare it with the one at Beigel Bake and I have to conclude that Beigel Bake's is way better. Maybe they were having an off day but the meat at the Beigel Bake was just, better. Since you'll probably come back after the first taste, try both places and see what you think. From my taste test, I conclude Beigel Bake has the better Salt Beef bagel.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TvP_eoBVvaxULWPNihq-pg"
  },
  "gEolxbrkyQDGmnDdIoQOAQ": {
    "date": "1/11/2013",
    "text": "I temporarily forfeited my loyalties to Beigel Bake, my usual haunt for Jewish-oriented bread products, and was forced to go here by a friend. (My arm was pretty violently twisted, Beigel Bake, I'm no traitor.)The butter bagel I got here was soft, chewy, salty, and delicious to perfection, without a single topping. And....they have chocolate cake. With strawberries artfully placed on top. (Which we were very satisfied to eat at 4 in the morning, as a homeless man told us we should get married. This may be a testament to the powers of such bagels.) Though my allegiances haven't completely changed, I have begun the conversion process. Shit.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0KAjMIFLBBKEt-AYkoJckg"
  },
  "LNsP2pg9TVIyWQlgyMI9mQ": {
    "date": "1/10/2012",
    "text": "Totally legit challah.I can't help but think Beigel Bake is better, though. This is for no reason in particular, I assure you. With two nearly identical old-school bakeries selling nearly identical things within two shopfronts of each other, you've just gotta pick one or the other and pledge your unwavering custom to it.I picked Beigel Bake.For the record, I didn't buy the aforementioned challah, so my conscience is clear. Also, bacon goes surprisingly well between two buttered slices of this delicious, Jewish loaf. Go figure.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0OUYReupSa5gQoifZFJe_A"
  },
  "mQ5djMZU3ehiyvElj6N1dw": {
    "date": "4/23/2015",
    "text": "This is the place hot salt beef bagels with mustard and gherkins are made of OMG they are delicious and definitely worth the wait in the usually very long but very quick queue. The service is efficient don't go in expecting them to ask or care about how your day is, they ask what food you want, they take payment and they give you food nothing more and it works for them.  They have a good choice of bagels with fillings and desserts. If you are in brick lane or the general vicinity definitely drop in",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Nfz9mNPw2OnMyvbWIVjTA"
  },
  "53zH7ytfpJYxUevE7Zo5aQ": {
    "date": "10/22/2013",
    "text": "Been coming here for a few years now. I always get peanut butter or marmite. While that's probably boring to some, on a fresh, warm bagel, it is one of my favourite things to have in and around my mouth. Yeah. I've heard the other place is only seen as being better because of the salt beef they do. I'm vegan so I wouldn't know or care. I love this place! There's always a right character in there too.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VfnVnWOcs2EvkiJpf1kb_A"
  },
  "cPmmpOSn9kfF9p3Da_hCfw": {
    "date": "12/12/2011",
    "text": "I live in Germany. It's hard to find a good bagel. These melt in your mouth. So good, so cheap, and its open late. Perfect to go along with that coffee in the morning, a snack, or a midnight munchy. Definitely recommended as a pick me up, especially after some vintage shopping has occurred.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tfN0DpcECAUmj8EsuBaQhg"
  },
  "7uPn0d142WQh8tB9LYRksg": {
    "date": "2/4/2012",
    "text": "Beigel ShopMelt in the mouth salt beef! The Beigel Shop is a local stop for a casual and incredibly cheap take-away option to get your salt beef fix. Don't let the queue detour you - it's worth waiting. Such a simple thing and done incredibly well: moist salt beef, fresh baked bread, mustard, gherkin. Mmmm. Bagels are made fresh all day and are done just right (boiled, then baked). If you have a sweet tooth, there are a tempting variety of bakery sweets filling the display cases for you to drool over as you wait in line. Note: If you're serious about your salt beef sandwich you might be disappointed with the lack of rye bread. And for what some argue is the best, you might want to head over to Selfridges and fork out £7.50 to indulge in a sandwich that is immaculately prepared, carved and assembled.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eiyWzIIJhbuoF7fYWb0zeQ"
  },
  "nzkBuQ1oXQjPc8uj9HAjNA": {
    "date": "11/14/2015",
    "text": "Just had the beigel bake vs beigel shop taste test. Both very similar in my opinion. I prefer the beigel shop as the line at beigel bake can be ridiculous at times and the salt beef was fresher at the beigel shop. If nothing else, why would you stand in a longer line for the same tasting food?",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xUlGyy3DV463ndOG0O7zfw"
  },
  "OlHKQe-dvBiirgjL-gLRiQ": {
    "date": "2/7/2011",
    "text": "Big round love (with a little hole in the middle) for Beigal Shop.Yes it may not have been a traditional choice, but my chicken (big chunks of roast chicken, not that waffer thin crap), mayo and cheese bagel rocked my socks off.My chocolate muffin was pretty awsome too.(Lost star is the result of a somewhat rubbish marble cake, btw).And the tiny price of £6.40 for two bagels, two cakes and a coffee was excellent too.Why the Beigal Shop and not Beigal Bake next door you ask? So did I. And the answer from the beautiful boyface who took me there is that it sells tuna mayo bagels here and the other place doesn't. That worked for me, so take his advice, follow the tuna mayo brick road and get your carbs on.",
    "rating": 4.0,
    "rated": {
      "useful": 6,
      "funny": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "zG6lKXmr8ZKBh1aq6weUgQ"
  },
  "6PLQ5x7MszPneGpg-TNMhQ": {
    "date": "3/16/2011",
    "text": "Baaaggeeelsss! Bagels bagels bagels.I was on a late night drive with my sister and a few others when we got a little peckish. My sister and fellow yelper (Chelle R) recommended this place as it's open 24/7. Yes I know what you're thinking because I was thinking it too... \"OMG Bagels available at my dire need 24 hours of the day, 7 days a week??! Nooo waaay!\" It's located at the far end of Brick lane, which is ideally placed as you can get to re-energize yourself after rummaging through all the vintage shops along the road on a Sunday afternoon. Anyway, on the night I went with my sis and mates, we managed to find parking as it was late. During the day, it may be a bit more difficult. I was surprised to find the beigel shop busy so late at night. Nevertheless, I waited patiently in line and ordered a deliciously dirty salt beef bagel. Just what my belly needed for a late night snack! I was satisfied indeed.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "gEoUWUWvk8Sr1ps3SbyS_g"
  },
  "tR8wtMG67LBqV0TV3CxXaA": {
    "date": "11/22/2011",
    "text": "Cheap, cheerful and just what I need.And when I mean cheap, I mean cheap  Filled Bagels at this shop are extremely reasonably priced and whilst the hot salt Beef bagel is around £4  it is worth every penny for taste! No pretension here!I also love the salmon and cream cheese bagels and they are a complete steal at about £2.I love the feel of this place, it reminds me of the functional cake and pastry shops you find on the continent and just goes to show you don't need fancy décor to make something tasty.The cakes are really quite reasonably priced too.Whilst this isn't the healthiest option, this is a great cheap place to grab a bite and I frequently go here for breakfast and lunch.As this shop is open almost (if not) 24 hours, it's also great on a night out if you become peekish.There is another Bagel shop just up from this (a few shops away), but I haven't actually tried that one as I've always been happy with this one, so bear that in mind when going.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDG7Tx7kUxYmJz108Vg57g"
  },
  "E2Cn1DM4kcMJrWfKZ_sKsw": {
    "date": "11/7/2008",
    "text": "I once found a fiver on the way home down Brick Lane and could think of nothing I'd rather spend it on than a copious amount of bagels from the Brick Lane Beigel Shop; a  24-hour bagel extravaganza for those who like their bread both boiled and baked.A local institution, the Brick Lane Beigel Shop, just a couple of doors down from its nemesis, the similarly named Brick Lane Beigal Bake sells plain bagels for around 20p while excelling in serving rather delectable roast beef bagels. It doesn't get much better than this!",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "UyY_u4rl5PVdRIsvakJo6g",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UyY_u4rl5PVdRIsvakJo6g/o.jpg"
      }
    ],
    "user_id": "j8fZ1NtpZ4ISiNl7xL6rjg"
  },
  "Zswra3P1-K80DS0gszb5BA": {
    "date": "11/19/2009",
    "text": "The main difference between this shop and its neighbour and rival is that Beigel Shop has a larger variety of bagels and fillings. I popped in here over the weekend for a crispy bacon on onion bagel during a drinking session, and it was deliciously wonderful, all for just £1.85, the same price it would have been for a plain bagel. If you're in Brick Lane and want a classic - cream cheese and salmon on a plain bagel or salt beef on a plain bagel - then Beigel Bake's the one to go to. If, on the hand, you're craving for something other than a standard, then this is the place to go to.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vt_lIJ3gqZ_Vm4p2fAqMGA"
  },
  "5Dr5lLoIv-K0pg3S4K5sQQ": {
    "date": "5/13/2015",
    "text": "The buns are soft, the the meat is juicy, the mustard is hot and the gherkins are tangy.T'was a bagel to end all bagels.Line was long, service was fast, price was cheap and the buns kept on coming.",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nvcZazX7qZ_8tGy8R7lkSA",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Look at that Pink!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nvcZazX7qZ_8tGy8R7lkSA/o.jpg"
      }
    ],
    "user_id": "Y9irIFzj2vNH5y7hDP_Z4g"
  },
  "USbike3CFOZJ7xNLAMRoBA": {
    "date": "2/22/2016",
    "text": "It's good, but not as good as the shop two doors down - Beigal bake! But hell, if the queue is massive for there, stop by here and you won't be disappointed! It's super cheap and tastes great! And the best part it never closes, so when you're feeling super tipsy, instead of hitting the kebab store, head over to brick lane and check this place out instead!",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_Z_TIj_9z9pkxeT07z_Wfg",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Space age bagels for takeout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_Z_TIj_9z9pkxeT07z_Wfg/o.jpg"
      },
      {
        "img_id": "CJ_mD8nknewgZBivz2eK5Q",
        "caption": "Photo of Beigel Shop - London, United Kingdom. The rainbow life",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CJ_mD8nknewgZBivz2eK5Q/o.jpg"
      }
    ],
    "user_id": "axmmINzAx4WWVNRHZJEcMA"
  },
  "ku-Ih0aUGwrCmEZIiu-HeA": {
    "date": "3/14/2015",
    "text": "Long queue, fast service! Small bagel, big taste!Great price!I would definitely come back, it's also open 24hrs",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4ngiWn1azNEnYqnbqn2-uw",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Bagel people in action",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4ngiWn1azNEnYqnbqn2-uw/o.jpg"
      },
      {
        "img_id": "409el9jT8dyA0KvafoMPsA",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Small bagels, big taste! Fast service, open 24 hrs. Salty beef bagel taste like heaven!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/409el9jT8dyA0KvafoMPsA/o.jpg"
      }
    ],
    "user_id": "Wzm2YtE9wXyhPXnx0JIV8A"
  },
  "MgBavsNzkIrG_bnyYszGSg": {
    "date": "3/18/2015",
    "text": "I have a difficult one on my hands here. I want to love Bagel Shop. And I think I do love Bagel Shop.... But my most recent experience turned me off it a little.... Although.... I still want to go back for another bagel. Service = odd. There's a queue, and a long counter top. (Think subway)... But instead of the severs moving down the queue to the next person they just scream NEXT and you have to awkwardly shout your order back whilst trying to head to the front. Part 2, I don't know if it because they were rushing, but they had to say 'lemon and pepper?' To me 3 times because the first two times she said it with her back to me and mumbled it.I wish now id had said no as it looked like the lid fell off the pepper onto my cream cheese. That saying.... It was filling and I do really like the bagels usually and the price is a DREAM!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BMEv94gBZZUsJtIyz_Htng"
  },
  "WFrKXSqCeFOpPNDFhODUgg": {
    "date": "8/11/2015",
    "text": "This place was by far my favorite place to eat in London over my past few trips across the pond. The meat was so tender and juicy like Caitlyn Jenner's ass. Beigel Shop really has the greatest salt beef bagel sandwiches of all-time! Part of me wanted to replicate this restaurant and bring it to California, while the rest of me wanted to have Caitlyn Jenner surgery and turn my salt beef into a bagel.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "cIh5WQogkH1vCK9vJ3RC9w",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Best-in-class",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cIh5WQogkH1vCK9vJ3RC9w/o.jpg"
      }
    ],
    "user_id": "vR8H4nREeWoaA601GLQV_Q"
  },
  "uyWMMsq1le7Ni4cHIM-7mg": {
    "date": "10/27/2015",
    "text": "I've had this place bookmarked on Yelp since moving to London, so I'm glad I finally got to try it out!! There was a 20 person line on Sunday at 3 PM but it moved very quickly, so we were in and out in about 10 minutes. We HAD to try the famous salt beef bagel and it was quite tasty- lots of delicious salt beef, a smear of spicy mustard, and some pickles. The bagel itself was good but surprisingly sweet and rather small. The flavors worked really nicely with the salty and spicy beef and mustard, but if you are seeking NYC-style bagels, this isn't your spot.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TcTLeG2komVxYJhEVxJl6w",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Salt beef bagel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TcTLeG2komVxYJhEVxJl6w/o.jpg"
      }
    ],
    "user_id": "BpHoMr3yBlv-bhB-_dZarA"
  },
  "gb8UDnHlu3XjcjwZryVNPA": {
    "date": "4/3/2014",
    "text": "SO GOOD. I don't know why it's spelled beigel, but I'm happy to shut up and just let them take my money.The £3.70 corned beef beigel is the priciest, but lord that's a lot of beef packed in with a smear of mustard and double gherkin joy. I also tried a £1.60 salmon (lox) and salted herring bagel, which was fishily delicious. Big selection of other toppings and there's a whole dessert section of baked goods, so I'll definitely be back!",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "gLke-4oih1t7urvoQAENcQ"
  },
  "659OOnP7WRo0_EAqQzginA": {
    "date": "10/14/2013",
    "text": "I've had two very different experiences with Beigel Shop -- so we're going to come in right around 3-stars. Experience 1: Delivery through dinein.co.uk = win. Bagels to my door. At 9pm. Brilliant. £15 minimum, but I loaded up on some loaves of bread, bagels with cream cheese, bagels with other sandwich toppings, etc. I ate them for a good few days. I like to live like a bachelor. I was very happy. 5 stars. Experience 2: A blustery, rainy Sunday morning. We need to take the dog for a walk and figure we'll head to Brick Lane for some bagels and then make our way to a park. Beigel Bake que is out the door, Beigel Shop (2 doors down) much more manageable. Due to rain, we opt for the shorter que. Mistake. Gone are the bagels of my dreams that were delivered to my door. Instead I get a flat, smushed bagel with extremely \"grainy\" cream cheese that tastes \"off\" and I throw away half. Honestly, I tried to give some to the dog and she didn't even want it. The interior of this place leaves quite a bit to be desired as well. I prefer the ignorance of delivery, I guess. 1-2 stars, not impressed. So there we have it. I doubt I'll be back after that depressing bagel. I'll brave the que and the gruffness a few doors down next time for a quality piece 'o dough with some smooth cream cheese. Word.",
    "rating": 3.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "5MCBLBxr10NLUKZ4AboAMg"
  },
  "xymTLcBtWVrpoBQaraus-g": {
    "date": "5/11/2017",
    "text": "We got the big salty beef on a bagel. I'm not a big meat eater, but this sandwich was so good. The textures were so nice! Loved the chewy bagel and the soft flaky meat. Yummm.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SNdVH1gt2mbv36O7t35l6Q"
  },
  "UT9qew455Jfs0Wpjra_eEQ": {
    "date": "5/9/2011",
    "text": "The Montrealer in me chuffs a bit at the weird ass spelling of bagel. But the smoked meat loving Montrealer in me bows before a deli meat that rivals smoked meat. Salt beef, despite the name, isn't very salty. I think it's a reference to the way the meat is preserved. Like corned beef does not have corn in it. It refers to the corn sized salt. Think of salt beef as a very thick cut corned beef. It's really nice to sink your teeth into a big hunk.The Beigel shop is long on taste and low on frills. Stand at the chest high bar and eat and go. The workers here keep up a furious pace, soup nazi with a human face.Under looked is the custard strawberry trifle. Sweet, creamy, velvety good on the tongue.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Q192wMed6rnJs8wwhIdGnw",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q192wMed6rnJs8wwhIdGnw/o.jpg"
      },
      {
        "img_id": "47fLBXwpKvAkOxuwVfl4Tw",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/47fLBXwpKvAkOxuwVfl4Tw/o.jpg"
      },
      {
        "img_id": "LIu4U_yeVwN-j0vbv02nww",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LIu4U_yeVwN-j0vbv02nww/o.jpg"
      }
    ],
    "user_id": "mb_8jXannipO5T5V5kGXiQ"
  },
  "AFkyh-4ttN1Fve-M63YGzA": {
    "date": "5/19/2015",
    "text": "Those bagels were so good that I didn't even thought of taking a picture of them. Had smoked salmon / cream cheese and tuna bagel. Fast service, the bagels Tasted awsome and paid under £3 for both of them.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9w7wwL2xwwz5YJq8rjNQfw",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Hot salt beef bagel with mustard and pickle. Perfect!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9w7wwL2xwwz5YJq8rjNQfw/o.jpg"
      },
      {
        "img_id": "PSRVU4eSXyi262ov4QqYgg",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PSRVU4eSXyi262ov4QqYgg/o.jpg"
      }
    ],
    "user_id": "EVMsZEziBwEFLEjFeNO8qQ"
  },
  "o1Ps4djXt06chrKsTXwCpg": {
    "date": "1/17/2013",
    "text": "Walking down Brick Lane at 6 on a January morning is like looking at pretty ruin in a refrigerator. Everything is still and smoky and -2 degrees. I still see smoke coming out of my mouth, glistening from the street lamps in the foreground with the dim glow of colorful murals along the shops decorating the background. Nobody is opening up shop nor closing up shop. It is a sublime feeling. If I died of hypothermia, why not collapse in the middle of Brick Lane?It is one of only two beigel shops (yellow and white signed) open at the very Northern end of Brick Lane, even before Brick Lane Coffee opens, the yellow beigel shop (oh I love how my American autocorrect replaces 'beigel' with 'beagle' rather than 'bagel') with the counter facing towards the left hand side, is where it is at. The beigel shop offers beagles, I mean beigels, starting at 25p.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "e6K4JQZEltqZ6o7uhq2kTQ"
  },
  "gYfDXREVwFf7i0vF40Zi0A": {
    "date": "8/28/2014",
    "text": "One thing from the US I've really missed is freshly baked bagels. Having worked at Panera Bread Company for almost 2 years, and loving the fresh bagels in the various flavours with the yummy cream cheese varieties to go along with them, I've felt the loss.Cue the relief music as I've found a reasonable London substitute. It might not have the extensive flavour varieties I'm used to, but damn they are good. Freshly made all day long and topped with plain cream cheese, these little beauties are reason enough to visit Brick Lane.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ll5l4WTKPH7zWQWA68Rhdw"
  },
  "jmC-musijYLqdNwTLCHZsA": {
    "date": "1/23/2016",
    "text": "It's not the original which already may out doubt in your mind. And it sometimes gets a raw deal because of this. But try for yourself. The prices and bagels are not bad compared to my other fav next door. However, the portions are not as good for the star slat beef bagel and well, it's just not the same. When you know, you know. I always stick to the original.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HOUwuQvxN6vq6j15y4aZRg"
  },
  "Igd8sYR3RTLkzytvVUuThA": {
    "date": "4/10/2016",
    "text": "They don't TOAST the bagels. It's not even an option. I was so excited to have my bagel just for the guy to tell me they can't toast them. Not worth the wait.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHZ3jzfipf4ed7tXKTK4sw"
  },
  "vFdSVxQRQR9UTDCIE4unZQ": {
    "date": "11/15/2015",
    "text": "I was lucky when I got here because there was practically no queue, which is a very occurrence.  This time, I tried a bagel toasted with crunchy peanut butter - delicious.  It was also really cheap (only 90p!!!).  Aside from the frequent queues, the other downside is that there's no seating, so make sure you want something quick to go, because that's what this shop offers.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gfmf4kQjVT4Ds2eNZCuHMQ"
  },
  "OtPCo7NSS01PFAy9OexfIQ": {
    "date": "12/29/2015",
    "text": "I'm still dreaming about that beef salt bagel. You HAVE to get it with the mustard/pickle, I know it sounds weird but the flavors work together in ways only God can understand. The sweet juicy beef will forever haunt me as the best corned beef ever to grace my mouth. Immediately after leaving my entire party started discussing plans to return or to try to make them ourselves (though I doubt we could master the beef salt bagel like they can). Please go eat this for me so I can live vicariously through you. Pretty sure I will ask for this on my death bed.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QXmX00VoMOF1oIBw6m3hLw"
  },
  "3zlV_gXJc6YZWqFFbkS9lA": {
    "date": "10/12/2015",
    "text": "Popped in here by mistake - was meaning to go to Beigel Bake next door, but was too anxious for a beigel and I ran into this one!    My review is based on the salt beef sandwich on a sesame beigel. The beigels were good - but certainly no NY bagel!  Slightly chewy, but missing that nice crusty outside.  The beef was ok, a little dry and it lacked good salty flavour.  Generous portions of the beef, mustard and pickles.  For the price - totally worth it.  But for flavour - go to beigel bake next door.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7GBL6RBRILWMFv6bpsoAWQ"
  },
  "H0TbE3d_D6wDI5OjoGIn6w": {
    "date": "10/30/2015",
    "text": "You don't wanna know what's inside those bagels, but damn nothing soaks up alcohol like a runny crispy bacon and cheese bagel from this place.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBQ-PMxjmTw2rF6swl5i4A"
  },
  "PRJgbxvSKB5-1O_TwLVpRQ": {
    "date": "5/21/2014",
    "text": "This place is open 24/7, so if you are out in east, it makes for a great late night bite to eat/breakfast!I personally cream cheese (in combo with salmon is less than two quid) but the salt beef is also beautiful. Always on point, and has a great reputation for a reason. It was recently shut down for a few days, and after much press coverage, I'm glad that its reopened!",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mZvw6X7rEJRQeAUaMly1KA"
  },
  "IOwsW52tcYSEO1F-DqxR8g": {
    "date": "8/13/2018",
    "text": "At first I went into that other bagel shop. There was no one else there, I stood there a couple minutes, had some employees look at me and then away, so I left. Great service. Not.As soon as I walked in here I was greeted by a very nice guy.I ordered the salt beef bagel, a lamb samosa, and a bread pudding.The salt beef bagel was delicious. I am from New York and I could eat this again and again. I just wish it were bigger.The lamb samosa was pretty good but dry.The bread pudding, for only 60p was a great value and very good. It tasted very fresh and was a big piece for the price.Cash only.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ALros6xbR2V8QyTmEXtsFg",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Salt beef bagel is so good but small",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ALros6xbR2V8QyTmEXtsFg/o.jpg"
      },
      {
        "img_id": "xLFUoaXfm7caBkJ7FIuPNA",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Bread pudding is delicious and only 60p",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xLFUoaXfm7caBkJ7FIuPNA/o.jpg"
      },
      {
        "img_id": "6CdtJSuAhxRhiDDYMEduFg",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Lamb samosa, okay not great",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6CdtJSuAhxRhiDDYMEduFg/o.jpg"
      }
    ],
    "user_id": "mkHqtJ4ctr7kGfc1G_UiAw"
  },
  "4INYekpB9IopQDhAl03N6w": {
    "date": "10/12/2017",
    "text": "Definetely the best and cheapest bagels of London.I took a salmon creamcheese one with the rainbow bread. What I like there, it's you can create all your bagel from the bread to the fillings and it stills cheap !The only bad point it's they don't toast the bread.However, I recommend this place if you are looking for a cheap food in Shoreditch",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oj8RHeu2_I9hMmme8IbU4A"
  },
  "PuEgZaxmD9l3Tka1ayoRkA": {
    "date": "4/3/2018",
    "text": "I had the regular saltbeef on a plain bagel...meh something to try,  it taste like a meaty pretzel.  The cheesecake is really good. Late night bite I've never had it in the day. The location is really chill people just kinda stand eat and chat.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3HZW-lGTVjki03EF66b8fQ"
  },
  "IcmFfbEwnAbUN6r4BvAq9w": {
    "date": "5/29/2017",
    "text": "Two words: Salt beef After touring the town all night, my friend suggested that we try a snack that is popular to Brits at any time of the day. The salt beef bagel. First of all, being from New York, we are used to seeing restaurants and delis open 24/7, but that's not as much of a luxury in London. We were already full from dinner, but my friend URGED us to carve a slight appetite for this hit and I assure you, it was the best thing we could've done!I can't recall how much a salt beef bagel costs (£5 at the most), but you get your money's worth. Its a toasted bagel or bun that is stacked and I mean  S T A C K E D with salt beef and topped with thin slices of pickles and some mustard. Your typical, but not so typical, deli sandwich. Salt beef tastes like roast beef and pastrami had a baby, named it salt beef, and left it in London. It is so tender, juicy, and, staying true to the name, salty. I do not like salt and eating bread with beef, but damn...forget that, I'll eat salt beef whenever! My friend and I loved it so much that we made it a mission to grab some salt beef bagels for the flight home. Yes, we did that. Yes, we were kind of late to the airport. No, we did not miss our flight! If you are in London and seeking hometown eats that you won't know unless you've lived there, certainly check out the Beigel Shop. It actually is right next to the Beigel Cafe/Kitchen and they compete to see who has the better salt beef. Both are open 24 hours so you're not at a loss. The Beigel Shop offers other items as well, but with the salt beef craze I didn't really order anything else, hence the 4 star rating. 5 STARS FOR SALT BEEF!I miss London now...",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "owealy_yKbIlNdzjGExiWw",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Salt beeeeeeeeeeeeeef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/owealy_yKbIlNdzjGExiWw/o.jpg"
      }
    ],
    "user_id": "ASLpsoJedm40EWb0oTtjeA"
  },
  "JWcaIdqjf5fjgNk5Wa6TiA": {
    "date": "5/1/2018",
    "text": "The bagel salted beef sandwich was to die for! Its a run down looking shop but who cares when the food is good. The bagels are freshly made and the staff super friendly. Will definitely be back",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egbM65nnLOpkbeKm8JaQ0Q"
  },
  "Jj_blrxZotXjtxNeLret6A": {
    "date": "5/2/2016",
    "text": "This is the place of the first ever all-around-the-world rainbow bagel!You own a bagel shop in Brick Lane, you do properly your job delivering tasty bagels but a bagel shop just two shops away from you is taking all of the customers...What should you do? Think clever to beat competition; invent the colorful bagel!As great as it looks, the same great it tastes. Try in on salty beef and of course you will love it. But be aware; this is not to get addicted-adding artificial colors to food is never a good thing....",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eK6IiJ-Fn72_Q7h_gdbRdA",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Rainbow bagel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eK6IiJ-Fn72_Q7h_gdbRdA/o.jpg"
      }
    ],
    "user_id": "FnD5qaHuQjkzz6g-gtL2SA"
  },
  "d-Jn1ibf8DqUw8uXvaNQLg": {
    "date": "4/15/2016",
    "text": "We stopped here on the Yelp London Street Art Walk. I'm not a big fan of bagels - tend to find them a bit chewy - but they were being handed out, so I took a bit piece to see what these famous rainbow bagels were all about. They were so good, I promptly packed a few to carry home.I chose the salt beef stuffed bagels and the beef was really soft and melt in mouth, even though we only ate them over 12 hours after they were packed. The bagels, were nice and soft with just the right amount of chewiness.We tried the samosas (since we were in Brick Lane) The chicken wasn't bad, but the lamb had too much onion in it to bulk it up rather than flavour it.The coffee is just instant coffee and not something I would recommend, but I'd definitely go back for the bagels",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-PhhyypS2kE5G08jymoVjA",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-PhhyypS2kE5G08jymoVjA/o.jpg"
      },
      {
        "img_id": "TMk6C6gbm6pw1uYipvoIuA",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TMk6C6gbm6pw1uYipvoIuA/o.jpg"
      },
      {
        "img_id": "6owbp2cmMuE-0hc7NHrP6A",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6owbp2cmMuE-0hc7NHrP6A/o.jpg"
      }
    ],
    "user_id": "kKM1IGrc4nCuvfv968NigA"
  },
  "NQiZtppLM5hz2VAqFbjkuQ": {
    "date": "7/6/2016",
    "text": "Everyone agrees that there's nothing better than a bagel from Brick Lane, available around the clock.  And you don't have just one 24/7 beigel bakery but two, almost next door to each other.  I have to admit that I have always favoured Beigel Bake, can't even explain why, just joined the queues and liked what I tasted.  I would pop into Beigel Shop when the other sold out (it happens!), but now there are Rainbow Beigels, a mega trump card for Beigel Shop!!  Fingers crossed, this will secure business and friendly competition for another 100 years (the bakery closed down for a while in 2014 - one bagel bakery on Brick Lane is not enough!).How exciting to have a multi-coloured bagel, and it's more than just a gimmick.  Slightly sweeter than the plain original, they work best with sweet fillings - the woman behind the counter recommended Nutella, and she was right: looked ugly, tasted divine!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "NLgPXWiYAu8Whz1dqKkxUQ",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Rainbow beigels",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NLgPXWiYAu8Whz1dqKkxUQ/o.jpg"
      }
    ],
    "user_id": "KuiDS6fpN-NhosrQPJ9KWQ"
  },
  "l4tqWOMu_cxXkYpKAzgkaA": {
    "date": "3/11/2017",
    "text": "The salt beef sandwich was ok.  Meat was tender and they were pretty generous with the meat. The mustard had a nice kick as well.  The biggest downside was the sweetness of the bagel. One would think having the sweet contrast with the salty beef would be nice, but somehow it didn't quite work.  Good for late night bite, but don't think I would wait in line again.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSYxTvS3wDauhL4DZWIBEw"
  },
  "0coxsLzCxY676XOqvRq5NA": {
    "date": "8/9/2017",
    "text": "No no nooooooo. How does this place rate so high? Have you people never had a good bagel in your life? Perhaps my standards are high but my bagel from Beigel shop was hard and dry. I could have gotten something similar out of the freezer section in a grocery store. Go next door if you're looking for a chewy bagel (though still not anywhere near as good as anything in NYC).",
    "rating": 2.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GvYyEkCdovKI54TCwtqnww"
  },
  "k8wQDOp9LwTZKJ9qJo4RwQ": {
    "date": "3/12/2016",
    "text": "The shop is small and has some queue, but it moves quickly as the workers do their job fast. I had the rainbow bagel with cream cheese and salt beef beigel. I didn't care much for the cream cheese personally, but the salt beef was incredible. It's warm and melts in your mouth with the yummy salty and meaty taste, surrounded by a soft pillow of bread. I'm already craving another one",
    "rating": 5.0,
    "rated": {
      "useful": 8,
      "funny": 1,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Oa815oOm3bzdCfMk1Un5rg",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Rainbow bagel",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Oa815oOm3bzdCfMk1Un5rg/o.jpg"
      },
      {
        "img_id": "p5yTFfxJPo997ldBUZv2bw",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Salt beef beigel",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/p5yTFfxJPo997ldBUZv2bw/o.jpg"
      }
    ],
    "user_id": "OZhbdyANnVKUgbrXAfnzTg"
  },
  "przPzD2rsmoUiHOeOiUYjw": {
    "date": "6/4/2017",
    "text": "Great bagels located in a amazing neighbourhood.Lot of ingredients are available and you can create your own taste. I obviously recommand their famous \"rainbow bagel\" even if it is more for the picture as it doens not taste different from a classic bagel.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Ngo1ITdph18GePHuY-cRA"
  },
  "Dhp-_8nBM8FFwEqCKG8Trw": {
    "date": "4/12/2016",
    "text": "My first bagel on Bricklane! And what other choice did I have but to get the famous rainbow bagel. It is little over a £1 and served on its own although I think you can pay a little extra to get butter & jam. I liked the consistency, it had a good level of cinnamon in it which was good even though it must be packed full of colourings. I probably wouldn't get it again but  would recommend giving it a try. They also serve bagels with TONNES of other fillings - the more simple like peanut butter to the more filling and flavourful. I saw someone with the salted beef and it looked amazing!",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6yI8B9gMl1QE6AMh2_k1Bg",
        "caption": "Photo of Beigel Shop - London, United Kingdom. Rainbow bagels #colourblast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6yI8B9gMl1QE6AMh2_k1Bg/o.jpg"
      },
      {
        "img_id": "htxDU8S8W9WZiDqWa_yhfw",
        "caption": "Photo of Beigel Shop - London, United Kingdom. #colourblast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/htxDU8S8W9WZiDqWa_yhfw/o.jpg"
      },
      {
        "img_id": "yBTbP2Hsnps3MIZXl3adlA",
        "caption": "Photo of Beigel Shop - London, United Kingdom. #colourblast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yBTbP2Hsnps3MIZXl3adlA/o.jpg"
      }
    ],
    "user_id": "pffDyCwOAfk0q7I4G9GmNw"
  },
  "Ri-oHSBVBjktmiy5Ru_hvg": {
    "date": "2/9/2018",
    "text": "Really the only place on brick lane open at 3AM. If you're super, super hungry at that hour, and you're phone is dead so you can't order anything to be delivered, then go for it. But you're going to be feeling some type of way the next day.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O8P9fAyan0MI0WL_TsAYmA"
  },
  "asrHoTJ-Mywht8vXOQajYg": {
    "date": "10/19/2017",
    "text": "I had to try this shop if just to compare with the one next door. The shop was much less crowded and the service much nicer. They make a rainbow bagel but I opted for a simple cream cheese and smoked salmon. I liked that it was made fresh in front of me unlike the other shop where they make them in advance.The sandwich was alright but dense and the bread wasn't so fresh. They also don't sell challah rolls, just the big ones.tripadvisor.co.uk/ShowUs…",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYcOiNUIKLOn2AralAFs0Q"
  },
  "NXF_1I85ZQH9rCUuxQ_kwA": {
    "date": "11/18/2015",
    "text": "While the Beigel Shop always seems to come in second place to its next door competitor, they still make a fierce beigel that rivals its competitors in almost every way.So I totally went to two beigel places in one day, less than a block away from each other. Beigel Shop is a modest, hole-in-the-wall that serves some of the cheapest and best food in all of London. Walking inside the small space you are immediately flanked on your left by a whole glass case of various desserts - try to resist your sugar tooth and order a hot salt pork beigel sandwich instead. The salt pork is a delicious red color, melts in your mouth, and isn't nearly as salty as the name would suggest. The beigel is also so much better than regular American bagels (sorry New York) - light, chewy, and sweet. But between Beigel Shop and Beigel Bake, which offers the better product? I think it's too close to call for most people, but if I had to pick one I think Beigel Bake takes home the crown, if only because I thought their beigel was a little sweeter. However, they're both getting five stars in my book, and Beigel Shop can go toe-to-toe with its rival and offers a much better selection of various desserts. So, in sum, go to the one with the shortest line, then while eating walk and wait in the longer line because you're going to want more than one.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qm796RfFpk4hWp2W9yEHCg"
  },
  "HMkuszHrdIjQsU90OkkBXw": {
    "date": "2/29/2016",
    "text": "SOOO GOOD!! I'm still dreaming about the salt beef bagel with mustard and pickles. The meat is so tender and delicious. I DIE.They also have a chive cream cheese bagel that is tasty.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HIPHqtKxVXfmtGPuEYojuQ",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HIPHqtKxVXfmtGPuEYojuQ/o.jpg"
      }
    ],
    "user_id": "kkfs2eJEuTpm9P7gGxGPcQ"
  },
  "QM6OUlSha_ZN0IV5cc1OGw": {
    "date": "1/14/2017",
    "text": "Yummy salt beef bagel! Strange they charge for the pickle.. and then kind of stingy on the pickle.. could have gone for less beef and an extra pickle. Lol anyway very delicious rainbow bagel with salt beef! Mustard was good not too spicy",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KYAz-OniL5_sCS5Pdxi--g",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KYAz-OniL5_sCS5Pdxi--g/o.jpg"
      }
    ],
    "user_id": "Xtj0R04ndeJX5raV9n4-UA"
  },
  "BEmfEEPyiVyM7JkG9trwMA": {
    "date": "9/20/2015",
    "text": "Apparently this is first and best Beigel shop. I can't vouch for it being the first but it's definitely one of the best. If you a judge an eating establishment on the queue out the door then this might even be the best food establishment in London. We waited about 15 minutes for our ham baps but it was well worth the wait. It was rich, flavoursome and packed full of meat. This is a proper old school eatery selling delightful savoury goods as well as some tempting sweet treats. Great breakfast. If you want my advice get there early before the queue gets too big.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "jLoD8kFRpwOTVdlxsuYeIQ",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jLoD8kFRpwOTVdlxsuYeIQ/o.jpg"
      },
      {
        "img_id": "C_Zjio5eHl8UkoaLPhm7qQ",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C_Zjio5eHl8UkoaLPhm7qQ/o.jpg"
      },
      {
        "img_id": "MCJZFgjbLI_u2xdrRmdVSw",
        "caption": "Photo of Beigel Shop - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MCJZFgjbLI_u2xdrRmdVSw/o.jpg"
      }
    ],
    "user_id": "AeRuFuddgPh9pxmBVFIUaw"
  },
  "EzTwFwSUOe3l9rZPXTSOKw": {
    "date": "7/9/2017",
    "text": "I had one salmon bagel. Salmon is fairly generous for the price (£1.70) and the bagel is rather good. I'll be back for trying the salt beef.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TgnXgGh9723toSGBG674Tw"
  }
}