{
  "hT2iTqA-Rr_e32UnIZ0ngA": {
    "date": "2/10/2010",
    "text": "I dined with four friends at the restaurant Alain Ducasse at the Dorchester on February 3rd 2010 and we all agreed that the only restaurant that we have found that could better it was the Fat Duck.Walking down the hallway towards the restaurant is a treat in itself with LARGE plants and statues and dressing - it is, I imagine, as a cruise ship from the 50s would be.The service was excellent leaving us in peace until we wanted something and then just a nod would do.I had a soft boiled egg with crayfish and mushrooms to start and veal with vegetables for a main.  None of the deserts called to me so I finished with a machiato and petit fours.  The fixe prix for two courses was £55 and the bottle of white that three of shared was £55 Some of us had 3 courses and paid a premium for signature dishes.There was one palate cleanser which I always enjoy so I would have liked something between each course.After the petit fours a trolley came round with complimentary sweet dishes which sorry to say we all turned down as we were replete.We had a top table deal and got 20% off but still ended up paying £360 between usA down side - the 'ladies' were given a little present to go (a box with two iced doughnuts) that the 'ladies' said were disappointing.Sexism, the boys didn't get offered and the girls didn't share.Yes I will go here again except that I always want to try something new so will not revisit until I have tried all the other Michelin star places.",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "B51-WjhKFcR58THOoj4i-w"
  },
  "RRmgxOg62ygrr_WWk9sPqQ": {
    "date": "5/2/2011",
    "text": "Hmm...not sure about the 3 stars...maybe a 2 just for the louis xv cake!! First time I ever tried this cake was here - the original and the best. The mains were good - perfectly cooked, salmon flaked off perfectly though sides weren't very interesting and lacked enough sauce.Unfortunately I don't think they serve the cake in the London restaurant anymore, but you can get the replica at Gauthier Soho. Totally recommend it!!!",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOoFZlv2kDLyHBJ4nneWnA"
  },
  "S7DE6G8XRSp7fDkGhOMPFw": {
    "date": "12/5/2010",
    "text": "3 Michelin StarsWorld Renown ChefThe hotel itself where the restaurant is located in is uber fancy. To get to the restaurant you walk through the afternoon tea area, where everybody is dressed up. As you walk into the restaurant two ladies open the double doors at the same time for you (they do this when you go to the bathroom and back as well). It was a really nice touch.Unfortunately, I didn't do the tasting menu here, so my views might be skewed. I thought the restaurant was a little above average on the fine dining scale. They gave us these little round cheese bread balls and this broccoli puree with other veggies as an amuse bouche. For an appetizer I had the John-Dory goujonnettes. They were swimming in a coconut and curry sauce. It was okay, nothing amazing and since I've been in London where the best Indian food in the world exists, the curry didn't even compare. I had some of the Cookpot of vegetables and mushrooms. This is one of the chef's specialties, but fell short. It was bland and much different than I expected. I had the restaurant's specialty meat dish, the fillet of beef and seared foie gras rossini. The fillet was so tender and juicy. I'm more for the salty fatty kind of steak, but this was excellent for what it was. The sauce really made the dish. I love cooked foie gras (the kind in the flan texture) and this didn't disappoint. I had a piece of my husbands' venison and it was just as tender as the fillet. The venison comes in a much smaller portion than the fillet, so if you're hungry get the fillet.I of course had to have the cheese course. I liked it especially here because they paired the cheese with different  condiments. They were next to the cheese you were supposed to eat it with (They usually just give you the condiments if any and you have to check and guess yourself to see which goes best with what). As a caramel lover I had to go with the coco-caramel delight for dessert. More like coco-caramel disaster. It was probably the only dessert I never finished on this trip to London (and it was the size of my ring finger). My husband got the Baba like in Monte-Carlo (another specialty of the restaurant). It was a ball of sponge cake dipped in some sweet apricot sauce. Then it was cut open in front of us and had our choice of rum poured into it and topped with whipped cream (the good made from scratch kind). It was a lot better than my dessert, but just not what I was craving at the time. It was good though. Even though I didn't like 2/3 of my meal, I'm sure if I had tried the tasting menu I would have liked it much betteranitaeat.com",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aN5q5_vC8TiFc5wKngmTaw"
  },
  "jnbsll38wkpq3SEXyD6okw": {
    "date": "2/19/2009",
    "text": "I would really like to review this restaurant just to let other people know why NOT to go to this place.. I know the phrase that if you don't try yourself you don't really believe others but this is a case that does not work like that. If you although don't mind spending some hundreds of £ it fine! I would really expect something from this brand under Alain Ducasse and the history. I have been traveling around the world tasting michelin restaurants but this one was a DISASTER. 2 people dining, asked for half bottles of wine because we wanted to match at least starter and main course but the arrogant sommelier just said there is 1 half white and 3 reds. no wine by the glass.. Didn't start well but anyway after our meal we were SO disappointed by this plain badly cooked food.. We are not even talking about stared restaurant but a bad hotel-like food for groups.. I wanted to cry having to pay £400 with a bottle of wine JUST 2 people.. Save your money and don't fell into this trap. Just saying this to help some people try something that worths it.. My first review by the way! Dine well people, life's too short!",
    "rating": 1.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "7OS4A3ofDBrjNYtzrzzlvQ": {
    "date": "12/27/2009",
    "text": "nice atmosphere but the food was really nothing special considering that its under alain ducasse name!",
    "rating": 2.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "228N_xH82ysatTiX8RE4IA": {
    "date": "4/27/2010",
    "text": "We were on the lookout for a place in London that had 3 Michelin stars, and we were very pleased to find the Alain Ducasse. I loved the elegance of Alain Ducasse. It's situated in the Dorchester Hotel, a lovely upscale property with charming ambiance in its own right. But the atmosphere is in the restaurant is something else. The staff are considerate, quick, and professional without being pushy. They seem to be floating on air in fact. The overall vibe was relaxed and comfortable. It's such a pleasure to dine in a place such as this.After sampling their wonderful fresh bread selection, we started out with hot and cold crab along with artisanal pasta with sauteed wild mushrooms. The crab was interesting, but a bit of a let down flavor wise. The pasta was interesting as well, however, not befitting a restaurant of this reputation. I've had better pasta dishes at countless restaurants of lesser stature. The presentation on both was thoughtful and cohesive.For the entrees, we had roasted veal loin with blanquette vegetables and the fillet of beef and seared foie gras rossini. The veal was marvelous, very flavorful and succulent.  Though, the portion was tiny for an entree. The fillet was nice, but underwhelming flavor wise and a tad undercooked for medium rare. The foie gras rossini was a bit bland and seemed to be an afterthought rather than a compliment to the meat. Again, the presentation was well executed with these 2 dishes.Overall, we were happy with the meal, but it was a bit of a let down because our expectations were so high based on the Alain Ducasse's reputation. I'd probably not go back, but it's worth checking out at least once.The pricing was quite high, but for a place like this, not unreasonable, 55 pounds per person.",
    "rating": 3.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmL1P6wJi0Z8Jg8DTPqawQ"
  },
  "aPRvOBxTu3HSpexkwMYxsA": {
    "date": "6/24/2014",
    "text": "Visited here for a special celebration while in London. We both had the tasting menu of the moment, 7 courses all of an excellent standard. Service was top notch. Very attentive, with waiters always around to ensure glasses were never empty. Meal was pricey but worth every penny.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zAg3GA_a1W2yFpxwTdGsZQ"
  },
  "tWT3IC_ED5caD2v1gZ6jJw": {
    "date": "1/25/2015",
    "text": "ABSOLUTELY TERRIBLE, worst meal in quite some time!!!This place is NOT worthy of three stars by a long stretch and I wanted to share our disappointment with last night's meal, so others might avoid spending a lot of money on an average meal and a large disappointment.My wife and I had made reservations at the restaurant well in advance to be the highlight of our fifth wedding anniversary trip to London and we were very much looking forward to the meal.She ordered the tasting menu and and I ordered the truffle tasting menu, despite it being double that of the regular tasting menu. It was not at all the experience we expected, and we were both extremely disappointed with our meals. In particular the truffle menu was very uninspired. The soup was bland and watery, the dishes were largely devoid of much flavor and we left deeply disappointed.To be clear the service was excellent (with the exception that when I shared I was not happy with the meal I feel something was \"lost in translation\" as I did not get any appropriate response from the staff member). Again the service was quite good, in particular the sommelier who made great recommendations on the pairing and was quite kind. Another complaint was that we were poured sparkling water which showed up as a £14 charge without being asked what type of water we wanted.I wrote to the GM, Damien Pepin, to express our disappointment and ask for a refund of the portion of the bill that was food, which I felt was more than justified based on our experience and he responded by asking to talk to me on the phone. When he got me on the phone he spent the entire time trying to defend the meal and did not offer any restitution. Candidly I feel like I have been robbed given what a poor experience. He could have so easily made things right but clearly does not care about his long term reputation or that of the restaurant. AVOID THIS RESTAURANT, it is resting on past performance.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdIzdseo59VPMADygRqZtg"
  },
  "bcM1JM7-J1hboPdJ2pIAyw": {
    "date": "3/8/2016",
    "text": "I can't really work out what the difference is between a two and a three star restaurant but perhaps thats why I dont work for michelin. Given the price and the fuss I was a little disappointed. The food was very well executed as you'd expect and there's nothing really to take issue with but personally I felt the menu was a bit stilted and unambitious. It changes regularly and these things are all subjective but I just never got the \"bang\" that a three star michelin restaurant should bring. In fairness the aged stilton was the best cheese course I've ever had by a long way and is worth the trip by itself.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wTfba4kR5Y7hWRj9uSxJuA"
  },
  "67JNZlyj0Hh0PqcBYkr99Q": {
    "date": "2/24/2016",
    "text": "This was pretty close to perfection. Perfect food, perfect theatre and perfect staff. The only mar was the young lady who showed me to our table. It was right next to the entrance to the kitchen and when I asked if we could have a table away from the entrance, as it tended to be a bit noisy with traffic, she said it wasn't. i.e. she disagreed with me!!! I am well used to Michelin 3* and this was a departure from the way they are in every other respect..She did move us, but they clearly have tables for regulars and table for non-regulars...understandable, but a bit obvious!  But...the meal was perfect and we were looked after beautifully.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kb-PKSFcZkTYpIcvRyKhvA"
  },
  "KKBsZu-M2nnCr9vbB3KxLg": {
    "date": "8/8/2011",
    "text": "The best lunch I've ever had in my life. The best 56 pounds I've ever spent in my life.Okay i think that suffices?i could rave about this restaurant forever but a few more notes: lovely atmosphere, service was perfect, had random extra courses thrown into our 3 course meal, and left so stuffed and happy. they had the best macarons (which were just thrown in randomly along with chocolate covered hazelnuts, caramel, and chocolates) for most really nice restaurants i go to try them out, but don't revisit because i want to try other nice restaurants. but this one is one i would like to come back to, especially to treat someone",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "s04MTpW9dojD_f0MdgeWjw"
  },
  "sB27i1ogpyH9BBVA12Wc1w": {
    "date": "3/22/2011",
    "text": "The restaurant is located within the Dorchester hotel and may be a bit tricky to find if you first arrive at the hotel, but the staff is usually quite helpful and escorts you to the Ducasse receptionist...So far I have been to Ducasse's London restaurant twice, and each time, I was truly amazed not only about the food but about the outstanding level of service I received. The meal started off with three different types of string pastry followed by an amuse bouche. Unfortunately, I never had the chance to try the full tasting menu which may have taken too long for lunch. But I am sure it will be the perfect choice for a great night out.The  a la carte selection is small as would be expected from a restaurant of this caliber, but covers most tastes. Starters came with a great variety of bread to choose from and some salted French butter which would have been enough to satisfy me before the main course. Main courses and desserts were quite outstanding as well. After the meal, I opted for Ducasse's signature mint tea which came with four different mignardises (macaroons, chocolate-covered almonds, Montelimar nougat, and truffles). The interior is quite stunning in its purity and modernity and due to the asymmetric shape of the room, it feels quite cosy despite its size. This restaurant surely is among the best places I have ever eaten.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "0owOOqw5cgtDSY2p3mXB1w"
  },
  "cgBZy9yg-RGio1MCETDi6w": {
    "date": "6/16/2009",
    "text": "I had a magnificent private dinner here the other night celebrating a birthday and it was truly a delightful experience. We dined in the Salon Park Lane and everything was perfect from start to finish.The room was decorated to the nines and the food outstanding....every piece of the menu was designed for everyone's taste.  This place for sure deserves the Michelin stars.....My Menu: Amuse bouche with artichokesMarinated Scallops with lamb's lettuce, celeriac and black truffle sauceRavioli of Foie Gras, fresh herbs, duck consumeeTurbot with potato gnocchiVeal Loin, tender potatoes, choron saucePrailine-Chocolate BiscuitMignardises & Gourmandises",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "-zuV9Du1HFHaQ6GnVyGWsQ"
  },
  "AWRPetIKYRoDOLdsSGWmIw": {
    "date": "9/2/2015",
    "text": "I was disappointed at the food and services. I was with a large group and seated in a separate room. The room was not as beautiful as the inside hall however, the view through the big windows was nice. Considering we were a large group, it was understood that they might want to serve us better in a separate room. As we were seated, the waiter/waitress poured the water to the glasses. My partner was not seated at that moment and I told a young waiter not to forget my partner's water. He said yes but obviously forgot it. My partner finally got water after the first wine was served and other waiter came to refill the water. I didn't say anything. They were busy. I tried to understand. The bread was served. The table I was seated at was shared with 9 other people including my partner. It seemed a set of the butter and the whip cream was assigned per a group of 4. My partner and I were far from the butter and the set. So I asked the waiter (who had forgotten bringing water) to bring a set of the butter and the whip cream. He brought the butter later but didn't bring a whip cream. When they continued to serve the first dish, I refused it and inquired the waiter what I had asked. As you expected, this caused some noises. Well, honestly, I was mad. I was told that this restaurant was a Michelin star restaurant and my expectation was a pretty high. I didn't expect this kind of basic mistake. After the bustle, they served us with more attention. However, the waitress seemed a bit upset about this bustle. She splashed the wine to my glass when she poured it to empty the bottle and when she cleared my wine glass asked me whether I mind with a loaded tone (the wine was obviously over and she didn't ask when took other guests' glasses.) It wasn't a friendly way.The food was okay. I enjoyed the signiture dish (some pasta with the lobster sauce). The continental beef steak was okay. But again, there was a service issue. I ordered a medium-rare and the person seated next to me ordered a medium. I got a medium and he got a medium-rare. Since mine was served earlier than his, we cannot switch. I was not sure whether this switch was intentional or not. However, at that point, I didn't have any expectation left for this restaurant and decided to let it just finish whatsoever. Both of us couldn't finish the steak. It was not so great one after all. I almost wanted to give 2 star rating to this restaurant but because of the head mater waiter who was patiently attentive, I gave 3 stars. He was kind enough to give us a chance to take a photo of being inside of the special place.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oamfBJxN2V-l1t0XAi54Rg"
  },
  "UKBNJj1WsmlrvhUU-whT2A": {
    "date": "12/3/2011",
    "text": "I wasn't expecting too much aftter reading the various mixed reviews about this place. I came with an open mind in any case and wish I could've rated it higher, but in all honesty the food although very good quality was, well, a bit boring particularly given the apparent status of the restaurant. The miniature cheese choux pastries were very nice, but the starters were not tantalisingly explosive in any way, a bt of a dud if I'm completely honest and then the mains were quite underwhelming. I had a white fish dish and although a broad range of flavours and textures showed off the talents of the chef, it didn't demonstrate a level of inventiveness or special quality in making that dish anything other than just adequate. I was particularly looking forward to the dessert course but again it undelivered. In terms of food, perhaps the only savng grace was the extensive array of petit fours that accompanied our coffees. A nice selection of macarons, chocolates and toffee, and because we couldn't eat them all, they doggy bagged it up for us to take home.Lovely friendly staff however, but I can honestly say I won't be back.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_P4QuJVnDh9W35S7nKo4hw"
  },
  "vGpWhtQEVllkKjbjAE20xQ": {
    "date": "7/31/2011",
    "text": "It's a really beautiful restaurant with fantastic service. I went there for my birthday lunch and did the 3 courses. One of my favourite things there were the warm cheese bread balls that are free. Though the food was cooked to perfection, with the highest quality ingredients and flawless presentation.... Really cannot falut anything.... It just wasn't exciting and didn't have that wow factor for me. I guess I expected a bit more as it has 3 stars. One flaw was that the lady serving my sister her plate had her finger in it, which was quite gross... I would recommend going there for a 3 star experience, maybe try the set menu if they have that on offer. It seemed like the other people there went there to be seen than to enjoy the experience...",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c19uPydfSPSThD30W3cO9Q"
  },
  "p_s7SIO4vELXRORvJH1c7w": {
    "date": "12/15/2012",
    "text": "The consistency along with great food is what I would like to compliment.   It is difficult to get disappointed and find an imperfection here in Alain Ducasse at the Dorchester. The ambiance, service and the food prove that it's a three Michelin star restaurant. I had chef's tasting menu.Soup in an egg shell ( forgot the name ) was very goodWhipped creamed butter served with bread was amazingLobster with omadin sauce was fantastic, my favourite of the dayAlthough I didn't had much, the selection of fromages was greatI will surely go back if I had chance and recommend to anyone",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFSXYiPSUVCy0JBXYnklxw"
  },
  "KGCFfeG-CPVy0E1QZWFxWA": {
    "date": "1/31/2013",
    "text": "Wanted to impress my new girl here and it worked. The restaurant is amazing, the food is great. Perfetc for a first date.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTJPKLMSq1JC07jPwttnyA"
  },
  "ODVKArTWYeZ5Hsjof98sXw": {
    "date": "6/7/2010",
    "text": "The atmosphere of the restaurant hits you like a smooch from a well-attired grandmother - like the Dorchester itself, this place is styled like a sybaritic 1930's mansion, and stuffed with tradition, and I mean tradition, pronounced with a capital F. I won't say it's not welcoming but it's welcoming in a somewhat reserved subdued manner, a bit like a rich distant auntie's house, rather than wholly charming. The staff were impeccable, and one can feel the sense of tradition and service running through their veins, which is truly commendable. The food is where the evening slips downhill a little. The petite little round puffs were delightful as were the first few dishes (we had the tasting menu). But towards the middle, one can sense that each dish is going to be more of the same, rather than reaching towards a crescendo. It is undeniably good, but not quite as good as, say, Akelarre in Spain or Facil in Germany. We had a nice Margaux for around £100 and that's about the cheapest decent claret we could find. Overall, this is a place where one should take a rich relative for dinner, especially one who's considering including you in his/her will (if I have any, which I don't), rather than a sweetheart. Be prepared to open your wallet wide and I hope your credit cards can take the strain. The other question is: is this place really worth 3 Michelin stars? All I would say is that the criteria they used here to give them the 3 stars would seem to be different than some other 3 star places I've known.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rt-_fc9ScucMdiVWcsRdGw"
  },
  "GbHcKZF-bneDKhi0i4_PWw": {
    "date": "7/11/2010",
    "text": "Walking into the Dorchester is always walking into a world of craziness... Even on a Wednesday lunchtime, there were paparazzi outside fighting over who got to be closest to the ridiculous and expensive looking cock extension that someone was emerging from. The Grand Dame of London's grand society hotels, it now has the propensity to resemble mutton dressed as lamb, like someone has taken an elderly but refined lady and dressed her as a high end Russian call girl. Anything that doesn't move has been plumped up, gilded or had a mirror attached to it.There are multiple restaurants throughout the Dorchester, breathily calling their opulence out as you walk down the Promenade in the centre of the hotel. You can also 'enjoy' afternoon tea along this boardwalk though quite why anyone would choose to enjoy afternoon tea along this stretch, somewhere between Brighton Pier and an explosion in Harrods, I do not know. They have awards though (so I've been told) and there's a better chance of seeing who's just climbed out of the shiny mid-life crisis in the front. But there's the rub. The people here aren't having a mid-life crisis, or even spending their children's inheritance. They're here, from around the world, because spending £36 on a cup of tea and some cakes is perfectly normal, and dropping a ton on lunch for one (without wine) just isn't something that you think twice about. It certainly isn't worth some of the prices you'd get charged but the overall experience is perfection - and people will pay for perfection.After the gold explosion of the lobby, the (relatively) understated calm of Alain Ducasse came as a blessed relief, I felt like my eyes could breath again. Aside from the floor to ceiling crystal shower curtain (a six person V VIP table separated by a crystal sheet and few quid on the bill), the tone is muted light wood and grey anonymous elegant. After the overblown opulence of the adjoining corridor this is definitely in it's favour. The parade of inevitable extras started as we sat with herb parcels in filo pastry, in size and texture no different to warm Scampi Fries, deliciously salty and very more-ish though. These arrived along with a selection of perfectly seasoned choux pastry puffs. The black pepper variant was especially successful. An amuse of heirloom tomato mousse was less inspiring though a handy palate cleanser. Oddly despite the prices, four items on the short menu came with hefty £10 supplements. My Scottish LANGOUSTINE salad with coral jus (their capitalisation, just in case the oligarchs don't get the main ingredients...) was one of these. Assuming a £20/£35 split on that £55 set price for two courses, that supplement brought the salad to a punchy £30. Don't get me wrong, langoustines that do well at school pray to end up on a plate like this. Some of the sweetest shellfish I've ever had, with an earthy jus served over strips of seasonal vegetable. The dish worked. But for £30, I don't know what else it could have offered, short of trained prawns that danced their way out of the pot and onto my plate. Will stop whinging about money now...I followed this with the roasted rib, saddle and kidney of MILK FED LAMB, served with perfectly cooked, roasted purple artichokes and new potatoes and a scattering of soft garlic croquettes. These were a revelation. The size of jelly gums, they yielded a perfect soft garlic infused paste under their crisp shell. The meat was cooked medium and fell apart. Technically one of the finest takes on this dish I've had, with a wonderful clarity of flavour. The Flying Manc had the roasted native LOBSTER, seasonal vegetables and macaroni served as a tiny raft of gratinated tubes. Again, simple perfection in ingredients and preparation. The showmanship ran through to the array of petits fours served with our coffee, macaroons, tiny dark walnut studded chocolate nibs and a variety of chocolates and sweets. One of my hosts ordered a lemon verbena tisane, the leaves cut from the plant in front of us, served with a sense of theatre. The service throughout was flawless, in every sense of the word. The staff were attentive, knowledgable (the Pinot Noir selected as an accompaniment to my lamb isn't what I would have picked, but worked a treat) and unobtrusive. There is a discernible, hugely positive difference between here and many of the one star restaurants I've eaten at. Does the restaurant justify a third star? I couldn't say I was competent or experienced enough to judge that, but for all elements it was a meal striking in its perfection throughout, the clientele were certainly happy to pay for this perfection, and I was honoured to eat it (even if I won't necessarily be taking my own wallet back there..)",
    "rating": 4.0,
    "rated": {
      "useful": 4,
      "funny": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "VjHlcGVNWAiwSe5sjoYTUw"
  },
  "LW_9ApDWoXXfGE9gw0yQbQ": {
    "date": "5/17/2010",
    "text": "Alain Ducasse at the Dorchester is one of London's most fancied restaurants, having obtained its third Michelin star in 2010 only a year after being awarded its second star.Alain Ducasse is a typical Michelin awardee ... it serves high end French food in a suitably formal setting. Since everybody in there were in black suits and evening gowns, i had to be careful to ensure that i didn't ask another patron for the wine list, by mistake :)The restaurant is big with the tables widely spaced out in the area. I am sure they could increase their capacity by a factor of two by just moving the tables closer together.For starters i had hereford snails in parsley butter, with potato gnocchi and bacon. The snail was good but i didn't enjoy the combination too much. Why did the chef choose to include gnocchi in this dish ? I ordered this because i had never tried snails before. Next time i will probably stick with something more conventional.For the 2nd course i had Seared fillet of sea bass, celeriac and \"matelote\" sauce. This was divine ... especially the sauce made with red wine. One of the best fish preparations i have ever had.Next i had Roasted farm house veal loin from Limousin, \"blanquette\" vegetables. Again, very well cooked. The vegetables held their own  against the meat in my perception ... thats a big achievement given the carnivore that i am.In between the courses i kept stuffing myself with a variety of french breads (including one made with bacon which tasted very good, though not of bacon) and butter and cheese. So even though the quantity of food in the primary courses were not overtly high, i left full.The service was exemplary, except for the fact that i wasn't offered the list of wines by the glass until i asked.The a-la-carte menu here offers a number of alternative selections starting from as low as £55. But one needs to keep in mind that one shall invariably end up spending much more (champagne, wine, water, coffee etc). But still this brings the prices down to a much more manageable level. They served me a selection of complimentary chocolates and cookies at the end, and i went home a happy man :)",
    "rating": 5.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "E3y5MW_YFnlmvvagjBt_Xg"
  },
  "uFYDG4D2l2oPjX9bwA-m7A": {
    "date": "6/4/2010",
    "text": "We had a grouo corporate dinner last night in the private dining room.  There was little in the evening to distinguish from most other restaurants at this end of the table.  Things like service and presentation were all suitably excellent.  Kudos to the staff.  The food though was mostly unmemorable.  The amuse bouche probably was the best.  A spicy broth with two tortellini.  Truly delish and everyone emptied their small bowls.  The starter of mushroom voloute with a chunk of pate was also tasty but a little too rich.  The scallop which followed was weakly cooked, under flavoured and unmemorable.  There was a delish stuffed spinach package on the side.  The main of beef was...well...beef.  Well cooked but again underflavoured.  The plate was dotted with other tasteless bits, and thin fried potatoes that were greasy and...underflavoured.  Dessert was a chocolate cake with a salt ice cream on the side.  Tasty and the ice cream one of the most creative bits of the evening.  Macaroons followed which were leaden.  About the worst I've had recently, including from such chains as Paul.  Tasty chocolates on the table.The net of it is that it all works as an experience, and the prices are needed to support the army of staff and the sparse room, but that it is a safe meal not one that will educate or inspire you.Exemplary - staff, service, presentation.  Great",
    "rating": 4.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_LBYI6b40_U_jZBG53zSPg"
  },
  "Y_NMbQFW21nyJr_jqG8g5Q": {
    "date": "2/23/2010",
    "text": "It was a crisp cold mid-day and London was showing one of its rare atypical sunny days with partial clouds. While sitting in contemplation at a wake for a recently deceased friend, my lady friend asks me if I had brought an appropriate evening suit with me.  And my reply was, 'Of course I did.  What?! Did you think I was some itinerant American tourist?' Five hours later, after a quick side trip to Jermyn street near Savile Row, I was suitably attired in a navy blue evening jacket and standing in front of the Dorchester.  Thank you Amex Plat card for saving my social butt.This establishment of Alain Ducasse is one of the premier foodie mecca.  Its white glove service defines modern luxury and elegance in every detail from the leather decor to the formal dress and tie of the wait staff.I opted for the tasting menu starting with the Scottish langoustine in leek and potato garnished with truffles.  A brilliant variation on a staple dish.  The lady had the cep mushroom veloute that I sampled.  Totally creamy and decadent. The endless bread basket was filled with wonderfully crunchy crust with soft pillowy centers.  Combined with the rich butter, it's very hard to refrain from eating too much of it.  My entree was the roasted rib and fillet of venison in a grand veneur sauce served with endive, chestnuts and quince.  The sauce was rich and savory but did not overwhelm the balanced gamey flavors that I really love from the venison.  We wrapped up dinner with some selected cheeses.  Dessert was a hazelnut souffle with poached pear in a citrus sauce.  The procession of trolleys that rolled up afterwards offered everything from chocolates and candies to infused tea's and espresso's.The wine pick was the 1999 ch Montrose.  Once decanted, it offered a beautiful bouquet of currants and dark fruits with firm tannins.Truly a memorable evening to lift the spirit of any dark mood.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 5
    },
    "photos": [],
    "user_id": "W4LbhU_wABFABBZIqBV-lQ"
  },
  "vbnfTkJmxD5xR6MxH-tV6A": {
    "date": "10/19/2010",
    "text": "The night took off to a very nice start. The interior is very romantic, staff seemed to be very professional. The menu had two or three tasting menu's, as well as the option of choosing a three course meal, with indication of Ducasse's signature dishes. Unfortunately there were no signature dishes on the tasting menu. The food was largely excellent, the service had flaws though. The menu was also very expensive, and the wine list, previously picked by the sommelier (you have no influence on what you will drink) is available upon request, and you do not know the cost, or what you will drink. It is also incredibly expensive. I don't regret going here, but I would not go back.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6DT_dV46WEqm7CUZvlGodw"
  },
  "uuDwAHMt12-Zz40TaBgSGQ": {
    "date": "6/6/2011",
    "text": "I really, really do not understand how Alain Ducasse @ the Dorchester has 3 stars, when it is leagues behind Le Manoir, Le Gavroche, and many others with less stars. The crystal curtain area is vulgar, the rest of the decor far too beige/hotel dining room. Food is really nice, although portions are small. I have eaten here twice, and actually can't remember what I ordered, which upsets me- spending 150 a head on dinner, just to not remember it is not good! I think Ducasse just doesnt know who to appeal to.",
    "rating": 3.0,
    "rated": {},
    "photos": [],
    "user_id": null
  },
  "titP3NSiK2gVvvau44lySA": {
    "date": "2/7/2016",
    "text": "Wow!  The tasting menu is consistently amazing here.  Yes, is outrageously expensive.  But you will experience a \"foodgasm\" that is among the best in the world.  It has been my experience that celebrity chef restaurants are generally not worth the hype, but this one lives up to its lofty reputation.  For a special celebration, there is no better place in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jht8X9w__fe10IwtYTyPSw"
  },
  "u_kB4USXGzBZI3wPhNHZuA": {
    "date": "11/30/2016",
    "text": "Wasn't bad, but really disappointing for three Michelin stars. The basic spiel here is that this is not an experimental cuisine, but flawlessly executed French standard. Ok, great. At 3 stars, it should be flawless regardless of what I order.We had the 70/head festive lunch menu. Starters were pretty amazing, definitely a highlight. The main course was boar and in my opinion it was dry and overly oniony and the desserts, while good, really nothing to write home about. The paired wines were pretty amazing too. So if the main and desserts would be on par with starters and wine, that would be something. But they weren't. They also passed some sweets bonbons that were not much either. And then we ordered an espresso and they brought me an inch of liquid.  Now, while I might just not be sophisticated enough to judge the cuisine properly, to mess up with coffee and bring me an americano from substandard beans is really below any number of stars.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "v5zvvNTGNhINIphtrAogAg"
  },
  "R0u2LC0bgur7CfYrbJSICQ": {
    "date": "12/17/2013",
    "text": "The best meal I've ever had, I'm pretty sure. I went for the festive lunch (65 pounds for 3 courses and 2 glasses of wine). I never spend this much on food normally, but it was a friend's birthday and I wanted to eat at a 3 Michelin star restaurant, so I went for it!The ambience was nice, the service excellent....ok, now let's talk about what really matters: the food!Course 1: Chestunt veloute with bacon and snails. THE BEST DANG SOUP I HAVE EVER HAD. Period.Course 2: Fish of some sort? Can't remember exactly, but I know it had chestnuts and israeli artichokes. Course 3: Yule log.Washed down with 2 glasses of superb wine. The meal also came with bread, cheese puffs of some sort, butter, chive sour cream, macaroons, petit fours, and caramels.Pro Tip: Don't make the mistake of thinking the champagne can be substituted for a glass of wine. We did, and it cost us a pretty penny.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HDQjLgm0u8WwlkQU6oHmqw"
  },
  "CpawjQl3XHFNg7tOUgUX8Q": {
    "date": "1/27/2015",
    "text": "Alain Ducasse, you surprised me! My parents got me a restaurant voucher for Christmas. (Well they told my partner to get me one, and this is where he chose it.) So we came here recently to give it a try.The decor is weirdly gorgeous and not what I expected. For some reason, I was expecting the classic decor of the rest of the hotel, but walking into Alain Ducasse, everything was slick and modern. It also made me really excited about trying the food.So in winter months they do a black truffle tasting menu. It's not cheap, but we're suckers for black truffles, so we went all in. We assumed since this may be the only time I eat here, we might as well make it memorable. And memorable it was. We also got wine pairings for the courses.They start you out with a pile of cheesy choux buns. They claimed there were three types: cheese, black pepper and paprika. But mostly they taste of cheese. And they tasted delicious. They also gave us some bread with salted butter (that looked like a lobe of garlic) and some whipped fresh cheese spread that was pretty fantastic. (At least for me).First course was langoustine with truffle. And it was delicious. The truffle was really subtle, but the chopped vegetables and pickled onions with it were heavenly. Second course was foie gras ravioli in a broth. The ravioli were decadent, but that broth was exquisite. It was tasty, but left your mouth feeling a bit prickly afterwards. But it didn't seem spicy, but your mouth felt like it was at the end. And hey, more truffles is never a problem.Third course was potato with truffles and a truffle sauce. Also tasty and a big hit with the two of us.Fourth course was a sea scallop with endive. Probably the best course of the night. More truffles and the endive was really sweet and delicious. Not at all what I expected from seeing the dish, but really fantastic.Fifth course was chicken. Nice, but the chicken was a bit overcooked. Really flavorful though and more truffles. Sixth course was brie de meaux with a truffle filling. My favorite cheese with truffles? You really can't go wrong. And the bread they served with the cheese was amazing. Really fantastic.Seventh course we got to choose a dessert from the menu. I had the signature rum baba and my partner had the grapefruit souffle. After ordering the baba, they brought out a tray of five different rums that I got to smell and learn about. I got to pick one for my baba, and I went with the spiced rum. It was fantastic. The bread was delicious and the cream they served it with and the rum. I was already drunk at this point, so this probably didn't help, but I was in love. My partner preferred his souffle, and it was nice, but I was in Rum heaven.We definitely splurged with the food and wine. Oh did I mention the wine? Really delicious wine pairings from around the world. We had a Madeira with the cheese that was fantastic. Not sweet at all which was a surprise. And the 1996 Sauternes with dessert was a treat. I kind of expected it to be a bit over-hyped and not worth the three stars like a certain other restaurant in the area, but it definitely is worth it. I want to go back and try other menus now, and that is always a sign of a good restaurant. If you're looking for an amazing restaurant (in London and not slightly outside of it), this is definitely one to look into.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "t8aJIHxkutRlWMRNSvpq6w"
  },
  "Zj1xlWf60nI0_-Xr26RsXg": {
    "date": "5/26/2016",
    "text": "If I could give less I would.  I've had a reservation for over 2 weeks without a phone call or email and  as requested, I left my email address. When I showed up they said they \"tried to contact me\" but had let my table go because they could not confirm. I am traveling from the states but have made other reservations without ANY issues. Could not be more disappointed especially since this was our engagement celebration dinner. I guess my only true recommendation of the restaurant is to make sure you contact them personally to confirm.",
    "rating": 1.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dCwAsAtpHLZwgVQJQeNGw"
  },
  "tpQZOCJH0nYtEuij9RSN5Q": {
    "date": "9/28/2016",
    "text": "Excellent service and perfectly executed dishes.  However, I can taste the butter in many of the dishes.  In contrast, many other top restaurants (including the French restaurants, especially the ones in Paris) have elevated their cooking to highlight and condense the flavor of the ingredients without having to overly rely on butter.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6eQn1AX9BZmrVGowgEtxA"
  },
  "DfLvAQzhAwZ8QUyTz8j-pA": {
    "date": "7/11/2015",
    "text": "4.5/5 but I just could not give it the extra .5 star to rate it a 5. Our group of 3 did the regular 7-course tasting menu and the discovery wine pairings. Since we were made up of 1 recent grad, 1 college student and 1 grad student we chose the lowest tier of wine pairings but weren't disappointed. All 7 wines were great and the staff very helpful as some of us were less knowledgeable than others. There was maybe one wine towards the end that was just ok, but I didn't feel cheated going with the lowest wine tier.All of the food was prepared perfectly and we enjoyed every course. No complaints here. The staff was excellent, and did not detract from the experience at all. We were obviously not the target clientele but were not treated as such except for being seated in the raised area, but that wasn't a big deal. At night the main dining room definitely looked more cozy and immersive, so try to request a table there.While we enjoyed every course and all the food had great flavor, it just seemed a little too constrained. I can see why it has 3 Michelin stars, the restaurant is consistent and everything goes smoothly, but I feel to really crack the highest tier there could be a little more experimentation in the kitchen. None of the dishes made me think, \"wow, I would never have thought of using x and y together, this is amazing\". That's the only reason I can't give it a perfect 5, but don't let that keep you from going.It is a perfect spot for a fun evening especially if your party enjoys food and wine. The service is excellent and the food and wine are executed to perfection. Definitely worth going out of your way if you are in the London area. For true food snobs, you may feel that it's a little too safe, but I recommend it regardless.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5L5EoB8fGZ0zA2DKJ6oy4g"
  },
  "2oksxwkxfHlVEU90J2bh3A": {
    "date": "7/25/2014",
    "text": "Items Experienced:GougeresPassion Fruit, Apricot, and Hibiscus PunchBacon Focaccia and Scottish Soda Bread with Farmhouse Butter and Whipped Crème Fraiche SpreadCereal Sesame with Herbs and Epi BaguetteBlack Olive and White BaguetteScallop/CaviarScottish Langoustines - minestrone brothSeared Foie Gras - Black CherriesNative Lobster - Peas, Spring Onions, Country BaconRib and Saddle of Aveyron Lamb - Baby Artichokes, Wild Garlic, Almond ButterComte Garde Exceptionnelle - cru 2010, black truffle puree, rocket, white and wheat crispsColston Bassett Stilton - oatmeal cake, fruit chutney, fruit bread\"Dessert Napkin\"Petit Fours - Chocolate, Violet, Lime Verbena Macarons / Madagascar Ganache and Creamed Coconut ChocolateBaba with rum according to your choice, lightly whipped creamRaspberry Souffle - Raspberry SorbetMignardise Trolley - Strawberry Pistachio Tart, Cocoa Raspberry Opera, Brown Butter Financier / Vanilla Religeuse, Canele, Chocolate Caramel TartHaving spent nearly three hours of America's birthday enraptured in lunch at Pollen Street Social it was perhaps a bit of overly aggressive planning that led me through the doors of the Dorchester just after eight o'clock yet with a footman guiding my way through a heavily flowered lobby en route to the 3* Michelin home of Chef Alain Ducasse I could not help but feel enchanted - an emotion that would endure throughout the night.  Considered by some to be the greatest chef of his generation and known for signatures such as the cookpot and baba au rhum it was to expectedly formal service that I was greeted at restaurant's double doors and with reservation confirmed I was led to my table, a spacious two-top draped in white linen with a full view of the room.  Surprisingly not fully booked for the evening and appearing all the more spacious given the square footage between tables it would be mere moments before the sommelier approached and with champagne declined in favor of a fanciful fruit cocktail my first bites arrived, a platter of nearly two dozen gougeres serving notice of opulence to come while simultaneously resetting the bar for cheesy puffs of choux.  Well tuned to small details throughout the evening and never once failing to acquiesce to any need or request it was only after drink was in hand that the menu was finally delivered and with options ranging from a la carte to degustation it was without hesitation that I ordered the menu d'ete, a £180 tab well justified in the season's very best ingredients presented in portions quite generous.  Truly a tasting menu in the grand tradition with precise plates focusing on only a few superlative ingredients eventually giving way to more complex flavors finished in tableside sauce it was entirely without fail that five savory courses sailed by and with both the foie and lobster particularly impressive things would only ascend from there, my keen interest in the aged Antony Comte giving way to an accompanying gift of Colston Bassett Stilton every bit as impressive as 48-month old Garde Exceptionnelle.  Renowned for fantastic finales and offering them in excess it was with \"Dessert of your choice\" followed by \"mignardises & gourmandises\" that my meal would end and having debated soufflé versus baba over several hours the decision became clear when the maitre d' said \"both,\" yet another unexpected gift and one I accepted without guilt from a team whose concept of customer service seems to know no end.",
    "rating": 5.0,
    "rated": {
      "useful": 6,
      "funny": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "myvlpj7_foOSSzKDE6jfJw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Scallop/Caviar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/myvlpj7_foOSSzKDE6jfJw/o.jpg"
      },
      {
        "img_id": "RXiNWdfQprtEpdZoWFk52g",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Farmhouse Butter and Whipped Creme Fraiche Spread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RXiNWdfQprtEpdZoWFk52g/o.jpg"
      },
      {
        "img_id": "PUQK9jt1_oe_gVZnDt-Vww",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Bacon Focaccia and Scottish Soda Bread with Farmhouse Butter and Whipped Creme Fraiche Spread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PUQK9jt1_oe_gVZnDt-Vww/o.jpg"
      }
    ],
    "user_id": "U4INQZOPSUaj8hMjLlZ3KA"
  },
  "S4iOasV3SO5-3x3gFbpZKw": {
    "date": "11/29/2014",
    "text": "My birthday dinner is usually an occasion for some decadent eating, so it was apt that we visited Alain Ducasse at The Dorchester.  It has a reputation as an excellent fine dining restaurant and has three Michelin stars.The restaurant decor is stylish and the service is top shelf.  There are tasting menu options and you can also order à la carte.  We opted for the Menu d'Automne which had a lot of tempting courses.  This menu was £180 per person.The courses were:- Scallop/caviar- Scottish langoustines, minestrone broth- Seared duck fois gras, figs from Provence- Line-caught turbot, cauliflower and confit lemon- Fillet of continental cross beef, agria potato and black truffle- Comte Garde Exceptionelle, cru 2011- Dessert of your choice (you could choose one from the à la carte menu)- Mignardises & gourmandises (petits fours, really)We asked for some recommendations about a bottle of wine to enjoy with our meal and I ended up choosing something which was nearly £200!  To be fair, it was a nice enough bottle of wine, but I don't think I would do that next time if I were concentrating a bit more.My wife loved the scallop dish.  The scallops were thinly sliced and arranged on top of a creamy sauce.  They were fresh and delicious.My favourite course was the duck fois gras.  I look back at the photo I took of it and my mouth waters.  The fois gras was so tasty and was obviously paired well with the figs: they were sweet and provided balance.The other courses were nice as you would expect, but not spectacular.  For instance, with the turbot course the fish was cooked 'just right', but there was nothing much else on the plate.  The confit lemon was the smallest slither of rind isolated near the side of the plate and the cauliflower was 'wafer thin'.  More style than substance.I had the pink grapefruit soufflé for dessert.  This is a no-brainer for me as soufflés are most definitely my dessert choice of the moment.  The tartness of the grapefruit helped to contrast the subtle flavour of the soufflé.A dessert trolley was wheeled over to the vicinity of our table, but not really that close.  I'm guessing it was too difficult to bring all of the way over, as our table was on a raised part compared with the main restaurant area.  The waiter explained everything that was on it, but it would have been nice to see the choices a bit closer.  By the time he explained what was available, I had forgotten most of it.  We both got some salted caramel sweets, but I would have liked to try some of the others.This is the most expensive meal we have had ever.  It was good, but it wasn't the best.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "raKDoMb-H_djJP97_A1Y1g"
  },
  "GFWXt4FlBj-xVshdG3X-Xw": {
    "date": "8/6/2013",
    "text": "Visited this place back in February of 2013.  I ordered the tasint menu and I'm only saying this place is three stars just because I found the food bland.  I think it's probably more my american taste versus english/french taste.It was very enjoyable outside of that.  Great service... friendly staff.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fyl4bt9ULgWstqdgTIyBeQ"
  },
  "nm7AtzG_dHUUbmH-RqeIxw": {
    "date": "9/9/2017",
    "text": "My wife and I went to Alain Ducasse as our \"blowout\" meal of our trip to London.  We ordered a fixed menu with premium wine pairings, and the quality of the food and wine were everything we expected. Unfortunately, the service did not meet our expectations.  We were seated in a high-traffic area next to where the wait staff got their utensils, which meant wait staff went back and forth right by our table the entire meal.  The wines and food courses came very fast, to the extent that they were being served on top of each other.  Finally we asked both the waiter and sommelier to slow down.  The waiter then slowed down the food delivery dramatically, to the extent that the sommelier served the wines long before the food, and the wine was usually drunk (and sometimes the wine glasses were even removed--surprising for the amount paid) before the accompanying food course was even served.  The sommelier seemed largely unresponsive to our comments, and did not seem to care that we had no wine to accompany our food course.  In general it was hard to justify the amount paid, given the service problems.",
    "rating": 2.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pv8tK_rpmhlfoGWex3OytA"
  },
  "JtyE3TLuuB4mCvURt1kJjQ": {
    "date": "6/26/2014",
    "text": "I dined here by myself and I absolutely loved it. The service was superb and the food was exceptional. I chose to do the seasonal tasting menu and the special wine pairing. The funny thing is that after traveling through Europe (spending most of my trip in France), I noticed that London had the best wine lists and options. Everything about the evening was excellent, and I really hope that the next time I visit, I can reserve the special private dining area behind the sparkling curtains. It looked so luxurious! Overall, great experience here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "WsYSdX_0Y8Vjsp4jOvqTpw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WsYSdX_0Y8Vjsp4jOvqTpw/o.jpg"
      }
    ],
    "user_id": "GiC_S3Hhfh02Yy6c9prDvg"
  },
  "swYJxDGnZP2rGl0KsqhL5w": {
    "date": "1/2/2017",
    "text": "Visited for dinner. Impeccable service and food. It exceeded my expectations of a three Michelin star restaurant. Will come again.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yFvcSlv0shI_UhIqoH8aSQ"
  },
  "IW2LBVIoazZJd6N247Qugg": {
    "date": "4/17/2012",
    "text": "I'd have to say that my meal at Alain Ducasse was one of the highlights in terms of fine dining. Going in knowing the reputation and Michelin-star status of the restaurant, expectations were high!We opted for a la carte instead of tasting mostly because we didn't want to stuff ourselves at lunch. You'll notice that there's a £10 supplement for at least one dish in each section (starter, fish, meat) which tend to be signature Ducasse dishes. Worth the extra money in my opinion. Upon arrival, you receive a bowl of gougeres (French choux pastries made with cheese). These were light, fluffy - I particularly enjoyed the paprika seasoned ones! Our amuse bouche of Dorset crab and lobster velouté which came in this adorable egg-shaped bowl was rich and flavourful. You could taste a bit of saltiness coming through, but the crab itself brought sweetness.My starter of poached lobster with homemade pasta and chicken quenelle - reminded me a bit of surf and turf! The pasta was al dente, the lobster was juicy, and the hit of truffle in the quenelle really brought the dish together. Mmm. My main of vension was very simple in presentation with caramelised vegetables. The meat was perfectly cooked (on the rare side) - when dishes are simple but still manage the \"wow\" factor, you know it's something special. The halibut with citrus meuniere sauce is DELICIOUS. Anyone who's a Masterchef fan would have seen it earlier this season - it's THAT good. The firm and meaty texture of halibut garnished with squid was really special. I always find dessert the most difficult decision - but we opted for a Ducasse signature , the RUM BABA, and the Chocolate soufflé with vanilla ice cream. I really enjoyed being able to choose my own rum - going with the Millennium it wasn't cloyingly sweet or too strong. The soufflé was stunning - dense dark chocolate with a surprising crunch inside. The maitre'd told us that there's a chocolate biscuit inside to bring texture. Then imagine pouring just over a shot of rum over fluffy sponge cake and then adding vanilla cream...that was my rum baba which left me a bit tipsy by the end of the meal! It was a nice touch to have macarons, chocolates and chocolate covered almonds as a finish to the meal. I have to say that the macarons weren't as good as I expected, but the hazelnut praline chocolate was addictive.Not a cheap meal by any means - came to around £110 a head, but it's definitely three hours of great food, and attentive genuine service. Absolutely worth a go.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Ock0Po7NCGbi7IEay4qp_w",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Rum Baba",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ock0Po7NCGbi7IEay4qp_w/o.jpg"
      },
      {
        "img_id": "0gMJtKxHBcAn1Y0KiCbp5A",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Chocolate souffle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0gMJtKxHBcAn1Y0KiCbp5A/o.jpg"
      },
      {
        "img_id": "ZmhvlmRBk9JrsMZ_MKtc4A",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZmhvlmRBk9JrsMZ_MKtc4A/o.jpg"
      }
    ],
    "user_id": "TE0WdwJscofrN73gdA2rew"
  },
  "ousjlSl1iQC9DW7VSl4GCg": {
    "date": "4/7/2014",
    "text": "I went here or my birthday and it was a great meal. I wasn't feeling too on top of the world due to being ill, but the menu was varied so there was still  a lot of tasty things I could choose from. The waiters were fun and really chatty, but not too in your face. Nothing worse than a waiter who doesn't know when to let you eat!! It's lovely and spacious, and the interior is very elegantly designed. I have been back since, and will go back again as it never fails to impress.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "NO9t3B8PyHTM7svhCOYXcg"
  },
  "l0d4XOH3vY7t_YIk-KbagA": {
    "date": "10/29/2015",
    "text": "Utter rubbish Bling, tasteless, gimmicky service and setting.Clueless sommelier.Mediocre food.Should not have one Michelin star. Just proves the Michelin guide is rubbish now.When the guide was run by the board of the tyre company this would not even have been listed.I have eaten in more than 15 different 3 star restaurants and frequent several regularly but this one is a Joke. Several of my foodie and restaurateur friends have been and have the same low opinion of this rip off place. Go to Le Gavroche and find out what fine dining should be like.= Expensive but worth every penny...Ducasses Dorchester Disaster is pathetic.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qk490rPyTGIrg2oTb_IxwQ"
  },
  "NgYW0FC2L-_lhgHsdGwNpQ": {
    "date": "5/22/2013",
    "text": "Soft lighting, beautiful decoration, fantastic service and possibly the most delicious and prettiest salad we've ever seen.The tables were a little too wide to lend it an intimate air and the ones lining the bank of the wall, where we sat, were a little too close to one another for a really romantic note to a date.I admit the food was good, but not so sublimely delicious that it was out of this world - there has been plenty of other restaurants which had better food for much less of the price.I ordered the Dorset crap two ways for starters - this was interesting but it didn't strike me with a wow factor. The first thing that hit me was the smell as soon as the dish was set in front of me - it reminded me of fish markets because it was just SO smelly. The two way concept of this dish was that one side was warm - this was appreciable. The second side was cold, and that confused me a little because it was just layers of first a jelly substance, then followed by an avocado paste of some sort with a little bit of crushed crap meat in. Something else unidentifiable was lining the bottom. It just tasted sort of strange to me.....My husband, on the other hand, ordered the raw and cooked vegetables, which I was very sceptical about at the beginning - let's face it, you can do the veggies at home....But once it arrived, this was quite possibly the most prettiest salad I've ever seen! Everything was rolled into sushi-like rolls, in an array of bright colours and each roll was a different arrangement of various vegetation. It was simply delicious!We both ordered the Rossini dish - but I was very pleased to see that it was NOT as good as our local restaurant (Key-West @ Oberieden, Switzerland). The filet of beef was just not as tender and the foie gras was too heavy and was not grilled enough. The sauce was also abit too peppery for my liking and they were not so generous with it either.I do love the stiff white table cloths and the pale pink napkins though. The place was just immaculate and it's just sometimes nice to dress up to go out. There's also no view and even less windows, as it sits right bang on the Hyde Park road.....However, I don't think we will visit again.....",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZIslTKT4qe1dn13q5ordZw"
  },
  "QWyRiL8uJoPwYKFQFr2bmA": {
    "date": "9/22/2013",
    "text": "Beauty within the beauty of the Dorchester, which is probably the fanciest hotel I've been in. We came for lunch on our last day in London and while not cheap it is quite a steal if you think about it - 1/2 bottle of water, 2 glasses of wine, and 3 courses plus an amuse prior and so many lovely treats to accompany coffee afterward. Service here was the best of our Michelin adventures on our trip to London, Paris, and Barcelona.Everything was prompt without being rushed, polite without being snooty.We started with an entire plate (pyramid, really) of choux pastries filled with cheese. Yum, but we barely made a dent on this plate. Then came about 8 different types of bread to choose from with amazing butter and a whipped cheese spread. I avoid filling up on bread and butter at meals but I couldn't stop, the bread and butter were just too good!I got the escargot with wild mushrooms and cured duck breast, hubby got the poached egg. Can it get better than fresh mushrooms sauteed in butter? The egg was nicely done with an herbed crust on the outside.Mains were lamb medallions with turnips and shrimp over fresh bowtie pasta. Sounds simple but both had incredible sauces. Desserts were a chocolate bar with hazelnutty taste and crunch (think Ferrer Roche) with a grapefruit sorbet and the vacherin, a strawberry dessert that was divine.Accompanying our delicious coffee were a small bowl of macarons (7 mini ones, and yes, we ate them all), 6 rich chocolates, dark chocolate dusted almonds, and flavored caramels. We left only some almonds and the caramels. I was tempted to take some caramels for our train ride but refrained. I'm sure they were just as amazing as everything else.I noticed several reviews saying the food was bland or just good. I thought it was way better, but my taste has always been drawn to bringing out the best of the food item without trying too hard. Alain Ducasse does just that - no, it's not the most creative or flamboyant. But a darn good meal that just makes you feel happy!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Woz6aKAwoSqsCv0JLc8vsw"
  },
  "WcEv9V3Pdv0-wSZudTqvNQ": {
    "date": "11/23/2014",
    "text": "We had the 3 course menu with wine, and while it's not cheap (a 3 Michelin star restaurant never will be!!), it is incredibly good value for money. Little extras are served between each course (including gorgeous savoury choux pastry balls), which really make the experience special. My vegetarian main course was absolutely stunning - by far the best meal I have ever eaten. I usually prefer cosy eateries over pretentious restaurants, but Alain Ducasse's food is simply delicious, and while the atmosphere is formal, it is also very comfortable in every sense of the word. My partner and I couldn't stop laughing because we enjoyed the food so much, and the staff were kind enough to give us a tour of the kitchen afterwards.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bRhsEMuHR8OPUudJZkFQsA"
  },
  "Hu7mK3kXF1ckGyuUEnQwcQ": {
    "date": "11/17/2012",
    "text": "Perfection. Really amazing food and experience. I feel so lucky that I got in for an amazing dinner. The staff thought of everything and thy even packed some cookies to take home to my daughter.Every trip I have to London will include a reservation here.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c8YOUQ1Lz645fopLMNEAnw"
  },
  "o_sZWQChXcYFfPO2Fw7QfA": {
    "date": "8/1/2016",
    "text": "Everything I expect from 3 Michelin star and did not disappoint me. I had 3 course tasting course for lunch. I have been to handful of Michelin-star restaurants. Their courses had excellent combination of taste and presentation. I sometimes think some 3 Michelin star restaurants gets too carried away with fancy ingredients and in presentation and seems to have lost more global picture as a dish. I have truly enjoyed every course here. I highly recommend this place!!",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VUEPHF296cIAJ8M4MP7RGA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VUEPHF296cIAJ8M4MP7RGA/o.jpg"
      },
      {
        "img_id": "sdZxTnpVT5i4BVUOZzw4Lw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Frog leg! I have never had frog leg before, so wanted to try it. It was delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sdZxTnpVT5i4BVUOZzw4Lw/o.jpg"
      },
      {
        "img_id": "JIcO7uzKkxE4CMVBIaf2wA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Home made pasta with lobster, passion fruit and tomatoes. It was so delicious.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JIcO7uzKkxE4CMVBIaf2wA/o.jpg"
      }
    ],
    "user_id": "anSHdX40QTYVOrt2BfxqSg"
  },
  "Nsf4D5evx4ftmBP4e9sT8Q": {
    "date": "7/5/2015",
    "text": "Had it not been for the desserts, my rating would be a very solid 3. This was one of the first restaurants I had in London, and I can say I was extremely disappointed only because I have much higher expectations out of a 3 Michelin star place. Honestly, almost every item on the tasting menu was mediocre for a 3 star Michelin restaurant :( the best was the lobster dish- such an intricate play of different flavors, I was pleasantly surprised! Aside from that, my entire party was so disappointed with everything else. In better words, we felt the meal was really basic. Good food, but basic only because we had such high expectations. The Dorchester is an amazing place!!! The decor is beautiful, and we were able to get a couple of really great pictures in! Inside the restaurant itself, is a lit up crystal drop, which really brightens up the place. It was very dimly lit in there, which is not uncommon for nice restaurants, but my friend got reallllly really sleepy after a glass of wine haha The dessert is what I will focus on because it is the redeeming quality for this place. The berry sorbet dessert was SOOOOO good! After a disappointing meal, my friend and I weren't expecting much, but we both looked up at each other with surprise upon our first bites! The restaurant also gave us a chocolate dessert which I thought we were going to have to just take home as I was so full already. My friend and I took one bite and again, looked up at each other with surprise. We ended up eating the entire thing hahahah Part of the chocolate dessert (see my photos for reference!) was chocolate that melts in your mouth, and the other part was crunchy. It was a perfect combination and I definitely would go back only for the dessert (LOL). This was my FAVORITE part of the meal!As for the service, I really felt as if the workers were a little unprofessional. I understand there may be some type of language barrier as I am not from the UK, however the workers should definitely stay humble and kind to everyone. I saw a lot of whispering and snickering amongst the workers throughout the entire restaurant. All in all, food was good, but not great. If you're looking for 3 star Michelin material, GO TO ANOTHER PLACE!! This restaurant sadly isn't worth the price :(",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9xlb9gA6UhNdTUQUw_UKSQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. best part of the meal...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9xlb9gA6UhNdTUQUw_UKSQ/o.jpg"
      },
      {
        "img_id": "infhAalYkc4ZFOg3OFDw7w",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. SO GOOOOD! :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/infhAalYkc4ZFOg3OFDw7w/o.jpg"
      },
      {
        "img_id": "DL897Nx1VwPiXx-0GAj5_g",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Macarons and truffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DL897Nx1VwPiXx-0GAj5_g/o.jpg"
      }
    ],
    "user_id": "oHfbwvDLWfE9MaioV6YJTg"
  },
  "GD-z63V_uZcvxcqU-kS7fQ": {
    "date": "7/29/2017",
    "text": "On our recent trip to London, my wife and I were excited to have booked a reservation at Alain Ducasse.  After all,  a 3 Michelin star restaurant in the heart of London is an experience one does not encounter often.  We kept vigil over the availability of online booking for literally 6 months in planning this event until we were able to place our reservation request.  Granted,  this seems excessive but such was our desire to make sure that we did not squander an opportunity for a fine night out.Our night started well.  We both ordered the tasting menu as we are apt to do in restaurants of this caliber.  Initially, the service was what you would expect,  attentive and overlapping bordering on the excessive.  Normally, this isn't our expectation but premium service is a defining characteristic of a Michelin starred restaurant and I would be hard pressed to accept any argument that asserted to the contrary.  So. . . The meal begins.  A seven course meal and we are moving along nicely.  The first four courses are all wonderful.  I have no complaints in that regard.  Sure the sommelier seemed a bit put out that we were going to choose our own bottle of wine but it wasn't a big deal.  Had she been a bit quicker tho the table maybe her opinion would have been considered but when you have already ordered the meal, perused the entire wine list, and come to a consensus at the table on your selection.before that consultations comes; well let's just say that if we are happy with our decision it shouldn't matter to her.Well then, as the last three courses are coming out we start to notice a deceleration in our service.  The dishes are coming out slower and we are spending more and more time waiting for the next.  They are still wonderful dishes and I have no issue still in that regard.  We finish our wine and the glasses disappear.  Nobody asks whether we would like to have another bottle but fine, as more time goes by probably not going to happen anyway.  Then all the water is gone and nobody bothers to address that problem.  Finally, we  are done and it's time to settle up and get home.  It's been 3 hours since we started and it's time.   Now we sit for over 30 minutes.  We never see a server.  We literally sit there and wait and wait and wait.  I find it difficult at this point to adequately communicate how we felt.  Imagine you are dressed up and out on the town.  It's a special date with a special person for which you are paying a not insignificant price.  You go to these kind of establishments with expectations that they will provide that sort of special experience and they damn well know it.  Sitting abandoned in the dark corner of that restaurant it's hard not to feel as if maybe you have just been silly to have had such high expectations for the evening and maybe you just don't rate the treatment that presumably everybody else received while they were earning those stars. Well, I would have flagged down somebody if I had the opportunity but finally I just got up and went to go find somebody.  I think it was obvious I was unhappy and what I hear is well sometimes people like to sit after a meal.  Sure.  I suppose that does happen when they are being attended to, but when you are sitting there with empty glasses and plates and no sever has bothered to know what you are wanting or needing it's a tough argument to sell.  A bit of contrition would have been appropriate but whatever.So in summary,  Alain Ducasse your food is great but your service sucked.  It sucked to the point that I just wrote a novella describing how and why it sucked although I doubt anybody will have made it this far.  You don't earn Michelin stars and get to make any excuses for anything less than perfection in your execution.  Given the attention we spent in researching you and making our booking, it would have been nice to see some reciprocation of effort.",
    "rating": 3.0,
    "rated": {
      "useful": 5,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EKH4xOKHdlz-XQKswTcclQ"
  },
  "tbyvaGxiFYkDHSF8RTuQpg": {
    "date": "10/9/2016",
    "text": "Alan Ducasse did not disappoint.  We came here a couple weeks ago when we were in London and found it to be delicious and a great value for a 3 Michelin restaurant, especially compared to those in NYC. We ordered the tasting menu and we shared a wine pairing (I wish restaurants in NYC let you do this, I can never drink a full glass for each course!) We received:- Crab from Dorset with caviar (and tempura), paired with a  champagne- Foie gras terrine with pickled vegetables, paired with a Pinot blanc- Lobster with cream, chicken sausage and mushroom, paired with a semi dry white wine- John Dory with clams, paid with a Puligny Bernard 2013 chardonnay - Duck with beetroot, paired with a burgundy pinot noir (black cherry, pepper)- Selection of cheeses and spreads, paired with Blandy's Malmsey Madeira 1999- Chocolates and macarons, merengue sorbet and dried berries - paired with a wine from Lafaurie peyragueyEverything was delicious and the pairings were great.  We will try to come back next time we're in London!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHtn_VWmbAL5OuaTIxNIvA"
  },
  "iEh8kJ3oRZCb13P13-zoFA": {
    "date": "5/17/2015",
    "text": "Maybe it's me and the French...French cuisine is my favorite kind of food out there, so hitting a 3-star Michelin-rated restaurant on my birthday seemed just the kind of thing to do. First, let's start with the Dorchester itself. Stunning, classy (you know the Sultan of Brunei owns this place, so it's going to be extravagant.) We had a some lovely cocktails at the bar while we waited for our lunch reservation. Soon we were called for our reservation, and once sat in the understated restaurant, we all decided on the 3-course prix fixe meal. To begin, we started with plate of essentially Pao de Quiejo (which I love!) Fluffy cheesy puffs--good start before our courses arrived.My first course was a lobster course, while pretty wasn't extraordinary, and if anything a bit ho-hum. My husband picked the winner of starter courses with the skate terrine and confit potatoes. It was excellent and for the first time in a long time I had plate envy. We all enjoyed the artichoke foie gras soup although again, it was pretty standard stuff. My main course of lemon sole with peas and spring onions was delicious. The sole was seasoned nicely and well-prepared. But...I still waited for the 'wow factor.' That's when the French thing happened: One of our many very-French waiters wheeled around a footstool-sized wheel of bleu cheese. And what's better than a little salt before dessert? I said that I would 'like to partake in their paprikash' and for my benefit, [he] explained that the cheese would be 'a la carte' since it's not part of the prix fixe menu. This was the beginning of the most circular conversation I have ever had with waitstaff. I said that I understood, and that I only wanted a little of the bleu cheese and not the full cheese course--if they could accommodate that. Without blinking, he asked me if I wanted cheese. Quizzically, I said yes (wondering if I had suddenly started speaking without saying words out loud). He repeated the 'a la carte' thing again. I repeated myself with my request. AND THEN HE ASKED ME AGAIN IF I WANTED CHEESE. I seriously thought I was on reality TV and my husband and friend were playing a trick on me. So as you can imagine, the rest of the meal was very awkward. Dessert almost made up for it. They offered potent ice creams: raspberry, lime, coconut. The flavors were so powerful--so good!I know that there are other Ducasse restaurants out there, but....I'm good. The food, price, ambiance, service were just okay--not worth returning to.",
    "rating": 3.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ElQKZQepFYTMVNSRh75ngg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Desserts including pineapple, coconut, lime, raspberry ice creams. Macarons plus chocolates final course",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ElQKZQepFYTMVNSRh75ngg/o.jpg"
      },
      {
        "img_id": "k13YOKy3V2PNxm3QdyQpVw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Skate wing terrine (perfect!) foie gras artichoke soup, pork rob, sole with peas and green onion",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k13YOKy3V2PNxm3QdyQpVw/o.jpg"
      },
      {
        "img_id": "kf6SiXl5iVQfUjQkNA36qg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Cheese and other breads; Lobster starter course",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kf6SiXl5iVQfUjQkNA36qg/o.jpg"
      }
    ],
    "user_id": "pWmXVpOnQnN03BXEFozf9w"
  },
  "rlMhJUDH5pMusszpPYFIAw": {
    "date": "1/13/2017",
    "text": "If you love gourmet food, this should be towards the top of your list of places to go! Best restaurant I've been to in London, hands down. Fantastic all round! It's pricey, but it's definitely a unique experience.Food: 10/10 every single dish was perfect. Lobster starter, Crab starter, Veal, Venison ribs, souffle, Baba sponge... all incredibleWine: 10/10 fantastic selectionService: 10/10 very proper, yet fun and engaging staff. Even the young ones are pros!Atmosphere: 10/10 great decoration. calming, relaxing... professional without being \"stuck up\".We celebrated my girlfriend's birthday and the chocolate cake prepared for her was simply indulging! The patisserie is tip top also. un abrazo ;)",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aV7tPiqxQBPjZRU9FyTYWg"
  },
  "xv3KDnDVBmpm9S1tT9Z2nw": {
    "date": "7/6/2017",
    "text": "Rude staff and no air conditioning on a hot day in London!  And the staff explains \"the air conditioning is on but it's very hot outside...\". Really?!  Not acceptable for a 3 Michelin star establishment.  The food is average not impressive and luxurious like Alain Ducasse in Paris or Monaco.  Would skip this one and go to those two instead.  Does not deserve 3 Michelin stars, more like one, not even two.  For a truly luxurious French cuisine experience in London Le Gavroche would be the better choice.",
    "rating": 1.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vh3ljlwtu8yP4jbOAf-BPg"
  },
  "NnRAh3fu7iph8BTD3weq2g": {
    "date": "2/17/2016",
    "text": "The service was beyond excellent! The best service I've received in a restaurant. The staff were very friendly, polite and knowledgeable when it came to any questions we had with regards to the menu. I arrived straight from the station and had my suitcase with me. They kindly put my suitcase away and charged my mobile phone.The food was excellent. We went to Alain Ducasse for lunch. I have no negative comments with regards to the food. Some things worth mentioning though: the macarons were probably one of the best I've had, better than Laduree in my opinion. We asked for more and they kindly gave us an extra bowl hehe. My favourite part of the meal was probably the trolley of herbal teas! The waiter was very good at helping us create our own infusions. It was a great touch at ending a wonderful meal :)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nrDDNEqtcyDLVebLxMC4Fw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nrDDNEqtcyDLVebLxMC4Fw/o.jpg"
      },
      {
        "img_id": "v1NBnucqgFM3DSQTx7kQuA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v1NBnucqgFM3DSQTx7kQuA/o.jpg"
      }
    ],
    "user_id": "JwLgaFivbSO0prsju8H9KQ"
  },
  "2q8K4qH3n4MLtRYnyzCqOQ": {
    "date": "2/27/2018",
    "text": "Perfection. We so enjoyed the traditional 7 course tasting menu for dinner, especially the 'Sauté gourmand' of LOBSTER truffled chicken quenelles.' Huge, almost overwhelming wine list, though we opted to select our own wine rather than the pairing and were not disappointed. And the bread basket. Carb-worthy heaven. Worth the splurge!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "cIEJST6fwmrktleGg1dLFA"
  },
  "aAWqmr1sDlPDqunyAvFnqg": {
    "date": "4/21/2018",
    "text": "We booked a table for 5 through our hotel concierge.  Never once were we told by anyone about the dress code. Although we all had collared shirts.  I guess one person didn't have good enough shoes.  So not only were we not allowed in, which is fine as we did not meet the dress code.  (Which we didn't know about at all) but we were told we would be charged 500 pounds because of the cancellation fee!   Absolutely unacceptable.  We proved this by showing the concierge email chain that at no time were we made aware of requiring dress shoes.  But this made no difference.  Still a five hundred pound punishment to us.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1O7PUEbo5Gl-r_uJsS6YQ"
  },
  "J9H3inGxMqWHRgwcdBqB1A": {
    "date": "1/14/2016",
    "text": "Well it is Alain Ducasse! What an amazing night! From the waiters, to the dining room, the lights and decorations and let's not even start talking about the food. We had a set food menu, perfectly balanced and amazing creations. What a great experience, I will almost let the pictures speak for themselves, I am happy that I got this chance to go to this restaurant. From the appetizers to starters, the fish was perfectly cooked and the veal tasted heavenly. I loved the chocolate and the minimacarons that where served.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oVr9J5fPjncsadv848X9BA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oVr9J5fPjncsadv848X9BA/o.jpg"
      },
      {
        "img_id": "sAbpAZxNsjmLKrQ1m7O86A",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sAbpAZxNsjmLKrQ1m7O86A/o.jpg"
      },
      {
        "img_id": "9rfH9isYu07jb8OW9abupA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9rfH9isYu07jb8OW9abupA/o.jpg"
      }
    ],
    "user_id": "INW4-uTZmYo8DlFvJ74IRg"
  },
  "kxYOOdjin3xCzsNUTw0EuQ": {
    "date": "6/18/2017",
    "text": "The hotel where the restaurant was located in is very beautiful...The food was delicious, I would give it 4 stars, but the service deserves 5 stars if not more...I've been to quite a few Michelin 3-star restaurants but I've never had service like this before...The fluid synchronized movement of the waiters n the mannerism of all the staff were an experience in itself...I absolutely LOVE it! :)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "utjABqzCGFzDVJlnRF0WFg"
  },
  "QgYk-8bPx28pS1cr10yt_g": {
    "date": "6/28/2016",
    "text": "Wouldn't recommend their lunch menu to anyone. Its ambience is more suited for a business meeting, doesn't have a romantic feel. I liked their complimentary pepper puff and chocolate coated almond the most. Everything is just okay, lacking a wow factor, I would expect much more for a 3 star Michelin restaurant. Their full menu may be better.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wKhIZR6BpsYz9DkvbKfQ5A",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wKhIZR6BpsYz9DkvbKfQ5A/o.jpg"
      },
      {
        "img_id": "enWfirmD0efLN5gNOR5wqg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/enWfirmD0efLN5gNOR5wqg/o.jpg"
      },
      {
        "img_id": "Wn5IWTkD3nuLOTP4WYBnrA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wn5IWTkD3nuLOTP4WYBnrA/o.jpg"
      }
    ],
    "user_id": "G_ADudWdsD8BX2l_GfQHjw"
  },
  "cV24CdmbOlkhWopssrhPYA": {
    "date": "6/29/2016",
    "text": "My Alain Ducasse at The Dorchester experience was one of three fancy dinners I got to try while I was in London -- the other two being Le Gavroche and Maze.  This was a truly singular experience, although, interestingly enough, my least favorite of the three.I was travelling alone, and so I was dining solo.  I'm used to eating by myself, but it was a bit more awkward at this restaurant than at the others I visited -- which I actually attribute to the time of day that I was there.  I visited right at open (6:30pm), and so the staff wasn't very busy, and so I couldn't help but feel like I was being stared at a bit (again, I do not blame them, they were just being attentive).  Of course, this was made extra awkward by the fact that I felt a bit out of my element.  Upon being seated, I was offered a cocktail or a menu.  Knowing I wanted to do the tasting menu with the wine pairings, I declined a cocktail and was given the menu, which was explained to me in a very helpful manner.After ordering my tasting menu (I opted for the classic one, rather than the seasonal, primarily because I don't like lamb, and a lamb dish was included on the seasonal menu) and my wine pairings (I did the basic pairings -- I just don't know enough about wine to bother with anything nicer, although I was quite tempted by one of the menus which included a wine older than I am), the fun began.First, I got to learn what a sauce spoon was.  I had never seen one of these things before.  I sat there, by myself, staring at this object I had been given, trying to decide if it was a knife, a spoon, a spreading device, or some sort of surgical instrument.  I, self-consciously, would wait to use it until all the staff was facing another direction, just in case I used it incorrectly.  I was cursing myself for not ordering that cocktail; at least then, I wouldn't CARE if I did something stupid.Anyway, my favorite course was the saute gormand of lobster, mostly because of the delicious sauce (for that, use that delightful sauce spoon discussed above!).  The sea bass was also really nice.  All the wines were delightful, and the staff was exceptionally kind to me.By the fourth course, I was four glasses of wine in, and loosened up a bit and was able to enjoy myself a bit more; and, the restaurant was getting more crowded, so I felt a little less conspicuous.  The cheese course was one of my favorite things.  The goat cheese was paired with a roasted red pepper puree that was really, really nice. They gave me a small bag of treats to take home, which was a lovely touch I got to share with my coworkers the following Monday.  And I was also given two yummy pistachio cakes for my Sunday morning breakfast.Certainly an experience I will not soon forget, and a whole lot of fun.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbAm7H4se3DFpbGMK1lLpA"
  },
  "lJq1VGN0H83hKW7nxoncEg": {
    "date": "4/14/2016",
    "text": "What a full experience, from taste to decor to service! From the moment my husband and I walked through The Dorchester doors, we were taken care of. A hotel staff member personally escorted us to the restaurant, where our coats were accepted before we entered the brightly decorated dining room. We decided on the lunch menu for our meal. Before our first course was brought out, they delivered a freshly baked assortment of breads along with whipped creamy cheese and their homemade butter (which I couldn't get enough of). They also presented a delicate lobster amuse bouche. And the portion sizes were perfect! From start to finish, we continued to be blown away by the gorgeous and tasty dishes, as well as the attention to detail exemplified by the staff. They even had our jackets waiting for us as we exited the restaurant without even asking our names.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "16_rexYRzNwT27Ktpk5phQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Celebratory opera dessert",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/16_rexYRzNwT27Ktpk5phQ/o.jpg"
      },
      {
        "img_id": "7gmZQeHS2_8RBVpJJI9wSA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Mango and pineapple sorbet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7gmZQeHS2_8RBVpJJI9wSA/o.jpg"
      },
      {
        "img_id": "T3znnpAiiM3z41rkQjojNw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Pineapple and lime sorbet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T3znnpAiiM3z41rkQjojNw/o.jpg"
      }
    ],
    "user_id": "2s1tJJrBJErXdCcWLux3Og"
  },
  "hirQk17MV_vo4tnngk6R-A": {
    "date": "6/22/2016",
    "text": "It was the most amazing service I had ever seen in my lifetime. Glasses were taken away and filled and I had not even noticed, thats what good service should be.The food in my opinion, was nothing amazing. It was just alright.",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nZqcH75NFzY35v9yAqMf7A"
  },
  "vVQcXg8LukQoIwQ3LCaNuQ": {
    "date": "7/4/2016",
    "text": "A truly great dining experience with an upscale atmosphere. I had the seasonal tasting menu and it did not disappoint. Everything was of high quality and tasted great. The service was also impeccable, probably better than Eleven Madison, which is I think what gets it its third star. As to why I don't give it five stars, I think that's where the nit-picking comes in. In some ways, I feel like this restaurant is trying to do all the \"right things\" in order to attain 3 Michelin Stars, which it accomplishes. However, something about the food felt a bit contrived. Also, having come 3 months ago, while I do remember that everything tasted great, I have no recollection of any of the specific dishes I had that really stood out to me. For this reason, I'm only giving 4-stars. I wouldn't necessarily recommend as a must-try once in a lifetime sort of place, but if you're in London, I would recommend going. You may not be mind-blown by the experience, but you will definitely not be disappointed either.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1HUdTLGVBdknXUb6spXr8Q"
  },
  "d9Ohd7qTxSrov3FV6qvvaA": {
    "date": "10/7/2016",
    "text": "We came here for lunch with a £60 lunch special in mind (3 courses, 2 glasses of wine, coffee, water), but upon seeing the tasting menu, we decided that would be a much better experience.  It was empty when we arrived at noon, but it quickly filled up completely.The decor is simple but elegant. With the plates, napkins, and glasses, there was also a light pink theme, which I wasn't expecting.There's a seasonal tasting for £180 and a regular tasting for £135.  You can also do a la carte.  We were debating between the wine pairing and champagne since it was during lunchtime, and the sommelier helped us pick a really good bottle of blanc de noirs, which I have never seen. It was light but complemented all of the food well, and I will be searching for the bottle when I'm back in the US (E Rodez).They started us off with gougeres, which I love.  Theirs have paprika and black pepper, and they're very light but still a bit cheesy, and they come warm. I thought we would eat a few and pack the rest, but we ended up finishing the plate, which had quite a few.Bread basket: always an adventure, served with salted butter and whipped cream butter - Mini epi: good with butter- Scottish bread: like a Parker House roll, good with whipped cream butter- Bacon bread: with straight up bacon fat chunks in it - this was probably my favorite Tasting:1. Dorset crab with caviar and celeriac: the celeriac was a perfectly cut super thin sheet. Some of the dish was a bit creamy for me, and I thought the celeriac itself could have used a bit more seasoning, but this dish was particularly good with the champagne2. Foie gras and duck terrine: with toasted bread with pickled vegetables. The foie had really good flavor, and I appreciate that the bread was toasted, since I think the texture helps the foie a lot. The pickled vegetables may have actually been the highlight for me 3. Sauté gourmand of lobster: the lobster was so fragrant and smelled intensely like a wonderful bisque. It came with mushrooms, truffled chicken quenelles (interesting texture), and a tube pasta.  There are lots of different textures and interesting flavors going on. This is their signature dish and was my favorite of the meal.4. Filet of John Dory: with borlotti beans and clams. The clams add an interesting texture. The sauce on it is light and doesn't overpower the dish. It's not a dish with heavy flavors, but I liked the subtlety of it 5. Duck breast with beets: good for fall and beet season, perfectly cooked. 5. Veal: since I don't love duck, they were nice enough to substitute it with veal. The veal was super tender and had sweetbreads in the center of the medallion. There were carrots in different forms and textures, which added sweetness. The veal jus was awesome. 6. French cheeses: this was one impressive cheese plate. Each cheese came with an accompaniment:  a. Goat cheese: with a red pepper compote; the red pepper actually overpowered the goat cheese, which was a milder one   b. Soft cheese: like a camembert, I think? It had a good strong flavor, and it went great with the cider and granny smith apple compote  c. Beaufort: an alpine cheese, which I've had a few times in London now. I love this cheese, and it came with a savory quenelle   d. Roquefort: with fruit. This had intense veining on it, and I loved the flavor. It was good with both the bread (with nuts and cheese) and crackers7. Berry contemporary vacherin: I was expecting something with vacherin, but it was actually a dessert of fresh berries, strawberry sorbet, and frozen yogurt. It was very refreshing after the cheese plate. To finish:- Macarons: jasmine, orange, and chocolate - all had wonderful texture in the cookie - Caramels and passionfruit nougat - Alain Ducasse chocolate factory chocolates: I usually prefer the dark chocolate with ganache, but there was a praline one with a really fine slightly texture and nuttiness to it, which was amazing- Chocolate covered almonds: maybe they candied the almonds first? The texture was great on thisIt was definitely a filling lunch with all the butter, but none of the individual dishes felt too heavy.  All the portions were very appropriate, but I left extremely full.Service was incredibly proper and still friendly. Even though it's a formal French restaurant with a formal menu, everyone was very easy to talk to, and the environment was not stuffy at all.  Frequent water and champagne refills, personally guiding me to the restroom, changing out my napkin for dessert, serving everything in exact unison... it all contributed to the quintessential French tasting experience.",
    "rating": 4.0,
    "rated": {
      "useful": 3,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gfyW0vuJls8ARoHmogfcmw"
  },
  "ao5mwClZXpFKaqN8tl5XtA": {
    "date": "3/16/2016",
    "text": "What you can expect while you dine at Alain Duccase at the Dorchester:you will be enamored by the intricate beauty of the Dorchester, the service is exemplary and the cuisine is refined. My husband and I celebrated our 6 month wedding anniversary with their Seasonal 7-Course Menu-£180.001-Wild ASPARAGUS, quail's egg, bottarga2-Seared duck FOIE GRAS, morel mushrooms: the Foie Gras was my personal favorite, it was so rich, and decadent, simply melted in your mouth. 3-Hand-dived SEA SCALLOP, broccoletti, caviar: the sea-scallop was so incredibly delicate and tender.4-Fillet of TURBOT, clams 'à la marinière'5-Rib and saddle of LAMB, spelt and wild garlic: Loved the lamb, but neither of us were to keen with the spelt: it was too gritty and left our palates with an odd citrus after taste6-COMTÉ Garde Exceptionnelle, cru 2013: Neither of us were pleased with this course, it was a very unsavory detour. Served with a black truffle purée, rocket crisps/ Colston Bassett Stilton(oatmeal cake, fruit chutney, bread) -sadly none of these elements felt like they belonged together.7-CHOCOLATE / ESPRESSO: 1/2 like, we loved the array of macaroons and chocolates, but were disappointed by their main chocolate dessert. It was way too bitter and the crisps in the dessert only navigated us further away from the course.Mignardises & GourmandisesIt was an unexpected surprise, but we were delighted that they served us with a mango, passion fruit dessert to celebrate our special day-my husband loved this, saved the dessert course for us. Even though we were disappointed by the last 2 courses of our meal, overall we were definitely pleased to experience this culinary adventure.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y1_1d7Fqiv8FFEpbm8yp7Q",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y1_1d7Fqiv8FFEpbm8yp7Q/o.jpg"
      },
      {
        "img_id": "1Yiv64uJwT4F-v40svjLPQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. CHOCOLATE / ESPRESSO",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Yiv64uJwT4F-v40svjLPQ/o.jpg"
      },
      {
        "img_id": "YiK1neV1ZYZFI1-z_UPUHQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. COMTE Garde Exceptionnelle, cru 2013",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YiK1neV1ZYZFI1-z_UPUHQ/o.jpg"
      }
    ],
    "user_id": "FjYYuhjRA5emsxBgszKbGA"
  },
  "U979yl8lMll_RFaeJZ-5vQ": {
    "date": "10/29/2012",
    "text": "The service was exemplary but also as expected for a three star Michelin restaurant. The interior of the restaurant is elegant and modern with tables spaced just wide enough so you feel like you have some privacy. Upon arrival, you receive a plate of choux pastries made with cheese. It's actually deadly that they give you a whole plate of these because before you know it, you have consumed the whole thing and you still have so much more food to try. On to the bread..I actually was a bit disappointed by the selection of breads. All the breads we tried were good but they did not have much variety.The foie gras was rich and decadent complemented well by the little clouds of gnocchi. It really soaked up the sauce and made the dish that much better. Although we enjoyed this dish, it would have been nice to know that the fillet of beef came with a huge chunk of foie as having that much foie in one sitting is a bit of an overkill. The lobster was fresh and cooked perfectly with a raft of gratinated tubes. I loved the seasoned crust on the fillet of beef. Super flavorful and tender! On to the sweets...I have to hand it to the pastry chef as this was probably one of the most impressive souffles in terms of height I have ever seen. Definitely a unique flavor and probably the most interesting dish of the night for me.We were then presented with an assortment of other treats, such as macarons, chocolates, and then a cart full of more pastries and candies. Stuffed beyond belief we waddled out of this place and ...received a box of sweet treats on the way out the door.Although we liked our experience, and they exceeded in terms of quality of service and food, we yearned for something unique so going with 4 stars on this one.Seared DUCK FOIE GRAS, cep mushrooms, potato gnocchiScottish LOBSTER, macaroni gratinated with Comté cru 2009Fillet of BEEF Rossini, crunchy cos lettuce, Périgueux sauceAPPLE and QUINCE compositionHAZELNUT soufflé, pink grapefruit sorbet",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GnaEqHFmMN2p7PozaYmgHA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GnaEqHFmMN2p7PozaYmgHA/o.jpg"
      },
      {
        "img_id": "zXc0TpoytxPKqNgkgnrF_Q",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zXc0TpoytxPKqNgkgnrF_Q/o.jpg"
      },
      {
        "img_id": "fv3iQ8wjfRQGUa_MSZtXbg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fv3iQ8wjfRQGUa_MSZtXbg/o.jpg"
      }
    ],
    "user_id": "pSfeno8ExPHvn8NXca5sfA"
  },
  "5NP1tbB-fZiTDLtFA78Low": {
    "date": "7/31/2018",
    "text": "First off the Dorchester itself is just so impressive. This historic hotel has hosted many famous people and just oozes old school charm and opulence. The restaurant itself is about half way in the back the lobby and is a lovely space on it's own - formal but not stuffy. The wall decor is very modern and interesting and there is a large private area blocked off with chandelier lights the length of the wall - very pretty. As for the food, it doesn't disappoint and you can quickly tell why this is a three star Michelin. Every dish was perfectly cooked and plated in a way that almost made it too pretty to eat. The standouts for me were the seared foie gras and the beef ribeye. Both were just melt in your mouth delicious. The price also seemed fair and on point with other 3 star michelins I've visited. If your budget and time allows for you to dine here I highly recommend it as it's a lovely experience and one you won't soon forget.",
    "rating": 5.0,
    "rated": {
      "useful": 4,
      "funny": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "UVIrqvgm1gan9eOSiqyJow",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. The seared foie - delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UVIrqvgm1gan9eOSiqyJow/o.jpg"
      },
      {
        "img_id": "ThhwtRn-YRZ7i93WLLvqlw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Happy Birthday to me!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ThhwtRn-YRZ7i93WLLvqlw/o.jpg"
      },
      {
        "img_id": "EswJ383x7TH6aVc97Yy-HA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. The private chandelier room...gorgeous!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EswJ383x7TH6aVc97Yy-HA/o.jpg"
      }
    ],
    "user_id": "WvntDWMQnaEV8agu3gcTug"
  },
  "fgCE8FaG1WCVn-pnEb-zLA": {
    "date": "10/25/2018",
    "text": "Excellent food...odd to poor serviceMy husband and I dined here on 13/10/2018 with a 7:30 reservation.This restaurant is located in The Dorchester. The setting and ambience of the hotel is beautiful.When we arrived, the hostess invited us to have a seat at the bar outside for a glass of champagne (not complimentary). This was a bit confusing as I don't know if maybe our table wasn't ready or something else? We refused after clarifying where or not this was part of the experience and I cannot drink much as it blows out my palate.I want to say that the food here is excellent. Everything smells wonderful and is delicious. All the tastes and flavors that a 3 Michelin Star restaurant would warrant. I have mixed feelings about this restaurant but for the food alone, I would come back.Service here...is questionable. My husband and I did the standard (non-seasonal) tasting menu. Service was very good until about half way through the courses where it appears that the staff slowly started to disappear and the time between our courses greatly increased to an almost unbearable level. Our dinner which I would have expected to be 3 hours long was was 4 hours; we left at around 11:30. About 1.5 hours of this was unnecessary down time where no food was present and no servers were present to inquire what was going on. It took us about 40 minutes to actually get the bill and pay after we asked for the bill.Unfortunately, we believe this is one of those restaurants which we feel like service is better if you drink and drink a lot. As I mentioned, drinking even 2 glasses will blow out my palate and so usually I don't drink and my husband cannot drink more than 2 glasses of wine so we only ordered water. The reason we feel this way is because we were sat about 8 feet and within view of another table which had the same set of wait staff (main server and all) and they received superior service. It's a weird and sad feeling when you get to a restaurant first and are going through a tasting and you see another table sit down and order a bottle or two of wine and start their meal and then you begin wondering where you next course is because it's been about 20 minutes since they cleared your plate and realize that their tasting has already surpassed yours. It's even worse when, you flag down your main server to ask for the bill because no one has come by your table for 30 minutes after your last dish( and if they have they avert their eyes and focus on the other table) and he says it will be coming and then proceed to ask if that table in sight is ready for their bill (unprompted) and lets them pay and then asks them if they want to go to the kitchen and takes them to the kitchen and back BEFORE coming back 20 minutes later to have someone bring you the bill. It basically felt like a slap in the face. Our bill was also incorrect because they charged us for an additional bottle of water which when we pointed this out they went to checked with our server and said \"it was correct..but if you *insist* we've removed it from the bill\" in a condescending way. Thanks for basically calling me a liar .... ;/I left the restaurant wondering if it was because I didn't drink, if it was because I'm asian (seriously I usually never think this but I wonder if maybe that was the case and feel like I'm talking crazy because nothing would suggest this except what else was different and I've heard that this was a thing in London???), is it because I didn't run up a \"large\" tab, Is it something else!?What would have otherwise been an excellent dining experience was ruined by the service. That being said, this meal was a \"steal\". For the quality of the food, I can ignore the service faults for the more than reasonable price that the tasting menu is set as. The tasting is half of what you would pay for a comparable meal in San Francisco. I don't have qualms about coming back but I would hope that the service is greatly improved the next time I'm in London.x-posted from TripAdvisor",
    "rating": 3.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RJKIP1UJyHW4zMO3kEW-Rg"
  },
  "A24uPGosQhBefk5jspbI6Q": {
    "date": "10/17/2018",
    "text": "Plz do not come to this restaurant if you're on lying trying to experience some Michelin starred quality. First the food only deserves a Michelin 1 Star. Second, the champagne is not included in the lunch menu, and they won't even give you the wine card to warn you how much it costs. They would use their stupid french accent to say the name of the wine real fast so you don't have time to catch up. And then trick you into buying a glass of champagne for 64 pounds it's ridiculous. Worst experience I have even had in a Michelin starred restaurants.",
    "rating": 1.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0telU3uE9wwvjgIeMnLoGw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0telU3uE9wwvjgIeMnLoGw/o.jpg"
      }
    ],
    "user_id": "Y8PYldGC0dlU1CnUzMSIfA"
  },
  "J9-LIdvX_hYetAoDloF7hg": {
    "date": "11/4/2018",
    "text": "Alain Ducasse represents the very best in London dining.  Fantastic service and world-class cuisine!  Eating here was an exceptional pleasure, well worth the price!  Highly recommended!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3rghvpwKVOwXl24xx7zhw"
  },
  "e5q0UaXxyelPdyIKOIPhGA": {
    "date": "6/9/2018",
    "text": "The chef's gifts of pate choux and fish soup were superb. I had the heirloom tomatoes and they are very nice, but not what I expected. They arrive in a bowl with a lattice work of bread and have been baked with cheese. The beef was perfectly cooked and paired with artichokes. I ordered a chocolate dessert that was very rich with ice cream. My companions all got the baba with rum and were raving over it  Update:  this is our third time here. Although, the staff greeted as usual, one of the waitstaff admonished me curtly when I went to move my water glass over to help him make room for my daughter's appetizer. His exact words were, \"Madam, please!\" In a condescending tone. The signature appetizer of lobster and truffled chicken was ok. Not worth the additional ten pounds. The mushrooms were tough and chewy. The sauce was excellent.The dry aged beef is normally excellent here;however, tonight it lacked flavor and was over cooked. Three of our party sent their meat back because it was cooked well done and they asked for medium. Tonight real \"Texas-style\" steak knives were needed rather than the dull knives given for these steaks. The bone marrow was excellent as always.  The accompanying artichoke pieces were dry and had no flavor. The three steaks that were returned were from a different cut of meat and were perfectly cooked and lacked the fat and grizzle the other two at the table had. The hot towel service after the entrees is refreshing. We skipped the cheese course because the streaks took so long coming out. The dark chocolate truffle before dessert was excellent. The coconut chocolate truffle was ok. The lemon mint soufflé served with lemon sorbet on the side was not spectacular and was quite tart. The fresh minced mint leaves were all at the bottom so there was no \"marrying\" of the flavors. It was more like two strangers only nodding at each other. The Baba dessert with rum is served with your choice of rum and was excellent and highly recommended. After tea, our waiter came to apologize about the three steaks and the bill was adjusted. We are going there two more times in the next week...so we are hoping for good things and keeping a positive and hopeful attitude.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "CzS6pFgSV4oJGvirZ1-7kw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Fish soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CzS6pFgSV4oJGvirZ1-7kw/o.jpg"
      },
      {
        "img_id": "jUZ3fcIST4ZWMjRtlSW8tg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Heirloom tomato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jUZ3fcIST4ZWMjRtlSW8tg/o.jpg"
      },
      {
        "img_id": "cGT0HNUfxDThOHx6aM7gxA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Beef filet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cGT0HNUfxDThOHx6aM7gxA/o.jpg"
      }
    ],
    "user_id": "KPmJ2fWqrLtx8VvlKGqUdA"
  },
  "Hz2f7kN2vdpfqCJckxbnpw": {
    "date": "12/20/2017",
    "text": "Here's what you need to know: the service at the restaurant was 10 stars (and the strongest reason for my 5 star Yelp review). The food by itself is 5 stars undoubtedly (3 Michelin * is not an easy thing to do), but interestingly, the food was the least impressive/intense of the last several 3 Michelin * restaurants I ate at. The Wine list is outstanding. The meal cost us just shy of £300 per person with drinks, and therefore had an extremely high benchmark/expectation from us.While the food wasn't as impressionable as Alinea, Grace, L2O (Chicago), Sukiyabashi Jiro (Tokyo), or Le Bernadin (NYC), it did maintain the 3 Michelin Star standards of precision and flavor profile. Where it lacked was in intensity of flavor - which could be a product of catering to the British palate.The progression of the courses was spot on, and the sommelier's recommendation on the wine was meaningful (shout out to the Alain Ducasse champagne  which can only be found here).The decor of the restaurant is gorgeous: Minimalistic and oozing elegance. The gorgeous centerpieces are all different on each table and a bespoke creation by an artist in southern France.A beautiful silver christmas cracker stick was a nice touch on each table setting (a nice English tradition during the holidays).Overall, we thoroughly enjoyed our meal (loved the bread selection too) and the pictures I've posted will speak louder than my words :)",
    "rating": 5.0,
    "rated": {
      "useful": 2,
      "funny": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AtLj17spP9MOpwR51HhFxA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AtLj17spP9MOpwR51HhFxA/o.jpg"
      },
      {
        "img_id": "U6FR0QlmZ4WwMPbwSVGZMw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/U6FR0QlmZ4WwMPbwSVGZMw/o.jpg"
      },
      {
        "img_id": "kFPYj48ozXAb33fyWxqpyw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kFPYj48ozXAb33fyWxqpyw/o.jpg"
      }
    ],
    "user_id": "uoN3606Jjxp0iqIS-vzAdQ"
  },
  "aqoB01CdmDEkcDUE7_4zog": {
    "date": "12/20/2017",
    "text": "Absolutely amazing dinner tonight, and I can't wait to return. We had the £100 a la carte menu, from which I had fois gras for starter and lobster for main (added £10). Both dishes were absolutely flavourful and stunning, I thoroughly enjoyed down to every piece of my dishes. Service was excellent as well. Top notch propriety and efficiency, as you would expect from a three Michelin starred restaurant. Ambience was posh and tasteful. Very much in tune with the surrounding interior of The Dorchester, it would be appropriate for any special occasion. Highly recommend the experience for both quality and value for money.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aj5lcLOtUK1vnib8N6q-fQ"
  },
  "5ZKZx0894y7pdsrYlcvhqQ": {
    "date": "7/9/2018",
    "text": "The food is good but definitely not up to what I expected from a three star Michelin restaurant. The squid appetizer was tasty, but everything else was salty and unimaginative. Worst, the dessert was just chocolate and macarons which you can get much better versions of at for example La Duree. Terrible value for money.",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZwqP9vdoNC_Bw5alScJQGw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZwqP9vdoNC_Bw5alScJQGw/o.jpg"
      },
      {
        "img_id": "zk6s9Ta2xpMVEcEhmo5i7g",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zk6s9Ta2xpMVEcEhmo5i7g/o.jpg"
      },
      {
        "img_id": "ZsXX4t3xz-k97cFIuQLYig",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZsXX4t3xz-k97cFIuQLYig/o.jpg"
      }
    ],
    "user_id": "h3cs52j6CSGEowQMCiMmyw"
  },
  "csRaYcxX37FhTdkPxrKrkw": {
    "date": "11/10/2017",
    "text": "Alain Ducasse at The Dorchester is a 3 Michelin Star restaurant. The decor is posh, extravagant and modern. The service was excellent - professional and world class. The food was innovative - a reinvention of french classics. The chef tasting menu was a parade of amazing flavours and culinary art. The food was sophisticated and the flavours and textures felt luxurious. With each course, the tasting menu slowly crescendoing to the foie gras and venison. Alain Ducasse is expensive, but if you enjoy fine dining and a bit of a production - Allan Ducasse will not disappoint.",
    "rating": 5.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "20KbwikmKoLYNDKTAbZ-0g",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/20KbwikmKoLYNDKTAbZ-0g/o.jpg"
      },
      {
        "img_id": "DWsE7QHoXWqzIQ0GqBp2fw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DWsE7QHoXWqzIQ0GqBp2fw/o.jpg"
      },
      {
        "img_id": "PmoSbvsSYOPLvrJcmmKPtQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PmoSbvsSYOPLvrJcmmKPtQ/o.jpg"
      }
    ],
    "user_id": "2pVj1Hid6_Iq3Th9xI0aOQ"
  },
  "HWBYm67cy7bvtEojB2odMg": {
    "date": "2/22/2017",
    "text": "Perfection is the expectation of a restaurant at this level of quality, and I'm happy that they delivered.  I went for my birthday the Sunday after spending the week at Oxford. Everything was amazing, but I think that the venison and cheese courses were my favorite by far. There were a few things that I encountered that I didn't realize I would, namely:-At the end of the main walkway in the Dorchester lobby, there was a really cool bar with a live band playing (at least on the weekend I assume).  If I had known that, I would have gotten to the Dorchester earlier to grab a drink and enjoy some music- I spent 3.5 hours at the restaurant for our seven course prix fixe meal (I thought that it would have been about an hour less). - A thick French accent is very difficult for the American ear. Don't feel like an idiot if you need to hear something again.- If you're leaning towards the seven course menu with drink pairings, opt against starting off with a glass of champagne.  The first course was a repeat drink of our welcoming glass.If you get the seven-course menu, I'd recommend going for a wine pairing (starting at £95). I was stunned at how well each wine complimented each dish... that was a really cool and pretty unexpected.  If you're going to celebrate a special occasion (like I did for my birthday), the chocolate cake was pretty freaking amazing.  I've heard from friends of friends that their restaurant at Plaza Athénée in Paris is even better... one of these days I'll make it out there.",
    "rating": 5.0,
    "rated": {
      "useful": 7,
      "funny": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9tj-OCQgr5xOXBlvZbhu3w",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Passion fruit dessert.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9tj-OCQgr5xOXBlvZbhu3w/o.jpg"
      },
      {
        "img_id": "tmETqWZYsYAfFOhfdlChGw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Cheese course. The bell pepper compote was the highlight (top left)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tmETqWZYsYAfFOhfdlChGw/o.jpg"
      },
      {
        "img_id": "wzDkbWaFD0oOQrQ4APQvcA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Venison with roasted parsnip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wzDkbWaFD0oOQrQ4APQvcA/o.jpg"
      }
    ],
    "user_id": "7vXBSGS6qNQQNUxRFhYQLg"
  },
  "gQvnkuhBQdtDpFoYAMILqw": {
    "date": "3/17/2018",
    "text": "Had the most incredible 6 year anniversary dinner here last week. My boyfriend and I couldn't get a table at Gordon Ramsay's so we ended up here and boy, was I not disappointed! The place is classy as heck and the service matches up with what you'd think a 3 Michelin star restaurant would be. This was our first 3-Michelin star restaurant and it was an experience. Everything was beautifully done; from the wine and sauce pouring to the flavors of the food! We had the 7 course tasting menu + the wine pairings and it was worth the money. Everything went perfectly together and it's definitely not an experience I'll forget! If you love someone and you've got the money, it's worth splurging for them for an unforgettable evening!",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ONdIhFmVruuTFYcTzi0y7A"
  },
  "D0bYgUqPKSMDMhSc5DWu2w": {
    "date": "2/9/2018",
    "text": "Happy to have tried this 3 star. Met with great ambience and nothing but London service (top tier). The food was best when tasting from the classics on the menu.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VNT7QmZPmuhcdJ1hA0tczA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VNT7QmZPmuhcdJ1hA0tczA/o.jpg"
      },
      {
        "img_id": "n6KDs7FyAQThkp5OEi_OcA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n6KDs7FyAQThkp5OEi_OcA/o.jpg"
      },
      {
        "img_id": "t0zJ57PheWlW_87W-v08Ug",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/t0zJ57PheWlW_87W-v08Ug/o.jpg"
      }
    ],
    "user_id": "B1YiexaiQzK-KOVveQuR_Q"
  },
  "CgnhMBS0AxPUovs1Ofz93Q": {
    "date": "6/3/2018",
    "text": "Best meal I had in London. Went for lunch and they were serving the Chelsea flower show menu. Service was excellent as well as the wine pairings. The food was what you would expect at a 3 Star Michelin restaurant-\"fantastic\". Approximately 3 hours from start to finish. I would recommend going for lunch as it's a bit less in cost compared to dinner.",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9pTNK5SU4fJICmOL48nzmg",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9pTNK5SU4fJICmOL48nzmg/o.jpg"
      },
      {
        "img_id": "La5Os_qzV7BzjjEbSHCP_A",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/La5Os_qzV7BzjjEbSHCP_A/o.jpg"
      },
      {
        "img_id": "fjiD1l5oz8ZnqUX6BbKMCA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fjiD1l5oz8ZnqUX6BbKMCA/o.jpg"
      }
    ],
    "user_id": "-flCqxE5VkFAR0-BtK7yMQ"
  },
  "e9LjYdx0DWeCqhz3E0HUew": {
    "date": "11/20/2017",
    "text": "My wife and I had lunch at Alain Ducasse during November. For £65 per person at a 3 star michelin restaurant, I would consider it a steal. The service was impeccable but also felt borderline excessive. Everyone was smiles, folded our napkins when we went to use the restroom, offered to check-in our coats, filled our glasses when they were nearing empty, cleaned our table when a single crumb dropped, offering bread whenever we had finished our first piece.. etc. Overall service was an A+.The food was also amazing. We went with the set menu and everything was perfect. But be aware, the set menu will take at least 2 hours to complete. Only order this if you have time to spare, as the lunch service is paced very slowly. Alain Ducasse is an experience, not a fast-food joint!Some minor gripes:The website says that men are to wear jackets, collared shirts, slacks and dress shoes. I was okay with the first three, but as a tourist, walking around all day in dress shoes could be a hassle. But I sucked it up and did it anyway and wore a pair of Chelsea boots for the entire day. 10 minutes after we entered, a gentleman walked in with converse sneakers. What. the. heck. That was pretty annoying. If I knew I could've came in with a classly outfit + sneakers, I would have done it in a heartbeat. But I guess that's my fault for worrying about the \"rules.\"When we sat down, the server offered us water options and tea. We both ordered water and tea and they came by with 2 servers and poured us each a bottle of expensive looking tea. It was my fault, I should've asked for the price beforehand. Turns out the tea was £30 a bottle. Expensive mistake, but deceptive for the restaurant to offer this along side *Free* water options. Also I'm Chinese, so when a restaurant offers Tea, it's usually free. But that's my mistake for assuming.Overall, an excellent meal with great service. I would definitely go again if I made another trip to London and would recommend the set lunch menu to every one. However, skip on the £30 tea. ;)",
    "rating": 5.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kW_n-DZH_icAJMnSfETOeA"
  },
  "Beu4LQXgjrYbvYaSuT34_A": {
    "date": "1/29/2017",
    "text": "Horrible Desserts but the impact of this is limited as the food and service was great! I came here with a friend (we wanted a nice reunion location with good food) and ordered the seasonal truffle tasting menu. The staff is impeccably trained and from the moment we arrived and left, all actions (the clearing of courses etc.) was like a a carefully coordinated dance. The food was amazing (shoutout to the truffle soup with the pastry lined around it). While there were a few mediocre dishes (the lobster tail was tough and just not as fresh as it should be), the rest of the dishes were great. The dessert, however, was frankly bad. I was very very surprised at this at the end. The dish that stands out to be as hopelessly failing was a truffle sorbet + truffle vinaigrette dish. I understand the need to incorporate truffles in the dessert (as it is a truffle tasting menu) but it tasted so confused to the point that it was extremely unappetizing. Even after my friend and I could not eat this dish, we were given a plate of cakes and macaroons from this gorgeous trolley. While the macaroons were appetizing, the cakes were not. We again could not finish the cakes. We were given a pistachio cake to take home and that was great. Lasting Remarks: I would definitely return but I would not order a tasting menu; I would order  a la Carte. (Note: My general mindset towards these established restaurants is that fresh produce should be a given and that the joy I get from the dish should come from the extra umph the restaurants does with the flavors).",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Js0jajlYZhL-9QaSBWMu5Q"
  },
  "ECSSJtP6snkV1oVjXXk4zQ": {
    "date": "1/29/2016",
    "text": "An important lesson has been learned through this mildly disappointing experience: in a 3 Michelin Star restaurant, ALWAYS go for the tasting menu, no matter how expensive. No exceptions.My friends and I went out for our friend's birthday lunch. He is a true connoisseur of Michelin masterpieces, racking up 10 stars in his birthday week alone... He entreated us to try the 7-course black truffle tasting menu which was upwards of £180 and a bit out of my lunch budget. So we settled on the modest £60 3-course set menu which included two classes of wine skillfully suggested by the in-house sommelier. The Dorchester is a grandiose venue, less so from its reinforced concrete outside than in. The Alain Ducasse stands out compared to the lavish marble lobby and the 1930's glamour decor. It is more chic, a more simple and glossy space. The staff were very attentive and offerings of macarons and nougats and a Dorchester pen did leave me teetering on a 3.5. However, the main course left me a bit shocked and overall disappointed given its reviews and reputation.Food:The pre-dinner cheese choux buns with whipped and plain butter was a nice start. As was the warm up of black truffle mouse. My starter was foie gras with creamy lentils which I thought was very nicely done. Different take on foie gras but absolutely delicious. The dessert was a deconstructed, 'contemporary' lighter version of vacherin and was fantastic. However, the pork was actually appalling, and all three of us agreed we had tasted better at places which I can't even bring myself to list in a 3-Michelin star review...out of respect. It was hard and flavorless despite being cooked medium. Although I would love to say the other courses out-shined it, but in a three course menu, the main should be the star and absolutely fell flat. That being said, the wine was superb.",
    "rating": 3.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vSogxOw1x-1Iht-9pMhUIA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Contemporary Vacherin",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vSogxOw1x-1Iht-9pMhUIA/o.jpg"
      },
      {
        "img_id": "heVYZbukFxcdmMI9oS6S-Q",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Pork with salsify",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/heVYZbukFxcdmMI9oS6S-Q/o.jpg"
      }
    ],
    "user_id": "zAZpV6TnwXB-bXyhEVBccg"
  },
  "jZ0PQVZuxHrBw49dHfsrzQ": {
    "date": "3/6/2018",
    "text": "I had a wonderful time here. I walked in July and by the time I got there, I was quite hot and disheveled in my suit. No one batted an eye, although it was quite obvious. That is courteousness. And courteousness abounded my entire stay although I ordered cocktails (a bit staid or there would be 5 stars) instead of the wine pairing. Very glad to have dined here. It was one of my highlights in my trip to London.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZgC8zRVxGS037XVBP05jLQ"
  },
  "xYJ86-44K2rOkSKnBPy4QA": {
    "date": "12/14/2017",
    "text": "Just finished my tasting menu (10 year anniversary menu to be exact, and very expensive) and I was not impressed at all... I am coming from Houston, TX and was really looking forward to this dinner... I have been to many Michelin Starred restaurants in the world but this was not what I was expecting. Food was just OK for such a renowned chef. I just don't know exactly what to comment about this. Somewhat disappointed :( and many dollars poor!",
    "rating": 2.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "be9Q9o3-wc9aeYLhonPxSw"
  },
  "VwNndCq_38XPsv1GhgUqjQ": {
    "date": "6/21/2017",
    "text": "Fantastic meal at Alaine Ducasse. Top notch service. Review would be 5 stars but every dish we had was a little too rich. I will be back though. Great wine, good times.",
    "rating": 4.0,
    "rated": {
      "useful": 1,
      "funny": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kqp8xclwxFAuHzZ9tu5eQw",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Macaroons.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kqp8xclwxFAuHzZ9tu5eQw/o.jpg"
      },
      {
        "img_id": "LWXajUNUAnH84xnj2jKKwA",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Pigeon. Very very rich dish.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LWXajUNUAnH84xnj2jKKwA/o.jpg"
      },
      {
        "img_id": "X-gqjuW2vtmFIzQFuTeJBQ",
        "caption": "Photo of Alain Ducasse at The Dorchester - London, United Kingdom. Lobster pasta starter. Only dish that's been on the menu the whole time.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/X-gqjuW2vtmFIzQFuTeJBQ/o.jpg"
      }
    ],
    "user_id": "u_DID-hcIIkPvmilZ7rpcA"
  },
  "HTfmOd9Ybw4u1Z_wRqOE1w": {
    "date": "6/1/2017",
    "text": "Extravagance that we were seeking on our last night in London. Service was all that we expected, friendly, personable and very efficient. One disappointment was that they didn't have a different color cloth napkin for my wife. She had on black and the white cloth left lint all over. This is a surprising oversight as I have had this option at many lower rated restaurants. We had the tasting menus with wine. The wine was phenomenal. Food was good, but the lamb, as the feature dish should have been more substantial.",
    "rating": 4.0,
    "rated": {
      "useful": 0,
      "funny": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2T1EdZ9bxFcjZN0pmzt8lA"
  }
}