{
  "QOAenXDj_wAVvoMEMkD4BA": {
    "date": "8/5/2015",
    "text": "I visited the place twice and ordered different types of dishes. The first time it was chat which was excellent and the next time was a horrible Experience. I ordered mendu vada from the menu and what i get is stale vada from maybe afternoon and i had to talk to them and have it taken back and ordered gobi which was not great either. The veg noodles were not up to mark. Either the service and the quality reduced between my two visits or something else was wrong. I am not going back to this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ln5V0bL3sQkPBfEiMKM8Og"
  },
  "GCUCs_WcBb9-N5Qt-xMM0g": {
    "date": "3/4/2016",
    "text": "I was visiting from Virginia, was in a hurry and told the employee. He said if I have 15 minutes he can get anything on the menu done. I ordered the chicken 65 and samosa chat. It was done in 8 minutes. Meanwhile I kicked back with a kingfisher. Taste was excellent. The manager went around each table asking for feedback. Customer service also very good. Highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ROxyfTgq964fsOULYcK8tQ"
  },
  "IUqbuOeYBpQmy2mjgEOySA": {
    "date": "3/29/2017",
    "text": "Nothing special; average ambience average food average service ; average taste. We had pani puri which wasn't good; gobi manchurian 7/10; vada pav 4-5/10. Don't think would go again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KvIgE5MnPzms4RALDAFNIw"
  },
  "vwfGdDOEhipBcJ5Z7lAJLg": {
    "date": "7/25/2016",
    "text": "Great food.  Great service!  Goat curry!  You don't find that at many Indian restaurants.    They specialize in  Chaat.    Definitely a go to place when I'm in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HXE0yZhq2v3U0wk7bOA1YQ"
  },
  "GGepw5KmU9zOj9d9cAMt3w": {
    "date": "2/5/2016",
    "text": "They do not have a lunch option (or we were not offered), so it was a super expensive lunch. Food was ok. Gobhi Manchurian was just mediocre. Saag Paneer was pretty good. Probably won't be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "1yizm-DgDr-jCQv2KcCqMA"
  },
  "Ag2YHIJhUk_z7dFtfSOptQ": {
    "date": "6/11/2016",
    "text": "Astonishingly tasty food.. The service provided was very welcoming..  I will be returning soon to have some more food. Definitely impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGoe6H7xKRkIXDxkOApZCg"
  },
  "89Y2E6xjmQJkozAKVINiDQ": {
    "date": "8/12/2016",
    "text": "I have been here many times and their food has been consistently delicious. I enjoy the authentic Indian cuisine served in a relaxed atmosphere. Their customer service is outstanding. I like the fast-casual style counter ordering. If you like Indian food, give this place a try. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ANcsda0uhBuNigZuxpT1w"
  },
  "ntzydTbsQrfeJh5ZCTWPuw": {
    "date": "7/2/2015",
    "text": "Pleasantly Surprising restaurant, clean and casual in ambience.  Has a full menu covering most of the Indian dishes you could be craving. We went for the spicy chaat but found many more dishes that we wanted to try and loved all of them.  The service is friendly and fast.  Definitely a good place to check out  if u r in the mood for spicy Indian food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mvTA1HnBYBa0JROkEjUd7g"
  },
  "ZYvhEIQzqYMrk6h7vz3GMw": {
    "date": "4/23/2016",
    "text": "My friend and I went here for dinner tonight. I was highly impressed!! The service was great. Everyone was especially helpful at getting us a table. They were extremely busy, but they were on top everything. The food was amazing and the naan was great. They had so many different  entree choices that  I had a hard time choosing, but I think that is a good thing. I ended up with the Paneer Tiki Marsala. I was super happy with the choice. If you are in the mood for some great Indian this is the place to go! I will be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Ynabz5RJet5xU0JHsqMvg"
  },
  "Omrt3TRjmQah-by3_JcxXQ": {
    "date": "4/21/2016",
    "text": "The food is simply amazing! Not at all to the standards of America- no! It's to the standard of India! Yes- this place kicks butt!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmLQgGRsQ1zZBaWkgR3TeA"
  },
  "1FTG1AyP_BGJ_bIBQMhKlg": {
    "date": "6/10/2015",
    "text": "Not the same style of an Indian restaurant. I should say this to be more of a food joint. We tried some samosa chaat, paneer manchurian and a lamb gravy. As per standard of Indian restaurants, this was not bad.  I should say at least I did not felt cheated ( as most Indian restaurants do )   Try out folks, you have options of street food as well as main course !!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iaQ87xNkWEAp41GFL9IpuA"
  },
  "F3nWU_XB4epRAGDLxfON5w": {
    "date": "4/10/2016",
    "text": "Loved it. Definitely one of the best Indian fast food in Charlotte. Hakka Noodles was delicious and Indian zing to it (dare I say noodles done right :). My daughter who is not crazy about Indian restaurant food went gaga over it. Wife loved Chole Bhature (..though was bit disappointed to not see traditional big puffy bhatura). I enjoyed Samosa chaat immensely...doubt if anyone can ever mess up Samosa chaat but this one was way above par. Finally saag chicken was delish (our host Krishna recommended to try this dish over saag paneer..and it was definitely a right call for a meat eater like me). Now on..:every visit of Indian grocery shopping at Patel Brothers will be paired with a quick bite at Chaupatti :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8n4hTMyb7kcH8WpXNAxLg"
  },
  "LLoglM4s887XQX5GwtXShQ": {
    "date": "5/19/2015",
    "text": "Amazing food and service.  My friend had never eaten Indian and he loved it!  We had seen their sign while we were shopping for groceries, and walking around the corner from the Bilo there they were, Chaupaati friendly and inviting My husband and I were very accustomed to what to order due to me being in culinary school, and my friend began struggled to decide. Quickly the friendly wait staff was there to help with any questions that he had.  I got the Chicken Korma, an order of Naan bread and the assorted pakoras which was out of this world, BTW. My husband ordered Shahi Paneer and our fried ordered the Tikka Masala. Everything was so good that we all decided to share everything.  Chaupaati is a total hidden gem and I hope they stick around.  Thanks again for the service & you all will definitely be seeing us again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IAtxcL__W88vq2ZQ5yGsw"
  },
  "Ez2JXr8km_MKhfGzn91fxw": {
    "date": "1/16/2017",
    "text": "The service was good and curtious. we went there at the last minute but still we were served quickly. The food was a little spicy with a lot of masala though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wu3UOEd4Ko_ptoismF5UTA"
  },
  "bXmGfZb0IbbB-ziuEfuV5g": {
    "date": "8/15/2015",
    "text": "Last week, I tried chhole bhature. It was really good. I like interior setup, friendly people. Service was fast too. Next time I will try masala dosa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beWMkZLkAl7wqFcZizYCVw"
  },
  "jb0HXvsYneAVQUgAoWy4LA": {
    "date": "6/1/2016",
    "text": "Worst service ever... Food is ok not very Indian ...they don't serve you anything else besides what u have order .. U have get up go get napkins spoons water .. Then once your done with food you have pick your dishes up and put then on top the trash tray yourself.. I mean your sitting in restaurant this all should be done for you.. Otherwise I could just sit home and eat... After all this they want tip",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNlCUHGkAlE2_OjBC4-1qw"
  },
  "9ZAy1ew4VGZGFcjq_-q7VQ": {
    "date": "6/1/2016",
    "text": "Avoid the Indo Chinese dishes at any cost.I love the rest of their menu but both the times I ordered their fried rice, it was not a great experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9H9tCYvRBuaCUKraOOs0Q"
  },
  "hoG0LC_O9ttY2dn3q7g6Jw": {
    "date": "1/10/2016",
    "text": "The best Indian in Charlotte! Service is outstanding and everything we ordered was excellent . A can't miss spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sdjKI8dpMdyk9tPxWYF3Lg"
  },
  "QdECt0i8x7SZXEzsO1OXwA": {
    "date": "7/29/2017",
    "text": "The curried lamb was simply wonderful. The meat was very tender and curry very flavorful. The chili chicken was crispy and moist on the inside, although did not compare to the quality of my lamb dish. The garlic naan was yummy. We're not big bread eaters so one order would have been sufficient. Loved the family atmosphere. It's very casual dining and combines self serve with some table service. Food was delivered to our table in a quick manner. Don't expect great atmosphere, yet the bathroom sink totally rocked. We'll definitely be eating here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iXQca8qbZM5x3JEnBi_DXw"
  },
  "0K9Nn_0DFY_Ey8lIpQwYGw": {
    "date": "11/9/2016",
    "text": "Par below expectations ..Food is being  served right  from the refrigerator ..not sure how many days old it was ...It doesn't lives up up to the expectations ..",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RrXm00c6P1o5tS80GLGUYQ"
  },
  "mL_ysXqkNFqHafAZrua2CQ": {
    "date": "8/10/2016",
    "text": "Wonderful food.   Some of the best Mater Paneer I've had. Samosas are great and have just a little nutmeg to make them sweet. Mango Lasi is a must for your drink.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 3
    },
    "photos": [],
    "user_id": "Ixcfs1u6_Bqs3NehRbZppA"
  },
  "VNIpOwwjfgfiTFTTS62Tlw": {
    "date": "9/16/2017",
    "text": "Loved Everything over here. The biryani is delicious and the curry was  perfect. Big thumbs up for this one",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "reWZzScRtlN9Ayr0LMcOhQ"
  },
  "jwerfBxfncBeyI2OFEKreA": {
    "date": "7/1/2018",
    "text": "I'm not sure why they have such good ratings. I ordered the mixed grill and the meat was cooked on a prior day refrigerated then re cooked for my order. The chicken was hard as a rock on the outside, dry on the inside and the bone was a dark. It had a funky unfresh taste. The lamb kabob was dry and tasteless. I also had aloo gobi which had good spice but the potatoes were from a can like school used to serve. The Mali kofta was too sweet and the potato cake was mushy. Also had assorted pokeraras, ok but little to no spice on the breading. I didn't like the fact that I had to pay and tip upfront before trying the food and realizing that I am the server. Get your own plates silverware, there was no ice for the water available. I thought it was cheap on service and food quality. I won't be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LRs-XtF3kZTGzzYKB9tREw"
  },
  "19pZ1-2SHn1tMTB8cmRNyA": {
    "date": "5/14/2015",
    "text": "Chaupaati is fresh ingredients, reasonably priced, brand spanking new restaurant, count me in!  Located on 51 and Park Road, right beside the BiLo grocery store.  It's no frills, you order at the counter but serving up great curries, dosa and hard to find small bites!  I can easily see it being on my short list of my favorite Indian food spots in the Queen City! #chaatmeup",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "kluAtKVrQF-O-oXlf1LseQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Dosa Masala",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kluAtKVrQF-O-oXlf1LseQ/o.jpg"
      },
      {
        "img_id": "cSiwuLRENaujPPdxJXVl7Q",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chai",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cSiwuLRENaujPPdxJXVl7Q/o.jpg"
      },
      {
        "img_id": "--DMQtgMhxUvWTT7lukzKg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Samosa Chaat $7",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/--DMQtgMhxUvWTT7lukzKg/o.jpg"
      }
    ],
    "user_id": "Bsbumyr3Of8BauN2URK4bg"
  },
  "zxnUjPrZWRhXCC3sLX6DkA": {
    "date": "8/1/2016",
    "text": "we love going here! Its a bit on pricey side but the food is so good its worth it =) The staff is always sooo friendly too which we love!  We've tried many things on the menu and they are all so good! But be careful if you order it spicy...its REALLY spicy! We love spicy and its still sometimes too spicy for us!!  Overall, clean, great casual restaurant!  Keep up the great work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-Fk2xynnzYxOK1EhJ4-Sg"
  },
  "R7ZBzX5N7MqRgOnAA13nAg": {
    "date": "12/8/2017",
    "text": "Food taste is not bad, but they serve all the foods including hot tea in plastic or melamine cups and plates which is not good. When I drank their tea, I could smell the plastic. I wish they serve in ceramic ware....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HkUblj38GpQnxtxeXUeIOg"
  },
  "uoPG0LvcHW3q9DbeJ-U7yg": {
    "date": "6/25/2017",
    "text": "Omg Ive been coming here since it opened and havent been disappointed. Truth be told: i order the same few things every time I go. The Samosa Chaat is by far the tastiest thing on the menu and best value (can easily feed 2 as a meal). I also like the papdi chaat, the gobi manchurian, and the bullet naan. Bullet naan is spicy in a really good way! And mango lassi is cooling to counter the spicy naan :). Definitely one of my favorite spots in Mecklenburg county.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vQnboUN0vkkfeBuhJdNf8w"
  },
  "kD8Dc2vcdLyK9ZGq-1xK6A": {
    "date": "1/8/2017",
    "text": "Very nice place for vegetarians. Love the appetizers and chat options. Multiple options for vegetarians.   Very friendly staff and thrive to give you the beat food experience. Kudos!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQl7Batwgwesw2BFETZumQ"
  },
  "OZtYl4owS4mB0y4O6NjGZw": {
    "date": "11/16/2016",
    "text": "My first experience trying Indian food and I was pretty impressed. Chaupaati is located across from the hospital and behind Starbucks. I came for lunch and it's much more of a take out environment at this time, but they do have a dining room full of tables and TVs. I ordered the chicken tikka masala and butter naan bread (definitely order some naan it's great for dipping) and my girlfriend got the chicken curry. Everything tasted really good and I would definitely order my dish again. You get to choose your spiciness level (mild, medium, hot). Prices are pretty comparable to Thai food with similar menus and portions. All in all I would definitely recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m4SybK_yiJ8P_EZIFrlHbg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken tikka masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m4SybK_yiJ8P_EZIFrlHbg/o.jpg"
      }
    ],
    "user_id": "chyyyctm9ckd7q2mtMZ7Ag"
  },
  "jucHJGfQzQV1HY2-11TYTQ": {
    "date": "5/12/2017",
    "text": "This is probably one of our favorite Indian restaurants in Charlotte. We don't usually stray too far from our usual Chicken Tikka Masala, Chicken Korma, or Chicken Vindaloo; but they are all solid options and have yet to disappoint. Definitely add an order of garlic naan... or two!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uFP9IeEYwBeqqlUQ-dw7PQ"
  },
  "VF99MGWF3A2tEkndenGAhQ": {
    "date": "9/10/2016",
    "text": "Excellent real delicious Indian kitchen with True flavors For those who traveled abroad and tasted the Indian cuisine  This is authentic Good prices & best Indian food in Charlotte, NC",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0Bd9SyjfJ3QT42fQIovXw"
  },
  "o-B3VRJQiLBd3Dz0Bnri6g": {
    "date": "4/6/2018",
    "text": "I don't understand how this restaurant can be so highly rated - the only spice and flavor they seem to offer is chilli powder!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bCrxXTQjmnx0usinccWgAA"
  },
  "mgtaXdDIboVckCyv4MxOGA": {
    "date": "2/24/2018",
    "text": "The food here isn't your typical restaurant food. This is food straight from the food carts of Mumbai.  If you're tired of restaurant fare and carve some proper, simple food this is the place to go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x5uFvJBO66YO35q_KqgRNA"
  },
  "hL2kWPVCJdIP1K5jxDo7Jw": {
    "date": "9/5/2016",
    "text": "Definitely non-Americanized Indian food right here! The butter chicken is amazing - especially if it's REALLY spicy! The butter & garlic naan has just enough flavor that it goes great with the butter chicken. The service is also really good - very helpful servers and really nice cashiers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vsjghx2P0DUEcNkVKuCr2Q",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Great food today!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vsjghx2P0DUEcNkVKuCr2Q/o.jpg"
      }
    ],
    "user_id": "jSzfPnxZspRV-atgs-y_Fw"
  },
  "FPb4WhQHaw3MOMshd9BQ-w": {
    "date": "7/30/2017",
    "text": "A tasty and reasonable option for Indian food. The samosas and garlic naan are terrific, but the chicken tikka masala was a little bland. Next time I will up the spice level. A busy and family-friendly place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N33DAPvk0twXdJLloP85Kw"
  },
  "J5WScvcVG_4WUDHzytlYTQ": {
    "date": "7/30/2016",
    "text": "This place is great! I would give it 5 stars but I prefer table service vs order at a counter.   The place was packed and you wait for a table to open up. Place your order at the counter and then they will bring you the food. The menu is huge. So much bigger than you'd expect at a counter ordering place.   We order a variety of things to try it all out. We had dahi Puri chaat and it was awesome. It was cold. Refreshing and great to share. The garlic nan and chicken tikka masala were very good. We always order those as our baseline at any new Indian restaurant. We ordered assorted pakora which was good. We just got full.  We will come back here many more times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euP6u_W2KyAm5jp6da88dw"
  },
  "9U1Dql7wKG5f9aEqD4EkqA": {
    "date": "8/30/2015",
    "text": "Holy hidden gem Batman!!  OK so I love Indian food I could eat it five days a week and twice on a Saturday and still not be happy, this place is in a little strip mall off 485 and honestly you wouldn't give it a second look but its fantastic, whilst I typically try other things i think every Indian should do a great tikka masala and its my go to for testing a new restaurant and this doesn't disappoint, honestly its up there with blue taj and that's my current favorite.  It's definitely more of a fast food type place than somewhere you would go for a night out but if you want a great lunch or something quick and you truly like Indian food then this is a no brainer, seriously make this place a success as I would genuinely be sad of we lost one of the few good Indian restaurants in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2hcc8PsKgQkEuV2BUr30Sw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2hcc8PsKgQkEuV2BUr30Sw/o.jpg"
      },
      {
        "img_id": "PZT1bBThaCS6uOejfR0C6Q",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PZT1bBThaCS6uOejfR0C6Q/o.jpg"
      }
    ],
    "user_id": "_BfpOP_HdKYHt0HRlOxb4Q"
  },
  "GOJvpyGBnbmAMJ0Pebwqsw": {
    "date": "10/15/2016",
    "text": "Delish!!  Best Tikka Masala and Saag Paneer I've had in a long long time.  Will definitely be coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "K1HruNYw7xn-ntWQu5eivQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Tikka Masala and Garlic Naan....",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K1HruNYw7xn-ntWQu5eivQ/o.jpg"
      }
    ],
    "user_id": "Az_IH5kpbbH7QG9SM09pNQ"
  },
  "F8blffzo5YOdI3hIPxJYXQ": {
    "date": "6/30/2017",
    "text": "So good! We had never been here before and the people working were so helpful on giving us advice on menu items. We had the chicken tiki masala and the Prawn Goan Curry. Both dishes were similar to each other as being coconut based but different spices. We also ordered garlic and buttered naan bread. We don't like spicy food so they toned down the spice for us. Both dishes were rich, full of flavor and so delicious!!! We will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wlTd-6M1pkO7zs5CgopQOQ"
  },
  "aQiuVdDHvyUf4c_ZBzUz_g": {
    "date": "3/16/2016",
    "text": "So, I'm here again for the second time this week!  I can't get enough.  This time I ordered the chicken biryani and some samosas.  This is better that the food I had in Delhi!  Super friendly counter service and amazing Indian food that won't break the bank.  I can't get enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "0SIONaLgnYx5ipizjhWFcg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken Biryani and Samosas.  Soon good!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0SIONaLgnYx5ipizjhWFcg/o.jpg"
      }
    ],
    "user_id": "4-Mgl_c3ud1mMegdOdXn9g"
  },
  "6pvWpSNmuZTaii01DByoBg": {
    "date": "3/5/2017",
    "text": "One of the worst service for the premium price. There is no service fastfood but they need 5 star price. Quantity of curry and biriyani is very less compared to their competitors. The store is a dubba wala and behave as Taj. If you really want to dine there are better place avoid this over priced crap for highly priced chat  Chat is $6+ its highly priced u can buy all chat items readymade nowadays from indian grocery. Good lesson learnt",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "glQV7O03tm9DMquR0zfieg"
  },
  "vXp2H3zXd4Xx5IjXL_8m_Q": {
    "date": "1/28/2018",
    "text": "Dish for dish, one of the best Indian restaurants in Charlotte. The ordering/process is a little funky, but not hard to navigate. If you like Indian food, you'll be happy. If you've never had Indian food, you'll be spoiled.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Y7kRk1dYbLdQrxRdnRxkg"
  },
  "tJkc38TZcc1DC7vgxXjbfQ": {
    "date": "6/8/2016",
    "text": "Went again ti give this place a second try. Went on a saturday, there were only a couple tables occupied amd still had to wait close to 20 minutes to get the food ( only two items ordered). Wasn't too impressed with the chilli chicken and samosa chaat. Conclusion: not good enough to bring me back, others may like it.  Went to this place on a rainy saturday night. We started off with alu tikki chaat which was great. I was expecting the entrees to be great as well but was sadly disappointed. The prices for entrees were too high compared to the place being a self serve spot. The makhni daal was an utter disappointment, shai paneer was just okay. The masala chai was a waste of money and mango lassi was too sweet. I am alarmed we ended up Paying 54$ for the not so tasty, heavy, acid reflux giving food. Pretty sure, I won't be back!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJVkBWeyirjR4h8x2PpN4g"
  },
  "jUPYNh60x7OY_WD0Hb2Tbw": {
    "date": "2/3/2018",
    "text": "Hands down the best Indian food in all of Charlotte. It is a little hard to find, but if you know where he restaurant sweet teas was, you will know where this place is because it is in the same space. While everything was good, I'd especially like to point out the tikka masala. It's flavor was so far from generic and so flavorful. I'd absolutely love to return sometime in the very near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_okwApnbYsPgzXFJyudQmA"
  },
  "UR1qFdsucRKsoS-M3uBL2w": {
    "date": "6/12/2016",
    "text": "The food here is always great. They serve mostly Indian Street food. Like Pav Bahi and Cholee Bhatura. Today I got the Non Veg Thali which is a steel platter with sections of different items. (Think school lunch tray) in the upper left section there was Chicken Tika masala, center top was rice, center left was pickled chutney, center left was carrot and sweet potato dessert,upper right was lamb curry, bottom right was yellow lentils, bottom center was nan (flatbread), bottom right was roti  and yogurt. The cost is $16 but it fills even me up so its worth it. I also ordered a Fresh Lime Soda ($3)but I didn't like the taste due to the salt and spices  that they added. (Tasted like rotten eggs). But they swapped it out for me right away without the added salt and spices and that one was fine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QDlcrITsxV3Xm2ztYrwYsQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Non Veg Thali",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QDlcrITsxV3Xm2ztYrwYsQ/o.jpg"
      }
    ],
    "user_id": "Jzy9P_PD89jzjd-PKcx62w"
  },
  "H0-cKZgnRR30P0L50jMLFg": {
    "date": "6/10/2017",
    "text": "Got an order wrong. Ordered Gobi, they probably gave chicken! Not sure!! Ended up realizing after a bite that it wasn't gobi. But the guy probably lied to our face that it was paneer. I hope it's paneer. But it sucked, so don't get paneer Manchurian! If you are plant hater (vegetarianism), please avoid. I wouldn't suggest you take the risk. Food is ok otherwise. But seriously, how can you not know what you are serving!!  More volume doesn't equal to carelessness.  For those who are animal haters , shouldn't make an iota difference. Food is good. Enjoy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NQfYwnTJWow7qvyRR4qPcg"
  },
  "bYki4OTd4qZbiNTzElj2zw": {
    "date": "1/22/2017",
    "text": "Vegans beware! They say they will provide the dish veganized, but your dish may still have paneer. Happened to me today and I ended up accidentally consuming one. They casually apologized and replaced it. I won't visit again after this experience.  Overall I don't know what the hoopla is about. They have average service, poor ambience and charge full restaurant like prices. Food taste was good though.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "dUHLyLd-VcMbYKKgfzhVtg"
  },
  "1jKzgaeRhkM2aM_Bq6zTyg": {
    "date": "1/10/2018",
    "text": "Best Indian food in Charlotte! My father lived in India for a year and he approves. The bullet naan is really good. The staff is very friendly although we usually get delivery by DoorDash app. It is a bit pricey but I guess it is the price you pay for the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v3Fo8l5N5ybX5bvsCbyEOg"
  },
  "SO483KG3dSldKKbGjxvylQ": {
    "date": "7/6/2017",
    "text": "I don't know why it's taken me so long to try this place ! Being an Indian I tend not to eat out at Indian restaurants cos hey .. I eat this stuff every day . Was excited to try this place as it has the feel of Indian street food and a ton of veggie options . We got the Gobi manchurian , Kati roll and mango papdi chaat . Everything was tasty .. but be careful as an Indian I am use to ordering spicy .. well spicy here is extra spicy so definitely order medium it has a kick for sure . For those people who don't eat spicy you may want to order it mild , thankfully the manager was very nice about it and gave me a small portion of raita so I could finish my meal . I will be coming back here with my family partly so they can enjoy it but mostly so I can come with a bigger group and try everything on the menu !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HakQSK3srXsuGoGPduVWzQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Snapchat location services messing up --- the gobi was flavorful and crispy !",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HakQSK3srXsuGoGPduVWzQ/o.jpg"
      },
      {
        "img_id": "T2kGtkHhiqs3IOHj4Asu6g",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T2kGtkHhiqs3IOHj4Asu6g/o.jpg"
      }
    ],
    "user_id": "N9xfhzsNw4OyvLsq6PPewQ"
  },
  "jY3iDMN4BIoXXIMRBPGtUA": {
    "date": "1/1/2016",
    "text": "Maybe it's a new year, new good mood thing, but I can't help give this place 5 stars, simply because they deserve it. I come here about once a week with at least two of my coworkers, one from Northern India, one from Southern India, and they both are more than satisfied - in fact, they think this is one of the best Indian restaurants they've ever eaten at. I have to wholeheartedly agree, as the only time I've had better briyani was when it was homemade. We've tried a number of dishes, including chicken tikka (think of boneless chicken, red because of the marinade, and tender as if it's been slow cooked for days on end) and lamb and chicken briyani. We've also tried about 10 more dishes, the names of which I can't currently recall, and I can honestly say I've yet to have a single dish I wouldn't reorder. Also, the mango lassis are wonderful!  Overall, a great Indian place, a great dinner choice, and must-try if you like Indian or just want to branch out. Also, there are plenty of seats and the staff are all super nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "65ImPKzTM8FDDLEScDjVFw"
  },
  "Yj5Iasp46c5WOWBUONz9YQ": {
    "date": "1/21/2018",
    "text": "When you walk into an Indian restaurant and they are packed at lunch with almost all Indian people you know the food will be top notch and it was! Prices were only 10-15 for most dishes, the spice (I asked for hot) was perfect not over bearing but still had a good kick. The atmosphere had to be my favorite part by far. The environment was so casual it's almost like eating with extended family. Couldn't recommend them enough",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMtvN9k0R-h5F0E8yfjihQ"
  },
  "rah-RJa6AeNB0hmdcKHTJA": {
    "date": "3/4/2017",
    "text": "My new Indian go to restaurant on the south side!!  I had chicken korma and garlic nan and my sister had lamb vindaloo. Very filling portions! My korma sauce was exquisite I will have a hard time ordering someone different next time I go.  The lamb in the vindaloo was tender and the sauce had a kick to it.  The rice and nan were great.  You had to wait a little bit but everything is very fresh and that is why.  Loved it!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k76mUy3Z4sdKM_lJ4bZCKg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Garlic nan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k76mUy3Z4sdKM_lJ4bZCKg/o.jpg"
      },
      {
        "img_id": "nBwKtEN6LZqCQRVPXDroDA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken korma",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nBwKtEN6LZqCQRVPXDroDA/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "orHw88SZxfG2GzSCa6vAXA": {
    "date": "10/14/2017",
    "text": "Interesting Concept for me... Order at the counter and they bring it to you... They didn't have what I was craving on the menu but said they could make it. i ordered my standard. Lamb Saag, Garlic Naan, Chi Tea.. I was brought out promply, tasted good. Then you bus your own table and I left. Definitely not romantic but for an Indian Food craving at a great price. Definitely worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k7ee7p5MGgJZWf8Cmm5E-A"
  },
  "HgNLwPV8_dz6eGkb5tYt8Q": {
    "date": "1/28/2017",
    "text": "We got the chicken curry #54 and the lamb chetinad #52 with medium and hot spice levels respectively. We also got some garlic naan. The food was excellent. They made excellent suggestions and were very patient!  On to the food, the chicken curry was superb. It was extremely spicy (which we love). It was awesome!! The lamb chetinad was also good. It wasnt as spicy as the curry but the meat was very tender. The food was portioned well. I will definitely absolutely be back to try more items off the menu.   Great authentic lowkey indian cuisine in a nice area. Loved it!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NYehuvg_xXxkyG4F0y238w"
  },
  "aFO9_bNRAV_UeJmEz4AEmw": {
    "date": "12/7/2016",
    "text": "Pretty good Indian food. Not at all spicy, in fact all the veg dishes we tried were a little sweet for an Indian cuisine. I have tried this place a few times and it's been the same.  Not too expensive. I just wish they can take care of the sweetness. Big parking lot, so no worries about finding a parking space and very close to I485.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "arZgIT777whhjmsbflO-Vg"
  },
  "ZVowLIWdXs6hyXEHtbAa4Q": {
    "date": "1/27/2016",
    "text": "I must say this place has beautiful interior. I ordered saag paneer and a veg curry with rice to go. These curries were nice. litlle bit extra oily. The Roti was very very hard that i could not finish them.  so make sure your rotis (naan) are soft before you take away your order.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "59QH1A8zysr4SN_hX1Q9jg"
  },
  "tKC-eaQgyBk8zl3RZYW9Eg": {
    "date": "10/4/2017",
    "text": "The best Indian food is an understatement.Hands down the closest thing I felt to having authentic food from India. The Briyani, Chaat and Kulfi are all must try's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TtYLTBEQKpZH36DFY3q2ng"
  },
  "it-shcD1vN_2pAqJmY1IhQ": {
    "date": "10/29/2017",
    "text": "This place was \"okay\".  I saw dosa on the menu and wanted it but they were \"out\".  At lunch on a Saturday nonetheless!  I ended up getting a mixed vegetable dish that tasted like fresh veggies dumped in a can of tomato sauce and heated.  So much for medium spice.  My friend enjoyed the vindaloo dish but I wont be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "080X9AgXWLnZX77XeL4w1w"
  },
  "7TYZ8i64qprnNuM4HWjvCA": {
    "date": "9/21/2017",
    "text": "I always have a pleasant experience when I go here. The men at the counter are always so nice and welcoming. I love to get the chicken tikka masala with garlic naan. The flavor in there dishes is always on point and delicious. Must try if you are in Pineville.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIJCQr9lJim_WaUGm_z9fA"
  },
  "gk1FBgCEt8iRM-3T6N8USA": {
    "date": "9/3/2015",
    "text": "This restaurant is clean with super friendly staff and awesome food. What more could you ask for from a restaurant? The price I suppose. No worries the prices here are very reasonable too!   I found this place when a friend posted pictures of her meal on Facebook and I knew I had to find and sample the delicious dishes she posted. So off we went!  This is an establishment where you order at the front and they call you when your food is ready. I am still learning about Indian cuisine so I decided on my favorite - chicken tikka masala and some butter naan. When we sat at a table someone came over to wipe it down. It had looked clean to me but I appreciated the extra effort! The water glasses are off to the side and you serve yourself and pick up your flatware and utensils.   The food was so amazing! The butter naan was so warm, comforting and soft with an indulgent amount of butter (or was it ghee?). The chicken tikka masala was PERFECT! The medium spice level allowed for a slow build of spice without overpowering the dish. I drenched my rice and naan in the delicious curry to maximize my intake of the flavorful dish.   I liked the casual atmosphere and friendly staff. A man came to check on us during the meal to make sure we liked everything. The woman at the counter was happy to walk a newbie through some menu suggestions for his first Indian meal. I cannot wait to go back and I have my eye on the interesting fusion dishes they make.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "Z2GtDaW6rIr3DKN7AHNkDg": {
    "date": "7/31/2016",
    "text": "They were great. It's an Indian deli, really. Just what we needed on a Sunday afternoon. Interior's minimalist homespun kitsch. Menu's very street with some Americany favorites too. Very fresh taste, kind service, and worth the money  You should know going in that it's order up front, bus-your-own-table, and tipping will be extra optional. I 100% didn't mind, but I wasn't there when the restaurant's full",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xkZBjLZ5_cobmt4nNUMYrQ"
  },
  "A07oCSsmg15EG-S2RxUC7g": {
    "date": "12/29/2016",
    "text": "Very good food. We were little skeptical initially to try this but we thoroughly enjoyed the food. Chole Bathura is outstanding and mendu vada, plain dosa are pretty decent. It might be little expensive compared to other Indian restaurants but it's totally worth. It's clean and causal serving",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6TO_G0X6TAwtlZiwwBYc6Q"
  },
  "bprTcM9CK_Vzb3XVRGZDyg": {
    "date": "5/30/2015",
    "text": "Firs hand this is not a dine- in restaurant..It is Self service restaurant.We went during busy time..We had to wait around 30 mins for our food..That was probably due to busy period..We got the appetizer after the main course which was not a good thing..  Coming to quality of food..We ordered for Chettinad curry which was tasty and Naan was good.Appetizer Paneer Chill was just OK!.  I am also not sure about how the Chats taste..That might be the highlight of this restaurant..  Overall i would rate restaurant just OK..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2v8lWPa7yRhb5kuAILcsw"
  },
  "E6CRyHCpaLj_sZmqAw5JEw": {
    "date": "9/22/2017",
    "text": "Some of the worst Indian food I have ever eaten at a restaurant.  Driest meats possible and very low on flavor.  I mean inedibly dry and overcooked chicken.  I ordered the mixed grill so I got to try several things, and they were all horrible.  Even if this place improved by 90%, it would still suck.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFP5b5ZXPHmtiFjD-Kftiw"
  },
  "w7dWBPto12IdBVXEOk5BuA": {
    "date": "5/28/2015",
    "text": "Loved the food. We tried tandoori chicken. It was really good. Place is clean  Worth trying",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gdDZqGFlG6fCkqLfl_ROLg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Samosa chaat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gdDZqGFlG6fCkqLfl_ROLg/o.jpg"
      }
    ],
    "user_id": "Hfz8JUKEIe2Wv4CGwsLUpQ"
  },
  "YQJEg6-Fd6648hQHM5iZeA": {
    "date": "6/17/2016",
    "text": "Stopped in based on reviews on Yelp and was very pleased with entire experience. The staff was so friendly and helpful in giving suggestions for selecting our dinner choices, as it was our first time here. Service was very prompt. We ordered the garlic naan, chicken tikka masala and sambosa chaat, the rich and savory flavors in each dish were so amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OObgTVCI-P7DbUxjtr-1GA"
  },
  "hVnTCGPZ-3Ke7Sw9pP7DBQ": {
    "date": "7/16/2016",
    "text": "Amazing!!! Excellent customer service and food. We love this place!! The curry cauliflower appetizer is incredible. You can't go wrong with anything here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "enfRXLflxfLgfBP9_l7DGA"
  },
  "7t0OLDpJzPQehCNeA5Gg5A": {
    "date": "5/26/2015",
    "text": "It is like Indian street food place. Lot of options like southern/south/North Indian fast food. It was my first time so had panipuri and samosa chat and food was \"yummy\".",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EtGVRVAT7D3Gbx5usDW0EA"
  },
  "GDyZDM8oNmte9sEFzuC6WQ": {
    "date": "8/3/2015",
    "text": "Very good and quick Indian food. The menu has a variety of options from traditional Indian food to indochinese food. The staff is very nice and will explain any items you are unsure of.   I recommend the chicken 65, it is amazing and probably the best I have had in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4KgQeGgMaEG4zVANMsd6Dg"
  },
  "bSLB7gKLayAMLmyqUW6WSQ": {
    "date": "7/11/2015",
    "text": "Yum.   We went here on a whim and we will be back.   Prices are extremely reasonable. I should have branched out more as the people around me had amazing looking food, but I had no idea what most of it was.   Waits for the food were long, but it was late on a Saturday night and the place was packed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWKhXG_Uk-8G3OVQiA_ZDQ"
  },
  "L8xQkwt7kiOCevEX1prftw": {
    "date": "7/12/2016",
    "text": "I got the pick-up for dinner. Great food, great flavors. I got chicken biryani and samosa chaat. Excellent taste. Not 5 star experience, rather 4 star. So, taking away one star because he gave me sweet yoghurt with biryani which is never the case in my dictionary. All good though !!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iiGZbQ6UdCs2IxBsRgXhxA"
  },
  "AOYr1CerXtXDn9RbdTgm2w": {
    "date": "9/2/2017",
    "text": "Tasty food but very disorganized service, average waiting time for food is 30-45 mins.staff is not quick and attentive at all. Being a full self service place makes it more worse. Tip: try visiting on a weekday",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Rm7q-QFS0okulupJOC4LA"
  },
  "uBOmOPN0igsvN_HfIFQvTg": {
    "date": "9/8/2016",
    "text": "Great experience! The owner walked us through their featured items and he ended up selling us on about half the menu because we couldn't choose! We love Indian cuisine and we get it everywhere we travel. They have best Mango Lassi I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLQjrTvidY_0HGtzHemhSA"
  },
  "XNuUfchD-U0btDrAtUX31Q": {
    "date": "12/29/2016",
    "text": "Best authentic, not fancy, Indian food found in Charlotte so far...   Decor is sparse, you order at the counter, and you pick-up your plate + flatware... all of which may be a turn-off for some patrons. However, it is typical of the food servicing in India and many southeastern countries (not that India is one of them, but it ain't that far away...).  Portions are generous, food is fresh and tasty (don't forget to be clear about the level of heat you want - they are pretty spot on: mild is mild, and very spicy is for the strong of hearts). Bread is baked on demand.  2017 goal for our family is to try every single item on the 100+ choices...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Chwna8XrCW2iYbzGwWYB2Q"
  },
  "Q1J35bXCB8zogZWR6WkeJA": {
    "date": "10/21/2016",
    "text": "Great food and awesome service! I will be back here the next time I'm in Charlotte. I had the chicken tiki masala and garlic naan. The lassies are also a nice treat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8moap-s1c6Ciccej1Ilj9Q"
  },
  "3r-hciKSB-5_OefMiq7Afg": {
    "date": "5/28/2015",
    "text": "Something South Charlotte has needed.   A mix between sit down and fast food Indian food with a diverse menu.  Been there a couple of times, service and food has been excellent.  Place is new, hopefully it stays this way.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kj85fgBkK9xi4nDFF4d3aQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kj85fgBkK9xi4nDFF4d3aQ/o.jpg"
      },
      {
        "img_id": "9CiqJ0GSo9URZLO5zCvueQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9CiqJ0GSo9URZLO5zCvueQ/o.jpg"
      },
      {
        "img_id": "JhU72mLr_zaFdt3C62w0bQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JhU72mLr_zaFdt3C62w0bQ/o.jpg"
      }
    ],
    "user_id": "fZoXZmSR-xnpjG5zi7ALrQ"
  },
  "4N7ds6RzDsLJV7VuPLyp8g": {
    "date": "12/21/2016",
    "text": "Shopping.. and decided to stop n slow down!! Terrific Service .. and food !! Thank you !! And You soup is amazing !!!  Great end to a long day !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hAwXVNYmRDb-9hXUUplVJg"
  },
  "a8LXaROpFAfUL13QWglHFg": {
    "date": "8/22/2016",
    "text": "We used to love this place but today the taste and the service was completely disappointing. We wud never like to visit this place again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9eKdTg76cv5v1n3WH0PSw"
  },
  "KiP3BBrctds6QiUa7oZMNw": {
    "date": "6/21/2015",
    "text": "Tried this for second time and my previous comment was considered as feedback by the restaurant and I was offered to try pakoras again and this time they were good. Still haven't got a chance to try main course items yet.. Will surely go there again and update the review.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2pJ278LdrTwBRjIgKIJ-Vw"
  },
  "h4xUzno_2VsBswMqoAPN7w": {
    "date": "5/28/2016",
    "text": "I stopped in here on a whim with the help of Yelp and got an old favorite, the Pav Bhaji. It was so good and it's one of those flavors you never knew you needed. The garlic Naan was also amazing. The staff was super friendly. This place is a good 25 minutes from my house, but I can't wait to try more of their menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSQ1e1SvcLeLeyD367gWqw"
  },
  "uKiNccMkadZb7SfMs_lY8A": {
    "date": "11/22/2016",
    "text": "It is the closest to authentic Indian cuisine you can find in the greater Charlotte area.  Casual Indian eatery kind with real good appetizers ( read street food/chaat(s)), not a fine dining kind of place. Also would recommend - non veg thaali. Heads up - self serve kind of place : you need to go to the counter and order , pickup your silverware and drinks from a common kiosk etc etc",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LCvlvEpaqbP0y8AivBmddQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken momos for specials tonight! V v Impressive!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LCvlvEpaqbP0y8AivBmddQ/o.jpg"
      }
    ],
    "user_id": "FvivYrK-o2dp_Sk5ips8nA"
  },
  "N7Xt1vqfQV-eXQ5nOIFcKw": {
    "date": "9/10/2015",
    "text": "It was pouring a couple of days ago and my bf wanted Indian food on the way back home. so we decided to come to Chaupaati! They just opened for dinner service when we arrived after work. It took us a while to decide, everything looked so good, nothing is better than Indian street food. We ended up ordering the Aloo Tikki Chaat, Gobi Manchurian and the Chicken Tikka Masala.   I docked a star because we asked how crispy the Gobi was and the cashier assured us it would be crispy and had even put in a special note to the chef to make the dish extra crispy. It tasted amazing but the gobi was borderline soggy even after the special request. The chicken tikka had really good pieces of white meat, it was so succulent! The chaat was huge and also tasted wonderful, it was a little pricier compared to Rajbhog but worth it.   We will definitely back for more! Cheers!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "SWhwxfzD-s7F_Dt-oD5OPw": {
    "date": "7/31/2016",
    "text": "I live in the country we traveled about 25-30 minutes to eat here based off of reviews online.  We were starving after a 5 hour kayak trip today, and wanted something delicious, and Indian was calling our names!  Located in a small shopping center it was pretty easy to find, and there is plenty of parking.  When you walk in don't do what we did and look like idiots wondering around. Go to the counter, order, and pay.   Then pick up your plates, and a glass of water.    I  wanted to try something new, so I asked the waiter pick something for me. He was actually super funny, and asked me several questions to see what I would like,  and gave me two suggestions, and I had him pick.   I normally get chicken tiki marsala, but I Took a chance and it was awesome!    I'm actually not even sure what I ordered but I did post pictures.    As far as the vibe goes it's pretty casual, and kept clean. No need to get dressed up.   Also, I think you clear your plates too... Or at least we did.   Bathrooms were clean too which is important for us ladies!   We went on a Sunday evening and it was packed. Lots of families coming for a meal. I'm not sure if that's a regular thing, I have some so it doesn't bother me to hear kids being kids.   Just a heads up Sunday night was not romantic date night lol. I liked the feel, there were a lot of regulars, and the wait staff seemed to remember them. This speaks volumes for the customer service here.   We also ordered this little leaf thing called a paan. I suggest you try it, keep and open mind, they are 2.99, and you can share one. Just do it!! YOLO!  The only thing I have to say that was negative... If this is even negative, was that the TV was too loud, but I really didn't care to listen about politics while eating. I would've much rather heard some Indian pop music.   Pricing was pretty good too. We got four dishes, and two sides of Naan, and spent 60 bucks. The food  was so good we bought dinner for tomorrow. I got our waiters other suggestion for me, and I'm so excited to have it tomorrow. With all that quality food our ticket was only 60. That's not too bad if you ask me. The portions were huge, we finished our plates.   So in closing, check this place out it is well worth it, and order food for the next day like we did!!   ** To the owners**  You all have a fantastic establishment, the employees were helpful, and kind. The pretty young girl behind the counter was sweet, and our waiter who was a young guy from Nepal gave us the best customer service we have had in awhile at a restaurant.  Your cooks should be winning awards! The dishes we had were by far our favorite of any places we have tried in the state thus far.   We shall be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "O7Q26GKxq6Eib2lKXBy4bg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. This is Paan, try it!! Don&amp;#39;t be scared!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O7Q26GKxq6Eib2lKXBy4bg/o.jpg"
      },
      {
        "img_id": "b98u6aCbJqCcFrPGFdSBHQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Naan... So good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b98u6aCbJqCcFrPGFdSBHQ/o.jpg"
      },
      {
        "img_id": "9tMDzRdWcYVWm2zgmwvFtQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Come in and order at the counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9tMDzRdWcYVWm2zgmwvFtQ/o.jpg"
      }
    ],
    "user_id": "I3ryn4tf6L9YbuZ8ZC4IoQ"
  },
  "dJOC7CeDcWvmk5dQEFNn2w": {
    "date": "7/7/2015",
    "text": "I love Indian food and even more so when it's fresh and tasty and interesting. Go beyond the boring curries and you've caught me. And so when I stepped into Chaupaati and inhaled the sent, I knew that I'd found a good spot.  Bummer that it was only me and that I could order a bunch of stuff to share. So I just ordered a Aloo Tikka Chaat, spicy. And spicy it was. Loaded with heat, onions, chick peas, chopped tomato and somewhere under there, potato. I cleared the plate. And if there weren't other people in the restaurant at the time, I'd have picked it up and licked the plate too.  Very tasty, not expensive. Yummy Indian food.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "fQgjqYiPP6oEmsulbCd9GA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Aloo Tikka Chaat at Chaupaati",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fQgjqYiPP6oEmsulbCd9GA/o.jpg"
      },
      {
        "img_id": "3UTDa7megxUiQHGjfn1UPQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chaupaati in Pineville",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3UTDa7megxUiQHGjfn1UPQ/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "IU5RqA5NO48xNH_inKStvw": {
    "date": "6/30/2015",
    "text": "I recently made a field trip to Chaupaati, as I love Indian food; I've been eating it since I was a kid growing up in New York.  The restaurant is set up as a self-serve style - order at the front, get your silverware from a kiosk and they call your name when it's ready. There's a selection of Indian beers, fountain sodas and canned sodas.  The owner is very friendly. He asked where I had heard of his restaurant and if it was our first time. He also followed up with us at our table to make sure we were enjoying everything.  I ordered some standards to check them out:  Mulligitawny Soup: the flavor was 4 star, the portion was 3 - more like a cup than a bowl = small bowl.  Samosas: nice texture, served hot, a little heavy on the cinnamon and cardamom for my tastes - 3 stars  Assorted Pakora: nice spicy kick to the batter - the cauliflower and spinach were especially good - 4 stars  Chicken Tikka Masala: the flavor was right on target - tender chicken - the sauce was creamy, buttery goodness - again, the portion was small for $11.99 - maybe 10 small pieces of chicken - flavor = 4 stars, portion 3  Naan: hot, fresh delicious - 4 stars  3.5 Stars over all in my mind, rounded up to 4.  I would recommend that if you are to try Chaupaati that you come for lunch, as the prices and portions seem more appropriate.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "TRfO-WcHum6r-7J7hIuQyg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken tikka masala",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TRfO-WcHum6r-7J7hIuQyg/o.jpg"
      },
      {
        "img_id": "Au5KozGKX8YZeIsFToMJew",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Au5KozGKX8YZeIsFToMJew/o.jpg"
      },
      {
        "img_id": "5r89pAC3FUMwgknFoaJ6eg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Mulligatawny",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5r89pAC3FUMwgknFoaJ6eg/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "x-ph5Ufkq47om-fdgq0KDw": {
    "date": "9/3/2017",
    "text": "Now this gem is my fav for Indian food, they are very clean and very helpful, I stopped by for lunch and I couldn't leave any more happy and satisfied with the food I had! I ordered the chicken tika (no spicy) and it was glorious I enjoyed it till the last bite. I wish this restaurant were here when I was living in pineville.   Now this restaurant is not fancy and have no servers, you order at the register and they bring your food out.   Once you try it you can't go back lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGqGZbIvlSynFAMPX9DaiA"
  },
  "Iyix3Pvanz4hNliPPWxa1w": {
    "date": "7/1/2018",
    "text": "Very disappointed, high rating restaurant with poor quality food. Chicken in the beriani tastes bad like it has been cooked for a while before, you can tell that this chicken was cooked as a separate cousin, then they've decided to cook it with the rice to make a beriani out of it. Chicken with butter or makhani also not tasty at all. I eat so much indian food that I can differentiate between good and bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_uW4JkiacQtxG2cbUNxyQ"
  },
  "iZNrJXzOLG6JcN5EgONdjA": {
    "date": "11/19/2017",
    "text": "Amazing food. I'm a nubby, and loving every bite. The two friends with me are experienced Indian eaters and they are looooooving it.   Service is fantastic. The staff works the dinning room making sure everyone is enjoying their meal. Will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FCDSRp1vZoq6DWfdZCjnLQ"
  },
  "x8rGmt2-S-Pp8KHeFp8e2w": {
    "date": "10/18/2018",
    "text": "Horrible chats...  You can make better at home looking at YouTube.  Had a stomach infection after eating chilli paneer",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A278PBX7jWnFpH_UKoL8MQ"
  },
  "p-Tinv3N4gCASzF4Off1Yw": {
    "date": "5/28/2017",
    "text": "I am so impressed with my trip to Chaupaati. The menu clearly stated what was vegan and what was gluten-free. As a newly converted vegan, it can sometimes be stressful and intimidating going to a new restaurant.   The people working there were more than accommodating to my dietary restrictions and the food was outstanding. I worked at an Indian restaurant during college so it was great to get some familiar tastes along with my stress-free vegan experience.   The atmosphere is casual, you order at the front desk and sit with a number. Water, silverware, extra plates and napkins are self-serve. Bus your table when you're finished!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgeCK5Csgsx9qYiB9hpHtQ"
  },
  "FpL7wtDP_jbSKIIR-syDZA": {
    "date": "3/5/2018",
    "text": "We went for lunch after a long day, I love this place for their small plates and quick bites. They have authentic North Indian delicacies. Food tastes good and fresh, must try chicken 65 this food reminded me about roadside dhaba in India . I would recommend this place for quick bites and chaat lovers. I would recommend if they can go little bit less on the prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e_XujvCX_XOpzMapLL4hfg"
  },
  "RYK9bytKkVKqxUOV32twIg": {
    "date": "6/3/2017",
    "text": "Yummy. We had assorted Pakora as an appetizer. Our entrees were Lamb RoganJosh, and Chicken Tikka Marsala, both with medium heat.  Wow everything was great.  You order and pay first. You get a number for your table and they bring the food to you. Also water, silverware, napkins and extra plates are at bar/station area for you to pick up.  The menu has GF next to all the dishes that are gluten free. They sell beer and wine. We will be back with friends and family.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "aLXpgfLh0lvTxHrfng2ONA"
  },
  "2WRO35G8I5mGWDeCsGapkQ": {
    "date": "6/30/2017",
    "text": "This place is fantastic. It is as \"hole in the wall\" as you get in Charlotte, meaning it resides in a strip mall. The place is self service; but for your trouble, you get some tasty food. The menu requires some translation and foreground knowledge, some research is probably helpful - that's why you are on Yelp right?  The nice man behind the register gave some suggestions, and suggested we try some Chicken Tikka... thanks, but no thanks.  Total bill for 2 was $30. Had a Samosa Chaat, a lunch portion of Chicken Korma (comes with 4 Butter Naans), side order of Garlic Naan (4 pieces), and a lunch order of Pakora. More than enough food, could have probably cut the Garlic Naan order and Pakora. Everything came out tasty and perfectly prepared. This place is legit, possibly the best Indian flavors in Charlotte. No pretension, all business.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9kO-feVTNdDRYIP_yM2o6g"
  },
  "z11WPHoex5cX1L9xJB6b9A": {
    "date": "9/22/2016",
    "text": "My girlfriend (a vegetarian) and I eat out in Charlotte several times a month. We keep a list of delicious restuarants with acceptable service. This restaurant is DEFINITELY going on our good list!   It's a casual, order at the counter / bus your own table kinda place but you get real dishes and silverware. Decor is cute and welcoming.  Also, we were greeted and sat like it was a much more formal place.  The food is OUTSTANDING.  I had chicken Tikka Masala and she had the paneer. I had the garlic Naan -- DELISH.  It's funny because we stumbled on the place by accident because we left an Italian place not far away that seemed expensive and boring. We actually spent more for lunch than we would've there (around $15) but didn't resent one dime.   It's hidden next to bi lo behind Starbucks. I definitely recommend this place for a laid back delicious lunch!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rJlIraI4-qINB5q2XhUSvA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken Tikki Masala",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rJlIraI4-qINB5q2XhUSvA/o.jpg"
      }
    ],
    "user_id": "4GSabvbQOvdcr0mJtJyd_A"
  },
  "EuXjpt8uug1UuUn1XOMimQ": {
    "date": "3/27/2016",
    "text": "Just Wow!!!!!!!!!!!! LOVE this spot!  I ordered take out to try it out and it was surprisingly delicious.  The chicken tikka masala was cooked to perfection.  I'm got it hot and it was very spicy, which was perfect for me.  The garlic & butter naan is a must to try.  I definitely will be back again.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 13,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "SrkgHvWG6PyX8opfNFo_OA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SrkgHvWG6PyX8opfNFo_OA/o.jpg"
      },
      {
        "img_id": "EaYTfwKtMSqWtU5O4CqaxA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EaYTfwKtMSqWtU5O4CqaxA/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "SF-XRhB1pasdM_7GVphf8w": {
    "date": "4/28/2017",
    "text": "One of my favorite Indian restaurants in Charlotte area. Love the quick and friendly service and their huge Indian snack menu. Been here a number of times and can confidently say that I have never been disappointed even once. Personal favorite is pav bhaji and the flying horse beer.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kpKSzHZtOX0V-xtpHL1XKg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Decor",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kpKSzHZtOX0V-xtpHL1XKg/o.jpg"
      },
      {
        "img_id": "hiUN5FbXCqAh6yZ9eO7sqA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Pav Bhaji",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hiUN5FbXCqAh6yZ9eO7sqA/o.jpg"
      },
      {
        "img_id": "_yH8V-ijr8IwlwQxmrWxIw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Masala Dosa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_yH8V-ijr8IwlwQxmrWxIw/o.jpg"
      }
    ],
    "user_id": "AL4ef6IZAw9YwIfXw61ZyA"
  },
  "t34QqyJ41QjGyhMolCZaDQ": {
    "date": "6/7/2015",
    "text": "Good food at great prices  I came with a large group of people for dinner and the restaurant did not let us down. The food was great, from the gol goppa to the samosa chaat to the gobi manchurian, nothing was a disappointment. The garlic naan was piping hot as was the chole bathura.   I'll definitely be back here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fKo4sb525L9n_N3hOpnMBQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fKo4sb525L9n_N3hOpnMBQ/o.jpg"
      },
      {
        "img_id": "9lMLHzHbVncdt2ZSX461zQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9lMLHzHbVncdt2ZSX461zQ/o.jpg"
      },
      {
        "img_id": "n_AnQNaGlBZDN-lssgKzUw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Wall mural",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n_AnQNaGlBZDN-lssgKzUw/o.jpg"
      }
    ],
    "user_id": "tGtZMxE0i6YIix63SrfFwg"
  },
  "QHti7iaPHScIHLhdhfiZYg": {
    "date": "3/31/2018",
    "text": "Best Indian cuisine in Charlotte...hidden treasure!  Our first and we were very impressed by the vegetarian and gluten free options.  This will become a regular weekend must have.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J0dPF2KQaCjlG2Iz0V4cgw"
  },
  "i6NePK0C7j-HXP4TIXRVBQ": {
    "date": "4/22/2017",
    "text": "This is the best Indian food in Charlotte. They have a ton of options and our whole family loves it. They can be busy at dinner but we've always been able to get a table and served quickly. Being busy is a great sign.   They do not offer buffet style but if you're unfamiliar with Indian food I suggest that you order several things until you find a few favorites. We have not had a bad dish yet. You can choose the level of spiciness to suit everyone's needs. They offer several varieties of Indian along with our favorite, southern.   The staff is great and always very welcoming. My daughter once had a bite of my food and it was too spicy for her. The staff saw this and offered her some drinks to help with it. One of the most amazing gestures I've ever encountered at any restaurant. I was afraid that the experience may have turned my daughter off to Indian but she still wants to go back all the time.   Whether you're new to Indian or an old hat, I can't recommend this place enough.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YmRuR99kQYOyHxtCXia5nA"
  },
  "YdQOTILzY8cJkDogIbiODQ": {
    "date": "12/4/2017",
    "text": "This place has such a great variety of food and the ambiance is very welcoming. Everything i have tried has been excellent. My favorites include chilli paneer, dabeli, samosa chaat, butter chicken, garlic naan.  These are just few to name but none of the dishes will disappoint. Customer service also is wonderful. The staff and owners will ensure customers leave satisfied. I highly recommend this place to anyone who wants to enjoy casual indian dining !!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "BWMtteGOa6rntC1cc9dIDA"
  },
  "OeKRl_HmYgtb0sQaDUmOsw": {
    "date": "8/24/2015",
    "text": "My wife and daughter visited the restaurant last weekend, and insisted that my son and I try.  All I can say is this food was amazing, I had the Prawn Curry my wife and daughter had the Chicken 65 with fried rice and for my son he had the Naan Pizza and French fries.   I would highly recommended this restaurant and I will be dining with them again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XfSRXmUwaCRzxFl9cuVNiA"
  },
  "pZva7ojhZQch04fV81yEBA": {
    "date": "7/12/2015",
    "text": "We visited twice in last 1 month. amazing owner amazing food and amazing service.. you have to clean table yourself but thats good that way they can keep the food price less..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lO8kSnhx2hkcv94AphGvyA"
  },
  "1JXfH5BEvI5csJqRup4n-w": {
    "date": "1/18/2016",
    "text": "great place to eat , yummy food and friendly service , love to go here with my kids . My daughter and i  usually order the veg thali and my son loves the shahi paneer . They also have different types of chaat which is amazing , OVERALL GREAT PLACE TO GO FOR  QUICK YUMMY FOOD !!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5wfnxor4tr6sNaJaa6SkA"
  },
  "-9_0K2bufK352bje5n_aqg": {
    "date": "5/22/2016",
    "text": "Great place! Loves the taste of thali! Will definitely come again! Very happy with the service as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cgVCqocepa2z3qU_uZFsqg"
  },
  "cSYbeRIR6TvjywDTfBjO6w": {
    "date": "5/3/2016",
    "text": "This is excellent Indian food at a reasonable price.   We tried a little bit of everything and liked it all.  The samosas are outstanding.   Our naan was slightly over toasted but it had a strong garlic flavor.   You do have to bus your own table but it makes really good Indian food affordable then I am in.   I would definitely go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYWFPPuGH3XY-9XteZEKzQ"
  },
  "KUHFayLTXTUl_XoyLD92vQ": {
    "date": "7/3/2016",
    "text": "We recently got catering done for a big event. Chaupaati did an excellent job. The food was really tasty, they took extra effort to make sure that the food was according to our specifications and did not cut any corners. Sandhya from Chauppati was very professional and very responsive, and put lot of effort to make sure everything went well.  We had asked them to deliver the food to the event and also stay there for the duration of the event to warm and refill the food for a small cost. They reached the event ahead of time, which was great. It gave them enough time to lay the food.  I have had bad experiences in the past with other restaurants where the food delivery gets delayed  and causes unnecessary stress for the host. Overall, Food was excellent, service was excellent, the staff (Sandhya and Krishna) were very personable and helpful.  Will surely use them for or next catering!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ALryx-_XDOKF53bpzZ9iA"
  },
  "XOQzSFWgCYnbMARcMVe2HA": {
    "date": "4/26/2016",
    "text": "Incredibly delicious Indian food at very reasonable prices. It's rare to find an Indian restaurant that also serves street food dishes. If you haven't tried Indian street food, this place is a gem. The samosa chaat, paratha, chicken tikka masala and Goan curry was amazing. I was impressed by the deep flavors compared to other Indian restaurants. Also very friendly staff which is a plus.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQ_53wBhllEip0siaSrpjQ"
  },
  "niDfPWAnj29rOCzA0geopw": {
    "date": "5/20/2015",
    "text": "The best Indian food I have ever had! I got the Chicken Tikka Masala lunch portion. It was so full of flavor. The chicken was tender, and the masala gravy was so tasty, I dipped my garlic naan in it.  My husband got the Tandoori Chicken (Half). It was great. If you love fried chicken, then you should definitely try it.   We got the 5000 beer to drink.   For dessert we tried the Assorted Sweets which included 2 Gulab Jamun (my absolute favorite), some Gajar Ka Halwa (who knew carrots could be a dessert!), and some Kheer (great texture and light sweet flavor).   I can't wait to go back again.  Price was right and food came out quick. Great job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5w0A4t0YV1QU52jKOjKzrA"
  },
  "RH4pULQN6UJgGxeGsZGy4w": {
    "date": "6/8/2016",
    "text": "Awesome food... I was not a fan of \"Bahar ka khana\" Indian food in charlotte. But after trying from Chaupathy, I feel it's by far the best anyone can get here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NpnFO-DxzWyITk1HeLhyrQ"
  },
  "0KvmLRxh0Ry_Ljt1WfXGuw": {
    "date": "6/3/2016",
    "text": "I LOVE LOVE LOOOOOOVE this place. The staff are always so pleasant and kind and the food is AMAAAAZING. My coworkers and I eat there atleast once a week and they're kind enough to walk our meals next door.... which we truly appreciate. They're also super funny when we go in. Hurry up and go, I'll probably be there when you get there... hahaha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2g0E5Gw9pe_ZQR4CxBlDw"
  },
  "LAwmMDtoKk6gjLeoDBJOGg": {
    "date": "6/3/2016",
    "text": "The food is always fresh and cooked to order. Some of the best Indian food I have had in the Charlotte area. Service from all employees pleasant and friendly. If you are a fan of India2 cuisine give ot a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xhnum3Z2b7YuaMa-LVvl3Q"
  },
  "S2rUWb6RQv64XfXHrRGdYg": {
    "date": "5/19/2016",
    "text": "Excellent, authentic food.   Four of us had a variety of dishes and they were all outstanding.  My son said it was the best tiki masala he's ever had and he frequents Indian restaurants a lot.  You look over the menu and then you go up to the counter to order.  The friendly, helpful staff will bring the food to your table when it's ready.  They have the gluten free items clearly marked on the menu and there are plenty of them.  Definitely our new favorite restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eM8H8Isk1C09IwnxqbKm8g"
  },
  "pTjoQeVUnC33liSoboItgw": {
    "date": "2/27/2016",
    "text": "This place is amazing. The staff is so friendly and the food is out of this world! Reasonably priced. Wonderful casual atmosphere. We will most definitely be going back (possibly tomorrow).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9bg4pAQrn92R2cWSDo4iGw"
  },
  "YRMWIwX8Jgs6boLuPqNzcg": {
    "date": "2/19/2016",
    "text": "Authentic Indian food, great taste! We try going at least once a week. Very friendly service as well. Try their thali and dosa.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpAnwXR4MDLxs9RbWZIj9A"
  },
  "osrGk6MIJzWZ0bMh3f7-SQ": {
    "date": "12/19/2015",
    "text": "Stellar food, and an extremely friendly team running this restaurant. Food is great for sharing. The lentil soup was by far the best soup I've ever had. Love!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VrtvI46dgOcMxMVYqWZqOg"
  },
  "RDmjkQ83poyEnKIN1BKOHQ": {
    "date": "9/1/2015",
    "text": "Stopped by here during visiting Charlotte. Nice ambiance, decor. Very clean. Good variety of food. Very filling. Surely will stop by again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0FM5huNJ9w3buvF4R4iSQQ"
  },
  "XoxWv1F26Yl7lU4PMd5MMA": {
    "date": "11/22/2015",
    "text": "Very good food. Slightly expensive for the concept (it's not a full service restaurant, but rather an \"order at the front\" type of place), but the management is very responsive and friendly. We had the lamb rogan josh, chicken tikka masala, and garlic naan; the garlic naan was the best I've ever had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UOUnwKQ7yhCxWD4JJKZgg"
  },
  "MVNRtNGOkJ9lD_CnvMvNsg": {
    "date": "2/15/2016",
    "text": "Haven't had Indian this good since I lived near Washington DC.  Chicken is always tender and fresh. Great and complex flavors from a variety of dishes I've tried which I believe are made with imported spices.  Even the basmati rice alone is authentic and delicious.  They also feature a weekly special that is not on the menu which is great for me and my wife as we like finding new dishes to try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BzBKF5ClVolXL08QtUAPA"
  },
  "oUEqXsZJRSkuMOZHrbSFlw": {
    "date": "5/17/2015",
    "text": "This is exactly what Charlotte needed - a place serving authentic Indian chaat!!! Tried the papdi chaat and dahi puri, and they were ammmazing! Also, tried the chicken Biryani, and thought it was decent....Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDLf17mAdY-jx_ri6JT9Gg"
  },
  "NSGGXug57VFF3dIXcPY1Gg": {
    "date": "2/5/2016",
    "text": "Great service but the food wasn't great at all. Food taste like it came straight out of freezer. Texture and taste was both were bad. Not going back !!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2oANC3g7KScY7QpiuxqHg"
  },
  "lNI2va8Tkn2bG5Af4s3-9g": {
    "date": "1/16/2016",
    "text": "My friend and I ate here last night after looking at bridesmaids dresses at Mecklenburg Bridal Gallery. The food was really good but even better than that, the manager was really nice to us and helped us pick out what to eat. He seemed to genuinely care whether we were happy or not and make sure we were enjoying it. Will definitely come back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H-fmmpCTrL7--ya3aStXLg"
  },
  "X05Nkg5rOpibl-qZ-SoyKg": {
    "date": "10/10/2015",
    "text": "This was our first visit and probably the last visit. We went there for dinner and was very disappointed. Maybe we should have ordered the chat items and probably would have liked it. Of all the items we ordered Medhu vada and soup was inedible. Rest of the items were just okay. They charge 14.99 for lamb and goat dishes, that's the price we pay in other restaurants  where it is not self service, the ambience and the decor is nicer, the quantity is more and the dishes are way more tastier. Anyday I would prefer curry n cake or Rajbhog for this joint. Way over priced.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XeN9_t7CZp8apE_9R97jPA"
  },
  "-WY9JFubf38Av_3WQsNRPw": {
    "date": "8/14/2015",
    "text": "The food is ok, ordered bhaigan bahar was served gravy without bhaigan(eggplant) in it. They had good food when they opened but after that it has gone down with every visit. I would rather goto Rajbhog",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JlWo7vFuSDuqNCSvcgGaOw"
  },
  "ygDgrZYVHGs1hJkZARGGmA": {
    "date": "3/20/2019",
    "text": "This is hands down our favorite Indian place in the area. We go quite frequently and the food is always amazing.  The restraunt is clean and the staff have always been friendly with us.  Don't let the unassuming store front or location fool you. This place is a gem.  If you like Indian food even a little you need to try Chaupati.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JvW2xxd3sTub-kzpZCTl8w"
  },
  "Vko4xw-qSPkKU2I3akUybQ": {
    "date": "4/10/2019",
    "text": "The most delicious and friendly Indian restaurant. Always greeted with a smile. They know me by my last name and spoil my daughter every time we go in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3DOKFJ9L1KKQzYATGSaBg"
  },
  "EvZcxoqvZ5yEjwt6d44Auw": {
    "date": "5/1/2018",
    "text": "My family and I enjoyed a family dinner here a week. We ate Mulligatawny soup, Aloo Gobhi, Malai Kofta, Naan and Mango Papdi Chaat. Let's say \"spicy\". I order mild for each and we had to return a entree because it was just not edible.   The soup and appetizer was delicious. We enjoyed ourselves (and the food) so much we order from the restaurant 2 additional times.   It gets busy and seating is limited but worth it. The staff was helpful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bxvKBhFi7mcKr55M-Ev-qA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bxvKBhFi7mcKr55M-Ev-qA/o.jpg"
      },
      {
        "img_id": "KOoBbtjl6fcBf83FBEz5Jg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KOoBbtjl6fcBf83FBEz5Jg/o.jpg"
      },
      {
        "img_id": "IyB4XMjcAjRWOe4n78LZEg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IyB4XMjcAjRWOe4n78LZEg/o.jpg"
      }
    ],
    "user_id": "5VWKu2prweZqKGdYdTKU5Q"
  },
  "a9fvJshbzgvg5KCOYIpJUg": {
    "date": "2/7/2018",
    "text": "Hold up! Chaupp what you're doing and come to Chaupaati! The fine aroma and exotic flavors will have you experiencing True authentic Indian cuisine. I highly recommend the chicken Goan (a coconut curry). I got the Goan with the lamb, however the chicken, which I tried in the butter chicken, was very tender and would have made the dish even better. Although I was very pleased with the entrees, I do not recommend the dessert. The ice cream was so frozen, it coulda froze a desert! Not quite the des(s)ert I was looking for.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "pk5C9lcuskGI_crBTTljig"
  },
  "03Y8ZFo-5sPnWyO9Cjy2nQ": {
    "date": "6/26/2019",
    "text": "Soooo good. Great vegetarian options. Even though my friend and I were new to Indian cuisine (and were also the only people there that were obviously not Indian) we were treated SO KINDLY. They were so nice to us and talked us through the menu with a smile. Awesome food, awesome experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lbvcVfHkcmUQk4jcDTX-g"
  },
  "76FfMyL7XuGWhs0cKVg6Fw": {
    "date": "3/12/2018",
    "text": "Tonight was my first visit. I told the gentleman behind the counter that I love lamb vindaloo but it wasn't on the menu. He immediately said to me it wasn't a problem and they would make it for me. How great is that?!?! He also asked how spicy I would prefer it. (I like it very spicy.)  I took it to go and when I took my first bite, I was blown away. Excellent! And the spice/heat was spot-on!! I'll be a regular customer now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KBzMPZ995SBPUqUeb7JpzA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KBzMPZ995SBPUqUeb7JpzA/o.jpg"
      }
    ],
    "user_id": "CfDnM_Wi4DnwEtDAkA4gwQ"
  },
  "QTzCfuQd5wqj4h0SCVGCJw": {
    "date": "6/24/2018",
    "text": "The food here is delicious!! Truly reminds you of all the  street food in Mumbai!  Spice level is fantastic, you'll not be disappointed.  Check them out!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mRQelV8wuoozXSEf4nCzoQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mRQelV8wuoozXSEf4nCzoQ/o.jpg"
      },
      {
        "img_id": "-ZUuy7T-56U_0qcjTQE03Q",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ZUuy7T-56U_0qcjTQE03Q/o.jpg"
      },
      {
        "img_id": "PSMliXEOugmNvsExFeMtfw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PSMliXEOugmNvsExFeMtfw/o.jpg"
      }
    ],
    "user_id": "-S5GNDdHYKNZh6v7LjHaXw"
  },
  "m4VYiRXVBm0YTdXi8Hm__A": {
    "date": "5/18/2017",
    "text": "SO GOOD. I actually got on my computer to write this review and not spit something out in a lazy fashion on my phone. We got food to go after having a bad day and boy did it turn everything around for us. Everything was delicious. My husband said when he walked in it gave him memories of the delicious smells when he lived in Kuwait.   We had the chicken tikka masala and it was so divine. Creamy and tasty. The samosas were big & very good (I was excited there were 3 and not just two), and the garlic nann was perfect. I had the kheer too and it was more soupy than I am used to, but very tasty.   Other reviewers have commented on small portion size. We had pretty big portion sizes. And we are used to eating huge portion sizes (thanks to a pub we frequented in huntersville...). I had enough to have a nice little leftover lunch the next day. :)   The prices are a little high for some menu items.. like the kheer was $4-5 I think and seems like that could have been cheaper for the amount.   This is a go-to place for Indian food now. It was flavor explosion on my tongue!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "r7RdCrF0SpzFoUWFb_8oyA"
  },
  "nIixNEnNGGqnsn4HxVFXMQ": {
    "date": "1/20/2018",
    "text": "So far this is a great find!! It's tucked away and looks pretty regular inside and out. However the food was delicious. I wasn't expecting much but I enjoyed it very much. We ordered the tikka marsla, chicken biryani and garlic nan. The price was not worth the amount you get but none the less we enjoyed it. It can get crowded with limited seating and you have to pick up your own dishes after you've finished. If anything I would've liked something a little better for the price. But I would probably come back to try something different. Side note: if you don't like to much spicy don't choose the biryani. We didn't expect it to be as spicy as it was. More than usual biryani.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xFWalL84NNFHwo2XnbQSxg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken tikka marsla, chicken biryani, and garlic nan. Pretty basic and taste was okay. The biryani was more spicy than we expected.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xFWalL84NNFHwo2XnbQSxg/o.jpg"
      }
    ],
    "user_id": "7h4_BoZOk9zq6Xf3sX4Jqg"
  },
  "RTo2_mi4bV55NmN18LCjpQ": {
    "date": "6/2/2019",
    "text": "Being of Indian descent, i have had my share of Indian food and this is a great place where you can get any type of Indian food that you are craving from a lot of popular Indian states. I have brought my co workers, friends and family here and they all agree the food is so flavorful and they cater to every type of clientele.  Chatpatay is my go to when anyone asks me for a recommendation on good Indian food in the Charlotte area.  The prices are very reasonable for the amount of food you are getting and the owner always is checking on everyone to make sure the food is up to standard. I love coming here and highly recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6eWJIbmyKO-OsOhoyR6u6A"
  },
  "niA51tMkuSdvCMZFJB0Yww": {
    "date": "12/2/2018",
    "text": "Our favorite Indian restaurant ever! We love the Chicken Goan curry, samosa chaat, chicken korma and lamb rogan josh the best! But pretty much everything we order is amazing. We do a lot of pickup orders and they have NEVER messed up our order. We don't even check it before we leave anymore because they are always accurate. We drive from Fort Mill and it is 100% worth the drive!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dBzhqhSDMJ85xleyJTpz4Q"
  },
  "ftSgoBsGXi2t71UGLeWmVA": {
    "date": "10/13/2017",
    "text": "Hubby and I tried this the other day. I saw bateta vada on the menu on yelp and that's what I went there for you turns out they haven't had it for years!! I was crushed!!!  After that initial disappointment we decided to try the mango chaat that was good but should have had more mango in it! We had the soup with spinach in it and it was delicious, had never thought of soup with spinach! The chicken in it was pretty tender! We then had the chili paneer which I was pretty disappointed by, the chunks of paneer were not seasoned and tasted like nothing and the sauce needed spice!  The lamb chettinad was delicious! The first piece of lamb I got was very dry but the rest were juicy and tender. We also tried the bullet nan which what delicious and oh so spicy!!!  Finished off with the chai which was terrible, overcooked and bitter and there was no masala in it either! Tried the rasmalai which was totally overpriced, a single piece for $5!!!! It was good but so not worth 5 bucks!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z-LKHjLJmiSSB-_q2PEFSQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Overpriced salami and the terrible tea!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z-LKHjLJmiSSB-_q2PEFSQ/o.jpg"
      },
      {
        "img_id": "XHZUWkCJhsZUryS0p3tfng",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chili paneer, nan, lamb chettinad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XHZUWkCJhsZUryS0p3tfng/o.jpg"
      },
      {
        "img_id": "tpc8pt_k-E3wHw2lVsR3uA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. The mango chat that was yummy but needed more mango!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tpc8pt_k-E3wHw2lVsR3uA/o.jpg"
      }
    ],
    "user_id": "0wHCDvbS_i4xDr62z8w18w"
  },
  "qghz4DfJMZMpqi7LhKLMEg": {
    "date": "2/10/2018",
    "text": "We had been looking for an Indian cuisine place and saw this one on Yelp, so we thought we would give it a try since it was rated so high. WHAT A DISAPPOINTMENT.  We arrived about 5:45pm on a Saturday. We were the only ones there. While we were browsing the menu, another person had come in and placed her order; we placed our order after us. Note to self: we had ONE person in line ahead of us. So, we ordered our food and found a table and waited. And waited. And waited some more. During this time the restaurant was quickly filling up - obviously a place people love. So our food FINALLY came ..... well, just one of the orders! The food came in separate deliveries to our able, with long waits in between.   My wife had received about half of her order, and was told the rest will be coming. The rest of the order (including rice for the first order) and my order came 10-12 minutes later. SERIOUSLY? We were the only ones there (plus one person) ahead of us, and they cannot send out two COMPLETE meals at the same time?? There is something SERIOUSLY wrong with a restaurant that cannot send the food to the table for all those who ordered at the same time. This is absolutely ridiculous and UNACCEPTABLE.   By the time my food came, my wife was nearly done. This was a horrible experience. The food was very good (that is the only reason I am not giving it one star!). This must be the only thing that keeps people coming back because the SERVICE is HORRIBLE HORRIBLE HORRIBLE!!!  We will NOT be back, and our quest to find a QUALITY Indian restaurant will continue.  AWFUL!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TsKeGaVVmS2lS6bks5ZLw"
  },
  "RA_Z4X19RmxkPy7X_tvj0g": {
    "date": "2/25/2018",
    "text": "I could really eat here every day. If your looking for fantastic Indian food in Charlotte this is the place to go. The food is always fresh and the flavors make you smile and satisfy your tastebuds cravings for all the wonderful spice that Indian food has.   I can't imagine a week without going here at least once!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "anAdfKZ_OwWAbQGB53robg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/anAdfKZ_OwWAbQGB53robg/o.jpg"
      },
      {
        "img_id": "bqSHu-Y8YbwyN7V5w8YmFA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bqSHu-Y8YbwyN7V5w8YmFA/o.jpg"
      }
    ],
    "user_id": "RM04WnJcmQqhLITCS_LQ0Q"
  },
  "8Sn7zBO4RbAxromyf9v0ig": {
    "date": "6/3/2017",
    "text": "I was really torn with this place. Typical Indian restaurant in a strip mall. Not a good choice for a date night. You have to go up and order and clear your own plates off the table. I gave the lower rating because I hate fast food and like paying the money to be waited on. But the food was very good. My husband is Indian and enjoyed the authentic flavors. The chili paneer was very good but spicy. Also loved the dosa. Would have given a higher star if the atmosphere was better and we were served.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "se-mw63sWLc7bkrsgRYoYQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/se-mw63sWLc7bkrsgRYoYQ/o.jpg"
      },
      {
        "img_id": "Hp5Jx_lIT1EGvUeBotQGHA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hp5Jx_lIT1EGvUeBotQGHA/o.jpg"
      },
      {
        "img_id": "tANkvXArkLbtsfVrb_79ww",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chili paneer good but spicy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tANkvXArkLbtsfVrb_79ww/o.jpg"
      }
    ],
    "user_id": "S47pX7Y3xwNoftuOlSDsug"
  },
  "RO8lExobCq3SlszMJsP0Vg": {
    "date": "7/21/2018",
    "text": "We we're visiting Charlotte for a few days and craving Indian, decided to stop by. Authentic Indian cuisine and very friendly staff. Busy place which was a good sign. We eat a lot of Indian so have pretty high standards for quality and authenticity. We we're very pleased with the food here including Gobi Manchurian, Tikka Masala, Chicken Korma, Chicken Vindaloo, Naan, etc. You order meals at a counter and they bring your food out. After eating, you bus your own table. We didn't have any issues with this and the prices were fair and food was top notch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uURMhfSsB5UWl2hGaI6nxw"
  },
  "l52Iq7gjUj3rrQGi2GzpRg": {
    "date": "8/31/2018",
    "text": "Way Too Pricey!! ! I bought chicken spring rolls- they were smelly and uncooked. $4 for just 2 small baby size rolls.. Panda Express o is far better . Hakka noddles were  as if they just mixed a sauce with noodles and 3-4 piece of chicken..Quantity for $11 was kind a baby food..    go to Red bowl for $6.99 you get good quantity and tasty food.   earning shouldn't be the only motive !!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "38GACezcHfUC-2S8dT-c-A"
  },
  "oV61pmAcAfslP_6iX6crFw": {
    "date": "10/8/2017",
    "text": "Very casual dinning, you order at the counter and get your own plates, silverware, napkins, and drink.. I liked the fact that you pretty much get left alone.. no waiting staff to ask you how you're doing ten times lol The food was on point, I ordered it spicy, and it was perfect in the way you can still taste your food. Garlic naan was also on point. All in all I had a great experience and would definitely go back. @hikinginbrooks",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mCmazVQAC7ZyoFmNxrg_oA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Tikke Chicken Marsala with garlic naan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mCmazVQAC7ZyoFmNxrg_oA/o.jpg"
      }
    ],
    "user_id": "O6dGM4ZAVylUqAIBvT3B0g"
  },
  "D0by1D1pWUp7wtyAenBcZw": {
    "date": "12/31/2016",
    "text": "Best Indian food in Charlotte! It's a casual and family owned restaurant with reasonable price. They are not timid with their spice. All the dishes are very fragrant and tasty. I usually ordered saag paneer, lamb biryani, chicken tikka, Gobi Manchuria and butter nan. If you're craving for Indian food, Chaupati is best place to satisfy your craving",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVVLehzorjDfrtdzpotfxg"
  },
  "dJYJ43IFtQsNP4Df7gMi_A": {
    "date": "8/28/2017",
    "text": "THE BEST place for Indian Chat items.  A bite of Dahi Papdi Chat just takes me back home.  So we ended up having just the chat items and tea for first couple of times and wanted to try actual food other than munchies.  You'll be like 'actual food?'.  Lol. Anyways, this one time we wanted to go all vegetarian and planned to hit Chaupaati for the evening.  We were so prepared that we reached the place even before they opened for the night.  They open at 5PM in the evening with a break fro 3 to 5.  So were counting time down from our car watching that neon 'open' sign to glow.   And it did, ordered Malai Kofta curry and Mixed Vegetable curry with 4 different varieties of bread.  What a feast!! both the curries were delicious and spice level felt like it was made to order.  Garlic naan, bullet naan, roti, paratha -  were all perfectly cooked and super soft and NOT AT ALL greasy!! I would say this is one of the best places for Vegans as well.  So many varieties of vegetarian items and breads/rice. This place works a bit differently with respect to service (comparing other Indian restaurants).  you go straight to the cashier to order the food, you get a number, you pick your water, plates, silverware, napkins, you choose a table and wait for your food.  After you are done, don't go away yet with food coma - you got to remove your soiled plates and silverware and water cups and place them in the designated area. Hmmm, sounds like I am doing 75% of the service and still have to tip them a good amount ???Well you will forget that you tipped after consuming all the deliciousness they offer. ;)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "h5JlI4aY1vJBiqThAKtoHQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Masala Tea, assorted veggie pakora, Dahi puri chat, Dahi papdi chat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h5JlI4aY1vJBiqThAKtoHQ/o.jpg"
      }
    ],
    "user_id": "F4Abg96un5mT019hdstmVA"
  },
  "XmSN7iQI-LXrvmeQnxOpbA": {
    "date": "2/28/2017",
    "text": "I've had a lot of Indian food in my lifetime and this place topped all of my past experiences. I went with some of my coworkers and one of my coworkers never had Indian food before. He thought the food was phenomenal for being a first timer! The service was great! I highly suggest getting the Gobi Manchurian.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oVGJ6_aKSzk_n--S-bvJ1Q"
  },
  "YgNsbRlvLcno6S-U9XAhiQ": {
    "date": "9/4/2016",
    "text": "Great restaurant for Mumbai Snack food. I love everything from the food , presentation, to the decor. We had the Panner Katti role, Bhel Puri, Dahi Puri, and the salty-sweet Indian style limbu pani ( lemonade). We loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EsD05hOaUMkZtqUZr89VFQ"
  },
  "dPJKqdobZqQV-VFVY80KKw": {
    "date": "2/19/2017",
    "text": "Delicious in one word! Be ready to be all self service including busing your own table though",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CrpujeI1M955ABNcd9l91A"
  },
  "A9CxkP99PQhpW54TRRixXA": {
    "date": "11/28/2015",
    "text": "Nice self serve place. Food is really nice and portion size is huge. Quick service and very pleasant hosts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_ua5vRaptlR64si6vGH0g"
  },
  "y91FUJOzEHfP5VGB_Z07PQ": {
    "date": "8/10/2015",
    "text": "Great casual dining experience. Food is amazing. I haven't had a dish I did not like yet. Def recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGubei6Xi8HbdfkaO8bXDg"
  },
  "h21n_Ut5FK9YXORXCggBTQ": {
    "date": "7/4/2016",
    "text": "This is a great local Indian food restaurant.  Locals and fellow tourists seem to enjoy the food just as much we did.  The chicken tikka masala burst with flavor and had a slight sweetness to it.  They don't shortchange you on meat either (unlike our place at home).  Go here or you're missing out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LnSJJkSR0pCFXMvwSdrrmA"
  },
  "L7fromtecR9WmdKJO4cDkw": {
    "date": "9/22/2015",
    "text": "Just tried this place recently, and the food was really good! It's set up to have a casual atmosphere, so you order at the counter, and your food is brought out to you. A friendly staff member at the counter helped us decide what Indian dishes might appeal to us. Tried the lamb curry and chicken vindaloo. Both were quite tasty. As others have mentioned, customers are expected to bus their own tables. Not a big deal, but with that expectation, lower prices would be nice. Overall, we liked the place and will likely return soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktFGLlDYa9hL_NxMM3ZPVA"
  },
  "GopGfxY6DE9KxuO6cyt-iA": {
    "date": "12/21/2016",
    "text": "Most authentic Indian food my wife and I have had in charlotte. The lamb vindaloo was fantastic and the staff was beyond friendly. Can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8mGQUObiBar8LJSo8z4JRQ"
  },
  "-ykwd2JvKV3Uzd4bCniQtw": {
    "date": "8/26/2016",
    "text": "A new found treasure for Indian cuisine. The food is excellent! We had chicken tikka masala  and chicken korma, butter and garlic naan and samosa. Everything was great, we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pnhYEfmyXXMi9gHsg2Enlg"
  },
  "I8iIBZ5nD-jkbwUk2Ggc8A": {
    "date": "10/10/2016",
    "text": "Best Indian food in Charlotte BAR NONE! I come here at least once a week and wouldn't dream of breaking naan anywhere else in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqaLuMe3v3YmwPp7yii4yA"
  },
  "jtY9DccelkxlySFSIA2dbA": {
    "date": "5/30/2016",
    "text": "My star ranking is relative to the restaurant genre, so if you want casual Indian fare, this is the best place I've found in Charlotte. Copper & Blue Taj are delicious also, but a step or two above casual. Malai Kofta is some of the best I've ever had, saag paneer is on point, naan is soft & crispy in all the right places, all the snacks are really tasty & there's a ton of variety. Staff is really friendly, always happy to see us, & attentive (relative to a casual dining experience). There are always a number of Indian families dining here, so I think that's also an indicator that the food is yummy.  Check them out! And if you don't like something, they'd want to hear it!  I was also pleased to see on our visit tonight that you can get delivery via Doorstep Delivery...we will definitely go that route sometime in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cp5T2zvbyfvi1WqgAFHJYQ"
  },
  "QwQ1hnhErlhOQMB932QKXg": {
    "date": "7/17/2016",
    "text": "Was here for a Sunday snack evening but ended up ordering a lot of food :) the bhel puri was toned down on spices but is very tasty, the Pani puri was good too. Ordered a lime juice and a masala tea on the side and both were very good. The non veg thaali was a bit expensive but had some really awesome dishes. The food portions are average and not too much, so as to be shared. The parking is ample and you have to order up front before taking a seat. The food then is delivered to your table. So a nice experience and will come back soon to try some more varieties. Felt the Indian flavors are retained even though spices have been toned down. Visit here for some good snacks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hyitzfoMjl_G_ud5_ewZQ"
  },
  "fAfckYKYJkzDKhK6JjFr2Q": {
    "date": "7/15/2016",
    "text": "So we're traveling the East Coast states and found ourselves in Charlotte at dinner time . Opened Yelp and found this place.  WOW the food is marvelous, reasonable, and the staff truly welcoming.  The baigan bartha, an eggplant, tomato, onion dish was the best I've had and we've been to India!  It was complex, nutty and mildly spiced.  Great pakora vegetable mix as appetizer. Love the casual atmosphere, lots of families as well as adult groups and very diverse set of patrons. Wish we lived here!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxTnJtAOM1hvS-1HLDVS9g"
  },
  "aHnkUwIwh2bDK1okZMlzmA": {
    "date": "6/20/2015",
    "text": "Awesome food !! I came here and ordered a Gujarati thali, chole bhatturre, chicken vandaloo. Everything was at par excellence",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KF8G7uchgkHZO-CqXybTHQ"
  },
  "9AsgwhLhNd7KB-jiNZ3dDg": {
    "date": "6/13/2015",
    "text": "The pav bhaji was especially good!  There were a lot of options with a variety of food. My family and I liked it a lot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bbW-Rh29iP359uAWdP2s0g"
  },
  "R_yH5x-dz0HFUzpNCbtr1g": {
    "date": "8/22/2015",
    "text": "Food is not bad but I didn't like the service. Don't think will go back.   Masala chai was a letdown, being Indian restaurant, probably need lesson on that. Starbucks chai latte taste much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKas8St7liMlB3wKpBT4hg"
  },
  "D-JO_H63O4JIQ8iytPoZbQ": {
    "date": "6/11/2016",
    "text": "One of the best Indian restaurants in the country with a wide variety and no sacrifice in quality. Meats are tender and the food is not oversauced. Paan on the weekends sealed it for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fv4DGFDvDCr3N9hcik9R3Q"
  },
  "uYDoYeMRdUe_s9Qxtyj0nQ": {
    "date": "8/10/2015",
    "text": "Excellent food.  The chicken Korma was the best ive had. My wife ordered the paneer tikka masalla and loved it and kids ate chicken tikka massala and actually seen them finish there food at a Indian restaurant. Also ordered the Gulfi and ice cream which was good for the kids... Also one thing I like is they serve Indian Beer as well as domestic beer. The service is friendly and very helpfull...We also had a takeout order since the food was very good....We will be back for sure",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Knxyiw3gYvQiFBKClJgRkw"
  },
  "xy2KR0GMAYMNJS8wbSFZag": {
    "date": "6/4/2016",
    "text": "A diverse range of menu items and very tasty food is what you would find here. 5 stars for the ambience, the taste, service, cleanliness and minus one for the quantity. Too much naan and little rice served on my veg thali; price could have been $12 rather than $14 and roti is usually served with the thali, not naan. But that's ok. It won't deter me from coming here again to try chaat, meat items and most importantly dosa's. Rather than spending $20+ on dinner meals at Blue Taj or other Indian restaurants, I'd pick Chaupati any day. It's more casual than others and perfect for evening meals when I'm lazy to cook.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDvV6UuRyUKT3DMTOzp62w"
  },
  "FZmRcCPl8aeCxNensVSBqg": {
    "date": "5/23/2016",
    "text": "Excellent Gobi and Chole.  Planning on lunch again later this week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlPQYp1Pba9FLy3QwuT4ww"
  },
  "Wz_DKK9IMdyns-VUyu4LNA": {
    "date": "7/13/2019",
    "text": "Definitely the best Indian food in Charlotte! The owner and staff are always very friendly and accommodating and they even remember you and welcome you back when you come in. Another plus is that you don't have to worry about wait staff or tipping; you order at the register and take a seat and they bring your food out when it is ready.  Recommendations - Chicken Tikka Masala, Chole Bhature, samosa chaat, curry goat, tadka Dhal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-CV-jbp4HITBgqJHKMTtg"
  },
  "B7mzPfnY80Qlfk-q1Ihv7w": {
    "date": "6/8/2019",
    "text": "Tonight I had probably the best Indian meal I've ever had.  We started out with a new app called vegetarian momos. These are a type of hand made dumplings full of delicious vegetables and spices that come with a tomato based dipping sauce. Simply awesome. There's a chicken one too. Along with our usual gobi manchurian and garlic naan, we shared a paneer tika masala and a lamb biryani.  This combined with a couple of old monks and it just doesn't get any better.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "eTTGtucFeehgAt26u3Mxhg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Gobi Manchurian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eTTGtucFeehgAt26u3Mxhg/o.jpg"
      },
      {
        "img_id": "h9-0fCmvEwKzU_bzLfiN7A",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Samosas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h9-0fCmvEwKzU_bzLfiN7A/o.jpg"
      }
    ],
    "user_id": "JiRZzPhGTbcnzTpu-BsyEw"
  },
  "q8PB4oxanRJ10XqelnVGNQ": {
    "date": "5/27/2019",
    "text": "Chatpatay is a casual Indian place where you go to the counter to order and they bring you your food. This is NOT a full-service place as you're supposed to bus your table yourself when you are finished eating. To some people the prices may seem high but the quality is definitely there. I spent some time in India and I take this review seriously. All of the dishes that I have had from them have been outstanding! Another sign that this place is the real deal is that whenever I go there are lots of Indian families eating. Some dishes that I really enjoy are the Chicken Vindaloo and the Chicken Methi. In both the chicken was very tender and superbly spiced. I stay away from cream sauces as they don't agree with me so don't ask me about those! The naan is fabulous here especially the bullet naan which has green chilies baked into it. They told me they could make it as spicy as I wanted and would also give me more peppers to put on it. In short, these guys don't mess around when it comes to spice if you want it that way!  The staff has always been very nice to me. They have guided me through the menu and made suggestions based on my preferences. They have also given me extra rice at no charge. I appreciate the small things!  The bottom line is that Chatpatay is a great Indian restaurant if you are interested in authentic Indian cuisine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_CQetImJGo97dAIM0fjsSA"
  },
  "o5goK2XiVpyEUw96GdovuA": {
    "date": "3/15/2019",
    "text": "Ok so this was my first time ever trying Indian food. I was very very nervous because you do get mixed reviews so you don't know what to except until you try it! So I look up pictures on YELP to see what I would consider and we ordered the basics for me to try. All I can say it was a changer in my food game!  This place was very small and cozy, but the food was great. We also came pretty late for a Sunday evening so the staff was considerate and let us order and eat in. We got the chicken curry with rice and something else as an app, I forgot the name, but next time I will list it and with pictures. They actually have a lots of selections especially for people like me. They have vegetarian options and also non-red meat options as well since I don't eat pork/red meats. For my first time having Indian food I was impressed and I will sure to be back with another review! Thank you guys",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "GNs7Xn1jtTnJ4Xd6k26mfQ"
  },
  "t3eLApIoxdm-IwFW2GBVeA": {
    "date": "9/3/2018",
    "text": "Came here with two friends for a quick dinner during our day trip to Charlotte. You order up at the counter and get a number, and then they bring the food out to you when it's ready. We got the samosa chaat, veggie biryani, and chicken biryani. I ordered the veggie biryani with medium spice but it still had a kick to it! Food was also served quickly. My friends are Indian and they said that everything was pretty authentic as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oNxCIftqftjT0zCLZYjIpg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Samosa chaat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oNxCIftqftjT0zCLZYjIpg/o.jpg"
      },
      {
        "img_id": "-RECh1Ne-Hyp2lkreQz3Kw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Veggie biryani",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-RECh1Ne-Hyp2lkreQz3Kw/o.jpg"
      }
    ],
    "user_id": "x_Frpa8QWc25FDJ5BJM8tg"
  },
  "VLwGEBYNXvCLDF-yxHSNfg": {
    "date": "6/29/2019",
    "text": "Nice place to have indian fast food. Their veg thali gives bang for the buck. Their Paneer 65 is the best i have tried in clt area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r1Zp4ClP4MVVlQ9HS1Bd7A",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r1Zp4ClP4MVVlQ9HS1Bd7A/o.jpg"
      },
      {
        "img_id": "sq-wU6DDHt_ak0qbCeRD6A",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sq-wU6DDHt_ak0qbCeRD6A/o.jpg"
      }
    ],
    "user_id": "Pt1oJEHhOEpdW5wOTRRI4A"
  },
  "UBqMVOFE38TdygypAAoidQ": {
    "date": "7/20/2019",
    "text": "Traveling to CHARLOTTE during \"Restaurant Week\" from Northern VA and my girlfriend and I came across this \"Hidden  Gem\" of a Indian food!  After a long bike ride and walk through two farmer's markets we had a craving for favor full food!  This place is it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZeMZjf-3gBfLy2EdTBVL2A"
  },
  "AU2zKdsZEn2OS6hLtQsQJQ": {
    "date": "5/28/2018",
    "text": "Best fried cauliflower ever! Crunchy, tangy, slightly sweet and spicy. The red onion is a great addition. I would definitely stop to buy this every chance I get.   Walking up to the counter to order, the owner (I believe) was welcoming and I informed him it was my first time there. I told him I enjoy basics like korma and tikka marsala but would like to try something new. He helped me select a coconut base curry and I chose chicken from the meat options, they have goat! I got an Indian beer too. Entree, appetizer, and beer were about $24.   Cauliflower came out quick and I really enjoyed taking pics of this gorgeous dish! The curry was mild, creamy, and flavorful; served with a small side of basmati rice which I believe you can ask for more if desired. There's a station with water, utensils, napkins, and you can drop off your dirty dishes.  Overall the place itself just needs an interior design update. Also the curry was a little low on protein, not as much chicken as expected for the price.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "9MDaV69ifRd5q2_4ZBZAYQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Owner helped me select, I told him I enjoy tikka and Kormas and he suggested this, very good mild spice and flavorful coconut base",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9MDaV69ifRd5q2_4ZBZAYQ/o.jpg"
      },
      {
        "img_id": "4onumzavBATKjfI8vFNzmw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Amazing fried cauliflower, tangy sweet spicy flavors",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4onumzavBATKjfI8vFNzmw/o.jpg"
      },
      {
        "img_id": "1hyVv-8zAVctvWsBedq2qQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Wall decor",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1hyVv-8zAVctvWsBedq2qQ/o.jpg"
      }
    ],
    "user_id": "i_EASSNcEqc1JrfdBjBeVw"
  },
  "MP3-0oacBaKlEjHlNpHq-Q": {
    "date": "1/14/2019",
    "text": "I give 4 stars for their vegetarian food we tried.  My husband & I have been here multiple times now. I waited to give my review, coz Everytime my husband's order comes great & mine half cooked or over cooked. I tried chicken hakka noodles & methi chicken, both dishes as such tasted great. But the noodles had chicken completely dried out, like it was taken all the way to burning but got out just a second ahead. The methi chicken, they were polite enough to replace my dish, but it still came with chicken not cooked, the curry tasted awesome.  They have recently Introduced, MoMo (dumplings), they chat's - samosa chat, bhelpuri, severe Puri etc., Always comes out the BEST",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tVYj2Y30Gb4Q-bIkKwF-FA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tVYj2Y30Gb4Q-bIkKwF-FA/o.jpg"
      }
    ],
    "user_id": "TZ3rntIkX2j8g4optFiv1Q"
  },
  "ODWCBAM9As303WA2VYHhRw": {
    "date": "7/12/2019",
    "text": "A typical Indian restaurant. Mix of street and I Indo-Chinese food. Nothing stands out. Food is mediocre. It's mostly self serve but the food is brought to your table. Servers are attentive and cordial. You have to seat your self and order at the counter. Have to pay when you order so if you want to order more then have to pay again. Little hassle but it's ok. Chili Paneer was decent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJMZlP_IWdV-TePTTCFpWQ"
  },
  "v0b3s_J1ET5zmm2phU7uSA": {
    "date": "3/14/2018",
    "text": "I ended up here after my first dinner option was a total fail. That place will remain nameless...but I will NEVER return.   The setup is a bit confusing. You can sit anywhere you like, but then you have to go up to the counter and order, get a number and wait for your food to be brought out. Now that I know, I'll be good for the next visit.   They have all the favorites. I ordered the tikki masala with paneer and a side of garlic naan.   The tikki masala here comes with veggies (onions and bell peppers) and honestly I'm not a fan. It's absolutely nothing wrong with it, but it's just not my personal preference. However, they are spot on with the spice. I ordered \"spicy\" and it was just that! If you like it spicy...get spicy. They have an \"extra spicy\" version if you dare.   The garlic naan was okay - I would have liked for it to be a bit warmer and have a little more garlic flavor. But overall it was fine.   If I'm in the area and craving Indian I'll give them another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Fe4kZExhIOriPwebL_hCLQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Tikka Masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fe4kZExhIOriPwebL_hCLQ/o.jpg"
      },
      {
        "img_id": "MBxZzO381OK3LY0lAdRH_g",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Garlic Naan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MBxZzO381OK3LY0lAdRH_g/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "YuYPu6a7nojHzstIwQROeg": {
    "date": "8/4/2018",
    "text": "Good things first, it's a neat little place, looks very hygienic, lots of options to choose from. This restaurant runs a bit different more than other typical restaurants. To bring down the cost, the place runs like a food court. When you enter, you got to head straight to the counter, order your food. They give you a token number and you are free to seat at whatever table you like. A person brings you food whenever ready. Cutlery, plates and water are all self service. You also goto clean up after you leave. We came in for a afternoon snack and tea. The aloo tiki chat and samosas were normal. Not exceptional. The masala chai was watered down and had to add a lot of sugar to forget the feeling of drinking hot water. The quantity wasn't that great too. What seems like a low cost restaurant isn't really a purse friendly place. Most of the items on the menu are more or less the same price you would find at other Indian places nearby who could serve you better with better ambiance and service.   If you are in the surrounding area and want to grab a quick bite, then I would say yes, but otherwise there are other better places for Indian food - that isn't self service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hpU5Rn1Ypr5Di7SzkIm5JQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. 2$ Masala Chai",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hpU5Rn1Ypr5Di7SzkIm5JQ/o.jpg"
      },
      {
        "img_id": "xYlt7HP2279g1vpW47cscQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Two Samosas for 5$",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xYlt7HP2279g1vpW47cscQ/o.jpg"
      },
      {
        "img_id": "4bc20RjC-BezUnBuxNKATA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Aloo tiki chat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4bc20RjC-BezUnBuxNKATA/o.jpg"
      }
    ],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "0hdR6KvBGHAo1_R_R82GjA": {
    "date": "3/2/2019",
    "text": "Disappointed specially with the masala dosa that seemed to be not fresh at all,especially the potatoes inside were cold. On our very first visit had tried the dabeli and vada-pav which seemed good enough -which was the only reason we went again and this time we tried something different. hakka noodles also did not seem fresh.I believe their online menu is not updated as well! Overall disappointed!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwsZWhs3BCzlOW3dder5aw"
  },
  "bJhQz-rgNHPZZAEFSHUq9w": {
    "date": "6/24/2018",
    "text": "Lots of check ins and today we finally decided to find this place.  We did.  And we are happy at our find.  I do not usually give more than 3-stars on a first venture, but this first venture was special.  I am immediately a fan so 4-stars.  You will see why when you partake.  Labeled as casual Indian does not take away from the outstanding food being served.  You order from the man at the counter and he brings you your food.  After your meal you deposit your dishes and silverware in bins and leave.  Very simple.  Yes, there is a wonderful menu.  One of the most complete  of all the Indian restaurants we have experienced previously in the Charlotte area.  Vegetarian and non- there are lots of choices.  In particular were Goan dishes and Chennai items, like the giant tortilla stuffed with veggies called a Dosa.  You will not believe how massive that Dosa is in size.  Also, their selection of Naan is greater and more unusual than elsewhere.  We tried the bullet naan, which contains chopped hot chillis and a spice, chaat masala.  Delicious and different.  Wife said too hot, I said just right.  For an appetizer we boldly ordered Aloo Tikki Chaat, two small potato dumplings heaped with a wonderful sauce of onion, tomato, red and green chutney, sweet yogurt, cilantro and chaat masala.  It was so yummy that wife took the remaining sauce home for later.  Unusual and very flavorful.     One order to chicken tikka masala came our way as a point of comparison and it compared very positively and flavorfully with those found up the street.  It was not as heavy creamy or tomatoed but was slightly sweet and simply made for going over rice.  Rice comes with entrees and more comes if you ask for it.  The other dish for my coconut loco wife's enjoyment was Goan Chicken Curry in a coconut based curry sauce.  VERY rich and creamy.  Nicely done and another item to use up your rice and ask for more.  Water and mango lassi helped to refresh our mouths.  Spice level is low, medium and high.  We went for medium and it was very much OK.  I do not like to take on a Vindaloo level of heat as it distracts from the food flavor.  The medium spice level gave pleasant heat without taking your tongue away from the food.  Nice job.    Located off of Park Road, shy of Pineville-Matthews Road.  Quite a large not noticeable shopping center.  Use Waze to guide you in.  We were the only non-Indian in the place.  We left lunch at 1pm and three families of Indians entered after us.  A very good sign that the food is authentic and good...and so say the native eaters.  Native or not, give this place a shot.  We plan to return and will give our son the menu.  They also participate in DoorDash, the home delivery service.  Call to see if you are in the area.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 10,
      "cool": 8
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "JD5RHtYf4RTlhn9AmzcNrA": {
    "date": "12/15/2018",
    "text": "This is my go-to Indian Food restaurant. I make special trips (about 1.5 hrs away) to eat here. I don't really dig Indian buffets so I'm thrilled here.  And when I eat here, I order all of it. Chicken 65, Vindaloo, biryani, samosas, aloo gobi, daal tadka, raita - is my usual order. I would order more and more, but that usually stuffs me.  I find the owners/employees very kind and welcoming folk. They keep their business clean and orderly. I always tip heavy here.   This is a mainly counter-service system; go up and order. There are menus if you would like to sit and peruse first.   Consistent good quality and service.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "ONuIrkKNvbRT0yUvT13fVw"
  },
  "hE5lZX62gJjsQmTxBlsMxw": {
    "date": "7/18/2019",
    "text": "Third time visiting here and everything we've ordered has been great.  Friendly and helpful staff.  We will continue going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8I8pyz4ueSTtLUtUZJGaw"
  },
  "c7vllEpm8UsPM6SUqDc1uw": {
    "date": "9/28/2017",
    "text": "I ordered carry-out from here one evening.  I called it in and it was ready quick.  The food was still hot, even when I got home.  It was different than what I was used to, it had veggies in the tikka masala.  I had never experienced that before, but it wasn't bad,  The ingredients all seemed fresh.  I was happy with the naan.  It was extremely flavorful.  The place has decent prices for Indian food.  The customer service was very good.  I would try again sometime when I am around the area.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "qEiN8309aI-w_r4qqwDYjQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Carry out paneer tikka masala &amp;amp; rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qEiN8309aI-w_r4qqwDYjQ/o.jpg"
      },
      {
        "img_id": "LXiqKBw8q9SfRlwqddwDFA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Buttered naan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LXiqKBw8q9SfRlwqddwDFA/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "BoQYn_HpE-VYImq4Jy3o-w": {
    "date": "10/15/2018",
    "text": "Exceptional. Very interesting and relaxed, semi self service which is great when not looking for a formal dinner.   Food is fantastic, and my wife is celiac and had many many options clearly marked on the menu. Really solid choices with many standard Indian food dishes not disappointing, with a few new ones I had never seen before.   All in all, a great experience, will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7pHt3IhAqTmomNVPQHbcKQ"
  },
  "MriBnNN01ZyWCSahpQkVLw": {
    "date": "2/16/2019",
    "text": "Worsr experience. Food served was not fresh,we complained about it. Somebody took the dish inside and brought it back saying it us fixed. Not to mention it was still bad. The taste has deteriorated since our last visit also.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_arp5dOCWmnsF57cSZvkWg"
  },
  "_Bj1AzHexqVyvVPCuuAIYA": {
    "date": "10/6/2018",
    "text": "What is Chaupaati ? It is the beach in the heart of India's financial capital Mumbai formerly Bombay. It spells chowpattty in India and the name is just a variation and pronounced the same. Chowpatty beach is a paradise for Indian street food and hence the name and the theme of the restaurant.   First of all let me tell you that my reviews are extremely critical. Hardly any place ever gets a five star. A three star rating from me is GOOD.  Better than an average Indian fare/restaurant in a B class metropolis. A class metropolis will be NY, LA and I am comparing the best in those cities with this one as well which brings the rating down but it is great in a city like Charlotte. No question. Highly recommended.   Samosa chat good not exquisite. Dahi puri chaat below average; the dahi (curd) filling does not have any masala very low salty sweet. Panipuri is ok. The filling does not have enough mashed potato but more lentil and kala chana (Black chickpeas) no onion and cilantro and bland. The water was good along with separate tamarind chutney; you can blend it with water as per your taste which is a great idea. Mango papdi chaat I guess is great for mango lovers but mango is not my favorite.  This is a very popular place in weekend evenings with the local Indian community.   Other than the chat (Indian street food); they offer full menu including Dosa and Indo Chinese. They offer Naan to Biriyani to Chicken Tikka Masala. Not very large but decent selection of items. Wine and beer too. There is no lunch buffet; everything is a la carte.   Good place; will return to try more. Again three star DOES NOT mean it is bad; it is a great joint in Charlotte. Highly recommended and I will return every time I visit the city. Keep up the good work guys.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lFmJn-UHKwIRwggqbqoyoQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lFmJn-UHKwIRwggqbqoyoQ/o.jpg"
      },
      {
        "img_id": "kUJDnG0k_W_z2M9quKloYw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Mango Papdi Chaat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kUJDnG0k_W_z2M9quKloYw/o.jpg"
      }
    ],
    "user_id": "GINsuPfRH5z2gBkcLXdHlQ"
  },
  "zEAEjyM_bcmn6EVz_sXm9g": {
    "date": "5/13/2016",
    "text": "Nom nom nom! Delicious Indian cuisine. I always get the baingan bharta or chicken biryani.  Food always comes out quick and never disappoints. And the staff is super friendly and accommodating. Our new favorite Indian place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VcP85Oy3hjwRf_Nyebj03g"
  },
  "RzorOScfhnn3Kw4fkVqDgA": {
    "date": "4/30/2016",
    "text": "This is a take out place...but good setting to sit and eat also. Good variety of Food and  spicy...only downside is Pricey for the quantity they serve",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-P5iAplySALi90QpJi4UQQ"
  },
  "pNB_qfwbx2U6ROey0nvVXA": {
    "date": "5/29/2015",
    "text": "New Indian food restaurant in charlotte is blast. Moved here from England was missing this kind of  restaurant for long time. Found one now one place to stop whenever in town now. Keep good work and wish y all the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6CfOfCW_b9HmNfMS4VEyOw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Bullet Nan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6CfOfCW_b9HmNfMS4VEyOw/o.jpg"
      },
      {
        "img_id": "OFTn96Zcu4PuUsGW5SgH-g",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OFTn96Zcu4PuUsGW5SgH-g/o.jpg"
      }
    ],
    "user_id": "_AArCqWXfD5u3-teONkiyA"
  },
  "XYG3vHzL1tgHr6fvu0z5sg": {
    "date": "5/20/2015",
    "text": "Amazing! I was honestly stomping my foot the first time I tried their Goan Curry - it is out of this world. I have been back twice since and am beyond impressed with both the service and the food. Try this place out - even if you have never had Indian they will walk you through it or for those that know Indian food and love it - their menu is huge!  I know I will be a regular!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rbnPySTcNSL0hZfXkWdMBQ"
  },
  "xWZNh1qkj55VxqfhnzPpag": {
    "date": "12/14/2015",
    "text": "You will find best Indian food in NY/NJ , Chicago etc, but no one can beat the food Chaupaati provides. The best I have ever had in United states. Super delicious experience with great service. I can eat there everyday. Keep it up guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G6joNeH7L5DqAQNpxqv9bA"
  },
  "OmyRw_miFK6sDy1qUlF8Rw": {
    "date": "6/17/2017",
    "text": "Never been to this place before so we didn't know what to expect. It turns out this is one of the best Indian places around. We tried several dishes and everything was amazing. Definitely recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0dmNmyZJ_Au2M4i9ImKAg"
  },
  "6y2XDy6-4YpzfpUGi0W8CQ": {
    "date": "3/6/2016",
    "text": "We have been frequenting this place since it opened and never been disappointed. Their quality & taste is top notch and their friendly/accommodating service is inviting. The best part is that, unlike other Local Indian restaurants with all the traditional offerings, this place offers delicious Indian street fare like dosa's, pav, and chaat. Try the madala dosa when they have it. Don't be fooled by the small, unassuming location... Big flavor comes out of this small package! A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2iSs5wqVJaKlvvvFZlktHA"
  },
  "vqNne6sLaXoKjcJqZfTABg": {
    "date": "6/1/2016",
    "text": "Affordable and delicious food! Great for lunch dates with friends. Amazing service as well - Gina (writing from my boyfriend's phone)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ujay5zOGuQTRxZtTt3ZcA"
  },
  "EHdedKLx42AIRvraZO0Khw": {
    "date": "4/25/2016",
    "text": "The search has ended. Chaupaati, of all of the Indian resturants in Charlotte, is by far the best non-Americanized Indian food in Charlotte. The menu is extensive and if you like spicy you will not be disappointed. The service is also terrific. The staff are all more than helpful and won't look at you crazy if you mispronounce a name or two. Bishal, thank you for taking the time and recommending dishes that fit our pallet. Even though the location is a solid 20 minute drive from my home, the trip is well worth it. If you looking for authentic non traditional Indian food, I highly recommend checking this place out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4FddxSgFqL_s0lDemA5zHw"
  },
  "MF3U-NnNpLrIA3SL1NMbaA": {
    "date": "6/7/2015",
    "text": "Indian restaurant for Americans & Indians settled in USA  .. Mildly spicy & just enough quantity.. South Indian food was not up to the mark so was the biryani.. Don't choose if u r from India looking for a good Authentic Indian food..",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "97MbyRGYV7lsWkAHAQD_Mg"
  },
  "ibwX0aGzyEUf0njdctqRSA": {
    "date": "11/15/2015",
    "text": "15 nov 2015. Just want to let know that bombay sandwhich does have vegetables , chutney , butter . the person at the counter said , it will have only chutney which i m not sure is bombay sandwich( please rename your menu) . Also the person from kitchen said they prepare idly in morning and serve the same full day after heating which means it fresh, we should not expect fresh idly ever. Only satisfying part was they changed both the orders.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_U49PSmr6SdxRj7NGK2ww"
  },
  "yCcHOalBNc4w6mr9hUDOgQ": {
    "date": "5/18/2015",
    "text": "Having only been open for two weeks, the place is still clean. Could use a little more lighting.  The owner walked around and  was very personable while asking  patrons how things were.  The prices are decent and food is pretty good. Casual is just what it is due to having to self- buss your table which I believe saves us from higher menu prices. :)  Note for some: The soda fountain is limited and weirdly located in the back of the kitchen;however, they offer canned sodas and bottled water upfront. Will check out next time we are in the area, but will not make a special trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tlC85J2zsHpnrtHp3qX6Q"
  },
  "8PB4hOy5SGwTimOL1B_FGg": {
    "date": "1/29/2017",
    "text": "super delicious, had the veg and non-veg thalli. go, enjoy. simple, friendly, tasty. going back soon",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zmTO20lIhZWirMaaTXss4Q"
  },
  "65Ae_Pxx5kCZ7chcKIrcVA": {
    "date": "1/26/2017",
    "text": "Love authentic Indian cuisine! Got mine extra spicy and my nose is red and running. Love it. Samosa chat was the BEST ever! Saag paneer was oh so good. My sister had chicken tikka masala and it was very good. Best I've had since leaving MD. Enjoyable Indian music too. What a great lunch!!! You order at the counter and your food is brought to you in a serving bowl. Only complaint is - YOU go and get your eating and serving utensils, napkins and plates. When you are done, YOU even bus your own table! Be careful before you decide on your tip!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRIC0J98tX87k9ly2yMeyQ"
  },
  "bqxzxqk0dhw9Gt9YriVW0Q": {
    "date": "8/18/2015",
    "text": "I have been have been here multiple times and always eaten chicken 65. This place has one of the best chicken 65 I have ever eaten. Friendly people and nice place to eat. This place has quite a few options for both veggies and non veggies and I would recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEfUndKDJNXAoBr707qrZA"
  },
  "D59QBBeyWrsfca9YY8CteQ": {
    "date": "8/1/2015",
    "text": "Bullshit place. Fucking expensive for the amount and quality of food. It is self service, you have to clean the table yourself when you find one. They make you wait unnecessarily for so long, So that once you are fucking hungry you like anything you eat.  Even the quality restaurants with FULL service doesn't charge this much.  They have very small glasses for drinking water and since it is a self service you have to make few trips to water fountain struggling with others in that small place.  Absolutely not recommended.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXkNtVLj5kHY6Aw-6pwCqQ"
  },
  "ll2HOD6gIAvY6eyg-UnK9Q": {
    "date": "3/25/2017",
    "text": "Wow. This is my new favorite Indian restaurant. We were looking for a new Indian restaurant tonight and struck gold. You order at the counter, pay and the food is brought out to you. Get your own silverware and water and this cuts back on the expense (tip) not that I cared, but a plus. The food: the best!  We had mulligatawny soup, naan bread, papadams, and this kick butt starter called Somoza Chaat.  As if this wasn't enough, we split a vegetable biryani- wise because by now we were stuffed. Medium vegetable biryani was super spicy but the lovely yogurt offset it a bit. Place was packed. Fantastic!!!!!! Super nice staff/owners as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kVd5KdMJ6-5b2KaCDFChlw"
  },
  "mO8xkxuTdlOoQY-d8hiV0g": {
    "date": "1/17/2016",
    "text": "The best Indian food in the Charlotte area by far. Great service and the food is so good. You will ready to come back for more before you leave the first time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0YYogplj7C2mUMKT9GIapg"
  },
  "JVNira8AYPHYxmOrdHB1aw": {
    "date": "11/19/2016",
    "text": "I'd give it a 3.5 if that were possible. The food was good, not knock your socks off. We  sampled Papdi Chaat, Chicken Tikka Masala, and Chicken Saag (kindly made for me as it's not on the menu). I prefer more spice than each of these had (ordered medium) and less acidity in Saag. But as leftovers, there was a nice little kick. The service was good, especially for casual dining. You order at the register, choose from canned/bottled drinks, and food is served on regular plates at the table. This isn't upscale dining for a special occasion. But if you want good Indian, good service and to support a small business, give it a whirl. There is plenty of parking, located near Bi-Lo at the intersection of Park Rd Extension and 51 (Pineville Matthews Rd).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vxYuuiQBvZhApojPINzsQ"
  },
  "dKnZjhdK8BZIsCgLxZEGiw": {
    "date": "3/1/2016",
    "text": "Good place for Indian chaat. Value for money. Clean place. We tried pav bhaji, dahi puri chaat, kathi roll and everything was great",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HkLbN3oap3PeZb39-NP6A"
  },
  "43vNljvtbn-h3gQUjsFPrA": {
    "date": "6/24/2015",
    "text": "I should say that we have no real experience with Indian food, but my husband and I wanted to try something new and this was delicious! The cashier, Sandhya made super recommendations! We ordered samosa, spicy lamb chetinad, and saag paneer with naan. Our young daughters got a grilled cheese and an Indian style pizza. I loved the casual atmosphere- we were in for lunch and it seemed just the right type of casual place for a quick tasty bite. The self service was great for the water station too. I would love to try some of the Indian beers as well. The food did not disappoint. Everything was presented beautifully. The paneer was creamy and complex, the crust of the samosa was flaky and delicious. Hubby loved his spicy dish. The girls ate all the grilled cheese, but found the pizza to be 'too cheesy' (they are picky kids). We will be back to sample more for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tNc6vAMLOkTN5Roji04Faw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Samosa with lovely sauces",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tNc6vAMLOkTN5Roji04Faw/o.jpg"
      }
    ],
    "user_id": "_NI2yzWsCLaVfSdIwHRliA"
  },
  "TmZtJkLpiQVOJGN_zDt6zA": {
    "date": "1/21/2017",
    "text": "Good indian Chaat dishes. Chicken biryani is also very tasty. Their prices are a little too high for a self service place. Overall good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-tlpdLBIMc1_IteY0ft9g"
  },
  "RFc1VrBmmwFt3FxafhbE4Q": {
    "date": "6/17/2017",
    "text": "This place was a great surprise. Quite the gem in pineville. The chicken has a wonderful flavor and smokiness that really shines through the sauce. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fItzflD39bIaQjp_IoQK7A"
  },
  "iTPoFFZUq3BVzXW7tQ5dfw": {
    "date": "1/11/2018",
    "text": "I have been coming here with my family for two years now, and it is still the best Indian I have ever had. My family moved away to a year ago and I still come here regularly for the amazing food, which is consistently good every time. I can't recommend it enough!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "16y52krh7kwJgEOxzkIXHw"
  },
  "wrWmcdBQTXUh7tA8jVgGEQ": {
    "date": "1/10/2016",
    "text": "What a great find off Pineville Matthews Road! Casual Indian spot with great flavors and many interesting dishes. We were in the area and looking for a snack and had the Padpi Chaat, Dahi Vada (lentil balls in yogurt sauce) and the Gobi Paratha (bread with cauliflower). The spice level was just as requested. We're looking forward to getting back and trying more (the dosas looked fantastic). The menu includes many Indian dishes you don't see at other restaurants. Our only minor criticism was we wish the Padpi Chaat had more potatoes and less of the crunchy crackers.  You order at a counter and they bring your food to a table. The staff was quite friendly and checked in with us to make sure we were enjoying everything. Very reasonably priced - especially considering the portion sizes. They also have beer and wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WQmpkjBPyx0Rr3SCVdVYcA"
  },
  "JnNdwMTU59GQTo_S6E2ZQQ": {
    "date": "9/6/2016",
    "text": "So yummy bread. I love this place, its one of my favorites. If you love indian food then you really need to try this. Meat is so tender, bread is delicious and fresh, food has so much flavor and not to spicy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bOF6WdJwGnDjhlH1LcE3xA"
  },
  "xnOhgOcxjq5QOIo9cdU_6g": {
    "date": "11/5/2015",
    "text": "This restaurant was highly recommended to us and we have been a regular at this place. The Chicken Tikka is really tasty and the Saag Paneer has the perfect consistency. The Gobi manchurian and Chilly Chicken are great adaptations of Chinese foods to the Indian Culinary. Best place in town for an authentic food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xE_-bOaOwoOALhV_fsSOhg"
  },
  "1xaZ7JW5ccURzAVMuU3oiw": {
    "date": "3/10/2017",
    "text": "The best Indian food I have had in such a long time. The manager is the reason we keep coming back. He takes the time to have a conversation with everyone and from what I have observed, has regulars he has great relationships with.   We love the casual environment and friendly faces!! Definitely a must try!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ssZApJVoHU0J7D6_FJSUhA"
  },
  "U7IbaQ_C-5h_uaKKitdEIw": {
    "date": "7/17/2015",
    "text": "This is a casual dining experience without fancy table clothes and waitresses. This works out great and makes it more fun for the kids.  The chicken momos are little Nepalese chicken dumplings served with a homemade tomato onion sauce. I recommend these.  The Indian snack plates are crunchy, healthy, fresh, and unique here in Charlotte.  The owners are friendly, informative, and encouraging.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGyTeVdJhsiD5cyZ5oATjg"
  },
  "lRn7WxvhhyMIHMPigZGxzg": {
    "date": "5/22/2015",
    "text": "Visited Chaupaati for lunch yesterday, after reading about their recent opening here on Yelp.  Tucked away in the Bi-Lo shopping center at the intersection of Park and Pineville-Matthews Rd, Chaupaati is the first \"casual\" Indian restaurant I've visited in the south Charlotte area.   The restaurant is clean, modern and cozy, with a counter directly ahead as you enter for ordering your food. There are large flat-screens on the walls brightly displaying the menu items. Once you've placed your order, there is a small station to the side to pick up silverware, napkins, and small glasses for water. The restaurant is packed with tables, so there shouldn't be a shortage of places to eat even if you're there during a rush.  Bishal greeted me from behind the counter and took my order. He inquired if this was my first visit, and was very friendly and helpful. While Chaupaati sells a variety of authentic Indian street food (chaat), I had to go with my standard -  (non-authentic, I know) Chicken Tikka Masala as a first order.   I was able to get a lunch portion for $3 less than the $11.99 dinner portion. When my food was ready, I initially thought the smaller portion might be too little, but it ended up being just enough food when paired with a full order of naan for just $2.  My order of CTM was very flavorful, although the gravy was more of a curry style tomato gravy with less cream than I've had in other preparations. I had no complaints though, it was still very tasty! The naan was okay, if a little more dry than I'd like, although once it was dunked in the gravy, it was perfect.  This is a great new restaurant with very friendly owners and staff. There seemed to be a few \"regulars\" in there already even though they've only been opened a short time. The only thing I could honestly complain about, although it's trivial, is that I wish there were larger glasses by the water dispenser. I always drink water with my meals, and I drink a LOT. A six ounce glass just doesn't cut it for me, so I ended up filling up two at once, and still made a couple of trips.  I'm excited for this new addition to south Charlotte's restaurant scene. I always feel like so many Indian restaurants are buffet-only at lunch and/or are simply too formal for me to drop in by myself to eat at lunch without feeling a little uncomfortable. While my husband loves Indian food, a number of my friends don't (which is truly unfortunate) so I'm usually a solo diner at lunch during the week. I'm glad to have a casual go-to for Indian fare and look forward to more visits in the future!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "IZXnSMdOkVdFH-mw6zQBbA"
  },
  "que0ZxC_HePTA6cvmJI07Q": {
    "date": "11/7/2016",
    "text": "I'd give this place six stars if I could. I, the most snobbiest Indian foodie who is not from India, absolutely loved the grub here. Zafran Kebab House is pretty darn good too but man this place rocked. The garlic naan was fantastic. The kebabs were good, hell even the damn white rice was slamming. The assorted pakora gets two thumbs up for me. So does the service. But the sixth star goes to the Lamb Chetinad. So damn good I wish we had just ordered seconds of that instead of going to see that horrible Madea Does Halloween movie or whatever it's called. I'll be exploring more of the goodies on their menu--my taste buds insist.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ooWmxUAYxcwJlSbDU86Vw"
  },
  "mtjdAALplmmOVa_tGGEvFg": {
    "date": "8/2/2015",
    "text": "Decent food, nothing much to talk about. We ordered some Indo-Chinese & Tandoor items and they were just ok-ok. Won't go/order again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "40t5OkGSsAb6K27y7E-owA"
  },
  "ZNswac0EysktSaPAuUv7bw": {
    "date": "11/13/2016",
    "text": "Delicious. Helpful staff with ordering. Family style and able to change the heat level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rmErpL1eWYaeAAb71Krcuw"
  },
  "cn7ITzpQSXE_G_Z_xZ-FTg": {
    "date": "11/2/2015",
    "text": "I didn't  like Indian food...now I do That was how good this place was!  Will continue to try new items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bUTjvwJ-LBv8TEYWwjbb6Q"
  },
  "pCgQKUB1sfEGN0JvOAomeA": {
    "date": "10/5/2016",
    "text": "This place is hands down the best Indian food in Charlotte. The samosa chat is amazing and you will crave it. The service is always friendly and helpful. DO NOT MISS THIS PLACE!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "82tIfVWQjSnTFu0V5-khRQ"
  },
  "uar093J_3VXfycP7OYsoJg": {
    "date": "9/26/2015",
    "text": "Good addition in Pineville NC. I tried mango papdi chaat gobi manchurian and dabeli. Mango lassi is good but more on expensive side. We ordered bullet naan to go, verry spicy so if you have not tasted it before and want to try it , think twice before you get it. Overall nice dining experience , it's cafe style but with full menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9Xk9mzB8adogzTlvxMC2tg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Gobhi manchurian",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9Xk9mzB8adogzTlvxMC2tg/o.jpg"
      },
      {
        "img_id": "ghElqrOmnhSnwBDZ4EkbfQ",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Dabeli",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ghElqrOmnhSnwBDZ4EkbfQ/o.jpg"
      }
    ],
    "user_id": "s2Od8Ty8glS4jHyLNGHgDQ"
  },
  "ZgOrOUW2Vy68M5dSAyxN6A": {
    "date": "1/15/2017",
    "text": "Not only is the food delicious the staff is the nicest group of people you will meet. If you aren't familiar with Indian food or are  bringing someone who is hesitant; go here! They explain their dishes, will accomodate your requests and in general make their guests feel happy to be there. I can't say enough good things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRq7edZCmPnABHqk9vdfmA"
  },
  "wI5T_ZVbjDFqlppwvridvw": {
    "date": "1/14/2017",
    "text": "Great food! Ordering online was a little bit complicated, not know what everything is, but the food was great! We will be back time and time again, it was a bonus that it was decently priced as well!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gygbqLsLJP07TCVlrVQvBA"
  },
  "g4Hqw7rpmiNV31BuJUVMMQ": {
    "date": "11/24/2017",
    "text": "This place is horrible.  The service is terrible. We went 4 different times and they never have dosa and always give lame excuses like cook hand broken but he can cook other things. I would not recommend goin to this place. The food is terrible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ICt5mIs-koZXqSiIMFjAVQ"
  },
  "V2-fiWVvDD8YNPCa8UZwFQ": {
    "date": "10/11/2016",
    "text": "Nestled in a strip mall next to Bi-Lo grocery store off Hwy 51 and I-485. My first time eating Indian food - man, was it good! I went with coworkers who were more seasoned, so they steered me towards Chicken Korma (chicken in a spiced cream sauce over rice). We also sampled Mendu Vada (lentil doughnuts) and Gobi Paratha (paratha bread stuffed with spiced cauliflower). Everything was delicious. The service was fast and friendly. I would highly recommend this place and can't wait to go back and try something new!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XfCY19--VpX9VxWNy6Sfg"
  },
  "kKGzFvJurbE7UtXBDu1dJg": {
    "date": "8/18/2016",
    "text": "So I finally had the chance to try this place for lunch and it was very tasty!  Here's how it played out:    We enter and are immediately greeted by the manager complete with the red makeup on his face representing his third eye...  He was all smiles and explained the flow very well.  You look at a menu at the counter and place your order and pay for it.  Then you walk over to a stand where you gather your own plate, napkin, silverware and cup.  You then pour your own iced water and take it all back to your table.  You can also buy a canned coke product or beer.  ok, this is a little odd, but I can certainly see how it lowers the bottom line by eliminating the need for waitstaff ... much like Chipotle does.  I ordered Chicken Tikka, raita, garlic & cilantro naan and a coke all for $22.  Too pricey for lunch but it was tasty and I had enough to take home for dinner.    The manager did check on us and asked if we had any questions, which I appreciated.  He was a delightful person and we enjoyed his energy  :-) We'll definitely be back  :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "j5Gk8XfZvjhuaedLXZtXaQ": {
    "date": "8/31/2017",
    "text": "We have no Indian Restaurants where I live, so whenever I am in Charlotte I pick up some take out at a different one and try it out. This was ok. It wasn't the best and wasn't the worst. But I won't be returning because there is so much better in the area.   I got 3 curries and an order of naan. The baigan bartha was delicious, the saag paneer was pretty good, and the chicken tikka masala was absolutely disappointing. Each curry tasted a little too much like the other, which was bad enough, but the chicken in the tikka masala was actually made with DARK MEAT CHICKEN (probably thighs) which no one in my family eats. It was stringy and greasy and absolutely ruined this normally delicate dish. I have NEVER in all the years I have been eating Indian Food (over 40) had this dish made with dark meat chicken, so I never would have thought to ask while I was ordering the dish, \"is this made wi th white meat?\" Yuck. Total failure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsGSLkEk7XcXACifBaQeuQ"
  },
  "2vSGgFaCQYzOKc_ELWLhUA": {
    "date": "5/18/2015",
    "text": "Excellent food... If you are a foodie and love snacking try this out!  I tried the lunch menu twice and loved it both times... Price is reasonable.. Some items can be a little less $.. But the quality of food is great! Can't wait to go back,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5OOYUCU0A4UNKjROy4T9Mw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Gujarati thali - excellent !!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5OOYUCU0A4UNKjROy4T9Mw/o.jpg"
      },
      {
        "img_id": "zViEf0dabAQnTE3pZLa6qg",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken momo - which k already started eating ;-)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zViEf0dabAQnTE3pZLa6qg/o.jpg"
      }
    ],
    "user_id": "wc1JiMpWL_9G9_XY7IHD5A"
  },
  "9A4BRdiAX7GIVYK6YDabHw": {
    "date": "6/11/2017",
    "text": "This is hands down the best Indian food I have had in NC . It's a very nice casual restaurant with a family owned feel to it. The manger or owner was super nice , and even made butter chicken for me although it's not on the menu .... which was delicious! He followed up to see if we needed any extra rice and how everything came out . I would highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uDV0ibpTLJw-RbioTk26jg"
  },
  "9l9ErmQ4cncr6PK7Ct2Cjg": {
    "date": "1/3/2016",
    "text": "Best Indian food I've had in Charlotte and we moved here from the San Francisco area (which I know is an incredibly pretentious thing to say but hey, there's a lot of good Indian there). My husband thinks it might be the best ethnic food he's had here period and I can't disagree.   We just finished up. Stopped in on a Sunday night after catching a movie at the AMC theater. The Yelp reviews lured us in and the fact that it's located in a strip mall sealed the deal. The place was PACKED with Indians - always an awesome sign.   We decided to have a \"Treat Yo Self\" meal and ordered the following:  - Chicken Momo (pretty yummy but overshadowed by the other dishes) - Chicken Tikki Masala (delicious) - Lamb Biriyani (got this one spicy, fantastic) - Chili Chicken (showstopper) - garlic naan, butter naan, and a cauliflower stuffed naan-type bread with a name I can't remember (all excellent)   I would order all of these again in a heartbeat and will probably think about most of them longingly around noon once or twice a week. I wish this place was closer to Charlotte proper so I could visit more often. Worth a special trip if you are centering your evening around a delicious adventure.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rzXBGu2Vr9zCQyEg1fs0lQ"
  },
  "1LQn45VzuGjuO29MP0nEWA": {
    "date": "8/12/2016",
    "text": "This is by far one of the most authentic and delicious Indian restaurants in Charlotte. The owner makes you feel like you are welcomed into his own family's table. I love the casual and friendly atmosphere. The food is out of this world. This restaurant is a True find!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qPz4lTAzX7puln6jw5_Bhw"
  },
  "hG6sDHcXNnp8aWA386bMiQ": {
    "date": "1/11/2017",
    "text": "damn!!! excellent daal makhani!  naan is fresh and amazing. never been here before but when i stop through town, it will be on my list for future visits.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bVW0KlwWsoX_SZMxpyFyPg"
  },
  "Q9DR04Xpt8bRRixNpZfFsQ": {
    "date": "1/14/2017",
    "text": "GO! Great food and good service here! Fast casual with relaxed atmosphere and friendly staff. Be sure to go any time you're in the mood for a Curry without the pretense.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8A3PEWoGTFwFbarPyF3a-Q"
  },
  "EjeyFxKzU2ywMe3eQcwZeA": {
    "date": "1/30/2016",
    "text": "I can't say enough good things about this place. The menu is authentic, the staff are super friendly, the place is clean, and the food is so, so wonderful. As someone who eats a vegetarian, gluten free diet, this place was very catering to my dietary needs and preferences.  It is super helpful that they have all the dishes they can prepare gluten free marked on the regular menu.  Just be sure to ask them to prepare dishes gluten free that are marked as such.  I have been to the restaurant twice, and each time the food has exceeded expectations. I've eaten the malai kofta and the aloo gobi. Go check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iL1XNxJpthukMmKESTPqZw"
  },
  "lgZLqPZcwxB1e8PV2ZRCuQ": {
    "date": "6/11/2016",
    "text": "I'm a regular at this place to get my dose of chaat. Casual restaurant, nothing fancy. The food is great. Service is prompt and the staff is friendly. Definitely recommend this place if you are in the mood for Indian food.  My favorites - Dahi puri chaat, samosa chaat, veg thali  Room for improvement - Indo-Chinese, masala chaai and dabeli",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8_J0goA-UUOG6cwgutrKLg"
  },
  "5bAJgAcGwSZE_-axggMRYw": {
    "date": "7/24/2016",
    "text": "This casual restaurant could not have had better service. They answered every question with honesty and enthusiasm. Kindest people and amazing food. The two of us ordered 6 dishes so we could try a bunch of different items and they were ALL top notch.    There were several Indian families in the restaurant with joyous kids and full parents. It felt like a real community. A neighborhood restaurant with great food and good people. We highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gvELVKETE_R1J8hCxzctTA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gvELVKETE_R1J8hCxzctTA/o.jpg"
      },
      {
        "img_id": "DIFf09mycvDj94rNsxMTmA",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Lentil dish and Taj Mahal beer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DIFf09mycvDj94rNsxMTmA/o.jpg"
      },
      {
        "img_id": "zxwzMPxV5XVcVYVE87hkiw",
        "caption": "Photo of Chatpatay - Pineville, NC, United States. Chicken 65 in the foreground. Dabeli in background on right, Assorted Pakora on left background. All were so good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zxwzMPxV5XVcVYVE87hkiw/o.jpg"
      }
    ],
    "user_id": "cqpFli9b9FhICGB4B6xkAQ"
  },
  "7oihspv8dUnvHDSl0bgiTA": {
    "date": "12/9/2017",
    "text": "Being new to Charlotte, I've been trying out a bunch of restaurants. Found my new Indian go-to. On a shared ride home from work, a friend and I decided to stop here for a well deserved end-of-week dinner. The place is easy, low key and casual--exactly needed after a long week. We ordered at the counter and then found a table to sit at. The people there are incredibly nice and helpful and the tables are clean and orderly. They're happy to help if it's your first time there or having Indian food. We got an order of naan, chicken tiki masala, lamb biryani and mango lassi. They did suggest we go lightly spicy on our food but found it a little too light. Light is about a 3 on a scale of 1-10. All the food was delicious - incredibly aromatic and flavorful. There was no skimping on meat in our dishes and the serving sizes were generous. We had enough to each take home leftovers. The lassi was delicious. Can't wait to try their lamb rogan josh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AXNvAtPfNiiP6ethaOjsgA"
  },
  "i3u0rC7OwjN5Uw1z4_awjg": {
    "date": "4/6/2017",
    "text": "I've been to chaupaati plenty of times and I truly enjoy the food. Recently I had the veg biryani and samosa chaat and OMG it was 10 on 10. I'm not sure if they revamped the recipe or have a new chef in the kitchen but both dishes were delicious.  If you have the chance please order both!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfECTGBYb6IarwwNMm6zUA"
  },
  "f7wKMcCJ4PjBM0FkL0uUmA": {
    "date": "9/1/2017",
    "text": "I really enjoy the chicken tikka masala and samosas here. I need to branch out and try other items as well. The only reason I didn't give 5 stars is, the first time I went, the garlic naan was amazing!! So delicious. Since then, the naan has been okay but not as magical as the first time. Overall, I really like the food though and will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ToDHcDtPxkY0pq_ftA7Jhg"
  },
  "HVOa7hzjOAY3SDSbmIWGmQ": {
    "date": "2/6/2016",
    "text": "I have become regular customer to this authentic chaat food resturant.  My husband and i make visit atleast once or twice a month. This place is defi nostolgic.  I will defi recomment my collague, friends and family to try their food once.    My fav chaat is samosa chaat, paneer chili and dabeli.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qMQoeNlzgonCsME2G9Pt4Q"
  },
  "WlAU5xZXd96c8dqC4nu-_w": {
    "date": "2/5/2017",
    "text": "Visited yesterday with family and ordered Paani Puri, Dahi Puri, Chicken Chilly and Chicken 65. $8 for each plate of Paani puri and dahi puri is very expensive compared to any standards (and only 7 puris in each plate). Not recommended for the price charged. Chicken 65 and Chilly Chicken were tasty but too spicy.. Be prepared for next day morning..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4pN4gx2PPtPuczYQE7NXoA"
  },
  "Z28aMxWUFAlcrfftfFV5HQ": {
    "date": "1/13/2017",
    "text": "Stale food! My husband had non veg thali. The mutton dish was very old and stale. Soon after having it, he started showing signs of indigestion which was followed by continuous vomiting. Didn't stop for an hour. He is not allergic to any type of food and this is the first time I have seen him puke. The food was clearly bad and old. Wouldn't go there EVER!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "phOQY61JsCpr4VWhL3h3ZA"
  },
  "wwEwk1CtDFw_ECK41ib6CQ": {
    "date": "11/22/2015",
    "text": "Moved from Austin just a month ago and I've already been to this place 4 times. I am on a venture to try all of their food.   First time I tried the chicken biriyani and paani puri - did the same again - i didn't have much expectations on the biriyani, but they excelled. Chicken 65 was pretty good, and the Chicken soup and Chole Bhature as well.  Second edit By now, I tried all their soups, chole bhatura, dosa, idly, medu vada, and ... Hayward 5000..  Nonetheless, the customer service comprehension... I'm sure I'm revisiting here with further updates ..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "stFPdFFueRQqs86f6lN1Wg"
  },
  "3m0nPuaPnR_h_ehL0l-riQ": {
    "date": "4/16/2017",
    "text": "Awesome food. This was the most authentic Indian food we ever had in Charlotte they even beetle leaf at the counter. We will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gB8GfwXtnTtGrkjiJsLYiA"
  },
  "vOfdozlNIyiYANnYc-HtVw": {
    "date": "8/6/2017",
    "text": "Food tastes good. Thali is not worth it. Rates are high. When they take a min 15% tip they should clear out tables and not expect customers to clear out before leaving, changed to 4 from 3 star - as food is good. (Still - servers need be more polite)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LpsK2-QF9sGCjm3qELp8OA"
  }
}