{
  "R-nfP8GkuHpPDvVOvsqKUA": {
    "date": "5/7/2013",
    "text": ", I gave this place several chances, but this past Sunday was it for us.  Mind you the service was good. The food on the other hand was just horrible, horrible. The green beans are canned w/ way to much seasoning and Soggy. I ordered the patty melt and the meat felt like card board with absolutely no flavor, the rye bread was so soggy that it was stuck on the meat, but the edges where hard as a rock. This place has completely vanished from our choices to eat. Bye",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6flPs_bKYC43KXq63OiHeA"
  },
  "CM11teY9_iQT0dISEzEjWA": {
    "date": "1/12/2013",
    "text": "It's just not good. The food tastes pre-made, frozen, and microwaved. Canned veggies. I would never go there again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-2uhgBrHoFvUjfLaf3OFQ"
  },
  "YVI_OEpwqcuemA5vyY5Q7A": {
    "date": "7/23/2013",
    "text": "Great food! I got the Buffalo Chicken wrap, comes with awesome fries, ranch or blue cheese dressing on the side. My brother got the Gyro Pita, he said it was very good. He also got the awesome fries. Wish the fries had been a tad hotter, but they were still great! I think you get my point...anyways...staff was nice, our waitress was on top of everything. Big menu so there is a lot to choose from, $8.00/person-average. Would return again next time I see a movie :) Also, I wish they would turn the music up a bit, couldn't really hear it, but not a huge issue!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW8WuLpZPk9btE3TgkQw2Q"
  },
  "undTg1RFXZxuZEKC275WxQ": {
    "date": "9/29/2015",
    "text": "I really like the food selection and friendly wait staff.  I have ever are here 5 or 7 times and have always enjoyed the food.  Family friendly and a good place to reach and talk.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8nM99tKg_E5itW37f5oeA"
  },
  "RUzPb8ZrLDVJY6TsaJnbqQ": {
    "date": "1/3/2015",
    "text": "I and my husband have eaten here before and usually have had good meal and service but last night's visit was a total disappointment, which was Friday, 1/02. The place was not what I would call busy for a Friday night but maybe because of the rain, it kept folks away. We were seated promptly and greeted by Nicky, our waitress. I had come here last night as I told my son how good the food was on previous visits. We were in the mood for fish so I and my son ordered respectively, the Calabash shrimp and the Whitefish and Calabash shrimp platter. Now, the place gives you a good offering of sides that come with your meal and maybe the reason is , in this particular case, the small amount of shrimp on your plate. I mean, it really is miniscule. If I had a third of a cup of shrimp, that was a lot! Also, it was very salty. Instead of two sides, I had a salad and asked for onion rings , which they charge a dollar extra for. Now, I have had their onion rings every time I have eaten here before but last night's version was awful. The breading on the rings was clearly different---lots of oregano and other seasonings in them. Did you use Italian seasoned crumbs this time?  Sorry, they were  a total bust. Please return to your original way of breading the onion rings. My son's whitefish was good but again, he got a tiny amount of shrimp. Also, could you spare the hush puppies?  We each had two on our plate. Another thing that was annoying to us is the waitress came back at nearly the end of our meal to ask if all was OK. I used to waitress for a living and the time to come back should be no later than two  minutes to see if the food is done right. I told her that I was seriously disappointed in the saltiness of the shrimp and all she did was feign surprise and said she would notify the cook . A lot of good that does your customer at the end of the meal!      All I can say is do not order seafood items here---you can do much better by going to Captain Steve's up the road a few miles in Charlotte on Monroe road. The portions are the same price but you always walk out with leftovers from that restaurant. I am not a big eater to begin with but I was still hungry when I left the Sun Vally Cafe last night.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "me_DfeOZUFZB7pTlXv-Aag"
  },
  "T3hfD-rdhkT6ey3JO4wPxQ": {
    "date": "5/4/2015",
    "text": "YUCK!!! Service was good; however, food was greasy and not fresh. I would NOT recommend this place to anyone!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SG001rkaLIBN9NvHV1DH6g"
  },
  "680qC6rNXd7Z8eUbdb01AA": {
    "date": "7/18/2012",
    "text": "Nothing special.  Not good food at all (the three of us had breakfast).  Don't think I will be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3Pi3Q6plD0mJZL_-_wONw"
  },
  "4dhbT3JyE5yLnhYXtFdAEw": {
    "date": "7/1/2013",
    "text": "Used to be so good with previous owners. Mediocre food, service. Prices went up, quality, portions went down.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUXlfBpwdu-IiOSyJJbIaQ"
  },
  "ul3luiZd7FuAMA-42opjbA": {
    "date": "12/13/2014",
    "text": "Ok, so first off DO NOT let them seat you by the waitress station. I was bumped and jolted more than riding the friggin NY subway. Also, the dropped serving trays atleast 3xs. The food: meh. The complimeary soup is more of an insult than a compliment -  I've never seen chicken soup as thick as chowder. Won't be back - already tried them twice.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "eo9Am8sWKCnUIy6BQMBDzA"
  },
  "g_YGs2Ki8EkfPumq5YC50Q": {
    "date": "6/27/2012",
    "text": "Very open and large dining area. Good home cooking. The place to go for fried chicken, mac n cheese...comfort food in general. Prices are reasonable, menu extensive and quality consistently solid. Key term: comfort food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "LXsKAHdgdj0-dyYmSMxgTA"
  },
  "4eW19tLeFCdbBcxd_JsXEA": {
    "date": "1/24/2012",
    "text": "Nice place to take the folks as the food is not overly seasoned if at all. We liked the fact that they do not season with pork.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSp0l4VCndo7Q4Icv53kaA"
  },
  "zDGuRyMTbpjnd2wnnXjPag": {
    "date": "11/8/2011",
    "text": "Your A-typical greek family owned style place with down home cooked meals as well as traditional greek dishes.  I've eaten here a couple times and last time was with my girlfriend and kids in tow.  They were very quick and friendly with the ordering and the dishes were a hit with everyone at the table.  I had a grilled chicken salad and it was served in a bowl the size of jupiter.  I'm ok with that because I want to feel like I'm getting my money's worth.  This place will certainly give you that feeling.  My girlfriend at the Gyro plate and the meat was really good.  One note to make, for those that might care, this place doesn't serve adult beverages so you are hereby forewarned!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "HIf80PfjoaWiFIUX6UsgyQ": {
    "date": "2/26/2011",
    "text": "DISGUSTING! How could anyone eat at this place? I don't care how cheap it is... it's awful. Even the staff look like they're about to die working in that place. Absolutely horrible. DO NOT WASTE YOUR TIME OR MONEY HERE! You'll regret it!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "3YBHQGr2Ui_PDLGqBhPmYg"
  },
  "E5SfagfvbHbg2FpCYSVhig": {
    "date": "7/10/2011",
    "text": "Clean, Clean, Clean under new ownership and recently remodeled. My husband I I breakfast here on Sat. mornings. It is fast, cheap, and friendly. I like to get in and get out on Sat. mornings and this is the place. It is your typical diner, not fancy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "Li1JykoOeAYXxojfqxUP3w": {
    "date": "3/18/2011",
    "text": "I've eaten here twice now, both times for dinner. Both were relatively positive experiences: decent service, appetizing food, pleasant atmosphere. Nice family-friendly, Southern style cooking type of restaurant. People in my group were disappointed at the limited sides/\"vegetables\" list (the little to no healthier options, that is). Both times the majority of my party really enjoyed their food. I will say I didn't care much for their mac 'n cheese, but it wasn't terrible, just something I won't order next time. I think the place is comfortable and the staff is nice, the prices are reasonable and the food is decent, so it's a good place to visit occasionally if you live nearby.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "otKt7KFX1694tYceHZ5PHg"
  },
  "B0AXa50KbAM37gb2gqKeow": {
    "date": "7/15/2013",
    "text": "Great family restaurant. Best items ordered were country fried steak and peanut butter pie!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JQ3IWOfXkyz1TEGwDdiqFA"
  },
  "g5w6Xgj2SyEJdUvz4bz_3Q": {
    "date": "7/26/2011",
    "text": "Food is hit or miss but definitely home cooking type food. Love the BBQ plate meal with 2 sides.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vD3S6Klov8x1Ru60zjlHKg"
  },
  "3qoqppDd5iI1TZewLbHPMg": {
    "date": "3/26/2013",
    "text": "My family loves this place!  We are always well taken care of and the staff makes us feel like family.  As far as the food, it always tastes fresh and you can tell it is made in-house, which is so refreshing.  And you can't beat the prices- it's definitely a good value if you are looking for a home-cooked meal.  There is something for everyone.  I'm a pretty picky eater and I have enjoyed everything I have tried.  The onion rings are my favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKCLpGtZNqb-jaK5F2iSDg"
  },
  "zOXC3Tq_EMTr2iEBg22TfQ": {
    "date": "2/17/2012",
    "text": "Stopped in for a casual dinner the other night. Meh is right. The food really wasn't good at all. The waitress was very friendly, I'll give them that. Also, it was a nice touch with the complimentary cup of chicken noodle soup but that's where it ends. I ordered the meatloaf w/ mashed potatoes and collard greens. This place claims to be home cooked meals. That is stretching it ALOT! My meatloaf appeared to be a flat piece of hamburger with marinara sauce on top. I'm not kidding. It tasted like it came straight from a jar of Classico spaghetti sauce. Classico, please don't be insulted. The collard greens had to have been the frozen kind. They were chopped into little bits just like the kind in the frozen section of the super market. The mash potatoes & gravy, quite bland. My wife got the baked chicken. It was dry which went nicely with her dried out mac & cheese. My wife did like the sweet tea. A positive! All and all, very disappointed with the meal. We will not go back. There are plenty of other establishments in the area where I can spend my money.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "MvtptvmTrevVuFOOrXYZqA": {
    "date": "2/21/2012",
    "text": "We waited a few minutes before someone finally greeted us and took us to a table. It wasn't very busy, yet we watched several of the wait staff pass right in front of us without so much as a glance. One older couple got their soup and drinks (They spoke to their waitress like they were regulars) while we remained unattended to.  We finally got up after almost 10 minutes of being ignored and left. On the way out someone had the nerve to acknowledge us and act offended that we were leaving. We will NEVER be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "opPMmpahSirQ4nmNkIAnug"
  },
  "fRV-y9SV79U9WC9L-ktzYw": {
    "date": "11/6/2016",
    "text": "Thid is the 2nd time we have came here for breakfast and we are very pleased again. The staff is always friendly and the food is good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "ey13h2N-e_-u_Thtcn2J1g": {
    "date": "12/4/2016",
    "text": "Hash browns awful. Omelets ok. Grits ok. Clean. Server very good, friendly. Won't be back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "koncwgqX6I_cVnZpWm2gMQ"
  },
  "XIpT93JibyGv4zwRzjK04A": {
    "date": "6/27/2016",
    "text": "Very disappointing. The soup was awful. They seemed to add sugar to everything. The staff was lazy. We won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EVqKXOWSTUF_UQjg6BN1Qg"
  },
  "ynTxZVdmr5l33iFMTqfLQA": {
    "date": "1/19/2016",
    "text": "My first visit. Ordered the Gyro Pita that comes with a complimentary soup. They were out of soup. It happens. But complimentary or not the price charged includes a cup of soup and it makes you feel like your getting cheated when they don't offer some other small token instead. Server said that other patrons had also expressed frustration in the past when it happens. Not a very well thought out way to ensure customer satisfaction on managements part. Probably figured no big deal. But it did truly cost them one future patron. Sorry, too many other nearby restaurants I can eat at that strive for customer satisfaction. A solution would be to add the words \"complimentary cup of soup while supplies last\" then you don't feel like it's always included, you just feel like you should've come earlier.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWCLhDCbM1POjSYjOBa2-w"
  },
  "5EPij3SKYIsEb1zGrMlnZQ": {
    "date": "12/14/2013",
    "text": "Have been here for breakfast / brunch a couple of times.  They're pretty good about getting you in, and I've enjoyed my meals here.  Waitstaff knows the menu pretty well, and is good about keeping drinks topped off.   Prices are average, value is above average.  Ample parking.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nomlpGFtxtqg883RG3v2Fg"
  },
  "ysMCexcchlFEdoNQXcqmww": {
    "date": "2/5/2016",
    "text": "I like their soup. Its the best. Some of their food is okay. What I dont like is the service. I feel rushed. I feel like Im a bother....Or I'm at my evil step mother's house lol. Everything is rush rush rush. Whats all the fuss about?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2_7x4yYBtvBnkZhAzgT3Q"
  },
  "KpgwjbLKSirDlbB9W9qMiQ": {
    "date": "2/2/2013",
    "text": "My husband and I are foodies, we love to go to Thai, Indian, Burmese, Sushi...we will try just about anything and if it's good enough we have no problems plopping down $50 a meal.  That being said, there is something about this place we both love.   The coffee is good, the service is always super friendly (must have been here at least twenty times by now), it's seriously low priced, and we have almost always been happy with what we order.  The Greek burger was meh but I think that is the only thing we weren't too keen on.  I love their chicken and rice soup, it's gratis when you order any lunch or dinner item and it's flavored with hints of lemon, yum!   We come here because the booths are cozy, the food is good (for what it is, yes it's diner food),the place is clean,  the service is friendly and there have been times we have hung out for hours chatting with friends and not once has the coffee stopped coming.  I'm slightly addicted to their lima beans(crazy right?  I didn't even know I LIKED lima beans til I tried them here), their greek omelette, chocolate chip pancakes, reuban, combination platter and their beef liver(I eat like I am 70 sometimes, don't judge).    Prices are pretty much as low as they could be.  Typical breakfast sees me getting a chocolate chip pancake with egg beaters for under $4 or a Greek omelette with grits(or hashbrowns, I like grits)and a biscuit(or toast or english muffin)for about $7.  it's so big I always half everything and have it again for breakfast the next day.  It's no Bistro Le Bon, but it's comfy and I like it, so poo-poo to the haters!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "6O5Q0kyHUqcc_Vl2_uVCbw"
  },
  "GlywwNHtCADeYUlYdXEHag": {
    "date": "3/3/2013",
    "text": "Great food! I dont understand where people think this is a greek restaurant.... Ive been to a few and nothing seemed greek in this place.... I went the other day with my mother for lunch. she had the potato soup and salad. It was excellent! I had the chicken over stuffing with green beans. It was excellent. Staff was very friendly!    What a great home cooked meal! Ill deffinately go back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jfy2usYXLrH8LAPyWgMXyA"
  },
  "ve5BYD5bDLppHNtnCPMnwA": {
    "date": "10/12/2015",
    "text": "Great food! Great staff! Great prices! Our waitress was outstanding! Everything was hot and good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "muMvl21UDxkYInDg1mJKOA"
  },
  "si7erzVNuswBKJZpm3z6MQ": {
    "date": "2/14/2016",
    "text": "This is our current weekend breakfast spot since moving out of Uptown & back down to Indian Trail. I can't speak for their lunch/dinner menu, but they serve a great breakfast. It's a rather small & simple menu, but everything they make, they make well. My personal favorite on their menu is the Hobo Breakfast. It's a layer of hash browns, onions, peppers & ham, topped with scrambled eggs, smothered in a heap of sausage gravy. Get a biscuit and a side of country ham & go to town on that bad boy! Staff are all very nice. My only nitpick is that I think their grits could use some improvement. Otherwise, solid breakfast spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeeFKzmSUz4zQ30DpM6G-w"
  },
  "CZ_XUTBX4_mqNmlzdfUCqg": {
    "date": "1/4/2016",
    "text": "We eat at sun valley cafe all the time. The food is delicious, simple and homey. Portions are generous. Nothing fancy here, but always pleasant service and consistently good experiences.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRq7edZCmPnABHqk9vdfmA"
  },
  "sNMlkY8UrUlXH9aI_yDpnw": {
    "date": "8/16/2014",
    "text": "This restaurant lies to employees and screws them out of money! Please  see my comment in Tips below. There are plenty of other places to eat in same shopping strip. Please patronize establishments other than this one! I have 18 years restaurant experience and have only worked one other place as dysfunctional as Sun Valley Cafe!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "UN9EgkBxcseMwgTBHh_aDA"
  },
  "BbgcUTo_lhlhNKL0bsc1Qw": {
    "date": "4/26/2014",
    "text": "Not a good experience at all!! Out of fried chicken, out of mashed potatoes, mac and cheese not good. Service was poor. First and last visit for sure.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "eDfcJjOWnAvTJfNKzGVR4A"
  },
  "fiOS1cFpF0QLUezjlz0mbA": {
    "date": "2/9/2014",
    "text": "Nothing really special about the food I had the Ruben and it was ok I have had much better. Our waitress was not very personable and did not seem like she wanted to be here. Probably would not come back",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "KRES9K_r69EqQIEwmqqEXQ"
  },
  "1jdDUOc87rp1Wu4W5lj_YA": {
    "date": "9/24/2014",
    "text": "Great home cooked meals that's always comes with service with a smile! Best soups in the area!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4pEHuG4c5O8XodmyAGZong"
  },
  "KcpKWJyVaqTnhXPDAWnvVQ": {
    "date": "6/29/2014",
    "text": "Sun Valley Cafe is great for a quick bite for a good price. The food is good and consistent and the wait staff is always friendly and fast with refills and such. Plus they give you free soup! Who doesn't like that? I love their salads and my husband loves their meatball sub and cheesesteak... But only with onion rings instead of fries (they aren't anything special).",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXthHnamJJpdXQ7i78lPMg"
  },
  "1OeXpKEmPBPdnUi5aV5k1Q": {
    "date": "2/19/2014",
    "text": "The Gyro Pita and the fries are amazing! Gahhhhhh also our waitress was very nice :) but do wish she checked on us after food was served.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "b6ris09qm-WlSkg68pWthQ"
  },
  "42Ry9JpcEkd0gOfGGmCfmA": {
    "date": "6/27/2014",
    "text": "Great home cooking restaurant. Always order from here whenever I'm down and need some good comfort food to make me feel better. It ALWAYS works. Great gyros, baked spaghetti is great. Whenever we dine in, the service is good too. Very nice and local people who seem to enjoy their job.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "M7hNDkDzoLWcrnG4CkR_jA"
  },
  "qgzrlewZhRzxsKA5pcAKEQ": {
    "date": "3/25/2014",
    "text": "Breakfast at this place is great!  Super fast and friendly!!  They give you a lot of food and it is pretty inexpensive.  I love hash browns and they were perfect, a little crispy on the outside and wonderful on the inside.  the only way this place could be better for breakfast is if the Sausage Gravy Biscuits were a little less floury tasting and spicier (think Bojangles here).  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zf7dQXA5vL6kIhNTXjUfqw"
  },
  "ztIFUf_pEWqidbOcvZbWxw": {
    "date": "1/17/2015",
    "text": "If you think the food is wonderful, wait until you know what really happens behind closed doors.  The beloved \"free\" soup that everyone raves about isn't \"free\" from bacteria.  As a matter of fact, it is made from week-old, if not older, baked and fried chicken that is re-processed into sludge called \"free\" soup.  Not to mention that meat sits out overnight on the counter, only to be met by prep cooks who don't handle it properly.  I've seen food left in the microwave overnight that is to be used the next day.  \"Country Style Steak\" that was gray and rotten, only to be cooked by those who were told their jobs were on the line if they didn't.  Food is placed in the steam table to \"heat\" before service.  (Those of you who know about food-borne illness know you must bring everything up to 212 degrees, then keep it heated at 140+.  NOT TAKE IT FROM A COLD REFRIGERATOR AND HEAT IT TO 140 DEGREES!!!!! )  Why do you think so may people have gotten sick here?  The only reason the health department doesn't know is because they hide it before 8 am.  Let's not even talk about how horrible they are to their employees!  No wonder why the Department of Labor came down on them.  They are abusive to their employees and don't pay them the wages they deserve.  Which, mind you, is a measly $2.13 per hour plus customer tips.  How cheap can they be?    The bottom line is, you don't ever want to eat here!  It is disgusting!  Why do you think they can't ever keep any employees?  They don't want to eat here either!  EEEWWW!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "MvmIwbgWQ2d_gTIPrN631w"
  },
  "scdSgu6hfBtqKSIBEWwArQ": {
    "date": "7/13/2019",
    "text": "Cute little Greek Cafe. Generous portions and fair prices It's family run and been here about 10 years. If you want good home cooking, come here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "grgzeDav9daMvOT04TF8Tw",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. I got the Summer Salad with Grilled chicken salad on top",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/grgzeDav9daMvOT04TF8Tw/o.jpg"
      }
    ],
    "user_id": "Jzy9P_PD89jzjd-PKcx62w"
  },
  "Nm75niiF9msi1LJKh7wjjw": {
    "date": "8/6/2019",
    "text": "Not only was the food atrocious the serves was so lacking I felt as if I were the waitress.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tC4CCS-pXhm6MPlbrgJjSg"
  },
  "diJprZ_plCEVk7uUNil6WQ": {
    "date": "3/12/2019",
    "text": "Just stumbled upon this restaurant.  Was actually going to another restaurant in the same shopping center and saw this one with its HOME COOKING sign.  Who can refuse home cooking?  So, Deanna and I switched our plans and gave it a whirl.  Walking into this restaurant was akin to walking back to 1975.  Although they have been there for ten years, the decor shouted much longer.  Their sanitation score of 98.5 was impressive, but somebody should really wipe off the spills on the framed picture that was next to our booth.  I ordered the baked chicken and dressing.  My sides were collard greens and fried okra.  Corn bread was also on the side.  It all looked so mouth watering, but here is the reality: the chicken and dressing were average.  The collards were good.  The fried okra had way too much oil on it and I only ate a few pieces.  I used napkins to try to soak up some of the oil, but it didn't really work.  The sweet corn bread was a great treat.  Service was terrific.  Although the atmosphere was dated and boring, it was quiet and conducive to conversation.   It's good this restaurant is here because it was crowded and people seem to enjoy it.  There were a lot of older people there, which includes me!  Nothing more.  Nothing less.   When we walked out the door, we both commented that we bet they had really good desserts. It's just that kind of place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3dF_2rrDTf7KXmTTRziB2A",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3dF_2rrDTf7KXmTTRziB2A/o.jpg"
      },
      {
        "img_id": "twpL3njGskkP7zH7uUdZLw",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/twpL3njGskkP7zH7uUdZLw/o.jpg"
      },
      {
        "img_id": "lHqL3j29AKVv1CCU2LV8yg",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lHqL3j29AKVv1CCU2LV8yg/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "DTcrCmLkTJyd2EgZAcEMag": {
    "date": "9/29/2018",
    "text": "This is a winner of a cafe.  Tucked into a shopping center on Old Monroe Road you have no worry about parking.  Nice people, good solid food and very fine service.  Wife and I have had breakfasts and lunches here and each time has been an excellent experience.  It is clean, well run and managed and the menu covers the water front, so to speak.  Breakfast:  one of my favorite times of the day.  Typical egg dishes and meats, good generous omelettes and...hold on to your hats:  THEY SERVE HASH BROWN POTATOES!  Yea!  I get really annoyed when a menu states hash browns and you end up with those chunks of potato that are dry and mostly flavorless.  Not here.  Hash browns deluxe were a treat as well as a surprise.  Similar to Waffle House without the oil, their deluxe version include ham, cheese, onions and peppers.  Actually, you could have just a serving of the hash browns deluxe as your meal.  It is a $2.99 upgrade if you order a meal.  Well worth the up charge as they are soooo yummy.  The rest of the breakfast menu is loaded with a good variety of omelettes, combos that will surely bust you belly, griddle items like waffles and pancakes, and breakfast sandwiches to include breakfast burritos.  All the meats to include turkey bacon and sausages, liver mush and corned beef hash.    And portions are generous.  What a deal!  We went for lunch, but not the same day as we did breakfast.  Lots of variety.  Made from scratch soups each day.  Salads and \"plates\" which include salmon and Greek salads.  Wraps and sandwiches...you choose.  To me the lunch and dinner menus are \"diner style.\"  In other words, they have just about anything you can think of and further that you wonder how they can stock and work the kitchen to put the variety of dishes that they offer together for you.  Steak, seafood, Italian, gyros and other Greek items, hot oven subs (!), burgers and, so traditionally southern, all sorts of hot or cold veggies.  There is a children's menu and desserts.  Amazing!  AND...in addition to all of these specific items, they have DAILY SPECIALS.  I think their menu could win a competition.  Couple what is offered with a kitchen that can put it together and very friendly service.  Prices are reasonable.    So if you are wandering around the Monroe area, put the Sun Valley Cafe in your GPS and dig in.  You will not regret it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "-X-osCmhQis8BXCRl82tkw": {
    "date": "6/20/2019",
    "text": "O my gosh so good service no waits.We come here every Friday and so good we do not have any problems and I hope it stays like this.Very clean",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kord57Zt4JPFfa1v6G0-Fg"
  },
  "V98YGttc-L7AzldzdDWy4A": {
    "date": "6/1/2019",
    "text": "Sat there for 20 mins with barely any body there and couldn't even get served a water.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9L8xhiqLPn8vWJf2Ed0Yg"
  },
  "g_CaDjFiPI_fkexvw-bBYw": {
    "date": "1/15/2017",
    "text": "I have been here several times for breakfast and lunch.  Each time I have been very happy and content with my food and service.  It is a friendly and open atmosphere.  There is plenty of room and seating.  The booths are comfy and restaurant is clean.    The service has always been great.  The servers treat you like family.  The are attentive to your needs and quick with orders and food.   Each dish is served with A LOT of food.  The portions are huge and most dinners come with TWO sides and a complementary soup.  My type of deal!!  I love the spaghetti sauce because it's slightly sweet and that's how I make my own.  It is a meat sauce, which I tend to stay away from-but trust me this one is perfect!!  The breakfasts are large and satisfying.  Again--huge portions for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IvZnsCJIclj_mmWBbRPJ3Q",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Hamburger steak, onions &amp;amp; brown gravy, mashed potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IvZnsCJIclj_mmWBbRPJ3Q/o.jpg"
      },
      {
        "img_id": "lLqIh9C_Z8Qz3c8ofHJJUg",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lLqIh9C_Z8Qz3c8ofHJJUg/o.jpg"
      },
      {
        "img_id": "vIGYVXsXNA78ym94CkBW1A",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vIGYVXsXNA78ym94CkBW1A/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "ezi_C-35vHxPD02jTvE9IQ": {
    "date": "5/27/2017",
    "text": "Stopped in for a to-go order: a chicken pita and a Philly cheese steak.  I've got no complaints - both were good. It wasn't particularly busy at that time (Saturday afternoon, 2-ish) but the phone rang several times for to-go orders,  and l was very happy that mine came out so quickly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JyQ3O3a8Y6Lc5N-wXY_xew",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. All that Philly cheesesteak goodness!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JyQ3O3a8Y6Lc5N-wXY_xew/o.jpg"
      },
      {
        "img_id": "US7HMxG-rJg8DqMsjAzXhA",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Their fries are ok, but I&amp;#39;m just not a fan of extra crispy fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/US7HMxG-rJg8DqMsjAzXhA/o.jpg"
      },
      {
        "img_id": "OeVs7A1asIo69aPz3t4bsA",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Philly cheesesteak.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OeVs7A1asIo69aPz3t4bsA/o.jpg"
      }
    ],
    "user_id": "8okt1nl-g2RL3ylWoqj4tA"
  },
  "CoZnuU3webKoQ54seOH0hw": {
    "date": "7/8/2018",
    "text": "Stopped in for breakfast before the 4th of July parade. This was my first time here and I was pleased to see smiles on the staff and a packed house (always a good sign!). I can't recall the name of what I ordered, but it had French toast, 2 eggs, and bacon. The eggs were cooked exactly like I ordered them and the bacon was nice and crispy. The French toast is made with Texas bread so it was really good! I ordered a side of wheat toast and it came out nice and hot. The coffee was really good and our waitress was on top of keeping our mugs full. Everything was really good and we will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88gmAPlWq8MHQ4a7WBiLHQ"
  },
  "d8grDDV83rQFzkV8mPQ1xQ": {
    "date": "4/22/2018",
    "text": "Great place for breakfast on Sunday, that we discovered was open by accident.  Reminds of a Greek owned place near where I once lived in Charlotte, The Mantis. The food was well prepared, and came out quickly, and the French Toast was traditionally prepared, the way Jenny prefers.  The cost was much more economical than that of the full service restaurant nearby with its 15 buck buffet, especially if you just want breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKnvmsOex0KS7P1ePzoRfw"
  },
  "R3TlRnuiIa87QsflGd79mA": {
    "date": "3/22/2018",
    "text": "Average diner, decent food, but nothing to write home about . Didn't care for crumbled bacon on the BLT. Most of the crumbles ended up on the plate , so ended up with a lettuce and tomatoe sandwich .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QzpSerZEkQnMZPXCph0TQQ"
  },
  "fJufmfHJ37Z3fJbqOtCv4w": {
    "date": "7/27/2018",
    "text": "Been here several times, and I've found that it can be a hit or miss. This particular time was a miss. It always pays to check a to-go order before leaving an the establishment. Unfortunately, I didn't do this - trusting that there'd be no problem. I didn't get exactly what I ordered despite paying for everything I asked for this time. I was so looking forward to the toast that comes with the breakfast. What else could I put the jelly on?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mb97zd2YED1Pe0mVd9M2nw"
  },
  "F5IzpHimxlJzu1J481u6Kw": {
    "date": "1/3/2018",
    "text": "I love the Sun Valley Cafe! I ate here for the first time a few days ago. I had a breakfast sandwich with egg, cheese and ham along with hash browns. Great service and great food. The only reason why I deducted a star was because the ham on my biscuit was hard. I took off the ham completely and it was very good. The hash browns were great, toast great and the sandwich besides the ham was good. I will return here for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dChJNCyBLEoEOYQG02R5zA"
  },
  "_jRAst0odYXCNMwv0dpNEQ": {
    "date": "7/11/2018",
    "text": "Great family restaurant, plenty of choices and the food is always hot and good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ItpboRtLOpcyjCMRE5Vf4w"
  },
  "NJGGMUn736eKgyARsgILMw": {
    "date": "8/10/2016",
    "text": "The gem of Indian Trail.    We've only been here for breakfast, and I can't imagine coming for any other meal, because its great.  We're here once a month at least.  The location has plenty of seating, has a small town atmosphere, and clean booths & bathrooms.  The staff are super friendly and will keep your coffee hot and full the entire time you are there.  All the breakfast classics are readily available.    The prices are out of this world, we get a great meal and out there door for less than $20 bucks with tip for two.   The eggs are tasty, their hashbrowns are okay.  But that Corned Beef Hash is downright delicious.  Why isn't it 5 stars.... Well...  1.  They play Fox News on the TV. 2.  One time my spoon was dirty which I didnn't see until I had already put it in my coffee 3.  The hashbrowns deluxe, were not that stellar. 4.  Did I mention Fox News?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EWqprVqPER91tM1-bb12bQ"
  },
  "_ej2qxYwzbgQA1_HWRtVdA": {
    "date": "1/22/2017",
    "text": "We have only been out here from California for 2 months. And already we feel like family at our little cafe.  The staff is very friendly, and not only are they good to the customer, they are good to each other.  The food is good.  Its very much a family environment.  My son with Autism already knows everyone, and they treat him as if they have known him all his life.  Love all you girls, and Elliot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7_OhtVKJwQW13h3YrEhxug",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Love our new little cafe I&amp;#39;m Sun Valley",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7_OhtVKJwQW13h3YrEhxug/o.jpg"
      }
    ],
    "user_id": "P8A21ziXSK8vUaDZHXi6QQ"
  },
  "9pk2ve217NO3MIwIVGimxw": {
    "date": "3/6/2018",
    "text": "I've been here a number of times since it's close to where I work. The service is always quick and efficient. I've never had a bad meal at this place. Love their fries and homemade soups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MF4k179NPHldIPVILaVYog"
  },
  "IHvD0LuxOqsn6Z-ftGnQVw": {
    "date": "4/18/2018",
    "text": "Had the barbecue sandwich , it came along with coleslaw with tasted like it had been stored in the fridge for days ! The barbecue sandwich itself was soggy and not a lot of flavor . Good service but the food isn't good at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69shVIf4wXO7tpeXYOBTtw"
  },
  "hnsWzE0X6Ebf7APX6nuUlw": {
    "date": "6/19/2017",
    "text": "We tried Sun Valley Cafe because it came highly recommended by my niece. We went on Thursday night it wasn't too busy how ever our waitress seemed to be the only one waiting tables. Took a look at the menu and while a good bit of it is standard Greek owned restaurant fair, there were a few things that looked interestingly different. I got the smothered chicken, sauteed mushrooms, Swiss cheese and gravy over mashed potatoes. Comes with 2 sides, salad with ranch and mac and cheese, it was sufficient nothing special the gravy was bland and the mac and cheese (of which I am a connoisseur) was lacking and it cost 12.99 it definitely did not taste that good. My mom got spaghetti which had a sauce that was sweet and spiced differently than any I've ever tried she did enjoy it. My dad had the flounder and calabash shrimp and was happy. My aunt got a burger, which she also liked. As I mentioned our waitress was busy so it was hard to get her attention for extra napkins and refills. Overall, it is a good place to eat, but I wouldn't go out of my way. We also got the free chicken noodle soup, it was yummy!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UTP0N0lFaguiS8aWCXFNkQ",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Spaghetti and meat sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UTP0N0lFaguiS8aWCXFNkQ/o.jpg"
      },
      {
        "img_id": "xIHIL6TRiF__TQLQ077IRg",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Hamburger and french fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xIHIL6TRiF__TQLQ077IRg/o.jpg"
      },
      {
        "img_id": "ly1RN4s-V_rSsctQA1zuJw",
        "caption": "Photo of Sun Valley Cafe - Indian Trail, NC, United States. Smothered chicken and mac and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ly1RN4s-V_rSsctQA1zuJw/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "5afguPWF098XGm7hsptt7Q": {
    "date": "2/16/2017",
    "text": "Home cooked meals?  Everything that I inquired about wasn't homemade.  Meatballs - no.  The green beans were obviously from a can.  I am sure I could point out more things if I thought about it.  The fried pickles and squash were over breaded and greasy.  The complimentary soup is a nice touch.  But seems odd when you order a bowl of chili for your meal.  Perhaps a side salad would be a more appropriate choice?  Overall he food is average, service too.    Really wish you would invest in an allergy menu.  But do like that they accommodate for kids to have mac and cheese vs French fries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgYZjDDQNWhwEoNkljs3Yw"
  }
}