{
  "ykoMhBxdZqQfeoHMl5tq_A": {
    "date": "6/21/2018",
    "text": "This was a excellent choice. My food was delivered nice and hot , and ahead of time  ! I love this place being that I'm a vegetarian they have excellent choice of veggies that are delish! Will be ordering again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yrk1KsL9I3vuQCyIVE_M0w"
  },
  "SB3UhiwaUMHvIcXd4X0Mcg": {
    "date": "11/20/2017",
    "text": "Love the food, great atmosphere, great beer selection. I wish there were a few more options on the menu, but other than that I enjoyed it. My family and I have ate there a few times now and I have tried various things on the menu and have enjoyed each dish. I wish they had a few more barbecue sauce options for the pulled pork, It was a little bland. The chicken wings were outstanding and I was happy to see that they had blue cheese dressing, which was very tasty I must add. Standing in line waiting for your food is a little awkward, and you half to go up to the bar if you want to order a beer. They ring it up separately from the register for the food. Kind of a pain in the neck. Minus my few mentioned pet peeves, the place is outstanding and I give them 4.5 stars..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6nSGen1iDqt5r97yxEFULA"
  },
  "BVnBszG_nBdZbGm75GhImQ": {
    "date": "12/8/2017",
    "text": "The service and food here are great!! Sit at the HUGE bar or counter service for everyone else... Jade is the BEST !!!!! Great drink specials ...trivia on mondays ...cheese grits on special on wednesdays !!!! Food is so reasonably priced and I can't wait until the summer because the front open air patio will be jumpin !!!! great vegetarian options too!!! Located in the heart of plaza midwood park eat and enjoy the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3XloxZ4lQZYoWavXwCjUYQ"
  },
  "XiB3GFVUqOsPYTBcFMrVrA": {
    "date": "1/2/2018",
    "text": "Just went there the other day for the first time, and thought it was pretty good! Also-they have retractable doors right near the bar-it will be a fun local place to hangout and grab a drink with friends once things warm up:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lL0wdTowBmM2GE5FxLnlwg"
  },
  "2Nxm5HgLrF2fhdiFWr8Rtw": {
    "date": "11/14/2017",
    "text": "Tried out the new location today.  The place is convenient and parking is ample compared to the Montford Dr location.  The interior is light with plenty of seating in dining area and at the bar.   I was happy with the quick but helpful service and waited no more than 5 minutes for my buffalo chicken sandwich and side of black eyed peas.  Glad to have Roco in the neighborhood!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pkYS36cj29VHSKoVwVqLgg"
  },
  "uyB5hxUt-fwiPK89EfkCAg": {
    "date": "11/26/2017",
    "text": "Service industry, please keep reading if you want to know how to earn a 1.85$ tip on24$ bill.  Went in for lunch, sat at bar. The lady was rushing the entire time which was off-putting as the place was not crowded at all. Me and my compadre ordered a chicken meals w a side salad. We do not like tomatoes or cucumbers... apparently this is a vital sin at roasting company in plaza midwood while the woman is bartending. After we ordered our food i went to the restroom to wash my hands, on the way out i heard the waitress/bartender bitching about us bc of the way we ordered our salads to the cooks who looked like they didnt give a shit about the trivial order. She proceeded to demean both of us to them as i stood right behind her listening to every word. I did not walk out as I maybe should have... on to the food... chicken and rice was sooooo watery that it slid around on the plate. It was not good. Maybe the food was good but the awkwardness of eating after hearing shit talked about us was too much to bear. As a former restaurant person of many years i get that people can be a holes etc, we were not that at all i promise... i get that workers deal w sht heads and may talk-smack on customers but just dont get caught and when its over salads w out cux and tomatoes chill the f out bc its not a big deal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5FVE4CZVd4mSoG7C4BalQ"
  },
  "DGtBgCt5g3xH3ut5fA0zBA": {
    "date": "11/3/2017",
    "text": "Still working the kinks out.  I went for the first time to this location after years of going to the one on Montford.  I called in and to my surprise it wasn't ready when I got there 25 minutes later.  Not to mention my order want even started.  When I did get my order it wasn't correct.  Hopefully they get their act together because it's a great space.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzR9CUTT22GbAGMAAl8cXQ"
  },
  "moHTmqBBNUZJEmWC9jyC1w": {
    "date": "3/24/2018",
    "text": "Normally like the chicken queso on rice.  Today's was runny cheese on rice.  Get it together please.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFH4COSFCr0k8CfCGbr0Gg"
  },
  "BGLsLFdbgLpXYZPrtSl5kA": {
    "date": "3/12/2019",
    "text": "This place is a catastrophe ! Honestly people, save your money and your appetite to any other place in charlotte ! Literally anything else. So the food was bad, bland chicken and bad sauce. But where it got unacceptable was when I attempted to approach a waitress to ask for something. I timidely asked her if she worked there as she wouldn't acknowledge me, to which she responded in the rudest manner. It was so rude I couldn't believe that person worked in the service industry. So bottom line bad place",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWaT6Yc9mXqDzMK96uy9vw"
  },
  "5xJHJ6nVrapd-ywAkYxstg": {
    "date": "12/7/2017",
    "text": "Great beer selection, amazing pot pie (on Wednesdays) and sides, plus plenty of seating and a cool patio area for when it's warm out. Pro tip: sit at the bar and ya get full service. Also the hot honey (I think?) sauce is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-5Q56Z3K0ZpaDStmOPCt5g"
  },
  "UKXqUfdTQhPCbKGWeF4Akg": {
    "date": "11/10/2017",
    "text": "Got a chance to grab to-go lunch today while on a random day off. I tried calling an order into Three Amigos but they didn't answer. Then...I remembered we have a RoCo. Plus, they fixed the entrance to that lot so you don't have to jump a curb to get in there! My car thanks them.  We walked past the room with the TVs, past the nice full bar and straight to the back corner for the to-go area. No wait which was great because it got busy after we arrived. I got the Monterrey chicken wrap. My husband, the quarter rotisserie with side of the day (Friday) of stewed okra and tomatoes as well as green beans. It came with a corn muffin. Mine was massive and was more like a burrito, I thought. It's too big too hold so had to knife it. Good though. I was not expecting it to be served warm. I got the white beans which were great and I could tell they were cooked from scratch. I'm Excited about the selection of sides they offer.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fXPwu_pvEAQHfY_G8eW4vg"
  },
  "xCjojY84cG-BLo5J0guB3Q": {
    "date": "2/11/2018",
    "text": "Our family visited this place for the first time yesterday, and I was completely underwhelmed. First the experience, then the food.  You order at the counter, then stand around waiting for your food. This part of my experience was the most infuriating. As I said, we visited with family, so we were hoping to spend some time together. This was impossible because at least one person must stand up front the entire time waiting for everybody's order, while the rest of the group can visit with one another. So there I stood for a solid ten minutes, getting hungrier and more irritated with every passing minute. Finally the food starts to arrive at the pass, and, unless you have 4 hands, be prepared to make several trips back and forth from the table to the counter. I don't understand why they can't supply their customers with trays to simplify this process. Also, when you're paying they request a tip, but they do absolutely nothing to earn a tip! Do you tip the people working at Mcdonalds? RoCo needs to do something more like Viva Chicken where you get a number, find a seat, and an employee brings you the food. However Viva Chicken doesn't even ask for a tip.  Next the food. I ordered a quarter dark with squash casserole and spicy mac and cheese. I'm fairly certain I received the absolute tiniest piece of chicken imaginable. Look at my picture! That's about a bite and a half of chicken! I saw a kids plate with more chicken! The squash casserole was extremely mushy and could have been eaten with a straw, but it tasted good I guess. I did enjoy the macaroni though, so not all was lost.   I also feel like I should mention I noticed an employee in the kitchen load up a long rotisserie rod with raw chicken, then rest one end on the floor while waiting. I'm sure the oven gets hot enough to kill anything, but still...  Overall, I give the Roasting Company 2 stars for non-existent service and child-size portions.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EUkKlOA80sFM1qDjXBt-0Q",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Worlds tiniest piece of chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EUkKlOA80sFM1qDjXBt-0Q/o.jpg"
      }
    ],
    "user_id": "9x3RVQoYnJhHCRZZ_jShBA"
  },
  "1O2gDCx46rIL8tLpyRH9HA": {
    "date": "10/7/2018",
    "text": "Place seems to be going down... Food is fine, but the restaurant is dirty. I asked an employee if she would clean a booth (they were all dirty), and she appeared put out. If fact, she never did clean one for us.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDGLOquhPYIdhueTWzZagQ"
  },
  "McWqiWOgIfppOQMyyTwdOw": {
    "date": "3/22/2018",
    "text": "I ate here for the first time tonight for dinner. I sat at the bar with 2 friends and although I personally don't choose the bar for dinner it was a great experience. To start, we ordered margaritas. I give the margaritas a 5/5 (highly recommend). For dinner I ordered chicken on rice con queso with baked beans and squash casserole. I enjoyed everything but the squash casserole. It's possible that I'm not into squash casserole. The meal with 2 sides was only $10. For the option of macaroni I would pay $12. Please please add Mac n cheese to the menu  I got a to go plate for my husband with collard greens and baked beans. We will be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MnErzygbneRWOXCxeu6Ssg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Chicken on rice con queso with baked beans and squash casserole",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MnErzygbneRWOXCxeu6Ssg/o.jpg"
      }
    ],
    "user_id": "ao68ZZmvptrFArYPiYQKKQ"
  },
  "S-6e3fotOvQF2DRkbg-Bag": {
    "date": "1/2/2018",
    "text": "Awesome... awesome..... awesome!  Fantastic chicken, great sides!   The food is awesome and fast.  Lots of great local beers on tap!  It's even open late!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cv3hfMYPTmSU9KRhDqpVvA"
  },
  "8nBhPPv2B2xj0QreBaNytQ": {
    "date": "7/18/2018",
    "text": "Roasting Company never lets us down it's a local favorite! I go so much I get points through their rewards system. The chicken is super tasty but I honestly love their sides the most. My fave sides are the mash sweet potatoes and the grilled veggies! Sometimes I get those late night cravings and their wings always hit the spot!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "McOtQXcQ3c4iWkELLra8Eg"
  },
  "7kXScXw3V-h8vac5Jnjxqw": {
    "date": "7/28/2018",
    "text": "First time here and i must say WTF!!! WTF have i stumbled upon  OMG im in love. You definently get what you pay for here. 2 meals for the price of one. & the different sides are amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G_39TB_pR_8UIKUjifwZg"
  },
  "HSfmaYnN98YwTU5Ypyn9Ag": {
    "date": "11/12/2017",
    "text": "Wonderful food with plenty of options. Ample parking. New Central location doesn't disappoint. Friendly bar service. Seriously love this place. Great place to bring anyone with ability to impress while keeping it low key. Tables inside or sit at the bar and watch football. There's also an outside area with overhead door that opens up to parking lot. Great addition to Plaza Midwood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8ikbhUjvk-pqKMpmP-nYCw",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8ikbhUjvk-pqKMpmP-nYCw/o.jpg"
      },
      {
        "img_id": "D1fnOSwLIYRU38Z0Iqvt2Q",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D1fnOSwLIYRU38Z0Iqvt2Q/o.jpg"
      },
      {
        "img_id": "eBrsRHPHsjhddTB_TBltRA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eBrsRHPHsjhddTB_TBltRA/o.jpg"
      }
    ],
    "user_id": "o2kCgVbI9SbUbXzFfF6Bgw"
  },
  "7d4ZWqLJVCTTMGq2IBiZeA": {
    "date": "6/7/2018",
    "text": "The beer selection...The majority is IPA. Like the majority of local restuarants, the only amber is omb copper. The food is like a cafeteria. The staff though is great. Just not enough interest to go back. If only they balanced the beer options, I'd come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FabyhHrPQ9uUGcu7aucZeg"
  },
  "gH4S4gZB6U95P4W9rO8ecg": {
    "date": "12/4/2017",
    "text": "The good: Friendly staff, nice decor and great beer selection.  The bad: the food reminded me of what you would expect from a southern buffet, not completely terrible, but nothing special either.   The bottom line is that I won't be back, because I can cook better than this at home.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGSOp0eiBJc-xCYvo4zPYw"
  },
  "UWJbmUvUBp6dz75U0erMwQ": {
    "date": "6/3/2018",
    "text": "Pretty rude service...  in an empty store, with no other customers, waited a few minutes while the cashiers cashed out their drawers... after a few more minutes passed asked if I could just tell the cook my order while I waited to pay... cashier then mumbled to her colleague \"can't even wait 5 minutes to order.\"  Having worked service industry, this was just inappropriate.  Wished everyone a nice day and departed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjdH7yuVc6iIAvtC6SxUKA"
  },
  "FShC7QeNpKEPO6979pdAdw": {
    "date": "4/11/2018",
    "text": "Chicken is awesomely tender, beer selection is stellar but you come here for the sides. The squash casserole and smoke cheese pasta salad are a revelation. No leftovers tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2vrPT01GWLI40LAAs7j0Q"
  },
  "RM33qsERzFPa73eh0tRmUg": {
    "date": "5/8/2018",
    "text": "This restaurant has Cuban Chicken. I had their chicken wrap last night with sweet potato fries and it was quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AoExeguzeYu5v-m_BI7Zsw"
  },
  "g8kss93378_wjUSlsNBHcw": {
    "date": "8/17/2018",
    "text": "I hate writing negative reviews but this was awful. If you've seen the video of that terrible chef saying \"mmmm, so tastie, mmmm, mmmm\" I'm pretty sure he's running the kitchen. Bland rice with flavorless chicken absolutely swimming in what I will call a 50/50 mix of soy sauce and teriyaki they call Roco sauce I believe. I would expect better from a Golden Corral buffet. But maybe the other items on the menu are better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJmpPHDGrUY17G8ocfz8fw"
  },
  "JlhubihYtztHUrPrquhX7w": {
    "date": "1/11/2018",
    "text": "Loved everything but the food. I really enjoyed the space, the bar, the look, the option to order at a counter and have the food brought to you. But the food itself was good but not great. Actually, the chicken was excellent but the sides seemed like they were doctored up canned goods. I would go back meet friends for drinks and an appetizer. But not for a meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f0BqE4QXPIgTVA4Rxro8gg"
  },
  "dNY7FvjWoqWcqaJRknFszg": {
    "date": "12/1/2017",
    "text": "So happy to have roasting company in Plaza Midwood since we move to this side of town. Cheap, quick, and open late!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HDFiWwi2mdZB1CtGKDzlg"
  },
  "Kt_6VDNky3aGpUuUk5Qetg": {
    "date": "12/10/2017",
    "text": "Yesterday was my first time at RoCo and I now understand why people love it so much! The restaurant is in a great location, there's an awesome indoor/outdoor space and the staff is exactly what you hope for when visiting this type of place. Jade was our bartender, she made an awesome cocktail (I recommend the one with kombucha) and was super helpful when it was time to order. I ordered the chicken and rice con queso with a side of collards. Overall the food was good, we did send back the collards because they were bitter and overcooked but everything else was yummy and very reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iuvtJ0wRvOU8E-vUxR4AeA"
  },
  "MjczyFiZTnpp_PSq0HTVtw": {
    "date": "3/9/2019",
    "text": "In previous experiences I have enjoyed RoCo but recently I got an order to-go and it was mediocre at BEST. We were disappointed in the wings and side of Mac n cheese. The wings were pretty good size but had almost no sauce on them. The \"side\" of Mac n cheese for $2.50 was in a small ramiken(we thought it was the ranch for our wings) and was not even filled up all the way.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7Ak4teNBSD-_-5JxW1gyw"
  },
  "0Rr1zR5heZxrPRkCMB8mXQ": {
    "date": "12/14/2017",
    "text": "As a vegetarian, I was pleasantly blown away by my recent visit to the Roasting Company! I thought I'd walk in after my yoga class just to check it out, but ended up staying for an outstanding meal considering the quality and the price point.  A three veggie plate + cornbread is only $5. That's right, FIVE DOLLARS. I can't remember the last time I got a meal in Charlotte for $5. My most recent trip to Bojangles cost more than that.  And guys, the food was GOOD. Mashed sweet potatoes were on point, not overly sweet and greasy like some diners in town. They also had a white bean stew on special which had really good flavor and warmed me up on a cold day. The King of the Plate though was definitely the cornbread - I'd just eat a plate of that for lunch if they let me.  Really impressed that a restaurant called \"Roasting Company\" had so many great vegetarian options. Additional shoutout for being gluten-aware and offering lots of gluten-free options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9hh1M-3aDJZVTwwYYy9AnA"
  },
  "lyErgqERtr5UVl_edswknA": {
    "date": "1/1/2018",
    "text": "Great roast chicken & sweet potatoes plate! The RoCo standard food is delicious and reasonably priced. The new location is comfortable and nice decorations and lots of good local brews. The location is in the middle of plaza.  It's easy to imagine the outside in summer being a fun hangout. I like the food and the relaxing vibe. Parking is in the lot and easy to find in plaza, not typical.  Good chicken dinner for everyone!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "uTnu4LjPZtRpU8xVClUT7w": {
    "date": "12/19/2017",
    "text": "Came here for a late lunch. We got a seat at the bar (full service here). I just had a water and I ordered a sides platter - rice, stir fry vegetables, salad and it came with corn bread. Everything tasted pretty good, and fresh. The only problem I had was with the dressing. I ordered Italian but it just tasted liked oil.  The service is alright. The gentleman taking our order was new (he told us) so he did not know the answers to a couple of our questions. This is still a pretty new spot and I'm sure I'll be back in a couple weeks to try it out again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6wqZwWnXt1l-NInReBufA"
  },
  "SyYHuff1qBkW8HCMvNmAAw": {
    "date": "7/9/2018",
    "text": "Good food, but I was really disappointed in my takeout order I ordered through Uber Eats last week.  I ordered the chicken con rice with the smoked pasta salad and squash casserole as sides. Everything was yummy, but I was absolutely horrified by how tiny the portion of chicken and rice was. I've looked at pictures of the entree on Yelp and Instagram and it was nowhere near the usual portion. It barely had a few spoons of chicken and rice in half of the takeout box. The sides were on the other half of the box.  I'm kicking myself for forgetting to take a picture! I completely forgot about it until after the tiny entree was gone. I'm hoping what happened with my order is not the norm because there's no way people would continue to order that entree to go. I'll order elsewhere next time and actually get the value for what I paid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9yh8Qv8MR2ajONGavj6FdQ"
  },
  "7-FriAhOWfrhZ_Ek1NEM7w": {
    "date": "11/15/2018",
    "text": "Excellent food I am so glad they open this location near where I live. Specials are out of site too. The pot pie in the chicken and dumplings especially.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nJ_v5mpPZvjhmpJcTXXs6Q"
  },
  "QbLpaViWHWaBT4Ycc8pMbw": {
    "date": "3/30/2018",
    "text": "Dined here for the first time last night. Sat at the bar (which is fully stocked, several beers on tap, even had wine on tap). Thursday they have 1/2 priced bottles. So we did the right thing and got a bottle.   Atmosphere- reminds me of a bar, ya know cause it is one. TV's, wood, ppl laughing and drinking. Very clean, very casual, very perfect for a low key laid back evening. THey have indoor tables, the bar I mentioned earlier and outdoor/indoor seating.  Food - so RoCo is everything I thought Coaltranes was gonna be. The name Coaltrane makes me think of Jazz (John Coltrane, American saxophonist) but it's really like Viva Chicken but Mediterranean. This place is like a low key soul-food spot except all the chicken is roasted (hence the name). The FOOD IS DELish!! So I got a 1/4 (chicken) plate comes with 2 sides I got the squash casserole and the collards. It also comes with cornbread wait for it... with real corn in it! My friend got the rice plate which is essentially the same thing but with an extra side of rice (she works out so - carb it up). The food came quickly and it was hot. I was impressed with the seasoning on the collards - really good. I'm from SC and know how these should be made and they did not disappoint.  Price- this place is very affordable-our total bill including a nice tip (and the aforementioned bottle of wine) was like $45 bucks.  How to order - If you aren't sitting at the bar, walk to the back and go to the counter under the sign where is reads RoCo in big letters, like at Panera Bread, order your food and seat yourself and your food will be brought to you.  If you are at the bar it's full service (food and drink orders). Not sure how the indoor/outdoor space works. I'll sit there next time.   Would for sure come back ya know cause I like chicken and it was good!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nb8Ke-lKoPmJS7Gh-4T_jg"
  },
  "lhFNZoV63njUXa75eCXRdQ": {
    "date": "11/29/2017",
    "text": "You guys know they have a new location on Eastway and the plaza. more space and still the same good food. I love the smoke gouda pasta and the rotisserie chicken. they tell me chicken pot pie day is the busiest because they are so good and the pie is huge. all the side items are good especially the squash casserole.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KDN0FBXpjkSlWFf4Sagi1Q",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Chicken and dumplings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KDN0FBXpjkSlWFf4Sagi1Q/o.jpg"
      },
      {
        "img_id": "hHNN4AhoXUBspdlkZrYI1w",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Kids meal",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hHNN4AhoXUBspdlkZrYI1w/o.jpg"
      }
    ],
    "user_id": "R4J6GaAsIR6PakJOnHNZVg"
  },
  "y1LB1D7bdpACEPTGjphB4g": {
    "date": "5/25/2018",
    "text": "Love the fresh roasted chicken for lunch or for dinner. Also the assorted sides are healthy and tasty including collard greens, white beans, squash casserole, and all sorts of good things too many to list here. Wait, I need to list that corn bread with bits of corn in it-- good stuff.  This is a True Charlotte gem. Glad they are in business and doing well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGyTeVdJhsiD5cyZ5oATjg"
  },
  "ITgRXpCVL9Sk3be5kifRRQ": {
    "date": "3/29/2018",
    "text": "The cute bartender from Boston convinced me to have a cider...I never order cider.  It was refreshing nevertheless.  The atmosphere in this sports bar/ restaurant was chill.  I'd certainly come back in here to try the food out and sit at the very expansive bar area.  They've also got some good family/group seating space for you to come and get comfortable.  There's a lot of brews available on tap; what more can you ask for?  The bartender, aside from my vane reason earlier was very friendly and nice to chat with. Everyone seemed to be a fan of her.  I liked this place; the location just kind of threw me off initially as it was located in a strip mall. Nice place nevertheless.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HBGPBZoQ3rS-mUUWaW6Ruw"
  },
  "u7k0nQHS_Xq1yQCAEb3L1A": {
    "date": "1/22/2018",
    "text": "Hit this new location today for lunch.  LOVE this new place and love the new look.   It has a Plaza Midwood feel and some character of the old structure....but looks updated and somewhat rustic.   I liked the vibe a lot.  The set up is great.  BAR in the front.   Food service and Dining in the back.   The food was just as tasty as the other location.....I believe this will be my new location to attend as the one on Montford is dingy and gross.  I love the food....but what I love most is that you dont have service staff....you take care of yourself and leave when you are done.    All in all....this new spot is great.   Give it a whirl.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "g_Q6VOqWQDE_ktlHC-LZNw"
  },
  "fYCyqZLkD88f74aNNFvwUw": {
    "date": "3/12/2018",
    "text": "So here's the deal. It's maybe 1AM, and a few friends and I coming out of EB discover that they'd opened up a roco in plaza. We were drunk and ecstatic. More ecstatic than drunk, but drunk nonetheless. I expected any subpar food that we could find to be delicious but never in a million years did I expect ROCO to let me down. It was late, and although they were serving food still, they had run out of almost everything. No 1/4 dark meat or white meat. All they had was the pulled white meat. We all ended up ordering the jacko chicken. The chicken was dry, flavorless, lukewarm, and underwhelming, and the jacko sauce was salty and overwhelming. Jacko sauce was nothing more than hoison sauce maybe mixed with soy sauce to make it more salty. It tasted gross on bland chicken. Potatos were cold. The greenbeans were ok. In my drunken stupor I'd rate it a 2 out of 10. If I were sober probably a 0 out of 10. Bartender was very nice, patient, and friendly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gGyGx-CZ8Xyz9ht8snhhLg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Chicken on rice with jacko sauce on chicken on rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gGyGx-CZ8Xyz9ht8snhhLg/o.jpg"
      }
    ],
    "user_id": "EzMbKvgxMTxNtRBlSZcBFQ"
  },
  "i7BcXVY-NDdDKrT8Ym8HHQ": {
    "date": "10/13/2018",
    "text": "Went here last night. Nothing fantastic about this place. Chicken is average and Mac and cheese is average. Service was good. Got the rotisserie chicken and it was okay.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zp71jk-vGaweyUr9XCCZ5Q"
  },
  "KfcezEK-mLAiCko5yRJcQA": {
    "date": "8/10/2018",
    "text": "I had lunch here for the first time today.  It is a very clean and nice restaurant.  The food was excellent and such a wide variety to choose from!! The staff is very friendly!!  I definitely will return next time I'm in the area!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DnnpvA8Iy8QCnSgZEweOrg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DnnpvA8Iy8QCnSgZEweOrg/o.jpg"
      }
    ],
    "user_id": "vvfdVWoB_AhvHmmjevXgEw"
  },
  "6q7Ch4I5-ECnk2FKV7Wlfg": {
    "date": "3/1/2018",
    "text": "Top notch place that falls just short of its predecessor, albeit being a brand new addition to Plaza Midwood.  Obviously this is not a negative review by any means as I am a huge fan of RoCo as they absolutely deliver quality chicken and sides at a great price, but I am hoping they work out some of the kinks at the new location.  For example, the sweet potato mash and corn bread are magnificent at the Montfort Location but they are severely lacking here for whatever reasons.  The chicken was great though and I really like the layout of the new location because it's massive, has a great bar, and even has a convertible patio for when it happens to be nice outside. Hoping to be back soon to see the improvements in some of the side dishes that I love from the original RoCo.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IMFlMJa8y5IVuXX-53nGw"
  },
  "7xTEtHABmmi3QySqPWWEnA": {
    "date": "12/17/2017",
    "text": "\"Enough liquid smoke to kill a small horse.\" I would recommend Viva Chicken...it's WAY better.  I have eaten here twice now and it just isn't very good. In fact, I would say the food kind of sucks. Here's why:  My first visit I had the chicken, beans, rice, and queso dish. It was pretty bland, not much flavor other than the basic ingredients--it felt like I was eating a bowl of cheesy beans, aka a side dish, not a meal.   The second time I had the rotisserie chicken sandwich. Luckily I got the joco sauce on the side as it was inedible. Like, enough liquid smoke to kill a small horse. The potato salad was bland as well--not enough dill and the potatoes were cut too big.    Both visits I found a tiny bone in my food. They warn about it on the menu. I don't see why it's so hard to not pull the bones off a baked chicken.   The service was not quite up to par. Took a while to refill my drink and I had to ask for it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAZfQgE3prIBgPDyilKK3A"
  },
  "Pk7TSgLAJEc6C9GdURdlcA": {
    "date": "6/3/2018",
    "text": "I was really looking forward to trying this place, but never made it past the rude service to even order.   Went in at 11:30am (they open at 11:00am) and there were 2 cashiers and another person at the register counting out the money in each register...fine, no problem. We waited patiently & after about 10 minutes, the cook came around to the front, so we asked if we could go ahead & put in our order (so that he could start) and we would pay as soon as they were finished counting out the till. The girl standing there huffs at us, rolls her eyes as she picks up a pen to take our order and mumbles \"can't you even wait 5 minutes?!\".  That was all we needed to hear...we said \"thank you...have a good day\" and walked out.  I would understand if it was before their opening time or a few minutes after...or if they simply said \"do you mind waiting another few minutes\"...but to give that sort of attitude?! No thank you!  There are plenty more options in Plaza Midwood with much friendlier service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "f6xB_rDNgSXhLtXI5yEFRg"
  },
  "Lpx-tfFLpqO8Jo7_64_XdQ": {
    "date": "2/17/2018",
    "text": "3.99 or is it 4.99 - either way you can get a very affordable vegetable plate at this spot and I for one am absolutely loving it! Most places charge about double for the same food, so why not get a filling meal for under $5? Had their collards, squash casserole, and potato salad for dinner tonight and it was pretty decent for what it was. Probably wouldn't order the squash again - tasted way too sweet or the potato salad - nothing was dill like about that said (or maybe I've spent too much time around Russians), but again for the price point I can't be too critical. Decent food for a very fair price and the ambiance is super casual and laid back. Perfect place to grab a beer with a colleague or get a quick bite with a friend. I'll have to try their chicken next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWQ4bxTnfz40cZMFCE2W-g"
  },
  "x9YI7MfHEc84ki5DuWXRDg": {
    "date": "12/19/2017",
    "text": "Been 4 times. First time, the bar and food were great. Chicken, beans, rice, sides delicious, big portions.   2nd visit, bartender was very rude and treated us poorly. Actually, the manager was awesome about it and he got us to come in 3rd time.   3rd time, food was good... But not great. Pork, rice, pasta salad (yum). It is all, however, just a bit bland (this coming from someone who hates added salt).   4th time, last straw... You lost me. Come to dinner at 630pm. Out of Buffalo chicken sandwich special. How in the world does that happen? I wound up finishing my beer and heading to kickstand to get a real, live, Buffalo chicken in the wild.   It's 50/50 at this point. I am, unfortunately, out. Too many other consistent spots.  I know management cares, but consistency is a BIG problem.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WuPybEM4dy2FEBCTzlufdw"
  },
  "n-Ahn3hD-ryvae57dJDgdA": {
    "date": "2/10/2018",
    "text": "I got the three veggie plate and their squash casserole is the best around.  I also got their Cole slaw and stir fry veggies which was good.  Their cornbread is something I always look forward to.  This is the second time I got their veggie plate and it didn't disappoint.  Next time, I will be trying one of their salads which I saw from someone next to me was a really good portion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hTjUo_DmadNEHfCVHJ-R6Q"
  },
  "YAxEk3JXmcpCdNltbbTtMA": {
    "date": "5/24/2019",
    "text": "Eat here today and the Rotisserie Chicken was really good, I especially loved the sauce...also great  atmosphere will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "273-f2PQxNpjWeRVvtkM-g"
  },
  "GB-uVqzPXwZJ9FdKnwN6PA": {
    "date": "12/31/2017",
    "text": "One star deduction for super strange layout. This place has a full bar that takes up most of the place but they also have a window you can go order at. Just feels a bit confusing to be sit down and order OR come to a window and order.   One star deduction for bland food! I got the chicken, beans and rice dish that has the speciality bbq sauce over it and it was just plain awful. I couldn't even eat it. I did like my side of pasta salad and that was the only thing I ate. The menu is a bit strange, almost has a Mexican feel to it with queso on many dishes also has a Southern feel with the veggies and plain chicken. I think they need to get a bit more focused on the menu and the concept.   One star deduction for the sauce bar being a mess and most of the salsa being empty. The staff member was even over there didn't refill them or anything.   I won't be going back here unless it is for drinks because it has potential to be a pretty cool local neighborhood bar.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6TgpS-zoPxu5anv2Nd63hw",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6TgpS-zoPxu5anv2Nd63hw/o.jpg"
      }
    ],
    "user_id": "uy4oHzC_4zqEAn95Kv27Ag"
  },
  "yP5sM22veVdJyma_sHvUxA": {
    "date": "1/29/2018",
    "text": "Food:I visited The Roasting Company for lunch.I ordered the bbq meatloaf with a side of collard greens accompanied by cornbread. The meatloaf was seasoned well and tasted great.It was a huge portion too.I was told the collards were popular but I didn't favor them that much.Not sure if I had a bad batch but it didn't meet my expectations.The cornbread was tasty as it had corn pieces in it and a little sweet.  Service:The gentleman at the counter was very friendly and welcoming.I definitely felt appreciated as a customer.  Time for food:It took 4 mins maximum after placing my order to receive my food.That is awesome!  Setting:The restaurant is spacious and has an ample amount of seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "58-Te0QjvGtx8GayS9OCWA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/58-Te0QjvGtx8GayS9OCWA/o.jpg"
      }
    ],
    "user_id": "sgqj8Nvg43iv-l8-MlC01A"
  },
  "_WSaBCGOj10fUzr9K_PA4A": {
    "date": "10/30/2017",
    "text": "Was lucky enough to hear about the friends and family soft opening at the new Plaza Midwood location of Roasting Company. I've been a loyal patron and huge fan of the Montford location for years, so I've been anxiously awaiting this location's opening since it's been announced.   The interior buildout of this space is impressive.  The centerpiece and spotlight is the huge bar that is set up front and center with plenty of space for people to pop in and grab a bite, or hang out for a few casual drinks. Seriously one of the most impressive bar spaces in Plaza. There is a room directly in the front of the restaurant that has roll up garage doors and will be a perfect place to eat lunch on a warm Charlotte day.   The food tasted 100% consistent to the deliciousness we all know and love. The kitchen was absolutely on top of it, and our food came out quick and hot.   I can't begin to express how excited I am for this location's opening, and will be here more often than I'm willing to admit on a public forum.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 14,
      "cool": 12
    },
    "photos": [],
    "user_id": "_pOEDJODvaBQwr_KMdG0LQ"
  },
  "CQN-XqnUEqN-Gg-2QPazaA": {
    "date": "4/20/2018",
    "text": "This is my favorite chicken place in Charlotte. They have so many options. It is like a chic southern twist! I love the chicken and cheese and my boyfriend had just the chicken and rice and it was amazing too. The dill potato salad and greens are to die for!!! I can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "m--AepE61DPI09J1E6jOQg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Talk about amazing!! I got the chicken and rice with queso. I got the greens and dill potato salad. Everything is fresh to order.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/m--AepE61DPI09J1E6jOQg/o.jpg"
      }
    ],
    "user_id": "avkCj6jnszCk1pe1XlTDHQ"
  },
  "0Y36GymczS6w0KpLxQ4dHg": {
    "date": "4/15/2019",
    "text": "The past few experiences have all been very consistent. Very happy with the food and service, so giving back the fifth star!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHYGF92lvCy-6PPFuGLzNw"
  },
  "VxlZ5ZgsFc0LjeNJqMKi5w": {
    "date": "10/30/2018",
    "text": "Stopped in for a Saturday night recovery meal at 1:15am - we walked in the front door and could not believe the mess everywhere!  hardly any tables had been bussed - all you could see were dirty tables, I don't know if there was even one table that was clean in the front of the place.  My date and I looked at each other with the same thought - no way are we eating here.  We promptly turned around and left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8HPA-jU1njsPPAI_anMgA"
  },
  "E4GApLUgKZREskjySQBYHQ": {
    "date": "9/8/2018",
    "text": "Omg just wow.  What's an experience I had here!   First off I sat around for about 10 minutes before I made a phone call to the restaurant to figure out how I was supposed to get service.  **Please note either you can order from the back and seat yourself or full service at the bar.**  LOL.  After I spoke with the gentleman at the bar he did explain how things went which was nice.   The food was just blah. Tasteless. Affordable but not even worth it.   My buddy ordered some kind of side dish that came out completely burnt we had to return it.   And while I waited to return it at the cash register, in the back I can see someone in an office vaping! I also caught some of the workers in the back eating food but no attention to me whatsoever.  It took a minute.  What a slow response and noticed there was barely any attention towards the customers.  Won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4l3ONHzGBakKKNo4TN9iQ"
  },
  "4phcgbb_2zKmQjxta3rmMg": {
    "date": "5/14/2018",
    "text": "Same great RoCo, new location.   My wife and I popped in here with our dog late on a Monday night after we were still starving from a sub par experience at the peculiar rabbit. The new space is certainly neat with a covered outdoor area that is dog friendly, a huge bar inside, and surprising expansive seating considering the location. We were able to grab some of our favorites (rice chicken and beans with Tico sauce, squash casserole, red oak drafts) with huge portions at a decent price. The big upside of this place is they are open super late even on a Monday when most everything else is shut down.   Overall, great job with the new space and I'm glad to know I can grab some of my favorite comfort food when I'm on the other side of town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "rRqjRGDSFAwvz7JHzdH6mQ": {
    "date": "3/21/2018",
    "text": "I frequent Charlotte quite a bit and was tipped off about The Roasting Company from a picture I saw on \"Charlotte Agenda's\" Instagram.   There a 2 locations in Charlotte one in Montford the other off Central Ave. we opted for Central Ave.   The restaurant is a cool trendy spot with outdoor/ indoor seating area as soon as you walk up. And a massive exposed brick wall lining the inside. You walk up to the counter to order and then seat yourself or you can sit at the bar which is full service.   Now onto the food! The food was amazing and the portion sizes were hefty! The sides were all amazing (I tried 4). The smoked cheese pasta salad was hands-down the best side by far!  This spot I would def recommend to anyone that lives in the Charlotte area or even anyone visiting!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "voqkzVQ5JJE8bfzR4UAHVQ",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Chicken and Black bean Combo Con Queso - rice topped with chicken, black beans and queso",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/voqkzVQ5JJE8bfzR4UAHVQ/o.jpg"
      }
    ],
    "user_id": "3IGq1HZyzWlzfH_TSNFIZg"
  },
  "IMklUx9AjK8FaHTey3TwwQ": {
    "date": "2/11/2018",
    "text": "This visit I had a 1/4 white meat roasted chicken, collard greens, and squash casserole. I believe every dish comes also with a little bit of cornbread. The cornbread was good, not to sweet and had actually little pieces of corn in it for texture I suppose.  The greens were okay, a little bland. The squash casserole was my favorite, but I love squash so.....   The chicken, for me, lacked a little flavor. I noticed there was a sauce/salsa station in the back where you could add your own  to your chicken. I was not really interested in this idea. I would have rather had the chicken seasoned before or during the roasting process.   Overall my meal was not bad, I received A LOT of food for under $15. I took the rest to lunch with me the next day.  This location is nice as well, they have a patio area in the front and lots of space inside. Clean restrooms.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "nI4GqtJC0QfJAf77F39qRA": {
    "date": "4/4/2018",
    "text": "I had high hopes for this restaurant as people rave about it, but I've been twice since it opened and I'm still just not that impressed.   The first time I went with a girl friend we both got roast chicken meals, I ordered potato salad and green beans. The green beans were cold, mushy, and tasteless - they were missing seasoning.   The chicken wasn't very memorable.   The second time I went with my husband on their grand opening weekend. They were offering discounted entrees and commemorative cups. We each ordered white chicken meals. I did not make the mistake of getting green beans again, however I was still not impressed.   They look to have a nice bar set up, I might come back for that.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hr3iSHRh59DhFX8dn_UReg"
  },
  "2A7kBgB6wDhJVfcRedL8aA": {
    "date": "4/18/2019",
    "text": "I have never had a meal I did not enjoy here. This is a fast casual restaurant not El Bulli. All this stuff is better than most if the nonsense convenience foods you think are good. Y'all need to chill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q6hFLAzKDmg1N5Dw1LvuiA"
  },
  "5BjRWMaW0myuvy-Z-rKEWg": {
    "date": "2/6/2018",
    "text": "I assume RoCo and Coal Trane's didn't discuss their rotisserie chicken plans with each other before opening.  Similar business plans within view of each other.  It's RoCo.  It doesn't feel quite like the Montford one.  I hate to say it, but its \"too clean\"?  I don't know it feels pushed, doesn't have that dive'ish hometown feel.  Beer selection ain't all that for my taste either.  That said, I was pretty sober when I went.  I'm pretty sure the first time I go in there at 1am with a buzz I'll come back and fix this to a 5 star rating.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "1xifqd2S3beXtmbzkgwYkw": {
    "date": "6/8/2019",
    "text": "I've ordered here several times due to the convenience of the location. This pat time I ordered a pulled pork sandwich. The pulled pork was extremely dry and the Jaco sauce was horrible (I.e., extremely acidic and not like a sauce you would want to eat with anything). I will never order from here again nor would I recommend to anyone. There are plenary of other places you can spend your money in Plaza; don't waste it on this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IT-oJRvT2TtV0aYU56TlRA"
  },
  "BsbZT3IhjVQApI9FeTY3Xw": {
    "date": "6/10/2019",
    "text": "Went here because it had one of the highest health scores in the area. Plus southern comfort was a draw. They did not disappoint.  Reasonably priced, this was one of the best chicken and collard greens i ever had.  Cannot wait to try the other menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zioz9lg1SAfymwVo1KQUPg"
  },
  "B8KQNLRBRK_-8Fz9u_HWkA": {
    "date": "9/20/2018",
    "text": "I live down Central Ave, so I'm always in the area. Thought I'd give this place a chance. The bar, is probably the one thing that's good here. I got the most popular plate on the menu... \"Chicken and Black Bean Combo with Queso\" yet to find out it was the worse one. Missing salt and the food was a bit cold. Not going back anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "InULISiPjpGex09MKaliHg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. The most popular plate in the menu... but didn&amp;#39;t convince me at all. Not what I expected",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/InULISiPjpGex09MKaliHg/o.jpg"
      }
    ],
    "user_id": "rckfevIXbKxS-xaUqjntWQ"
  },
  "9h6lUYnHP7HprejHHXgfOw": {
    "date": "7/11/2018",
    "text": "This was my first time here. My friend and I can in later on a week day. I ordered the chicken con queso with green beans. Queso on the side. The chicken came over rice. The fudge was delicious. The chicken was tender and had a good flavor. The green beans were ok but I would probably get another side next time. The queso was so good but a bit spicy. I still really enjoyed it and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EiTSNF-gTJYdCq1tXb-X1Q",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EiTSNF-gTJYdCq1tXb-X1Q/o.jpg"
      }
    ],
    "user_id": "i75A7Oq1UTU6j8Mus5MO6w"
  },
  "9eJvsY3XuIuK_lDQwDUwcQ": {
    "date": "11/29/2017",
    "text": "With a chicken as their logo, RoCo didn't seem like it would a great spot for a vegetarian. However, I was thrilled to discover their MANY veggie sides which make for a great lunch. And the prices are UNREAL. You can get three sides with a piece of cornbread for ~$5. That's incredible! It's such a perfect lunch spot for the Plaza crowd. The staff is friendly and will walk you through the menu if you're unfamiliar. The restaurant itself is enormous and there's tons of space, including a large bar. It will be interesting to see what kind of evening crowd this pulls! I think this is going to become a Plaza staple.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8fSuI8CXWOYZfgfm4QshQ"
  },
  "sQJbVwgCWpYbxS5BcR2DfA": {
    "date": "7/3/2018",
    "text": "I ordered the Chicken Con Queso With Rice and the squash casserole as my one side. The food was delicious. I came on a Tuesday night so the atmosphere was really laid back and chill. My food came out rather quickly. I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yblzco3GLq0XHSi1jIjNQg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Yblzco3GLq0XHSi1jIjNQg/o.jpg"
      }
    ],
    "user_id": "zPbRtfcL18XBXSAJfXbV1A"
  },
  "xg8Cbdw4YrpGU6x1BBwZrA": {
    "date": "7/30/2019",
    "text": "The food pretty good but daaammmnnn that breakfast burrito is bangin! Service has always been great-drinks are always made on point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQ2w3yMEYxcspPrZLKObVw"
  },
  "U3tUN5e70EOClspUTyrZRA": {
    "date": "5/20/2019",
    "text": "I went here for music bingo night. The atmosphere was really cool. I enjoyed playing bingo & the food was good.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "hzGzGlltkYiSMkOw-Kw6DQ",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hzGzGlltkYiSMkOw-Kw6DQ/o.jpg"
      }
    ],
    "user_id": "b2UBm3O-sa8rUGwiwmpqTg"
  },
  "NiZaBXaiTq2Q4LFdM63Byg": {
    "date": "7/23/2019",
    "text": "I ordered through postmates and the food was amazing. Super satisfying and big portions. Definitely will eat here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DJFjX43KoKHXQKubyzVDDw"
  },
  "bG3DCBzzlVOko3BVjNeY6A": {
    "date": "2/24/2019",
    "text": "The chicken tastes fresh but wasn't overly impressed by the flavor. Same for the side dishes, the apples I expected to be a bit sweeter as they were on the bitter side. The greens were just okay as well. I wouldn't rush to come back but would come back to join friends. Maybe I need to try other sides",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QTD1pZP7QANhlgxcN4xbbg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. 1/4 chicken, greens and baked apples",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QTD1pZP7QANhlgxcN4xbbg/o.jpg"
      }
    ],
    "user_id": "cqxVwrGvrMwiDX8BNYsSyQ"
  },
  "nw7qcZ_yZv5n0YSQ1gyKDg": {
    "date": "7/28/2019",
    "text": "Your main bartender was drunk. Threw menus around looked like shit I didn't even order. I walked out. I won't even bother to order if the first person you see looks like they're coming off a Xanax high.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HNB3GfEHMyi8VuaBdAjMGg"
  },
  "duEZ6K3q3h5UWi3wj9Y-uQ": {
    "date": "4/11/2019",
    "text": "Best chicken pot pie EVER. Oh my gosh enough for 2-3 meals. Absolutely delicious. Wish they made this a regular item so I can have it more often easily!! It sells out before dinner too!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ATKI810cBBkSOCE1feVzOA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ATKI810cBBkSOCE1feVzOA/o.jpg"
      }
    ],
    "user_id": "LruRPzJ1nOS3_04LV1HAUA"
  },
  "sxlpFdeIduY61HnuNmMBwA": {
    "date": "5/24/2018",
    "text": "(go with 2.5 stars)   RoCo is officially a no-go for me.  It's located in the shopping strip off Central Ave that contains Bistro la bon. They boast an open, covered front patio and a spacious interior that includes a wraparound bar.  When you walk in, you are given the option to order at the back cashier or at the bar. Once you order, you can take your seat anywhere, however, make sure you stay pretty close so you can hear your name being called once your order is ready. If you order at the bar, the bartender will typically bring your food to you.  On a recent Tuesday evening, I popped in before a meeting excited to try their Tuesday special: the buffalo chicken sandwich. The chicken was fried hard and dry. Cue my immediate disappointment. The bread is/was not sturdy enough to sustain the large chicken patty. They should consider potato buns instead. I ended up taking the chicken off the bread and just dipping it in sauce I asked for on the side. I decided to try the garlicky new potatoes as my side and I'm so sorry that I did. They tasted as if they'd been sitting out all day and were served in a soupy like consistency of garlic sauce. Not appealing to the eyes nor stomach.  During my first visit, I tried their roast chicken and I have found that to be their one bright spot. However, I find that there are other places that serve much better roast chicken so it's not quite good enough for me to specifically make a stop here for it. What gets me is that their sides taste no better than what you would find at a cafeteria. I've had the stir fry veggies, mashed sweet potatoes, and now the garlicky new potatoes. Every single one has been a disappointment.  When I had the stir fry veggies, the medley consisted of mostly onion. FAIL. The mashed sweet potatoes were okay but they didn't taste fresh or made in-house.  For my first visit, I ate at the bar and the bartender was very nice. My second visit, I ate on the patio since the weather was nice. After you're done eating, no need to worry about clearing the table.There are signs letting you know that someone will come to bus the tables.   Roco, I really wanted to like you more because I have had better at the Montford location.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G73bAUItgU4DvsvB0dc2Zg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Buffalo chicken sandwich with garlicky new potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G73bAUItgU4DvsvB0dc2Zg/o.jpg"
      },
      {
        "img_id": "z33MXWco35_oxj8LNcD4lg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Open and airy front patio",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z33MXWco35_oxj8LNcD4lg/o.jpg"
      },
      {
        "img_id": "NGI6tW8sgTVXVAP84gZYjQ",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Half chicken with mashed sweet potatoes and stir fry veggies with cornbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NGI6tW8sgTVXVAP84gZYjQ/o.jpg"
      }
    ],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "lXRjcG26zj4xeHNMGEc-iw": {
    "date": "12/8/2018",
    "text": "Do yourselves a favor and avoid this place like plaque. I ordered brisket sandwich and received a cold soggy open bun instead with some sauce on the side  Their rotisserie chicken is dry, cold and has no spices whatsoever. Not even salt or pepper. Safeway chicken tastes like heaven compared to this.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xxtYGJFGO9XzlAjxzBySmA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xxtYGJFGO9XzlAjxzBySmA/o.jpg"
      }
    ],
    "user_id": "Fs-a5ZFSXYaNGoLu4eKe4w"
  },
  "4sJCf-naR1QVa3RHEpBxrw": {
    "date": "11/14/2018",
    "text": "Chicken. Pot. Pie. -- Oh my!  The only thing that disheartens me about this place is that the potpie isn't available every day.  Sadly, it is a part of their daily special rotation and you can only get it on Wednesdays.  However, it is totally worth the wait!  Especially on a cold, wet, rainy Wednesday.  It warms me up just right, just as comfort food should!  Tucked in a shopping center at the edge of Plaza Midwood is where you will find The Roasting Company, AKA, RoCo.  The rotisserie style chicken is great and, if you couldn't tell from my into, I am a huge fan of the chicken potpie.  They are a quick lunch option and add to the wonderful mix of walkable options in the trendy Plaza Midwood neighborhood.  The trivia night is always a hit as well.  Check it out, even if you can't make it on a Wednesday, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZlDYPORxTpNgImmbwIn3Dw"
  },
  "UwuIEUcTaged6ZzBRXNdyQ": {
    "date": "11/20/2018",
    "text": "My wife and I swung through here on a whim last Saturday night. Overall I will say fairly priced for a generous amount of good food! I was not feeling specifically adventurous, so I went with the chicken & black bean combo con queso (love it con queso) with a side of shoestring fries. We did not wait around long before we got our food and I certainly got a \"healthy\" portion.   The entree was delicious. I'm not a huge fan of beans (it's a texture thing) but every ingredient was well proportioned so that I got the flavor of the beans but not really the texture. I was not a huge fan of the fries. They were soggier than I would have liked and reminded me of ill-prepared fries from high school.   Overall a good experience though. I definitely want to return and explore the menu (especially the sides) a little more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zdJ5RyU4nUWj8bceNxLrZg"
  },
  "BiBluVYlCNaygfFdhzlI7g": {
    "date": "10/2/2018",
    "text": "We tried this place for lunch and was not disappointed! We ordered the chicken and rice with queso, the sides were mashed sweet potato and mac n cheese. It was delicious, it also came with a small cornbread. Not sure if I'd go again though, it was more of a try it once and maybe come again if I'm craving it. There's a lot to choose from but the only thing that spoke to me was the chicken and rice. It was good and it definitely fill you up since the portions are big enough but the satisfaction was not there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G2YZC_moduKl4JnI7qPRtQ",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Chicken &amp;amp; rice w/ queso, cornbread, mashed sweet potato and mac n cheese. Jerk chicken and rice in the back. It was okay but, not the best.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G2YZC_moduKl4JnI7qPRtQ/o.jpg"
      }
    ],
    "user_id": "7h4_BoZOk9zq6Xf3sX4Jqg"
  },
  "-aCANpLsWbYBRhNz0ebT9A": {
    "date": "3/27/2018",
    "text": "This place is a hidden GEM in Plaza Midwood.  Nestled between the ABC Store and Bistro La Bon in an old strip mall, it would be easy to overlook this delightful restaurant.    The menu is similiar to other local chicken restaurants - rotisserie chicken, salads, sides, salsas, etc.  The food is very tasty and I really enjoy the rotisserie chicken salad.    But, what makes this place standout is the atmosphere.  There's a large bar in the center with beer and drink specials EVERYDAY.  There's a great indoor/outdoor patio area.  The service staff is super friendly and it's just a place that invites  you to kick back and have a few drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JLVXKA9nvX6-htAsMDHs0g",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Rotisserie chicken salad and Tico black beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JLVXKA9nvX6-htAsMDHs0g/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "qSCZw7A7Q4t-pwIqSphw0A": {
    "date": "6/27/2019",
    "text": "This is my go-to week night dinner spot! I love the vegetarian sides, they're so good! Easy spot for pick up or dine in and Frijole the chef is so nice! They also have a DJ there most nights during the week for a fun atmosphere! I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36KXlsnGvkxw3INp36vrBw"
  },
  "uZJmfDxbkTfXB5gbTwmqzg": {
    "date": "6/16/2019",
    "text": "Absolutely disgusting!! Don't waste your $$! Brisket was super dry & overcooked...I spent over $40 for food I wouldn't even give to my dog.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z33Br2XqKnkomIMZtbmBCw"
  },
  "BXrydt0hIEkbwTeOXWHphw": {
    "date": "6/11/2019",
    "text": "This place is so good! I got wings and they were perfect. I think this may be my new favorite spot for wings  The man who took my order was super nice and helpful. Would 100% recommend for the wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K4lz_T6ho8Atz7aq6JLxrA"
  },
  "1lXlko_LWe0-RdiVY-wkEA": {
    "date": "1/12/2018",
    "text": "This is such a fantastic addition to Plaza Midwood.   I have always been a big Roasting Company fan. I think their Smoked Cheese and Pasta Salad is one of the best side items you will find in Charlotte. This is also a place that has sneaky good queso. I like a lot of things on this menu. Pending on my mood, my go-to orders bounce around between the side item plate (comes with yummy cornbread), chili taco platter, the con queso dishes, and the specials. Bring a friend(s) so you can start with nachos or chips and queso. They have different specials each day (food and drink). Of note: chicken pot pie on Wednesdays (go early they sometimes run out) and chicken and dumplings on Thursdays. Vegetarians, they might be a chicken place, but they have a ton of options for you guys as well. Their Tico Sauce is also delicious.   I like that there is a patio type area with a TV (it's technically in the building, but they open the doors). They also have a great bar. Note: when you walk in, you can sit at the bar or walk back to the counter and order, then sit wherever you want. This location is open til midnight on Sunday-Tuesday and 2am Wednesday-Saturday.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "dhMtzq-y5jqgSSdreeWjOg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Nachos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dhMtzq-y5jqgSSdreeWjOg/o.jpg"
      },
      {
        "img_id": "omG85AjoJ178FmgMObjPgA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Their queso is delicious",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/omG85AjoJ178FmgMObjPgA/o.jpg"
      },
      {
        "img_id": "CeyxMoHGSzDMKizFyrQEaw",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Smoke cheese &amp;amp; pasta salad (the best side here)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CeyxMoHGSzDMKizFyrQEaw/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "V8qn6gGCycazyDPtN0AJew": {
    "date": "2/24/2019",
    "text": "The menu was a little confusing because there was Mexican items but also soul food sides. The chicken was nice and tender however I would've liked more seasoning.  The squash casserole was nice but the new potatoes weren't all that great. The cornbread muffin was great, wish I had another one. Overall my meal was pleasant and I would definitely like to come back and try something different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OmvRD8JLNCa7rrZzFLUuuA",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. 1/2 chicken, squash casserole,  and new potatoes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OmvRD8JLNCa7rrZzFLUuuA/o.jpg"
      }
    ],
    "user_id": "hjCBGSs0u6IMN3nshKupfw"
  },
  "1EYXLJ_uau3a6n2eQw8F3Q": {
    "date": "6/7/2019",
    "text": "Been going to this place for years! Consistently good food and great service! The new bowls have been a great addition and you can't go wrong with black beans and pasta salad so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uJzomZsujlgHMe_c9H1vDw"
  },
  "0kSMxRrTiZYGOyIjEK385w": {
    "date": "1/3/2018",
    "text": "I had never been to The Roasting Company and am a fan of roasted chicken, so I was excited when this location opened up closer to our house. We went on a recent weeknight and each ordered a half chicken with two sides to give us dinner and lunch for the next day. The employee who we placed our order with was super friendly and helpful. He recommended that I order their most popular sides: garlic potatoes and squash casserole. My husband ordered rice and collards.  The food came out pretty quick and was fresh. The chicken was aaaaaaamazing. Fall off of the bone delicious! I loved the garlic potatoes and the little corn bread muffin. While the squash casserole may be popular, I wasn't a fan of it. It tasted more like cornbread stuffing with a little bit of squash in it. My husband wasn't overly wowed by the rice or collards. But really, we were there for chicken and we will definitely be back for the chicken.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UIUiHZS8UXG3hofqZBFTqw",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Half chickens and such",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UIUiHZS8UXG3hofqZBFTqw/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "Jw-yXesedj1kJx1ZMoxHdg": {
    "date": "2/28/2019",
    "text": "I went here late night around 12 am and the full menu was still available until 2am! That was a plus in my book! I ordered brisket and shoestring Fries. They have a signature sauce JACO which is a teriyaki BBQ sauce! It is in or on almost every dish on the menu my date liked it! I couldn't try it bc it is tomato based! I enjoyed the brisket with another sauce. I must say the brisket was more greasy than I like but the portions were generous! My date has a pulled chicken wrap that was fully loaded! It was huge! For my drink I had white sangria it was very delicious and strong!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eixcZP35kbMqstRyC_4zsg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Pulled chicken wrap and a side of sweet potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eixcZP35kbMqstRyC_4zsg/o.jpg"
      },
      {
        "img_id": "PB68XFujImhpiC3J4lwvSg",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PB68XFujImhpiC3J4lwvSg/o.jpg"
      },
      {
        "img_id": "QUiqQosuaRwsGpB8wx6X1g",
        "caption": "Photo of The Roasting Company - Charlotte, NC, United States. Brisket and shoestring fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QUiqQosuaRwsGpB8wx6X1g/o.jpg"
      }
    ],
    "user_id": "CFcLaJruy2kUgOOee6pvqg"
  }
}