{
  "yio9tr0Ih7eQMR21RB65Hg": {
    "date": "5/28/2018",
    "text": "My girlfriend and I eat here about once a month and have never been disappointed! The chips are really good and guac that's made table-side is excellent. The margaritas are some of the best we've had! Cool atmosphere. A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j0J8oW7rlPV4zQNixMg8eQ"
  },
  "Gi25l6MZb_g6ohlVJ61hlA": {
    "date": "5/19/2018",
    "text": "Great mushroom tacos!! The food was very enjoyable and the service was speedy & efficient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PyvyBu5Y58uG5Q3rqufFjw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Mushroom tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PyvyBu5Y58uG5Q3rqufFjw/o.jpg"
      }
    ],
    "user_id": "UpA0Z7iJ9Shzi3-HDMdRHg"
  },
  "Ea4quZMAlU7_9FPNLKUroQ": {
    "date": "6/4/2017",
    "text": "This is a great spot for a delicious bit of mexi-streetesque food and a good selection of beers and drinks.  The coke cola carnitas were flavorful and juicy. And the crispy cheese on the vegi street taco was amazing. Definitely will be back to this place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "-rbOICZmcGdUjBU1QrjAlg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-rbOICZmcGdUjBU1QrjAlg/o.jpg"
      }
    ],
    "user_id": "nIrKymh2qOo3_EEozl6QlQ"
  },
  "3SkMtlwjDao_fpNQGbEqGQ": {
    "date": "5/24/2017",
    "text": "Came here during a long layover once and i love this place. Normally when i get 3 tacos they are small and i double up the order. These fish tacos were huge and 3 with a couple drinks is a perfect balance. I tried both the vertical and horizontal tequila samplers and neither were disappointing. They come with this incredible bloody mary esque shot to refresh you after your three shots which i loved.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7UpcR46LAKO4BEpx7xz1oQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7UpcR46LAKO4BEpx7xz1oQ/o.jpg"
      },
      {
        "img_id": "JmMk1wJZ2GSjDE3BNnOimg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JmMk1wJZ2GSjDE3BNnOimg/o.jpg"
      }
    ],
    "user_id": "hfTm3-OPj4m_0kvoMQgBhA"
  },
  "-hWySY9sQ6s-x_Y9L9Xv8g": {
    "date": "8/25/2017",
    "text": "We love this place. The service can be slow at times but the food comes out fast and the food is delish! I like the steak tacos, my fiance loves the carnitas. My favorite salsa in town by far and the chips are always hot!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hqwz7YA1Z4xl2ZKuQDL4QQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Yum",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hqwz7YA1Z4xl2ZKuQDL4QQ/o.jpg"
      }
    ],
    "user_id": "PjvJ9dfvtFXgNIDLknvFNQ"
  },
  "Qg_x208CRdwGNaHpwKuKbA": {
    "date": "5/12/2017",
    "text": "The staff were friendly and attentive. No complaints.  The environment is best for a work happy hour or getting tacos and margaritas with a large group of friends.   The Que Onda salad is a great vegan option if you're looking for one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZbs_UjGkfGr6iIIQyuQlw"
  },
  "cbtJMxvzOlyZvPRHHVKVfg": {
    "date": "7/7/2017",
    "text": "Loved it!!! Place is fairly new and super cool looking. Great date place for drinks and apps. We used the Yelp offer for a free Chipolte queso dip. It's a little thin but delicious. They give you crispy hot chips and the salsa was perfect. It wasn't hot, which I find is the case at a lot of other places, which is annoying. I ordered the lunch special where you pick two out of three street tacos, I got The braised beef taco and the coke tacos. It came with rice and beans, which were delicious!  I wasn't a fan of the braised beef, but the pork was good. Frank got Al Pastor carnitas. I liked those better. You get three of those but NO rice and beans, but more expensive. Our frozen margheritas were Delish. It's pretty authentic And we really liked it. We'll be back. OLE!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2xcOT-YqNvNVrSl3j7OMZw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. FroEn margheritas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2xcOT-YqNvNVrSl3j7OMZw/o.jpg"
      },
      {
        "img_id": "2dXENfyHfq8caYyL2eSMVQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Al Pastor tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2dXENfyHfq8caYyL2eSMVQ/o.jpg"
      },
      {
        "img_id": "EDtJPqI0X3JQUUv_qKoc9A",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Coke taco and braised beef tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EDtJPqI0X3JQUUv_qKoc9A/o.jpg"
      }
    ],
    "user_id": "EDZKP6CGokUIoQfRmkLhdw"
  },
  "Bl6sv7F_FOasNx3yhJlPfQ": {
    "date": "4/2/2018",
    "text": "Delicious queso and guacamole!  Atmosphere was very laid back as it was pretty dead on. Wednesday night around 8pm.  Had three street tacos for $11.50 (fish, shrimp and a carne asada).  They were all very good (shrimp was the best).  They were on the smaller side, but with some chips and the aforementioned dips, I was definitely satisfied.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3PHXlou4eRYFK_q4Gy0_w"
  },
  "0uD3QRZJT2WcSFw-lzSAAg": {
    "date": "10/29/2018",
    "text": "Came on a taco Tuesday. Tacos were good and cheap, like $2. Servers were nice, it gets packed though so be prepared for that on weekends and on Tuesday. There's also a cute mural you can take pictures in front of if you're there before a crowd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUCe_EVy3inMEMHVNzlBrQ"
  },
  "TK2K3Bc--RZz87SgU12Lzg": {
    "date": "9/28/2018",
    "text": "I'm definitely on the Que Onda bandwagon! Food was delicious. Service was super quick. Drinks were flowing. Overall a 5 star experience. Hoping that wouldn't change on a busy night (we were there on $5 Marg Thursday). All three of us ordered different things plus guacamole- all super yum! Go here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eff1SL_lRP6R_eZwzatnrw"
  },
  "SEGfGQUlEp2Mlh_j13up1Q": {
    "date": "6/26/2018",
    "text": "The food is completely mediocre. We waited 15 minutes to get greeted and when we finally did they were out of every beer I ordered. The server was slow and confused. The manager was hostile, demeaning, and had no idea how to handle even the simplest customer service issue. I'm baffled by the level of incompetence. It's sad!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ghY99-VAWA_cWK6xP4XGvg"
  },
  "LTbetM-3hwb6tyaJ2p1oIQ": {
    "date": "2/9/2017",
    "text": "Go. If you don't want an average taco, go. If you want queso that makes all other quesos jealous, go. If you want the greenest guac that makes you question what green is really supposed to look like, go! If you want fresh margaritas that taste like a shirtless Juan squeezed those limes into a salt rimmed glass with all of his mighty abs under the hot Mexican sun, you know what to do. GO!  I'll probably already be there eating my emotions because I can't find the Juan love of my life.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "ileIdOsJobYtOEhurNTy3Q"
  },
  "BLytmECW6GrjxxTPRKujBQ": {
    "date": "9/17/2018",
    "text": "The food was really amazing so was the service. Such a great visit I was sad that we found this place the last day of our trip in town. Would definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIHr64-1F6B2mluq1ZWC0g"
  },
  "yrqlkCCz_YnCfUYyBhYOBQ": {
    "date": "9/16/2018",
    "text": "The decor is the only thing nice about this place.  I ordered the trio taco and it was uneatable.  I ordered chicken and streak.  The steak was rubbery, chewy and lack flavor. It was wrapped in burnt cheese that I pulled out of the taco to salvage it but alas that did nothing to better the taste. The chicken were so liquidy that the tacos tore and I was not able to even pick them up. They had pulled chicken in it and tasted really quite horrible. The salsa had burnt peppers in it and tasted aweful I had horrible indigestion just from few bites.  I also ordered a magerita which was another mistake because it had a stingy flavor like the magerita mix was stale. There was so much salt on the rims that it kept falling in the drink giving it further horrible salty taste.  Really a waste of money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7UGZbcaS6xSWVCnVVrozSA"
  },
  "LUaVLAHhWWDGLZ5vqwW8dw": {
    "date": "1/14/2017",
    "text": "I really liked this spot.  I tried their three street taco special and all three were really good. (Coca Cola Pork, Raised Beef and Steak).  The Queso for the chips and salsa was also very solid! We almost had to order a second serving!   The owner/operator is also involved with Three Amigos, which is probably my favorite Mexican restaurant in Charlotte!   This spot hasn't had success with restaurants in the past, so give these guys a shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "nap5CM2nZvaFodByvUL75w"
  },
  "51OPkyS6BocsyjhlH7AUVA": {
    "date": "8/11/2017",
    "text": "Came here for taco Tuesday with some coworkers. Our group size was on the larger side, so I'm going to blame that for the slow service that we had. The deal was $2 tacos (choice of chicken, beef, or carnitas). They were reaaaaally tiny, so if you want the best taco Tuesday deal in town this probably isn't it. But they tasted good!  Chips and salsa were on point and we tried their queso dip since you get a free one if you check in on Yelp for your first time visit. Also good!  I would be down to come back on a non-Tuesday evening, maybe when it isn't so packed (small venue to begin with).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GSdJDpD6gEFS5XPW_-ywMg"
  },
  "bw0mHiVL1aVViok84WO9uw": {
    "date": "3/16/2018",
    "text": "This was the first time coming here. I got the the combination tacos. (Any three tacos) I got the shrimp; and 2fish tacos; being I'm not eating any pork; beef etc. The shrimp taco was the best. The fish taco; not so much flavor. I had to add some Que so cheese and chip salas with it. The Margaritas weren't that strong. Over all a good little spot to grab a quick bite. I would come back. Nothing fancy; somewhere chill get a couple drinks and watch a game from the bar televisions. I do recommend coming here for food. Enjoy!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BEu_DEYZGsZEH2Gx2NjoRA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BEu_DEYZGsZEH2Gx2NjoRA/o.jpg"
      }
    ],
    "user_id": "z7gKmHnlWekQ23PWyx9AXw"
  },
  "U6R135EihABWSISu45Lm1A": {
    "date": "9/8/2017",
    "text": "Nothing falls short in this restaurant experience. Great friendly servers with great food that goes along with complimenting the atmosphere that is found in the restaurant. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xQYAgl2Vw-t6jKLhPMmC4g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Amazing freshly mixed Guac, and amazing food. A great experience overall",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xQYAgl2Vw-t6jKLhPMmC4g/o.jpg"
      }
    ],
    "user_id": "mmCziADEpXW4ihsdKmNi-g"
  },
  "YPD9beqemjeySOcVXNW_wg": {
    "date": "12/2/2016",
    "text": "Today was opening day at Que Onda. I've been anxiously awaiting the opening of this place for several weeks since I first heard about it. I'd seen today as their opening date but no information confirming this on their website or their facebook page. Hrm. Okay, so I called them to confirm, grabbed a lunch buddy and we made the several block walk down there.  The host promptly sat us, and the server was polite if not a bit overzealous at first. We got our drinks and were checking out the menu, he was good with the timing of giving us time to look but following up. The menu is pretty big, with a variety of items, mostly in the vein of authentic Mexican food, which I am a huge fan of. Today was also Taco Tuesday, $2 tacos! We both decided to get the taco deal since it would let us sample three different types of tacos for a really cheap lunch.   No chips and salsa were brought after several minutes, including up until after we had ordered, so we thought we weren't getting any. Some finally comes out, and the chips were good and fresh, and the salsa was good. I asked about spicy salsa and he brought out two types, a salsa verde and a habanero salsa. They were each in metal ramekin type containers that you would get ketchup in at a steakhouse. Both salsas were good, but I really enjoyed the habanero.  Problem was, the we got a portion of about half a ketchup container for two grown men, so I asked for more of the habanero, thinking he would bring out a larger portion. He brings out more, but it's just another tablespoon sized portion of the salsa! No biggie really, except that he didn't come back. Like, at all, for the rest of our meal.  A runner brings out our food, and the tacos look delicious. There is some onions and cilantro, but not as much as I am used to for Mexican street tacos. No limes either. WTF, have they ever had street tacos? I have, in Mexico... and around the US. Usually a good salsa verde, pepper based salsa, and limes come standard. Remember, we are out of our tablespoon of salsa.  Well, no one came by the entire time while we ate our meal. Not the runner, not our server, no one. I dutifully ate my tacos anyway, without spice or lime juice on them. My buddy and I agreed that the beef was the highlight of the three. It had good flavor and was tender, if not a bit overly juicy from the \"braising.\"   The pork was good, mine was a tid bit on the dry side, he said his were fine. The flavor was good for the carnitas as well, again, a little light on onions and cilantro for what I'm used to and lacking the flare of lime and salsa, but the meat was decent.  My buddy actually got to the chicken taco before I did and he said he couldn't put his finger on it, but it tasted very plain. I pinned it down as soon as I took a bite of it. It tasted like a chicken breast, cooking in a crock pot full of water all day. It looked like it had spice on it, but it was basically completely devoid of all flavor. Just like, soppy, bland chicken nothingness. It was also supposed to have some sort of sourcream sauce on it, but we couldn't really taste it over the blandness of the chicken.  Not once did anyone ask us if we were okay or needed anything during our meal. I intentionally ate slow because I wanted limes and more salsa.  When we were finished, a busser came to the table and immediately took our glasses without asking if we wanted refills and then took our plates. They were empty, and to be honest, I could have used a little bit more before we left.  We then sat there for about five minutes, waiting for a check. Waiting.. Still waiting. No water... So finally, thankfully we had cash and we were able to just drop cash on the table to cover the tacos and the tip. Unless they charge for spicy salsa (which nowhere I'm aware of does) we still left a pretty decent tip even though the service got pretty bad once we ordered our food.  I'd be more inclined to chock up the service to opening day if they were really busy, but they weren't. The food on the other hand should have been perfect.  Tips to the restaurateur:   1) Guests who want spicy salsa want it to dip their chips in, make sure they get enough of it to do that.   2) All tacos at a place that claims to have Mexican street tacos should come with limes.  3) Please make sure we are taken care of on the service end.  Final Thoughts:  I will give it three stars and definitely come back to give it another chance, maybe even two, because I love tacos so much. Vida has been my go-to, but they aren't True authentic Mexican. True Taco is too expensive if you get chips and a drink. The rest of what uptown has is American crap. This place's mission is exactly what I've been looking for, it just didn't live up to the billing. I have no problems paying regular non-taco-Tuesday prices for good authentic Mexican tacos, but this place just isn't there yet. Hope y'all get it worked out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "sl2Sdfg1z56Uj-FjRSFq-A"
  },
  "4ggR_LtBwl2FSOwAgqeG0Q": {
    "date": "12/7/2017",
    "text": "Good quality \"regular\" Mexican food. The enchiladas were good and a bit spicy. Also had the queso which was supposed to be complimentary, but didn't get the deal because I had takeout. Not stated clearly in the voucher. Otherwise the meal was a bit pricey. A solid 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qksgVQZ5ORHz83ZSsj6ekg"
  },
  "mioTP5Ano3i8gYyVVnjhag": {
    "date": "11/16/2018",
    "text": "I've been here around 2-3 times, it's really close to my campus which is very convenient for me. For the price being as it is, the food is at a much better quality than expected. I've had the fish tacos, and the nachos from the app menu with added chicken. Firstly, the fish tacos were so very good-like, I crave them. The battering on the fish, the sauce they put on along with the slaw-everything just works so well together. When the nachos came out, I was stunned. It was the huge tower piled higher with cheese, peppers, onions, refried beans, sour cream, and the most amazing chicken I've ever had from a Mexican joint. I really love this place, the only thing is I wish they'd add a bit more varieties on the toppings on their other tacos. Other then that, the atmosphere is great and the plating was nice as well. Overall, Good food for a good price-I would highly recommend Que Onda.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yY8ls2jm3F-fsF8oq7husQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yY8ls2jm3F-fsF8oq7husQ/o.jpg"
      }
    ],
    "user_id": "_zYW-ZciA6e7fJ6IGf0WDQ"
  },
  "2y_Qs81fslVxdEBK7lZsxw": {
    "date": "8/8/2018",
    "text": "Simply amazing. Discovered this spot really late in my NYC tenure. I felt like I teleported to central america  The seafood taco canteen is separate from the meat taco booth, which is in chelsea market food court.  This taco spot also has authentic latin american beverages.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "frWkjRoBsdH53BPhVZx1IA"
  },
  "HF0gT0-3KyY-N-d3JkziMQ": {
    "date": "4/12/2019",
    "text": "One of the best taco spots in the QC. Atmosphere is fun and the services is great. The Queso is awesome, and the guac is money. If you're coming by, ask for Ashely. She's the best server in the place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-uiC_2uN9EC9cOJ5unnpA"
  },
  "nc8q1w5GaB-R12hrBworCA": {
    "date": "11/26/2017",
    "text": "Taco Tuesday drew me in to finally check this place out.  In order to get the $2 taco special on Tuesday, you must dine in, really?  I ended up eating in and you must get the chicken, pork, or shredded beef for $2, which I did, but the shredded beef comes with a strange cheese which I asked not to have.  The chips and salsa hit the table first and it was pretty good, though the salsa was a little different.  The tacos came out soon after and were decent, nothing special.  I would say that the flavor of pork was a little better than the others, but again nothing special.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "YsBrC8foHLDeuEa4DJeS7g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Partial menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YsBrC8foHLDeuEa4DJeS7g/o.jpg"
      },
      {
        "img_id": "N9zv48IOXTDhx73HpHAzig",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N9zv48IOXTDhx73HpHAzig/o.jpg"
      },
      {
        "img_id": "tJ3ryHWgUhz8dlp7uDb-YA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. $2 Taco Tuesday",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tJ3ryHWgUhz8dlp7uDb-YA/o.jpg"
      }
    ],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "jM-GoB1lKenYsql-H4W6HQ": {
    "date": "7/20/2018",
    "text": "I was visiting Charlotte for a concert and searched or a place to eat.  This was one of the places that returned in a Yelp search. There was also a coupon for free queso.  Made reservations and caught an uber.  We did not need to make a reservation as there was space available.  The decorations are better than most Mexican themed restaurants.  There's a full bar and I loved my \"regular\" mojito.  Apparently, the mango mojito is the most popular according to Jose, our wonderful server.  My friend sent her berry sangria back which was on special that day.  I was not a fan of the mimosa but I realize I just don't like mimosas.  I ordered the tortilla soup and unfortunately, I did not like it. The presentation was not what I was expecting. It is a creamy tomato soup and reminded me of a tomato bisque. If you love tomato soup as a child this is for you. If not you may not like it. The queso was delicious and our tortillas were warm and I fell right of the Keto diet thing I was trying. Oh well. We enjoyed the tacos and choose three different types of meat. Each were delicious. I would definitely go back.  I almost forgot we ordered the churros which were a little dark. My friend did not want cinnamon sugar and so they just tasted like...well...nothing.  if you are going to get them keep the sugar.  I'll update my review next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5kbvHwytwanPKx9dZ7PRPQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5kbvHwytwanPKx9dZ7PRPQ/o.jpg"
      },
      {
        "img_id": "Yz3mlf4HdzINEAEwVqSytQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yz3mlf4HdzINEAEwVqSytQ/o.jpg"
      }
    ],
    "user_id": "U4F9hhPW4UlIvCZOSvQnTA"
  },
  "33jcxZRv0YSo6gf01bzQ8g": {
    "date": "2/20/2017",
    "text": "The sign on the door says \"Yelp loves us\" and that may be True, but this Yelper did not. Nothing about this place made me have a strong desire to come back.   My two girl friends and I met here for our monthly girls dinner. To begin, they don't offer valet or validated parking. I easily found a spot on the street but you never know with Uptown parking so that is a negative.   The chips were just okay and the salsas they have are super mild and ghost pepper hot. Nothing in between. I ordered the shrimp fajitas and tried to sub the rice and beans for plantains but was told I couldn't, so I just added a side of plantains. Then one of my friends ordered the carne asada and the waiter lets her sub the rice out for plantains. Wtf?!?!  My other friend who is on Yelp (heeeeey Tieren!) used the check in to get free queso. The waiter took her phone to verify that it was free and said it would was taken care of. I didn't eat it but it seemed to be a hit.  The food came out and I was excited. The color of the seasoning on the shrimp had me anticipating crazy good flavors but it tasted like nothing. I asked for some hot sauce and was told they one have the chips salsas and pico. Fail.   The plantains were good but that was about it. The rice (which I didn't really want) was dry and the beans (which I didn't really want) had no flavor. I only ate a small bite of each.   As far as food goes, I was just not impressed at all. Our checks came out and I saw that I was charged for the free Yelp queso that my friend ordered. The waiter took it off when I pointed it out but still...  In one word, I would describe this place as unmemorable.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "k0OXIzgFk9DCglIX0y2x8Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Shrimp fajitas (BLAND)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/k0OXIzgFk9DCglIX0y2x8Q/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "s1kKb5prI1XckiGCDghzdA": {
    "date": "2/16/2017",
    "text": "I think Que Onda is here to stay. Who knows why this location gets a shiny new restaurant every year or so, but I really Really want Que Onda to stay. Today was my first visit to Que Onda and I was impressed. I went in for a late lunch, so it wasn't busy.   First up were chips and salsa. The salsa had a smokey flavor. Queso was free thanks to Yelp. It was hot, had no peppers, and simple.   - Baja shrimp (off menu) had shrimp with a little spice, like a Bojangles Buffalo Bite in shrimp form. To offset it was cabbage slaw. If you're concerned about spice, don't.  - Grilled steak was underwhelming. The steak was overcooked and a little tough. Choose something else.  - Al pastor taco was the best between the three tacos. Full of flavor and the pineapple provided a nice contrast to the pork. The onions were fresh, but not strong.  Service was great and our waitress was patient. I will be back in no time.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i5BzKZqD9LvLrgrOIeCM9g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Parilla salmon sub nopal salad for grilled corn",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i5BzKZqD9LvLrgrOIeCM9g/o.jpg"
      },
      {
        "img_id": "T3cHsoGd6xETzPf8N2JjHw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Skillet fajitas with adobo shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/T3cHsoGd6xETzPf8N2JjHw/o.jpg"
      },
      {
        "img_id": "lhebSY5FC6rIP7NRTI6vbA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. 1 Beef, 2 Al pastor.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lhebSY5FC6rIP7NRTI6vbA/o.jpg"
      }
    ],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "qseJmpFMAlK__H1Hu5ZKqA": {
    "date": "6/22/2018",
    "text": "Decided to try something new for Taco Tuesday. The tacos were not good. The service sucked even more. Did I mention it wasn't even busy. On a positive note, the atmosphere was beautiful in there. I will give it another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3gv3QQbqXuTH2_EgyhfdBg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3gv3QQbqXuTH2_EgyhfdBg/o.jpg"
      }
    ],
    "user_id": "olW3TJfjHQadUJ7XBZqfpg"
  },
  "5fvruVYqk9z5bavVM7sU2g": {
    "date": "7/15/2018",
    "text": "We came here on taco Tuesday and the tacos were decent... i admit we're pretty picky with Mexican food coming from Southern California, and we weren't expecting authentic by any means, but these definitely weren't very good. I'm sure they are better on non-Tuesdays, but even with their taco tues deal, seemed overpriced for the quality.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tJwuz2150i1LB9aecW1ljA"
  },
  "15s9YzkWrnQRxDTM1ynysQ": {
    "date": "8/28/2018",
    "text": "Daily specials combined with a fresh scene and fast and polite service. There's literally nothing bad to say about this place. Super impressed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dvR33-udpOHtARuvuPQmJA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dvR33-udpOHtARuvuPQmJA/o.jpg"
      },
      {
        "img_id": "xCsCLQ0i7T33op2e7i3-BQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xCsCLQ0i7T33op2e7i3-BQ/o.jpg"
      }
    ],
    "user_id": "IAKqPpMIGhOQaDKRHWJwiw"
  },
  "xbePwpkAhXg8b3hENU3sJg": {
    "date": "12/9/2017",
    "text": "What a great addition to this part of uptown. Great food, prompt service, reasonable prices and comfortable atmosphere.   The chips and salsa are addictive. They have the warm thin chips that compliment rather than overtake the flavor of the fresh salsa.   Chicken tinga tacos are the best. The tortilla soup is a bit creamy/thick for me but nicely flavored and now they added a small cup size (used to o my have a huge bowl serving size).   They serve lunches promptly, making this one a great place for a good weekday lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByzCVvaqoMQMrWWUhEivBw"
  },
  "PSDXdtx5Vinno3uXh7wzgA": {
    "date": "11/14/2018",
    "text": "Found this location by accident on our way to a Panthers game and boy am I glad we did. Based off of that experience, we decided to give the Matthews location a try and we have not been disappointed with either location. Service has been top notch at each visit. The Baja fish tacos are absolutely delicious. They have the best salsa I've ever had at a restaurant before. The queso dip is great, queso fundido was so yummy. We have definitely found our new go to for spanish food! Go give these guys/girls a try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "_fnV4xX7P6qm8FItUuloOg"
  },
  "ukns5xsV3lrPJ1b73ltQJQ": {
    "date": "2/20/2017",
    "text": "I mean.... it's aight.   I think I read somewhere that the same people that own Three Amigos Restaurant and Cantina own this joint. And if that's the case, they need to go back to the drawing board. If not, then apologies Three Amigos! Somebody's trying to throw you under the bus.   But whomever is in charge of the flavas of these dishes need to step they game up. Now unfortunately for any Mexican joint, you're gonna need to come correct cause not only is Mexican my thing but it's my life. My homies always talk about how every time it's my turn to choose a spot for our monthly girls dinner, I choose Mexican. I mean hey, it's just my thing. After going to Tacuba in NY, the bar has been set. And This joint was nowhere near it.   First off the queso was okay. I read a review about cilantro added to the queso and it was in ours buuuuut I didn't get any of the cilantro flava, so to me it was pointless and wasn't a stand out in my list of top 10 queso dips.   The salsa wasn't memorable but at least it wasn't the canned stuff you get at your average $6/meal Mexican joint. But! I'd rather get food from a $6 Mexican joint considering that the tacos were okay.   I didn't realize I was adding cheese and salsa to 2 of my tacos until I put it in my mouth. And that's not a good sign. Tacos should stand alone in flavor. I shouldn't have to add cheese or salsa. The best taco out of the three was the fish. Probably because it had a lot of shit in it. And if you read any of my other reviews on Mexican food I like a lot of stuff in my food. Unless of course a simple dish is so damn good it needs nothing else. The carnitas and other taco had decent flava but it wasn't enough for me to want to come back. It was just.... average.   Our waiter was straight. Although he didn't let my homie Meleah substitute some sides for another, when he let our other friend, do it. Odd indeed.   So nah, I don't need to add this to my list of restaurants to go back to. But I'm glad I can check off one of my bookmarks on Yelp.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a6sHCDtqdJGVCp_evX78Fg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fish, Braised Beef, Coca Cola Carnitas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a6sHCDtqdJGVCp_evX78Fg/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "svhLwnaBUOIGfKFe5mon1w": {
    "date": "7/17/2018",
    "text": "Just realized how a bad dinner can make the rest of your night..... No validated parking or any kind of parking  No signs know what your getting on your taco.....like  Different Cheeses with different meats....toppings....etc   Cilantro in the queso?  I read the reviews before I came here...but I wanted to give it a try  And I agree the chips were over done. I thought maybe I just got a overdone basket....but he next basket was the same way....  The other waiter I had to put my order in with was actually really nice & helpful however   I wanted to leave a decent tip atleast but I didn't get any ones....just $5's :/ They said they ran out of fives? Even after going to the bar to ask for change.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j7MO14T45ho_zcWLiazJ5A"
  },
  "9tJSHgqVuk3_y39pBE_20w": {
    "date": "10/25/2018",
    "text": "By far my favorite Mexican food place in Charlotte! Wednesday is my favorite day to go for $3 queso and guac, and $5 Mojito... Favorite Taco...? BAJA FISH TACO!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "holu0opdKfEzSfcwRX_pjw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/holu0opdKfEzSfcwRX_pjw/o.jpg"
      }
    ],
    "user_id": "xz7KqsAMbtR9qTcz9Lf80g"
  },
  "5w8iS5IItO10G9YVhtbsCg": {
    "date": "1/10/2017",
    "text": "Okay so I don't know how this restaurant is on non Taco Tuesday night, but you can't beat Taco Tuesday!!! $2 tacos and some $3 beers.   The beef tacos are the best!!! I am not a big fan of their chicken but the pork is good too.   So the place is kind of small but the music is a great part of the atmosphere as it transfers you into another setting.   The staff was nice and I highly recommend the beef taco! Cannot go wrong.  If you are a mojito fan try it here! Delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nf--sGE44Cb-sPnQZCTPZw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Beef and Pork tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Nf--sGE44Cb-sPnQZCTPZw/o.jpg"
      },
      {
        "img_id": "uapo5WS9HkV-qs8wYjT6_Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uapo5WS9HkV-qs8wYjT6_Q/o.jpg"
      }
    ],
    "user_id": "wcubg4QbsWBhc5bjlkCdDw"
  },
  "H5sahCYUFBspR6TBYRDtIw": {
    "date": "9/2/2018",
    "text": "Delucious, convenient, super-friendly, and fresh!  Clean, casual atmosphere with indoor and outdoor seating available in close proximity to Dowtown (aka Uptown) attractions.  Their salsa is good, but the queso is beyond compare.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mJOe1UHI8KOGrGhjzu8oMg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mJOe1UHI8KOGrGhjzu8oMg/o.jpg"
      }
    ],
    "user_id": "eefvB63-IWKzo0VQoG0Lag"
  },
  "f0wuMi9Ag1Gy9MhGayOlsw": {
    "date": "1/24/2019",
    "text": "The food was great I really enjoyed the tacos and the margaritas I just wish it was apart of the taco Tuesday special",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f9dlTbGbJZlXOp9FC1nVUw"
  },
  "Jcq0sNUMdVYcE5ANxXX-MA": {
    "date": "11/12/2017",
    "text": "We really had high hopes when the chips and salsa were delivered. The chips were thin, ultra crispy and perfectly salted. The salsa was roasted and had a great flavor to it.   We ordered the guacamole which came only partially table side (though I don't believe they advertise it to be). They asked if we wanted chunky or pureed and we went with medium. What they didn't ask for was how spicy we wanted it--which meant we got no spice. It was also lacking salt.   I ordered a Que Onda salad, thinking it would be substantial enough. It boasts black beans and roasted corn, so I figured it would pair nicely with the guacamole. It was in the taco shell and did come with beans and corn, but it was mostly iceberg lettuce, the dressing was just okay, and there were MAYBE two tablespoons of black beans and corn! The presentation wasn't even a thing to mention because at first all I saw was lettuce since the rest of the stuff (which was minimal anyway), was buried. For such cheap ingredients, I feel like they could've sprang for at least a 1/2 cup of the beans!  My husband got the chicken burrito which was topped on a bed of chips. And queso. It looked like nacho cheese, to be honest. It was bland.  Our initial excitement of the chips and salsa quickly ended when the rest was served. It's really B material. Cool vibe, but if we ever make it back in town, we'd just stick with chips and salsa paired with margaritas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLdMXf2gt9Am9LOLL_T2FQ"
  },
  "zG8uzRrvZfTzdInjRjXmPQ": {
    "date": "8/21/2018",
    "text": "One of the very few \"real\" Mexican restaurants. They have really great fresh meals! And they have great guacamole!!! Especially there \"streets \" Guac",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rmW6mtwcG7vKZf2Aw8PjA"
  },
  "lN60S6rXu4uAd2F5X77sjw": {
    "date": "5/22/2017",
    "text": "Long overdue for an update...went back for lunch with coworkers to test out again if the place was a viable lunch option. We were seated on the patio and must say that service was very prompt and accurate. Food is delicious and love the smoky salsa. Chips are still few large and many small pieces but I can live with that :) Will definitely add this as a location for our weekday lunch rotation !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oj7KXXuBXOGfnLs0rCwkw"
  },
  "cB_bBJX8doQ9kHG5z8Yhcg": {
    "date": "11/29/2016",
    "text": "This is what Uptown needed. Before Que Onda, we were in a serious Mexican food drought on that side of town. They didn't change decor of the place much from the Mandrake, but they didn't need to. We grabbed a seat at the bar on a Tuesday night-- their $2 taco night. I am going to give them the benefit of the doubt and say they had no idea this special would be such a hit. It was pretty busy and the staff was overwhelmed- but apologetic about it. They really paid attention to the details here as far as the plating and presentation goes. Even the chips and salsa bowls are really cute. My boyfriend and I each got the 3 tacos that were on special for $2, plus a side of rice and beans to share. They were all good- but the pork was my favorite. The beef was a touch too salty to be as enjoyable as it could have been. Tacos are pretty small, just a couple bites each. Which is fine when you load up on chips. They also have $3 Mexican beers on Tuesdays! I don't think I would go and pay the normal price for the tacos, but we will definitely make this a habit on Tuesdays! It would also be a great place to start the night with a cocktail before heading into the heart of Uptown.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "QkhRTrURcY3DW0BLLFPsIw"
  },
  "6BT65EgXMhXU1FNJqJTQUA": {
    "date": "11/22/2016",
    "text": "the food was delicious, but the service is awful. I went to lunch at around 11:30am and got a table with some friends, we all ordered pretty much the same thing, and at the exact same time. Only four of our 6 people were able to eat. We told atleast 4 servers that their food had not yet made it to the table, but no one seemed to have cared. To us, it looked like they kept giving the food to other tables around us. One of the two people asked to have the food boxed up as we had already been in the restaurant for 1 hour and 15 minutes. It look another 20 minutes for her to get that food. They have some serious work to do in terms of organizing their service and getting the right orders out to the right people.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-Kvn6-kZ_ZXwjxESvBsNhQ"
  },
  "AxturS18HSgk85RfuQ2_8g": {
    "date": "9/1/2017",
    "text": "This was a last minute find. I was at Charlotte  airport and  my bf was picking me up and asked me to search for a Mexican restaurant. I found this on yelp and we came here. I'm vegetarian and I loved the vegetarian tacos :) they were yummy!! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XSYpjUzBWicuoshjC--yMg"
  },
  "z4zDo7xiOPf5_TG3x-9VjA": {
    "date": "12/6/2016",
    "text": "I really like this place and I REALLY want it to do well. The vibe is nice, it is literally right beside my office and the wait staff is very friendly and attentive. The reason I am giving them three stars (I wish there was an option to give 3 and a half is because there is WAY TOO MUCH salt in the food. It is overbearing and it makes it almost not edible. I love the chips and salsa and the guacamole tastes so fresh. I think the food would be a slam dunk if there just wasnt soo much salt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a_Zf3tEbAhJ0J1wsIqs3Vw"
  },
  "4dyqnjvtiCTksvsAsfmCLA": {
    "date": "7/18/2017",
    "text": "Can't say my last visit was a pleasant experience.  While eating our salsa and chips I nearly chocked on a rubber band from the salsa. I notified our waitress immediately and the manager casually apologized for the mishap.  Not only he did not offer to comp the meal it seems to me that he didn't think it was big deal. I checked on the sanitation score when I left and it was 92% and now it all make sense! Very disappointed with my visit.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jLSqGeUhYPk9R8P2oSyUw"
  },
  "WX0dWp9c9rkOdW9iqOqM6g": {
    "date": "3/29/2017",
    "text": "My friend and I went here for dinner after happy hour. No wait for a table and service was really good. I ended up ordering 3 tacos and chips and salsa which were all really good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hs7tktWaOePcy7cJCXUjtA"
  },
  "m9LG5FqvUPNWj-gAKyyGlQ": {
    "date": "2/23/2017",
    "text": "Our server was great and suggested great items off the menu. The skinny-passion fruit marg. was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6dlUo7cDegrrIeQFqcjrQ"
  },
  "i_WIfCPwdN-a9_XQUAQkJQ": {
    "date": "5/20/2017",
    "text": "We sat at our table for 15 minutes and not a single person helped us! HORRIBLE service. Take your money elsewhere",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nqoOcKeTZVjOjbLAXBFlew"
  },
  "B0CvOerdkkqhQ3k0OgPBAg": {
    "date": "1/11/2017",
    "text": "Amazing food. The al pastor tacos and guacamole were delicious. Everything was so fresh. Would go back in a heartbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WdUNQzCDefvtRNBs7SxJaw"
  },
  "J-PwALVoFdrntUeLB3TsZw": {
    "date": "12/22/2016",
    "text": "First time here and we are hoping this place actually stays open for a long time because it's great! The queso was awesome, salsa was fresh and flavorful, and the tacos were very good as well. Our server was very knowledgeable of the menu and gave great suggestions. Overall, the service was great. Taking off one star because most of our tacos fell apart while trying to eat them due to a soggy tortilla, but still tasted great. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vF0g-NjE6OH8F0aQpR5fXg"
  },
  "sB9lkOkdkra6YKLrUpnQTQ": {
    "date": "4/1/2017",
    "text": "I ordered the Al Pastor Tacos and a \"skinny margarita\". The flavor of the Al Pastor tacos was good but the meat quality was pretty poor. It was full of gristle so I had to pick a lot of it out because I honestly could not chew it/bite it off without destroying the whole taco. Really, about 1/4 of the 'meat' was not exactly edible.  The skinny margarita though - was delicious! It was on the sweeter side which is exactly how I like them so I was super pleased.  The chips and salsa were tasty. The chips must be made there. The salsa has a mellow flavor and is not spicy.  All three servers who waited on me were nice. They seemed to have a group of three servers taking care of everyone there (at lunch) which might be why the service is a little slow? They kept thanking me for being patient although I didn't think the were terribly slow - just a little on the slow side.  All in all, I would give them another try because the margarita was good and the flavor was all there. I would NOT order the same tacos. Most likely a different meat or entree would be worth a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXPv1aXACgCt7Kz7Kr-_dA"
  },
  "dZDuOkwMOJujydvmn59whw": {
    "date": "3/31/2017",
    "text": "The salsa was weak.... the bartender was not pleasant and our waiter wasn't either... they were rude to us the moment we walked in and the experience went downhill from there. The premade frozen margaritas were better than the fresh made margaritas. I would recommend going to Bakersfield instead and save your money",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_fUE6buysIOG05MbE2Pqg"
  },
  "11wkx1lMdNrHzzhWzN0ldA": {
    "date": "5/11/2017",
    "text": "The place is great - I loved the decor, the music they play, and the food! When I went they had $5 margaritas, the quac was pretty good, the queso was good, the chips were hot. I had Coca Cola pork tacos and they were really good. Can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a2kTqkoJpb5_qY0Nux0iYw"
  },
  "uMjh_2ILCoz6pQHuoAe4KQ": {
    "date": "12/3/2016",
    "text": "Checked this place out today and was very happy. The service was awesome and the food was incredible. Our server made great recommendations and was curious to know how we liked certain things because they are willing to make changes to their menu based on what their guest think. The habanero sauce is very spicy but delicious, if you like spicy food, don't miss out on in. You can mix and match tacos, just ask! We didn't get any drinks but the drink menu was loaded with options. We will be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyLG7HU2vCcL83VwPxgW8g"
  },
  "EYeWJr2B99Dx5MrLfs5Kow": {
    "date": "11/22/2016",
    "text": "Probably the best chicken quesadilla I've ever had. Tortilla chips made fresh in house. $2 taco Tuesday! With $3 Mexican drafts. Service was great. I only wish they served their tacos either on a rack or different plate. They served them on a small plate that was very deep, by the time I took a couple bites, it got very messy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QeKryEKKVZilQGRXand2Ww"
  },
  "N6D2pKfX4voP1ucr7n5RjQ": {
    "date": "11/17/2016",
    "text": "Well, we only got take out but I can't wait to go back!! The guacamole was by far my new favorite and the steak fajitas were the best I've ever had. Can't wait to try the margaritas!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tmk6lWFfBToJpbufIxvefw"
  },
  "KR725k22wUndQIB6C_61uQ": {
    "date": "6/6/2018",
    "text": "Love Que Onda and will be back. The location in uptown is great if you're already in the area but otherwise free parking is hard to come by.   Every time I have been I order 3 different tacos. This last time I tried fish, carnita, and steak and loved them all. My favorite thing at Que Onda by far is the queso! There's something in it that makes it so much better than usual! Staff is fine. They have greatdaily food and drink specials that I will be back to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9eiqEQzRrhPjvMDoGRq20Q"
  },
  "Uyutt6Xdq1pPOu9fpJKfwQ": {
    "date": "12/5/2018",
    "text": "Tiny tacos. Great margs. Excellent patio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9KNw4QOZy6TZk17elzDoA"
  },
  "_HKFldPy38Fs_WdQhYuxDA": {
    "date": "1/14/2019",
    "text": "I have been to Que Onda Tacos twice in the past 2 weeks. Both times the food and service were great. First time around I had the tacos lunch special then the next time the burrito. Really good food. I'll definitely be back with friends. Btw the restaurant has a really nice bar too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R8OuhN8LEQ4fXME-cQTCvg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/R8OuhN8LEQ4fXME-cQTCvg/o.jpg"
      }
    ],
    "user_id": "9PEPGxZrn2SBDZO1UOyOkg"
  },
  "_jRkLrTOz4wqvQDgFBpf6Q": {
    "date": "5/28/2018",
    "text": "I was in the mood for some southwestern style food and this was the place we landed. If you check in they give you a free quest to go along with your salsa. The presentation of the food was actually the best I've seen. The flavor combination with queso,  jalapenos and chicken was wonderful! The chicken was phenomenal! Highly recommend this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nRXhexpSs8j3il9JfB845g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Great ratings and tacos on Sunday!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nRXhexpSs8j3il9JfB845g/o.jpg"
      }
    ],
    "user_id": "EYnRRWIOlxKcylR457hSMg"
  },
  "2-Hlj-KeToeF-Z54ZyILIg": {
    "date": "10/7/2018",
    "text": "The only good thing I have to say about this place is the interior and the coconut marg. My boyfriend loves their tacos. I had some tacos and they were a little flavorless. I will be back for the coconut margs.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "avkCj6jnszCk1pe1XlTDHQ"
  },
  "KjgUeNzn0UjCj19TYVqplA": {
    "date": "7/16/2019",
    "text": "Not sure why I keep giving this place a second chance but I do I guess because the food is good. Service is always soooo terrible, we had to wait almost 20 mins just for our first drink. Also don't order the al pastor tacos thinking you'll get that creamy avocado sauce that the menu says comes on it...It never, and I mean never gets put on it. Baffles me every time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V-SHAvXP13iQwaDbuMzxxA"
  },
  "C-Ic3fEhK9wEEfQM_4injg": {
    "date": "5/11/2018",
    "text": "Definitely one of those Americanized Mexican joints. The cheese dip tasted like the cheese you'd find in a lunchable and the salsa was bland. I ordered the carnitas chimichanga and I picked at it. The meat was too salty and it was on a bed of chips? Which didn't really make sense to me cause you eat through two baskets of chips before your entree...no? Just me?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4hqLvorZ8shHcHSAcn3CAA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4hqLvorZ8shHcHSAcn3CAA/o.jpg"
      }
    ],
    "user_id": "TaJpm1fl0q74MFCTgn7FtQ"
  },
  "RgOHIsKa3T9Vkef2_O91fw": {
    "date": "5/29/2019",
    "text": "I have eaten here twice -so far.  Once at lunch(quesadilla) and once for dinner(burrito).  I thought Chipotle was good. They aren't close to Que Onda.  Simply the best Burrito I've ever had.  Plus great service from Ashley my server. All in all, a great meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJdIF6b3rW6gSBAGDIw2yQ"
  },
  "ldqCXV1F1ULgdB82XsCKeA": {
    "date": "9/5/2018",
    "text": "My husband and I have been here a few times. We really enjoy the atmosphere and think they have some of the best margaritas in all of Uptown. The food has never disappointed. You should try the tacos! The servers have always been very accommodating. The chips and salsa are delectable. We particularly enjoy eating on the patio, which is always better at night when you are enjoying a meal uptown. This isn't too far from the Ballpark if you want to grab a bite before the ball game.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 4
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "Cgm0YaYudhMlU-UsuGDXqw": {
    "date": "7/10/2017",
    "text": "Que Onda, Queen City!  Translation for for those who do not understand Mexican slang (Aka: like myself ;)  What's up, Charlotte!  HA!  Now that's out of the way, let's taco bout some of the great reasons why you gotta eat here: - Endless Chipotle Queso Salsa and Chip - Yes, endless :)  - Street food-style ( comfort style menu). - The food is dirt cheap. - Daily Specials: Monday: $5 Lime Frozen Lime Margarita / Half off Bottles of Wine Tuesday: $2 Tacos / $3 Mexican Drafts / $4 Local Drafts ( TWO DOLLARS TACOS! so mark your calendars. They are really good tacos and good size too. Wednesday: $5 Lime Mojito Cubano Thursday: $5 House Margarita Friday + Saturday: Ask about 'Turn Up Tequila'  Sunday: 5 Rocks Red Sangria - $9.95 Weekdays lunch specials (11:00am-3:00pm)  As you may know, I'm still exploring the area, and it was my first time here. I was impressed or I may even have been spoiled by the bartender \"Barbara.\" Que Onda, I'll be back very soon.  Four and Half Yelps",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "N44fmCFmXYx0dZu8IeEUkQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/N44fmCFmXYx0dZu8IeEUkQ/o.jpg"
      },
      {
        "img_id": "P4rWW_tmWy2r4k9UdsyUog",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/P4rWW_tmWy2r4k9UdsyUog/o.jpg"
      },
      {
        "img_id": "4qNRAjRVWPsjYVHWRMBMjw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. $2 tacos  all day, every Tuesday",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4qNRAjRVWPsjYVHWRMBMjw/o.jpg"
      }
    ],
    "user_id": "N9hqTPQu2bmI8c2Pj8F1ww"
  },
  "Q-1H_nrsd4AWpL-9J8aZ-Q": {
    "date": "5/1/2019",
    "text": "The food is always delicious and full of flavor. I always get a combination of tacos (2 steak and 1 shrimp) and my boyfriend will get a fajita. Both always very yummy. The drinks are good as well, sometimes a little strong, but nonetheless very good. And let me just tell you about the lemonade they have  you can customize the flavor you want and it is always mouthwatering good. The service though..... it's pretty spotty. Sometimes it'll be pretty good and other times we'll be sitting there waiting for our check for 20 minutes, and some waitresses have really bad attitudes, like you can almost tell they don't want to be there. So needless to say- we keep on coming for the food and drinks.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "saGtVjDonEktrWaPHy1wHg"
  },
  "w0lrBnDTVnpIhmON2u2vIA": {
    "date": "9/7/2018",
    "text": "I came here because one of my co-workers was really in the mood for tacos. I'm not sure how he found this place but we were pretty happy he did. I wasn't expecting the food and drinks to be as good as they were. We came on a Wednesday which happened to be the day where they have $5 lime mojito cubanos, $3 guacamole side and queso. I ordered all three for our table and got the mojito but added passion fruit. I love anything passion fruit so I was pretty happy with my drink. For dinner I ordered a combination of tacos - grilled steak (hanger steak, crispy cheese, onion and cilantro and salsa Rosa), braised beef (crispy cheese, onion and cilantro and salsa Rosa) and al pastor (adobo pork shoulder, pineapple pico cilantro and creamy avocado sauce). These three tacos were a lot of food. I finished one and I was pretty full. I really enjoyed the hanger steak because it was cooked really well and wasn't chewy. Overall, I'd say this is a pretty good place to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9vqUEgLK_IOGG1uMA9Dk7Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9vqUEgLK_IOGG1uMA9Dk7Q/o.jpg"
      },
      {
        "img_id": "R8NMp9r2eQldS8dYgHeNJA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. mojito + passionfruit",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R8NMp9r2eQldS8dYgHeNJA/o.jpg"
      }
    ],
    "user_id": "G5_1ibEAdiXivN7cydTSpg"
  },
  "QW7RWujT4WaO2V7Au7i6OQ": {
    "date": "3/19/2019",
    "text": "Absolutely stellar. Was very pleasantly surprised finding this little hole in the wall in Charlotte absolutely wonderful food and get the taco platter with three different types of tacos and you won't be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XpYf0rLwqlVojWiz15W6Zg"
  },
  "5g9aWclMjf_EmB1i3x7eCg": {
    "date": "8/31/2017",
    "text": "I've given this place 3 tries now and I hate to say that I haven't seen much change in things. It certainly has grown in popularity and they have really taken advantage of their sidewalk dining space, but the food just isn't anything super exciting.   The chips come out hot which is good, but the salsa is very smokey and kind of watery. At least you get unlimited chip refills. You also get a free queso dip if you check in on yelp! But even the queso is a bit watery too.  This past visit I ordered the Que Onda Salad. I should've known to ask for the dressing on the side, but forgot and found the salad drenched in dressing, which was a lemon-agave citrus dressing. Because of that, it wasn't the light and refreshing salad I was hoping for. The radish, carrot, tomato, jicama, red onion, and avocado slices on top gave good color and texture, but this salad was just not my favorite. It was at least a good portion size for a meal. Next time I will stick to the tacos.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lCFqwrfHhHIxeZMaHS3wYQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Que onda salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lCFqwrfHhHIxeZMaHS3wYQ/o.jpg"
      }
    ],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "uA0Q78hWMo-Vsb0JPmhe0A": {
    "date": "9/25/2018",
    "text": "Ok my second time at taco Tuesday I'm going to give a honest opinion. I love the ambiance of the restaurant, the music is fitting to the decor of restaurant. The staff is nice our server was great can remember his name but he was great very attentive. So let's get to the food today u had 4 tacos, beef taco was normal nothing to special, the chicken taco was one of my favorites, carnitas taco was another favorite, the shredded beef wasn't both times they were dry & without flavor. The Queso & salsa was excellent with the hot chips. Overall it still gets a must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HXaWRJ3n63eqckkBxMDwag",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Taco Tuesday Carnitas, Chicken, Shredded beef",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HXaWRJ3n63eqckkBxMDwag/o.jpg"
      },
      {
        "img_id": "OdnsvFmImGBfD8lFYk8pKg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Loving the everyday specials!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OdnsvFmImGBfD8lFYk8pKg/o.jpg"
      }
    ],
    "user_id": "wvVmiwklc1fcjAhy1BEQzw"
  },
  "EyctCefEjgXWyFr-8iqM5g": {
    "date": "4/28/2019",
    "text": "I came back for brunch today, Last Sunday was my first time with my family, today me and my husband went back and we have the same great experience. Delicious Guacamole, Shout to this restaurant management and my waitress!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNY2_JdLboTfcTE-zgZ4hA"
  },
  "ip0kYjWsSaJCgqASB-SJHg": {
    "date": "7/16/2018",
    "text": "Sooooo danginnn' haha. I wish I was being dramatic, but for real it was really damn good. We  decided to try a new place and it didn't let us down. We came in and got seated right away and a waitress came by to introduce herself as well. You get chips after being sat, once I took a bite I had a feeling it was going to be great, since they were hot and tasted as if they just came out of fryer, yet not so greasy. I ordered a salad bowl and I wish I took a picture for you all, but I was too hungry. The shell tasted amazing!!! The chicken was cooked to my perfection and I asked for no corn... there was no corn.  Now I'm looking forward to going back with my friends, but everyone else enjoy and loved their food as well. THANK YOU!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GNs7Xn1jtTnJ4Xd6k26mfQ"
  },
  "pPoFFqbtaLUFLrD0rcS3fw": {
    "date": "9/29/2018",
    "text": "Great food but service left a lot to be desired. Went here last night and had a reservation it took 17 minutes for the waiter to take our drink order. That would have been fine if they were busy but there were more open tables than filled tables.   The food was AMAZING. I had the pulled chicken tacos with retried beans. The chips and salsa are PERFECT. We had finished our meal and waited what felt like FOREVER for the waiter to come back so we could ask for the check. Other than extremely slow service the food can't be beat!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lYFMp-nuR2Tj4JDao6b0cA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lYFMp-nuR2Tj4JDao6b0cA/o.jpg"
      },
      {
        "img_id": "0qvGfyIRq-mXQi14Y6QZyQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0qvGfyIRq-mXQi14Y6QZyQ/o.jpg"
      }
    ],
    "user_id": "Jc04CMdY9OpDvC1eeLyt9A"
  },
  "p23Q55-lOOgH3lVf94MSDw": {
    "date": "4/12/2019",
    "text": "Get ready for an adventure in flavor. The Charlotte Taco Week ended for me at this fabulous location. Easy to find and the food was outrageous! I had the Brussel Chorizo taco that could not have been any better. From the first bite to the last, every dripping element was wonderful. The texture and taste could not have been improved.  The next taco was the Ropa Vieja taco. I have never been to Cuba, and I don't need to go if I can get Ropa Vieja tacos here. What a battle for number one on my plate! You cannot go wrong with this taco. The savory taste of the meat, the crisp crunch of the potatoes and the spot texture of the pinto beans just hits the spot.  Order two or more and you will not be disappointed.  During CLT Taco Week I went to 5 locations. This was the best overall. I will be back for Taco Tuesday for sure. Wonderful service and chips and dip that is well above the average.  Keep up the good work Briana.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Slw_Fxqj5rhSO0tMa6xlzg"
  },
  "qcSKFz_LQ5_xsbvMaKhMQw": {
    "date": "10/21/2018",
    "text": "Went for dinner with 3 kids. The waitress was either uninformed that we were seated or did not see us as we waited for more than 15 mins to be greeted and many were sat after us and already attended to. The food was just ok and the libations were not great at all. Hoping to try it again before I rule them out completely.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ix5O_g4s_1QxHQzG97u5VQ"
  },
  "rNDf1x0NPngvdza-u7aR5Q": {
    "date": "12/5/2017",
    "text": "I loved the Tamarind Margarita. It definitely was my favorite part of the experience. The tortilla soup was ok. The salad was good except that I didn't like the dressing. Perhaps too much thyme in the dressing? The service was great. Not sure if I'll return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8hwPXNzH1gyv6LcgHkRp7w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Churros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8hwPXNzH1gyv6LcgHkRp7w/o.jpg"
      },
      {
        "img_id": "Tu0SPDO1jiZ9bXaLg_gV_g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tu0SPDO1jiZ9bXaLg_gV_g/o.jpg"
      },
      {
        "img_id": "bSVOTej__AoFvHz9CgXleQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Tortilla soup",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bSVOTej__AoFvHz9CgXleQ/o.jpg"
      }
    ],
    "user_id": "A56Cmt5_UvYAL8wZS8zOBw"
  },
  "WDCd6XeHV8af6USqNKUjLQ": {
    "date": "7/31/2018",
    "text": "This was great!  The best queso I've had in Charlotte. Really good salsa: fresh tasting, a little chunky. I mixed and matched tacos and my husband got the quesadilla. We were both really pleased.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t5CB803ii-MBHrowVBywtQ"
  },
  "YFuEqUi6dnAl-lJTTE78Yg": {
    "date": "1/1/2018",
    "text": "We love this place!  Recommend the Chile relleno. Enjoy the daily drink specials, and Taco Tuesday's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45wbtGIZNi9DxIMpNVM18g"
  },
  "hfpkpyvEYqXdXsEyNNVGVA": {
    "date": "8/21/2018",
    "text": "Excellent service and food quality...I had the taco salad and added steak...the salad was very fresh and had a unique blend of veggies and house made dressing which was a nice touch! Will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t0Ti8cq90w_cCfSRz0T4mQ"
  },
  "kh0_DFnm6eKvZtcXbBxyDg": {
    "date": "12/17/2017",
    "text": "The plaice was rather small but the food and drinks were so good. Their salsa is one of the best over ever had at a Mexican restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DNDxtF_8H7nw52McSchoog",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DNDxtF_8H7nw52McSchoog/o.jpg"
      },
      {
        "img_id": "dEQL2wDsWYYgKh8dh8_I8w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dEQL2wDsWYYgKh8dh8_I8w/o.jpg"
      }
    ],
    "user_id": "J2DTTrogyWfWe4VLHVvZcQ"
  },
  "1g6ZBFr1IiZpO_8gRgd5Eg": {
    "date": "7/10/2018",
    "text": "My first time here at first it was kind of confusing the entrance, the wait was a total of 10 minutes but I was fined.  I was with good company so it didn't seem so long of a wait, once we're seated a waitress came right over and introduce her self very friendly. It was Tuesday so I had the Tuesday tacos I had a chicken and also a  Carnitas taco they were both delicious. I for sure will come again! We also had the original guacamole.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTkVvQxSbsJOfgMqxlNyuQ"
  },
  "lZIXfTime1oOxsnhtq6gpQ": {
    "date": "5/16/2018",
    "text": "Went for lunch during a work week. Busy, but no big deal. I order the three taco combo: Tinga de Pollo, Shrimp( not crunchy)  and Al Pastor. The tacos were delicious, after I pulled off the pineapple pico. The pineapple was not fresh at all, definitely from the can and looks like it was sitting out for days or maybe expired, they were translucent. I was seriously disappointed since I love pineapple (or mango) on my tacos. So if you ever come eat here, just order tacos without pineapple pico and you'll enjoy it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8m2qQakvI1FbvBI_rNweBg"
  },
  "iHgRPtrz2-_3K2UM4hNR1Q": {
    "date": "7/2/2018",
    "text": "Great quesadilla lunch special! Chicken and cheese great flavor not over cooked or dry. Typically I use a lot of sour cream with a quesadilla this was so fresh and cooked perfectly I used very little. Frozen Gold Mango margarita was delicious very refreshing on a hot day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfNxpbsgQQQQg9_yUZJuLQ"
  },
  "-W_kd0Dcew-Bpq84QXcntA": {
    "date": "8/21/2017",
    "text": "My friend and I came here two days in a row. It was quite yummy! The chips are salsa are sooo good. The first time I went I had the beef brisket and the second day I had the chicken tacos. I think my favorite was the chicken. The chicken tacos were a little too juicy for my liking but overall the flavors for both tacos were amazing!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uar1JKpYfSp1ZykxO0tpkg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chicken tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uar1JKpYfSp1ZykxO0tpkg/o.jpg"
      },
      {
        "img_id": "5HGNVcr3rUF-Bn10joWOcA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Happy hour beef brisket tacos with rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5HGNVcr3rUF-Bn10joWOcA/o.jpg"
      }
    ],
    "user_id": "r9GCW6pwOupHLw2o-K3GIQ"
  },
  "AUE22mcVw-gzgoZerLtRiQ": {
    "date": "4/27/2018",
    "text": "Good spot with fresh ingredients and reasonably priced beers. We sat outside with the kids and enjoyed the food and atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "plkIlXh9Yri3p9jPNhSIyQ"
  },
  "hVtsst4ykm3onx3JTJHxuw": {
    "date": "10/2/2017",
    "text": "This place is never too packed but don't let that discourage you. The food is pretty good. Taco Tuesday is a good value. Margarita specials on Monday. Service is always pretty good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "P5Jtg2yv9HHXNKMlXO--pA": {
    "date": "1/21/2018",
    "text": "Location is good, parking kinda of issue because it's downtown. Server was really friendly and nice. We order an assortment of tacos with shrimp, pork, beef. They were just ok not amazing. Had also a shot of tequila 9$ but was good. Would go again if I was in the area maybe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "P6X2QhcrA9dPazCFGBe1ag",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P6X2QhcrA9dPazCFGBe1ag/o.jpg"
      },
      {
        "img_id": "zi-iz92G6NgcX4BjrtrRCw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zi-iz92G6NgcX4BjrtrRCw/o.jpg"
      },
      {
        "img_id": "-2Kp4mPybr8neHZLF5FUZg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-2Kp4mPybr8neHZLF5FUZg/o.jpg"
      }
    ],
    "user_id": "AW3z25JWJ_kKfau23OGGNA"
  },
  "cDmEosyjHShjT6-rfww-iQ": {
    "date": "12/30/2018",
    "text": "Absolutely loved this place! We were seated immediately on a Saturday night at 8 without a reservation. The service was amazing, both my drink and food came out within 5 mins of ordering them. The waiter was also extremely nice and accommodating. The $6 colossal margarita was delicious and so were the shrimp tacos with pineapple that I got, would highly recommend! This restaurant is very conveniently located and there is free parking right outside. I will definitely come again when I am back in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cqQBd-hrUKpUUsesrz9FGQ"
  },
  "60b0LzR3JRoJXC9WiyjXDg": {
    "date": "11/25/2018",
    "text": "Very tasty tacos, decent service. Will definitely try this place again next time I'm in the Queen City",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CU2HLNKICTLxr2HUoCvJ9w"
  },
  "Wx1kUq6pdxf3dnuCYpMFNA": {
    "date": "5/2/2018",
    "text": "The food was delicious and service was prompt.  We ordered the tacos and they give you a option to get in a lettuce wrap instead of tortilla, which is great alternatives if you  a lighter meal after you are done stuffing your face with the amazing salsa and chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Poch8xdalLScXxZ3_PYpDQ"
  },
  "Xda3LUlO6tXQ1jisVXDumQ": {
    "date": "6/23/2018",
    "text": "Their queso, margaritas and veggie tacos were all delicious! I'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QBG7g2DJpZUjuXpqzrg50w"
  },
  "VYVdyP_h5QbI1IiibHTXEA": {
    "date": "4/4/2018",
    "text": "A neighborhood gem and my new local go to for Mexican. Food is 4 stars, but service and environment are 5+! Decent sangria, on the rocks or frozen. Try the fajitas but come on an empty stomach...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7r8WbzRjjrzYqmr_1t-Ew"
  },
  "-bwCz8hHDAjcOO33XAz1JQ": {
    "date": "5/5/2018",
    "text": "After waiting for 45 minutes around a bunch of dirty tables,we were sat. It's Cinco de Mayo, long waits are expected.  Sat at the table and watched three other tables seat after us and get served. The guy sweeping said it was probably because we had our kids with us.   Waitress lies to me and tells me she didn't know it was her table, really!? I showed her my yep check in free queso.  She said it wasn't allowed today. I said can you check with your manager? She walked within eye sight to the bar, got another table drinks, came back and told me no. Free queso via Yelp was not honored.   Salt is not seasoning, use some peppers on your food.   Bar tender was awesome during my wait and I have no complaints.   If I would have read the review before going, I wouldn't have gone at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BSOJlXE_Pu2pInvedhOY1Q"
  },
  "nTogMyS92N5asUPzE0vfuw": {
    "date": "8/11/2018",
    "text": "I love this place, really good guacamole and their fajitas and their steak nachos are amazing. Quick and easy lunch or dinner. Good tacos as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "H1KfS6qtcekKRTBINjJ4nQ"
  },
  "9nvOt-xxFMEsSF6QLTvzBQ": {
    "date": "10/28/2018",
    "text": "Not very tasty and won't be going back. The pork was bland, as was the chicken, as was the guacamole. The guac needed a little more citrus and better ripened avocado. Got really sick there after eating there - I'm thinking it was the chicken taco - I should have know it didn't taste right (and it was lukewarm).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3iSQgpbqYZ_4Uqu4pkrsag"
  },
  "bXMAxbDp-CiuRAemI5l-VA": {
    "date": "8/21/2018",
    "text": "I am really feeling this place and looking forward to going back. You can't tell me the food isn't fresh . It's definitely not your favorite Mexican spot from back home where you eat a lunch entree and some chips, and are ready to take a nap immediately afterwards...if you know what I mean? But it's delicious none the less. Lots of different flavors , different in a good way. Lots of options in terms of what kind of tacos you can get ( pork, chicken, shrimp , fish). Pricier than average lunch specials but the portion size and service make it worth it. The fresh made guacamole was bomb. Check them out .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "p98I4oAPUt2raYM3qpRttA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/p98I4oAPUt2raYM3qpRttA/o.jpg"
      },
      {
        "img_id": "p22rv_PzjmkNtMVvDJ1lAA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/p22rv_PzjmkNtMVvDJ1lAA/o.jpg"
      },
      {
        "img_id": "SIihOSlF9wiSU2brZ4trAQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Enchiladas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SIihOSlF9wiSU2brZ4trAQ/o.jpg"
      }
    ],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "_ILzBrNtlwwpMsLB7dOwqw": {
    "date": "4/13/2019",
    "text": "Definitely a great spot to grab some great tacos. The carnitas melt in your mouth and the queso has this awesome Smokey taste. I'm a taco fanatic and recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f4-1kLsQ88J1C-lPTUITXg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Corn, pick 3 tacos, dip trio, and tequila flight",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f4-1kLsQ88J1C-lPTUITXg/o.jpg"
      }
    ],
    "user_id": "AWbBBnSSTDKj6JkIVenV3w"
  },
  "C_SS_fbj2jA0vcSvrHHuhA": {
    "date": "2/6/2019",
    "text": "I've been here a few times for lunch and dinner as well as gotten take out. The food is really good. It seems to lean more in the direction of authentic Mexican food than Tex Mex. They have great specials daily. Taco Tuesday is my favorite. The tacos were good and they had a variety you could order. I've also had the nachos which are excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HIgIHTPZReQOKXkFa4boMw"
  },
  "LA29bl22c43OcYT7eeunqQ": {
    "date": "1/20/2019",
    "text": "First and foremost, I am not a taco person. So I've kinda steered clear of this restaurant for a while. I must say I was surprised that they have been able to survive in that location because it has changed quite often over the past few years. It seems as though this restaurant is finally a good fit.   1. Space/interior is quaint and the staff was nice.  2. I came with 3 other people for a double date. We ordered tacos and quesadillas. Unfortunately, my Fiancee and I weren't very pleased. My Fiancee's tacos were fairly bland and lacked flavor. He ordered the chicken tinga, the salmon taco and one other that didn't taste very good. 3.  The quesadillas were way too spicy and I specifically asked for no spicy aioli. The crazy thing is while they were spicy, they still lacked seasoning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g8D9VyTKPSnQ0nNX_M0dsA"
  },
  "ki-ESCDZSgpuAXkxlx0RRQ": {
    "date": "9/1/2018",
    "text": "THE FOOD WAS AMAZING!! THE DRINKS WERE SO SO   Fresh guacamole is always a plus!! Everything taste fresh and cooked to perfection,, the service from the waiter was awesome!! I had the Enchiladas entree and my niece had the 3 tacos choose your protein dinner. We also shared the 3 amigos appetizer. I had the Tamarid Mojito.... it was SUPER sweet and I didn't taste the club soda, mint, lime or tamarid in it so the drink gets a super thumbs down",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kTVkInc78iEHtf-vMRB7PQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kTVkInc78iEHtf-vMRB7PQ/o.jpg"
      },
      {
        "img_id": "qUL0K7b8-v2K51web4XNDA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qUL0K7b8-v2K51web4XNDA/o.jpg"
      },
      {
        "img_id": "6vVyCNK8Tl8jpKw-_2MMRg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6vVyCNK8Tl8jpKw-_2MMRg/o.jpg"
      }
    ],
    "user_id": "-liH8rFrNXXumnBj1Q2adQ"
  },
  "oEIdyiW-4LlA4Df-Rmzj5w": {
    "date": "6/2/2019",
    "text": "I ate here alone while traveling for work. The food was excellent and the wait staff were very inviting. You must try the guacamole and carne asada. So good!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8jmyJCk-LjO9o1K9UjxNA"
  },
  "bk8Hp7bR8kIpyrwQFfLRxg": {
    "date": "6/18/2019",
    "text": "Que Onda Tacos & Tequila is a nice restaurant and the tacos are excellent! The staff is wonderful and friendly and I go here very often. For me they have the best Pino Grigio that I have ever had! The Mojitos are also very good! The new hanger steak taco is off the chain! That being said the only problem that I have is the raggedy bar stools! It is very uncomfortable to sit on them with no foot rest!! I lost the feeling in my legs and feet from sitting with no foot rest and had to stand to eat my taco. I like sitting at the bar talking to my favorite bartenders Yana and Angel! Please get some new bar stools!! (This is still my favorite after work hang out though)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yzGLZEfp7Ipl529sEebvQw"
  },
  "G7I4vDjcP9sGkmzq5gKG3g": {
    "date": "6/22/2019",
    "text": "This was my second time at Que Onda and they have yet to disappoint! Their drink specials are great and the food I've had has been fantastic! The taco salad was a perfect choice after eating way too much chips and their yummy queso:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lzU8I74o73txgJ73qYniUA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Taco salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lzU8I74o73txgJ73qYniUA/o.jpg"
      }
    ],
    "user_id": "AgfXpR4rjbFRFaVQserQ8w"
  },
  "4Uka_BVdd11Z3TtzzNYxFQ": {
    "date": "5/15/2019",
    "text": "It was a great place to visit. Service was great. They were able to accommodate my date with his diet restrictions easily and the food was pretty good. And it was a lot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bhUrUkIdGW1YeKNowLfF6w"
  },
  "0h96H1X5NlK9n93rL0A-ng": {
    "date": "6/15/2019",
    "text": "Not a great restaurant at all. Rude staff and unhygienic place. The food was not good at all. They were rushing to take out the customer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M69aoLMvV3_E2ALW_psK2w"
  },
  "zc5rrjUs93tdqhzZdzixxA": {
    "date": "3/22/2019",
    "text": "Food was good! Margarita were great... the customer service & management suckkkss! Me and my friend went there our waitress was not attentive to us at all we had to keep calling her over and the other employees were staring and pointing at us! After leaving we walked past the manager and an employee was pointing out the window! We called the establishment and they were laughing like something was funny I should of just asked for refund but I will NOT return!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XtS_BJqgYmtBCnYpHBZfnw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XtS_BJqgYmtBCnYpHBZfnw/o.jpg"
      },
      {
        "img_id": "vdKvQjDkG-jqPcpbIETQyg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vdKvQjDkG-jqPcpbIETQyg/o.jpg"
      }
    ],
    "user_id": "NPIPloeQIAFHg0kW6OKnMQ"
  },
  "kVp-5RvKmLJ_KWP6xaExEg": {
    "date": "6/12/2019",
    "text": "This place was so good! My fiance and I were visiting from out of town for a concert. Loved the free chips and salsa, and the queso from checking in was a plus too. Our tacos were SO GOOD. I unfortunately only ate two of mine because I was so full from the chips, but it's been a few weeks since we were there and I seriously keep dreaming about my tacos. I regret not saving enough room to finish them",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eb6v8Sq5w7fNDgocagMUEA"
  },
  "V7pM-1RzPYDVI4_umP5H2Q": {
    "date": "11/24/2018",
    "text": "This is a quality Mexican restaurant in uptown! It has all the classics and a good menu. The queso is amazing and you can even add meat to it if you'd like! They have cheap daily lunch specials and can get you in & out quick if you're on a time crunch. Love coming here for drinks, dinner, quick lunch, any of it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "146udnwO4772RFXD1i5ruQ"
  },
  "C09YqsUDOjWSvjyaH-3-zQ": {
    "date": "5/30/2019",
    "text": "Food was good but we actually went for the lunch specials on Monday which happened to be Memorial Day is they had a limited menu. The tacos were good but they came ala carte. Chips were amazing and hot! Overall good, but a little sad we didn't get to try their regular menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2WL0-IqxJ6h9nCvusFHEPQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chipotle queso, salsa and chips",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2WL0-IqxJ6h9nCvusFHEPQ/o.jpg"
      },
      {
        "img_id": "MpbseyJIB6V00O7qAXD5AA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Pork and steak tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MpbseyJIB6V00O7qAXD5AA/o.jpg"
      }
    ],
    "user_id": "HjlZmz7JynDB9dw9n2MrqQ"
  },
  "IAIsUdPhENi9AB6XtefQaw": {
    "date": "2/2/2019",
    "text": "Absolutely the best Mexican food (tacos) I've had since moving to the Charlotte area.  Food was fantastic and service (Enrique R) great as well. I will definitely recommend this place and will be back when I'm in Uptown for games!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-XV7yuQIPXgzWfAzQxmaQQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The best tacos I&amp;#39;ve found in the Charlotte area since moving here!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-XV7yuQIPXgzWfAzQxmaQQ/o.jpg"
      },
      {
        "img_id": "f27ZaYSr3aJpuj2Ma3sxCw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. As I&amp;#39;ve done three times now, I fill up on Guam and salsa even before my tacos arrive. Too good to say no.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/f27ZaYSr3aJpuj2Ma3sxCw/o.jpg"
      },
      {
        "img_id": "NoupBYoB1mjkbtyRjiLGDQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NoupBYoB1mjkbtyRjiLGDQ/o.jpg"
      }
    ],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "_qk3z8G0lJZQTp2kqd4aRw": {
    "date": "1/14/2019",
    "text": "Came here sunday for lunch. Thank god they had regular items aside from the brunch menu. The magaritas we're ok. They serve them in a regular glass and it is very sweet. The queso dip is NOT good at all. My first chimichanga was from here and it wasn't all that because they covered it with the same cheese that's on the appetizer section. I believe the chimichanga had more cheese than the actual bowl of dip. The place is cute and friendly. I had a nice time. Nothing out of the ordinary. The prices however are really good. 5 margaritas and brunch entree and a regular menu order and appetizers all for $49.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KT_sPKQVOJGv-_aeyOFGAw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. I believe this was like $8 and it was good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KT_sPKQVOJGv-_aeyOFGAw/o.jpg"
      }
    ],
    "user_id": "B1I30dC5kVRQuZBoK5wM-w"
  },
  "eev2E3lmXaosRZzSV8KUiQ": {
    "date": "6/7/2019",
    "text": "Very good tacos! Order the dip trio!!!!! Staff were all awesome, very quick service! Great location downtown, and great interior.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ceg1j4F41s5MtYVvaQJ-8Q"
  },
  "6tjhBnc9yyoti4X3WMi4Yg": {
    "date": "2/18/2019",
    "text": "I first went to Que Onda right when it opened and was not impressed. I recently returned to give them a second chance and wow.. this place has gotten way better.   The chips and salsa are great. The salsa is very fresh tasting (not too much cilantro, either) and the chips are always warm. I ordered the steak tacos in a lettuce wrap and they were to die for. They come with great rice and beans as well.   I have always had a pleasant experience with the wait staff and the food comes out quick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ri16X8OCVaWk4VKEUFT-2w"
  },
  "EKeinY1HKrFO9BnRZMDTRw": {
    "date": "3/10/2019",
    "text": "Super good //// loved the chips and salsa as well as the rice and tacos //// lots of cool all day specials /// chill atmosphere and very friendly staff /// a nice surprise in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "esjWUTfRLIYshewnFITsvA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/esjWUTfRLIYshewnFITsvA/o.jpg"
      },
      {
        "img_id": "Gh-To44a9PCouo7DnIHFog",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Gh-To44a9PCouo7DnIHFog/o.jpg"
      },
      {
        "img_id": "ohXi-n7PqCpnhqHEkp3bFQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ohXi-n7PqCpnhqHEkp3bFQ/o.jpg"
      }
    ],
    "user_id": "bQC1r0fCmkXajMyzkuwTrw"
  },
  "1dfvbU6HuwxBaIIXEZf60Q": {
    "date": "5/1/2018",
    "text": "Is it authentic? No? Is it good, meh. Average. Maybe I am spoiled from other places but I was very underwhelmed. The prices were not equivalent to what I expected.  I went on a Thursday. I mean Mexican and $5  margaritas is particularly enticing.   Atmosphere: I loved the industrial decor and set up which is very appropriate and suits its location in uptown Charlotte. I did love the artwork that they chose to place over the bar. The crowd was eclectic and diverse in age which makes it comfortable. Apparel should be casual.  Food: Two highlights. The chips and pork tacos. They were thick and delicious and outshined my entree. I also, order the queso. It was good and I quite enjoyed the kick. As for entrees,  we ordered two. I had the mixed protein taco selection; lengua, steak, and pork. Hands down the coca cola carnitas was the superior of the three! It was delicious. The lengua was not the most flavorful and overcooked.  We also order the adobo shrimp fajita. It was fair. I expected a little more heat. But it was served with rice, beans, guac, and salad so a solid amount of food vs the tacos which had no accompaniment.  Margarita: Ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "HpISK3HEI89Rjj-3bH6jLA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HpISK3HEI89Rjj-3bH6jLA/o.jpg"
      },
      {
        "img_id": "LC9jU7DV3Q7T6HGKLFJMBQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LC9jU7DV3Q7T6HGKLFJMBQ/o.jpg"
      },
      {
        "img_id": "YgL6roOSh8-TsnS_A-75Eg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YgL6roOSh8-TsnS_A-75Eg/o.jpg"
      }
    ],
    "user_id": "Eqasd-ntQh8nMjA4R2ZdZQ"
  },
  "8rXPm_HZ7Aoftvvd5spbcQ": {
    "date": "7/15/2017",
    "text": "Very tasty food,  and not too much of an uptown premium.  Go on a weekend and enjoy the patio",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JoYal7svjNiTqy29auaLUg"
  },
  "1U8lcOS2GfwQUEv6yaeQ8A": {
    "date": "5/3/2017",
    "text": "Stayed in Charlotte and would walk by this place everyday. Has great mexican skull decor so it caught my attention. Went in and was greeted by very friendly staff. My coworker and I ordered Micheladas, for those of you who know what that is, Do Not Order That Drink here, it is terrible. My coworker couldn't drink it and asked for a Corona instead, and the server was very nice and understanding and brought him a beer instead. The food was excellent, we ordered the Enchiladas Suizas. Soooo good! I love fried plantains, and they serve those too, SO EXCITED!! HIGHLY recommend this Mexican food joint, you won't be disappointed! Almost forgot, the chips and salsa are complementary and they are excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Lh4Mg1cmARMmKzaDrjpHg"
  },
  "Kt9tsanJ0iQ5ewetk0E2cw": {
    "date": "2/5/2017",
    "text": "This relatively new place that has potential. Mexican cuisine is of personal taste, and my wife and I thought the taste and quality was good. A few unique dished are offered on their menu. We first started out with Grilled Chicken Nachos. They forgot the Chicken, but rushed the dish back and added chicken. Not sure that is compliant with Government Food Regulations?Chicken was very bland and Nachos very average. I'd probably choose something else to start.  Their stuffed Poblano Pepper dish was one of the unique flavors I sampled, which I'd qualify as great. My wife ordered simple Ground Beef Tacos. Beef was very bland. Sounds like an easy dish to prepare, but the kitchen managed to struggle serving the correct meat. She is a simple foodie and doesn't eat much meat.  She was totally grossed out when she found several chunks of pork in her \"Ground Beef\" tacos after finding one in a bite.  Server, manager and kitchen handled very professionally. That's why I gave them an above average rating.    The Mojito was the best we have had since discovering them in the Caribbean years ago. My wife is also a TresLeche fan, and it did not disappoint. Give this restaurant a few months, and they'll be a solid 4 Star rating restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AB866tUuEJdgHh_4CjG9PA"
  },
  "_4KBHLa5olE_ZlFTtzc4qQ": {
    "date": "2/27/2017",
    "text": "Been there once and the tacos were delicious. This is a great new addition and definitely better than what was once there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKVXUQ_N5PUNOIaQewdZcg"
  },
  "t8Xp_Sl3mHOCsGZMBDznwg": {
    "date": "5/17/2017",
    "text": "This was a great place. Spanish music mostly NOT Mexican but Spanish overall. They found a spot for us right away on peak time. Food came out pretty fast and it was delicious. The mojito/ passion fruit was very tasty. I was a bit disappointed that the lemonade had more ice than juice but is not enough to take a star away. Great environment even though I went with my family/ kids. And yes they do have people that speak Spanish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oonsUd-pWljjgxO-i23TLg"
  },
  "PY3aWfsy14ejbdHmwX90Zw": {
    "date": "5/16/2017",
    "text": "When you enter Que Onda, you immediately feel like a part of their family. Hands down the best margaritas in Charlotte, and I'm not exaggerating. They are very open to feedback and will try to accommodate your requests. The only thing that can compete with their margaritas is their salsa. Their salsa Verde is amazing. Say \"hi\" to Mario, you won't be disappointed here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tkwwDe6pkkUHHzGf-2UiKQ"
  },
  "Omav-Us8PhJV3ODgK67pHw": {
    "date": "1/26/2017",
    "text": "Loved the atmosphere. The colors and paintings were perfect for this kind of spot. Now to the food.... so I got the tacos and mixed it up.... the fish taco was pretty good the fish was crispy and flavorful... the steak was really good my only complaint which actually isn't a complaint for me b/c I like salty but the meat was very salty so the avg joe it might be a bit much. And the braised beef was really good n tender along with the steak. The quest is so n the chips are made fresh in house so they come out nice and warm and have great flavor. Will be back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UKJ8rZD0Cpo--9DY1WxMXw"
  },
  "yDFtlr2JjiBNtkP99Yw6NQ": {
    "date": "5/12/2017",
    "text": "DANK the service was phenomenal I have never had a more delicious taco + drinks are even better",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJVi7o1qWk_eJseeEzBO9w"
  },
  "0AMEATHsP31my7fejLDtag": {
    "date": "11/27/2017",
    "text": "This is one of the worst Hispanic restaurants I've been to. Service was terrible and the food was terrible. For dessert I ordered a tres leches and the cake was stale when I told them the waitress she just looked at me. Never coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3LUQLNM1YoF_BmuYwluoxQ"
  },
  "2I2JbI7znA1EKMc0yxzBXw": {
    "date": "12/27/2017",
    "text": "The service was great and everyone was extremely friendly. I revived great suggestions when ordering. The food was pretty good. I'm use to more authentic food but for I can say this was pretty close to it. I am definitely coming back !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EcHbdZW4UARJyRz9PrLL5Q"
  },
  "jJRRSL8TjTJSbUMwBaGMfw": {
    "date": "11/26/2017",
    "text": "The decide in this restaurant is definitely fun and there menu sounds good. The chips were outstanding. The house salsa was a roasted variety that was mild but not unflavorful. We ordered the 3 Amigos dip assortment and two salads for dinner. A taco salad for my husband and I had the Que Onda salad with salmon. That's where we started having issues... the queso was remarkably un-cheesy, but not unpleasant and slightly spicy, slightly. There quac was bland and nearly tasteless and the pico was eh pick no spice. The taco salad was described by my husband as 'eh' nothing special and not particularly flavorful. My salad for being the signature restaurant salad was pretty, full of fun stuff but entirely flavorless. Really flavorless. The salmon was fine although I prefer it without the skin on. It was a pretty small piece for the $5.99 up charge. I didn't even finish the salad, the dressing was there but I literally couldn't detect a flavor to it other than nothing the light oil. Very disappointing experience. We had tried Cantina 1511 the previous night and it was significantly better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1bhL6CNfb3DGzXZ0_FV_Q"
  },
  "GC9Svg7FUeOgZDEzHQX7rQ": {
    "date": "4/18/2017",
    "text": "Loved everything about this place! Our server was very friendly and quick. We had the guacamole as an appetizer. So fresh and tasty! I had the fish, steak and pork tacos. Loved them all!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "363ZTO7j-9z-EJM2ZVq5Xg"
  },
  "jvWwqI3T7j3jzFyBY01I7w": {
    "date": "2/4/2017",
    "text": "It's about time there is a good taco place on town.  The steak tacos are amazing, I refuse to get anything else.  I highly recommend this place to anyone in need of some tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5kIn4LgMNYHa5hL4USgwLA"
  },
  "V6CSHv8o36hCqrRTF9dtzQ": {
    "date": "3/18/2017",
    "text": "Went on a Saturday night and received great service! The food was delicious (LOVED the queso)! I did not try any of their drinks, but will definitely be back for a margarita and tacos! The daily specials make me want to go everyday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M37OO9vNtIgkwFjrVFzp0g"
  },
  "0oi9uMNMpqdWdTVvcMyoQQ": {
    "date": "11/22/2016",
    "text": "Was hesitant to check this place out after only a week of being open, but glad we did! Service was fantastic, the food was delicious and the drink specials were an added bonus. Much needed taco spot on the immediate outskirts of center city - a way better option than Vida, in my opinion. Will absolutely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h5FypTxyN_nHePtKPl6JYQ"
  },
  "XUkstl7AohdvjcfnWUK0-Q": {
    "date": "12/14/2016",
    "text": "Muy caliente ! This place is amazing, great new neighborhood authentic Mexican place with a modern twist. Killer food, great lighting, server is out of this world. 10/10. Charlottes best gem, Martin was the best server",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dXEzBA8ELGGbVmhwdN-IWA"
  },
  "hcSURjZ_W5RDZnONJXmeYg": {
    "date": "10/13/2017",
    "text": "A solid 4 star place.  I have only been here once and sat at the bar.  The place was crowded and loud, which didn't bother me much as I was alone.  They had a nice local beer selection and provide chips and salsa which both tasted fresh.  I mixed and matched 3 tacos:  one pork, one grilled fish and one crunchy shrimp.  All were tasty and very affordable.  You get a lot of bang for your buck here.  I will definitely be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYz8AyS7psKC8mco4okO1w"
  },
  "Ld3w12V8VxqVunMkCSmq0A": {
    "date": "11/26/2016",
    "text": "Tried Que Onda tonight and loved it! Our server, Martin, was fantastic. Knowledgable, passionate about the food and restaurant, and really nice. Great service.  The food was delicious! You can easily tell the time and care it took the prepare that meat perfectly and deliciously. I recommend the beef tongue tacos and Coca Cola carnitas tacos.  Oh and I had the best mojito ever! Perfectly balance between rum, citrus, and not overly sweet. Aamazing. Seriously can't wait to go try more food and drinks there. Hasta luego!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWYwrDl5oC21eVjXqk2MYQ"
  },
  "0StCyg659-zdepufDG8gzw": {
    "date": "12/19/2016",
    "text": "The tortilla chips were very good. The salsa tasted a little barbecue sauce-y, not spicy. I wasn't a fan but a friend liked it. Tried the empanadas as an appetizer which were pretty good (good crunch) and had the torta which came with chips (was not crazy for the chips). Food was pretty good but not amazing. The meat could have used some more seasoning. The service was good and fast though and the server was super nice and helpful. Looks like they have some good drink specials on some nights and $10 lunch specials. Worth a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G-p-fxTux0jDYP0wGvhOxw"
  },
  "ezMBnGxO9MeQ4qoHDXf7FA": {
    "date": "8/8/2017",
    "text": "This place is trash. There wasn't anyone in here when me and my friend stopped in for lunch. It took 10 minutes just to get water and we were sitting at the bar. The queso is made from a package, the salsa tastes like burnt tomatos, they upcharge for flower tortillas and offer no taco Tuesday with flower tortillas. So if you don't like corn tortillas you're screwed and getting taxed. The tacos are expensive and small. Don't come here while you still have the chance.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DrX7r7zGjGlt36y9vN6cXw"
  },
  "Wn8uLvkbJqbmH0sSc1sCjA": {
    "date": "2/27/2017",
    "text": "I created the account in yelp to warn all my neighbors of Que Onda. I live in the neighborhood with my wife and two growing children.  Firstly, there is a lack of profecionalism in the wait staff, the food was bland and over priced. We had the tree leches cake for dessert; it was dry, tasted like it was in the fridge uncovered for days. That night; my youngest and my wife suffered a great deal, it was maybe an hour after supper that the digestion problems began and persisted all night long. I blame the tres leches!! Take care y'all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZBRKO-3t7lMNODcMUDPahw"
  },
  "ojj3tBYyY4fTE1X2oVlmNQ": {
    "date": "5/10/2017",
    "text": "Best street tacos. Good service, I got the Grilled Steak Street Tacos, modified - no cheese. Unbelievable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KK29VeXhGfS7RD_FDXs9rQ"
  },
  "JjWi8KWpN3UW75FgFxqBlQ": {
    "date": "1/25/2017",
    "text": "EDITED TO ADD: I have to say I'm blown away by the fact that the owner responded to my review less than an hour after posting!!! That in of itself tells me great customer service is as important as the GREAT food that's offered at Que Onda. Therefore I feel 5 stars are more than deserved, new businesses experience small issues just as we saw last night. Clearly the owner/s are on top of doing everything to make things right and that alone says a lot!!!! Opening a new business is NOT the easiest thing to do and often \"takes time to work it all out\", it's clear that's exactly what these folks are trying to do!! I promise if you give these folks a try you won't be disappointed in the least!!!!!! We've been twice in a week, so needless to say the food is Great!!! So our first visit was beyond wonderful as well as our server. The salsa is very good as is the cheese dip. All this to say our second visit is the reason I can't give 5 stars. The food was still wonderful as it was the first time except......my three soft tacos all had torn shells. Torn so much that it was impossible to pick them up to eat. That's such an easy fix, you know the person preparing them noticed the shells in that condition. There's just no excuse for suck lack of attention to detail especially being a new place. I'm not sure if the cook was new or not feeling well as my plantains were horrible I took one bite. They weren't crispy as they should've been as mushy inside. Our server tonight noticed I'd not eaten them and had a lil chuckle when I said they weren't good. The other issue tonight was the refried beans were beyond cold.  I hope this is just growing pains for them and a sign of inconsistent food quality. I know we'll give them another try hopefully everything will be as great as our first visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eFXTD5FIeAdzPngNPgZPjQ"
  },
  "yirxaIBAK1Lqv7QV1JluJA": {
    "date": "5/5/2017",
    "text": "This place is super trendy, which means there might be a wait, granted I went on cinco de mayo but I imagine this is not unusual. Cocktails were much better than usual bars and very reasonably priced. The traditional guac was some of the best I've ever had and I've been to Mexico. Tacos were great too, don't fill up on chips like I did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y_M-zHz_bN0otr4rjJl-sA"
  },
  "cR7o5Tw-NtOMpRta7RVTRQ": {
    "date": "1/1/2017",
    "text": "Visited Que Onda on a Sunday evening. The waitress was very attentive. Started with the dipping trio: guac, pico de gallo,  and cheese dip. It was fresh and tasty. For my entree, I ordered the Mole Enchiladas. Let me just say that I've had Mole Enchiladas before and this did not taste like that at all, and not in a good way. I couldn't finish eating it; it didn't smell or taste pleasant. However, my boyfriend had the carne asada and that tasted a little bit better. Overall, this place is just OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ImGZvioZg_6ovvdhR63GSQ"
  },
  "U1wIHhMhA-USRgLIJZtdFA": {
    "date": "12/27/2016",
    "text": "I had no idea this place was even here until my boss mentioned it.  We got to go orders, she got tacos and said they were very good. I got the chicken milanese torta and chicken tortilla soup.  The sandwich was very nice, crisp but moist chicken, avocado slices.  I'd get it again, the soup was not terrible but it was a bit grainy and no tortilla chips to crispy it up, so might not far that again.  The potato chips were of the bagged variety, so bagged chips and grainy soup makes me give 3 1/2 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AXPBTFtiHtHtJOIFq5GL4g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AXPBTFtiHtHtJOIFq5GL4g/o.jpg"
      }
    ],
    "user_id": "C9_c1gDCIsfYlKP1CGLRog"
  },
  "pss80AY2xoyLGmn0bAV9hA": {
    "date": "7/18/2017",
    "text": "Easy to get in - Free cheese dip with a chekin, which was cool. Tasted like it had smoked gouda in it - which I loved. Shrimp tacos - all good except seemed like canned pineapple tidbits on them. Good but tidbits from a can? Correct me if I am wrong here. Got there for Tuesday specials  $3 tacos and a deal on Dos X draft, Waitress killed it - great job, chips were awesome, guac was awesome. For me - it was sooo loud in there. They have this odd, center room speaker array that is just hard to deal with combined with the ambient noise of the place. We could not talk at all at the table without yelling. I'd go back for sure. Cool place, good food, nice specials and I like the concept and name. Reminds me of that Beck song which we always liked....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sI_XU4Lb2G5w106aFDkvpw"
  },
  "eC0ER62DtQbSSYRGP91hZA": {
    "date": "7/12/2017",
    "text": "Not many mexican restaurants (if any) in the area so this is such a great addition to uptown Charlotte. Casual and cool vibe. Excellent service and food was so good. Both the queso and shrimp tacos were off the chart. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DnHJTg3zlx0Lf49zxjIDWw"
  },
  "sOFw1H5TTTwMnBRt8f6_1g": {
    "date": "5/18/2017",
    "text": "Passed this spot a couple of times, wanting to try them out. One thing to know about me is that I don't play about my tacos. I was pleased when I got my order, I ordered  the al pastor tacos and my girlfriend order the baja fish tacos. Everything was pretty tasty the queso dip was really good, I just wish the pineapple salsa was more salsa then pineapples scooped out of the can sprinkled on top. Also I wish that it came on a flour tortilla, instead of a corn tortilla (which I'm sure you could switch out if requested) Overall I would give them a 8/10 I didn't get try any margaritas, but it did look like they had weekly specials, and I like how your in the heart of downtown Charlotte, so I can imagine how busy it is on a Friday or Saturday  with everyone coming out. The overall appearance of the restaurant I liked and the pricing was good. I'll definitely try them again, but definitely not my go to taco spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yxioIKtNHq-o8fGYb9zEWA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The Al Pastor tacos and one Baja fish taco that I traded with my girlfriend",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yxioIKtNHq-o8fGYb9zEWA/o.jpg"
      },
      {
        "img_id": "sbqWCHJhqus2G_CT7xpKsw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sbqWCHJhqus2G_CT7xpKsw/o.jpg"
      }
    ],
    "user_id": "PuSK3rHndAbJKLbTBJOgtg"
  },
  "i7CUJOE63obRNaAwzCk4aw": {
    "date": "12/15/2016",
    "text": "So very yummy!!! Mary was awesome!! Definitely will be back next time I come to Charlotte!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fjxxH6IpzQbM4E6mNLz-Zg"
  },
  "avZeNi335RPZQcRfg4lMyw": {
    "date": "8/31/2017",
    "text": "Had Lunch there last Friday and it was awesome! The tacos for lunch are a great deal. My brother had the Chimichanga with queso all over the top and was amazing. I saw some nachos on a skillet and that is definitely for my next visit. Also heared Taco Tuesday is great there. Cant wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RzUPlEgeJh-Ch0Oi8Jxg6w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Tacos and Chimichanga for Lunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RzUPlEgeJh-Ch0Oi8Jxg6w/o.jpg"
      }
    ],
    "user_id": "d20uUb_km5YJ2tZkS-VLOw"
  },
  "DFj2_-OHK8jMkPZ8ATDFyg": {
    "date": "4/7/2017",
    "text": "The tacos were great. We went in after much of our group had been drinking and the waitress was a good sport. The food was quick and the portions were huge. It's a little cramped in there but I love tacos so I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvHtJ5aK7AvUfcCyfgrZhQ"
  },
  "TBfKOZ1bBgs28OW99iT3mQ": {
    "date": "3/1/2018",
    "text": "Loved this place. With the uptown location, one would expect the prices to be pretty steep. But this place was pretty reasonable. The fire alarm went off during our meal but they were super gracious and friendly and even offered to remake our meals when we were cleared to reenter the restaurant. Salsa and queso were on point! Tacos were larger than most of the street style tacos places are serving up. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VdFPapSzzjrQMWyunl7qZw"
  },
  "4hTbk2h7YAvnlf5ddtFP_g": {
    "date": "4/2/2017",
    "text": "Girl just go here!! Get the guacamole, any taco you want because they are all good and a house margarita and you'll be on your way to a great dinner. Staff is super friendly and attentive. Very happy that this location found a good restaurant! I really need this place to stay because I need tacos",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-iPzwyP4p6rEoFVKrefxA"
  },
  "o3il39Pj0ei9k6eyv2VBZA": {
    "date": "12/6/2016",
    "text": "I went to Que Onda for lunch with a friend on a Sunday. It was pretty empty inside, and the service was a little slow. Most places uptown were closed at the time so I'm glad they were open and I'm guessing there was just a little less staff than usual.   We got guacamole, which they make at your table. It was excellent. I also got the steak quesadilla as my meal and although it is an appetizer it is definitely enough to be filling. The quesadilla was pretty good, and the side of fried plantains was delicious.   I really loved the decor, and it had a great local atmosphere. I wasn't super impressed, but I would go back (the taco menu looked delicious) and its definitely a solid lunch spot option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7gO0BhOdW2867lCfTGJkNA"
  },
  "5tdK0nOgfbF1nV3K1AtkwQ": {
    "date": "6/21/2017",
    "text": "Uptown needed a great Mexican restaurant and finally they have one. The guacamole is the best. They have great drink specials during the week. Also every time I come in there I order something that isn't on the menu and they make it with no questions asked. Great price for an uptown restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jf9ruLzQLYKbFN2aMnEmiQ"
  },
  "yclMMbt1HcncQwzcXaqciA": {
    "date": "3/27/2017",
    "text": "Wow. This place was recommended as the most authentic Mexican by a man who spent 17 years in Texas. He insisted that we try it and we did! Luv luv! Thanks Dane for being an awesome server. We recommend getting the tacos and mixing it up! Also the guac is delish! And and and. The skinny marg is fabulous!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67x5UNjbqvdEHtVSxynmyQ"
  },
  "b_6GFlpe2HQjIanWSUV2Hw": {
    "date": "9/16/2017",
    "text": "I don't write many reviews but felt compelled to say how awesome this place is. I've had all the tacos and everyone has been great. I can't believe how stuffed they are for the price. Not only does this place have the best tasting tacos, they are also the cheapest. Went to Vida Vida the other day and paid more for less. This place is a hidden gem uptown",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxddyx3_Dpbo2yzLN_NmFQ"
  },
  "AzGJ8Pal4W4mP-X39dvDSw": {
    "date": "3/1/2017",
    "text": "I absolutely love trying places that contains Tacos and Taco Salads. They have a nice vibe in this place and the waiters and waitresses are sweet. I'm sure they make their own nachos and salsa, because it's taste freshly made. I ordered a taco salad and a skinny margarita. (I was recommended to buy this Margarita since this was my waitress favorite.) I must say I've had a better taco salad because it was a little salty to my taste and my skinny margarita definitely had too much of an alcoholic taste.  The one thing I did enjoyed the most was their flan. I'm sure I'll come back another time and try this place again, but maybe next time I'll get tacos instead.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "726o7MhWq9mxHmT2oAbSeQ"
  },
  "yRz-_WiMlsgoKIOHUmRxHg": {
    "date": "7/17/2017",
    "text": "I find this place overrated. The tacos really lacked the freshness and flavor I expected, which stems from OK ingredients and a lack of spice (for flavor, not heat.) I guess I expected more from a place with Tacos in the name. The queso was sub par- salty, flavorless. The atmosphere is fun, and the guac's alright. You'll have a nice time here, just don't expect to be wowed by the food",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u2mtwnDkzEjLGqHVgkJKKQ"
  },
  "kjLL3bTlXRNLcfE1vHK7AQ": {
    "date": "6/18/2019",
    "text": "Oh my worrrddd! My new favorite Mexican Food spot! Stumbled upon this gem when looking for drink specials on a Tuesday night! Definitely got more than what we originally came for! There's specials EVERY DAY!!!! Like whaattt!!!! Winner!!! The carnitas and chicken tings tacos were sooooooo flavorful!!! Also the quest was the best I've had!!! I will definitely be back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T3VZQz8JzzkVyMkrxmwViw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T3VZQz8JzzkVyMkrxmwViw/o.jpg"
      }
    ],
    "user_id": "Om_HXiKg37qOdLQkNr_2bA"
  },
  "OS1w6vTM4XLAJwvifjkPPw": {
    "date": "8/5/2018",
    "text": "We had a great experience last night at Que Onda!  We were going to a Knights game, and decided to walk over here to grab some food before the game started.  We came on a Saturday night, and it was $6 colossal margarita night!  And they were colossal and DELICIOUS!  So good.  Each night they have different specials, so check it out!  I also noticed that they do daily lunch specials as well.  Chips and salsa were banging, as well as their cheese dip!  If you like spicy, be sure to ask for their spicy sauces/salsas.  SO good and so homemade.  Their traditional salsa is also great, and pretty mild.  I enjoyed my chicken fajitas, they were awesome!  My husband got the Cuban Torta (he loved it) and friends with us got el pastor tacos and loved them too.  If you're in the area but sure to check it out!  Also worth the drive if you want a \"nicer\" Mexican experience than most.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zKSIeHutw7UWL1Rl5YcoOQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chicken Fajitas!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zKSIeHutw7UWL1Rl5YcoOQ/o.jpg"
      }
    ],
    "user_id": "HZc-l7hEkl0SIqCH8swQtw"
  },
  "5w3W7pcJGERe7cdsmGhefQ": {
    "date": "7/23/2019",
    "text": "Ordered lunch to go- chips and salsa, sparkling water, refried pinto beans, and the Que Onda Salad. I took it back to my office to find that they didnt give me chips and salsa, or the water, the pinto beans were whole, and the salad was very underwhelming.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VQDI1SenFQn0N7jcG-jB5Q"
  },
  "EyD2LrmnntBrRIFvXEL9gg": {
    "date": "7/21/2019",
    "text": "Amazing place! From the fresh homemade salsa and chips to the entrees the food is superb! Location is amazing next to the sports venues and the staff are excellent! Salsa chips and drinks always full and wait staff always made sure I was doing good. Even impressed that ownership is actively working in the restaurant to ensure top notch service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gHIf6oQpw50q8LFr_1vzSQ"
  },
  "ch1WT19NM7Ia0Xu-uphjrg": {
    "date": "5/8/2019",
    "text": "Reasonably priced, great food, and good portions. We had plenty of leftovers. Their margaritas were big (served in a tall soda glass) and delicious. I can't think of a bad thing to say. Service was great, and it's in the heart of uptown. Will definitely be returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R7UgZoBBQuffgQiKlgAucQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chimichanga, skillet nachos, and tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R7UgZoBBQuffgQiKlgAucQ/o.jpg"
      },
      {
        "img_id": "XL-6T-nwKlS8D9CnzKEpjg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XL-6T-nwKlS8D9CnzKEpjg/o.jpg"
      },
      {
        "img_id": "hzniIzzA5vF_a43lSQy1Sw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chimichanga Burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hzniIzzA5vF_a43lSQy1Sw/o.jpg"
      }
    ],
    "user_id": "BifmW6A70mvRDpPc-wIfmQ"
  },
  "SkjWJwzCJ61pqW2fps9iYg": {
    "date": "4/21/2019",
    "text": "We had a GREAT experience with our 3 kids last week. GREAT food, Great service at that time so we went back again this weekend at same time.  Our teenage son had a sandwich with him so the first thing they told us was that he could NOT eat with us his sandwich. We asked for kids options and they told us they weren't any. (Which is weird since last time there was.).  It was not what he said but the lack of tact and customer service he did with. When we asked to talk to manager he, Miguel, said he was manager. He said that we should have asked before eating there. He also said that we should know this. There was no empathy felt.   He lost repeat customers.   Unfortunately we left feeling unwelcomed and disappointed.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JkRXJhJubHO_jGIS8gzPqw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JkRXJhJubHO_jGIS8gzPqw/o.jpg"
      }
    ],
    "user_id": "wnnnkSW35a9vkEblrZnP8Q"
  },
  "TyfwL04Q3ERDKK1-gccrJg": {
    "date": "4/22/2018",
    "text": "With a name like \"Que Onda\" simply made me want to stop by and check this joint out. There are so many eating options in DT Charlotte and I'm sure they were all good, but I'm always drawn to eating my beloved Mexican food. I was well pleased with establishment.   Decor-loved Mexican artwork on walls, it wasn't like all Mexican joints trying too hard to capture Dia se Los Muertos and other skull art. This place was unique in its paintings, it had corn and other cool unique studs not just skulls and hipster art.   Service-was good, nothing overly positive but up to par.   Food- chips and salsa were good. Chips perfectly crunchy and not oily at all, salsa fresh with a hint of spice. Shrimp cocktail was good. It had jicama, which I had never seen and had good flavor. It was also rather large dish. Chicken Tortilla Soup was well put together and had all the elements I'm jaded to having in a soup and was also a large portion.   All in all, next time I'm in Charlotte, I might be tempered to come back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "W8iAIRauI8ESCJjV2zdcDA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Cool paintings.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W8iAIRauI8ESCJjV2zdcDA/o.jpg"
      },
      {
        "img_id": "v_QYudv2CCMrVHWjKm6qpw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v_QYudv2CCMrVHWjKm6qpw/o.jpg"
      },
      {
        "img_id": "5FcinYOE9GtqUotOwTE2yA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chicken Creamy Tortilla Soup-I really liked this soup and also larger portion then I expected.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5FcinYOE9GtqUotOwTE2yA/o.jpg"
      }
    ],
    "user_id": "KgsfVkhgWtSYL-0_us9Jfg"
  },
  "Z1Vg1y2bbyd37kt0hJGuXg": {
    "date": "4/30/2019",
    "text": "Great food! Nice atmosphere. Taco Tuesday $2, craft beer $3! Great service and. Location!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zwATM-nov4oe6gZcg3vpfA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zwATM-nov4oe6gZcg3vpfA/o.jpg"
      }
    ],
    "user_id": "RTRI3RuHkgwqP5yasvKK5Q"
  },
  "NkM3t0aAf7bfGrcceLpIaQ": {
    "date": "3/28/2018",
    "text": "Aaaaaaaaand I just had it.  My first bad experience at Que Onda.  I'm sad to write this but I think it's a big enough deal that people should know.  They do have black beans.  They won't heat them up for you, even if the place is only half-full and you want it to come out with your regular meal which takes 30 minutes anyway because, \"the kitchen is too busy to microwave them; you can only order them cold.\"  I've ordered all kinds of crazy things in the past, including hold out stuff, swapping ingredients, and making special drinks.  I've never had anyone say anything like this to me before.  And this before not getting my actual meal to me until I've asked for it more than 20 minutes after the rest of my table got their food.    Excuse me, Miss, did that table get my meal?  Yes, that table, that seems to have the special order that was like the dish they ordered but they seem to think was made incorrectly--probably because it was made to my custom order...  No?  You don't think that you accidentally send my special order dish to the wrong table that ordered the same dish without the special order and now that they've taken a couple of bites are sure that this isn't the dish they ordered?  Huh.  That's interesting.  Well, where is their dish?  Is this it, the one you hurriedly brought out to me now that I've reminded you that I did order with the rest of my table but not a dish that clearly isn't mine because it's just the normal version of the dish?  No?  It's not?  You're taking it back to the kitchen and then half a second later bringing it to the other table?  How very interesting.  This was pretty sad.  We'd had two fabulous weekend in a row here, and then this.  I have to say, the plantains were still fabulous.  But that's not dinner.  I want my dinner.  And I want you to be willing to nuke my black beans.  It takes a minute.  I know you can make a minute.  I don't want your attitude.  That takes more than a minute, for some reason.  Why is this?  Maybe the answer is don't go on Friday.  Saturdays?  Always awesome.  Sundays?  Fab-o!  Friday?  Strike!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "eqtEDyqn1kCXwlo2OKdW_Q"
  },
  "rGAa2L3I1B5lsdtyIeUxEw": {
    "date": "4/3/2019",
    "text": "To start off with, the location is excellent, it is right in the heart of uptown. The staff was very professional and friendly. The overall upkeep of the restaurant was very clean and there was no wait when I arrived. The server was super nice when suggesting what items to have. The food was very good comparing to the other Mexican food in Charlotte. The prices were reasonable and overall it was a very good experience! We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IXmM9-07I49blmonE5T1Lg"
  },
  "TfMz_5wz9jUgTnuRfzDtCQ": {
    "date": "6/8/2019",
    "text": "Chilaquiles are one of my favorite dishes when I go to any Mexican restaurant so I always like to try them out and see who does them the best. These were a little bit fancy yet they still had an amazing authentic taste. I got the small portion which was placed on a small skillet with a layer of refried beans at the bottom of the nachos which were covered in a delicious green salsa with Mexican cheese,radish, onion and an egg on top over easy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uSK_tZUWURH5Q7d2w_-_IQ"
  },
  "4N7kY247W42UiMNUMDorvg": {
    "date": "10/9/2018",
    "text": "Out of all the places I visited on my weekend trip to Charlotte, Que Onda was my favorite! We started with the Guacamole del Mercado, which has cotija cheese, bacon, corn and pico de gallo mixed in. Best guacamole ever! The add-ins really kicked it up a notch for someone who wants to be adventurous but they have a classic guacamole as well. They have an impressive drink menu that boasts several types of margaritas, and an entire menu dedicated to just tequila! You can even try a sample flight of tequila, either horizontal or vertical. I had a margarita and it tasted so crisp and fresh. I got a taco combination as my entree; I chose Al Pastor, grilled steak and Alambre (my favorite). This place has a great menu, everything was presented/plated well, and our server was absolutely fabulous! I will absolutely be back here on my next trip to Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zuRN6_nNpZ6ZN7WmqbeqGA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Tequila menu, featuring vertical and/or horizontal tastings.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zuRN6_nNpZ6ZN7WmqbeqGA/o.jpg"
      },
      {
        "img_id": "0695JVdlJoGNI2C9I3A7vw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Al Pastor, Grilled Steak, Grilled Hanger Steak Combination of Tacos.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0695JVdlJoGNI2C9I3A7vw/o.jpg"
      },
      {
        "img_id": "zdujpjqDKdgLejcZjEwHUQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Outside Que Onda.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zdujpjqDKdgLejcZjEwHUQ/o.jpg"
      }
    ],
    "user_id": "zs9LAG_KBUMh9WIPU7UhAw"
  },
  "2xgs_i2pcUY-eYo0wu0wew": {
    "date": "10/7/2018",
    "text": "Been here twice and really like this spot! We sat out side both times on a Saturday. My man gets tacos and I got the mole enchiladas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TyBx7Vuhec2JGH_hAj10rA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TyBx7Vuhec2JGH_hAj10rA/o.jpg"
      },
      {
        "img_id": "YOxNyJhOJPtvhrfezo9Fuw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YOxNyJhOJPtvhrfezo9Fuw/o.jpg"
      },
      {
        "img_id": "vAL5XVPXCM7i4QtNeSx73Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vAL5XVPXCM7i4QtNeSx73Q/o.jpg"
      }
    ],
    "user_id": "bmnRyk630Vn7W_vpwNDhiQ"
  },
  "k4oCdCWEaO0JHn_MHD8hpA": {
    "date": "1/12/2019",
    "text": "On January 8, 2019 I had the pleasure of dining with Que Onda Tacos. Yes, a Taco Tuesday!!!! I ordered 2 tacos the Chicken Tinga and Ground Beef. I'd have to say the Chicken Taco was really good and tasteful. On the other hand, the Ground Beef had no flavor. I also didn't like the fact that the beef was served as 2 or 3 balls on my Taco. Personally, I like my beef separated throughout Taco. My table ordered Guacamole and it was really good, I'd order that again.   Our server was very pleasant and familiar with the menu which made for great service. I'd dine here again, but just try something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y5bo8kpwWVTRs3RDgNz8Lw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y5bo8kpwWVTRs3RDgNz8Lw/o.jpg"
      },
      {
        "img_id": "SWXr2xc3_VCXG2HaLUl8yg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SWXr2xc3_VCXG2HaLUl8yg/o.jpg"
      },
      {
        "img_id": "rUQ2EagQFvjKLCJgrUoXxw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rUQ2EagQFvjKLCJgrUoXxw/o.jpg"
      }
    ],
    "user_id": "oEeFuvWWRgxOuQzuxiXRHg"
  },
  "mKryRcgClAKJ5dJfvsiMXQ": {
    "date": "8/27/2018",
    "text": "Solid spot for Mexican food in Uptown. They have a nice little patio (dogs welcome), daily specials and an expansive tequila selection. The complimentary chips and salsa are very good and I'm also a big fan of their queso. Tacos come with 3 per order (you can mix and match) and are a good size. The Que Onda salad is also very good- I love that it comes with jicama for some extra crunch. I am not a fan of their chicken tortilla soup as it is cream based. I order the skinny margaritas and they're good, not great (I think they go a little overboard with the agave or whatever sweetener they use). Service each time I have visited has been quick and friendly. Definitely worth a visit if you're craving Mexican!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iZK2MXsSe5o94GI8tre25Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Pups on the patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iZK2MXsSe5o94GI8tre25Q/o.jpg"
      },
      {
        "img_id": "hjCVjFmsdJhQtpY-REp73Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Steak tacos- 3 per order",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hjCVjFmsdJhQtpY-REp73Q/o.jpg"
      },
      {
        "img_id": "w6hSefWT0UvJIvNVZafNWA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Skinny Marg &amp;#34;La Flaca&amp;#34;",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w6hSefWT0UvJIvNVZafNWA/o.jpg"
      }
    ],
    "user_id": "4UHBndk1j0GsN6NOStpAdw"
  },
  "d3X6SDety6d4AgJmM0ZM8Q": {
    "date": "9/20/2018",
    "text": "WOW.  Went here for lunch with my team (total of 6 of us).  We arrived shortly before noon and the restaurant was pretty much empty so we were promptly seated and serviced.  Ordered from the lunch menu - the taco meal.  Food came out quickly.  I enjoyed one chicken, one carnitas, both in corn tortillas with rice and beans on the side.  Presentation was adorable - a little slate type slab with taco holders and rice and beans in separate small bowls. The portion was enough for lunch and wow was the flavor great! The chicken tinga did have a little kick to it, but not too much, although I like spicy foods.   The tacos were a little full to pick up and eat so I ate some of the filling first with a fork, but after that they were easy and the tortillas stood up to the juice from the meats.  Highly recommend this place and I will definitely be back with others and hopefully next time order a drink (or two)!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nMrFw9eJ1xk4FRuV9Wl72A"
  },
  "hGIrru1uySJazc8fsO673A": {
    "date": "9/18/2018",
    "text": "Worth it to go here on a Tuesday for $1 tacos. My boyfriend really enjoyed the chicken tinga tacos and I enjoyed my steak! Service was great- we came with a big party and were seated outdoors. Waitress' were super friendly and helpful. They took great care of us!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RQr-xyoqh8LG0U2SpiUn6w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RQr-xyoqh8LG0U2SpiUn6w/o.jpg"
      },
      {
        "img_id": "BFPw8J6IySSPAE1U_UfGhw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BFPw8J6IySSPAE1U_UfGhw/o.jpg"
      }
    ],
    "user_id": "PHgoZTMl9UxeZzwAejNlww"
  },
  "CNZ0XYEBOyg-q-j0i1cNHw": {
    "date": "6/20/2019",
    "text": "Great food and service! My favorite lunch special item is the Quesadilla Meal which has 3 large quesadillas with Mexican rice, beans and my favorite crema. This lunch portion is very filling! Definitely try them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3aSezyGUsw_8jovQ4LSJaQ"
  },
  "v94yl8nn0qEcl0fZfGd-5g": {
    "date": "7/21/2018",
    "text": "Stopped by Que Onda with a few friends from work. I recommended the place, so I hoped it would be good - I was right.   The chips were okay, the salsa was GREAT. You can always judge a place by their salsa, and this passed the test. I ordered the Coca-Cola Carnitas tacos, which, despite the name, were not overly sweet or even sweet at all. They were delicious! I believe they had a happy hour but I didn't check out the specials.  The service was great, especially since I was there with a group of about 10 people. All of our food came out astonishingly fast. SO fast. We were able to get a full meal in and make it to the baseball game on time. If you're headed to the BB&T Ballpark for a game, this is the best place to grub, as it's only a 4-minute walk away.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "e0JXm2TuFoD0ykiFSUgg4w"
  },
  "u5CDIjCCOyQSvVJxi9Oehg": {
    "date": "4/2/2019",
    "text": "Super friendly staff. Guacamole made right at the table ... impressive and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wOcV9L8wFy11y-q9mMQQow",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wOcV9L8wFy11y-q9mMQQow/o.jpg"
      }
    ],
    "user_id": "AxyqO2PXtqezJKG2fqUy-w"
  },
  "FS4bpFXJhaX6CcuGTjFD_A": {
    "date": "5/30/2018",
    "text": "I had the taco salad with steak and it was delicious - light and refreshing and flavorful.  My dinner companions raved about their tacos.  The free queso that we received for checking in was not bad, but the guacamole stole the show! The frozen sangria was perfect for a hot day.  Would definitely return next time I am visiting Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fj_yNSZchFoDkDsTY0_slA"
  },
  "rBv2XcI581OzFyenOYIdCw": {
    "date": "6/24/2018",
    "text": "Rude bartender/manager. I order take out from here all the time since I stay next door, the food is okay, however bad customer service ruined the place for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScWdLTOf2EdpPHlfgLnodA"
  },
  "TVf5c8FAIHEPU0jSmSV7nQ": {
    "date": "11/7/2017",
    "text": "We tried to make a reservation to the uptown location using Yelp. We received confirmation from Yelp via both text and email, however when we got to the restaurant they informed us they do not take reservations via Yelp.  The manager on duty was not very helpful, however the owner really made it happen to ensure we were still able to be seated (even though all of their large party tables were filled, he pulled two smaller ones together) and then got us a round of drinks for our trouble. His customer service and hospitality was outstanding.  Every single one of our party was extremely satisfied with our food. Our only \"complaint\" was that the tacos were too full to pick up. Sizzling nachos and queso was fantastic.   All in all, what could have been a really disappointing situation around the reservations, turned into a great evening with great food. We would definitely return--and call to make our reservations :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-64qUzUDVPgSXv-euV0aaA"
  },
  "HbwDP-WkaC9QjO085c8LoA": {
    "date": "5/5/2018",
    "text": "Pork carnitas, braised beef and chicken tacos amazing! Jabenero sauce so delicious and hot on a whole different level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SkosMOHH-9Pexu0VtfaNIg"
  },
  "vvQs1rX5K_EJpRoylnqkug": {
    "date": "4/14/2017",
    "text": "Ran across this place online. Me and my baby sister like yo consider ourselves connoisseurs especially of Tacos. They are not your average cliche taco spot. Starting with the Pineapple Pico,Chipotle Queso, and some type of liquid love they call Salsa Verde it's amazing. I could go on and on but I'm still here and I want to finish my last taco! Don't be a square get here soon! You won't be sorry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ePCHDVEIOkJW8jqn_zRB-g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ePCHDVEIOkJW8jqn_zRB-g/o.jpg"
      }
    ],
    "user_id": "D1hSk_Xe7VGHgtw1kZ176w"
  },
  "68pi641B-6sZy1qyTne-2A": {
    "date": "7/4/2017",
    "text": "Very energizing tequila bar with the best street tacos. Vibrant colors and great atmosphere. Salsa was great served with fresh tortilla chips. I had the Baja fish tacos & my friend had the steak both very delish! I was impressed with how clean this restaurant is. Wait staff was awesome. Everyone seemed happy to be working, even in the holiday. Wish I lived here, I would visit everyday to try everything on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOrpr73ianGqzuibAd72_g"
  },
  "Kf2-dhNMb9l3a9tOaqgQ6g": {
    "date": "9/3/2017",
    "text": "My family and I were in town and decided to try this spot.  The food pics were legit and you get a free queso with check in. The salsa and queso was pretty good, nice atmosphere, but HORRIBLE SERVICE.... after ordering our food (tacos) 20 mins go by and I have to flag down the waiter to ask what's going on , he comes back to tell us that it's going to be 15 more minutes  !!!!! people who arrived after us were enjoying there food while we were still waiting on ours.  It DOESNT take an hour to throw some tacos together, no one came to apologize or acknowledge that they screwed up so we left.. I'm guessing he never put the order in! NEVER AGAIN, I'll go elsewhere when I come in town",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lbYKopiChloPQrkdSGouYw"
  },
  "jQnu9XuaHSk8Y47l1hY3Bg": {
    "date": "5/22/2017",
    "text": "Great menu! Great location and the outside seating was refreshing. Our waitress, aside from being pretty cute with her choker chain, provided excellent service and great suggestions. Drinks were well priced and quite tasty. I will return for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wmoTyORPSY9zkmMhiiXYg"
  },
  "UQ7VZ2NoOrSSS27W9xNOEg": {
    "date": "11/10/2017",
    "text": "A great place for lunch at a good price.  I've been several times and the food and service have always been good.  The chicken burrito lunch special is a really good deal, especially with the habanero sauce on it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NUWEuHoOtINwSBWlwg_W_w"
  },
  "ir39QMexnfUZ9QOHZlBurA": {
    "date": "9/15/2017",
    "text": "Queso was great! Also the chicken fajita and strawberry margarita. I didn't care for the sangria though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8HOf1-LmZ3RpqrlZStOqnw"
  },
  "FwWlFGChoOdbeHW9wan_2A": {
    "date": "11/17/2016",
    "text": "Great and friendly service. Waiters were very informative of the menu which was great. The guacamole was by far one of the best items on the menu, but the meat in some of the tacos were a bit salty. The Pika Pika drink is very very VERY spicy! So if you're up for a drink challenge with a kick, this is the drink for you! I would visit here again since there are not of Latin restaurants in Uptown Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FKobdDVSsd5VHdfoWMD8Cw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Al Pastor, pork is tender, nice balance of sweet and savory on a corn tortilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FKobdDVSsd5VHdfoWMD8Cw/o.jpg"
      },
      {
        "img_id": "gxdXnsndkshzliasxEo9Bg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The Carnitas, beef has a nice flavor but a bit salty. Onions are a nice vinegar touch",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gxdXnsndkshzliasxEo9Bg/o.jpg"
      },
      {
        "img_id": "QA9_GLoltUtAhvYvWM9wAw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The Guera, made with beef and chorizo with a nice smokey taste! Very surprising",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QA9_GLoltUtAhvYvWM9wAw/o.jpg"
      }
    ],
    "user_id": "ZKS8j3mFCeHNmjZ6I1l6pA"
  },
  "URyk8P-cfzrB4zNC0N0EKQ": {
    "date": "7/26/2017",
    "text": "I think this is the best Mexican in downtown Charlotte. The queso dip with chorizo is awesome and the Entrees are awesome as well. Can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gSrfv_Wh1qK8ckwSRsLDuw"
  },
  "8g1lUfAIqFyzfaHf5WRbSw": {
    "date": "2/3/2017",
    "text": "The food was alright. I didn't love it. But it wasn't bad. The queso was very good but the tacos were just kinda alright. I got the chicken tinga tacos and I've had better. The drinks were also just alright. The margaritas were kinda watered down. But I did enjoy the $5 tequila shots on Friday and Saturday",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "8ccH8A61wWSSPWMnR-s2ZA"
  },
  "ReYa82-fI8ZIWWHDMEXd8g": {
    "date": "2/25/2017",
    "text": "Mediocre food. Nothing special at all. Literally. The salsa has little tomato flavor. I had the chicken quesadilla and it was good. I would suggest it. That and the queso. Not the salsa, not any of the rice types. They're bland.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7rK6YsOJnvKVuDs5XOdlPg"
  },
  "c5i5lz27-n6KX8UN9CA6_A": {
    "date": "7/28/2017",
    "text": "I went to this place with a friend for taco Tuesday, we ordered some guac, whish was amazing, and the taco specials. I ordered one of each flavor, chicken was the best to me. The vibe of the restaurant was really laid back and had a diverse crowd. There was surprisingly no wait time, major plus!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dk4M-AiWrloBWQMCt-G8Cg"
  },
  "zwk8HHkhw6e2R8q3ceBJPA": {
    "date": "4/6/2018",
    "text": "This place has a surprisingly good Taco Tuesday! 2 dollar tacos and 3 dollar drafts. The queso here is great! Can be pretty pricey though on regular days and Coronas aren't cheap. Overall though, I always enjoy eating here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECJF_lIGPaeX1Tj12SED0A"
  },
  "QhpJx725VZus4pCSKRjRhA": {
    "date": "5/26/2017",
    "text": "My wife and I love Mexican cuisine, so we decided to give this place a try. The service was outstanding, our server was very generous, therefore we left her a generous tip. The food on the other hand was bland. As a couple of folk who know what authentic Mexican cuisine tastes like, we were kind of disappointed when we left...The decor was so nice, the vibe was very upbeat...The alcohol was WONDERFUL! One of the things they could have nailed was the queso, but it too was bland. No taste from anything...I still have high hopes for this place. We will try once more in the future. If the food is the same, we will just get drinks and leave. After all, we all know the real deal is on the east side of Charlotte lol.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fbzru6z_A2luhK_kzKs1xQ"
  },
  "ySYw9XgDSkBA78DMCihPcg": {
    "date": "9/27/2017",
    "text": "Food was very good, loved the queso! I would not recommend if you are looking for a spot for a quick lunch as it took about an hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7B2_k6AcPI3i7JT0uHsbA"
  },
  "DPQIpB-gPN9T58Qmn2bP_w": {
    "date": "8/19/2017",
    "text": "Food was pretty good. The tortilla chips were some of the best I've had, but that guacamole was way too heavy on the tomatoes and onions. The tortas are huge, big enough to split, and the Milanese was very good. The tacos are also pretty legit, especially the Baja fish.   BUT the service is just terrible. Literally took us like 2 hours to complete our meal of two entrees just because the server was so slow. Took us 15 minutes to get our drinks that we ordered, not to mention they forgot to even bring out one of the two entrees we ordered until we asked twice.   Decent food, decent prices, bad service, would not go back. There are just better places to grab a bite in Charlotte.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWQTwhfjnH7l-zxOWuC1bA"
  },
  "aHQ93sZP_OtCG2f3xS-hkA": {
    "date": "6/26/2017",
    "text": "Good food, good service.  The chips are so crispy and not oily and the salsa is really good.  Recommend ordering the nachos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CPg7gNoMMS8FJzw3ugBwYA"
  },
  "7fhT7rlPquNZj8-mBRq7nA": {
    "date": "8/1/2019",
    "text": "This place is the jam...it's not been too busy when I've been there. Up to like 4 visits now, but it's consistent and dangerous at the same time, dangerous referring to the Tequila and Mezcal selection...I just stopped in for some tacos, didn't realize I was making a day out of it.   Great lunch spot. Tellem' Tony sent ya!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jA9UmEUZ7z2FshWrUu9NKw"
  },
  "WhlNVXrPhotWKUVMqaDZUA": {
    "date": "7/20/2019",
    "text": "We decided to try this place out after our trip to ImagincOn. Being new to Charlotte, we figured we'd give this place a shot considering the good yelp reviews. Mind you, we've lived in SoCal so we know what good Mexican food tastes like.   Let's start with the complimentary chips salsa. My husband and I disagreed on the quality of chips. I thought they had an old, stale texture but my husband thought they were decent. The salsa was probably the worst salsa we've ever had. It tasted like tomato sauce poured straight out of the can with some seasoning poured over.   We decided to try the queso dip to see if it'll be any better..tasted like dorito cheese mixed with watered down sour cream topped with cilantro. After each one of us tried a dip, it was a wrap. No bueno.  For the main dish, I tried the combination taco plate ; fish, shrimp, and lengua tacos. The fish taco was fantastic! It was definitely the highlight of the meal. The lengua (tongue) was definitely simply rewarmed, not fresh. The shrimp was....it looked like cheap shrimp one would use to go fishing with. It was more batter then anything. The retried beans and rice? It was either right out of the can and microwaved, or a few days old and microwaved. In our opinion, it was inedible.  Husband tried the chicken, al pastor, and the jt steak carne asada tacos. They were tasty tacos but again, the sides were inedible.  I also ordered a passion fruit mojito which was undeniably the Welch passion fruit juice (I know because I frequently buy it!). Barely any alcohol and way too sweet. Did not finish.  My daughter had the kids meal chicken Tacos, for an 8 year old, they were good.  Also, when we were initially sat, we noticed a couple gentlemen leave because all of their utensils were dirty. They checked two tables, and both plates were dirty as well.   Service was mediocre. The waitress noted that we did not finish anything on our plates and didn't take the time to ask if anything was wrong.  To sum this up, if you come here solely for the street tacos (and nothing else is open), try this place out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlyiIwTm18EBBXzPDnw_3A"
  },
  "EJnZ6mVyH4oL-ibygWDelg": {
    "date": "6/25/2019",
    "text": "I work down the street from Que Onda so decided to stop by for Taco Tuesday. They have $2 tacos all day on Tuesdays and you can choose from chicken tinga, ground beef, carnitas, veggie, or braised beef.   I split a dip trio appetizer with a friend which includes guacamole, queso and pico. I love chips and dip so I enjoyed all three. The guacamole was a little salty and not as thick as accustomed to but had a good flavor. The house salsa is also very tasty so I was in a good spot with all these dips.  I ordered me some of the taco specials and ordered a chicken tinga, ground beef and veggie. The chicken tinga was really good, very flavorful and included plenty of meat. The ground beef was also very good. The veggie was good but not as good as the others. It included mushrooms and zucchini as the main veggies.  In addition to great taco specials they also have $3 draft beer on special which includes local crafts on draft. I couldn't pass up on this so I ordered a Dos Equis to go with the meal. What a great pairing.   This was a great lunch spot and will be back for more Taco Tuesday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SDHbVfEkErUFN7DAEVZRg"
  },
  "pdfc7yCCAxzMi0wFs8DLpA": {
    "date": "8/27/2019",
    "text": "I've been getting their salmon tacos meal (comes with rice and beans) with a side of guacamole every time I'm visiting Charlotte for work. I make it a point to get this at least once for dinner. Love the tacos and the guacamole is good too. Their service is pretty quick. I usually order to go and I'm in and out in 15 mins at this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hM9oFMAt0vQa3SGtsUJj_A",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Salmon Taco Meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hM9oFMAt0vQa3SGtsUJj_A/o.jpg"
      },
      {
        "img_id": "FXsgl_3f4wjzfWwne7EY4Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FXsgl_3f4wjzfWwne7EY4Q/o.jpg"
      },
      {
        "img_id": "1L0c9Y3fU5T6DOjq4Jg3Eg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1L0c9Y3fU5T6DOjq4Jg3Eg/o.jpg"
      }
    ],
    "user_id": "d7fjjPXclDEbmvivn5jy9w"
  },
  "eDHufZETLFu01Ts7fsQUPg": {
    "date": "6/20/2019",
    "text": "I went during the evening of a Taco Tuesday with a couple friends. We did not have to wait long. We were seated at a high top table. Tacos are $1 on Tuesdays :)  For ME, I was not impressed to be honest. I ordered the chicken tacos and two of the veggie tacos. My friend received a free queso & dip for checking into Yelp. That \"coupon\" is only redeemable for one per table FYI.   The queso and dip was SMALL, but really good. The chips weren't stale; crispy & fresh. I love queso, so I liked it. The tacos weren't all that good. I had asked for sour cream on the side & never received it. I put a little bit of Of the queso on my tacos because they were a little dry.  The veggie tacos tasted weird.   The waitress was not the friendliest. You could tell she was there \"just to do her job\". She was kind of dismissive and not attentive to our table.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "paVJ8PsJmN6eJJHiW10FEQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/paVJ8PsJmN6eJJHiW10FEQ/o.jpg"
      },
      {
        "img_id": "BTGh9Ezl19OCqxqQqBjHVA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Queso &amp;amp; salsa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BTGh9Ezl19OCqxqQqBjHVA/o.jpg"
      },
      {
        "img_id": "MpXzVNjKB7AV1FhKjSgC-Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MpXzVNjKB7AV1FhKjSgC-Q/o.jpg"
      }
    ],
    "user_id": "7bm-w9MDAlLyYcLHgvlieQ"
  },
  "8qoXhDhhtsglpLbUpMF1lw": {
    "date": "6/12/2019",
    "text": "After an exhausting day at the amusement park , my friends and I decided to take part in Taco Tuesday. We were greeted and given a table immediately. Upon checking in I was gifted with free queso. The dip was sooooooo good! It was runny but flavor wise it was the best one I've had. We were also given salsa and chips . I liked both .  I ordered two $2 chicken tacos. My friends ordered either chicken or the market veggie tacos. The tacos were small but filling. I didn't like the texture of my tortillas. I'm not sure if they are used just for the special or not. I think it was a corn tortilla. I did use some salsa and queso on my tacos to give it a little more flavor.  Our waitress was nice but it wasn't much interaction as we were in and out. Overall, I'd come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7jSJLB07dn9wqplILUQ5UA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7jSJLB07dn9wqplILUQ5UA/o.jpg"
      },
      {
        "img_id": "TrDwAyT7xOnw5fl6iDuGtA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TrDwAyT7xOnw5fl6iDuGtA/o.jpg"
      },
      {
        "img_id": "4bJORemAve44hIurYZqUXg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4bJORemAve44hIurYZqUXg/o.jpg"
      }
    ],
    "user_id": "7n3E1tWpANHJKeeaC0TIBA"
  },
  "XVTJNU_LN22U9y4jqz5Iqg": {
    "date": "8/24/2019",
    "text": "Great restaurant! The food was delicious, atmosphere is great and the music makes you want to stand up and start dancing. Great mojitos! Love that they give complimentary chips and salsa, definitely great for the kiddos who need something to much on while waiting for entrees. Service was great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2WUncMOjSQCVoFvgWO4qqg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Street Combination of Tacos (Crispy Baja Fish, Coca Cola Carnitas, and Al Pastor) with a side of rice and beans. SO GOOD!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2WUncMOjSQCVoFvgWO4qqg/o.jpg"
      },
      {
        "img_id": "aQn8cZSD_Zid2agw-Cw8PA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Guacamole Tradicional",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aQn8cZSD_Zid2agw-Cw8PA/o.jpg"
      },
      {
        "img_id": "q_OnNAySvlOKE8cEedE4ow",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fun art work",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q_OnNAySvlOKE8cEedE4ow/o.jpg"
      }
    ],
    "user_id": "r7GNKW4wDFLH4W-daqxN2g"
  },
  "LwLnn46cGSypREKfTp2mCg": {
    "date": "7/15/2019",
    "text": "Omg! These tacos are amazing! I just smashed these 3 tacos like it was my job! I had the Grilled Steak TJ, Al Pastor Pork, and the Alambra Steak. Man, these tacos have so much flavor, and really pretty reasonably priced. I got 3 tacos of my choice with Mexican rice and beans for side for only $12.95! It's walking distance from my office in uptown, which is really awesome. Definitely try this place out when you are craving tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0SrFMH2T65CztvdTwP1Psg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Grilled Steak TJ, Al Pastor Pork, Alambre Steak.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0SrFMH2T65CztvdTwP1Psg/o.jpg"
      }
    ],
    "user_id": "JXBOsuS4wIIRqgBWwA4-zA"
  },
  "-0cKr8H1xF40i6MiYzxuqg": {
    "date": "5/4/2019",
    "text": "My oh my! I am extremely impressed by this restaurant! The best tacos I've tasted in the QC! This was my first time here and I'm glad I stopped by. I tried tacos al pastor which is served with pineapple. Who would have ever thought pineapple on tacos would be so good?! These tacos are so loaded with meat that they spill out of the tortilla. The meats are seasoned with that Spanish sazon! The guacamole is to die for! It's made freshly on your table.   This restaurant was poppin' when we got there. Waiting line was out the door. Such a great atmosphere to be in. I wish the location was much bigger to accommodate more guests. Service was wonderful. This is now my new favorite location to get tacos! Great job guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xiGi6pV1AD7WonKJaIjB0g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Mix and Match Tacos! Comes with side of rice and beans!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xiGi6pV1AD7WonKJaIjB0g/o.jpg"
      },
      {
        "img_id": "_F1Ltzvn47FTG6LoKh_NaA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Tacos al Pastor, Carne Asada, and Coca Cola Carnitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_F1Ltzvn47FTG6LoKh_NaA/o.jpg"
      },
      {
        "img_id": "U8J938F1x59Y82pB010hHQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fresh Guac!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U8J938F1x59Y82pB010hHQ/o.jpg"
      }
    ],
    "user_id": "J2oYUy_l7PI0vpersBY-BA"
  },
  "ETw1FI85Ph05Kfk05OqlrA": {
    "date": "2/14/2019",
    "text": "This was very delicious and our waiter was so sweet and friendly! First to hit the table were the chips and salsa. Being a Yelper, the check in came with a free chipotle queso and both items were delicious! There were plenty of drink specials for each day of the week and it was a great lunch spot!  I got the taco salad which was very good and my friend got the fajitas which came with the fix ins of retried beans, rice, pico de gallo and lettuce! We will be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "hxNnKRKqViAXNbapl9Tt6w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Taco salad:$7 +chicken $3  (I added some avocado)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hxNnKRKqViAXNbapl9Tt6w/o.jpg"
      },
      {
        "img_id": "TG1RQFjwyjDG6S0zuUo3Lg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Lunch special Fajitas: $9.95",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TG1RQFjwyjDG6S0zuUo3Lg/o.jpg"
      }
    ],
    "user_id": "Hz6oOM_lTJGFrhaknrAUjQ"
  },
  "Ui9chINW5SOGDbMvaZMkDg": {
    "date": "5/23/2019",
    "text": "Solid Tex-Mex spot. Flavorful tacos and dips. Has indoor and outdoor seating and a small bar for seating as well. Cute day of the dead themed decor and murals throughout the spot. We grabbed tacos and fajitas alongside the salad and queso {free thanks yelp} dip. Chips were flowing and margaritas were tasty. Service was amazing and we would def go back when we come back in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uwr-PK43Ab3ilyeGDp_f4w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Combination of Tacos. Pork al pastor was my favorite. Adobo Shrimp was good. Veggie was ok too. Got corn shells for all of them.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uwr-PK43Ab3ilyeGDp_f4w/o.jpg"
      },
      {
        "img_id": "8mDxxIkIhQc9FH2C3wf-gg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Queso Dip was yummy and had a nice kick!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8mDxxIkIhQc9FH2C3wf-gg/o.jpg"
      },
      {
        "img_id": "9tQ_HnHhJsfQFMSVBZMFIQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Mixed fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9tQ_HnHhJsfQFMSVBZMFIQ/o.jpg"
      }
    ],
    "user_id": "sjgeUZhxQTgg-9xxF6bbaw"
  },
  "H1I_CvMqMrf01y6hxx-nMg": {
    "date": "4/1/2019",
    "text": "Working at one of the best taco and tequila places in Charlotte has my expectations very high.  Service was good. Frozen margarita, strong and good.  Food, bad.  Everything had no seasoning at all. The fajitas tasted more burnt and had to be doused in salt, and topped with a lot of guacamole. The salsa tasted like tomato water. I hate to say it.  The chicken soup was probably the best thing that I've tried. Perfect broth, heat and tender chicken.  Unfortunately, I don't think I'll make another stop here but good service and cute vibe!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oYf5m0vyL7AOXBicacw5GQ"
  },
  "dfeZdsLFEFJ0hn2gPmppUA": {
    "date": "3/28/2019",
    "text": "The place is Super cute and was in walking distance from my hotel .   We were looking for a place that could accommodate the meat eater in our group , a vegetarian and pescatarian and this place for the bill .  Not crowded at all through the week , daily drink and food specials and FREE queso if you check in on yelp .  We ordered just fine .. here's where we had some issues .. there were 3 of us , the brought 2 of the meals to our table and took 1 to a random table . Once we retrieved that meal ... we noticed it was incorrect (not fish yet chicken tacos ) and also noticed that the meat eaters meal was incorrect , he did not receive beans and rice , yet 2 orders of beans . He brought this to the servers attention , she said she misunderstood , yet never took care of it .   My meal ..came with cheesy rice (something like velveta mixed with rice ) .. reminded me of my college days .. the veggie enchiladas were good , seasoned well etc .  I'd go for the chips and guacamole for sure !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kq36QO-_J9IoGqskLNJ7kg"
  },
  "xC9iYfKRV6f2H-iNxe9TRQ": {
    "date": "7/28/2019",
    "text": "This was a fun casual place. The food was okay, nothing really special and honestly I was hopeful they'd be a bit better but not bad either.   I'd go back but I'd make sure I got pico to give the tacos a little more flavor besides just meat and tortilla.   The trio appetizer was really good and the amount of guacamole was surprisingly large.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AdEDLgJvHsgObhD-_pIpYg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. 3 Amigos Trio with chorizo.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AdEDLgJvHsgObhD-_pIpYg/o.jpg"
      }
    ],
    "user_id": "3xT0gLF5tHqEi2-qPQEqbg"
  },
  "yDoXV0smOTqVm-cPCb0KiQ": {
    "date": "8/15/2019",
    "text": "If it's Taco Tuesday, this is my go to place. My man Angel is always on point! The tacos aren't the greatest of all time, but for $2, you can't beat the good portion and flavor! Tequila selection is great, locale is great - keep up the good work folks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QRSTO3BSBLqZK7XzhJu3qA"
  },
  "3sGxgk5jqDjJsBBlBiMMFA": {
    "date": "3/28/2019",
    "text": "This review is for their Taco Tuesday special.   My team at work was celebrating a coworker birthday so we were looking for a place in Uptown that could seat a big group. It was a beautiful sunny day so we decided to try out Que Onda. They were able to push some tables together for us outside.   We took advantage of the Yelp check-in to get free queso, and it was really good! Most of us ordered the tacos (they are pretty small--street taco sized), someone ordered plaintains, and one person order the taco salad. Everyone enjoyed their food.  Our server was great. He was super busy and we waited for water and chip refills, but they eventually came out. The food took a little while to come out, so I'd recommend planning on a long lunch (or arrive early).  I regret not ordering the taco salad, so I will order that the next time I go.  p.s. I'm not sure if there is dedicated parking because we walked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M3IsWEs1ufGslXRae8VV-Q"
  },
  "2lAPVBGpJ9gTHQ0nFgixTw": {
    "date": "8/30/2018",
    "text": "Was wanting some Mexican food on a Tuesday and this place did not disappoint. There was not a wait and the weather was perfect to sit outside. Our waiter was extremely detailed when describing drinks and their food items.  The margaritas had the perfect amount of tequila and were very practical in price. The food was amazing .  I order the chicken Suizas and I had to force myself to stop eating. All the ingredients were fresh and seemed to be made to order. The queso was the perfect temperature and the right amount of gooeyness, i was in heaven.  The restaurant was clean and the staff was friendly. Our food came out fast and steaming.  Our bill was not too bad, but it was worth every penny due to the level of food that was presented.  I would definitely be back for a day other than Tuesday because they have specials all throughout the week.  If you like Tex Mex this is the place for you !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Kr7aVDuxukG41OhdTXYf8g",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Kr7aVDuxukG41OhdTXYf8g/o.jpg"
      },
      {
        "img_id": "Q_wtZfC-l6oQVTocusgyPQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q_wtZfC-l6oQVTocusgyPQ/o.jpg"
      }
    ],
    "user_id": "kDppjkN7xIgxunSLfhYjpg"
  },
  "9Q-809YQOa1ZInNBRU-N6w": {
    "date": "8/10/2019",
    "text": "I had a steak taco, salmon and the pulled chicken. The steak and salmon tacos were amazing. Juicy and flavorful. The chicken taco was a just ok. A little bland and definitely could stand alone without some salsa and sour cream. We also had the triple dipper appetizer which included guacamole, queso and pico. All three were fresh and delicious and their chips were perfect. The margaritas were perfect and my husband loved his Bloody Mary. Service was very efficient. We will definitely go back when in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YILLnVhewfcZisrK6rKkgg"
  },
  "-Akcgly4bKVKa3VFp0P7Vw": {
    "date": "7/29/2018",
    "text": "This place is awesome!! Our server was wonderful friendly and took very good care of us. My husband got the fish tacos and said they were delicious. I got the taco salad and ate like I was in a race. It had beans and fresh corn right off the cob. I loved the salsa and used it as the dressing. My son and GF got the veggie tacos and ate every bite. I wish I could Show you more picture but we literally ate everything !  We are new to The area and will be coming back for sure. It's in walking distance to many downtown Apts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "a0EtXPKLbBUTPnGn7l_yfA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a0EtXPKLbBUTPnGn7l_yfA/o.jpg"
      }
    ],
    "user_id": "GozPEmZhgWLh5MVDXn9k5g"
  },
  "5LH-iWl1dp4g1a3t_HOLNQ": {
    "date": "5/30/2019",
    "text": "Came here with my friend after work. We ordered the traditional guac....so good!! The chips were fresh and hot..salsa very good as well. As far as our entrees, we were not that impressed. I ordered the fried chicken torta..chicken was tough and didn't have a good flavor. My friend ordered the vegetarian tacos and didn't particularly enjoy them either. Overall, our waiter was very attentive and provided great service. Would definitely be back for apps and the chips and salsa!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fqcty5_beOvO1eVQ80aXiA"
  },
  "MGQpmFbIjRcZ1ON9l2-ZUg": {
    "date": "12/23/2017",
    "text": "I highly recommend the carnitas tacos or suiza enchiladas! Those are my go-to orders. Que Onda also provides the best chips & salsa of any Mexican place I've ever been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WLP4E8Eiek2yjiApJN-Xg"
  },
  "tSJTv-fTvNHyJMaGMS_Y4g": {
    "date": "12/16/2017",
    "text": "Be warned! The chips and salsa are amazing and you won't stop eating them. Ate so many that I couldn't finish my tacos. The mixed veggie taco had something delicious in it and the steak taco had glorious chunks of medium rare steak. The skinny margarita was also verb delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQkg9jUwXbGYVA_HNoBwgg"
  },
  "UDSqR7_dfW3n-U6UpWv2JQ": {
    "date": "11/20/2016",
    "text": "We went for lunch on opening day.  We were nervous about the service but it ended up being excellent. The servers were very attentive and knowledgeable about the menu.  We also lucked out because Tuesday's are Taco days and tacos were only $2.00 each!  The cheese dip has a kick but it is delicious. The guacamole was good but I'm not usually a fan. They say they make it table side but they already have everything in the bowl when they come to your table and then they mix it together in front of you.  I thought it would be more like Rosa Mexicana where they come with all the ingredients and actually make it in front of you.    The beef was very salty. I actually didn't eat most of my three tacos.  What really made me question coming back was when we asked for a refill on our drinks and the server said he would \"grab me another one.\"  I looked over the menu and didn't see anything about drinks being charged by the glass.  Sure enough, the sweet tea I was drinking was about $2.75 per glass.  We were there for a while so I had four.  That's ridiculous to me.  Especially since it's not noted on the menu in any way.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1KzAqTKC05aa4LN1u17P3A"
  },
  "vjPxhHaNZ1RKktXe3khDhw": {
    "date": "6/30/2018",
    "text": "Excellent salsa, great selection of tequilas, great food, lovely decor, really excellent service. Great daily specials. We think it's the best Mexican place in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H5od44JKgzYwmgMAQzdzOg"
  },
  "ps6I9uI4i3xjfeA38WS_sQ": {
    "date": "3/18/2017",
    "text": "This place could be called Que Dope!  Mani, outstanding signature version of the Cuban Sandwich!  Charlotte come in and check this place out.  Parking might be a bit of a challenge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N1m_QRfjjgcUR5CLTAHSKQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N1m_QRfjjgcUR5CLTAHSKQ/o.jpg"
      },
      {
        "img_id": "cUyqQORCfBb1RfDp-WiIQQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cUyqQORCfBb1RfDp-WiIQQ/o.jpg"
      },
      {
        "img_id": "W_VcZJxhyXlDbykAgp_WHA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W_VcZJxhyXlDbykAgp_WHA/o.jpg"
      }
    ],
    "user_id": "TTwnrAdB-IZC1wSNENvddw"
  },
  "bqVpVPdIqHrX4qr_ltVakA": {
    "date": "6/24/2018",
    "text": "Food is good, but drinks are a bit overpriced and the bartender Amber was not friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKnLxRVoisXyT5ihEbBuCg"
  },
  "ROVevZR-u9i2ZKsfUN0C-w": {
    "date": "8/14/2018",
    "text": "Margaritas are way too sweet and the tacos are underwhelming. Came on taco Tuesday and I don't know why anyone would pay more than $2 for the tacos. The guacamole and salsa are flavorless.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NTVI6DgBZ3vdGtFddRrTQQ"
  },
  "9Lqq2DobHt2m3Ikj_K5fGQ": {
    "date": "2/2/2017",
    "text": "Loved the food, the atmosphere, and the service . All around great experience ! Fried shrimp tacos are where it's at !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zbwfsJwHLoFB_cdcQFhicg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. First one is the chicken tinga taco which I wasnt much a fan of but the other 2 are Baja fried shrimp tacos&amp;amp;they were THE best I&amp;#39;ve EVER had",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zbwfsJwHLoFB_cdcQFhicg/o.jpg"
      },
      {
        "img_id": "QqIHdBXExHfU1EFR5r3Log",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Delicious skillet nachos.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QqIHdBXExHfU1EFR5r3Log/o.jpg"
      }
    ],
    "user_id": "XI8LmAX2O6k5ZFIJJyfe0w"
  },
  "8hhDwlc4MhbcWHCRtUgarQ": {
    "date": "3/5/2017",
    "text": "Better than expected. Well run, solid ingredients and reasonable prices. Language Tacos are always a winner with me and the SO. Try the cheese dip and quac. Yelp check in yields a free queso.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S8_j9W0vnVCVz2kiq2maSg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/S8_j9W0vnVCVz2kiq2maSg/o.jpg"
      }
    ],
    "user_id": "tUbgawKxrOmLUuv0KUKZvA"
  },
  "KoWU_dCBd1DaXvQREEvgnw": {
    "date": "11/12/2017",
    "text": "The food and service was great!  It's a small place and it was quite busy.  I'd like to try Taco Tuesday.  I hear they're tacos are dynamic! They have a beer special on Tuesday's also.  I had a burrito that was delicious!  They're cheese dip is phenomenal!  I'll be back!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n13yLog03Eu_427Mk-5XkA"
  },
  "UT5HpG1vWz9CmHOlmgrSOg": {
    "date": "6/11/2018",
    "text": "Got a sampling of tacos and dessert and they were all really good. Server was sweet as could be but it took forever to get my food and bill, luckily I wasn't in a rush.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RdsUNIcMa-KWK-0sg5E-Ow"
  },
  "Z8VXQAmvAzRIAZLIm2HcEQ": {
    "date": "4/29/2017",
    "text": "Came here because it was one block from my apartment. Food was OK, at best.  I had the chicken tacos, which were rather bland.  Even Vida Vida was better.  Chips were pretty good, though!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PF3IPCbcl23nm5HTYEoBoA"
  },
  "sZXivqA4On1S9SddJz2YGw": {
    "date": "10/30/2017",
    "text": "My friends wanted to check this place out, and I almost didn't go because by looking online, it appears that NOTHING is vegan-friendly. However, I decided to give it a shot (if all else fails, chips and guac and tequila are a great meal, right?). After asking our server, she confirmed that the rice and beans are vegan, so I ordered the vegetarian tacos without cheese, and added beans and rice. I also got a couple cocktails. All was pretty good. The zucchini in the tacos was cooked to perfection. Their chips are great, the salsa is just ok. Unfortunately, I ended up being charged for both the rice and beans, but didn't get any money taken off for omitting the cheese or cream sauce. I would not go back unless someone I was with really wanted to. If they added more explicit vegan options to their menu, then I'd go back and try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tV5s-lA7pUVK0RFEp4l_kg"
  },
  "9Q87lpAuB_e1SPQPkEJ_-g": {
    "date": "7/24/2018",
    "text": "Want to get some of the worst service ever? Cmon down to Que Onda. I've been here four times and I wanted to like this place, really did, but every single time I've gone in there I've had horrible service. Food takes forever, orders are wrong, I order drinks, they never come, but I'm charged for them. I made a reservation, arrived, I was told that they had no tables and that I'd have to wait 30 minutes . . . THEN WHY DID YOU BOOK THE RESERVATION AND NOT TELL ME THAT BEFORE I DROVE THERE???",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iZEZcuq7429rpOXmPPhCpg"
  },
  "iAvLBBjSKfi1i7Kjmrs-Nw": {
    "date": "9/13/2017",
    "text": "I've eaten here and ordered delivery. Eating there has been decent, the waiters tend to forget drink orders or bring them to the wrong table often, but otherwise service good, and food too. My main issue was with delivery that I ordered a few days ago. My wife and I both got enchiladas, and when they came they both had some Sort of wax paper stuck to the bottom of them, as if maybe they were heated up in a microwave on this paper and then were just dumped into the box? It was tough to tell if on purpose or a mistake. What I CAN say is that enchiladas are tough to eat when there's wax paper stuck to them, it stays stuck to the bottom of each piece you try to eat. I ended up trying to pull the wax paper out, failed, threw the whole thing away. I guess I'll just stick to either eating in or ordering delivery from Somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ySrgGSc7u9FzHaPX7vpgOw"
  },
  "1bucoDpyfSaMk9sd2ukxBw": {
    "date": "7/14/2018",
    "text": "The tacos are pretty good. The salsa is the bomb. Yana is an AWESOME server and bartender. We had a great experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQp_zE2K-J1Ct9snoInE4Q"
  },
  "yeKI_hGqaD0fx5gWn7yDvQ": {
    "date": "2/5/2017",
    "text": "We were out looking for something to eat and this place came up on yelp so we said hey why not. The ambiance is really nice, we went on a Friday and it wasn't to crowded. The chips,salsa and queso was amazing; as always by the time the food comes I'm stuffed  from all the chips I've eaten..I ordered the fish tacos and he had the chicken tacos both were really good. The quality for the quantity and price is great...we will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ebUIRxtyYlrqPjU6ToChHw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fish Tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ebUIRxtyYlrqPjU6ToChHw/o.jpg"
      }
    ],
    "user_id": "i1WQggwWiD8k4FCW1IIUew"
  },
  "m3EKiz8On2q_VBTnwEITfA": {
    "date": "7/10/2018",
    "text": "Gotta love the atmosphere, $5 tequila shots and 3 soft tacos of your choice for $9.95!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egekwlGXPxTFwxO-dHtC-Q"
  },
  "k0bssCyTR7PdClhyX_x0Og": {
    "date": "9/11/2017",
    "text": "This is my favorite place for tacos uptown.  The grilled steak and shredded beef tacos are delicious, and the Coca Cola carnitas tacos are a unique take on familiar flavors that keep me coming back.  The salsa is good enough to eat on its own, and the staff are always friendly, inviting and helpful.  I'll meet you there for Taco Tuesdays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3eCCxIC-ZJPdcr_nJ79Q-w"
  },
  "kWiOhMhCmjEufBO9qCbYlg": {
    "date": "7/5/2018",
    "text": "Two dollar tacos are delicious!!!! You can not go wrong by going there. I went from lunch and the food was bomb!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bUqbodwFX-tuVkqeK3UbKQ"
  },
  "pPP_kUgaZWidrie1B5s5XA": {
    "date": "5/13/2018",
    "text": "Stopped in on a Saturday for lunch. They have outdoor street level seating. Latin music was playing,margaritas were good and the server was fast and friendly. Ordered the nachos and street tacos. We asked the server for the hottest salsa they had. And boy did he deliver (fire) overall perfect little spot. Took a minute to find street parking but a 2-3 minute walk was nice on a beautiful day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_wW0KG3kY6HZu2FBDDCc-A",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_wW0KG3kY6HZu2FBDDCc-A/o.jpg"
      },
      {
        "img_id": "Wi9_q_bNDg0-cukoIODJPA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wi9_q_bNDg0-cukoIODJPA/o.jpg"
      },
      {
        "img_id": "5Doxl71oZZKYw0zPmvWJBg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Doxl71oZZKYw0zPmvWJBg/o.jpg"
      }
    ],
    "user_id": "_r8hRj_GTpOJJjfspx9l7Q"
  },
  "JSznoMUJVfyLkJf-aieHHQ": {
    "date": "6/25/2017",
    "text": "Que Onda is the type of place I go to when I'm looking for a quick dinner or a cheap lunch. I came here on two separate occasions so I'm basing my rating off the average of the two experiences.   The ambiance: Cute, very modern, and clean. Cute star lights hanging from the ceiling, a homey Spanish speaking staff, and a man who seems to be the owner or manager making his rounds to make sure everyone is having a good experience. Good, lively Spanish music at just the right volume that you can hear your dinner partner.   First time around, I ordered the horchata and the three taco combo of Baja shrimp, beef, and fish. The shrimp was by far my favorite. Citrusy flavors that cut into the mild flavors of the shrimp. The horchata was good--yummy cinnamon flavors and the nuttiness of the rice. A little bit more ice than I liked, because by the end, my horchata was diluted and tasted like nutty. (3.5/5 for this meal) Not bad.  Second time around, I ordered the enchilada mole ($15). It was okay. The mole sauce had a hint of cocoa (which is what I was looking for), but other than that, the dish was bland and fell flat. The rice was some sort of fried rice stir-fried in carrots and peas, and the refried beans were more liquified than thick. Both the rice and the beans weren't phenomenal, nor did they have any distinct flavors. BUT I have to give it to them, the presentation was very good. (2/5 for the enchilada mole)  The star of the show are the chips and salsa. They came out hot and were accompanied by this smoky, earthy salsa that I devoured. I think I ate more of the chips than my meals. (4/5)  I really want this place to thrive, because the owner does a great job making sure you're accounted for. The staff is really friendly, (and you can tell that they enjoy being around each other), and one of the owners that I met was so nice and chatted with me about the different hot sauces that Que Onda has for those that are looking for a nice 'kick.' I really want to root for this place. I will come back because I want to see Que Onda thrive.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YRuv_1NGs2C_qrCoYoqlwA"
  },
  "d8kF9HnJpuy5kHhRoI7wlQ": {
    "date": "4/28/2017",
    "text": "The tacos are AMAZING! I've come to this place at least 6 times in the last 2 months.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7hg9Yh9Yd1RqbqwI04277A",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Baja Fish Tacos! So good.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7hg9Yh9Yd1RqbqwI04277A/o.jpg"
      }
    ],
    "user_id": "oMcBz3NfDnpJ0ktVosC1cw"
  },
  "jumUuAtGctlPoCS8bKW_lg": {
    "date": "7/3/2018",
    "text": "I love this little joint....the service is fast & friendly and the food is always on point....it's dog friendly .....also....you get a complimentary queso if you check in!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-_VUXCUmeklS18FNQmYZlA"
  },
  "qZtQa1a6Y1jJDkQs0NSOKA": {
    "date": "2/17/2018",
    "text": "So in love with this place!!! Awesome drinks, food, and service! Must try the frozen sangria! It will change your life!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OutKGbXXo7uMxMEEaOWKCw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OutKGbXXo7uMxMEEaOWKCw/o.jpg"
      },
      {
        "img_id": "iM_XzU0aqAwF9zeU4P90Xw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iM_XzU0aqAwF9zeU4P90Xw/o.jpg"
      }
    ],
    "user_id": "L1bu98pjsdE-97jUFH4Pfg"
  },
  "DzPop0bsHLLmtR1THNspIg": {
    "date": "3/26/2017",
    "text": "I'm going back.  They had the best guac I have ever eaten.   Yelp check-in got us a queso chipotle dip.  Tacos are usually served on corn tortillas, but when asked came on lettuce for a low carb diner.  We were there for lunch so didn't have cocktails.  The drinks menu looked interesting, though and they have a HUGE variety of tequilas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "el3clMAKidlw1tBymEYPBQ"
  },
  "d-ue4E30BROxvbckxTXSBg": {
    "date": "2/27/2017",
    "text": "Great tacos & greater service.    Myself and a friend ended up back at Que Onda for lunch, within a week of our first visit.  This time I was impressed because although it was busy, a server stepped up and took care of our order once she realized that we had been waiting for a while and our original server was busy.    During both visits we ordered, tacos.  My favorite taco is the shrimp taco (which is available by request).  The shrimp was grilled with a smokey seasoning that compliments the cabbage slaw perfectly.  If you like spice make sure to ask for the avocado cream sauce on the the side, it has a kick.  Now I am looking forward to coming back for dinner to try their drinks, as I would probably order tacos again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JBdWEQJk_TiXZkPIREqFfg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fish taco, Shrimp taco, and a Market Veggie taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JBdWEQJk_TiXZkPIREqFfg/o.jpg"
      }
    ],
    "user_id": "y4BY4Lz6LeGIcY3L5qHYQg"
  },
  "NkBQZP7M7fvwB2r5R_6SjA": {
    "date": "2/11/2018",
    "text": "This place is awesome. Really. Try the trio appetizer. Tacos are excellent especially the steak tacos. Salsa and chips are great. Chips are thin, crisp and warm. Soooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "acZDdjq5wwT4mR6VA4_sBg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/acZDdjq5wwT4mR6VA4_sBg/o.jpg"
      },
      {
        "img_id": "1GaNlKTcDvH8eWC-YE03gw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1GaNlKTcDvH8eWC-YE03gw/o.jpg"
      }
    ],
    "user_id": "YZwkYh1-1E8n8cLYh-M_oA"
  },
  "BU1mYsKNQeziJf1Mf82DFQ": {
    "date": "12/17/2017",
    "text": "This place is pretty good.  My friend and I were stressed out because we were gonna take an exam the next day, therefore margaritas were a must.  We each got a marg, 2 of the happy hour tacos and shared the chips and queso.  So filling!  Make sure to check in for the free queso!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8x6nFlG1mIT-d7fpFZe3zg"
  },
  "5P8qmEI947TJm6uI2Uakxw": {
    "date": "4/3/2017",
    "text": "I agree that Que Onda is here to stay.  Definitely a solid place downtown to grab some great fast casual mexican with an excellent selection of tacos.  I've been twice now and  tried a few different street tacos when I went.  Most of them were good not fantastic, but the Crispy Baja Fish Taco was out of this world.  The fish was light and crisp complimented perfectly by the chipotle aioli.  The chips and salsa were also on point and definitely filling if you eat too many.  Lots of choices on the menu and hope to try more but the street tacos are a pretty good value and my favorite.  For a casual place the ambiance and service here was exceptional and its a great addition to Uptown especially if you're getting a quick bite to eat before heading to a Knights game or just Uptown for lunch or even dinner in some cases.  Will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HIYcslZpJYI1iSzAGtRrlg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. New and very nice on the inside!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HIYcslZpJYI1iSzAGtRrlg/o.jpg"
      }
    ],
    "user_id": "5IMFlMJa8y5IVuXX-53nGw"
  },
  "2Uq84eOT-NYuTAp0XNTKVQ": {
    "date": "7/15/2018",
    "text": "Super cute atmosphere. Seating area outside was inviting and comfortable. My waiter, Jose, was very attentive and knowledgeable about menu items. I got shrimp fajitas and they were good with a large portion. The queso and salsa was BOMB. Highly recommend to anyone looking for a good Mexican restaurant in uptown Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7--IYGv96BTOcHcFB_4iQ"
  },
  "7bwYcIcDCN05Ioi2-soB9g": {
    "date": "10/21/2017",
    "text": "1 Star for garlicky desserts. I got a tres leches cake and a flan to go. When I opened the box, they both looked good and were generously portioned for the prices. However, my first bite of the cake yielded a strong garlic flavor. So did the whipped cream. And the sauce. It seemed like they had kept the desserts and whipped cream in the fridge too long with something very garlicky! It ruined the taste of the dessert. The flan had a slight garlic taste so it might have been fresher, but it was still not edible as a dessert, which was a shame because it seemed like a good, creamy rich flan. A restaurant should know better to keep desserts away from heavy garlic. However this did make me think that their guacamole would be fantastic.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "OQBMu7x0V4Oz3iFv3x0i5Q"
  },
  "RyRo3WCqDTMI7tgQkgNS2A": {
    "date": "2/16/2017",
    "text": "Yep- pretty tasty fish tacos. The food here was amazing. Our waitress forgot our cheese dip from the yelp check in but no worries. Decor is fitting and colorful. Definitely will be stopping by next time I'm in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wwDD2HK4oW7_-Y6xhtRN-w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wwDD2HK4oW7_-Y6xhtRN-w/o.jpg"
      }
    ],
    "user_id": "ZozXW23B0_ub_qBJIr0J_Q"
  },
  "IVKEAhRtFhDL84GGQ2ZNCw": {
    "date": "1/27/2017",
    "text": "Tried this place out for lunch yesterday and I was pleasantly surprised. Wasn't expecting a whole lot just based on the track record of the previous tenets of this space.   The food came pretty quickly after we ordered. It was a cold and windy day, so I went with the lunch special half milanesa torta and cup of soup. The milanesa at Bakersfield is one of my favorites, but I'd put this one on par with, or maybe a little above that one. The chicken had just the right amount of crunch, the queso was toasted onto the bread-which gave it a sort of grilled cheese flavor component; it was just all around delicious. The soup was also fantastic; it was a kinda tomatoey tortilla soup with plenty of chicken in it, and was more hearty than I had anticipated. My only complaint was that the potato chips (which I didn't really want anyway) were a little under cooked and slightly soggy.  As is always the case with Mexican restaurants, I regret having ate too much of the chips and salsa/queso before my meal came, and therefore not being able to finish the food. I would blame that on the excellent service... our waitress never allowed us to reach the last chip in our basket, and my glass was never less than half full.   I will 100% for sure be giving Que Onda more of my money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_HltbZl8_98JA2mNrlmcPw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Half Milanesa Torta and soup.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_HltbZl8_98JA2mNrlmcPw/o.jpg"
      }
    ],
    "user_id": "8EFwYy0z662bcJcbt7Of0w"
  },
  "zsSfc8m8_BvOppNT10BqVA": {
    "date": "3/5/2017",
    "text": "Food was great, but don't go in a hurry.  Went for lunch with a group on taco Tuesday. Got there early and beat the crowds so we had no trouble getting seated. Loved the fresh made chips and salsa, tasty variety of tacos and creamy guajillo rice. Unfortunately there was some confusion with the orders and again in paying the tabs, so it took over an hour to get through lunch.  I'm told this was not a normal experience but makes it hard to put this on my list of regular lunch places.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0Zbe27yti4L5PsNrPg7iUg"
  },
  "iWyiMPL0MUyeb-vVQYuBGg": {
    "date": "11/23/2016",
    "text": "Is this place doomed? How many restaurants have been here before Que Onda? I can remember at least three.   Service was problematic, but I'll give the benefit of the doubt since they've only been open a few weeks. I mentioned that I wanted the $2 taco special, and our server had to turn around to scan the specials board to make sure my request was legit. After my coworker placed her order, our server tried to talk her into a different special that was in no way related to what she ordered. And then she had to confirm my order again before she left.  The food is pretty good. The flavor of everything we ordered was fine, but the temperatures were all over the place. My coworker's tacos were cold. Mine were warm, but the tortillas were completely saturated, telling me they sat for awhile before our server brought them over. My plantains were lava hot and my rice was room temp. Seems like the kitchen could work on their timing.   As we were wrapping up and waiting for the check, a different server came by to ask us if everything had been alright. He did that hands-on-knees stance you use when you're talking to children or puppies. It was uncomfortable. And then he stuck around for several minutes aggressively trying to teach my companion several phrases in Spanish. I could have done without the entire interaction.  Once they work out the kinks, this might be a decent lunch option. Uptown is sorely lacking in good taco places, so I hope the experience improves before the next restaurant moves into this location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "STY28Sx9VvUS6395ihhPxg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Plantains, creamy rice, and tacos on special.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/STY28Sx9VvUS6395ihhPxg/o.jpg"
      }
    ],
    "user_id": "0EgbVtQfdNQq3Tapxwl_sw"
  },
  "mtUwJ0Wa3vsksQ4eeqrP1Q": {
    "date": "11/5/2017",
    "text": "Yeah, this is not good food.. guacamole was more like pico de gallo with a scent of avocado. Tacos were okay but not really tasty, and the salsas were \"meh\".  Staff was friendly and decor was nice and that's why they get thr two stars.  Uptown needs a real quality mexican restaurante.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wVZxp8UQVHXSTjs5gS1H3A"
  },
  "jO-a4hxiZ4Ncj98atg2oiw": {
    "date": "6/13/2018",
    "text": "Very cute spot!! Love the decor!! The strawberry margarita was Bomb!!! Went there for $2 Taco night. I had the chicken taco and the veggie taco. The chicken was ok. The meat was shredded with a hot sauce that tasted like Texas Pete. Now the veggie taco was awful! I don't think zucchini and squash should be made into a taco period! The textures did not blend well with the mushrooms or the avocado sauce that came with it! If anything i will be back for the drinks! The chips and queso where good too! Our waitress Julian was a bit slow but she was nice!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_W7YZbAJl5V81SkYfa6KHQ"
  },
  "LbZoUX5rgNnvJrddU2fEvg": {
    "date": "8/6/2018",
    "text": "-Service: 2.  didn't refill drinks & wasn't even busy. forgot drink from bar.  -Food: 3.  Not able to customize your food ( build your own). Bland spanish rice.  -Bar: 5.  Strong drink.  -Atmosphere: 5.  Beautiful art. good up beat music.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "frUuxrCqpN0v_q7J99sqtQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/frUuxrCqpN0v_q7J99sqtQ/o.jpg"
      },
      {
        "img_id": "We9Fohb8ZYs7512EvtpUnw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/We9Fohb8ZYs7512EvtpUnw/o.jpg"
      }
    ],
    "user_id": "pMvhEB6GdzWCNuDd8-GckA"
  },
  "zuvGB2K0ImxavWc6qbPlmQ": {
    "date": "12/23/2017",
    "text": "If you go on Thursday you're guaranteed to get the best margaritas in Charlotte for an amazing price. My girlfriend and I both had the combo taco entrees. Three tacos each but we had to get a fourth to test out the extensive menu. She had the braised beef, crunchy shrimp, grilled steak and tinga del chicken...all excellent choices. I had the crunchy shrimp as well, Coca Cola carnitas, al pastor and the crispy Baja fish. I can't even say which taco was the best because they were all heavenly. My girlfriend grew up eating authentic Mexican food and Que Onda has quickly become one of her favorite places. Back to the margaritas though...$5 went a long way at Que Onda. Ended up on our third round before eating the last taco. Anxiously anticipating my next visit here. Likely coming on $2 Taco Tuesday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vP8apFaY6I7R9DuiQ1tnxg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vP8apFaY6I7R9DuiQ1tnxg/o.jpg"
      },
      {
        "img_id": "OhWLRNR0oza2h8NbjtDfcQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OhWLRNR0oza2h8NbjtDfcQ/o.jpg"
      },
      {
        "img_id": "fkScMaZiPmbyrFOnMy3cpA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fkScMaZiPmbyrFOnMy3cpA/o.jpg"
      }
    ],
    "user_id": "4uZxwu4RGxkciJqFeVWBYA"
  },
  "txxHml5u_yIptHG_rLTaTg": {
    "date": "9/25/2017",
    "text": "If you are looking for a place to indulge on tacos for Taco Tuesday, don't look here.  Short version: Trendy location, great for Instagram but the food lacks flavor, the drinks are over priced and watered down and the service was just ok.  Long version: Excited for my first Taco Tuesday in Charlotte my party of 3 and I decided to try out this spot based on the great reviews and proximity. We were greeted and seated right away (6:30pm). We ordered a selection of tacos from the regular menu as well as the specials. One person ordered a burrito and 2 people ordered drinks.  While we waited, we enjoyed the music selection and taking pics of the beautiful artwork (mostly Day of the Dead themed). When our food came, the presentation was nice and we were all excited to dig in. What disappointment! For starters, the tacos are miniature. The tortillas they were wrapped in couldn't be larger than 4\" (standard taco tortillas are closer to 8\"). I ordered hanger steak, al pastor and market veggie. The most flavorful was the market veggie as it was just grilled and seasoned veggies. The hanger steak and al pastor had seasoning but the appropriate flavors just were not there. It also seemed like they use other cuts of meat.  The burrito was especially bad. The person who ordered it couldn't even eat half of it and when the rest of us tried it, we all agreed it wasn't worth eating...no flavor.  The tacos on special were slightly better but definitely not worth going back for.  I ordered a hot tea, I wasn't given any options so I assumed it was hot black tea (like most other places serve). I was given chamomile, which I am not a fan of. Whatever, it was the only hot beverage besides coffee. Someone ordered La Flaca which was basically a $9 tall glass of water. We were all so disappointed, we left to get dessert elsewhere because I couldn't risk having them mess up the churros too.  We are not the type to send food back so we just ate what we could and paid. The waitress was nice. The ambiance was good. They do have a pet friendly outdoor seating area as well.  I get really irritated when I feel places in Charlotte that serve non-American food are trying to pass something off as authentic thinking the clientele doesn't know the difference .  With so many other good places in Charlotte, don't bother with this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h-Z8tmuY4nz0MPKyYApKjQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. The supposes Al pastor and Hanger steak tacos and the market veggie. Super small!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h-Z8tmuY4nz0MPKyYApKjQ/o.jpg"
      },
      {
        "img_id": "ECxXPk_HL3lUrcr8RRA35w",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Menu 2/2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ECxXPk_HL3lUrcr8RRA35w/o.jpg"
      },
      {
        "img_id": "f2BdSkXFTtfJ264iIN3eoQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Menu 1/2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/f2BdSkXFTtfJ264iIN3eoQ/o.jpg"
      }
    ],
    "user_id": "sVsa-Pev3zKy4Nm-0kTLXQ"
  },
  "bKalbgqR31w4PtFFxAi17w": {
    "date": "1/16/2019",
    "text": "Ahhhhhh-mazing food! I can't say enough positive about this place. The staff are friendly and fast and I have never had a bad dish. I try something new every time and have yet to be dissatisfied. I highly recommend walking in and asking the waiter/waitress to recommend a dish and go with their suggestion. So Good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J8ZgsYkc-Yp8MSXMH1AwYw"
  },
  "Ub6sA_Tryy8-hiE1CIH61A": {
    "date": "8/28/2018",
    "text": "Good food and cool atmosphere, had the lengua tacos and milanesa Torta. We'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NzAmZCUZOKFH5iItFkC2bA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NzAmZCUZOKFH5iItFkC2bA/o.jpg"
      },
      {
        "img_id": "DUZLe4wJqd409okH_IEUXw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DUZLe4wJqd409okH_IEUXw/o.jpg"
      },
      {
        "img_id": "DR8MEKusUSyzbn49KiSKKw",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DR8MEKusUSyzbn49KiSKKw/o.jpg"
      }
    ],
    "user_id": "BnOXYgH9j34aFVv0vSu4DA"
  },
  "lLX1GUOImjvHwaArk1t0bg": {
    "date": "3/26/2018",
    "text": "Awesome tacos. Good service. Avoid the busy days and come for dinner on a week night.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XYDP74LRDXG12TYfshi08Q",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Fajitas",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XYDP74LRDXG12TYfshi08Q/o.jpg"
      },
      {
        "img_id": "kiRlR5Z7TUUnlF5FAi2fqg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Ground beef tacos with extra cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kiRlR5Z7TUUnlF5FAi2fqg/o.jpg"
      },
      {
        "img_id": "K-S7l5wFyAk0WmCtWB6Sqg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K-S7l5wFyAk0WmCtWB6Sqg/o.jpg"
      }
    ],
    "user_id": "e9CGfcVaMADjMXl_lcEdaQ"
  },
  "8bHVacEPWa6b_lPx2xDQmw": {
    "date": "4/24/2018",
    "text": "The Tuesday happy hour chicken tacos left a lot to be desired. They were really small. The queso was extremely thin and had clumps of unmelted cheese in it. The taste wasn't horrible but I'm sure it would've been a lot better if it was fully melted. My friend enjoyed the fish tacos. Next time I will ditch the specials and get something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9V-S12NTkhXc5goGN5Dfbg"
  },
  "ReHfUi1PltePcKQg9Nu9sQ": {
    "date": "10/5/2018",
    "text": "Stopped in last night as we were in town for a concert and it was *National Taco Day*. I had read good reviews of the place and FB pictures of the tacos looked SO good. I'm glad we went won't Que Onda as the thirst Thursday $5 margaritas were great and the $2 select tacos were perfect. I had the braised beef and it was delicious. We also ordered the trio of dips and were not let down on taste or portion. I also ordered a Pepito margarita and it wasn't overly spicy but it was very tasty and full of flavor! I loved the touch of tajin on the rim of the glass. All around we had a great relaxing meal sitting outside before we headed to the spectrum center. It is a quick, short walk and post tacos we were in great moods! Our waitress, Dina, could not have been friendlier. She was very helpful with the menu and night specials and just a delight to talk to in general. I will definitely visit again when we are in the area next. I want to sample all the tacos on the menu as there were several to choose from! As well as a large selection of interesting sounding cocktails! It's a win-win all around! I highly recommend stopping in, especially if you're in town for an event at Spectrum center. I guarantee that you will not be disappointed :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EEZvgkozEWEsvoLFxHmEoQ"
  },
  "gQ60os9dV3EG_z1A2QiYAg": {
    "date": "4/19/2018",
    "text": "Been trying to branch out to different places for taco Tuesday instead of the typical taco places in charlotte. My bf speaks highly of this place so we decided to check it out one Tuesday. It was a bit disappointing to see their special didn't have anything to accommodate me because I'm pescatarian, but i didn't let that stop me cause I understand how you don't come across us too often to put such an acquired taste on special. I ordered the Baja fish tacos and was actually pleased because the size of my tacos were way bigger than of my company who were able to order the tacos on special. The fish was fluffy and I liked it only thing I would maybe say is less fish batter it was a bit overwhelming. We also got the chipotle queso and pleaseeeeeeee stop serving this! I get that it's a benefit for yelpers to receive it for free but let's just say that even for free that queso was more than half way full by the time we left and the cheese was never all the way melted to begin with (disgusting). Overall though the service was perfect, the setting is very nice especially since it's getting warmer, and the food was okay. Enough for me to give it another chance but maybe order something different next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "G9iUao4K24BHwnc2rgtxBQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/G9iUao4K24BHwnc2rgtxBQ/o.jpg"
      },
      {
        "img_id": "SWWLavZ5-nvPU7NF3vjVhA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SWWLavZ5-nvPU7NF3vjVhA/o.jpg"
      },
      {
        "img_id": "vCWWQph-u3RI4tvfvX8oug",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vCWWQph-u3RI4tvfvX8oug/o.jpg"
      }
    ],
    "user_id": "ayVBf253VsV2Es7tD-rgug"
  },
  "EreNsQgLzmwhLVNWo3j72g": {
    "date": "4/30/2018",
    "text": "I just wasn't impressed this go around. The food is in need of some seasoning!!! Seriously bland.   The waitress was nice so I can't even say anything negative about her.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGZ4hYTIjOV3Sdg4QduIuw"
  },
  "zZIEMtiAqHbxNXF3JsyUvg": {
    "date": "2/22/2018",
    "text": "I had dined here once before and wasn't crazy about my experience, but decided to give it a second try as co-workers were heading here for National Margarita day.  It was a beautiful evening and we were able to grab a table on their outdoor patio, which by the way is dog friendly!! We all chose the Thursday drink special- \"$5 House On The Rocks Gold Margarita\"....$1 extra to make it a tall.  It was good, but could have been a little heavier on the tequila.  Chips and homemade salsa are brought to your table (unlimited refills), and if you check in on Yelp you can receive a FREE order of queso (!!!!!!)  I am not the biggest fan of queso, but Que Onda's version has a unique twist to it as they add chipotle in adobo, which gives it a nice kick.  Since we weren't that hungry, my table ordered one Tinga De Pollo (comes with 3 tacos) (pulled chicken, chipotle tomato, pico de gallo, sour cream) and one of the combination of tacos (pick any 3).  My pick was the Al Pastor (adobo pork shoulder, pineapple pico, cilantro, creamy avocado sauce), which was better than the Tinga De Pollo, although it was slightly too salty for my taste.  The wait time to receive our food was a bit long, but also understandable as the restaurant was very crowded! Our waitress was amazing and apologized profusely when there was a computer error and only one credit card got charged.  At least that person got extra credit card points! I will be back with my dog to try out Taco Tuesday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZOLy93tInGyALKYeOi46IA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chips, salsa and queso!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZOLy93tInGyALKYeOi46IA/o.jpg"
      },
      {
        "img_id": "PBKwdGTnYnzaw9b6wDmaKg",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Top (combination of tacos) and bottom (Tinga De Pollo)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PBKwdGTnYnzaw9b6wDmaKg/o.jpg"
      }
    ],
    "user_id": "ePHT83jEzKzip0lcQV_54Q"
  },
  "DnPBtKsHj0RdUMzFCZhY8Q": {
    "date": "11/8/2018",
    "text": "Great food. My mom had the taco salad. Huge portions and the shell tasted awesome.  Not greasy but crispy and light. I had the three tacos. Authentic and so good the filling was overflowing and tasted awesome. Great service. Parking is a bit tough but worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lrEdD5KkxSGLMtiNdS4YNw"
  },
  "db6G1RypCXg-nTebYWhQcQ": {
    "date": "5/23/2018",
    "text": "Wow very good, had the shrimp and fish tacos and guacamole app. It was very good. One of the best Mexican places I have eaten in charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FN3O2f0EHMw25EBbnntdHg"
  },
  "zvzmXSebGMtQ5WlYcvkstQ": {
    "date": "11/19/2018",
    "text": "The the chips and salsa where a great start and the entree was good.  However, the experience was ruined by terrible service.   But when we ran out or tortillas and our glasses where empty our server was more interested in spending time hitting on the red hair bartender then checking on his only table 15 feet away in plain view.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVQbelXAbCJd4Rll3pBbJw"
  },
  "8XiHrtqbyJIfNHdmex6eWA": {
    "date": "12/8/2018",
    "text": "Had some great food all the way around. We had Angel as a bartender and the service was absolutely great. Thanks for the excellent service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LQWWoO_xRy9kzgPBtOwQOQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LQWWoO_xRy9kzgPBtOwQOQ/o.jpg"
      }
    ],
    "user_id": "JYKcSwSIkI5DC9ZWoLuARQ"
  },
  "IC1haWErw6qLt0GrjsYpXQ": {
    "date": "1/9/2018",
    "text": "Que onda is my favorite Mexican spot Uptown. The food is delicious and the atmosphere is very fun. I have had issues with lunch there in the past (being too long and having to get our food to go), but recently they have stepped up their game significantly.   I highly recommend their dip trio as well as their tacos. You can also get the tacos on lettuce wraps for an additional $1 which seems very reasonable to me. We will be back again soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8Ia8e6wLJ45ByYTXM1YNw"
  },
  "XsbsXivzGlEwZtDRiBWy4A": {
    "date": "10/29/2018",
    "text": "I got a taco salad and chips with queso to go! I called it in so I could run in grab it then get home after a long day at work. I get home and I have no chips for my queso. Thankfully I had tortilla chips in my pantry. Its so very annoying that people can't be more thorough at their job. They weren't even busy and they were actually sitting around when I got there. I work in the restaurant industry and know exactly how people can get slack when it's not busy! Don't do it! Always be on point! Take pride in your job no matter what you do! I always tip on to go orders too and it's things like this that piss me off and regret it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GytkspqSPsJhE_yAMQholQ"
  },
  "jlJvXBREVgTk3TguzSiOEg": {
    "date": "6/26/2018",
    "text": "This place was a huge disappointment. After a school field trip I encouraged my peers to go as I once had a great experience here. This time not so much. It took us 15 minutes to even get greeted at the table, the server didn't know the beers that were being served, and seemed highly unknowledgeable. The manager was unsympathetic and lacked common respect when talking to customers, as he was very passive aggressive and honestly quite rude. The only redeeming quality this place had was a very generous customer who was understandable. The town has plenty of taco places who have the same $2 special with much better quality of food and service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TuICPsZkNrW9S8ufbzsWBA"
  },
  "-xOmHrH2uGi54ZiRvrzf5A": {
    "date": "7/25/2018",
    "text": "Terrible service, the food is mediocre, and management sucks. Not only did their serving staff charge multiple recipients on my friends card but refuses to give her her money back immediately. They played the you'll get it back 3-5 business days from now and basically told her to get over it. It's too bad I was looking to bring business to them for an event through my business. It's definitely not happening now.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmXmML2_6YSWEg_gOQ-gEQ"
  },
  "EHJlLJlkAa9-TfD2pwiKYA": {
    "date": "4/8/2019",
    "text": "Pretty good place!! Excellent and respectful service; great inexpensive margaritas; fajitas are excellent; they work hard and really care; go to this restaurant!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rx02L0QqN8Jyc3_cJjb5GA"
  },
  "RnOyMQcpQ5A3veEBZyYPNw": {
    "date": "12/9/2018",
    "text": "Delicious!! Truly enjoyed my lunch here. I had the Baja fish tacos and possibly one of the tacos I have eaten. Great quality fish and flavors. Will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1jUc31JUIkI5D-ya7beNYg"
  },
  "Bib9fZTioC306CKGU1WRcg": {
    "date": "7/12/2017",
    "text": "Wow! This place really surprised me. I've been dying to try this place out and finally made it in for lunch today. I ordered 3 different tacos: Coca Cola carnitas, fish, and a hangar steak. All of the flavors were excellent and the best part was that all of them were fresh and hot! I feel like a lot of taco places in charlotte give you cold or luke warm tacos. The service was very friendly and the menu was diverse. I also loved the warm chips and delicious salsa. I can't wait to come back and try the queso and margs!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hyG4KJSELC08XGkMHAaqOA",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. Chips and salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hyG4KJSELC08XGkMHAaqOA/o.jpg"
      },
      {
        "img_id": "ZkKg5WpNTCk2ByrNwF-_IQ",
        "caption": "Photo of Que Onda Tacos + Tequila - Charlotte, NC, United States. 3 Combination of Tacos: Crispy Baja Fish, Grilled Hanger Steak*, and Coca Cola Carnitas",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZkKg5WpNTCk2ByrNwF-_IQ/o.jpg"
      }
    ],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  }
}