{
  "IcJWm84_cMc5xU0RtNprug": {
    "date": "1/22/2014",
    "text": "Been going there since I was 8 years old. The food is always good, the staff is friendly and you'll never miss a game with all the televisions they have there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSb7Z66aPhixg6X3YuhM9g"
  },
  "SxU254fWSOqeFNsSZ_-wcg": {
    "date": "3/25/2014",
    "text": "The service is always great and the food is always hot and tasty.  It is just typical bar type food but it's good.  The only downfall is that they pack so many tables in there that it is a bit crowded.  That doesn't keep us from going back though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zf7dQXA5vL6kIhNTXjUfqw"
  },
  "AceQbsVgeM2_wCoM-qsFXw": {
    "date": "2/16/2011",
    "text": "If you want to smell like a stale cigarette & inhale tons of second-hand smoke them this place is for you. The food is actually decent bar food & service is also good. But I cannot go back anymore due to the heavy smokey fog that continuely coats everything in the dining room. The non-smoking section is a joke since the bar overlooks the entire area. Smoke just drifts over. I can't beleive the amount of families that regularly eat here. Once again food & service is actually good but I cannot overlook my health concerns with the second-hand smoke. ***Update*** Non-Smoking now but still not worth going.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HG_-DYGnFv3QwnFtB3GVAg"
  },
  "ox867j4JDC042PSdIghmOQ": {
    "date": "3/20/2013",
    "text": "Love Kristophers. They have a lot of local beers on tap and the food is what I would call high quality bar food. The layout of the place makes it feel fairly cozy no matter where you sit and the staff is always friendly and helpful. Speaking of the layout the inside is kinda set up on a two tier floor plan so if you sit up by the bar area you are elevated above all of the table seats. And holly hell do they have a lot of TV's. No matter what your sport is I'm sure it's either already on on of the TV's somewhere in there or they'd be happy to change the channel for you. They also have a lot of daily specials so you can go in and have a drink and a beer and it won't break the bank. There is a patio area there but since I've only been in the winter I haven't had a chance to check it out. It's for sure the nicest bar in the Matthews area in my opinion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M6olJVnPF00VnRDdigWrJw"
  },
  "PX8BbSmZIR5qF76aObiPcA": {
    "date": "11/1/2013",
    "text": "This is our \"local hangout\" place and the choice we always make to bring guests to when we've taken them to all the fancy places. They have a big menu, the best burger in the area according to my husband!  The sandwiches are huge, varied and come with the second best fries I've had in NC (the first are roosters'). I usually get the 49iner grinder and the au jus is OMG. I could drink it! The daily specials usually don't change and the place us always hopping no matter what day. I've not had alcohol here but the bar looks busy and active. The outside patio is the best shaded place to watch tv or hang out. The staff is always super friendly.  Prices are usually 6-10 bucks for sandwiches which feed 2 easy. The Unsweet is good too. The only drawback is that parking can be weird: in back or in front. Who cares? We loves Matthews adorable downtown and you can scoot down the side street to get onto 74. Go! It's a wonderful spot to call My Cheers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gl2y6Ll00_RJ56CfNK5j8g"
  },
  "gO2EUjnSG5IISLA6RK89oQ": {
    "date": "5/24/2015",
    "text": "We are local residents who have been here many times to enjoy good food and a pleasant atmosphere. Today we brought four out-of-town guests by for a late lunch. Our table of seven could sit on the patio on \"the other side\" but we were told no server would be provided. The \"other side\" is still on the patio. When I went to the hostess stand, three employees were there and one confirmed that we would indeed have to fend for ourselves and fetch our own food and drinks from the bar. So our unhappy table of seven left and went down the street to Bean town and happily spent our money there....and the food there was excellent, as was the service. I won't go back to Kristopher's.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rV62FHzewKNd_ClmNXsxAQ"
  },
  "fVhsMgTub1rgNPzErhbW7w": {
    "date": "9/27/2015",
    "text": "Typical bar food... Decent ... When they get busy be prepared to wait forever for service.  Table beside us must have asked for help at least twice.  I'd probably just come here to grab a beer instead of food next time",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xs1MftEQfjbjMeUIm5Xicg"
  },
  "coqyAFivTJDAWY9PTuHEfw": {
    "date": "4/26/2014",
    "text": "I never thought much of this place but tried it again recently and it was alright.  Nice that they have Old Meck on tap, the beer is bitchin.  I had their chili cheese fries and they were a fail.  It was like that liquid cheese like the jar stuff by frito lay.  The chili was like real chili and made the fries slimey and wet.  I had wings as the main course and they were good, no complaints with them.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ns3y8KXKbJuOzrCwPNCnvg"
  },
  "0sxFk1pz3A23ufhy5jpMqQ": {
    "date": "12/28/2012",
    "text": "Had not heard of Kristophers until a couple of weeks ago when a friend suggested it for our couples night out (a party of 8). What a perfect setting to be loud and talk s&it to each other! Great beer selection, TVs galore, not to mention all the bar food you can imagine. Our waiter was fantastic, keeping the drinks coming before we could sip up the last of our glass. He even made me a chocolate shake that wasn't on the menu. Will return for another couple's night out for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ADvSJWpDG3Sh2OLOYe7eSg"
  },
  "qo5aFPqu2p_vcYwVzqqZ_A": {
    "date": "12/17/2012",
    "text": "This is a typical sports bar with bar food.  The food was good, seemed fresh and came out hot.  The portions were huge, so be prepared for 2 lbs of fries with your sandwich.  The beer selection is great.  Love the fact that this place has a ton of local beer options.  The service was also very good.  Plenty of TVs with the games on but it seemed like very little TVs were in HD.  Why spend all the money for LCDs when you don't provide the games in HD?  Seems weird for a sports bar.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U3oy-qGgx8pUQ_s39AUkUg"
  },
  "692DXs1Qr0ihYAv7x2NtWw": {
    "date": "10/20/2012",
    "text": "It's been a while since I was at Kristophers. I stopped in on Friday night to grab a beer. The inside hasn't changed much. Still two tiered inside with a large oval shaped bar with plenty of seating. Lot's of TVs. What has changed is the beer selection! WOW! Lots of local craft brews on tap. OMB, Triple C, Birdsong, NoDa & Four Friends. Not bad! Plus plenty of other beers to choose from. I was a happy man with my I-77 IPA.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "y6RetFLHmLlKHWCQYJ-Trw": {
    "date": "10/20/2015",
    "text": "I've been going here for 10-15 years. Solid sports bar. Friendly staff. Clean. Decent to good food. Beautiful wooden bar. Nice outdoor patio that's covered. Good enough beer selection with clean taps. Can get really crowded on a Friday and Saturday evening, but again....warm and inviting staff and crowd make it all ok. Go here, not Beantown where you might get an STD simply from sitting down.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0yqCA7xVGde0Kp7Zk2OR7Q"
  },
  "2GH9wJE79nxfywe2j_UPZw": {
    "date": "3/15/2013",
    "text": "Pretty standard fare sports bar ... not going to blow you away, but also not likely to fall flat on its face.  Nice to have a stable place like this in downtown Matthews as part of the town fabric.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyQrUamokaPLDrBxGmzPnA"
  },
  "wOdSDWP7vBGRRuoLLOyjjg": {
    "date": "10/3/2015",
    "text": "One of my favorite Matthews restaurant!!  Cool family bar environment with good sit down food.  Mixed drinks are good too.  Same staff forever",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mNNw7ZAi_YmsIsGHKuruKw"
  },
  "FkQe1FVhpeDAVlclp4o_VA": {
    "date": "4/25/2013",
    "text": "Went to lunch today and had a good meal.  I enjoyed the $.60 wings and tomato florintine soup.  My wife had the burger.  $1.90 PBRs were on special too!!!  TVs to watch everywhere with all sporting events available if you ask.  Service was good and WR will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OK0mMK6VMgxEOgpxHG_AhQ"
  },
  "OXc3JbUte2o-bstVXKmuQw": {
    "date": "11/13/2010",
    "text": "If the measure of a great sports bar was the amount of televisions on the walls, this place would be amazing.  The tv's are all newer and turned to something sports related.  It's a small restaurant so thankfully smoking is banned because there is absolutely separation between the bar area and \"dining room\".  The food isn't bad either.  I've had the Philly, hot dogs, burgers and they were all pretty good.  Parking isn't bad either and it's close to home so if the drinking gets out of hand, I'm not too far for a ride home.    The only real negative about Kristophers is that it's old.  It just feels old - like an 80's sports bar.  While everything looks clean, its age makes me think it isn't.    That being said, if you're looking for a place to catch the game or any sport, Kristophers is worth a shot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bdlFwefJOfC8xBiezIF4AQ"
  },
  "4SgkGBW4xbfg1veXdwb5wA": {
    "date": "8/14/2014",
    "text": "(2.5 stars)I'll keep it simple: great for watching a game -- they have about 9,000 TV's to tune to whatever you want. The food is meh... Totally typical and unimaginative, and probably from frozen ingredients.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TLYjzQd8ZMMDfOaHGxPgA"
  },
  "FwNho5ACVupDfHHJWyyjTw": {
    "date": "1/27/2015",
    "text": "Great menu, lots of choices.  Wings, pizza, club sandwich are just some of my favorites.  Hands down best chili in Charlotte.  Lots of beer on tap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s8MiJBFrUlFK5gnh8sei9g"
  },
  "c3Uf7juisMt9rb-N7ZUuYg": {
    "date": "6/25/2006",
    "text": "It is tucked into a corner of Matthews, right over the train tracks, and does a big bar crowd on Saturday night. Therefore it has a funky medicinal smell on Sunday. Very small non-smoking section.   This is a HUGE sports bar with so-so food.  Every table has a view of several t.v.'s turned to everything from darts to Nascar.  Even my 10 yr. old doesn't give this a \"thumbs up\"!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "CXyW9jWcMp1y8IUYnFZsZw": {
    "date": "12/13/2009",
    "text": "This is a sports bar with sports bar food for people who are looking to watch sports. I think almost every available wall space has a tv (or it seems that way).   If you can't find a game they will try and help you out. Don't go looking for a gourmet meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7MI0oX7_fTwjU5NML80jsw"
  },
  "CtKWxVY1JDCz6T0DArG9EQ": {
    "date": "4/16/2015",
    "text": "Pretty much my go-to for wings; it's the best thing they have, in my opinion. Hot with ranch. Soo yum. They also make a good chef salad as long as they drain the lettuce well... Never been impressed with their customer service though.  3.5",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8n2T5-ksUl9MeIPxobzkkw"
  },
  "rTj-roJXDQeLqeIWz14FhQ": {
    "date": "2/2/2015",
    "text": "Kristopher's is a nice sports bar with many TVs.  It feels like an irish pub and has a decent beer selection.  We ordered our food and were kind of in a rush which we mentioned to the server.  She took our order and our food came out within 5 minutes.  Everything was still very good in the short time.  This place has burgers, sandwiches, and pizza.  Typical pub far",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "m_RXO-QEdyYRl5vw1hukPA": {
    "date": "9/9/2013",
    "text": "Pros: 60 cent wings Monday nights, great menu selection, lots of TV's for ball game nights, consistently hot waitresses, laid back atmosphere, decent beer selection.  Cons: Loud.  Very slow service on busy nights, some awkwardly located tables between the hostess stand and the restrooms....hope that's not all that's left when you get there, kinda dark and gloomy, lots of gawking locals (well, it is Matthews NC after all), karaoke nights can get very loud and very annoying for folks just trying to sit and dine.  If they cleaned up the place a bit (removed some clutter nick knacks from the walls and got HD cable for all tv's) I would consider 4 stars.  Need more wing specials too.  Overall a decent place though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlX5pM_u-v57KErnTTNMAQ"
  },
  "ehaBswc8uCgX5A0_k8fPLA": {
    "date": "1/7/2016",
    "text": "Krisophers is a fun place to eat some awesome wings or maybe a Ruben with friends and family, we like to sit at the bar and watch the games, the staff is always attentive and helpful, never do we run out of beer or tea! That's alright with me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "08s64tfZ0Jvx1DGlkv77Xg"
  },
  "zLzBnhfYl5Hc_SpRTjoE_g": {
    "date": "9/24/2017",
    "text": "my friends went there for lunch today. sept 24 2017. it was an awful experience. the waitress was in a bad  mood. the cups, silverware, and plates were dirty. the waitress was in a bad mood. she looked liked she hadn't washed her hair in a week. she complained about her boss and how bad tips have gotten. the food wasn't good. kristophers used to be great place. it has really gotten bad. I'm surprised the health dept has shut them down yet. me an my friends will never return there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "am4j5csLQKVdbEIW2lw-qA"
  },
  "6Fu5CiyE3-XerhVkFiEPHQ": {
    "date": "6/11/2013",
    "text": "Great little neighborhood spot.  Something about this place just really sticks with me.  It might just be because the other Matthews options are Finz (OH GOD!) and beantown(not bad but not great), so given the limited choices, kristopher's large beer selection, and the cool atmosphere I always enjoy coming here.  The food is decent, nothing will ever jump out at you as being the best of something that you have ever had, but its always a pretty decent meal.  Craft beer prices are a little high, but there are usually specials, and there is always a dirt cheap beer like PBR, High Life, or bush light available to the budget savvy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a6mgwpzyZLIFqExeXZErrA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a6mgwpzyZLIFqExeXZErrA/o.jpg"
      }
    ],
    "user_id": "vDLUH_ausyAIgAYZJ1tmDQ"
  },
  "g6G3fWIQf0WYkyOF1jVm0g": {
    "date": "1/2/2013",
    "text": "Kristopher's is a divey sports bar located in the heart of Matthews. If you're a raving sports fan like me, it's a great place to go and catch the game with your buddies.  The staff is ehhh... Not overly attentive or awesome.  There always seems to be some sort of drama amongst each other (more of the night shift). (Note:  You should probably not talk badly about each other to patrons.... Doesn't cast the best shadow of your establishment.  A big reason of why it gets 3 stars from me is the wings.. Absolutely amazing!  My ex is from the Buffalo, NY area and after eating their legit wings, I took him to Kristophers to make sure I wasn't crazy that they were better than at the birthplace of wings, the Anchor Bar.  He actually agreed that they were better.  So, take that for what it's worth.  Overall, there really isn't anything holding me to Kristophers. Maybe if I get a wing craving but other than that... It's so-so. Nothing really unique that gets me coming back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sq8rtkRoKA7KQKhlU4_yuQ"
  },
  "2pL4jbm0qX6Ju7lTZMat_w": {
    "date": "9/23/2016",
    "text": "I asked the waitress if they used MSG in their food because I have a severe intolerance. She came back & told me that no one in the kitchen knew, so, to tell me that it was in everything just to be safe! So, basically, I could not order anything! I asked if they couldn't just read the ingredients if I picked an item and she said that no one in the kitchen could speak English, so, she would text the owner and ask him. She came back and told me that he said that they were not a ***** Chinese restaurant and no they did not use MSG. Let me lay some knowledge on the owner, MSG is in MOST batters for chicken, shrimp, etc. It is in marinades, dressings (ranch), chicken broth, BBQ sauces and in many processed foods which their restaurant is loaded with!  I feel certain that it is in lots of their food and he just has no idea! FYI, owner, Outback has gone MSG free. Chic-Fil-A has now taken the MSG out of their batter and marinade. It is not just in ****Chinese food! It is a food preservative and flavor enhancer! Take the food allergies serious and don't tell someone its not in something unless you know for sure! You could send someone to the hospital or worse! Will never eat at this restaurant again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3I-xy123RqdTQKPYwD_DOA"
  },
  "yhtHe9ro9IvpbA19PPzXGA": {
    "date": "10/23/2015",
    "text": "I been going here frequently now it's a really relax atmosphere lots of tv and beer options the menu has multiple options and with daily special that's a plus. Maybe when you enter there isn't a greeter which I thought was odd , but over good spot to eat and chill",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYwlwkGGTIIA_qu8GZKExQ"
  },
  "Ao7bHBhLZ5xLoCI5AOL6Ag": {
    "date": "6/17/2012",
    "text": "I was really really surprised to see all of the mediocre-to-bad reviews of this place. I've been going here for several years and wish I had known about it when I first moved to Charlotte!   I can agree that the interior/decor isn't up-to-date or anything, so if that's what concerns you most about a place to eat, Kristopher's isn't for you. However, if good American food and friendly service is what concerns you most, I can't recommend this place enough.   I had my first Buffalo wing at 21 (yeah, super late bloomer - guess I had a sheltered upbringing). Since then, I have made a point to try wings at just about every restaurant that offers them as a menu option. Kristopher's wings (medium heat, buffalo style) are the best wings I've ever had in my life, no exaggeration. Every single time I've been there the wings have been consistently amazing, so it's no fluke. The rest of the food is decent in my humble opinion, although in the interest of full disclosure - it's possible my love of the wings clouds my judgement of the other food.   Anyway, that about sums it up. Oh, the service is always great when I'm there, and I'm not some kind of recognizable 'regular' to them as I don't live on that side of town and visit as often as I'd like. The hostesses/waitresses are always friendly and the service is always prompt. Plenty of TVs for sporting events are icing on the cake.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZOuJ4rk5uiysEqCIstDDIg"
  },
  "E_M3FXzrG0BGYnv_CFFCWw": {
    "date": "8/4/2015",
    "text": "What  a cool place! It's right in the center of the historic town center of Matthews. The atmosphere is great, it reminded me of an authentic Cheers style pub. I ordered a burger and potato salad and my spouse got a salad. The potato salad and burger was great and the salad was comparable to what you would get at a great diner. Add in a great selection of draft beers and lots of TV's, great service, and family friendly, yet festive atmosphere and you have a winning combination. I look forward to going back and trying more items on the menu. I loved this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ct8gl9NA1ygLkf-o8hvQYw"
  },
  "CdpforyjDEvpokH5UduMww": {
    "date": "10/1/2016",
    "text": "GREAT PLACE to eat, drink and have a great time.  The bar staff is friendly and makes you feel right at home. The food is WONDERFUL.  We have tried many, many items on the menu and have never had less than outstanding food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "851859HdC48DavBVVvOhjA"
  },
  "yRBgadyleDa19sX1QdEv8w": {
    "date": "8/25/2015",
    "text": "We're new to NC and stopped in today for lunch. We ate at the bar (i forgot to ask his name but he was excellent). The spinach salad was incredible. Loved the smoky bacon in the dressing. My hubs burger was equally great. Cooked perfectly and dressed properly. The hostess was a bit abrupt, not rude exactly, just abrupt. Otherwise a nice experience in a very cool place. There's also a large covered patio that I look forward to enjoying in the near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "48TlVx3ypWCoOxY2_LQtzQ"
  },
  "SNG-kEKrwXuaxFa3dPb7Gw": {
    "date": "4/27/2014",
    "text": "The food is always excellent (there nachos are awesome) but there drink prices are a little high which usually turns me off from drinking there. Atmosphere is ok, in my opinion there trying a little too hard with the sports themes and it's usually really dark.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ole2m4kxX83MO0mkm2E3bA"
  },
  "H5dszK4tTy2yQ3OdwN--cQ": {
    "date": "11/23/2011",
    "text": "I've been to Kristopher's a few times; it was the first \"local\" spot I visited when I moved to this part of Charlotte. You can quickly tell it's an established, casual place that can weather the trendy storms. Yes, it is dark inside. It's not the newest place around, and back in the day dark wood everything was in. They have a split-level dining room, with tables and booths on the entrance level as well as more tables and a full bar up a half-flight of stairs, as well as a roomy patio. Kristopher's is a sports bar through-and-through: sports memorabilia fills the walls, at least on the spots that aren't already occupied by a TV. They pride themselves on having the most number of TVs in the area and I think they're right. My only complaint is the headache-inducing pink lights over the tables.   The service is very casual and laid back - all the servers have the personality of someone you feel like you've met before. There are no uniforms here - just non-pretentious hospitality.  The menu has a lot of what you would expect to find at a sports bar - burgers, wings, pizza, chicken tenders (which are amazing, by the way). They also have a page of deli sandwich creations which all bear a sports-themed name, tying into local college sports when possible. All-in-all, the food is okay. Nothing exceptionally grand, but nothing sucks either.   Kristopher's is a comfortable place to hang out, grab a beer and a sandwich, and just enjoy the company of your friends (and whatever games are airing on your table's 20 TVs).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yNsOssYIr3EzAoJAPBerqg"
  },
  "BW29NOhpiObM9QFzdjr88g": {
    "date": "9/11/2014",
    "text": "Great place to go for some football, there are plenty of TVs at every angle. The food was exactly what I hoped for, yummy bar food with big portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXOrtshU-xeKfqc5ce87ig"
  },
  "TyUvkwgBL-Q67nS9Ie9igA": {
    "date": "11/14/2011",
    "text": "Kristopher's has been in Matthews for as long as I can remember.  Given that I'm a native to the area, that means it's been around for around 25 years.  If it's been around that long, it must be solid, right?  Well, yes it is.  As others have mentioned, it is dark, but that suits their vibe.  There's also a ton of TVs, which can be distracting, but thankfully they're all muted.  Otherwise it would be unbearable.  Service is friendly and relatively quick.  When they're slow, they'll have you seat yourselves, but the waiters are always quick to notice when new people settle down.  The food is ok.  Not amazing, mind you, but not bad by any stretch of the imagination.  Actually, wait, I lied: the chicken tenders ARE amazing.  By far the best in the area.  You should try those first.  However, Kristopher's best quality is beyond these characteristics.  The thing that truly sets them apart is that they're open late!  Until midnight on the weekdays!  If you live in this area, you'll understand why that's special.  Most places in Matthews aren't open till midnight on the weekend, much less on a Tuesday.  Yeah, so, Kristopher's isn't fine dining.  However, they're a Matthews institution, and for a good reason.  Where else are you going to go after 8?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "5EpGJ5ymJ7ycukPKxokMJA": {
    "date": "8/26/2013",
    "text": "A landmark in downtown Matthews known for great wings and good beer...and that's all. I was a little confused by the comments about \"great service\" I've been going here for 8 years, but it is not the service that keeps bringing me back...they have killer wings and sandwiches, and good drink specials. Knowing the service is lackluster,  I usually get the wings to-go for a more enjoyable experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HVq7SYfZ4hpFFVsAU_Ub_Q"
  },
  "AoYbtb_RlY6_P2xocFVXNg": {
    "date": "5/5/2014",
    "text": "We happened upon this place when we were trying to find something to eat in Matthews. GPS gave us a few plaes that were out of business. The food was great and the server was perfect. Very attentive and had good suggestions. Solid beer selection and good kids menu. Will definitely come here next time I am in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LBbVC9nflTp5vjRxsuAxCQ"
  },
  "a1VTPRj0cJYXxNX6M962_Q": {
    "date": "10/7/2014",
    "text": "Good food, great bar atmosphere with lots of TVs! Beer specials could be better, but certainly not the worst. Outside patio is an amazing space to watch the games.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vDUQvvkURAvw2rv68-J_ew"
  },
  "CUba_B-SIV_GbrWhd6A_PQ": {
    "date": "2/28/2017",
    "text": "Great food, service, and environment.  Thin crust pizza very good and the NC Burger on Rye Bread was awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMgVBa-yBQymjWAKjKsxUg"
  },
  "pOD-eP-Czv4Oa2ddvxrVWg": {
    "date": "2/12/2014",
    "text": "Kristopher's Bar & Restaurant Is a great place if you like sports bars ! For Me I'm there for the Buffalo Wings. I love the Hot Honey and yep 2 Dozen its a bit much for one person but what the hell its not like i go every week and I have leftovers for the next day. It gets crowded so get there early its always packed. The staff is super nice and if your into Sports on TV they have them everywhere ! They are right on the corner in downtown Matthews and you can't miss the Big Green awning for outside seating. Grab your friends and family and go try it ! Its just a cool place to hangout drink and grab some Good bar food....again I love the wings there.   Buffalo Wings A dozen chicken wings served with crisp celery and blue cheese. Your choice of Mild *Plain* Medium Kicken Ranchers Honey Mustard Hot Honey Hot Garlic Hot  BBQ Teriyaki Spicy Teriyaki Caribbean Jerk Rub Jamaican Jerk Sauce Robby Wings *Crispy Double Fried* Firecracker Sizzling BBQ Extra dressings 25 each. Add Carrots 50 extra  $10.99 1 Dozen  $21.99 2 Dozen",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WdxUn95dt_z-63FDvTh1g"
  },
  "9uvdWcMpPMbkm2d_lD75Zg": {
    "date": "6/17/2013",
    "text": "Another stop on the Matthews tour...Kristophers. I've been many times over the years, most recently this weekend.   I've liked it more over time - now that I've honed in on what's best there. I won't keep you in suspense- it's the wings! Love them hot with extra celery, yum! They come out hot and the wings themselves are meaty and tasty. I don't find the hot too hot, but just hot enough.   We usually sit at the bar, so I can't say much about the service - the bartenders are busy, but friendly.   They do have 10 Charlotte/NC beers on tap, so big props for that. The draft prices are a smidge high imho, but I still like to support local.   Oh, I do have to warn you about one thing...the place is pretty divey in general. They could really use a renovation. They also have red lights in there, which I will never understand. But, for some good wings, I can get over it!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RS5JztShXARj8kDJoDs0-g"
  },
  "GvyMXz5K9HU_yiCzrouQOQ": {
    "date": "11/11/2015",
    "text": "If you like chicken wings and sports, Sunday's and Monday's at Kristophers are for you!  Wings are $0.60 each, and the ranch rub they offer as a selection is to die for! There's a TV every direction you look so you'll never miss a moment of the game either, and plenty of cold beer to go around too.    Saturday nights are great for trivia as well! Bring a team and try to win your bar tab.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LHYGF92lvCy-6PPFuGLzNw"
  },
  "n1Oyntbs-amlq1YNL7gWTA": {
    "date": "3/26/2017",
    "text": "Huge variety of food and it's is very good, enough TV's for everyone, parking is tricky, good staff. Great Matthews establishment!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KqhqsNRLdpflaNFHY46efA"
  },
  "QY2Tc4sQv0Cl7VtbteVKRg": {
    "date": "9/27/2017",
    "text": "Okay place nice selection of beers on tap. Decent amount of TVs. Average food selection.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "79Vv70bMS1JC9ASCg4dWqg"
  },
  "pRzhbHTuBJZuuZsny8J-xg": {
    "date": "2/20/2017",
    "text": "By far, my favorite local bar/restaurant! Always our go to place for wings and a cold beer! Delicious! All of the bartenders are awesome and friendly. Make sure you make this place next on your evening out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P0fPsXtQP4gGgP_d4p5Osw"
  },
  "nkwrc84f6MmqoNJVcNkLXQ": {
    "date": "8/22/2015",
    "text": "It is your typical bar food and there is something for everyone. Many local beers on draft. There are a lot of TVs for whatever sporting event you want to watch.   Kristophers is my first choice for bars in Matthews.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5oMgd-o3ro6iSWmBG4bU2g"
  },
  "Y-9mYVTgl4lidMifY37zhA": {
    "date": "10/30/2016",
    "text": "Haven't had the pleasure of dining here as of yet, but hope to do so in the near future. I wanted to make marks on their extensive seating accommodations and their variety of on tap selections is very impressive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIS0wS0l8ETdozkhli8NmA"
  },
  "BzSd8fbD0S0xrU50-ENyAA": {
    "date": "3/5/2015",
    "text": "Been coming here for almost 20 years. Food is consistent ( in a good way ), everyone is friendly.  Best wings in town, Enormous burgers, and veggie options for that one person in every crowd.  Get here early during March Madness, as the place is always packed.  50+ TVs with all the sports packages. What's not to like?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2gq4JFtcfKJwbHtz1fsc0Q"
  },
  "W_lpZX6k15gH1ZCcLNsO5g": {
    "date": "2/24/2015",
    "text": "This place is the jam! We have been coming here for years and the service is always consistent.  The restaurant is dated but authenticity sports bar.  The servers know their menu very well.   The lunch service is very slow at times when the place gets hopping.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AHc5w4vqQGmQodrD2-ikYw"
  },
  "uvquPKJGfCaMTnYSBSl59A": {
    "date": "6/17/2014",
    "text": "I've been to Kristopher's twice and I have to say their (huge) menu has nailed each item I have tried. From sandwiches (Reubens, burgers, Phillies, etc.) to salads, the portions are very generous and reasonably priced. And Kristopher's hands-down have some of the best wings I have ever eaten - I especially loved their Jamaican Jerk wings, which are irresistibly crispy because they are just seasoned in a dry rub (genius and delicious).   Did I mention they have fried pickles? The good kind, flour-dredged chips (those battered spears are an abomination and should be wiped from the face of the earth). Forget you, Hooters - Kristopher's eviscerates you in the wings and fried pickles department.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcBDHJQEJ_n0RV4hZsJu9A"
  },
  "eLslp-2sHPPYc3Nk9Se0QA": {
    "date": "3/2/2014",
    "text": "This place is definitely not what I expected when going in on a Saturday night. It was very crowded and it's more of a restaurant feel than a bar feel. But perhaps we were there a bit too early. I heard there was karaoke later that nigh but we didn't stay to see it. But who doesn't love a good drinking karaoke session!?    Pros- the bar has tons of drink choices. From martinis, to wine, to a decent beer selection. They also had Jell-O shots? I thought the wine was a great list for a sports bar and they have 26 flavored martinis. I tried the lemon drop and enjoyed it.  The food. The food is really good. It's greasy fried bar food of sorts but really good. The portions are huge for the price and you definitely get your money's worth here.  Cons- The service. The service is slow and sporadic. I feel like our server was pretty weeded and I feel it showed. I had to get up to ask for a water refill (our nachos had hot peppers!)  but if you go in with bar expectations service really isn't a huge issue.   Overall this is a good place for a great night out. Crowds are diverse and it's a good mix.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3wJYcNbb1aA1upSAOdBeA"
  },
  "mIKIWNn2C9XxQR1yG6A1zw": {
    "date": "5/22/2015",
    "text": "First time here. Memorial weekend. Brought my girlfriend and they did not disappoint at all. Meagan is an awesome waitress. The pub burger is off the chain!!!! The beer is ice cold!!!Ask for Meagan. She is one of the best!!! I have found my new favorite sports bar!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IM5gzsnZxPJSLasMzrlGpg",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IM5gzsnZxPJSLasMzrlGpg/o.jpg"
      }
    ],
    "user_id": "RaDFqhqEav6QAjpKDRFVjA"
  },
  "4wJZjt_OgY9BBJUedjK4Cg": {
    "date": "1/5/2015",
    "text": "Great local Sports Bar! Great food! Great service! Great view of the TV's for sporting events!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2TJI8HvqbmwKhnrXInZ2XA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Chicken wings are excellent!!! Great bar for sports and about average bar food! Great local sports bar!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2TJI8HvqbmwKhnrXInZ2XA/o.jpg"
      }
    ],
    "user_id": "0_9HCOdSBSrgeboN_pDcgA"
  },
  "-MAzfehASr8qZpRIbWryNQ": {
    "date": "2/25/2014",
    "text": "Went to kristophers last night for wing night. Big fan! The layout of the restaurant was cool, the waitress we had was really friendly.  A nice beer list always helps. Lots of local/NC heavy hitters  Got the Jamaican jerk wings (8). Very tasty, good sized wings. Loved the tobasco at every table, made everything better. My only complaint is if it wasn't wing night, it might've been a bit pricey. Will definitely be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSV0Hey39adDKpUg4uXiXw"
  },
  "BVpi0ahfTgO8mOsVN1GZyA": {
    "date": "5/11/2014",
    "text": "They have a hidden surprise on the menu I recently discovered.  Their onion rings are unbelievably awesome!! Nice and thick with just the right seasoned batter accompanied with a special dipping sauce. A must order every visit!!  Also a nice beer selection and daily food & bar features. Patio is fun also!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AbiBqOzSBKA5Z4o5--lR5A"
  },
  "VdYCes28pCggnzn-ONw83A": {
    "date": "4/11/2016",
    "text": "Some of the best wings in town. Nice beer variety and lots of tvs.  More of a pub than a restaurant with some outside seating , kid friendly and fun atmosphere",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HSC24ihS6bZHbwFBPWVaSA"
  },
  "u3CovCLcaW15uyHnf77fVw": {
    "date": "12/29/2015",
    "text": "One of my favorite sports bars.  The menu has good options and great food.  I recommend the potato skins.   Good beer selection,  several local favorites (Jam Session) et al.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8nM99tKg_E5itW37f5oeA"
  },
  "3p3MUeOp2NPReyKkY0noLg": {
    "date": "3/5/2011",
    "text": "I've always wanted to try this place since it's been around for as long as I have lived in Matthews, but I never had an excuse to go...  Kinda glad I've avoided it until now.  Went here to grab a drink, was not greeted at the door... so we sat at the bar - looks like they have a lot of regulars, but we had to almost had to shoot a flare gun to get our orders in.  After that the bartenders made a disgusted look when the saw our tab and the apparent \"tip\" he deserved for 2 seconds of twisting the cap off a bottle.  I may give this place another try, but for now... bad taste in the mouth will make me think of other places to go before this one.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "PzFbNe8Fl52-oRrRLoZEcw": {
    "date": "1/4/2019",
    "text": "Food is good, service sucks. Takes forever and a day to get anything or even get a waitress to come to your table.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qC4opWY4pzLgpNJMpIam7A"
  },
  "Lbl4A0dLrZSqzfeZfPZGxQ": {
    "date": "4/9/2018",
    "text": "Great service this weekend. Always a large selection of food and beverages. I believe daily beer specials as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_7Ceau8knJq9rEb4expEw"
  },
  "rr0MRyh4naqN2NUjwid34g": {
    "date": "12/2/2017",
    "text": "Good: food was good, beer was cold. Bad: This is a sports bar right? Me and my friends came here to watch the Big10 & ACC championship games and they turned the volume off to play trivia...loud as hell. It sucked so bad we went across the street to finish the games. Stay in your lane! If you want to be a sports bar then play sports not trivia during a major sports event.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F_kfrylffa0ZvFWfvGt-aA"
  },
  "bWMZLycuu4nvSLpGKERE-Q": {
    "date": "5/29/2018",
    "text": "Bar service was amazing. And the food was perfect!!! Yet, one of the servers was wearing a wife beater. And that's completely trashy. If I had someone serve me in a wife beater I'd be more than upset. Oh... and the bar closes at 12, not 2.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jioGcCyfKhmcpUcNpFPCjw"
  },
  "123ciwtWPaavL0_wRv4NdA": {
    "date": "10/2/2018",
    "text": "Always loved this place when I lived in Charlotte, still have great wings but the pizza is a disaster, my suggestion stick to the wings",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LsfbeSrYkJ4lJd634SHQbw"
  },
  "_C2V0Qyw-16NCM3el47xYA": {
    "date": "5/4/2018",
    "text": "Love this place. The food is really good. The staff is friendly. Try the onion rings, the .50 ugrade is worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qEmnrtoApkLrtLVm22muuA"
  },
  "Mt1b1cMsN3YJncuxSucMhg": {
    "date": "1/6/2018",
    "text": "Matthews best and oldest bar. That miss fear is a fun sports bar and the food is delicious in the beer is extremely fairly priced. I come here more than anywhere and it is a great place to have dinner or just go to the bar have some drinks and watch a game! My all-time favorite bar in Matthews!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_za5jpnwhLNjaVfyLB9L_g"
  },
  "xD8nzTMh6lrk3abGJljsvg": {
    "date": "2/28/2017",
    "text": "Was pleasantly surprised by the stromboli, I do not like a lot of dough Nd they didn't let me down. Your get four fillings and a side. I did mushrooms, onions, spinach, bacon and beef. Awesome! If you're looking for Italian stromboli this isn't quite, I like this better. I wanted to taste the fillings with minimal dough. Very happy and the coleslaw as a side was great. I'd recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F27oIj3RgG2a7NUzS5VkeQ",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/F27oIj3RgG2a7NUzS5VkeQ/o.jpg"
      },
      {
        "img_id": "fmyfX-IMhz5TKBHDZ-C3gA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fmyfX-IMhz5TKBHDZ-C3gA/o.jpg"
      },
      {
        "img_id": "PPtPQ0hNI22aXGG9s0CnnA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PPtPQ0hNI22aXGG9s0CnnA/o.jpg"
      }
    ],
    "user_id": "dGpvCBDP_LH6GWmDDN6r5g"
  },
  "aZ69nyO8MdB27QDUB2e5vw": {
    "date": "4/30/2017",
    "text": "I really really love this place and have for years, that's the only reason I'm giving it four stars.... but recently service has really gone down hill! Saturday night, when usually this place is packed was cleared out by 10 o'clock. Our server was awful, she cashed us out at 9:30, there was 10 of us.....she could have potentially made so much money off our tables and she cashed us out and nobody ever came back to the table after she left..... so we left!! Was it her first day? Did she work a double that day? Who knows??   What the hell is going on at Kristopher's?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xgFneE3_uIIrvDX5Rq7lA"
  },
  "UV_g2Dp3k4XXRPcWjjVF0g": {
    "date": "7/3/2017",
    "text": "BEWARE..Atmosphere not for everyone!  Disclaimer: If I could give it a ZERO I would.   We were a party of 8 planning a nice evening out after hanging out. We decided on this restaurant because it had a good variety of foods.   As we sat down, we saw the waitress was very friendly to the other table and immediately when she came over to our table she was not. We noticed the waitress was not welcoming at all. She was not friendly or engaging. People want to be blind when it comes to race, but people have underlying prejudices.   As we were ordering, we were a little unsure about our orders being that it was our 1st visit there. The waitress she was impatient and her demeanor was very rude. One of our friends asked about the fries (quantity) since it was $4.99; she rudely replied with an attitude, \"It's a good portion.\" Then his wife said to just give her water because the lemonade didn't taste like lemonade. She took the glass from her and walked away and threw it (in a pissed off manner) into a dishwasher bucket. When she returned, I asked her if we could have someone else serve us because it seemed that she had an attitude with us. Instead of her saying, yes no problem, she began arguing with me about her attitude. She stormed off and our group decided this was not where we wanted to patronage.   Once outside, we stood there for about 10mins deciding where we were going to go and no one came out to ask us what happened. This life is so surreal. This was each of our first time, and definitely our last! Don't support businesses that don't want your support! Read between the lines!",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nGUeQK1RzEn_YvMt4MMZMA"
  },
  "1BZYxs1qRHz6LEL97m1u2w": {
    "date": "8/30/2016",
    "text": "Always...always...always great food!!  Beer is always cold and never \"out of stock\" like some other local places.  This is the best place for locals!!! My favorite wings are the Jamaican Jerk...favorite beer...Highland Gaelic Ale!!!   8/30/16 Something has changed at Kristophers.  First..fried pickles are gone!!! W H A T ????? Menu has changed and a fee other favs taken off   My favorite wings are still good but even those seemed to lack flavor this past weekend. I don't give up easy on a favorite place and Im sure I'll be back.  Just hope they don't slip any further.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "st7RIqRKhIhdpKb2KmnjQA"
  },
  "X4D10udQ85ROhwbekz2UBQ": {
    "date": "5/28/2016",
    "text": "Good spot to catch a game and enjoy some beers, perfectly built for that. Food wise, it was ok. I started off with the chili and that was by far best thing I ordered, it was meaty and good taste. I followed that up with the philly cheese, it was odd, I've never have eaten anything that had zero flavor to it, it literally didn't taste like anything it was super bland, I had to douse it with hot sauce to give it some taste. Onion rings were good, overall it was nothing special, would go there to catch a game but not necessarily to quench hunger.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n09adQVlHjd1KdeRj1ZtZA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Philly cheese and onion rings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n09adQVlHjd1KdeRj1ZtZA/o.jpg"
      },
      {
        "img_id": "a69M2L822QskztFtdNu8iA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. The chili",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/a69M2L822QskztFtdNu8iA/o.jpg"
      }
    ],
    "user_id": "TVKzACj3EZueCYbdGEqYIQ"
  },
  "23lgEuyrzRhK2wvLn29f-Q": {
    "date": "8/13/2014",
    "text": "Huge menu, great selection of beer and a two page martini list. This Matthews staple is usually fairly busy but the customer service is great, food is good and they have drink specials each night.  I got what was basically a French dip with green peppers and onions. It was large and the au jus had decent flavor. The home made chips were very good though they do charge an extra 25 cents for a size of ranch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "dCKPTPuAieo3OnBZ68TZNg": {
    "date": "3/31/2018",
    "text": "This place sucks ass.  Dude in the yankee shirt was terrible.  Beer was drinkable, but the service made the beer not worth it.  Glad my friend paid for it, or I would've walked out.  Thanks for nothing",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOi5o8MFWvphgl3JSHO2iw"
  },
  "pTdvko8Tntjq-YH-Zh9WVQ": {
    "date": "1/16/2018",
    "text": "It smells like this is where emphysema patients go to die. The stench of smoke soaked walls mixed with an odorous cleaner seeping it's way into the bar area stunk like a mixture of mildew and rotten crotch. Food was terrible. So was the entertainment. Hard pass.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6dwrom-jxcSThlq3aizyg"
  },
  "kB5BBixHBtl5pMz0kgCeyg": {
    "date": "7/5/2017",
    "text": "Our family had been going to Kris' for twenty years and I cannot recall having poor service or a bad meal ever!  The wings are some of the best in Charlotte. My kids love the chicken fingers and the burgers are always great.  The fact that you can have a pint of ice cold PBR for $2 'anytime' on top of constant drink specials is great.  The prices are very reasonable and the staff cares about the quality of service. Tons of TV's and great atmosphere for college football/basketball and NFL (too many northerners is the only problem ).  My out of town guests always pick Kris' for lunch/dinner/football games!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "llguMS0kohEcjNXHb_q88g"
  },
  "KZCxNbzs9se1vYsYGA9lRg": {
    "date": "8/31/2016",
    "text": "Our waitress was  all some, all draft beers 4:50 on Tuesday and buy one get one pizza, the problem is the pizza are not so much, a digorno from the grocery store is better, maybe they should stick with wings witch are pretty good and the sandwiches aren't so bad, good place to watch game's",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TiIbM_ULMxeCPz63UBiTNA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TiIbM_ULMxeCPz63UBiTNA/o.jpg"
      }
    ],
    "user_id": "Z8sNz_pHjV1opvI9H1tfQQ"
  },
  "EZTy2fEfs97vS5GFuASmdA": {
    "date": "8/14/2015",
    "text": "At the corner of E Matthews & N Trade sits Kristophers, yet another in Matthews' decent lineup of sports bars. Other than a nice outdoor area plus TVs lining every interior surface, nothing's worth writing home about. However -- and this is an important however -- a couple of Kristophers' strengths are (1) its waitstaff demonstrating consistently friendly, knowledgeable service and (2) its neighborhood clientele crafting one of the most Cheers-esque bar atmospheres this side of Charlotte. Great times are guaranteed here.  My personal experience places Kristophers far atop any of downtown Matthews' other sports bars, namely Beantown. The overall property feels not only livelier than most but considerably friendlier... you'd be hard-pressed to witness a fellow patron not being welcomed warmly. And though the vibes at either Carolina Beer Temple or Black Chicken Wine Cellar (both but a few steps away) are more to my liking, their accommodations pale in comparison to Kristophers.  Rating specifics (i.e. 1-5, low-high)... - Overall recommendation = 4.25 - Food taste and quality = 4 (typical fare, yet executed better than Beantown) - Portion size = 4.25 - Price = 4.5 - Atmosphere = 4.5 (at first glance, it might seem semi-dated to some...) - General service = 4 - Waitstaff = 3.5 - Location = 4.75 (lots of private parking!)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "m_7a65WtA8oWjerFBEbtJQ"
  },
  "alVk2WmBl0ERb-wk3ZMrYw": {
    "date": "11/10/2016",
    "text": "just left Kristophers, mainly due to the very unpleasant server Ashley. never smiled once, never checked on our table, never introduced herself, not personable at all, terribly unpleasant, why are you in the service industry, needs major training, only time we got anything is when we flagged her down, no personality, was that of a rock, worst server we've ever had anywhere, she could have easy made a $20 tip but her service and attitude was worth $1!  went out to have a good time, enjoy company and watch some games, but her misery so much rubbed off it ruined a night out. IF I ever go back i would never sit in her section. whatever bad day she is having she's taking it out on her customer. I hope management can teach her how to treat others in this job",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-OjSOfh83YH1omeQFgr2g"
  },
  "cSa4Be52sNs7ZWNexEbTsg": {
    "date": "5/3/2016",
    "text": "Tried this restaurant for the first time today and it was excellent. Service was perfect. There wasn't a time my drink went below half full. Our waitress constantly checked on is, but not to the point where it was annoying. Food was great. I had the bleu devil sandwich and chili cheese fries. (Not a fan of the chili) the waitress saw that I didn't eat my fries (because I didn't like the chili) and offered something else in it's place, i politely declined, so she didn't charge me for them. It was really sweet of her to do that, because I was planning on just paying for them.  I will definitely be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LpVDU8wGkvsJeku1hBS9kg"
  },
  "h4nX9O6ybaNKFJttmWKVpA": {
    "date": "8/11/2019",
    "text": "Been coming here for years. Even sat here when I chose the name for one of my children. Love it. Food is good and consistent American bar style. Nothing amazing but always good, always filling. Beer selection is very good. But the atmosphere, people and staff are why I love it. Always welcoming, friendly and open for conversation.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oA7FtUTrU8kfBp2Fl7fmAg",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Menu page 2",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oA7FtUTrU8kfBp2Fl7fmAg/o.jpg"
      },
      {
        "img_id": "YO5Xv_fkQg9QB2QcWQmHfQ",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Menu page 1",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YO5Xv_fkQg9QB2QcWQmHfQ/o.jpg"
      }
    ],
    "user_id": "VHq5-cn5VsyrVqg1czI5Aw"
  },
  "GnpSnLRHsubsOS5R2DmxiQ": {
    "date": "3/15/2019",
    "text": "Ugh Been going to this place 15+ years and the new changes have never been more apparent. Smaller portions and larger prices are a recipe for failure. Salads that used to come on a platter are now on a small salad plate. Wings that used to be large, crisp and delicious are now Uber small, bony and bland - nearly chipped a tooth.  Was still hungry so added the garlic knots, and just should NOT have.  Staff and manager were awesome and apologetic citing changes over the last few years and cutting corners.  No longer on the must see in Charlotte list, especially with rocking places like Pizza Peel right around the corner.  Watch out Kristopher's cause if you keep this up there will be a Starbucks on your old corner.  ~disappointed and still hungry",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "TouSJPTQYTTsTDS1p-2TcQ"
  },
  "trWjzb6arhOILUJnNfKguQ": {
    "date": "12/1/2018",
    "text": "FYI : This review is only for Drinks & appetizers.  There's a TV in every direction so perfect for that football or whatever your sport is fan. Fast service around the bar area. Great vibe all around. They have lots of fun drinks to choose from and the beer list is long and lots of variety. Everything from $2 PBR to the local IPA.  They do have drink specials and Friday when we went they had tacos on special.  Only thing I have a semi-compliant about is the prices of the appetizers- shareable tots was $7 bucks. Some prices seemed a little inflated.  There's lots of places in this area, so if you are just grabbing a drink there's a strip in Old Matthews that's got lots to choose from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "wBRDt1lc3ferNVw81vu3Xg",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wBRDt1lc3ferNVw81vu3Xg/o.jpg"
      }
    ],
    "user_id": "FhqgZHUjzV6x9uYNs05Q5A"
  },
  "AqmZAOkKaI8kc4YDVFN-tg": {
    "date": "4/8/2019",
    "text": "Just ok food. The service was good on the Monday night we went. My hubby had the Yankees and it tasted a bit salty. I had chili cheese fries and they were ok. My husband asked for Dr. Pepper, we are pretty sure he got Cheerwine. Would pick a different place next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EM1Ea_vZWrYo1MQvF9Huqw",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Inside",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EM1Ea_vZWrYo1MQvF9Huqw/o.jpg"
      }
    ],
    "user_id": "dtvcO37TzCyLe0wnScd61Q"
  },
  "8TjgqC38QVI3piMtnj316g": {
    "date": "8/19/2019",
    "text": "I love this place. The food is great, the drinks are reasonably priced. But damn, I had this bartender Brea, and she was just nasty. Sourpuss on her face. Acted as if my every order was a major inconvenience. I will not be returning just because of this one bartender.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_wSW3WnHuiLEGn0GV3NTg"
  },
  "76yX3saJpjqnDGbJ21MN8g": {
    "date": "7/21/2019",
    "text": "Good place to go for a sporting event and get some bar food like burgers and sandwiches. Has a good selection of beers as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qvcc6ifikSJgVl8B21ApWg"
  },
  "5Gp88kgSG5wVBk_ppWt_Fg": {
    "date": "9/19/2018",
    "text": "Great neighborhood bar that's been around forever. I grew up in the Matthews area, and have since moved to another city. Every time I come home I love to come back here. It's a cool atmosphere with tons of TVs to watch games. Good food specials daily (we try to come on Tuesday for BOGO pizza).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "szx18tGP7lcvC9exuBEIDQ",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Another shot of the bacon pizza and the onion ring dipping sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/szx18tGP7lcvC9exuBEIDQ/o.jpg"
      },
      {
        "img_id": "zTQbRhqG8fkYFdlw2HTACQ",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Bacon pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zTQbRhqG8fkYFdlw2HTACQ/o.jpg"
      },
      {
        "img_id": "L56HT_YjfiJ1lk5nS9yRXw",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Sampler appetizer platter with lots of sauces.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/L56HT_YjfiJ1lk5nS9yRXw/o.jpg"
      }
    ],
    "user_id": "PQhb8JJu7Iyz7eIEspFu1Q"
  },
  "dUb9JNhdk6BYRMle2YDQxg": {
    "date": "6/22/2019",
    "text": "Perch and fries very good ... chicken salad really bad, cole slaw just bad.  BUT PBR on tap and cold! Left all of my lunch sit except for two bites and waitress only asked if I wanted a box. Why would I box something that I didn't even eat much off?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s9t8JXEiUtgNpB-gk7RSog"
  },
  "lQaD_H3IqS_s22eC1-DWKQ": {
    "date": "8/8/2018",
    "text": "Kristophers has been my favorite wing restaurant for years!  They never disappoint, and come to think of it, I've never had a bad meal here - wings or otherwise.  Their firecracker wings are for the hot wing experts. I stick with Hot and Garlic Hot. My hubby likes the spicy Teriyaki and the \"Robby-Style\" - which are crispy double fried.  I chose to have my wings also \"Robby-Style\" - which they can do with any flavor of your choosing.  As for wings, they have a pretty good choice of flavors; sadly, Lemon-Pepper and Garlic Parmesan aren't available. (Big sad face).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8NjOZ9oMy4Ti7zkiGN4E-g",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Celery was nice and fresh - not limp and brown like &amp;#34;some&amp;#34; restaurants send out to you.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8NjOZ9oMy4Ti7zkiGN4E-g/o.jpg"
      },
      {
        "img_id": "M2acJUb0nxoyxabfv6JppA",
        "caption": "Photo of Kristophers Bar &amp; Restaurant - Matthews, NC, United States. Hot and Garlic Hot flavors.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/M2acJUb0nxoyxabfv6JppA/o.jpg"
      }
    ],
    "user_id": "8okt1nl-g2RL3ylWoqj4tA"
  },
  "_hlaNMeD2DqCMH1qQEqocQ": {
    "date": "5/26/2019",
    "text": "First time visiting and the food was amazing. Our waitress was extremely helpful and checking in on us when needed. We ordered an appetizer (loaded potato skins) and they were out so quickly and piping hot!  Both my sandwich and my boyfriends were exactly like described and the pizza crust as bread was the die for. Overall amazing experience and will be going back. Gave 4 instead of 5 stars because it took me a while to decipher the menu, some of the descriptions left you wondering whether it was a hot or cold meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cZmShcI7RtmYcDaerdpY0A"
  },
  "Wp2ywTTSIz_3JeBjbtnrJQ": {
    "date": "6/30/2019",
    "text": "Love the wings and the service is excellent. Wish there was more seating so you didn't have to sit on top of other people but for the most part this place is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkmlWnhHRR9Mjdec6BhmeQ"
  },
  "iMqCX-QKk17ayepzH5VjSw": {
    "date": "2/20/2019",
    "text": "Food was okay our waitress sucked I payed her in cash and she came back with no change handed me my bill and says \"you didn't want your change did you\" that to me is insane for that to be asked. I said no because I was unsure what to say and it was putting me on the spot so if you pay in cash they'll probably pocket your change immediately",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJpPP4PEL-HUyD1PkZrMkA"
  },
  "pARhMrZr3rnVs6Nl7Zxftg": {
    "date": "3/30/2019",
    "text": "Sign says they are open until 2:00 am. Arrived at 9:30 pm. Not many people there despite it being a Saturday night with NCAA tournament game on. Sign at front said seat yourself, so we did. Right in the middle of the dining room. At least six people \"who worked there\" walked by us. No one said a thing. We sat there for at least ten minutes and since no one seemed to care that paying customers had walked in and sat down, we decided to leave. A Manager walked by our table as we were leaving and she just smiled at us. Must be nice to have so much business that you are cool with people walking out without being served. Don't waste your time. Plenty of other places in Matthews that will appreciate your business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2d3OekW_1bRSDxuJ_BRtkA"
  },
  "lHD_W7dfFgse-SuPZFZ4Ew": {
    "date": "8/28/2018",
    "text": "This is our favorite place to hang out at after work- great food, great prices and Erica is top notch and makes the place!!! (That place should never let her go!)   My husband loves going and watching games there - customers and employees alike are friendly and enthusiastic throughout all the sports seasons. :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOXiNF8Wy9lyyPI1zK7Xvw"
  },
  "qiP2BZsetoHg7mX8p2ZfcA": {
    "date": "10/27/2018",
    "text": "This is probably the WORST restaurant I have ever been to. The service was terrible and the food was disgusting. I ordered the Roman Club and it was disgusting. Some of our food didn't come and they got the order TERRIBLY wrong. Trust me, don't go there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AuB23e51Te736e6r6KZ4Zw"
  },
  "954QgAf6C_2Q3gpPSryqcg": {
    "date": "12/29/2018",
    "text": "Always love this place.  Great sports bar and food joint.  Love the BLT!!  Try the subs also",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8pXZhW8RJ64ZXvoBNsag2A"
  },
  "A5hXH2dnCiSp-i3EisWT7A": {
    "date": "12/1/2018",
    "text": "This place has a great menue selections and service and price is very reasonable. Atmosphere is great! Plenty of Tv's and the crowd is very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oaBlBEos_CKJ_HtHNimGfQ"
  },
  "b9td9FxXw6Nw_Zceg9xnBw": {
    "date": "12/3/2018",
    "text": "Best buffalo hot wings at very reasonable price. Server is so sweet is plush. Keep it up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHthJ9cMSYjfbFZ63XkJ4w"
  },
  "PH-T-ewwWRX9aZgWsa8JDg": {
    "date": "10/21/2016",
    "text": "This place has a huge variety of foods to choose from.  Everything, including the pasta is very satisfying.  There is a good sized parking lot, as well as some parking in the back and on the sides.  They tend to get crowed on the weekend and evenings.  The service was slightly below average.  I waited forever to be acknowledged, and when I finally was, it seemed like I was burdening the hostess.  The server was busy and seemed to not really care about our table.  I think I would go back for the food and drink specials alone.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "tZabI7nrH40hm3XHzw3LiA": {
    "date": "5/16/2018",
    "text": "We arrived on a Wednesday evening and the place was not busy which was not a problem, we came to watch a baseball game. We were then sat by host on patio. Male host and another girl that changed tv for us were extremely nice and accommodating. However, the server on patio had table next to us and went back and forth over 4 times without saying anything. No water, no \"hello your server will be right with you,\" ...NOTHING! If she was the patio server she needs to be trained. This was our first visit and will probably be the last.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8IrVz7oMTvOQDADlEUjtZg"
  },
  "8lA-zC8u4G7aVScI1AeBJw": {
    "date": "10/12/2012",
    "text": "We have eaten at Kristophers for over 10 years, and I can honestly say I have never had a bad meal here. Very consistent, and the wait staff does a great job.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZb3cp-ArTq3FffCzXnSxQ"
  },
  "pZzCI29gSqYHLR5kHuTbyA": {
    "date": "2/13/2013",
    "text": "Having just moved to Matthews, I wanted to find a great place to have a beer and watch sports.  Kristopher's is just that.  They have a good local craft selection and a nice hometown feel.  I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QQ9YjAu8NNBwi6eZ9UlvA"
  },
  "m_vkucAK9xtdSvp39S_tCQ": {
    "date": "5/2/2013",
    "text": "Reliable food, family-friendly.  Huge menu.  Parking can be a bit of an issue...remember there is plenty of street parking, if you don't mind walking a short distance.  Large beer selection.  Many TVs on a variety of channels.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6WSAwFnuFYNQKoy4acGJww"
  },
  "7PUc6h9oJLXVafEW43pWXA": {
    "date": "4/25/2011",
    "text": "Kristopher's opened shortly after I moved to Matthews.  Never had a bad experience here, in fact, I love it... good service, great food, prices are resonable and I've never had to wait for seating, service, or food... try them out and find out why I say it's tops and a pillar of life in Matthews!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ba-r528TrSjc-Kt-TlHSWw"
  },
  "mSliaSFrxvyoOzpISD8Pdg": {
    "date": "4/10/2011",
    "text": "Good serviceable bar food.  A inexpensive meal and better than places like Showmars and about the same price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4Zov2g_esDe2YqiNFmsJQ"
  },
  "L83GBNTyuzHjZmHYpQt7eA": {
    "date": "4/26/2010",
    "text": "Pretty decent sports bar. Every inch of wall has a TV, even one in the bathroom. 1.50$ PBRs and a large menu. The food was ok, nothing special. I would go there to catch a game and have a couple of beers. The french fries were pretty good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKaR_ebWJt7vdkJydpTuQQ"
  }
}