{
  "z5bM3YV6Ukk_OyC77Yle8g": {
    "date": "12/30/2009",
    "text": "Ya know, I haven't been to Zack's in a while so today for lunch, I...... went to Zack's. It's been a while since I've been there but the food was really good... and cheap! Zacks Special for $4.55 (double chz burger & fries) and I got some o-rings since I've never had them but heard good things aboot them.  The onion rings were  hot & good but nothing to write home about. (I prefer the onion rings from The Beacon Drive In, my favorites) The burger was juicy & hot and the fries were shoestring fries, not my favorite cut for fries, but they were really good nonetheless. I opted not to get a shake since I'm 'attempting' to watch what I'm eating but I've had their milkshakes in the past and they were like the girls in a Lil Wayne video - thick & had to use a spoon....  When I got there, the line stretched around the corner to, what felt like, Ft. Mill and I was at the end of it. But they zipped through the line and I got my goodies in a timely fashion.  Bottomline ~ A good place to go and eat on the cheap. Been in CLT for decades... nostalgic. A good place to go for a change of pace or a quick lunch. I just wish they'd pave their parking lot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8NFfU6pVexR-fS6uf4pLZw"
  },
  "7AAMLC9-DFpYCcreAv9sxw": {
    "date": "10/11/2011",
    "text": "Zack's is OG in the hamburger game.  I love places like this.  Nothing special on appearance and food, but yet there is something so special about a place that has history.  The burger was good and I liked the shoestring fries.  The price is cheap as all hell.  Every once in a while a few of us at work hit this place up for lunch.  It seems to just be one of our go to spots. Don't expect a kobe patty or anything, just an old fashioned hamburger place.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "ugd9ecnVoS0AG9LAqMYqcg": {
    "date": "4/19/2015",
    "text": "My earliest childhood memories include trips to Zack's, it was always a treat...and still is. GREAT VALUE! Plus, the owners are always present, quality is always consistent and good, no corners are cut during any part of the process. Staff is always friendly, efficient and courteous. There is always a line, but never a wait. One recent observation: Zack's has the lowest employee turnover of any restaurant I've ever seen. Happy employees say so much about a business, and they produce great food. I'm always pleased to see Zack's sustained and growing success, keep up the good work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qL6Y3WOwTvYKs8wLJYBUgQ"
  },
  "9w36I7BE1s953NISOLhGqg": {
    "date": "7/27/2012",
    "text": "Great burgers, great steaks! The only thing that fell short for me was the hot dog. As a northerner I tend to only like certain all beef hot dogs. But overall, I love this place! Shakes and all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmAqQyaFli8H9LVGhGhR9w"
  },
  "osQJTJs9MbKCZeIev7gF6w": {
    "date": "9/26/2007",
    "text": "Quintessential America!  The Zack's special is a doublr cheeseburger that the Big Mac can olny wish to be...Cheese, special sauce, toasted bun, lettuce, tomato, pickle, and chopped onions.  The fries are fine and delicately crisp, salted perfectly.  Definitely leave room for a shake (but get a small one). Lunch on a Wednesday shows the entire cross-section of Charlotte from hoopties with big shiny dubs discharging nappy headed guys from the 'hood to badge toting office drones.   The location is timeless American with a big glass box fronted by picnic tables sporting fibreglass sun shades.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DeFXo6qPDkeZgGZ5Knm4fw"
  },
  "3v9aZsR47-GSi69BWB1pAg": {
    "date": "4/3/2015",
    "text": "Food glorious Food Hot Onion Rings yummy. Special Sauce and again an old timey family business the kind of place you want to go over and over and over",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1NF0TwI96XLAH9w2xzN2g"
  },
  "XOVJKuFddIdEgtBMikaqiQ": {
    "date": "12/11/2007",
    "text": "Wow. This, by far, was the most \"pure\" burger that I've ever had. It makes me think that this is really how it tasted back in the 1950's. In-N-Out comes close, but has some extra stuff that Zack's does not.  I had my very first cherry milkshake in my life there. I may go back and try the banana.  The onion rings were so fresh, they burned my tongue. Fortunately, I had the milk shake.  Price is very reasonable. $2 for a cheeseburger. My total price for a double cheeseburger, onion rings, and milkshake after tax was $6.53.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "C-4zvd3W3ZA0lfzSXAg2Lg"
  },
  "iYRUufVRzPTmbpZKK8FnYQ": {
    "date": "7/1/2012",
    "text": "first off i am not a fan of this place at all. There are various places in charlotte with the same set up doing it way better. The onion rings where not what i expected greasy and lacking in flavor. My burger was sub par but i did enjoy my milkshake. Maybe it was just a bad day but it didn't win me over enough to ever come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "du8TGiiVjQKh2NjASafCCg"
  },
  "ZMUYUGj8Gb10vNNWzToHwA": {
    "date": "12/30/2013",
    "text": "I'm always relieved to find that Zack's is still there!  and when we get to Charlotte (from Florida) it's always one of our first \"stops\".  Love it - from the time we lived \"just around the corner\" (Reynolds/Scaleybark, Annlin, Applegate) to these days from what-- 700 miles or more away!  wish Zack's was HERE.   Burger, Fish/Trout special, steak sandwich, onion rings, fries, slaw - it's allllll good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "g3fHYJjYjFfDVi3i54HxlA"
  },
  "28G6FY8zjpe0HF8lV7Zvhg": {
    "date": "10/7/2009",
    "text": "Cheap Cheap Cheap! and worth every penny!  This place should be a landmark, it's delicious and cheap.  Clark howard would love this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "aS3_LTD2d_55wKmw5ml0jg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. You should recognize!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aS3_LTD2d_55wKmw5ml0jg/o.jpg"
      }
    ],
    "user_id": "abZtGdO5wgXUBjolcZgb7Q"
  },
  "Kvh0nb1lB72rI6aoDaK9ng": {
    "date": "1/17/2009",
    "text": "Keepin' it real.  Hit Zack's about 1pm and indeed it does a bustling lunch trade but it seemed to move 'em through pretty well.  There's certainly nothing upscale about it, but maybe that's part of the charm - it appears unchanged from some long ago time.  That time would be 1975 according to their sign, but you get the sense that in 1975 this still may have looked a bit retro...  or maybe more of the world really did look like this than I remember.  The Zack's special had a good fresh-made flavor in the classic style of old school burger joints.  Flavorful, but not overly seasoned.  I would say that the \"special sauce\" is a bit more subtle than the thinly disguised thousand island dressing on a Big Mac...  in fact, aside from a similar sounding bill of lading, nothing else in its flavor or appearance is reminiscent of a big mac at all - it's the anti-Big Mac as reviewer Anthony D. tagged it.  Chocolate malt was too thick to drink through a straw, but I'd still give the edge to Carolina Soda Shoppe on that item.  The fries are nothing special, but note that mine came unsalted which I kind of prefer to the over-salted fast food variety.  To me, fries are really just a vehicle for ketchup anyway so this is a non-issue.  Will return to taste around on the menu a bit.  Only potentially troubling thing I see is that the All Beef Hot Dogs list:  \"Ketchup, mustard, onions, our own delicious chili\" as toppings.  Ketchup?  And listed FIRST? Ketchup?  Slaw on a barbecue sandwich is controversial, but ketchup on a hot dog is just plain wrong if you're over the age of 12.  No less than Dirty Harry says \"nobody, but nobody, puts ketchup on a hot dog\".  Deeply troubling.  Not counting against them in this review, and assumed to be optional (they can't make me!!)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enaSpC9aA7u2wq_KH5SXGA"
  },
  "6adbwIAxzsZ30yli03idUg": {
    "date": "2/21/2008",
    "text": "I just stumbled upon Zack's recently and went there for lunch today. The burger and fries were great. My friend got an order of onion rings and they were just as good. The strawberry shake I got was fantastic as well.   Great old school burger place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2spaSaPmLc_0HregfzjHQ"
  },
  "FQS4Lt6DcC0bHRwG9zkeqA": {
    "date": "9/12/2012",
    "text": "I love a good hamburger.  I  don't need anything super fancy--just a good burger, and I'm not that picky.  I was trying to figure out what I was in the mood to eat Friday night, no food in the house, and ALMOST walked down to Mr. K's when I realized I had never tried Zack's and someone here had given it a good review.   I love an old-school burger joint (old fashioned AND cheap) and this lived up to my expectations.  Everything was small, and I say that in a positive way.  The drinks weren't 50 ounces, the fries weren't in a bag the size of my head--everything was reasonable sized and reasonably priced.  I got a coke, a small fries, and a burger, and it was all tasty, hot, and delicious and inexpensive.  I'd definitely go back, and I'd say I prefer it to Mr. K's because Mr. K chargrills their burgers (I think) and I don't love the taste of char.  But still, either one satisfies my burger craving and I love giving them my money vs. 5 Guys or Wendy's or whatever major chain is around my neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "9lyLNz5VrcgMn0lPD86LHw"
  },
  "gRIbjn7ibXLQeB29LIyDjQ": {
    "date": "10/4/2013",
    "text": "Tastes and looks like the good ole days. I ordered the Zack Special (double cheeseburger) and onion rings. Delicious and at a good price. It felt going to the 1960's to eat. Totally worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBvvdOLU1PhUY3gS_6JELw"
  },
  "f9CiCVshuKdSWybbIIrvSg": {
    "date": "4/30/2011",
    "text": "I grew up eating zacks burgers, go by every time I come to charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tAxRPl_MPmsEs00cjmefEw"
  },
  "9LP9qMt1Q5SYl0En5NXtMQ": {
    "date": "3/17/2010",
    "text": "Great burgers!!! I ate mine and half my son's! Hey waste not want not it's in the Bible. It reminded me of when my mom would make burgers and butter the buns and grill/toast them. We stumbled upon this because we were waiting on our car to get serviced and it was within walking distance.  Highly recommend for a good cheap meal!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "s598F3jiP44e9ryYLv1LZQ"
  },
  "sUZaw9uhFqR4sGj_WfQvfQ": {
    "date": "8/18/2010",
    "text": "The best burgers in Charlotte hands down! Seriously if you want a good old fashioned burger, go to Zack;s. The prices are unbeatable, and the food is out of this world amazing!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-6itJehE4X9y4Zx8uNEFwA"
  },
  "ByNf3JUrsS6kqdXbBKtZTw": {
    "date": "5/24/2010",
    "text": "Great price. Old-school classic American food. I love their fresh cut home-made onion rings, with a sweet tea containing crumbled ice. Add a hamburger and we're in business!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yqRU7dBgC9ByIvW6E2uUGw"
  },
  "YJSSB5b5NSliixzB4a-cnQ": {
    "date": "11/8/2008",
    "text": "Great hamburger and more joint. Fish is actually presty good too and the iced tea is \"real\" southern sweet iced tea. The fries aren't my favorite but that's a personal prefences. The aerated ice makes a coke the perfect complement with a burger! Very buy during lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hMW0nLttHwMb7d_U41elDw"
  },
  "KCnDxBsnM60ZoyPrJMffDg": {
    "date": "3/18/2011",
    "text": "I tried Zack's out on a Friday night after work.  I can see not being open on a Sunday, but not being open on a Saturday?  If that's what you want to do more power too them.  It was a beautiful day out and I was glad they had tables outside.  Zack's is a lot like the drive ins I've been to in other cities over my lifetime.  It's kind of run down and divey, but lots of good places are.  They were pretty busy and seemed a little frazzled behind the counter.  It took me a while to order even though there was one person ahead of me in line because when I got to the counter the server got a phone order and took it instead of waiting on me.  Pet peeve of mine, deal with the customers in front of you rather than those on the phone.  There were two other servers and a manager or owner back there that could have been taking phone orders.  I ordered a Zack's special, onion rings, and large shake.  I had to try the rings because those are one of my favorites things and they can show just how good a place is.  It didn't take too long to get my food and I head outside to sit on their patio.  I started with the rings and they were great.  They looked liked they used the same batter as on their chicken.   The burger looked like it was made fresh and not a frozen patty.  It was supposed to come with lettuce, tomato, pickles, onions, mayo, and special sauce.  Mine just had the lettuce, tomato and onion.  The beef was cooked well done but still juicy and not to greasy.  It was a good burger.  The fries were shoe string cut and crispy.  No complaints there.  I ordered a large shake, but it didn't seem very large.  Overall I would come back if nothing else for the onion rings.  The price is pretty reasonable too.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "423UZPCxeDxzv0h_wkulvA"
  },
  "zhTF_fRy5amffZ5GLMmIvw": {
    "date": "7/6/2017",
    "text": "This is a cute little old school hamburger joint the price is great the food is great I always get a cheese burger and onion rings the hours of operation can be a lil funky though",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVWtnR3Z-yKtzl56Ko8qSw"
  },
  "q5an9_RI6Ls3VJXiiC9Z8g": {
    "date": "3/11/2016",
    "text": "This was my first and last time going to Zack's! The lady on register who I believe was the owner was uninviting. I asked how she was doing, got no response. She didn't  even look at me while I was placing my order. When I did receive my order the fries were cold and unseasoned, my burger bun was hard and dry. I also ordered a slice of pie, I hope that tastes good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eokFjesoPsHeFJMoZwO7Yg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The worse cheese fries ever",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eokFjesoPsHeFJMoZwO7Yg/o.jpg"
      }
    ],
    "user_id": "YKlqGhjdQvRJShCrU-mjRQ"
  },
  "gOYC8vOAZrTzcu13m3USZA": {
    "date": "9/18/2017",
    "text": "Good service. Nice people. I had the sea food combo. It was ok but nothing outstanding. Should have got a burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IKkK_waJT8aER3-XB0WBjw"
  },
  "RqWZDNIQqCrGVyqkJJFLEQ": {
    "date": "7/8/2017",
    "text": "Awesome burger joint. Think old school hang out. Great fried items as well. Onion rings rock!!  Need a little help on their desserts though but everything else was fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fn7QupFXqWPheord2aWbSg"
  },
  "-WdUfYt2Hu95OPCpSzb6Qg": {
    "date": "12/11/2014",
    "text": "Place has been here since 1975 and is still one of the best in town. Service is great, food is great.  My favorite is the rib-eye steak sandwich.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l_jS1Cvus8-xaazXct3Y5g",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s Hamburgers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l_jS1Cvus8-xaazXct3Y5g/o.jpg"
      }
    ],
    "user_id": "4SDhSBQ1lApk4GnXSAl_IQ"
  },
  "35k5UfhI7eMERsaHSJ738Q": {
    "date": "8/19/2017",
    "text": "Really enjoyed the old dinner feel and a good sandwich with a root beer float.  My mom got the Zach's burger and a shake and said they were yummy too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZK1OHvrqVhS-lXNZ2iYmA"
  },
  "7AupxsV999OMlV5kbeZYxg": {
    "date": "8/17/2016",
    "text": "This place is great.  I've been in Charlotte for seven years and I love coming in here and getting almost a small town feel.  Change is good but this place is like your wonderful neighborhood diner.  The people that run it are awesome and so nice.  The burgers are tasty and I love the onion rings.  They've got a lot of choices so take your pick.  Cheers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Tt6U3nBT9SDMNZLtIeGAA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Lunch time grub.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1Tt6U3nBT9SDMNZLtIeGAA/o.jpg"
      }
    ],
    "user_id": "zmMFnqah77obfLm8EtuVuA"
  },
  "7xWwF6FA9tXhOwW0thJj2Q": {
    "date": "10/9/2014",
    "text": "I love this place. Trout sandwich is awesome. Quick service. A small amount of outdoor seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BQNcF4p-MJ2Wwo9lkpd0Xw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BQNcF4p-MJ2Wwo9lkpd0Xw/o.jpg"
      },
      {
        "img_id": "qS-A5A9rC8C4GLqDGgilxA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qS-A5A9rC8C4GLqDGgilxA/o.jpg"
      }
    ],
    "user_id": "8GvKgJqZR283OFRE2MJ7lA"
  },
  "KCqXgUJuRwUFxA1Gvak9tg": {
    "date": "6/5/2017",
    "text": "I decided to try the Zack's special after all the hype in the reviews and I am here to say it was all I expected and more. 4  on the burger yumm. Now the fries I received were cold and not appealing, not to say they are good maybe in another space and time. Will I be back? Definitely.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5kQXYPwIY6bB-rTq4bXJrQ"
  },
  "qkr33iPgOvPhKFG2hZwvMw": {
    "date": "9/19/2013",
    "text": "Places like Zach's are few and far between, so it's nice to stumble upon a gem like this from time to time.  They have decent, inexpensive burgers and some awesome onion rings.    When you walk in the door, you definitely notice that it's an old-fashioned burger stand.  It has a few booths around and some bar stools lined around the edges.  I went there around lunch time, and the food was quick and fresh.  The burger itself was relatively small, like the size of a burger from a fast food restaurant.  However, the patty was much more flavorful.  The onion rings here are great as well.  The batter on them is light, crunchy, and perfectly seasoned.  They offer more than just burgers here, so it's nice if you want something like fried chicken, fish, hot dogs, or barbecue.  You can also get a milkshake to drink if the mood strikes.  Prices are a little higher than some place like McDonald's, but the food is so much better.  When I was here, it was very clean and the woman taking my order was polite and efficient.  I waited a little more than five minutes, but all my food was piping hot.  The best part was that it was under $6 for a cheeseburger and onion rings.  The only problem I really see is that they are only open Monday through Friday.  So, just make sure it's a weekday before you try to venture out to this place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "cZeMCY6vrQkFOgcmIbKspw"
  },
  "P40S1z3y9n3peyk-DBQNiA": {
    "date": "6/14/2013",
    "text": "Taking into consideration that I am actually one of the twelve people left that are from Charlotte and I still live here, I am officially ashamed that I never tried Zack's before yesterday...   The Zack's special was stupendous, guys... I ordered mine without mayo because that's how I get down, but there was still a great amount of toppings mixed all in with the two beef patties and cheese: tomatoes, pickles, onion, lettuce and secret sauce (which tastes quite a bit like thousand island dressing, so I think the secret is out)... I was really glad there wasn't any extra sauce because that sucker was already falling apart toward the end... In a good way, though... The bun was nice and toasty and wasn't bland, but didn't work too hard to prove itself by overpowering the other flavors...  The onion rings were pretty good... I'd liken them to Mr. K's down the block... Not too thick, not too thin... Decent batter, but not the cajun kind that comes on most onion straws... A basic, but tasty fried coating...   I even took this to go because I was heading home and everything traveled quite well... The food must have been practically on fire when they brought it out because it was still nice and hot by the time I arrived and got settled to eat... I didn't even have to do a quick microwave refresh!    I'm kind of afraid to take the boyfriend here... I doubt he'll want to go anywhere else for a while... But I just have to be the one to introduce this to someone new and I think he's the only one left that hasn't tried it...",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "TxsH5gzYRnutzXJUvkAhVQ": {
    "date": "6/7/2017",
    "text": "I think once you get past the nostalgia of the burger you realize they are just a decent burger. Nothing to go out of your way for, the prices are right and if you haven't tried them certainly judge for yourself. I am just not running back any time soon.  Read more at <a href=\"/redir?url=http%3A%2F%2Featitcharlotte.com%2F2017%2F02%2F27%2Fzacks-hamburgers%2F&s=34c26635e408d5c987e250fb2f1ac417c190fb986b9a5f64b228ef730c72f2b5\" target=\"_blank\" rel=\"nofollow\">eatitcharlotte.com/2017/...</a>",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-1kcEXDmH4tawm4_eiZrg"
  },
  "UMjvLu1tl51PkN1bnV82sA": {
    "date": "11/11/2016",
    "text": "Not sure how this place has such high reviews. The Zacks Burger was pretty average. I got onion rings instead of fries. Again pretty average and lacking anything particularly interesting about them. Price was on the cheap side but i probably wont go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SD9ylpKRNMojDTllaXt4Eg"
  },
  "GZqs094PcryXygmKiJVFAA": {
    "date": "5/24/2013",
    "text": "The last time my dad was here, he raved about this place. He said it was definitely a must try!   Well, I finally was able to give this place a shot and I must admit, my dad totally got it right. This place was super cheap and delicious.   The place was packed, always a good sign durning lunch time! They prices are super cheap and they have daily specials. I went for a hotdog, order of onion rings and a chocolate milkshake.   The hot dog came covered with mustard, onions and their own chili. They serve it with ketchup too, but I don't believe in ruining a hotdog with ketchup...save it for the onion rings! But I digress, it was great. The toppings didn't overwhelm the bread or the hotdog and the flavors were just like they should have been. Classic. Yum!   The onion rings were freshly cut and hand breaded...Whoa...They were freaking delicious. Crispy, well battered and very tasty. A definite must try if you go. Seriously!   The milkshake was just okay. It wasn't thick and creamy and I really could have used more chocolate flavor. But considering that they have crushed ice...I just know next time to get a soda instead.   Overall, I really enjoyed this local joint. Major cool points to my dad for insisting I give Zack's a try!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "Y3mDsV2OUz9gFEXjiAIUFQ": {
    "date": "11/13/2017",
    "text": "Just damn good burgers and fries. Stop in. You wont regret it. A Charlotte staple enjoyed by this Native Charlottean for years.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Px9PWR7W5YQNXpw7eD37aw"
  },
  "OdbUEv6anJLGW8scGIrdvw": {
    "date": "10/28/2016",
    "text": "I'm mad it took me this long to try this place. They have the best burger I've ever had in charlotte. I got the zacks special which comes with 2 parties, lettuce, tomato, pickles, American cheese, mayo, onions and special sauce. The special sauce is similar to McDonald's Big Mac sauce. It was amazing! Fries were not great however, I'll try onion rings next time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dM44l_t0nxuge7pxDBpuHA"
  },
  "8OiD3zNFuCQ4RgJ5oh5z-g": {
    "date": "6/11/2015",
    "text": "I do not know why it took me so long to stop in here. My life has been changed for the better by the Zack's Special. Perfect amount of every ingredient to where you get the \"best\" bite with every bite. Do not hit stop, do not pass this place by, go in and experience an amazing burger at an amazing price.   Why only 4 stars? The fries are just decent-- nothing special, and the \"medium\" size drink (which wouldn't matter if you were dining in and getting refills but does if you get takeout) is actually a small everywhere else. So order the large because their sweet tea is wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCo_xx_pI2lwKDT5-PPzsQ"
  },
  "AQH_vgRxxEMTC9qbCAXCSg": {
    "date": "7/25/2017",
    "text": "This burger place is so good, it has a really cool old fashion feel and the food is so amazing and fresh. I got the double burger and fries and it was well worth 6$ i highly recommend to anybody !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XWNIF1uGrFhcYFdcpST_yg"
  },
  "odqEAJ21-LekzP8G0UubCQ": {
    "date": "9/24/2012",
    "text": "I ordered the zack's special due to one of my friends stating that it was the best burger in town. So I put my burger appetite to the challenge. And honestly, I wasn't amazed by it..   It was good, but not amazing from what people have said about this place. The atmosphere and prices were unbeatable by any means, but the burger was just okay. It was tasty and juicy, however not as big as I thought it was going to be. Note* I would come here if not for the location and how far it is from my house for a burger.  Other than that, it was pretty good. Sort of self service after you get your food, acted just like an old fast food joint.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "9XIlnmWnvmXMxwKiozIipQ": {
    "date": "10/20/2017",
    "text": "We went there for the first time on Oct 20 and I was very disappointed. Have heard good things about their food. Heard their onion rings were supposed to be great. I found them lacking in taste. All I could taste was the batter and grease. Has the Hamburger Steak dinner. Over cooked hamburger with no seasoning. Ordered a medium soft drink and it was basically a small drink. For the price and value South 21 is hands down much better! Should have gone to South 21. Seriously doubt that we will ever go back to Zacks. Not with it at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sHHz3w2z3061RY6YORcPTw"
  },
  "WsT4ehF7JEJnIw3FA3TPkw": {
    "date": "2/25/2014",
    "text": "Made to Order Great Hamburger & FF, Fast Service and reasonable priced.  Outdoor Patio Seating.  This place is right out of the 60's, I felt like Time Stood Still !  ***Update*** months after our visit we saw this landmark burger joint on the popular TV show Homeland.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gp9NjpcWJ6VxEEDj_mA_Lg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gp9NjpcWJ6VxEEDj_mA_Lg/o.jpg"
      },
      {
        "img_id": "beX9-76HPHPnTscBHQU9Ww",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Burger Joint",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/beX9-76HPHPnTscBHQU9Ww/o.jpg"
      }
    ],
    "user_id": "hYPVPwbAdcaPeqJ2N_PAcA"
  },
  "NJYkgkRSEyBuheCAdMY9CA": {
    "date": "5/20/2017",
    "text": "Love this hamburger joint on the south side of Uptown Charlotte. From the vintage style look of the building to the delicious hamburgers and cheeseburgers they serve I absolutely love this place. It is definitely one of the better burger joints around town and priced competitively. It's a great value for lunch and a lot friendlier service than what I usually get at the fast food restaurants. Highly recommend this place for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hIiasrO5CSMuOoHLR45noA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Daily Specials Page",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hIiasrO5CSMuOoHLR45noA/o.jpg"
      },
      {
        "img_id": "qcCgWJ9Y6KBwlCeLbbRL3A",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Plates, Deserts, &amp;amp; Beverages Page",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qcCgWJ9Y6KBwlCeLbbRL3A/o.jpg"
      },
      {
        "img_id": "zW9rH7On-qAoHWS75JNqig",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Sandwich, burger, sides, and salad page",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zW9rH7On-qAoHWS75JNqig/o.jpg"
      }
    ],
    "user_id": "JHdmUO61jA-E_8g_hGapXA"
  },
  "T3QWkdq2n6DTKdMl7vqxCw": {
    "date": "1/10/2018",
    "text": "Burger was fine, I expected a hand formed more homestyle patty I guess.  I also got the corn dog and forgot to grab mustard but was fine by itself.  Uncertain if I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "zcjdnfXaPn9Y6rzFJeIwFg": {
    "date": "10/10/2013",
    "text": "It's not fancy. Actually kind of gives me flashbacks of an old burger place I used to go to as a little kid back in Nebraska. Put a big smile on my face when I walked inside Zack's.  My order: cheeseburger, chili dog and onion rings. Hey, I'm getting my wisdom teeth out in the AM and I am in the middle of a 30 day challenge at my gym. Trust me, I deserved all of that. And yes, I did eat it all.  The onion rings... oh dear God. Tremendous. The burger was okay. The chili dog was great. I really liked the flavor of the chili. Dirt cheap. I think I spent around seven bucks.  I waited all of about five minutes for my food. The super sweet woman at the counter wished me luck on my wisdom teeth.  My one regret is that as I was walking out I noticed a couple sitting outside with drinks. I did not realize they have the good ice! You know what I'm talking about... the crushed up kind. It should be mandatory for all restaurants to have the good ice.  Thank you Zach's for a tremendous last meal before I go to the dentist. There's a reason the place is always packed. Keep doing what you're doing!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "ubOlPAwOURlfcrQVqbdK6A",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Cheeseburger, chili dog and onion rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ubOlPAwOURlfcrQVqbdK6A/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "LbYMfPjhHZjVKlFEigIifw": {
    "date": "7/31/2018",
    "text": "WOW!  Went for the unknown and had the kimchi burger........may I just say YUMMY! If you like jalepeno burgers give this a shot. Slightly spicy with an underlying tangy flavor and goes so well with hand cut fries or the house chips. The atmosphere is designed for group gatherings and if I didn't have a meeting scheduled I would have stayed a lot longer to sample one of the amazing selection of beers. Staff was professional and well versed with local info for those from out of town. Great place and will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1TrDLxUB86wiZF5Ke_ZtGg"
  },
  "_jQoESHMBaj1XY8F-VED9Q": {
    "date": "3/14/2018",
    "text": "Yeah, the burgers are not good and the fries were the type that you better eat while they're hot!!! Wanted to try it, now I have. Won't be going back. As another yelper mentioned, I had to choke 3/4 of the burger down. The register woman was non-chalant and didn't seem grateful for the business!! They will stay in business for ppl without discerning palates!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Q8T988A7PPOheV9vDkzMg"
  },
  "ITkfMap2_ndSy7XwiNsU7g": {
    "date": "1/3/2018",
    "text": "I have been eating here for many years. I've tried other hamburger places that friends have recommended but always come back to Zacks. The Zack Special (dbl cheeseburger), ribeye sandwich, hotdog and onions rings are a must try items. And they are reasonably prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EEviQIJboc6_Z_bPZbWgfQ"
  },
  "lFMEbs2yfMoLXg0mx4Wb1A": {
    "date": "1/6/2018",
    "text": "Since the demise of South 21 drive in on South Boulevard a few years ago, this is my go to place for classic drive in food that is not overpriced.  I started coming here in 1980 when I worked around the corner.  The Zack Special is just as good today as it was 38 years ago.  In 1984 I moved to the area and still come here occasionally.  Their trout dinner is almost exactly like the original South 21 version, the only difference is that the slaw is a little less vinegary but still close enough that I can eat a pint at one sitting.  The flounder dinner is actually better than most Gaston county fish camps, and the Zack Special hamburger still sets the fast food standards.  Zack is long retired, and I believe that his son George is not there quite as often, but the food is the star here without the Southend yuppiffied ambiance or prices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4I-ROnLsUqLkM4i0ag1w0g"
  },
  "aeGWnUXdh2nY8FOUdCdrxQ": {
    "date": "10/7/2017",
    "text": "Love the burgers at Zack's. Great burgers, the fries are also good and they keep the lines moving quickly. I wish they were open on weekends. Only complaint, but as long as that recipe stays the same, the stars remain at 5.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SerdK2DW_2R7z1b9WU97fg"
  },
  "bTURuIj9W8slYvETL1cb3Q": {
    "date": "10/22/2016",
    "text": "This has nostalgia written all over it. It's like my Jerry's Drive In in Pcola. They are cheeeap. Double Zacks special cheeseburger and fries was like 5.75. It was good! Tastes like a burger off a flat top, not especially juicy but it is good. Fresh toppings. Cherry coke was fantastic  (like they make their own). I will go back due to prices and to try other things. This may be bumped to a 4 star review depending on next visit.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDv9HzZUPw1b_uQW0vVCOA"
  },
  "cwt7nRwhrVyAdecU9sntXQ": {
    "date": "10/20/2016",
    "text": "Tried Zack's for the first time last night and it was very very good. We were looking for classic burgers, Fries and shakes like old burger stands and that's what we got. Great prices too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "krO4n8SbhfM4deHI6IJ4PQ"
  },
  "Mf7UqSPr6FiU4PCa6V67tA": {
    "date": "7/16/2016",
    "text": "Love this place!!! Get the zacks burger with extra zacks sauce. Seriously the best! Fries are good and sweet tea is good! Friendly staff. This is a Charlotte staple, you need to try if you haven't!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "5FPRiHLzhhpYZZnNLPyqlw": {
    "date": "7/12/2013",
    "text": "Stopped in today for their Rib Eye Steak Sandwich and Onion rings.....DELISH......  Ready for a NAP......",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yCaDISH0R8e5U376zDWTpQ"
  },
  "27RR1jsZp-RRszc2dd6jgg": {
    "date": "4/6/2016",
    "text": "Yo this place amazing.  100% a top-5 option for best burgers in Charlotte.  Couple things: Its not a fancy, or really even that nice of a place. Its the standard \"been here for a long time and we want to keep things like they were\" kinda place.  The burgers are what your grandparents would start a story with \"back in my day,\"meaning they aren't pretentious with organic, locally sourced, or fancy Whole Food vegetables. It is just a really awesome burger.   Zach's is a Charlotte institution and you owe it to yourself to eat there at least once. It was also the scene of a key episode of Homeland (season 1) so you can channel your inner Carrie. That might be weird though. Just eat the great burgers.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KR0F61xjOdb6FqAxuwlNBA"
  },
  "oQRrvRrK6Q8pAuRLcBy1cA": {
    "date": "9/24/2016",
    "text": "This place is an old burger stand from the 60's. I love to find these treasures whenever I travel to new areas. This one could use a little TLC as it has a lot of clutter and faded signage. It obvious they do a good job serving classic burgers and BBQ, but some cleaning, organization and uniforms would go a long way towards taking this place to the next level. I had the Double Cheeseburger and Onions Rings which took me back to the 60's.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jL0nwYhuRDkDEnPJAxowzw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Double cheeseburger and onion rings took me back to the 60&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jL0nwYhuRDkDEnPJAxowzw/o.jpg"
      },
      {
        "img_id": "sK4km2bbCVfGxT3v_s0Ojw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Love these old burger stands from the 60&amp;#39;s",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sK4km2bbCVfGxT3v_s0Ojw/o.jpg"
      }
    ],
    "user_id": "wSKJ8ualwXfi_K3Y4z4Vhw"
  },
  "GT1XGrCMNf1wnpLTcn10yQ": {
    "date": "12/20/2014",
    "text": "I  Zacks! I love love the Zacks special. I have been eating here for over7 years. Not much has changed thats why that got a 4  from me. I wish the owner would consider a small remodel even if its fresh paint and revamp the tables and seating area. Its a classic diner i get it. But come into something a bitt neater, the diner deserves it and so do the patrons. Food is great, staff is friendly and have been working there a long time.  Keep up the great work!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rtF1nOnzbRujzOoi-hPPJg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zacks cheese grilled oooey gooey sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rtF1nOnzbRujzOoi-hPPJg/o.jpg"
      },
      {
        "img_id": "Bty0Q3hCncZwRF7z90nTzQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The Zacks Special....can you say yummy in my tummy",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bty0Q3hCncZwRF7z90nTzQ/o.jpg"
      }
    ],
    "user_id": "_7TDOfJkjH3mq4AFWFEx4A"
  },
  "rivkPFKEdveWzE3pIGO_Bw": {
    "date": "7/6/2017",
    "text": "A throwback to days gone by burgers with real meat and great friendly service. This is a family owned business with two generation working their the food is also good. The hours are not as conventional as other burger joints of this era so you probably would like to look it up before going. The lunch hour gets really crowded. I'm in love with their onion rings they are exceptional. So do yourself a favor and go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OhsCg_yTTSUiRvkTGiPyog"
  },
  "44lYFgf-adqdjTkfBx8XpQ": {
    "date": "4/13/2017",
    "text": "Been coming here since I was little!! 26 years and counting. George and Elaine are great people. The hamburger steak is a must have! Don't forget to try the Zack's special.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jidBHfIPakKceehWBUUUAw"
  },
  "H33I42Yk1c_eOH-bpqZ_Dg": {
    "date": "8/1/2017",
    "text": "Zack's is a Charlotte classic! I grew up getting burgers here with my dad. They serve up the only restaurant burger I know that rivals, if not surpasses, a homemade burger. Zack's is a place that not only has character and history, but delicious food. The Zack's Special is my go-to order -- it's a burger with two patties, cheese, onions, tomato, pickle, and lettuce with a special sauce...simple and delicious. The shoestring fries are great too. The place is always busy so the fries are fresh and crispy. They even have the best ice in town too! Anyone who visits Charlotte or is a Charlotte native must visit Zack's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_tx1M364HkxcrUZpw6dEZQ"
  },
  "Nso-ki-O1SeF7eSRh97qTQ": {
    "date": "6/18/2017",
    "text": "This is definitely top 3 places in Charlotte to get a burger, and when you factor in price, it may #1. Zack's special is my go to and the best thing on their menu. I would absolutely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUfvqOTwhCF9iEcQGA8XoA"
  },
  "sJ968-pngkGfwKzJy8hcqg": {
    "date": "7/20/2016",
    "text": "Absolutely delicious. I had a double cheeseburger, fries, and a root beer milkshake. I also recommend the BLT. Definitely a restaurant I will be returning to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ALebeohDXXoInrYONY_Ug"
  },
  "2dmILdoqxK5a-BaJy4XIvQ": {
    "date": "12/30/2014",
    "text": "Our family loves this place. Super clean, really good food (especially the burgers) and totally kid friendly. They are so nice here and love the neighborhood charm. It's like the bar that always knows your name and when if they don't, they make you feel so welcomed. Check out this local place. Really good food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqB8gGENDzZPdurOVnOMcA"
  },
  "pZJ1Fbc_d2CvLwWlO5PsHA": {
    "date": "5/15/2015",
    "text": "Great hamburgers! Don't let outward appearances fool you. This place is classic. And awesome.  Cheap. Consistent quality every time we visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aU2Qo3vD5WJSJdACMSCBoQ"
  },
  "rea3IKGdRcCWFIb1CL8jHA": {
    "date": "7/20/2016",
    "text": "Best Burger in town! Unbelievable prices! We have been coming here for years. This is a family owned restaurant that has been around for years. George is always quick with a smile and conversation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opVo6HTjme69pmghrhGA6A"
  },
  "hrFp7HNYAoRzGBcDp2gmBw": {
    "date": "5/11/2014",
    "text": "Have been eating here since 1979. Greek family owned. Started wit the Zack's special and hot dogs all the way. Other great choice are Fried chicken and hamburger steak dinner. A Charlotte institution, you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "w78OGZsl9x19Lt-U8MNhMA"
  },
  "YUks4AFKcFOQ4KioIJ5Fww": {
    "date": "7/9/2011",
    "text": "If you judge Zack's by looking at its location and overall retro look you'll be missing out on a great burger joint. It's been around for long enough that it's gained that vibe of early diners that just decided to not go with modern times.  As a child I came here about once a week to get \"Zack's Special\" though I couldn't really finish the huge portions back then. My dad and George the owner were on pretty good terms, mainly because they did some business together and George was always good to me. The food is definitely greasier but god it's so good. That special sauce on the Special is fantastic. You can't compare it to the Big Mac because it's just that much better. I don't live in Charlotte anymore but whenever I pass through I have an intense craving for Zack's.  The crowd is always a nice but strange mix of people all over from Charlotte. You'll see office workers in their suits, high school kids, families, etc. Even when the place is busy your order will still be served up in a timely manner.   The old-fashioned Zack's Special hasn't changed one bit over my entire life and it's definitely got that \"all american\" taste that you have to try at least once in your life! Skip the McDonalds and other fast food places and just come here for a burger and milkshake. You'll thank me once you've had a bite.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "ub_MTVyN-DkSDfD-wV_PYA"
  },
  "QyyKQ3G4a3XDhfmGADth1A": {
    "date": "9/11/2013",
    "text": "Can't believe how many times I've driven right by this place. Finally stopped in with my wife for lunch last week. What a cool little burger joint! I got the Zack's burger! Double patties, cheese, lettuce, tomato, onion & special sauce (thousands island) with a side of onion rings. The burger hit the spot. The onion rings were fantastic. Crispy and light. Very affordable too.  For lunch, this place was packed but we still got our food in under 10 minutes. Yes, I'm a fan!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "rCA1v0WO3b6B8Ers_dbidQ": {
    "date": "6/7/2013",
    "text": "Zack's saved the day when the place I intended to visit was closed. I saw the sign and pulled right in. The place easily has one of the best hot dogs in town in my opinion. I saw someone with a ribeye steak sandwich. I'll be having that next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "MOOsVHT6KrM8x-MBYOUNQg"
  },
  "k10tBXhm6APKvG3Tg2pzzw": {
    "date": "11/7/2013",
    "text": "I just went there for the second time because the burgers were so darn good and cheap! My card wasn't swiping because it was scratched and I only had $6 on me so they took the cash and the manager told me I had 200 hours to come and pay the other $6. Obviously he was kidding. He even asked me if I wanted to keep the cash for gas or something. So sweet! I will be coming here even more now! First, to pay back my debt, and then for another burger!  These folks are good people.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IlNBs1247itIxtf1GAZyBg"
  },
  "MPYPQSgrvJosPe_A667sAg": {
    "date": "10/12/2013",
    "text": "My favorite since i was a kid! Zacks special is where its at! Mcdonalds stole their secret sauce!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "Jfy2usYXLrH8LAPyWgMXyA"
  },
  "Q9JAibakiRaaOXEERCse4g": {
    "date": "3/18/2016",
    "text": "Zack's is a great fast food restaurant with great burgers and awesome ice cream desserts that goes well after your meal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcCN3Q0NQX-neIQsmrc6PA"
  },
  "JMmW1fXUAqglKeNlz8IDsA": {
    "date": "8/25/2014",
    "text": "Just passing through town on layover. Good, classic, greasy American burger. Nothing fancy, but made fresh and tasty. Tomatoes tasted like they came from a farmer's market (this is what most fast food restaurants screw up) and were flavorful. A special sauce on the burger gives it a nice tang.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X50hyIoQ9F_tQsHuiGIDZQ"
  },
  "_BE1yMD0lmOVLSJzWKp5EQ": {
    "date": "2/14/2016",
    "text": "If you're looking for upscale, this aint it. Awesome burgers and milkshakes. Kind of reminds you of Arrnolds' from Happy Days. Only reason for 4 stars, I don't like their fries. Get the onion rings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CF7DFd6gra2t7LIUiS6YZw"
  },
  "JVLArwlOcTdMppPE51fygw": {
    "date": "6/17/2015",
    "text": "OKay so some of my favorite reviewers have given this place really high stars so we decided we had to try it out. I'm going to be honest I was expecting something more I think. It's definitely nothing fancy and screams that small town feel of homemade cook out food. The burger was good but nothing great (still searching for that mind blowing burger). The hot dog was also okay but again nothing great. We ordered a chocolate milkshake and got a really weird chocolate malt instead. I'm not a chocolate malt fan so the feeling of let down was intense. I will say though... this place has the most amazing, perfectly cooked, perfectly greasy yummy goodness that are onion rings. If you are looking for fantastic onion rings look no further because they were on point. Does anyone even say that anymore?? I'm getting old haha... anyways I will come back and try some other things with my onion rings since the prices are right and the location is fairly close. I would give them 3.5 stars if I had the option but since I don't I will bump them up a bit :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "s9t_Pn-AuLvDipAFVg0ifg": {
    "date": "1/12/2013",
    "text": "Been waiting for awhile to try.  I had the special & onion rings, my partner the fried chicken & fries.  I would have preferred a McDonald's burger.  The fried chicken was made \"fresh\" & there was no flavor.  This was the location on South Blvd.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqUn2yqxQRq5MrthbRb-7Q"
  },
  "O6tiXLd70Xx-OmhMy_RLAw": {
    "date": "3/7/2015",
    "text": "This place is so delicious my kids go crazy and they are picky eaters and usually do not like dive food but their cheeseburgers her crate that Zack special is phenomenal I'm so glad we still have places like this where you can feed a family of four for less than $20",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IiptgRufX7_HizT8JCD4fw"
  },
  "OrfDx1H5bZi8RaEaLCMPyQ": {
    "date": "12/8/2013",
    "text": "Great food and even better prices. Can't go wrong with the Zack's special or the Grilled Ham and Cheese. Yum!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "elqsbb35Y_KOsjQ-7wMTwQ"
  },
  "fQ6Pb6vABQsUJzlak9xjmA": {
    "date": "4/13/2010",
    "text": "Stumbled on this place entirely by accident, and it was a good time! Tasty burger and fries (had to try the Zack's Special) for cheap. My husband had the fried chicken, which he wasn't terribly impressed with- but I guess that's what you should expect ordering chicken from a burger joint. I wouldn't say this is the best burger in Charlotte (I'll save that distinction for the Penguin), but it's still pretty darned good- and the place has a cool classic dive feel to it.  Definitely worth a visit if you're in the neighborhood. I'd happily go again!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "59fivQG4eIGGB3ZpgKBMXQ"
  },
  "7htm8go1PMmuNP9GVpm47A": {
    "date": "3/5/2010",
    "text": "I think most cities and bigger towns have a place like this--an anachronistic throwback to days where beef wasn't \"grass fed\" and potatoes weren't \"locally sourced.\" A place where food wasn't infused with \"love,\" but instead was infused with salt. And grease. Lots and lots of grease.  And lo, it was good.  We've got a place like Zack's in Atlanta. No, I'm not talking the Varsity, though that would be a good guess. But I won't besmirch Zack's by comparing it to The Varsity. Instead, it reminds me of Zesto's, maker of the gut-busting Chubby Decker burger and milkshakes that will, indeed, get all the boys in the yard. Now to those not from Atlanta, please consider the comparison to Zesto's a compliment.  So yes, I dug the retro vibe of the place, a vibe not manufactured but entirely earned by not changing a whit in 40 years. The food? It was fine. Honestly, it wasn't the BEST burger I've had. I mean, my first paragraph kind of said it all. But don't consider that an indictment. Sometimes a greasy old-fashioned burger is exactly what you may need. In this case, it definitely was.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "1EiP4lBBtN25BB9dP_dWnw"
  },
  "PlMf-cjsnDQtVbg3yDFFnw": {
    "date": "10/17/2014",
    "text": "Made my Friday and soon to be most lunch days.   Best burger I've had in quite some time.   A lost gem in Charlotte. This place is an instant classic from the layout to the menu.   They've mastered the art of doing something well vs an overloaded menu.   If you want an awesome burger that hits every spot,  hit this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVXmBtavJo1HAE1jCYcLiA"
  },
  "heSLN9plotBnUYC2DswXGw": {
    "date": "2/6/2018",
    "text": "I get it; Zack's has been serving up burgers since 1975. It still has the same old school charm it did back when it first opened its doors and from what I hear, the same taste. \"No-frills\", just a straight up burger made on a hot greasy top. I would suggest  getting the Zack's special! Fries were great! Definitely not a 5 star burger by any means, but I think the charm is why everyone keeps coming back; including me.  I get it now.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehX1d1aFb2qujZhUB3qoeA"
  },
  "YDM0zOyRHDQ7V6iwUHEPHQ": {
    "date": "12/21/2017",
    "text": "Do not count calories and come here! Zack's is awesome, no wonder it's been around so long!!! I had the Zack's special with homemade onion rings and my son had the beef hotdog and fries.  Both were fantastic, full of flavor, and those onion rings were out of this world good.  I am not counting any of those calories today as food that good cannot be bad for you!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nS8-qdbUEYth0SNbOGvqHQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Worth every bite!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nS8-qdbUEYth0SNbOGvqHQ/o.jpg"
      }
    ],
    "user_id": "RMhh-vs9CBglg4kfxWdZHQ"
  },
  "OQmxSevSREKRT-2KMg60Cg": {
    "date": "9/12/2018",
    "text": "Great burgers and fries! It was like stepping back in time to enjoying a great burger from my childhood. Think Happy Days meets The Maxx! Fresh food, good people, great vibes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y3t7mKa5in7ATCecMslNzQ"
  },
  "-UnaERj1sse9gAao5kXPng": {
    "date": "8/17/2018",
    "text": "Love their genuine food and hospitality, always go to Zack's when I am on that side of time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g7WYOMVQqqDzW5lC8d2d7Q"
  },
  "fWIjP7RiuX_5Hh9cU1EtSg": {
    "date": "3/14/2018",
    "text": "You don't always need fancy stuff on your burger and a fancy chair to sit in or some themed place that's trying to attract the millennial crowd.  I've been here on multiple occasions and never disappointed. Onion rings are amazing",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUGW_-QEKEm6H2cxunUpqw"
  },
  "zO1hn6kaFEXpREKYBpjeIw": {
    "date": "7/14/2018",
    "text": "This place has GREAT food and a neat vibe. When we went it was super busy and we ate outside since it was so packed inside. The food was absolutely delicious! Don't let the old exterior run you off! You won't be sorry going here if you want a great burger!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nenbhiy5qMBYDRCNIwMOTg"
  },
  "vAxwL076JBaH-flD--ku7g": {
    "date": "5/31/2018",
    "text": "Seafood shrimp platter made me sick. Instantly. I asked the head chef what he thinks about their seafood. He said it was good. Planned the day to hang out with my friends  instead I had to go home and take care of an upset stomach. Customer service was excellent. But the seafood is horrible.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rJDFPfHLjX1FEULG-6H4uA"
  },
  "NrvtKKRsMk8u171GNRQP_Q": {
    "date": "10/8/2015",
    "text": "Zack's is a top contender on my everlasting search for the best burger in Charlotte. There are several things I love about Zack's. The burgers are delicious, the price is perfectly reasonable and the service is quick.   What makes the Zack's burger so great? To start the portion size is just right. I tend to get the Zack's special (two patties and two slices of cheese) and it tastes fresh and has a good ratio of fillings. I am full after eating my meal but not disgustingly stuffed as can happen with chain fast food places. The fries are delicious and always hot with a little bit of salt. The milkshakes are yummy too!   The decor is cute retro burger joint. The music playing in the background and the worker outfits go along with the theme. I do not appreciate, however, that they are not open on the weekends.   There is something to be said for an independently owned small establishment that has been making hamburgers so well that they have stayed in business for 40 years and can afford to be closed on the weekends. Next time you have a hankerin' for a simple but tasty meal try out Zack's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "F_O_3OnKDFBnVUz9_21m-A",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zacks special served with a mountain of fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F_O_3OnKDFBnVUz9_21m-A/o.jpg"
      }
    ],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "a8wxSFW-E808rtJWsVY2sw": {
    "date": "11/27/2017",
    "text": "5 star experience every time! Get the Zack's special if you're a Big Mac fan and don't skip the onion rings",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CwDs4WMNIhBemeE66iI4pg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CwDs4WMNIhBemeE66iI4pg/o.jpg"
      }
    ],
    "user_id": "tALcCpJ6upfa4mqq3fS6ew"
  },
  "bB4_uWVQ7SYtI5iTjfwbkw": {
    "date": "8/2/2017",
    "text": "This is my new go-to burger place- I'm going to have dreams about the Zack's special for years to come! Zack's is a great go-to spot to fill your burger cravings and the prices can't be beat! The Zack's special will run you around $7 and it is a massive double cheeseburger with all of the fixings and a healthy portion of fries. I definitely will be back to Zack's and I absolutely need to try their onion rings- they looked so good and I had instant regret that I didn't order them.   I love the atmosphere at Zack's because it reminds me of something out of the movie \"grease\". It's a classic burger place where you order at the window and they have a few booths and bar style seating that looks like it's strait out of the 50s. I love that they've stayed True to the original Zack's style.   Be sure to check out Zack's when you're in the mood for a low key, no frills meal at a great price!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 6
    },
    "photos": [],
    "user_id": "fEZMEydFQh6A7-eKVebmdQ"
  },
  "KyTGfIO0UC1qJVhsbe6nnQ": {
    "date": "11/2/2017",
    "text": "While in Charlotte,  we stopped by Zack's after reading Yelp reviews. We were pressed for time so we kept it simple. The  burgers were good but not outstanding.  They lacked seasoning and the buns were hard and dry.  This is a good place to feed kids for fairly cheap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hw7FfaNxQ_gzS7m-i5maZg"
  },
  "xwJ9VEqDxlXxtMMwYZsBNg": {
    "date": "6/26/2018",
    "text": "We had our family reunion in Charlotte, NC 6/22-24/2018.  You know I will travel for a good burger.   We found Zack's listed as 5 on the top ten burger places.  The burger was fresh ground beef and it was very good.  The building wasn't inviting but those are the types of places that make the best food.....I tried to get another burger before departing but I didn't want to miss my flight!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AxWV_6i2gC8-YBWOwtC5KA"
  },
  "kPMSolg6QbxzHkjjJCjOhg": {
    "date": "9/14/2016",
    "text": "I'm a bit of a burger nut, and especially love the old-school classics. This place is a must for someone like me. Based on other Yelp comments I got the Zack's special double patty cheeseburger. It's a good choice. Since I am A fan of the genre I can call it 4 stars.  The burger, while good, wasn't near the best as it was a little dry and tasteless. The cheese and condiments help a great deal and it's certainly fairly priced.  My fries were excellent.  I am from Greensboro and don't have much  Charlotte experience, but I would return here and would like to try the dogs, rings and shakes. It's a truly classic joint and one you locals should support.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RIq-GbSeuEIvnCQpm0NHyw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Worthy burgers and fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RIq-GbSeuEIvnCQpm0NHyw/o.jpg"
      }
    ],
    "user_id": "dUM5R6n0mDMzChjmUR8Qfg"
  },
  "6UsfPHmr_gQXVjMauPf_Gg": {
    "date": "3/28/2018",
    "text": "I am here now @5:10 on 3/28 they had to remake my food because they had a hair in it food was remade And got a drink i for my trouble but still all I can see is that hair.....\"smh.....food wasn't bad tho....",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wh8UA0WdXK8k2cYC999Ew"
  },
  "S0z9JKaBfweUGwWQTjjGMg": {
    "date": "10/24/2017",
    "text": "Great atmosphere, a lot of food options and great service!  Definite low key lunch or dinner spot.  Only open on the weekdays.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rGM4U2ZbQgx4I2iwiRh5rg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s onion rings",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rGM4U2ZbQgx4I2iwiRh5rg/o.jpg"
      },
      {
        "img_id": "AjHns0-xFAJFODoO3WNrrA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s special and onion rings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AjHns0-xFAJFODoO3WNrrA/o.jpg"
      },
      {
        "img_id": "U-0hlp183PVLKvANrT559Q",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U-0hlp183PVLKvANrT559Q/o.jpg"
      }
    ],
    "user_id": "Qb-8k6qKMq9gjCZlm_o2lw"
  },
  "Y34B02p-PL0BP0Y3aKCDpQ": {
    "date": "12/12/2017",
    "text": "It is a nostalgic burger. It is the best classic diner-ish burger that you can get in Charlotte. Nothing fancy. Nothing crazy. It is just an all american burger that you MUST try.  Everything that I tried on the menu was good, but the burger, corndog, and chili cheese fries are my to-go. The staff are friendly, and the experience is always fun!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MoRLfGGd1wYmgFXFFnCaqw"
  },
  "KotdOk82s1xevuZRPOLufg": {
    "date": "3/10/2018",
    "text": "Family run joint that reminds you of an old school burger shop, because it is. Owner/manager and his staff were extremely friendly and they moved quickly, especially with the line they had during the Friday night dinner rush. We'd brought the food back to our AirBnB, and it was still hot, not soggy or greasy at all. Wish I lived in CLT to go more often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oUlnuEHlF1FdUu52aIigRw"
  },
  "vd-rNgLPVu6YY8W9W2wDqQ": {
    "date": "4/15/2017",
    "text": "All you need to know is order the Zack's special!  Every bite of the double patty cheeseburger was fantastic served with french fries.  Honestly I have no idea of what I else is on the menu but it really doesn't matter since this should always be your go-to order.   It's pretty packed during lunch so worth it !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WoE8rLUh8Pu76lWw8soohQ"
  },
  "1P7SEnqtUvRWgG_wOK4bJA": {
    "date": "12/30/2016",
    "text": "How I've never been here as a Charlotte native and a 40 y/o man is beyond me and quite honestly I'm disappointed in myself.  Now that we have that out of the way let me just say you NEED to go here.  My wife and I visited during lunch time and I had the Zack's Special and she had a single cheeseburger with cole slaw and fries.  For me, it was love at first bite.  Just a great quality burger and toppings of fresh ingredients turned me into a burger fiend right then and there.  Beyond the fantastic burgers, they have nearly every menu item a diner of this age and genre should have.  Corn dogs, hot dogs, onion rings, etc.  The interior is perfect diner decor.  Orange bench seating, wood-like plastic laminate veneer tables and stools for those wanting to eat while at the windows.  They have exterior seating if the weather is good enough.    This is literally my new go-to for diner food.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "J6U0EsKifCTnqMHWaKF3qQ": {
    "date": "6/28/2017",
    "text": "Zack's is the perfect, simple burger. Nothing fancy, nothing crazy, nothing innovative; but the genius is in that simple perfection. The restraint and consistency astound. The best True burger in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wyn5sHuqzm8L3-qOVhnT_A",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The Zack&amp;#39;s Special",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wyn5sHuqzm8L3-qOVhnT_A/o.jpg"
      }
    ],
    "user_id": "Qe5wf8zKv79IMjeCeZEYBQ"
  },
  "AxuXv87YTCoN1M0oMjFd3w": {
    "date": "1/7/2019",
    "text": "First time here, quick lunch with my wife. Great spot, great fresh-cooked burgers and fries. Quick service, old school-type diner feel. Order at the counter and come back to pickup your food. No frills, but very good!  Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GDy7nWWR9Gk_JwctrMLEMw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GDy7nWWR9Gk_JwctrMLEMw/o.jpg"
      }
    ],
    "user_id": "hV802LXFrtUJOXwSNrkwXQ"
  },
  "btBX63nBfBuLdXteldihuA": {
    "date": "6/3/2019",
    "text": "Zack's were amazing! It was my first time checking out this Charlotte gem! I ordered the Zack special (double cheeseburger) with the onion rings and I was not disappointed! It reminded me of an old school drive in restaurant that I am used to from my home state of South Carolina. (shout out to 301 now called The Drive In located in Florence SC!) I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "29vtBNW7413lNjUU3tGbew"
  },
  "AXtZmufQrd8RNBbKtJ4OcA": {
    "date": "10/19/2017",
    "text": "I have driven by Zack's for years and today I finally had the chance to check it out.  After reading other Yelp reviews I decided to try a few item: cheeseburger, hot dog and onion rings. Overall, the burger and fries were okay...and let me just say the special sauce is no comparison to In and Out, so if you are expecting that, sorry. But, the reason for 4 stars is for the service and Onion Rings. OMG, the onion rings are coated with a think fry batter, but it tastes light, no grease. They break as a good Onion ring should. A definite must. As for the service, although the place was packed they definitely have a system down so it moves pretty quickly and the servers are so sweet. A definite gem I recommend any one should check out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "4zvqYYclZSzi0M9ektLfEQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4zvqYYclZSzi0M9ektLfEQ/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "elxU11NsRciCOli5TggNhw": {
    "date": "12/2/2017",
    "text": "This is a \"must\" check out spot if you want a throwback burger experience. No frills or anything fancy, but a solid burger. You kind of taken back in time as soon as you walk through their doors, from the ads to the stickers on the door, everything takes you back in time, including the prices. Sure, it's not a .50 cent burger, but still very inexpensive for today's price point. We went with cheeseburgers and fries, which were simple and delicious. I'm not an onion ring person, but I will say those looked tasty as well.   All in all, definitely a spot to check off on your charlotte food map!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "_AO_1o1oUhLuNQru1uO_Zg": {
    "date": "1/26/2019",
    "text": "Best burger in Charlotte!!! I order a single made like a Zach. It comes with one patty instead of two. Good old fashion burger, great milkshakes! I order onion rings instead of fries. The fries are good but there is something about their onion rings and that fried goodness!!  Good sweet tea too!!  Enjoy!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwFE7d1zM1QPfbzM4JGnTA"
  },
  "a8f32LNxDP6rhqqDuQGJfQ": {
    "date": "10/23/2018",
    "text": "After living in Charlotte most of my life and having never tried Zack's before, I finally decided to try it after all of the hype. Maybe my expectations were too high because I was fairly disappointed.    The line was quite long and it didn't move very quickly. They could take a lesson from the old Char-Grill in Raleigh of letting people fill out their own order forms. There is a call in order option if you are getting take out.    I liked the size of the single burger - it was small enough not to be too filling.  The basic burger comes with ketchup, mustard, onions, pickles and Zack's special sauce. I requested no onions or mustard. The amount of ketchup on the burger was negligible and was Hunt's (second rate brand). The special sauce appeared to be a mixture of ketchup and mayo with very little flavor. There was a generous potion of pickles. Overall, the burger lacked any real flavor.  The fries were my favorite style - skinny. But even they disappointed. They needed salt and there were not cooked well. And they only gave two packets of ketchup (Hunt's) In my bag.   They do have the good ice that everyone likes for their drinks but I suggest requesting light ice as the cup was packed with ice leaving little room for the beverage.    So, If you want a Local, greasy spoon burger at a cheap price, I would recommend Mr. Ks or Brook's over Zacks.   If you want a fast food burger of better quality with lots of flavor and better choices of toppings and sides, head for Smash Burger, Bang Bang Burger or even the new addition from New York, Shake Shack.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vJEKGJ8gvJ8yAxFp8PBsGA"
  },
  "s9ITPniXaSy-iF9xqxePtw": {
    "date": "9/22/2018",
    "text": "I am so glad I drove by this place. Classic burgers, fries, shakes and more. The interior is clean and the patio reminds me of a diner from my hometown. I had the cheeseburger, a cherry coke (grenadine here!) and onion rings. Hot and clearly hand battered, they were my fav thing, but it was all delicious. Super nice man at the counter who smiled at every customer despite long lines, and he never missed a beat. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDwBN2Yjh2P4qgbgM6Jqtg"
  },
  "f1bixDXoAVvUyWzv57-irw": {
    "date": "11/2/2017",
    "text": "My coworker wanted to try this place for his birthday lunch. I can't believe I've never heard of this place before! When you walk up it looks like a place from the 60s or something.   When you walk inside the counter is right there and the line easily wraps around the side of the counter. Very limited seating so either come early or be ok with sitting outside! The service is pretty fast though so don't let the line intimidate you.   I got a corn dog with chili cheese fries. It was pretty tasty!! Plenty of chili and cheese and almost all the fries had some on it. Corn dog was great but it's hard to mess up a corn dog!!   My other coworkers got the burgers and they said they could've been warmer. The burgers are the thin kind. They also got the onion rings and said the could've been warmer too. They were good but a touch bland. I love onion rings so I'll have to try them the next time because other reviews have said they are tasty!   The food is cheap and good. If you are looking for a unique place for burgers, fries, and shakes check this place out!! Very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F-JT2MaxS9U2aYg0FHjY9Q",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/F-JT2MaxS9U2aYg0FHjY9Q/o.jpg"
      }
    ],
    "user_id": "yG5GBPaHFSqSllss_3VqGQ"
  },
  "IAOGlo3mvN9oQnP8EmoQmw": {
    "date": "4/5/2018",
    "text": "I cant begin to tell you how good my cheeseburger was , me an my friend ordered the cheeseburger an fries an shrimp plate to share. I dont recommend the shrimp get that at a fish camp. They are know for their cheeseburgers an onion rings an shakes fir a reason.  The burger was perfectly cooked an juicy an onion rings so crispy an hot hot lol They are not opened Sat/Sun so get your burger fix on during the week . They are busy but the staff has it under control. Call it in an pick it up lots of to go orders.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Db8svO2n4Yz9PY4wg8tRUQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Db8svO2n4Yz9PY4wg8tRUQ/o.jpg"
      },
      {
        "img_id": "1u6Z5r1JxHELRyzRwba7Bw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1u6Z5r1JxHELRyzRwba7Bw/o.jpg"
      }
    ],
    "user_id": "6owWBv_F8Tqti4zmnn2ymA"
  },
  "ExCWaan2mno1JpeyN4pG1A": {
    "date": "1/25/2019",
    "text": "I went there for the first time in November 2018.  I just wanted a burger and I've driven past there several times over the years. It has an early 1960s atmosphere, but doesn't overdo it.  Ordered the Zacks Special w/o cheese.  The burger was as good as one of those $10 burgers.  The fries were as perfect as fries can be.  Then I decided to play food critic and get a hot dog and onion rings. The hot dog was marvelous. But the onion rings?  The BEST I have EVER eaten, anywhere, at ANY price!   Finally, went back and placed a 3rd order, for a chocolate malt milkshake.  That was ok, but a big letdown after the burger, fries, hotdog and onion rings.  I wish I lived closer to Zacks, but next time I'll try another burger with onion rings and/or fries, and maybe something else, but definitely skip the shake.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dksppmS5T8IFx0qz_vcE5w"
  },
  "De8cIWbsR1ewbGMgaKWeug": {
    "date": "9/19/2018",
    "text": "Old school restaurant that welcomes you with great customer service. The staff were very nice while getting our order. According to your receipt number, the intercom will summon you to get your food, which I totally appreciate to not awkwardly look around and hoping every next food order would be mine as I could just sit at one of their many tables. Went through lunch hour with a good amount of people but still got our food within 10 minutes. They have great prices for such a quality burger. I'd say they have one of the best burgers in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "peVJkPEfwBL3kZSbuC9FUA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/peVJkPEfwBL3kZSbuC9FUA/o.jpg"
      }
    ],
    "user_id": "dATz-wXMQHXiUx2qM34VBA"
  },
  "9kYdnbdTrXcidnd6XW44MQ": {
    "date": "11/17/2017",
    "text": "I don't get all of the fuss over Zack's Burgers, a frozen sub par quality patty with no seasoning on a dry bun with Big Mac sauce? This place should not even be mentioned in the same breath as Brooks Sandwich House.  Yeah, I get the price on the Zack's Special is good but you can get a better hand pattied burger at Brooks for less than Zack's machine stamped frozen patty. I will say that the onion rings were great at Zacks, and appeared to be hand breaded not frozen.  I did not order the special since I did not want frozen fries so I opted for the Double Cheesburer which I assumed was the same thing as the Zack's Special, NOPE, the double cheeseburger comes with double meat but NOT double cheese!  Food: 3 Sporks Service:  3 Sporks Atmosphere: 43 Sporks Sweet Tea: 4 Sporks Value: 4 Sporks",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZuKmM78JxB15KEb_ukj3Q"
  },
  "PxN9pnVN0E5vE_erL6KICA": {
    "date": "7/4/2018",
    "text": "Traffic location keeps it from 5 stars. But I'll deal with that just for the food.  YUM! YUM! YUM!  I can't believe how good these burgers are!! And the prices can't be beat!! It's an old drive-in/diner. You think you stepped back in time and a menu to reflect it. Don't let the look of the place fool you. Cheeseburger, fries, and milkshake were so on point, I got takeout for the family's dinner. They all asked where I got it & asked me to bring it home again!!  They've been here for years and now I know why. Definitely going back. Again and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VY6tOLt_ahzJLt12MoTKUw"
  },
  "XKTX_WDgN-6GCSbNwmQ0Ew": {
    "date": "5/1/2018",
    "text": "Came here for the first time with my boyfriend and fell in love!!!!! The food is delicious and loveee the old time feel! Got the Zack special with chili cheese fries!!! Omg!!! Can't wait to come back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hKeOJ1hMXIwkOhu_KqXRPA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hKeOJ1hMXIwkOhu_KqXRPA/o.jpg"
      }
    ],
    "user_id": "FtLNRydcEXtG7yFrtvaCrw"
  },
  "LMzb11TDIh8ALTN2BVsK4g": {
    "date": "8/18/2016",
    "text": "I love this place. Great food. Had the fried chicken and it was SUPER crispy and juicy. Cole slaw and fries were good too. I love the atmosphere...very old school and chill. Employees were very nice & there was plenty of parking, even when it was packed. I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "mmRIpfJP1FUI5gfvT30SzA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Crispy and great!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mmRIpfJP1FUI5gfvT30SzA/o.jpg"
      }
    ],
    "user_id": "r7RdCrF0SpzFoUWFb_8oyA"
  },
  "B_eDGTkfD1phV2OonHRdrQ": {
    "date": "5/10/2018",
    "text": "I wish I hadn't been so hungry because I finished my burger before I took a picture. My Zack's special was absolutely divine. Forget shake shack, forget smash burger, this place is my new favorite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FjVJ1BJ2Y26vL41UdSxDKg"
  },
  "EhwzX7au5hqaaItbgH-JbQ": {
    "date": "12/4/2018",
    "text": "This place should be on Diners, Drive-in, and Dives! The classic burger joint vibes only add to their amazing burgers. The Zack's Special was great. What makes a good burger? The kind of meat, how it is cooked, the season? Whatever it is, they have nothing to worry about at Zack's. I was impressed with the simplicity and the fantastic flavor (and I didn't even mention the low cost). I would swing by this place for a burger any day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "qZDDfAqrk6PdwkEs1WSqAw": {
    "date": "9/18/2017",
    "text": "Zacks is one of my favorite lunch spots in Charlotte. The onion rings are very good golden and a little sweet. But I'm honestly in love with the hot dogs are to die for. the line can be really long at lunch time but they try and move you as fast as possible. I also love the shrimp and trout tray. it has an old school feel to the shop the bathroom is out back not t much has changed sine the business opened many moons ago as the old folks say",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gnN8Cb3dxoJ4P2xuKdCH3w",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gnN8Cb3dxoJ4P2xuKdCH3w/o.jpg"
      }
    ],
    "user_id": "R4J6GaAsIR6PakJOnHNZVg"
  },
  "jBdVPvgxGxCGub7hAoV_ow": {
    "date": "12/20/2018",
    "text": "Good, simple, old fashioned burger, great onion rings... Utterly appalling and disgusting bathroom. Makes a back road truck's top seem like the Taj Mahal. .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dn5HCWsg6p11yZcyuK0-UQ"
  },
  "iXTStwT4UoDsAB_wDY0d8Q": {
    "date": "4/8/2019",
    "text": "By far the best burgers in Charlotte! Great location, and convenient, fast-food speed of service. Would definitely recommend to all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I9qnthNNPOiKz2qtTER8-A"
  },
  "GutgM2SYdMNDOulVxd43tg": {
    "date": "8/18/2019",
    "text": "Good diner food.  Wasn't a fan of the shakes but the Zacks special is delicious!! Budget friendly and always packed during lunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBGV1WBghL3tgbjAamXIsQ"
  },
  "aeImMUO9_GBbxJ9_t03AhQ": {
    "date": "6/29/2019",
    "text": "working in the area and Mr Matthews got a hankering for a Big Zack so here we are... As usual I had my lunch with me but something shakey and banana-ish sounded better than cold coffee so I went with that. $2.50 and five minutes later I'm looking at a 20oz cup of blended banana bits in soft serve thinking this is great! and it was too! I'm a fan of these throw backs, there has to be something other than marketing keeping them open for the better part of a century. Usually it's a well executed plan where the customer sees value in the cash-for-food exchange. It doesn't have to be gourmet (like that's even a thing!?) but it does have to satisfy, and the steady stream of foot traffic suggests that it does. I'll have to come down on a tourist trip and see how Zack's stacks.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "Z7pFsGpIyLzMTZsXjTFF1A"
  },
  "l1FOGXWxxBFTOH2UzZSxpg": {
    "date": "6/6/2019",
    "text": "This place is a joke!!  I only ate here because my new co-workers brought me here on my last day of training before I came back home.    All they serve are some of the the simplest frozen foods made to order, Lol!!  Everything you order is cheap food, there aren't fresh fries from fresh potatoes, and who knows if the beef wasn't frozen either.  They serve carnival food, haha!!, and I wanna say that even our carnival food in Texas is gourmet compared to this junk.  I wasted my calorie count for the day on one crappy meal today.  Do yourself a favor and research this place before you come here.  Would have been better off going to freakin McDonald's!!  At least their cheap food would have tasted better.  Just look at the inconsistencies of their food prep and that should send a red flag.  Look for the inconsistencies in their onion rings alone, some look raw and some look well cooked.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LZNTYRzQqGTTcBBQJZAdHg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. What a joke!!  Look at those cheap fries!!  Nothing gourmet about this place.  You get what you pay for.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LZNTYRzQqGTTcBBQJZAdHg/o.jpg"
      }
    ],
    "user_id": "fMe4Zf-nhjJQagOi-wNwJw"
  },
  "gqtZdVQOAuyplz3EGHBiuQ": {
    "date": "4/9/2019",
    "text": "This place has a really cool aesthetic and really looks like a burger shop straight out of the 50's. The nostalgia factor alone is worth a stop, but I can't say I was really blown away with quality of the food. It was your run of the mill burger.  The way the line bunches at the door was also sort of annoying, but if you're dining in and want to feel like your grandparents did back in the day, stop in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oxVbY1Zd7g7sJqd_yKZTQ"
  },
  "Wait9R2cyY5H9ivWeua-BQ": {
    "date": "1/28/2019",
    "text": "I decided to try Zack's based on the STRONG recommendation of a coworker. She basically said the 'best' burger in Charlotte is at Zack's so, naturally, I was intrigued and made a stop on a Friday afternoon for lunch.  Zack's is located right off South Blvd and in a spot that you just cannot miss if driving by. They have their own parking lot but just be careful when driving up because it's a small lot yet fits a decent amount of vehicles. I walked right in and got in line. From what I've heard, the line can wrap around the building but there was only about four people in front of when I got there. When you step inside, the line is formed to the left. Keep that in mind because there are a number of people hanging around the front waiting for their orders.  I ordered the Zack's special which comes with two patties (with no mayo) and a side order of onion rings because said coworker asked & insisted. For the Zack's special with fries, drink, and onion rings, my total came to $12 which I found very reasonable. I placed my order and waited around 5-7ish minutes before my number was called. I took my food and brought it back to work.  The inside is pretty small. There are a number of tables that surround the center order counter and a small table top with bar stools in the front. For warmer weather, there are a few tables outside. Just keep in mind that this is not a good place for a large group.  Unfortunately, I discovered my food was lukewarm, far from hot which was disappointing. The fries had no salt nor seasoning. The burger itself was good, I just would've preferred it warm. The onion rings were very crumbly because they were cold. I imagine them being a lot better if served hot.  I plan on making another stop at Zack's in the hopes that I will get a hot meal.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "3se3lErMFof6NHDumI_Vog",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s special (double patties)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3se3lErMFof6NHDumI_Vog/o.jpg"
      }
    ],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "EB0LR_8Sxtb6FxA2f0BoZA": {
    "date": "3/17/2019",
    "text": "I love the way this place is put together. They play oldies music and I love their set up. The glass in front of the kitchen and front counter gives you a classic feel. I highly recommend the Zack's special. Definitely order the onion rings because they are definitely handmade and they are amazing.  I love coming to this place on a rainy day to cheer me up.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VwFTXhF0opG8VeDabDg44g",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Onion rings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VwFTXhF0opG8VeDabDg44g/o.jpg"
      },
      {
        "img_id": "QbV6Ttw1s0NQPlGtOXC--Q",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QbV6Ttw1s0NQPlGtOXC--Q/o.jpg"
      }
    ],
    "user_id": "I8flth7ZMjES03pgNRK3nA"
  },
  "AJsni3EVwgkqmPizfjwrgg": {
    "date": "8/10/2019",
    "text": "This is a classic throwback burger spot, and a Charlotte landmark. Good food, fun atmosphere, and reminder of the character this city still has.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xi4m_q0o2LiGHqMBF2PT4A"
  },
  "Bs15T-eJz9bkYdAVLx-avw": {
    "date": "8/8/2019",
    "text": "We're blessed to have this little slice of old school Charlotte still left. Food is solid and the people who run are even better . Thanks Zacks for sticking around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3pjsv0hYTKOKmXJN6w2QhA"
  },
  "gkwPXjuEjdofFBGMfZ4Xrg": {
    "date": "9/15/2018",
    "text": "This place has an old time drive in feel.  They have a wide range of menu options. The staff here is very friendly and willing to help.  You can either eat in the indoor dining area or at the patio in the front of the restaurant. I like the flaky onion rings over the beer battered ones. And was excited that they had the flaky ones. They tasted 'ok'. I have had much better. I also ordered the double cheese burger. The burger tasted fresh, but was not one of the best that I have had. They have a lot with ample parking. I was teetering between 3 and 4 stars but opted to go with the 3.  I would eat here again if I was in the area, but would probably not make a special trip there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gyOzT6Pba8wPWmTiWW0mBQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gyOzT6Pba8wPWmTiWW0mBQ/o.jpg"
      }
    ],
    "user_id": "xalgcjscRLNPuyaAeKNThA"
  },
  "lOX4opy388NbENCU8pgjGA": {
    "date": "7/25/2018",
    "text": "The feel and vibe is yesterday's old drive in and burger joints.  The line at lunch explains it ...  the food is good and the service is delivering at record pace...  I can't comment on much except the beef hotdogs and that's pretty much where I got stuck ... every single time they're delicious! My typical order is a chili slaw dog all the way with fries and a tea .... Someday maybe I'll be able to try something else but for now ..  it's my go to favorite ! It's a Charlotte landmark and I love it.  I've heard the Zacks special is fabulous... maybe someday I'll be able to try it ....",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Y7kdimSFEZJrjm2MWt0m8Q",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y7kdimSFEZJrjm2MWt0m8Q/o.jpg"
      },
      {
        "img_id": "2Ivx7NK0Q3vPbpQFQ_63nQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The line .... yes when&amp;#39;s it&amp;#39;s good food it&amp;#39;s worth the wait !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2Ivx7NK0Q3vPbpQFQ_63nQ/o.jpg"
      },
      {
        "img_id": "kEYgptlIzZyJgFsv69YIkg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Delicious chili slaw dog",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kEYgptlIzZyJgFsv69YIkg/o.jpg"
      }
    ],
    "user_id": "DYFXCoWpMAkTey_kCQZUYg"
  },
  "RlHEaIaeu8seG55WRWzGwA": {
    "date": "6/8/2018",
    "text": "I really didn't want to be \"that guy\" that gave an established institution like Zack's a bad rating but it really didn't do it for me. I arrived towards the end of the lunch time rush and ordered the Zack's special, fries, and a corndog.   The burger was messy and not in the good way. My bread fell apart, the lettuce and other toppings gave the burger an \"off\" taste. The meat itself tasted bland, which was surprising because it looked awesome. It was really a let down because I thought this burger would set the new standard for what a burger should taste like. Absolutely not!   The corndog tasted like it was taken from the freezer and thrown into the grease. I am not sure if they make them in house or not, but it surely did not taste like it.  The fries were severely lacking in seasoning. I was given salt packs in my bag, but I feel that fries are best when salted as soon as they get out of the grease. They were a big let down, as well.   Also, the staff appeared as if they were ready to go home (which I can definitely understand) but it looked blatant. They were very short with the customers and not very personable at all. I was also almost given the wrong order. The lady looked confused when I told her this was not what I ordered. She looked at the ticket, took the food back, and never addressed me again until she called out my number for the correct order.   It was not a good first visit. Maybe it was an off day for them or my taste buds, but I wasn't impressed. I think I'll sit this one out from now on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UjyqKemlj0a3EFuhYmLssg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UjyqKemlj0a3EFuhYmLssg/o.jpg"
      }
    ],
    "user_id": "Y8AnzqYWw8A2XQ36WHjtQw"
  },
  "4BsPGxd6baOkcbySBLEJ_g": {
    "date": "8/5/2018",
    "text": "Old timey diner feel, although not fancy.  Food is guaranteed to hit the spot every time!   Parking lot can be a bit stressful because its small for the amount of cars coming and going from Zach's. They have a HUGE lunch crowd!  Although, wait is not long - couple of minutes at the most.  They have it down to a science.  Good customer service.  If you're in a rush, call your order ahead and be sure to go to the call ahead line when you walk in.   What to order? As someone who grew up on Zach's, I ALWAYS order the Zach's Special with fries.  The Zach's special burger (the original Big Mac!) features two all beef patties, lettuce, cheese, tomato, onions, pickles and special sauce - a mouthful of wonderful with every bite.  Great value for the price - about $6 and some change.   They are not open on weekends.  The friendliest family owns this restaurant.  Support local!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HBby8RPo-cP9LPFImpWVUw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zach&amp;#39;s Special",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HBby8RPo-cP9LPFImpWVUw/o.jpg"
      },
      {
        "img_id": "0nhAQ04mBz1CHrVacMtczA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0nhAQ04mBz1CHrVacMtczA/o.jpg"
      },
      {
        "img_id": "roQ2jfVBGSWO8Zi6srG3Kg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/roQ2jfVBGSWO8Zi6srG3Kg/o.jpg"
      }
    ],
    "user_id": "8EVCarfyVLP14hlS4HVk1w"
  },
  "OKhF2H6dVWcX_i2avU5ZGQ": {
    "date": "11/27/2018",
    "text": "Zacks is what I like to think all roadside burger joints used to be like before the McDonalds and Burger Kings of the world took over. A fun atmosphere with a retro vibe takes you back in time and you can still feel good supporting local business as this place has been around forever.  I was excited to stop by recently as their hours are somewhat limited on weekends and I normally work on the other side of town. I ended up getting the zacks special which is a solid choice (double cheese burger with special sauce) and opted for the onion rings as I had read they were good. Overall the meal didn't disappoint and I would certainly rate it a good value. I also appreciated some of the little things like how my wife had a cherry coke where they had to mix cherry syrup in to make it. Delicious.  Also be sure to check out the posters on the wall before you order as there are some cool things in there like photos of when Homeland shot one of their scenes there.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nvHJFFr5R74ug5NOh2VDPg"
  },
  "sb-UQbrrbbZzh1D51V_dcA": {
    "date": "10/17/2018",
    "text": "My husband and I basically drive passed Zacks every day as it's near our house. They are only opened Mon-Fri, so this passed Friday we had off and had to check it out.   Cute old school vibe. Limited seating but there are a few tables outside too if inside is full. It was definitely busy at lunch but they seemed to work through the line quickly.  We ordered a few things between my husband and I. Zacks Special was delicious. Sauce on it was great. Double cheese burger with sauce and a few other toppings. I usually dont like burgs like this but it was my fav. The fries that came with it were average. We also got a chili dog and onion rings. The chili is that thick beanless paste like that you would expect and was tasty. The onion rings were awesome....the batter was perfect. I also got a cherry coke. 1. there isn't a cherry coke fountain drink so I know they mixed something good together. it tasted like it. 2. They have that good good ice.   Overall, Zacks is a winner in my books. All the polls that have placed them top burger joint and people from tv shows that have filmed here (all of this is on their walls) also agree with me!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 9
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "63LQn9gKJ2zPeYfPloMvxg": {
    "date": "4/8/2019",
    "text": "I decided to try Zach's because of all of the good reviews and was totally disappointed. I ordered a double burger minus the \"special\" sauce (the woman who took my order said it was 1000 Island Dressing). The burger itself had a strange taste and texture. It did not taste like real meat. I personally would rather eat a specialty burger from McDonalds than to go back to Zach's.  I am dumbfounded that Zach's burgers have such good ratings.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w4NLWliOk7TXtdcKwXbRUw"
  },
  "dR43K-TB2X_yYO_h74Y44w": {
    "date": "6/27/2019",
    "text": "OMG YUM! Now I'm no burger connoisseur actually quite the opposite, I eat super clean but every now and then I want a good burger. I drive by Zack's every day on my way to work. I was also a little intrigued by the old diner style but never really thought about it. Well Charlotte 5 sends me emails and i got one two days ago and it highlighted Zack's burgers. Since then I've craved one. So today I took the plunge and wasn't disappointed. I ordered the Zack's special and was given my number to wait to get called, the place was not very busy which was good there is ample seating but i took it back to work with me and sat outside.  I got my burger in about 7 minutes and it was amazing... the fries were fresh and not over seasoned and the burger was hot and fresh. Everyone's reviews are a little different and I'm sure the time of day and how busy they are can sometimes effect it but i had a great experience. I satisfied my burger craving fully! I would have got a shake too but i e probably already hit my calories for the day  Definitely worth checking out  !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DBY0s5xa0wb1TV-CwW-bOQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Ordering window .. Ver y70&amp;#39;s with the music and the uniforms. It&amp;#39;s pretty great.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DBY0s5xa0wb1TV-CwW-bOQ/o.jpg"
      },
      {
        "img_id": "8c5R7UNsr_Q-9mqX0zCQsw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Patio area taken from the bar window .",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8c5R7UNsr_Q-9mqX0zCQsw/o.jpg"
      },
      {
        "img_id": "pu3WFlllIOJ8Fdo6Ozeoig",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. The Zack Special two cheese covered patties loaded up and great fries..   The picture does not do it justice ?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pu3WFlllIOJ8Fdo6Ozeoig/o.jpg"
      }
    ],
    "user_id": "rckjLcYiZNr0agDMXPZrcA"
  },
  "GXA1UF9jRSlPRUivrwwA1A": {
    "date": "4/25/2018",
    "text": "I visited Jack's for the first time today after recently relocating to Charlotte. I decided to dine in because I had some time to kill and it was still a bit wet outside from the previous days rain. The inside reminds me of an old diner meets food stand with decor dating back to the 1970's. There was memorabilia and famous photos all scattered along the walls and windows to gander at while you wait and eat. The place has been around since 1975 and you can certainly tell when you walk in.   All orders are places at the counter and it is self seating with 4 person booths and a bar area . I got the Jack's Special and didn't wait longer than 10 minutes before my hot burger arrived at the counter.  The food was just as expected for the price. It came hot and greasy fresh off the grill with a somewhat soft bun and toppings galore. The only trouble I had was that it was a bit messy and began to fall apart towards the end making it difficult to pick up. The fries were similar to those you would find at any bar. I had a sweet tea to wash it all down which was as sweet as the south makes it.  Overall I enjoyed my experience here and I am excited to go back and try more items. They have an outdoor seating area that I am excited to go back to enjoy once the sun comes back out",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sbqwf9KQROdK2EUfNG-vmQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sbqwf9KQROdK2EUfNG-vmQ/o.jpg"
      },
      {
        "img_id": "u4jLQPrFRsuz38R_t9dyAg",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u4jLQPrFRsuz38R_t9dyAg/o.jpg"
      }
    ],
    "user_id": "njcsaHNBbLFkWMf47NNeqw"
  },
  "nSabF4S4rLJxOqzjLzgWgA": {
    "date": "6/27/2019",
    "text": "Great food. Quick service. My favorite is the trout dinner plate. The burgers are also delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exwWGBCGMYHvOqi9BYhOmA"
  },
  "cLoksp99JMAMhCYLCasniA": {
    "date": "2/15/2018",
    "text": "I went here again and still think the food is pretty good. The Zack's special is my favorite.   The service is really fast, but it does get crowded at lunch so you may want to get there before 12.   There were a couple of things I didn't like about this visit. I ordered the Zack's special which comes with fries and I didn't want the fries, so I asked for no fries. They still charged me full price though and I would have hoped to get at least a small discount otherwise I might as well have gotten the fries and given them to someone else.   The seating is also not ideal for even small groups. The booths are really small so it's hard to fit more than two people in them.  The burgers are simple, classic burgers and they are good. I'll continue coming back when I'm looking for a good classic burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MTjCkfb5mdw3Q9GiDTJ2YA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MTjCkfb5mdw3Q9GiDTJ2YA/o.jpg"
      },
      {
        "img_id": "diLJY2RLeK0SD6dO_gWFxQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/diLJY2RLeK0SD6dO_gWFxQ/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "P7rOZMaKFQVmTJc4bkxa0w": {
    "date": "1/18/2019",
    "text": "This is really 2.5 stars, rounded up. Came here after reading all the raves about the burgers and onion rings. Ordered the double cheeseburger and rings. Waited long enough that I expected everything, especially the rings to be inedibly hot.  Boy, was I unpleasantly surprised. Rings- heavily breaded and room temp. Tasteless would have been an improvement...they were just bad. Burger - overdone skinny hockey pucks. And cold. The burger that won 8th best IN THE FREAKIN COUNTRY.  Really, the 2.5 stars are for the bun (soft, fresh, yummy), the sweet tea (with those little pellets of crushed ice) and the ambiance of old school burger hoints whe nbn a burger was 15 cents. Which is about what this one was worth.  Much better example of this kind of burger is Brightstar Grill in Mt. Holly. It's been a while since I've been to a restaurant that failed to live up to the hype as spectacularly as Zack's. Here's hoping I just got a one-off bad meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gr9AUMaEDRqvs4UJ4NWx0g"
  },
  "uH6GgIH6QrO65rmy2DqfgA": {
    "date": "3/22/2012",
    "text": "I love that this old fashioned burger joint is right down the road from where I live! My family and I have been coming here most of my life and its always great food and fast service no matter how packed they are. Why would you ever stop at Wendy's or burger king when this place is nearby. The here food is ten times better and reasonably priced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rTmxh8WboL-J3HOqJoPnIg"
  },
  "r8ULYqdcrq9cVzPe496bBQ": {
    "date": "10/29/2007",
    "text": "Zack's is the very definition of a neighborhood hamburger joint. Located on the corner of South Blvd and Scaleybark Rd, they have some of the best burgers in town and are a great Cheap Eats lunchtime destination. Being from Charlotte I have grown up on the Zack's Special( The Anti-Big Mac) a double patty burger topped with their own special sauce accompanied by a side order of some of the most perfect onion rings imaginable. Top it off with the Banana milkshake and your in heaven.Do yourself a favor and checkout this local landmark.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "buRSVDKXhHX3dyy9dgv37Q"
  },
  "qGF38Wclw3Mwi7f9PwrEjQ": {
    "date": "3/24/2009",
    "text": "First visit I tried a cheeseburger & onion rings. Basic cheeseburger doesn't come with lettuce or tomato but was very tasty. The onion rings were overdone, dry & tasted like they had been sitting around since lunch. Second visit I tried the Zack's Special which is similar to a double double from In 'N Out. Zack's special comes with french fries which were fresh crispy & hot. I wouldn't say their onion rings are anything special as they advertise, but Zack's is an excellent choice for a tasty greasy burger n fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2NEsFzmqz56Zd3cZTCDQZw"
  },
  "Qa6EX20YoG8kuYvqMNgczw": {
    "date": "6/7/2007",
    "text": "Zack's has the best hamburgers in the Queen City.  Walking into Zack's is like walking into a time warp where people trust know, and genuinely like people and want to serve them the best food possible.  Zack's is owned by the Demopolous Family and they know how to make their burgers.  Located at the corner of South Blvd and Scaley bark, Zack's has been doing their thing since 1975.  get the Zack's special, some onion rings, and a thick homemade milkshake, I like the vanilla and the strawberry shakes MMMMM.  Zack's is soooo Good, you have to try them.  get this, the first time I went there, I didn't have any cash, and they did not accept credit cards, so they offered to write me an IOU.  This is the first time someone has ever been nice enough to offer me such a nicety, how trusting, how kind.  I went to the nearest ATM, but I truly and wholeheartedly appreciate that jester of humanity and understanding.  That 's just the kind of place Zack's is, family oriented, and serving  the best hamburgers and sides in Charlotte. Zack's special, try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrwyI3WLDjaBhtNqDXlwzQ"
  },
  "UuHNynZdg9F2VTwxvOAVPA": {
    "date": "4/12/2016",
    "text": "Was driving by, saw the sign and a crowd - decided to stop. Fun place, great hamburgers and onion rings. Very friendly atmosphere. Good value, worth the visit and I will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5B_0Nc8XZ8qKJ_aQp0fD9w"
  },
  "DMnU35vjnK_23MSdbjCoaQ": {
    "date": "4/10/2016",
    "text": "I go to Zack's for lunch at least once or twice a month. I was getting the Zack's special with fries but the last few times have been getting it \"Carolina style\" (chili and slaw). Wow. Lunch should be fast, consistent and a good value. You'll get all three here. Throw in very nice front counter staff who refill your drink quickly and you have a winner for lunch in the $7-$8 category. Even as busy as this place gets, I've never had a problem grabbing a booth and now as the weather gets nicer, enjoy the outdoor patio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S-aWpC4zwEiypgmY98nsvg"
  },
  "wdBxDW_pi8itKZ15DmBueQ": {
    "date": "6/13/2013",
    "text": "It doesn't look like much from the outside; in fact, Zack's looks like it's in need of a facelift, but don't let that deter you. Zack's makes some of the best burgers in town. Quick, relatively inexpensive, and absolutely delicious.   Try the Zack's Special; basically it's what a Big Mac should taste like, if McDonald's were actually in the business of making real burgers. And it's probably cheaper than a Big Mac, too.   Zack's is no-frills. No fancy menus, no fancy sauces, just good old-fashioned burgers and hot dogs and fries done right. There's also fried chicken and ribeye sandwiches to be had; I might have to sample them the next few times I go back to Zacks's.   In short, Zack's is an institution, and rightly so. You don't stay in business this long by making bad burgers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "jr212HQAwMOXGYKkZLfQvA"
  },
  "BtOI0B_F1ctO6q-IRRNQjg": {
    "date": "3/29/2017",
    "text": "my husband took me here yesterday for the first time. the food was delicious. love their cheese fries - the cheese is unlike anything i have ever tasted. not only is the food great, but the atmosphere is relaxing. nice 50s music playing in the background - i forgot that i was sitting in the middle of busy charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SAA1koSAibJNNwtp2jE0aw"
  },
  "0FQlxWvqFiO10GajLuDl2A": {
    "date": "4/28/2016",
    "text": "Zack's Hamburgers has the best hamburgers around! They prices are cheap and they have a friendly staff! We have been going to Zack's for years and will continue to go! My Favorite is the Zack Special with a chocolate shake!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_CSDmkbGwQz-vCPwzNQzhA"
  },
  "P82EopTIT6Kd4RInLclkGA": {
    "date": "9/18/2013",
    "text": "Zacks - good ole fashioned hamburgers. You cant beat the burgers here... as well as the prices. Good family run place that cares about the service/product they give. I always order the cheeseburger and fries, BF gets the zacks special w/o-rings.  We order lunch from here a lot - they get BUSY during the day so I suggest calling in, even if you want to eat there. Went for dinner recently for the first time and was surprised how busy they were during the evening (not like lunch thou!) and turned one of my friends onto Zack's. Every time I eat here I think about when I am going to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "lWpMwWYyO0w9Nw48gX_Iaw": {
    "date": "1/20/2014",
    "text": "Cheap Tasty Burgers is the name of the game here.  It looks like a old Burger joint from the 70's and still feels like it.  I'll make your ordering decision for you. \"Walk up get their special.\"  There done.  If you came here for a burger, you'll be happy.  There fish and chips looked real good too, I'll be back to try them soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-1biwACMAHTD4AtOlWnpQ"
  },
  "x4fq1bK6JRExXDbtP-HTKA": {
    "date": "2/21/2013",
    "text": "Yummy in your tummy for $5ish... I'm in  No idea why nobody told me about the best hamburger joint in town but I was driving by and couldn't resist.  this spot's been around since at least the 70s and they make a burger the way i imagine it was done in the good ole days.  Get a Zack's special, it's what a Big Mac looks like in the commercials - made to order with real beef.  For less cha ching.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "ahzVRgLg200lIJ93UwYP8Q"
  },
  "fPsIweU9SLKYfoiMYphpgw": {
    "date": "11/3/2015",
    "text": "Wow this was my first time at this burger diner and it was awesome . The cashier was super friendly and despite of how old the building is it is very clean. My burger was very juicy and taste amazing. The fries and Onion is a must item. I wasn't impress with the ice cream with fried apple pie  but everything else was awesome . Next i want to try the ribeye sandwich...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAARZ8x14HbZ_t44SDvBbg"
  },
  "8rIhTc0qHEY5s2QdxQltTg": {
    "date": "12/3/2015",
    "text": "Cheap, fast delicious hamburger can't complain, seat yourself style and also i always get the zack's special, must try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZ7akguV3Krzzq_z9xMYPg"
  },
  "vx776qUWclXpla8zdpNe2g": {
    "date": "11/7/2015",
    "text": "Last couple times I got a milkshake. ..it wasn't good at all... would still go for the burger. .. fries are ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOQoX1G_a2vqEk-koeqbAQ"
  },
  "tgxX0AqZgK0hZgUN6eGQjQ": {
    "date": "12/28/2015",
    "text": "Quick, delicious, has an old-timey diner feel. My only complaint is that they are closed on weekends and that I didn't discover it sooner! Turns out my grandmother used to eat with friends here back in her day. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPnWrNy4UqLBm6RG0-37Jw"
  },
  "GLayyxUw8Arw-roOFQHKmQ": {
    "date": "7/18/2015",
    "text": "I read the reviews and was excited to try this place.  They did not disappoint.  I ate the Zack's special.  The double burger patties were delicious,  all the right condiments, melted cheese, good bun and it was cooked very quickly.  This is definitely a home cooked burger style over your chain burger or thick pub burger but incredibly good.  Best in a while! Can't beat the price either!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gEAQbrj7ce8YL-XXhZaKNg"
  },
  "xQZ65FqOsl4511Q4AbE2DQ": {
    "date": "6/22/2015",
    "text": "Head over to Zack's Hamburgers on South blvd (behind the gas station) and snuggle up with one The Zack's Special burger. You get two ground beef patties with two slices of american cheese, lettuce, tomato, pickles, onions, mayo, and special sauce on a toasted bun. Zack's has been serving their special since 1975 and if you're craving a simple burger with no frills or complications they have one of the Best Burger in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pS03ZJBfVmjFOEDweTViOw"
  },
  "Pa1uV4SGuAeiVjUQYNaFGA": {
    "date": "3/3/2015",
    "text": "I am from New Jersey and stopped by Zack's Burger during my visit to Charlotte and it was AWESOME. Everything is fresh and such an old school feel to the place! Just like an old time diner. I recommend it to anyone!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "68L1vsUthzRt8oegdhUvdg"
  },
  "IZmzP47q46IQF4EUJSjqCQ": {
    "date": "2/3/2015",
    "text": "Five stars indefinitely! This place doesn't look like much, but the food is delicious! The hamburger makes me think of in and out burger (from California) but bigger. I got Zach's special which is a good amount of food for under $6.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBkFofI9P0_u4Zh6ksyJnA"
  },
  "nkEcu7nQAttidCOQBfU2sg": {
    "date": "1/28/2015",
    "text": "Some of the best burgers in Charlotte. I can bring my whole family there and eat for quite a small investment. I've gone there for years and really enjoy the Zacks special",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTGm7hMJVUmBYGFQ46ar_A"
  },
  "wvU0lSr0J-fbY5OQoew2_w": {
    "date": "12/13/2014",
    "text": "This is a neighborhood staple. Exceptional food, cheap eats, and fast friendly service. Don't expect a lavish burger, but this is a go to burger joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IJr1_R-MGrh0397orpOmJg"
  },
  "pB5GBuGoKyPTOQgU8AMX5A": {
    "date": "9/9/2014",
    "text": "Ahhhh Zack's. I wish I could eat here more often without gaining an extra hamburger (or 3) weight. So glad they've taken credit cards, as before it was cash only. I usually only get the hamburgers, which are pretty darn good. The place is the size of my thumb, but that doesn't take away from how good and \"dinerish\" the food is. The milkshakes, fries and onion rings are delish. The staff reminds me of diners back home- a strange assortment that works! And the best part? The prices! A lot of food for a super deal of a price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rq-BzoHF7EsCXMWMnhzDvw"
  },
  "CvW9LvM1wZIrxciusoxE0A": {
    "date": "11/15/2012",
    "text": "Zack's Hamburgers is a great place.  Their special hamburger has two patties, special sauce(thousand island style), iceberg lettuce, American Cheese, pickles, and onions on a sesame seed bun...sound familiar?   If you live in Charlotte you definitely need to check this place out.  This is what I would imagine McDonald's to be like when it first opened.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofBG0aiodf4mmNsj4DeH1g"
  },
  "aKOmi1d2iR52UBOjDoRbZw": {
    "date": "11/8/2016",
    "text": "We had good old-fashioned burgers and fries. Walk-up, place your order, wait 5 minutes and you are treated to a fresh hamburger, thick and juicy, with crispy fries that taste like potato, not flavored oil. Very good food, the place is naturally retro, and it all works. I would bet most everything else is pretty good too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SrEdD96uNg_7p2y6w0sYQ"
  },
  "YBkY4dw5ZZrjJy8UAiDFDg": {
    "date": "9/28/2017",
    "text": "Delicious and cheap, the zack special is a much bigger and more delicious version of the Big Mac.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NHd3tqro4G2p_7TNhkqa1A"
  },
  "19bwtydMnGGj90pyPSR4dQ": {
    "date": "12/7/2016",
    "text": "I am a frugal, frugal Puerto Rican. The joint was clean and bright, prices were fair sans drinks. Food cooked to perfection and fries crispy, all presented on a Styrofoam plate (tsk tsk). No soggy lettuce or soft pickles. I'm not going to comment on aesthetic or uniforms, that's ridiculous. Was it worth my money? Yes, absolutely.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5YJAnBwZ444a5vgeNSZqug"
  },
  "egj15ISByw4Jg8ZKRx3Znw": {
    "date": "10/19/2016",
    "text": "$15 for two meals with drinks, delicious!! Friendly staff, good food, very old school at atmosphere. The place was poppin and the line kept growing as we dined in. Will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09kRMqBHsQfzoc2yVSDiZw"
  },
  "ceEe348KuXobXrWSSAMjZQ": {
    "date": "6/22/2012",
    "text": "4.5 stars is probably the sweet spot, but fuggit, let's give them 5.  Drove by this spot quite a few times getting around in Charlotte, but decided to stop by after a round of golf with some buddies.  This place is awesome.  Lemme break it down old school for you.  Ambiance:  Gotta love the Elvis music playing, old posters on the walls and the general retro-style to it.  However, it's not retro-style, per se, like Johnny Rockets.  This place actually is retro bc it's been in business forever.  Came in around closing time so the owner was pretty cool.  We chatted it up about this and that, places here and there, everything and nothing.    Food:  Solid burgers, fries and onion rings.  He made a bold claim that they are the east coast In'n'Out... I can't give him quite that, but it's almost there.  The produce was fresh, the patties were cooked to perfection.  And ICE AFICIONADO ALERT* They have the crushed iced with drinks... That ice is literally the best ice ever.  Price:  Dunno, didn't have to pay--I won the golf bet ;)  Will definitely keep this place in mind after a round of golf or when I'm jonesing for a burger.    dmo out.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "oJBUXpkWLEQMwRWi4XQnxA"
  },
  "rGGx7XT_u8XH2c4VaXoxpA": {
    "date": "4/27/2014",
    "text": "This place has been a staple in Charlotte since the 70s. Tucked away behind the gas station on the corner of Scaleybark and Woodlawn, they serve some of the best simple burgers, hot dogs and shakes in the city. As I have seen more and more gourmet burger places open, it is often good just to be able to get a simple grilled burger with the fixin's. Zack's is family owned and operated and serves good food and good value. My personal favorite is the Zack's Special which comes time a double patty burger with Zack's special sauce and fries. I usually add a milkshake and find myself still under $10. My friend is big fan of their hot dog special and last time there I ran into a guy who has neeer felt a reason to veer away from the Rib Eye Steak Sandwich. You can also find fried fish, onion rings, chicken tenders and a host of other things would expect to find at this classic burger joint. Next time you are craving a burger and don't feel like paying $12 or swinging by McDonalds, give this place shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ntq_6n5SpkZGmNHXnEmlNQ"
  },
  "Xz3hy4cJt2yVoN9TIgRsNg": {
    "date": "7/13/2014",
    "text": "My favorite burger joint in Charlotte. Made to order burgers, freshly made onion rings, great french fries and ice cream shakes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMK5jQSMZBG7-WpHjHodlg"
  },
  "zGgzk4V3zwo8hMmKzeRF3g": {
    "date": "6/27/2017",
    "text": "Amazing burgers and the onion rings are an overwhelming must. Fries are good too but the onion rings take it. Cole slaw is a little too vinegary for my taste but okay. Desserts were nothing special - go for the handmade shakes instead. Will definitely come back but have to check the limited hours first before making the trip. Still though. - great ol' traditional burger dive! Employees were friendly and they know how to crank out the food and get you through the line quick.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pijkzTwccWclTo_TR4ZbdA"
  },
  "dzgpjbKn5n-7S9etuWBSCg": {
    "date": "1/9/2014",
    "text": "I had high high hopes after reading all the reviews for this place.  I have to say it was worth it.  For around $5 you can get a double cheeseburger with tomato, onion, pickle, mayo, lettuce and fries.  Delicious.   I went for lunch and read a previous tip to get there early and that was definitely True.  By 11:45 there was a line at the counter and shortage of booths.  Go early and check out this Charlotte institution.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "ghxyc16RfFwRl9Rt-RkuAg": {
    "date": "1/9/2014",
    "text": "It's not a fancy joint but it's a 5 star establishment in its respective class of restaurants. The actual setting is cool and it's neat how old the place is. It feels like you're in the 1950s. The pictures inside are fun to look at and it's clear that Zacks has been a dedicated member of the Charlotte community. The prices are unbeatable! The milkshakes rock! The burgers and fries are the same price as McDonalds but taste WAY better!! Go to Zacks for a cheap unhealthy satisfying meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "K7oL3rPHM3sHVRjK4BQiDw": {
    "date": "6/4/2015",
    "text": "My favorite dirty boy cheeseburger in all of Charlotte. The Zack's Special is a must for only $5.25. They also have fantastic corn dogs, milkshakes, onion rings and the drinks have the good ice as well. Has been there since 1975 with a unique red and white awning. This place is a Charlotte staple, the only con is that they are only open Monday-Friday but are open for both lunch and dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qOrsyA2GNsriUgqEaX2-SQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. Zack&amp;#39;s Special add corndog",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qOrsyA2GNsriUgqEaX2-SQ/o.jpg"
      }
    ],
    "user_id": "lSjdYb2wussdNmj5XvN45Q"
  },
  "IyhgIZaDmNBix6BBeaQp1Q": {
    "date": "12/17/2014",
    "text": "Fantastic little diner! Amazing retro, original, atmosphere, great food, and kind staff! All the food is great, big menu but not too many options, just right! My first time here and I'll definitely be coming back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9KkAbCKgXY2yuq_LksU2sQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9KkAbCKgXY2yuq_LksU2sQ/o.jpg"
      }
    ],
    "user_id": "ROdoQ_PHd6TqmqOXLrShyg"
  },
  "3XA7UOSO6LITtnMOU0EZTw": {
    "date": "8/27/2013",
    "text": "There's nothing flashy, trendy, or even remarkable about Zack's. They don't throw any fancy slogans out or use some sort of dated jargon to describe their outfit. It's just burgers, fries, rings, shakes, and the best crushed ice in all of the Earth's history.   The Zack's Special -- Double cheeseburger, lettuce, tomato, mayo, pickles, mustard, easy like a Sunday morning bun. It's like the king of all lunchroom burgers. Nothing that's going to blow you away, but familiar like an old friend. Just right.   Fries are nothing to shake a stick at.   Onion rings, however? Sheer greatness.   Also, for the price of $10 for two, you can't really be upset. I'm glad that Zack's is around and has been doing the same thing for so long. Don't change a thing, fellas.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "_dhJgvXsxUy9N27KVWdb7A": {
    "date": "12/6/2011",
    "text": "Cool Old Place!  Reminds me of a time that if I was part of I do not remember!  The celeb photos on the glass, pretty cool.  Dirty outdoor (outside like an old Gas Station) Mens room does not bother me though it could have, though no baring on the rating for my review.  Great Service!  The place was busy and the lady answered my questions very well!  I'm not rating the less than one yelp star Onion Rings because they were less than one yelp star and they also are not going to bring my review any lower!  Here it is:  The water I drank was perfect and the Hamburger was prepared exactly as I ordered it!  The Hamburger gets 3 yelp stars because it was good for the price, it was made right and it had good (not great ) flavor.  I ate the whole burger and I was hungry (breakfast at 4:00am and this lunch at 2:00 pm).   In this case three yelp stars means I won't be back, only because I like other options better!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QrgctdaJwmAvOYEPs5oAqQ",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States. If you think these look good you might like them!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QrgctdaJwmAvOYEPs5oAqQ/o.jpg"
      },
      {
        "img_id": "k2_j98ruhIzqH4nXfk70mw",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k2_j98ruhIzqH4nXfk70mw/o.jpg"
      },
      {
        "img_id": "dGU7lm2FrVEvNdDUIybsFA",
        "caption": "Photo of Zack's Hamburgers - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dGU7lm2FrVEvNdDUIybsFA/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "djl0LIbD6A3_Rlb5R428xg": {
    "date": "10/29/2015",
    "text": "Came here for the first time yesterday for lunch and had the Zack's special with fries and a medium drink, came to 7.55$ after tax . Burger was juicy , fries were hot and everything was delish . Will definitely  come back again and try some of the other menu items .  The place has been open for about 40 years , love to see local businesses  thriving in the area .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lgwZbztTZlKbuiD88cSPcA"
  },
  "QZiXXd0DP1xAFMr095XDGQ": {
    "date": "7/5/2016",
    "text": "Zacks is LITERALLY on my street. I can honestly say I do not eat here enough. I love the old vibe of this place. The food is always good. Hot and fresh, cooked to order. Chili cheese fries  you can't go wrong here. It definitely reminds me of an old soda shoppe. I'm absolutely obsessed with the BBQ sandwich. Great place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DB5RvI0mCwqJ41NK_3R7Ng"
  },
  "k6WbX1akoA8pudHaxsyBdQ": {
    "date": "4/10/2017",
    "text": "Good prices, and all the employees seemed to be busting their butts. I didn't particularly care for the food, by maybe I'm just not a huge diner food person - I tried the Zack's special (double cheeseburger with fries). I love burgers, but thick enough that you can get them less than well done... just a preference thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RkPjL8RC4ryFUn6NwhwOlw"
  },
  "xcViYDt5_rhMz5lWNVc6Pw": {
    "date": "10/8/2014",
    "text": "Best onion rings.... Very good burger can be better if it smells less meaty Great special sauce...fries needs to cook further lacks the crunch!  Would / will eat there again and I recommend it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b0Bd9SyjfJ3QT42fQIovXw"
  },
  "7Rl-lOCUDw72qu-aOkD2TA": {
    "date": "5/3/2016",
    "text": "Great throwback burger joint. The Zack's Special is the way to go for quality and price. Burger ranks right up there with the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aejM9aoISAanmLgnbok0rQ"
  },
  "6vtk43yOorN7PByXuxb2IQ": {
    "date": "3/28/2017",
    "text": "Get the Zack's Special!  I had this burger over a year ago and finally had the chance to be back in Charlotte. This was one of my bucket list items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-sHwJV9FTdZ2IdfSqDS2DA"
  }
}