{
  "nZXOPd09F7Dly8495OU0sA": {
    "date": "9/24/2015",
    "text": "We dine here often because it is good, fast and cheap. ?..and very nearby. It isn't the best Mexican food in the area, but close. Friendly staff, high health rating consistently (which is really important).  I like that they give fresh limes with the salsa and chips.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1PBlkVM9klC3YGpha9Xp4Q"
  },
  "4BNEoySZGPCfC68UGv25ug": {
    "date": "5/22/2015",
    "text": "best MX food in Charlotte area.  Offer both Tex-Mex and authentic cuisine.  REAL TACOS and they are amazing.  Loaded with meat for great price.    I always order carnitas, chorizo, and pastor tacos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2WRZvmq62vOeS4SA8TOreQ"
  },
  "thdyDw2nBsKsITY4d41aTA": {
    "date": "5/13/2012",
    "text": "Having lived in Charlotte over 10 years, I can't believe I hadn't heard of this place till 2012!  Authentic, hole in the wall type Mexican restaurant that gets very, very busy every day. Excellent and very friendly waiting staff. Seeing that we're Indians and that we probably like hot food, the owner brought out a green colored salsa (Guac based) in addition to the 2 red salsas given out with the chips. We LOVE the green salsa - really spicy and flavorful... haven't you sometimes felt like eating on even when your mouth is burning hot? Its like that!  Over the last few times that we've gone there, we've ordered a number of dishes - california burrito, la unica burrito, carne asada tacos, arros con pollo, camarones al chipotle, pechuga de pollo ala mexicana, chimmichanga dinner, etc... you get the picture. All were great; better than we've had anywhere in Charlotte or elsewhere. Not one case where we even felt like the dish or experience could've been better.  A recommendation - the place tends to get very packed and depending on what time and day you decide to go, you may have to wait to be seated. You can also phone in your order and pick it up once ready.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 8,
      "cool": 5
    },
    "photos": [],
    "user_id": "wvma7t8p3sXk_0fKxyam8w"
  },
  "ImYn2TXGw_FSQoklgAQlmw": {
    "date": "6/4/2015",
    "text": "Super fast service, the best Mexican food that I've ever had and I eat it a lot!  Had it for lunch one day then brought my wife back for diner the same day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SLWfxclDPieIYH5k9zNyRg"
  },
  "jBXbRH-lAr3nDyE8Jo88aQ": {
    "date": "8/6/2014",
    "text": "Truly the best Mexican food you will find. The food is so fresh, I usually get the taco salad and the chicken is the freshest I have ever tasted. The service is quick and everyone is very friendly. Before you even have your drink there are fresh tortilla chips on your table with 2 delicious salsas. It's a must try when in Indian Trail.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SE5cVf5DM0b7Yt91mq16zA"
  },
  "2Tn7ya9oQw0reoej5DEMEQ": {
    "date": "10/29/2016",
    "text": "This is a very clean restaurant with great food and great service. The lunch menu is a great value for the price. Although everyone enjoyed their individual orders, I was particularly impressed with my taco. It was freshly fried and super crisp. The beef inside was quite flavorful. Highly recommended this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bufxj0nbveUPoMyqA3bx-g"
  },
  "dnsqzysJPdOTaHNA5o0yaA": {
    "date": "4/10/2010",
    "text": "If you really like Mexican food, there's no better place in Charlotte than La Unica.  Driven by it for years, never paid any attention until a coworker took me to lunch.  OMG is it good.  The food is hot and fresh, staff is friendly.  Free chips with two types of salsa just for showings up...gotta love that!  It's busy because it's GOOOOOOD.  Seriously skip the chains and step up to the real deal.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "bdlFwefJOfC8xBiezIF4AQ"
  },
  "DMDq_-0PCZotTWZK2rAbcg": {
    "date": "3/15/2015",
    "text": "There are Mexican Restaurants and then there's La Unica. Hands down best Mexican Restaurant in NC and VA ( and we have tried MANY Mexican restaurants between here and VA).  They cater to food allergies better than most. It is almost always packed but wait times are short. Can't say enough good things about La Unica!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yXhqH1eBLGL4AEFgdNSgkg"
  },
  "kk7_kVXVggM9jCBP4LGh-A": {
    "date": "9/30/2014",
    "text": "Best Mexican in Charlotte! The chile rellenos are to die for- very cheesy with large peppers fried with egg. Also the enchiladas verdes and street tacos with cilantro and onion are very delicious. The refried beans have actual BEANS in them...you can tell everything is house made. They are usually extremely busy so take out is what we Usually do but busy is good when you're a restaurant! Looks like a hole in the wall but it's definitely worth it if you live anywhere near!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "glpoZhlhy5mureBHXnDpJw"
  },
  "-F5Q0SwcZbLqq6QS4K86ZQ": {
    "date": "6/9/2015",
    "text": "The best mexican food we've ever tasted!!  Everything is amazing.  So much flavor and fresh",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WbbJ95jDYfLSoUYI5F53zQ"
  },
  "PO175G0ZMjZ43rlSYDu13w": {
    "date": "12/2/2012",
    "text": "LOVE LOVE LOVE this place!  Best Pork Carnitias in town!   Beware it gets CRAZY busy for dinner especially on the weekends and there is no beer or alcohol served. So if you can't eat your Mexican without a Cervesa like my husband can't seem to do, then Take Out is more for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxnCLljqXZlKCOpsCreqxQ"
  },
  "Gv1KXNA0vFnLV92EYGmZdQ": {
    "date": "9/5/2014",
    "text": "My gf and I go here quite regularly. We are always amazed at how fast the service is and how consistently amazing the food is. The staff is always very friendly and are very quick with the delicious chips and salsa. We HIGHLY recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOUXMjpuA-QGzPv4VQ9G6Q"
  },
  "Pv7c-EBVLbvY3hhh9FGFUw": {
    "date": "6/2/2014",
    "text": "My husband and I just moved from LA, and we had to get our mexican food fix. We loved it! The burritos are so good. Fresh tortilla chips and salsa. The horchata is really good. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjwGfxSM5Jvt9_4_SKaCfA"
  },
  "DFjLEX_N76Z-7NvMiSsHMw": {
    "date": "6/25/2016",
    "text": "So excited to eat here again! Came 2,200 miles for vacation and I found time to stop in. My favorite are the Lengua (beef tongue) Tacos. Yum! So tender - they do them right!!! Staff are always friendly and helpful with special requests. Terrific.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QnxPNz9GOHWr3jomMdCVpA"
  },
  "1Wv55kQvfrU1ohsNGH4zkw": {
    "date": "6/24/2016",
    "text": "Best in the Charlotte area!  Everything I have had at La Unica is fabulous. The tacos are amazing!  Order Asada tacos, throw a little lime on there and enjoy. They pack a lot of meat in them too!  The staff are super friendly. We have tried a lot of other Mexican restaurants, but this is by far the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "grsFbM_EuNiUw6X6_mc5yg"
  },
  "9enTehBztjuLpdVErRyLzA": {
    "date": "1/20/2015",
    "text": "Recommend: the Chimichangas, churros with chocolate or strawberry, the pollo fondidio, and the Mexican burrito, and get a Jarito. :) Used to be the best place to go for Mexican food, but not so much anymore. We have been going for about a year, give or take a few months.  After the renovations, they look prettier and have more room, but seem to now be lacking in the service and quality. The menu has changed some since we first started going, which is great, I love some mix up and most of the new stuff we have tried isn't bad, but it's not great either.  Food is okay, nothing compared to when we first started going though. It never comes out hot anymore. Our chips are completely gone by the time the food comes and the beans always have a film from where they have been sitting for a while waiting to come to the table.  The servers are normally nice, but you will see them first thing when you sit down for your drink order, when they bring your drinks back they will want to take your food order, and if your not ready they will come back about 2 minutes later and you probably won't see them stop at your table again until they bring you the bill. It's very hard to get refills on drinks unless you flag them down-which can be hard to do! We will probably keep going to La Unica when we don't feel like cooking, but it defiantly won't be the 1/week we used to go.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW8WuLpZPk9btE3TgkQw2Q"
  },
  "pc_YGZa0Z29vR_6-jVd0bw": {
    "date": "4/8/2015",
    "text": "Love Love Love this restaurant! Great food. Try the authentic chicken tacos. The BEST in the city. Period.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7RBCnhQ5AHh6zBPUiZRIBw"
  },
  "1uHvXFvb3U2x2HhycMnBLQ": {
    "date": "5/21/2014",
    "text": "This place is great and always packed to the gills during busy times. I've placed To Go orders while filled to the rafters and still receive my order in about 15 minutes. Always enjoy everything I try on the menu and the horchata is amazing, try it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qIH4BVxSaAz0o2zqfYM_tg"
  },
  "QqyD1V9XJhFwj_OAkYRT4w": {
    "date": "4/3/2015",
    "text": "My family and I tend to be very picky about their tastes, but this place hits the spot for everyone. Do you have bland tastes? Pollo Fundido Dinner is perfect. It's not overly spicy, and just has chicken, sour cream, and cheese! Like seafood, they have that too! This place is super delicious and the staff are super awesome. If you're hungry, here is a perfect place to go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B8ls7so9R7-oawmnUv_-ig"
  },
  "XzSao8BWCFD7v9T8DQtw0A": {
    "date": "8/6/2015",
    "text": "BEWARE !!!!!!!!!!! The  food was great until I checked my account and  3  charges from a 3 different law firms in 3 different states, appeared on my account. Not worth the headache.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMY-atex_9nzODY_zDDpSg"
  },
  "IhmqngC90h80hSP55cz49w": {
    "date": "6/6/2016",
    "text": "I took the family there for lunch after church this past Sunday.  The place was pretty busy and evidently as popular as the reviews here suggest.   The service was great, prices were reasonable, and the food was fresh and delicious -- their hard taco shells are awesome! Their tea is fresh brewed and delicious!  I am not sure about it being the very best Mexican I have ever had, but I have to admit it was above average. I will definitely go there again with the family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4T6wdTqq0B8UGerDkroDfQ"
  },
  "Amj-aLQu4JRpiBpdBYTDDg": {
    "date": "2/3/2017",
    "text": "Really really good Mexican food and this is coming from a Mexican Arizonan! Carnitas were some of the best I've ever had! No cervezas or margaritas served here is my one caveat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D2BKModNHhseqv2NDf8BMg"
  },
  "tFrytU-ZDm8BFOt8YFJ7WA": {
    "date": "2/8/2018",
    "text": "This place is CRAZY busy most of the time. Good food, great service, and very fast turnaround make this an Indian Trail favorite. My only complaint about the restaurant would be that while the food is always good, there is nothing original about anything on the menu. Otherwise, very family friendly, polite staff, and always consistent preparation make this a solid choice for a reasonably-priced meal for small and large parties alike.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O2HPOEW6tsC2fl2hWbBeaA"
  },
  "NmgEJuuBhzFkfnd5e5FQhQ": {
    "date": "12/5/2017",
    "text": "Holy cow this was good. The chips are fresh and just thick enough. The service is fast and proficient. Really good food and portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cH_GuY8-1L7UbFD6E6l-5A"
  },
  "NmGCAF149Wl0DqCgnXxZIw": {
    "date": "6/15/2014",
    "text": "Very average dishes. Bland rice. No refried beans with the steak dinner, however the bowl of beans was very well spiced and good. The steak itself was decent. My sister said her enchiladas verdes were very good. I had a combination plate of a tostada, taco, and enchilada. It was all okay.  Relocated here from Chicago and we are still on the search for a real good taqueria that serves up some carne asada that is tender, well seasoned, and juicy. The food here is passable but it's not great enough for us to want to return. However, it is probably better than others in the area so give it a try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eBoyunRiJb-QzwQbv1-1bw"
  },
  "JfL986Lvev5e-sElz9bwgQ": {
    "date": "3/4/2017",
    "text": "This is certainly the top authentic Mexican resturaunt in my area. The enchiladas were stuffed full of deliciousness, great beans and an even better cheese dip! The staff here always gets the food out quick and it is always tasty. The owner has done a great job at holding this restaurant to the highest standard through the years, no wonder they had to expand for more dining space!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewy8y5rvYHulA_BoOuHx1g"
  },
  "fzv0Z2Tsls-k7XcQrnz3lA": {
    "date": "11/8/2015",
    "text": "Often crowded, and for good reason - fresh ingredients and hearty portions at great prices. The servers are all friendly, helpful, and easy to get along with.  Their menu isn't as expansive as other Mexican restaurants, but their quality beats quantity. Fajitas come out sizzling, the meat is tender and juicy, and vegetables are cooked to just the right level of crispiness. Great place to relax and hang out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtZH7zRJrM2LNjVI0FzuNA"
  },
  "k7k5Y6bYLU3iOZF9o7V7NA": {
    "date": "7/8/2013",
    "text": "Hallelujah! This Southern California girl has found authentic Mexican food in Charlotte! After visiting many a restaurant that says Mexican but only to find Tex-Mex, La Unica was a welcome find!   My benchmark for Mexican food is always carnitas and La Unica's carnitas are excellent - tender chunks of pork with crispy edges - it's so good.  Their rice and beans are excellent too.  Their salsas are fantastic.  For spicy food lovers, be sure to ask for the salsa verde!  It is hike to get out there but the food is definitely worth it.  The service is nice and friendly and FAST!  I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dlm8UICXAyMvtAbT9A2Byw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Beef quesadilla.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dlm8UICXAyMvtAbT9A2Byw/o.jpg"
      },
      {
        "img_id": "VHmevQYZRNXu0WK2s-CQBg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Combo #7 with chicken enchilada and chile relleno.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VHmevQYZRNXu0WK2s-CQBg/o.jpg"
      },
      {
        "img_id": "WxWXHLQMwifY28pTJ-hlkg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Carnitas lunch plate.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WxWXHLQMwifY28pTJ-hlkg/o.jpg"
      }
    ],
    "user_id": "hc71knjnXMI9wG_Oo9hpoA"
  },
  "bj8cvPJJSUDQeeFKeclUcg": {
    "date": "6/25/2015",
    "text": "They have dollar taco nights on Tuesdays and we love it!!! You can't beat $1 tacos! I usually order 4-5 tacos for myself and husband usually gets 8-9 for himself. Yes we are fatties =)   The tacos are pretty good and the margaritas are pretty good too ( although they are not really strong)   The servers are friendly and nice and the place is pretty clean!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "N-Fk2xynnzYxOK1EhJ4-Sg"
  },
  "yt6fgLliJhfpRWwxY80dnw": {
    "date": "1/3/2018",
    "text": "Really good food ! Fresh and tasty . We order to go once a month and a real treat for our little family. Our fam favorites are the tacos la unica and my son loves the kids meals . I am a reviewer who feels that good food and service deserve to be acknowledged. I also believe that food and taste is a personal preference so I frown upon reviewers who blast restaurants for their own biases and bad moods or negativity. If I don't find a restaurants cuisine good it's usually do to my individual tastes and don't write negative or biased reviews !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TeuhuRYHmfeQUu2xeG_lOw"
  },
  "qyrgO5YA67Zk0mWLsx_i1Q": {
    "date": "1/1/2017",
    "text": "Yummy! But two important things to note: no alcohol, and they do not accept american express.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oi3nM8O79VNOhX75nVci1g"
  },
  "NV4Ya7kWKOASoxW43AFVSQ": {
    "date": "12/23/2017",
    "text": "Our favorite Indian Trail Mexican restaurant. It is so good, so fast, so authentic. We love all the servers. You cannot beat the price. The carnitas are to die for.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KbipUFUrH3MK1WUVrWbZ4w"
  },
  "AimDo60VUk_Dsmwo9ZFu-Q": {
    "date": "4/17/2015",
    "text": "Love this place for breakfast and dinner. The lunch specials I've tried so far are only ok. Do not order guacamole on its own for chips. It's a smashed up avocado on a plate with salt. Not yum, but if you get a meal that comes with guacamole, it's good. Good carnitas. Not crazy about the carne asada.   Crazy about the salsa. This is another Mexican restaurant where I'd dive mouth first into a vat of it... Anyway, go here for breakfast or brunch if you haven't already!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "8n2T5-ksUl9MeIPxobzkkw"
  },
  "9EU1QN4HodK6BF_JGdRqZg": {
    "date": "5/18/2017",
    "text": "Hands down one of the best Mexican places I've been to and I'm so glad they are growing. I visited them for the first time about 2 years ago and they were a lot smaller, now their restaurant got bigger, better food (it has always been great) consistent authentic flavor each time I go, the servers are very friendly and the owner greets you like he's been an old friend. Great atmosphere ! Too bad it's a bit far from me or else I'd be there more often",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SZGO8IrfJ_Ozu5jI4Kw_w"
  },
  "dReXcTc3uYDIHWk0y-bzDA": {
    "date": "11/27/2016",
    "text": "Very fast, very friendly, very tasty. Loads of flavor, from the fresh salsa to the chimichangas and flautas. The chicken was moist, not overcooked. Made with quality queso. Guac, beans and rice were just okay, but the main courses more than made up for that. We'll definitely be back next time we're looking for Mexican on the SE side of Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emAGkhWXl-inbYaRZZQ9Mg"
  },
  "mNHNK-Of7YW3-sQEMr6CKw": {
    "date": "2/19/2015",
    "text": "Seems to be a very good rendition of very traditional Mexican fare (if you are looking for some sort of modern mexi-texa-cali fusion place, this is not it). As we were seated we were started with two salsas, mild & hot along with very fresh chips.  Our waitress was very attentive despite working numerous tables.  Our Fajitas were served \"fresh\" and the Tortillas were clearly just made.  Sharing one dish came out to a perfect proportion with a small lunch size leftover to take home along with Salsa.  Awesome find, we will definitely be back.  On a sad note, they do not serve alcohol.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPtcm-krVuWIyY4UIJqDFg"
  },
  "gURx8u5Dvr8opbgtHUltRw": {
    "date": "12/19/2016",
    "text": "Excellent food. Very polite and fast service. Only drawback is they do not serve alcohol, would have loved a margarita. Very generic decor, not decorated in a Mexican or Spanish theme. Although the salsa and queso is amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c1G00KYS_FY5vvwWTNThZg"
  },
  "8Bvv6lgjOSpYtUbj6oie7Q": {
    "date": "3/6/2015",
    "text": "This place is our go-to. The service is always incredible, the food has always been amazing- every visit solidifies that La Unica is the real deal here in Charlotte.   Highlights: cheesesteak burrito, tamarindo drink, chips & salsa, queso.   LOVE. THIS. PLACE.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "L-mzJFxlOrFdyiduzxJ30g"
  },
  "b1qLDaU-0vBKf4VDjPUF5Q": {
    "date": "2/6/2017",
    "text": "Went for Sunday lunch yesterday and had the best salad with chicken and ordered a side of tacos (super fresh and delicious) rest of the family had burritos and other Mexican dishes, cannot complain about anything, the orchata was on point and also tasted fresh. I would hands down recommend this place for authentic Mexican any day.  !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Msye8xpoKdb_nxpobq4zA"
  },
  "QgZm7gP6SIH8Io2DHN2e7A": {
    "date": "7/31/2016",
    "text": "Consistent quality at great prices and fast service. This place is managed well. My favorite is the Carne con Nopales. Though I wish they could get a little better crust on the carne sometimes.  Very important to us is the sanitation rating. It is consistently above 95 which is our minimum. Many competitor places do not achieve this regularly so we come here instead.  I really like that they serve limes with the salsa.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xCiLLZFX_X1cJox8YrON8A"
  },
  "0-Ut-r8Q9JVBQ126EQXaiQ": {
    "date": "5/24/2010",
    "text": "We stopped in for lunch this past weekend.  It had been a while.  Nothing has changed.  It's just good food, at a good price, executed well, and served attentively.  What else do you want when dining out in Indian Trail?!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAxwG5UGRi0fIIIWJq7eEg"
  },
  "3q1sXoDzexGxtLnKR4iW8Q": {
    "date": "9/9/2011",
    "text": "Authentic Mexican food. They make their lemonade the hispanic way with limes. Soooo good. Crowded during peak hours of lunch and dinner. No alcohol, but the food is the best. Looking for good Mexican food this is your spot. Nothing on the menu will go wrong. It is a place to try good quality mexican food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lkYC6tFTNLSS3FMgNRLT9w"
  },
  "wburArLffmoqjnbeM2pVBg": {
    "date": "7/27/2011",
    "text": "Pretty decent Mexican food with a very local feel. No booze which is a negative since I need me my margarita!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vD3S6Klov8x1Ru60zjlHKg"
  },
  "Lg9bAmdd6mCJ8sLuxh03Lg": {
    "date": "6/30/2013",
    "text": "Great Mexican food at great prices.  The tacos with pork, beef or fish are awesome and cheap!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y25oHV0O62UHaqaI8AAKmA"
  },
  "0WITfRHRwbJsgY_R6aR20Q": {
    "date": "10/30/2010",
    "text": "This place is simply good food at a great price.  I love their authentic chicken tacos and the salsa is wonderful, but some of their other dishes are just OK.  The atmostphere is nothing special and they don't serve alcohol, so don't expect a whole lot more than a good meal and some awesome chips and salsa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VANdk7o_4uby6Go8ezVyNg"
  },
  "q6ZlVhCk5vjkPI7-Z9WDIw": {
    "date": "9/21/2012",
    "text": "In my opinion this place is very over priced.  They are the only Mexican restaurant in the area and they know it.  The people are very nice and the service is decent. I guess if your out in the country and your hungry for some Mexican this place will do.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Jn75olJORFrfL_DLDiMHg"
  },
  "yragtn5Z4stSb41YICZNzg": {
    "date": "8/23/2014",
    "text": "We've generally gone to La Unica in Indian Trail at least once per week since they opened.  We've always been happy with the food and service.  But last night's experience was enough that we may not go back.  Since they remodeled, their service has been worse.  I've thought perhaps it was because the restaurant is so much larger now.  But we're always having to ask for more chips and salsa whereas we used to never have to ask.  And I know they've always wanted the entire party to be there before they seat you.  But last night my wife and I arrived but my wife was in the parking lot right outside of the door to the restaurant talking to her parents that were leaving at the time.  I went in, said 2 for dinner and the hostess looked around me and said is the 2nd one here?  I said yes and pointed to her through the glass door talking to her parents and said she would be right in.  She said I'm sorry but I can't seat you until she's in the building.  I couldn't believe it.  I said \"But she's right there\" and the lady said she still couldn't seat us.  So I opened the door and told my wife she would have to come in before we could be seated.  As I say, we've been there many times and generally love the wait staff, particularly Victor.  But we may not go back after being treated so rudely.  And the hostess knows us because we are there so much.  I think the rule is ridiculous when one of the party is literally within feet of their door!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4PygvO5Ndl7a2zHT48Z6gA"
  },
  "GaAlSaZewPTbFxRi9jOhhQ": {
    "date": "5/15/2012",
    "text": "Simply put this place is awesome!  If it is a Friday or Saturday you better get there early as there is always a line, but it does go by fast.  When anyone ask for a great mexican restaurant I always recommend La Unica.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "py3JIoE0NfFKAB0iINXzJg"
  },
  "mCmmsLwM-FXpeY_Ji75PBw": {
    "date": "3/21/2011",
    "text": "My wife and I have been going here for 2 years now.  The food is always EXCELLENT and the secret is out because they are always busy.  I love the carnitas tacos and the carne asada.  The salsas are fresh and have varying degrees of heat.  Service is always excellent.  I can't say I've ever had a bad meal here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s8MiJBFrUlFK5gnh8sei9g"
  },
  "MQb_1I-gP_2aj0MgY5GWHw": {
    "date": "7/7/2010",
    "text": "We have lived in south Charlotte for almost 20 years, and we finally found the best Mexican food in the area: La Unica. The food is beyond delicious, and the servers are friendly and efficient. This place is standing room only at lunch and dinner, but it's worth the wait. Ask for the green salsa with your chips. It's made with jalapenos & avocado and has a real kick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_P2fP3NyEczrH5Y5nEbnNw"
  },
  "K-17hS4X1_rtyx2W5r_TCQ": {
    "date": "4/26/2010",
    "text": "I am a fan. Coming from California, most of the mexican food in NC has been disappointing at best. La Unica, however, is authentic and good. Free endless chips and salsa with a variety of fresh made salsa's and cheeze dips is a great start. Every dish I have had there has been excellent from the Barbacoa burrito's to the Chilequilles to the enchiladas. They don't serve liquor though so get a beer; no margaritas. It helps also that I speak some spanish.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKaR_ebWJt7vdkJydpTuQQ"
  },
  "eFOmjv-k_SyeNX_9fOufkQ": {
    "date": "11/19/2015",
    "text": "This is honestly my favorite Mexican restaurant. Staff is always nice and friendly!! I love their chicken fajitas. They give you so much food. My fiance has tried many things without any complaints. My favorite part is the spicy salsa! It's chunky and so flavorful. It has a massive kick to it!! Sometimes I buy some to go. The restaurant is clean. Love this place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i6psO9Nb9ub2uxlpOB_Msg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Super fajita quesadilla",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i6psO9Nb9ub2uxlpOB_Msg/o.jpg"
      },
      {
        "img_id": "9vELryv0Y2ES9L1IXMaBxg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9vELryv0Y2ES9L1IXMaBxg/o.jpg"
      },
      {
        "img_id": "jX-yi34v6Eaj0HUXSAwisw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Chicken and steak fajitas!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jX-yi34v6Eaj0HUXSAwisw/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "OT0Xa2oskm1d3OqSo4bSAQ": {
    "date": "2/18/2017",
    "text": "This is the best Mexican on the East Coast! The salsa was spicy, fresh, and authentic. The rice and beans were flavorful. Our entrees were mouth-watering and delicious. The service was friendly and prompt. The prices are very low for the high quality of food you get - an excellent value!  My wife and I lived in Arizona for 18 years and San Diego for 3 years and believe me when I tell you we've been to a lot of Mexican places throughout the years. I can confidently say this is one of the best and most authentic Mexican restaurants we've ever been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oG0E9PW-z6x4AoF3vhL3cQ"
  },
  "BOTWlxYf90a0lzKkxnkHsg": {
    "date": "1/11/2019",
    "text": "My family has been eating here since we moved to the area 11 years ago. We will never eat at La Unica again. We got there tonight at 6pm and told them a party of 5. They put us on the list. Then after us a group of 6 high school aged boys told the greeter that they had forgotten to put themselves on the list and where put ahead of us ( I didn't know this at the time). We waited and waited while everyone else was seated ahead of us. Even one of the other customers went up and told the guy that my family had been waiting longer than anyone, he didn't care. At no point ( and there were several opportunities to do so) did they ever offer or think to slide an empty 2 person table with a 4 person table and seat us. We waited 45 minutes and then just left, their food is ok but it is not worth that kind of wait. At one point during our wait the greeter had tried to sit the 5 of us at a 4 person booth and when my wife declined, I don't think he liked it. I believe this contributed to the attitude of the staff. They have become so busy, that they simply don't have to worry about upsetting a few customers I guess. We will not be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vB6S81VgBVliqprBW3Emvg"
  },
  "A3ZOa3Z-kwDGUDGTr8nfbQ": {
    "date": "5/31/2018",
    "text": "Salsa and chips great one is spicy and another one that is very hot! Chicken fajitas were tasteless with onion only, no red or green peppers and condiments was shredded iceberg lettuce, a teaspoon of chopped tomato and sour cream. No shredded cheese! Corn tortillas were stale! Not going to rush back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pe_owbyOonGwK2pzxCRUFw"
  },
  "jvAeODwQRXm4LAztniMKRA": {
    "date": "12/21/2017",
    "text": "Most authentic Mexican food in town. It's my favorite Mexican place to eat with the family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-yo4ECvjN1YjNQF4AclFg"
  },
  "YqX0h0EyAYNdhALElCp1tw": {
    "date": "12/17/2017",
    "text": "Real authentic food. Tacos are amazing. Very affordable. Absolutely the best Mexican food in Monroe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOrWHpG_WHstNu90HCbmxQ"
  },
  "CRWqYRosyOKRAVsbRhnWbQ": {
    "date": "10/25/2015",
    "text": "Chicken Soup for the Soul!  The best chicken tortilla soup in NC-comes with 2 cheese quesadillas for the low low price of $6.95.   Tons of high quality food for average to low prices. My sons likes the burritos, my husband the soft tacos.   Serves a big basket of chips and two different types of salsa. You can ask for third kind-green which is very hot but is good. Not included gratis but, delicious is that big dipping bowl of queso.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "vvIXbPRbGv5ARIrD9I0V9Q": {
    "date": "4/1/2017",
    "text": "This place is delicious! Our most favorite Mexican restaurant is this one. Our favorite drink is the cinnamon rice drink and the fried ice cream is marvelous. These two items are a must if you ever go. The place also has a 100 sanitation score which is the best you can get. The service is also good. Win win.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D2pM8cwclrtrHnCfGO6DLA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D2pM8cwclrtrHnCfGO6DLA/o.jpg"
      }
    ],
    "user_id": "X_xp1O5H9yvNIKXnvOsSFQ"
  },
  "y7Hm_iRwGnBpmktu_DvRuQ": {
    "date": "7/1/2016",
    "text": "We  La Unica! We are always seated quickly, even if during peak times. And being greeted warmly by Victor is always a plus. Hubby and I always stick to our old-time favorites, burrito mexicano. It always amazes me how quickly your food arrives and piping hot. When really hungry, we add an extra burrito and we leave stuffed. Our older son had a crazy burrito which used to be my \"usual\". The little guy ordered off the kids' menu...a chicken burrito, perfect for a smaller appetite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CtIBG55GolSXI3qjcQFExg"
  },
  "GZBxDq_x1d98PvEGvD8T7A": {
    "date": "6/13/2017",
    "text": "Most authentic Mexican food I have found in Charlotte. I even prefer it to La Unica superstore (the little taco shop inside) off of Independence. Authentic for me is SoCal Mexican food. Right near the Tijuana border.  My kids love that you can get horchata here so that's plus #1. Wish they had beer or margaritas but it's okay, the food is worth them not. Good prices. Very quick getting the food out. I love the beans, although they give you a very small amount when it comes as a side with rice. At least compared to what I'm used to seeing back home. My personal favorite was the authentic tacos, I'd normally refer to them as street tacos but whatevs. They are pretty damn authentic so the name fits. I don't love the fajitas that everyone here raved about. Meat, both chicken and steak, two different times was overdone. Enchiladas good. I still have lots to try on this menu, for now this is my go to Mexican restaurant in Charlotte.  Oh, and the chips and salsa were on point.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7e1J7OMCu3j7w1OXVhI5Gw"
  },
  "25G8aoJqoK2HP_dSyT5LZA": {
    "date": "7/22/2016",
    "text": "Quite delicious! I got Chicken soft tacos and Hubby got pollo con crema both were delish! Guacamole was fresh! Cheese dip was on point! We will definitely be going back! Customer service A++",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PyCWm6V3S0Sryn7_rls6-w"
  },
  "FlqUD1Gy8P09kJckWE8cDA": {
    "date": "10/25/2017",
    "text": "Most authentic Mexican you can have in this area. It is my favorite Mexican Restaurant. The staff is very friendly and the food is amazing. I have been here many times and will still keep coming here for whenever I feel like having Mexican. This is Truely a gem in this area. Make sure to try their delicious queso!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sOzHHLLt9v-Xtqm72gHUsw"
  },
  "-CDSMBcjay4lg4-_Xj_yMA": {
    "date": "9/8/2014",
    "text": "Bringing it down another notch.  I'm sorry folks.  I know people love this place but I do not get why.  I ordered the veggie fajitas yesterday and literally only sizzling onions came out.  I asked the waitress why there were only onions and she said because they only have peppers, onions, tomatoes and mushrooms in their veggie fajitas.  So, I asked why it said on the menu \"and other mixed veggies\" and she said she didn't know but she could add some more peppers to the fajitas if that would help. I asked for corn tortillas but got flour.  We asked for lemons for our water, they only do limes and forgot to bring them.  I asked if I can substitute other beans (ie black or charro) for the refried and she said no...The menu states no substitutions can be made to menu items.  Seriously?    Our waitress had a sourpuss look on the face the entire time as did others that approached our table.  We asked for more chips and salsa and they forgot to bring them.    Overall, a horrible experience.  I was willing to try them again because they seem to be the \"hit\" but they do not cut it for me. My original thought remains:  too big for your britches La Unica.  Get over yourself!!!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "PDKDa5PI7dAkPoDhgvUopw": {
    "date": "7/8/2016",
    "text": "Taqueria La Unica serves your standard Tex-Mex. What is an unassuming restaurant on the outside, is quite busy inside and serves excellent food.  SERVICE: The service was decent. Our chips and salsa were served as we were sitting down and our food orders were taken shortly after and served promptly. We were never asked how the food tasted, which is fine by me, but may be bothersome to others. Also, the drink refilling was a bit slow. The waitstaff seemed to be understaffed.  FOOD: Most of the menu is your standard Tex-Mex, but the taste is certainly better than most places. One unique food menu item that Taqueria La Unica serves is small tacos for under $2 a piece. This is a great way to sample many different taco fillings and toppings. I wish that they would season their meat a bit more, though. Salt was definitely lacking.  PRICE: The prices are overall very fair, but then again Tex-Mex is fairly inexpensive food. If you get a combination plate, you may have to pay an extra $1 for rice and beans, which I find a bit odd and unreasonable, but otherwise, the prices are very fair.  I enjoyed my visit to Taqueria La Unica and will certainly return. You may want to show up a bit early, as it can get very busy in the evenings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99G0FvRcbxlQc8mWmnRLqA"
  },
  "wW8Ydip6cfdn3-ZX_R3Z6w": {
    "date": "3/23/2018",
    "text": "This place is awesome. Consistently provides good food fast and at a reasonable price. I have eaten here about once a week for years. The only down side is no beer or margaritas but I love the people and the food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rajbpcL3lCodWjLzv7JNCQ"
  },
  "I9Sg0CzVFwtkDbW7-935gw": {
    "date": "7/3/2017",
    "text": "Always great taco's! I'm in love with their grilled fish, Asada and Carnita taco's. You can't go wrong with anything on the menu. It's the closest I've found since moving here from South California in the 90's to what I know as authentic Mexican. The staff is always friendly and goes out of their way to satisfy. Stay away from those other knock off 'La Unica's', this is the real deal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gbMA3UJ015DXLGzlRKRiJQ"
  },
  "AOcdk7-k2UU9jjHBI3gK9w": {
    "date": "8/7/2017",
    "text": "This is a great family restaurant that serves authentic Mexican food. The staff are very attentive, and food is reasonably priced. If your looking to find a great Authentic Mexican Dish, this is a great place. The staff speak English, and you can order to go and come pick up at the door. We have never waited for a place to sit, or parking. They sell fresh homemade juices Mango, Tamarindo, Jamaica, Horchata, and Melon. Big Cups that you'll never need to refill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9HQpIWb3Kj0Z046a3uoAsQ"
  },
  "YF3wOWhG25_wI8o8BRGyzA": {
    "date": "5/27/2017",
    "text": "I really like this place. Great salsa - spicy and mild. Awesome tacos! Loved the chicken but ground beef were awesome.  Good flautas!   Good rice and beans!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJTPfQjdkFrh-TG_ow_BcA"
  },
  "dRb7NBTda_Ou4NeQkIXaSg": {
    "date": "5/3/2014",
    "text": "As a Latino newer to the Charlotte area I've been searching for a while to find a authentic place that has some good food.   They have some amazing authentic tacos the carne asada and carnitas are amazing! They have a avocado jalapeno sauce that has a nice kick to it and is amazing on the tacos and with the chips.   I take off one star because it would be nice if they served some grow up drinks. BUT this place is always packed so be prepared to have to wait a little but they are always good about getting people in quick. All in all it's a nice little spot that reminds me of grandmas cooking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aaMxNQRrGryeRopdKyuf-w",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Tacos!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aaMxNQRrGryeRopdKyuf-w/o.jpg"
      },
      {
        "img_id": "YSojn7INWdPCUDp7IIsTKA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YSojn7INWdPCUDp7IIsTKA/o.jpg"
      }
    ],
    "user_id": "QfFqBZbvaB_VuzUtThQGAQ"
  },
  "mSrMqYM0Um90X6oULRNJSg": {
    "date": "11/17/2015",
    "text": "Inconsumable garbage food.  If you are wondering if there is a hidden gem in the otherwise uneven Charlotte Mexican food world down in Indian Trail based on Yelp reviews, well, I have your answer: there absolutely is not.  Take a better look at the reviews than I did, and notice that everyone mentions their love of the price. Maybe they use great ingredients, but I couldn't tell in either their disturbingly underseasoned carne asada tacos or their inedible vegetable fajitas.  The carne asada came in a big, uncut chunk of meat tucked in a piece of aluminum foil. If it wasn't for the aluminum foil, I would have assumed it was overcooked in the microwave with zero seasoning. They must have been saving it for the three vegetables in the vegetable fajitas. Did the cooks take prior terrorist interrogation experience to this job and waterboard these vegetables with seasoning? I guess those guys probably need jobs, too, but they should dial it back.  Salsa was not good. Luckily that prevented me from buying (yes, there is a charge) for more chips and salsa. I should have followed my first impulse and left the laundromat-looking restaurant when I first pulled into the parking lot. I should have followed my second impulse and left after the other patrons looked most comfortable at a Golden Coral or some sort of bike fest in Myrtle Beach. No joke, multiple loud motorcycles went through the cramped parking lot in the 35 minutes between when I arrived and when I left for a different Mexican restaurant.  Oh, and this place does not have a liquor license. I have just about nothing positive to say about this restaurant, other than it wasn't the worst Mexican restaurant I've ever eaten at (it was the 2nd).   You can do better.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "rg5eH8Pxd-4HYFvHrallSA"
  },
  "8cZMifymq9EpF_J-_evMsA": {
    "date": "6/24/2015",
    "text": "This place is pretty great.  Really good (but not excellent) food and reasonable prices.  They have an odd policy noted on their menu that only the first bowl of chips are free.  Pretty much every other Mexican place has unlimited chips, so that is pretty weird.  I still give it 4 stars since it is close to home and good, cheap Mexican places around here are really hard to come by. I have tried many others around and this is the best by far.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4g4RYTxx9V7xITgmKQDcA"
  },
  "XOQm9lbTuaqxwRFq_ibCgw": {
    "date": "3/28/2013",
    "text": "When there are lines to get into an eatery tucked away at a dingy strip mall on Old Monroe Road in Indian Land, two things come to mind. One, either this is one hell of a good restaurant, or, two, it's the only decent place to eat within a ten-mile radius, and people are hungry, and better eat there than go hungry. Thankfully, La Unica is indeed one hell of a great Mexican restaurant.  As far as \"authentic\" Mexican eateries are concerned, La Unica passes some strict requirements. Being that most Mexican restaurants tend to lean towards Tex-Mex (and there's nothing wrong with that), La Unica is one of the few that serves more typical Mexican fare, more from southern Mexico. In other words, lots of seafood in addition to standards like enchiladas and tamales.   Everyone's mentioned the carnitas, and I too will sing its praises: best carnitas in Charlotte. So tender and succulent! I had the carnita burrito, and it was so damned good that I was tempted to have another, but, crikey, that would have been excessive.   One big thing to keep in mind: La Unica does NOT have a liquor license, so you won't be able to chase down your carnitas tacos with a cold Tecate. And, no, they won't allow you to bring your own cerveza either. Bummer. YO QUIERO TECATE CON MI TACOS AL PASTOR, PINCHE!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jr212HQAwMOXGYKkZLfQvA"
  },
  "cV7uE2eszQOabjwJDMBJKA": {
    "date": "7/29/2015",
    "text": "Best Mexican in the Charlotte area. The special spicy and creamy green sauce is amazing!! It is like a combination of avocado, sour cream and Verde sauce! So good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cikjbe6-XVSInTxuYukw3A"
  },
  "wrEPXZna4KDU9o2VjSCE3g": {
    "date": "10/29/2015",
    "text": "This place has amazing Mexico food. One of my new favorite places to eat while in Matthews. Only down fall is there is no alcohol. That was disappointing that I could not order a margaritas with my meal. But the food is delicious and authentic Mexican food which I enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PP3Mzgg0eRV5oTeFmuedFw"
  },
  "VvqL9yvs3wblNh-qXu-soA": {
    "date": "5/24/2015",
    "text": "My favorite Mexican food in Charlotte! I go out of my way to go here whenever the craving hits and it never disappoints me. I love the vegetarian options and the queso! My only qualm is that you can't be seated until your whole party is present -- which is kind of a drag if you're meeting up with a bunch of people. Worth it though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rHY7O5J4nSQ5Q-13OwTkWw"
  },
  "s-6rv0CuDMG4MNIzb4bJ1g": {
    "date": "12/19/2015",
    "text": "So me and my family decided to go and check this place out. Somebody needs to call Gordon Ramsey!!! The food took about 10 minutes to come out which is always a bad sign of precook food, which it was. Me being mexican know a thing or two about good tasting mexican food and let me tell you this food is horrendous! !  I dont know how this place is still in business? ! Anyways if I wanted microwaveable mexican  food, I would had stop by my local grocery store.  Honestly it would had tasted a whole lot better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qc0qlx8XjLdn9vq41Aj6gQ"
  },
  "paIw-9pB3z-sfZ5mfhZxJg": {
    "date": "2/18/2011",
    "text": "Went here for dinner on a Monday night.  It was PACKED!  I would think that weeknights would be slow for some restaurants, but that was not the case here.  When my friend suggested it, it took me 5 seconds to find it on my phone and when I drove up it seemed like a small, run-of-the mill restaurant that offers Mexican fare.  My experience started as soon as I found a place to park [parking lot was a little small for the strip mall this place is associated with].  Opening the door, I was engulfed with heavenly scents of whatever was cooking in the kitchen.  Now I take it the crowd and the aromas wafting from this place just from the parking lot was a great sign.  Out wait was quite long, but it was well worth it.  The hosts did not forget about us... but I totally could see that the larger groups were getting \"priority\" since they can bring in more $$ with them.  No harm done... everyone gets to eat and the restaurant makes a killing.  The chips were offered with 2 salsas... One mild and another with a good kick to the sinuses.  Of course both were really good and you can tell, they were made fresh.  I had the enchiladas supreme.... which were very good.  I have to admit I am a sucker for enchiladas, but my friend swears by their carnitas.  They looked very good.   My meal also came with rice, shredded lettuce, 2 slices of tomatoes, and a dollop of sour cream.  Good stuff.  Overall a great place.  Can't wait to go back and try more of their offerings",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "6_RX9rA6I8Q0NW7DQTNRpg": {
    "date": "1/12/2013",
    "text": "LOVE this food. Most authentically Mexican food I've found in a long time. This is not tex-mex... it is authentic and oh, so good!  Try the beef tongue. It only costs about a dollar, and will open your eyes to a new cut of meat! The tongue is tender and flavorful, it tastes like braised stew meat.  Every single thing I've gotten here is just incredible. It is so fresh, so tasty... great, now I'm hungry!  My only complaint is no alcohol.  ** Edit: They've expanded! So now there won't be such long waits to get to incredible tasty tacos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-2uhgBrHoFvUjfLaf3OFQ"
  },
  "3m_9BoT6fO1vgZqglPPQIw": {
    "date": "1/30/2016",
    "text": "I have been eating at La Unica for many, many years, since the Central Avenue location opened . I have eaten at numerous locations. Love the Indian trail location.Big, clean, and always fast service. And of course, the same great food as always.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVAYcMR8eig8z2h2EgsqGw"
  },
  "kAfyCepU7wzULPm04f3DTA": {
    "date": "11/23/2016",
    "text": "I love carnitas and any time I see a Mexican restaurant I haven't tried I go in a get carnitas. These are the best I have ever had. Fork  tender. I have never had bad food here. I go quite often and I have never been dissatisfied    My mom likes a variety and she has tried many items and has always been happy. Great service and friendly people",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXrU36gul25A79snE3XFCQ"
  },
  "5PheMtOdMUI7Hg8wLeeinw": {
    "date": "11/22/2015",
    "text": "Friendly and courteous staff. We were given chips and salsa the moment we arrived. I had the lunch chimichanga which is the best I've ever tasted. The portions were decent. We will definitely be back for another visit soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ppghc8YhvJYuqQx50r6xBA"
  },
  "SgbRYEs8ZdaqcYA7C35ryQ": {
    "date": "1/16/2016",
    "text": "Always delicious and fresh food. Great service with a family atmosphere. Be advised however they do not serve alcohol here so not a great place for drinks. Otherwise always delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WklJSf_mD_oHGBe0sZv5rg"
  },
  "6qBj1mtqsXbJVwpYZrn5Vw": {
    "date": "5/26/2015",
    "text": "I had a very bad experience at this restaurant where I found a fairly large chicken bone in my burrito.  I could have choked on this!!  Their response was very nonchalant.  They told me it happens, can't always get all the bones out and did not even offer me any discount.  Are you kidding me with that response?!!!  I had to almost beg for a discount and explained to them that had I choked, it would have resulted in a law suit.  Needless to say, I will not go back.  Shame on you La Unica!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QVi5Avdwp4PeZDyS1N9fQQ"
  },
  "h1RNKGWpj3fGdP23YDTCiQ": {
    "date": "10/24/2015",
    "text": "Not very impressed and surprised at all the good reviews. The servers and hostesses were very nice but the food we had just wasn't very good. We had quesadillas, chips and enchiladas and it was rather bland. I probably have high standards because I've eaten a lot of Mexican in other parts of the country, it's generally not very good in NC. It also took 10 minutes after we sat to get service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHfxAvOX9hhXKAdev2ZQKg"
  },
  "bcqYJLF1BVGLDWhfSBS_kA": {
    "date": "5/8/2015",
    "text": "Me and my family's absolute top pick for Mexican in the area. The authentic tacos (pork in particular) can't be beat, and queso is great. They give you tons of chips in to go orders, with hot salsa. Great for take out, eating in is crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "o4u7aXumEBK3iEjZqVqvMQ": {
    "date": "8/13/2015",
    "text": "Best Mexican in town!  Everything is fresh, fast, and delicious, hubby and I are here at least once a week.  Victor is the best!  Portions are large, lunch specials are fabulous.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOcaosjeQXGRl7PIbUgzkQ"
  },
  "dl_u-55HlQ3twbifjTy8Eg": {
    "date": "8/13/2015",
    "text": "This restaurant is big a surprise!!  The exterior of the building definitely does not match the quality of their food. They have unbelievable salsa, and wonderful dishes!!  Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_WmDMlrFRQXpiuPAB0gCtg"
  },
  "4zis3vPFLllIUVNDk4qt1A": {
    "date": "10/4/2015",
    "text": "Wanted to try it after reading and hearing about being the best Mexican Restaurant in the area. To me it was not great but it was not bad either. I will go back and try a different dish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1cZB1rJGsBa_qnvAmWBvQ"
  },
  "gbGHt39Gt6nDCHAEmHs31A": {
    "date": "12/20/2012",
    "text": "Hands down, the BEST Mexican food in Charlotte. If you go to this place and order a normal Tex-Mex entree you a SERIOUSLY missing out. Order the traditional tacos, carne asada, carnitas, arroz con pollo, sopa de pollo, etc. You will NOT be disappointed.   The staff is awesome. They always greet me upon entering and the manager always makes time to come visit my table and say hi to my son (he's 2 and this is his favorite restaurant).  It is ALWAYS packed. But absolutely worth the wait.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AN_4oZztrtmeIlW57vQoxg"
  },
  "8iT_SZLJotEw1pIucZbZHA": {
    "date": "7/16/2016",
    "text": "Really tasty. Large menu. Very quick and very nice waitstaff. Try the sopapillas. No alcohol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEjD8OK9bjA-zviD0Dg2bw"
  },
  "5E7D8r-1oYtQFT-UL-3yAA": {
    "date": "12/8/2018",
    "text": "Hands down the Best  Mexican food I have encountered in Charlotte metro.  It's not a fancy place but always busy and turnover is still pretty quick. Their green hot salsa ( served upon request ) is a must try if you can handle he heat. Regular salsa are equally flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayRxn5PsnULv4xgq7c2ykw"
  },
  "GsXMocgldkT6Ly3fgKtDaQ": {
    "date": "6/29/2018",
    "text": "This restaurant is fabulous!  The chips are always on point and the salsa is super tasty!  The service is great...fast and super friendly!  The restaurant is always very orderly and super clean!  The food is delicious and it comes out to you within just a couple minutes...which is great if you have kids or if you are super hungry! :). The prices are VERY reasonable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U2Y5ZSclpcL0QPSK67h6Eg"
  },
  "OGD8NL4wsgbDIwcPeug0nA": {
    "date": "3/2/2018",
    "text": "This is by far the most bland, tasteless Mexican food I have ever eaten in my life. The people that eat here have clearly never experienced authentic Mexican food. I would only go back if I was starving to death and this was the only food available.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "riBVW83_YTpuk4rnU29srg"
  },
  "4P3Rl8qmkNyDHPSAY39CZA": {
    "date": "5/15/2018",
    "text": "Hands down my favorite Mexican restaurant!! The service is always great and the food is always delicious!! I have been dining there for over 15 years!! Best chips and salsa around!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qxZlQfL1RI9HWnn-ckTMA"
  },
  "vLslO1BZynPYppUJcMbVBA": {
    "date": "8/24/2018",
    "text": "The food is not the issue. It's the lack of customer service. My wife called our order for pick up. I picked the food up and received the wrong order. When I got home, the order was incorrect . I picked my order up on the way home as we do not live close and we're not able to return to the restaurant. We spoke with the manager and he admitted the mistake and offered no resolution. He would not return our money or offer any kind of credit. Unfortunately we will not return after the rude service we received after their mistake.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TK25j2aC4DzQSks8iO2Lg"
  },
  "YKWYVAQQbtZ7XTvqV4aOnQ": {
    "date": "12/11/2018",
    "text": "We love la unica South blvrd. We were craving tacos and went to La unica Indian Trail. We ordered our food and it was tasting good, but then there was a hair in my son's taco. The waitress came and we told her and after no response from her I asked her if we could have two new tacos since my son was starving. When she brought them out  we were finally eating again and the unbelievable happened there was a very long hair in my daughters beans. We told her again and she looked at us like if we were lying, but believe me we couldn't believe it either but it was True. My real problem is nobody said anything to us nor nobody came to offer an explanation or give an apology.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8H0X_HqZrLG41dOMzmoeFA"
  },
  "GESaFE2v_jqN5qzT9kU9iA": {
    "date": "12/9/2018",
    "text": "We are new transplants here and have been back to La Unica a few times. Chips and salsa on the table and good authentic food. Large menu and no problem adjusting a meal for dietary needs. Always a full dining room when we have gone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eb4eP6qEq4yv9ASxNAHgng"
  },
  "z2b9UbnX-FKL0DNKfLG8vg": {
    "date": "4/27/2019",
    "text": "This was the worst Mexican food I have ever had. We both had burritos and they were not good. I have never left a bowl of free chips and salsa almost full but did this time I did. The food seemed to have no seasoning and after reviewing the menu both our burritos were missing things. Mine had white cheese sauce on top supposed to be nacho and muenster cheese inside never found the muenster cheese at all. Husband's was missing a hot sauce inside his, it had no sauce. Service was fast but not good and our waiter might have been  having a bad night. After his reply when I asked if they had any specials. Also, he mixed up our drinks after taking our order for them in less then a min. Asked for no pico de gallo on husbands lettuce got it anyway. Taco Bell is better authentic mexican then this place was. We will not being going back ever again. Might as well just burned that 28 dollars and change.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QxWB7SmVh4EIzhUJAFbvug"
  },
  "t82U-h8QPJeaYX9LA3ASMA": {
    "date": "6/29/2017",
    "text": "Menudo needed salt or spices or maybe oregano?    The tacos (lengua and barbacoa) were delicious classics and the salsas were perfection. Will become a regular. New to Charlotte and this restaurant is a top choice for Mexican food here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yh4zMAoObIDvQc0HW57Gcg"
  },
  "OrS9RflBscWoilkRSx5aIA": {
    "date": "5/10/2018",
    "text": "BEST mexican food in the indian trail area!! I can go to this joint every weekend and never get tired of it. Daily lunch specials are amazing deals and the service is always friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZbKCN30eUOaXKU0kgY2_OA"
  },
  "U0hnBbl_Er7jaUSnhYFVdw": {
    "date": "7/21/2017",
    "text": "I absolutely loved this place, I had heard so much about this place in the last couple of weeks having relocated here from California I know a thing or two about good tacos I was a bit reluctant to believe the this place was as good as people said. We went there with family tonight and service was friendly,  place looks clean, tacos were the bomb! Cecilia took care of our table she was very efficient,  friendly and professional. I do not know how other Mexican places measure up to this one, I think from now on this will be my place to go for tacos. I would more than likely recommend this place to my friends family and you. Thank you for dinner tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Wd4enr02Td2yUZ7xBGzWcQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Wd4enr02Td2yUZ7xBGzWcQ/o.jpg"
      }
    ],
    "user_id": "B7DW-abvjGLPdbu7cPB5Jg"
  },
  "mgdMOWOQwSW6iodt--EmAA": {
    "date": "7/2/2017",
    "text": "Not quite sure what all the rave is about this place.   We sat down on a mid Sunday afternoon, had to flag down a waitress to get our drinks.   We ordered a choriqueso which was quite good but the cheese dip was way too watery / liquid.   I ordered tacos with chorizo and asada. They were very bland and quite ordinary.  The rice and beans I ordered were also bland and ordinary.   My date ordered a torta and she said it was decent.   Slow service and bland food I've had much better ( and at visually more appealing restaurants)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "2aDcCm7sqY_BzHm82SUfTw"
  },
  "GVe-1fnMbmCYQlKmLnfa1w": {
    "date": "11/19/2017",
    "text": "Why on earth does this place have such high ratings?! We haven't had Mexican food this bland and hopelessly boring in years...maybe not ever. Honestly, I think this may have been the blandest Mexican food we've ever had and we've been eating Mexican food regularly all over the country for well over 20 years. Nothing tasted as it should; the mole sauce was bland, the chorizo was bland, the steak tacos were bland. The salsa and guacamole were good enough, but that was not enough to save the experience for us. We were literally dousing our food in lime juice and hot sauce and that was still not enough to cover the fact that everything tasted the same and was essentially tasteless (like hospital food or some other institutional slop). While discussing how/why this place had such high markings online we looked around and saw it packed to the brim (on a Sunday night) but not a single diner was of Latin origin. This place is for gringos, period. For gringos who don't know what good Mexican food should taste like. Also, the service was grim. Our waitress never brought enough utensils for us, never brought us our waters, only brought one to-go container when we asked for two. We haven't had service that poor in a while...honestly the whole experience was totally disappointing. Don't go here...you can find way better Mexican food in the Charlotte area. And it wasn't even that cheap - these are not taqueria prices they're charging. Oh and they don't have alcohol either. You cannot even use a strong margarita to convince yourself that the food here is worth eating.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "n4tD6axYRFajkX2ESvukMw"
  },
  "JwH3JCCy4EsC60kHZ2w5Ug": {
    "date": "4/7/2018",
    "text": "This has been a go-to for my family for over 10 years. Big portions, delicious food, and the friendliest staff you'll ever meet. Economically priced and with such a varied menu, it's hard to find a better restaurant for the whole family!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wmdwfxv8cJgyU0HkyvjzDg"
  },
  "mXnXHt2ZCZyUwGPMHsj6jA": {
    "date": "2/17/2018",
    "text": "We were looking for good Mexican food since moving to Charlotte from southern California. It seems that we found it. Superb authentic Mexican food in a family setting. Really, really good. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "djowg_djyJ37wiesacguEQ"
  },
  "O0prDUFHOlSpFPzz5zkTNw": {
    "date": "3/6/2017",
    "text": "I was sadly disappointed with this location. I know they have great reviews and have seen how crazy they are during lunch hour, but I was not impressed. They have a very large menu which is typical for this type of establishment, but their were almost no descriptions. This is a big no-no for me. On top of that they serve zero alcohol and I was hoping to enjoy a margarita with my dinner. I will say the service was amazing and fast so we were in an out.   Four of us went for dinner. The gratis chips lacked flavor and cheese that we added was a white queso with some diced peppers, but was just OK. My fellow diner enjoyed their meals, but I was not in the same boat. I'd decided to try a dish from their selection of specials - since it had a description and sounded delicious I ordered was anticipation. Chicken breast grilled with mushroom and onions in a white cream white sauce served with rice, refried beans and tortillas (choice of corn or flour). Unfortunately, the description didn't state the white cream sauce was spicy. This was too spicy for me and ended up switching plates with my husband. He thoroughly enjoyed this why I had a bit of his steak.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PIS0wS0l8ETdozkhli8NmA"
  },
  "0AWygGA86xLa6tH1xAXREg": {
    "date": "1/5/2018",
    "text": "Moving from Los Angeles  it was hard to find decent let alone good Mexican food. La Unica is the best we've found. The chips and salsa are good which is the first sign they know what they're doing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4lYwm84uvPdfi-zq96j5lA"
  },
  "6MbMdPlvlwTynbx_XZNx3A": {
    "date": "5/8/2017",
    "text": "This restaurant is amazing. We are transplants from the San Francisco Bay Area, California, and we were looking for a good Mexican restaurant here in the Charlotte area.  The service is wonderful. We were there last Sunday and we were served quickly and the wait staff is really friendly. I had the Carnitas dinner and it was delicious. The carnitas were savory and not fatty. We are so happy that we found this place. Great value too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F2_ORBYyyVk6AlU-WJ81Og",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Taqueria La Unica carnitas dinner. Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/F2_ORBYyyVk6AlU-WJ81Og/o.jpg"
      },
      {
        "img_id": "ljGEG5K-jTvDZzbZ2GfOrg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Taqueria La Unica Sunday lunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ljGEG5K-jTvDZzbZ2GfOrg/o.jpg"
      },
      {
        "img_id": "Hd8Y2mSJO5lkL8fQFv6QZg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Taqueria La Unica chimichanga.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hd8Y2mSJO5lkL8fQFv6QZg/o.jpg"
      }
    ],
    "user_id": "4FFkfbrc8YzWbRcwMbMsZg"
  },
  "k-RLseDDUA6Fb8OcWHbiog": {
    "date": "1/23/2018",
    "text": "One of my favorite Mexican restaurants around. They're fast, friendly and have great customer service. It's never a long wait for your meal, refills of chips and beverages are frequent and come without the request. Food is delicious, as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3O4XW4GpCNbDZ2AAcfRwpw"
  },
  "StlFoGZp2SDHshf4myTf1g": {
    "date": "2/7/2018",
    "text": "My favorite Mexican restaurant hands down. I will forever love this place not just because of the amazing food, but because of the fast and friendly service too!! I have went here since they first opened years ago, and I have never had a bad experience. I come for my lunch break mostly and always leave full, pleased, and on time back to work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qyKoMPI6pnz1Jp-f1skwuA"
  },
  "s-NxRc5BCYMXJgpTpe4BRw": {
    "date": "3/15/2014",
    "text": "So far away but well worth it. Astute service, wonderful authentic food, and a simple no frills experience. It far exceeds the tex-mex that Charlotte knows. Every trip is a decadent experience.  Feels like god is rubbing your tummy.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VUJcjItc3TS_Gg5CL9Xh2Q"
  },
  "2HsMXBtvYavN_-Hp5RKXZQ": {
    "date": "1/24/2012",
    "text": "We have eaten here a number of times and it would be very hard for us to find one bad thing to say about this place. Service has always been superb and the food is absolutely delectable. From start to finish we loved every second here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zSp0l4VCndo7Q4Icv53kaA"
  },
  "cDVOyRB_fu5dM0XNq9CoiA": {
    "date": "1/7/2015",
    "text": "La Unica is the best restaurant for Mexican  food. The staff is wonderful! The food is delicious! We love the way they have expanded and remodeled! We recommend LA Unica to all our friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRxxWoZNKGkL3iWCRj8Mjw"
  },
  "PSA_xJ6PHyjbAM49gtwRDg": {
    "date": "1/2/2013",
    "text": "Best mexican in the area, for sure.   The customer service is phenomenal, and they somehow remember almost every diner.  The downside? It gets PACKED. However, I would rather have a packed place with good food than an empty place with slop.  Go, La Unica! You're an Indian Trail staple now.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xwp0fjlgkH_ehtbEapygJA"
  },
  "97pHUXjnwQUZiifHU4j7wg": {
    "date": "7/15/2009",
    "text": "I love going to La Unica. The service is great, and the food is better. They offer a pretty typical mexican restaurant menu, but the food is MUCH better than your typical cheap mexican eatery.   Free Chips and Salsa when you are seated, and service is always fast and friendly. Lunch is always quite busy, so you might have to wait for a seat. (Large crowd just shows you that the food is that good!). Due to the lunch rush, they do require that your whole party be there when you are seated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0I2K-Y_GyMM2Uk0UQAytvg"
  },
  "gE2MfzXs0zWGg8FvvNtTDw": {
    "date": "12/13/2014",
    "text": "Best Mexican food in town - hands down. Always friendly service- always packed (for good reason)- the food is awesome!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eo9Am8sWKCnUIy6BQMBDzA"
  },
  "kKIcCCqbNIEfHnNQHMUjaQ": {
    "date": "12/5/2011",
    "text": "Food is always fresh & delicious. Love the fresh salsas & friendly staff. My family's favorite Mexican restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_EsEUqocwccAgSgnftmFzQ"
  },
  "maaMY-GWKtNg4H5nxbdlmg": {
    "date": "11/14/2011",
    "text": "Let me first say that the food at this place is 5 stars!! It is so good and tastes very authentic. I give it 4 stars b/c I fully believe that every good Mexican restaurant should have a bar. Mexican without margaritas is unheard of. This place has no bar and not the greatest atmosphere. Just a bunch of tables in a room. Greater ambience and a bar would make this place 5 stars!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ce-SSuhqj14xhJ2dGn6NWg"
  },
  "CsYNgYSnGthYMvWgLHQa7Q": {
    "date": "8/24/2013",
    "text": "Delicious food. As authentic as we have found. I was encouraged by the reviews that said they were disappointed that this was not Tex-Mex cuisine. Those are usually a good sign to us. We aren't the usual quesadilla crowd.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9gUHssdi7xp-HAp4KOJHog"
  },
  "gbZCokT7vl2OzJA3_A9LkQ": {
    "date": "3/31/2014",
    "text": "This was good Mexican food. I decided to try something I had never had before (I forget what it was called) and I was glad I did. My wife ordered a torta, and raved about the bread. La Unica is a little out of the way for us, but worth it if we are in the mood for Mexican. It was fast and relatively inexpensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "RUNzi7JQXHbe8R3ykP5z9A": {
    "date": "7/19/2011",
    "text": "PASS on the Veggie Fajitas! I just paid $8.99, yes, that is really nine dollars, for a grilled onion, canned mushrooms, and a strip of bell pepper.  The onion was not even the thin, almost caramelized grilled onion, but it was in square chunks that were too thick to be really done.  The mushrooms were canned, I know, bc they were rubbery and did not brown and shrink up like fresh ones.  The first tortilla I took out of the aluminum foil broke in half down the middle bc it had been wrapped so far ahead of time.  I just looked at the plate like, are you serious, these are veggie fajitas?  If a very sketch place like Miguel's at the Bradley Motel on the west side has fresh veggies, including squash and zucchini...enough said.  the two stars are for the Burrito Tijuana and the breakfast burrito with chorizio.  In these hard economic times, I do not like to feel like I was cheated.  If I had not been with a friend I did not want to embarrass who goes there all the time, I would have spoken up to the manager...",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "A-9vjHZM2VuJ9KZFWr9Xbw": {
    "date": "2/18/2016",
    "text": "foood is really good, the weekends can get really noisy!! and crowded! the chips and salsa arent good and the only wone that is good is to spicy, people like it cause they give you free cheese dip but even that isnt good, you get like 5 waiters and you dont know who to even ask when you need something, including your check.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UEjkXZMsJocyt4WhZF8AOg"
  },
  "GL8iVedc_pNrMeedLdjW5Q": {
    "date": "9/13/2008",
    "text": "Thank you La Unica, I was growing so tired of these generic phony Mexican restaurants.  'Would you like a burrito, an enchilada, and a quesadilla or how about an enchilada, a quesadilla, and a burrito?'  How about a chile rellano stuffed with rice, beans and real queso.  Top that with habanera salsa, sour cream, and more cheese (the white crumbles).  You can get that here.    I put on the cowboy boots, sweat like a real rancher, and set my mouth on fire when I eat here.  This is what it is all about.  If you want Mexican food eat it at a place where a lot of Mexicans dine, La Unica.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5FF5NN5kHZmGTNuJwpnhg"
  },
  "rr_YIyhj-_RLl1pZcjszHA": {
    "date": "8/1/2013",
    "text": "I was in the area visiting my family and they absolutely had nothing but amazing things to say about this place so we all decided to go for lunch. We were a big group (a group of nine) and we were able to be seated quite quickly, however we were separated in two tables. The place was packed and the servers looked a big overwhelmed, but all were friendly. The food was on point.. The steak fajitas were delicious and my husband ordered the fish tacos (the fish pieces were breaded which was kind of odd but still yummy). The chips and salsa were fresh and you can tell home made. The carne asada that my cousin ordered looked AMAZING!! They are expanding the restaurant which is totally necessary, as my family tells me the wait time can be crazy. If I lived in this city, this would be my go to Mexican restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MxQHPRN6eHD29uA9m6Nchw"
  },
  "bStFJQy0dY6-1eqPdDKIZg": {
    "date": "5/4/2014",
    "text": "I got take out here once.  I don't remember what I ordered, but it wasn't anything great.  Being that Mexico is a large country I asked the waiter what the regional differences were & was met with the answer that there aren't any.  Not too impressive from the start.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3wgBhhNvQSonTctSv3z_Sw"
  },
  "aETwfuGRAymrIsSP1si_RA": {
    "date": "9/17/2011",
    "text": "I've frequented many Mexican restaurants in Charlotte. I'd have to say that this place is one of the best. The atmosphere is always hustling and bustling. They're almost always busy. If you go at night, be prepared to wait in line. They will not seat you if your entire party has not all arrived!! I felt bad today because my friend and I got in before these two couples who were waiting on one more person to complete their group. But oh well, there's a sign up that details this rule, with \"No Exceptions!\"   We were seated quickly. Our hostess had eyeliner that she drew to the corner of her eye and beyond. I thought it looked cool, like a character out of star trek or something. Within no time, they served up the free chips and salsa. The salsa was home made, and very good. The super hot salsa is extremely hot, and will make you sweat. I ended up ordering Camarones Diabla (I took a picture of it and placed it in the gallery here). I almost always order this dish when I go to the more authentic Mexican restaurants. The dish was very good, the sauce was perfect. Although I could've used a little more spice. They also put a lot of shrimp in it. One thing I will complain about though, is that I think they would've done better by deveining the shrimp. Also there were still a couple shrimp peels that hadn't been completely peeled off, so I did it myself. Regardless of those minor details, the dish was still superb.   I've had their pulled pork soft tacos on previous visits. Those are also very good. Especially when you put that super hot salsa on it. Their tacos are definitely way better than Taco Bell. The service was great, my water was constantly being refilled, and the waitress kept calling me amigo, making me feel like she doesn't hate me and that I'm part of her extended family. I welcome that kind of affection. This is a great Mexican restaurant. I would definitely return, recommend, and bring amigos.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LV6OaXoHYAJMyctkluzYlA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LV6OaXoHYAJMyctkluzYlA/o.jpg"
      },
      {
        "img_id": "YxwoPXfW3KyRBf2uwHtxbQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Camarones a la diabla",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YxwoPXfW3KyRBf2uwHtxbQ/o.jpg"
      }
    ],
    "user_id": "j6qKuLCV8L5A0W2B3-4iZg"
  },
  "cbeLhFtuOjob6XmevO6KoA": {
    "date": "8/26/2011",
    "text": "Good mexican here. They even have mexican breakfast options on the menu which most do not.  It holds the Indian Trail market on LockDown, destroying any competitor that attemps a sad effort.  Its good but outside of Indian Trail awaits something better!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FAFJLWOUZV5DGKoORB7rBQ"
  },
  "GRIDYoXF4Vi_uYxGjW32Dw": {
    "date": "8/9/2013",
    "text": "I've always said the sign of a great restaurant is when you go a million times and it is always consistently good. My husband and I've been to La Unica probably as many times and always had a great experience. The food is wonderful, the staff is wonderful, and it seems they are expanding to help with the crowd that is always waiting to be seated. I love this place, everyone needs a place they guarantee they will get a great meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C32HNc3_kqTH3r4q-tDc-A"
  },
  "T5fhPcX-_C6U8Or5hi5izA": {
    "date": "8/1/2010",
    "text": "If you're still searching the Charlotte Metro East for honest-to-goodness Mexican food for cheap, this your \"ultima parada\" (last stop).  Most people quickly dismiss a strip mall restaurant where the anchor is a Food Lion, but the proof is in the flavor.  The chips are hot and fresh and they offer several kinds of salsa-mild and spicy.  You can even order tomatillo salsa.  The queso dip is little pricey but SOO good.  I normally order the tacos.  Their tacos are two small flour tortillas with minced meat (pork-'al pastor', carne asada, chicken, or BEEF TONGUE) with a little cilantro and onion.  The meats are overflowing on these little treasures.  I think they run about $1.50 a pop.  The rice is not dried out like other Mexican chains and the taco salad puts those Cali-Mex chains, like Chipotle's, to shame!    La Unica has fast service, friendly staff, and are usually busy on weekends.  Regardless of when you go, you can expect prompt service.  Keep in mind that this particular La Unica doesn't serve alcohol.  But you can fill up on quality Mexican cheaper than a Toxic Bell combo...word to your madre!!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "7IZQ06zkYSCLQM4JU9kFvg"
  },
  "2mzC10jmdRO5tikZorU1ww": {
    "date": "5/30/2011",
    "text": "I enjoyed La Unica, but I was disappointed they did not have alcohol. I really was in the mood for a margarita. The service wasnt great but ok. One salsa was hot and one mild which we quickly found out. I had the pollo quesadillas Mexican style.  The food was good and cheap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8F4YYgiC9OVurlPRYuYKA"
  },
  "h5eueixl_TAubLlTlwsUyw": {
    "date": "12/1/2013",
    "text": "Just took the family to dinner and the reviews for this gem are spot on. The food was fabulous, fun atmosphere and super attentive and efficient wait staff. We shared the carnitas dinner ( by far the best carnitas I have had since leaving the southwest), enchiladas, burritos and veggie fajitas- all plates were delicious. Awesome place, will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XBpE6kqLobz24tAkckLHxw"
  },
  "ykpMQPQA9ryo4jeynx_wSQ": {
    "date": "7/24/2013",
    "text": "Best Mexican I've found around the Charlotte area.  The food is always consistent and the salsa will warm you up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vVsZAzE3qz9ZHal1LB5L-A"
  },
  "5c2mtbB1gQ0l9BmhozA05A": {
    "date": "10/7/2014",
    "text": "Love this restaurant! The cheese dip is AMAZING and the best out there. I definitely recommend always getting the large size because you'll be sad when the small is gone! The cheese enchiladas are also amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LJ06yxV0w9irqbYc24vTRQ"
  },
  "pAUeJ0rTWtfeiaXHpwVFRg": {
    "date": "10/11/2015",
    "text": "I'll give 3 stars because the taco was good. We try the burrito but not a fan. This place get busy so go early. Lack of parking space. The waitress took awhile to come get our orders but we had chip and salsa to at table when arrived.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpnmpU3L0W3iFEuSmVATtA"
  },
  "eMWhaiZwYl5WH48udQZvJA": {
    "date": "10/21/2012",
    "text": "This place was surprisingly good! I usually enjoy a nicer atmosphere, but for the amazing flavors of their food, it was worth it. They are the only place to have chilaquiles in Charlotte. I tried it in Mexico and have been craving it ever since. La Unica's was really good. Thank you guys! The shrimp quesadilla's are really good too! It is nice to practice my Spanish, and the servers are always happy to speak it right back. They are so nice. Muchos gracias!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IdD1Z_PMqF0zUn3uZWSeAg"
  },
  "9LwwlQ35i7Sxc9ryOWsZjg": {
    "date": "10/3/2015",
    "text": "Best Mexican food.  Waitresses are the best.  Make you feel like family everyone and definitely leave full.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mNNw7ZAi_YmsIsGHKuruKw"
  },
  "W_sFMGoJwwNWDYzx-YeCkA": {
    "date": "5/11/2010",
    "text": "I went for lunch last week and got a taco salad - it was nothing to write home about. The portion was fine, but there we no beans (not refried or black) and the lettuce was a little on the brown side.  The best part about this place is they offer you 2 different kinds of salsa with you meal - a smokey, chunky salsa and then a medium, pureed kind. Both we very good, and I found the chunky salsa super addicting.   Don't go during lunch without expecting a 15 minute wait. A little noisy, but a good little spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AWLMwFVdUCPtmo1IbQL3eA"
  },
  "llMH0lwD30sECi9cSI1g3g": {
    "date": "4/12/2014",
    "text": "This place is always packed every time we pass by so we decided to try it for dinner tonight. It was some of the best Mexican food we have ever had, even the rice tasted good. The place was clean and the customer service was great. The food came out  extremely hot, fresh out of the oven. We will definitely go back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "htw97SjhhBwAoP1kuJQQbg"
  },
  "4Q93g9SBvpxShjQr2XgH4Q": {
    "date": "4/11/2012",
    "text": "Stumbled upon this place accidently and so glad I did. Food is fantastic. Service is great.  I visited on a Tuesday evening and it was packed. One minor comment - if you are traveling on business, La Unica does not accept American Express.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jAT0WYywVWw4PAHH-NrU4A"
  },
  "ZQVSi3gCV0cWrSAVbT7Tug": {
    "date": "8/18/2013",
    "text": "LOVEEEEE THIS PLACE!! Portion is great and taste is amazing. I always order the steak fajita and its enough for 2 people. I am obsessed with thier green sauce!! Very spicy guacamole. Cant live without it! They also have mexican soups on sundays which are fantastic!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KGHGo1HXlTq7yb0Apzmqvw"
  },
  "-213IqA2VVhNfYaLAO2aPg": {
    "date": "10/10/2015",
    "text": "THE absolute BEST home made chicken soup in the history of chicken or soup!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1MQTi3CUEc9HlKxgHYEkw"
  },
  "xPNS7FO7MSIjUWSpOVlV0g": {
    "date": "7/25/2015",
    "text": "Best mexican food around period. You know a place is good when it's always busy. As many times as we've gone it is always consistant, fast, and the staff couldn't be better!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyW6wU5r8cjudMNiqNsIyw"
  },
  "jXHp_K-GybSIYIkQX8ea2Q": {
    "date": "7/8/2015",
    "text": "Pretty decent Mexican food, one of the best we have found around the area. Would probably get food to go vs eat here so we can have a beer with our food (who doesn't want alcohol with their Mexican food).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "geWyE6uU5GCwNcmEhTTyLQ"
  },
  "MoZkOI7J9loNxON4ggXSXQ": {
    "date": "7/4/2015",
    "text": "friendly staff, very fast service, good food.   two notes:  1. if you like to have your favorite cerveza with your lunch or dinner, you'll have to find another place.  No beer served.  Would be great if they did. 2. as someone else mentioned, the hot salsa is VERY HOT!.  If you like a little kick but don't want to burn your mouth, try mixing the 2 salsas. Overall a very pleasant dining experience.  Will invite friends to join us there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTapQZqThBcUPZgfS9qwhg"
  },
  "1Sv5GlBWjTVeJ5oA_sRjEA": {
    "date": "10/20/2012",
    "text": "LOVE the food and service. And the price is very reasonable. Being born and raised in Los Angeles, I've been blessed to have eaten at some really good mexican restaurants. In the greater Charlotte area they're tough to find. La Unica is certainly one of them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RzmuG3eJyGFFi62J5_tANQ"
  },
  "SAptE4C7oNAxtdlCi5MfpA": {
    "date": "7/18/2012",
    "text": "Always consistently good food! The salsas are awesome, the burritos and tacos are yummy. Expect to wait during normal dinner and lunch times because this place is always packed! My favorite Mexican restaurant, and I have no reason to go anywhere else!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3Pi3Q6plD0mJZL_-_wONw"
  },
  "Qkro_QV1x0QSXrFAO216Hg": {
    "date": "10/15/2011",
    "text": "Fantastic Mexican food!! Very unassuming restaurant in a little strip mall  on Old Monroe Rd. You must find this place & give it a try next time you're in the Indian Trail area. The chorizo quesadilla was top notch. Hell, anything chorizo gets my vote! If there is a downside, it's that there is no alcohol served. I can live with that. Highly recommend this place!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "MinLV8mIKyT6I9p_QeD5SA": {
    "date": "2/22/2014",
    "text": "Raised in Oklahoma with real Mexican food, this is a good as it gets.  We drive from the Marvin area weekly to enjoy the food.  The green salsa for the chips is amazing albeit a tad on the hot side.  Tacos are like eating street food in Baja.  Carnitas are spot on, and the guisado is like the little old woman down the street made from my childhood.  Teamwork makes for quick service, and the kitchen executes with great speed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "urThcqroWgGhtyArBz0Yzg"
  },
  "WYSuxUgEADq_zss1Dy3xdw": {
    "date": "2/3/2014",
    "text": "This is hands down the BEST Mexican restaurant around!! The food is excellent with plenty of flavor! I love the nachos, the tacos, the burritos, and the spinach dip is amazing - and I don't even like spinach!! The chips and salsa are really good. They give you a mild and hot salsa, which taste freshly made. Both have great flavor. I prefer to mix them because the hot is REALLY hot (to me) but still very good!! The service is fast and the servers are very friendly! They recently remodeled and it really cuts down on the wait times. Great atmosphere and great food!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9S5v-sop-f-7APOJ85v44g"
  },
  "QWhUYW4YpQk6MZgsRVkw0g": {
    "date": "6/12/2015",
    "text": "This place has the best Mexican food on the planet! The fajitas are awesome and the chips with the hot salsa are on fire, but really really good! The staff are friendly and courteous from the time you enter to the time you leave....excellent attentive service! And to top it off....it's a really clean restaurant....they were cleaning the doors/glass, wiping the menus down and the salt & pepper shakers were even clean, which is a pet peeve of mine! You gotta try La Unica!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UFAuWFrT7AIqFkZ5onc35w"
  },
  "aK06j84Gc5kGN8jrQmmqeA": {
    "date": "2/18/2019",
    "text": "I suppose I have to review this ... and fess up that we go here once or twice a month. Or more. For years and years now.   Do you want to taste what authentic pork carnitas street tacos are supposed to taste like? This is it.  Way off the beaten path, but always busy. For good reason. These are good people making good food with good service at good prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyQrUamokaPLDrBxGmzPnA"
  },
  "3WxoFchtXdUUKaA7B-xgKw": {
    "date": "3/17/2019",
    "text": "La Unica has the BEST mild salsa and chips. Whenever we go the service is short and to the point, but definitely adequate for a Mexican restaurant. I always enjoy the queso and often get it to go. They even deliver now with DoorDash!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOuU1kxKhCmosbNGfg45LQ"
  },
  "fpZHBKFlwz_olijmlWcBDw": {
    "date": "7/14/2018",
    "text": "By far the best Mexican food we've found in the Charlotte area! So, so happy to have tried this place! Maybe not quite as good as some places on the West Coast-- but this is seriously a gem! We tried every meat and would recommend them all! My favorites were the chicken and pastor. My husband loved the carnitas. Besides the chips and salsa that came with the table, we split six tacos and at about $2/taco it was cheaper than it would have been for two meals at chipotle. Service was super nice and friendly-- asked our names and were so kind when our son spilled rice on the floor. We will for sure be back with more recommendations!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IouKfHHIaHsxLMc51DbiMQ"
  },
  "L4P9KAo7h0Lq8cXYYZV_Lw": {
    "date": "2/11/2019",
    "text": "Great food, clean, quick service, and finally finally finally finally FINALLY, alcohol!!!! Rita's, cerveza, etc...( They finally found out prohibition is over ) definitely suggest the Pastor taco and enchiladas, and much more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9VPf-lrRNqkkEZ1ZqM8xw"
  },
  "hVvkb4Xg5oyNGiTArwFHCw": {
    "date": "10/1/2018",
    "text": "Meh, used to be soooo much better. The food is average and the service is terrible. We've eaten here plenty over the years,and it keeps going downhill.  On this last occasion, we received our drinks after we got our food.  Zero stops by the waitress until it was time for the bill, it was actually handed to me as I was waiting at the register to pay.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eN12VACxEYX7OsPRz_yzVA"
  },
  "w1IhOLEp2u-EDjiZmHQuvw": {
    "date": "2/20/2018",
    "text": "BEWARE IF YOU'RE GETTING A TAKE OUT!!  I ordered 4 soft tacos without the chips.  I asked for extra salsa, 1 ea of hot and mild salsa since I like to mix them.  I get there to pick up the order and after arriving back at home they gave me two bags of chips (which I didn't want), 4 tacos and ONLY 1oz of HOT salsa.  After going back to the restaurant to correct their mistake, they wanted to charge me 2 bucks.  I couldn't believe it!  I paid them two bucks and said I'd never be back.    It's a shame because they're a great restaurant; however, when ordering take outs, they've not a clue.  They're willing to let a good customer drive 15 min back to correct THEIR mistake and still charge them 2 bucks for what was asked for originally. So beware when you order a take out!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyzdMd_5S17ptymAfuXvMg"
  },
  "tm0VUvtRKGCLrmdbbJxfPQ": {
    "date": "5/8/2018",
    "text": "Probably my go to for Mexican eats as it is close, fast and always clean. Having eaten Mexican in El Paso,  San Antonio Tx and several places in California, I can say this is on par with those experiences. IMHO Best and most authentic tacos - pastor, Barbacoa, and carnitas served with a grilled jalapeno and a grilled onion.  Salsa is tasty enough - Which like Italian, i guess it depends on what you like. Best pastor I have ever eaten.  Beans are too runny for my taste. Camerones al chipotle is an interesting dish though the shrimp are routinely cooked a little too long. Mole de Puerco and Pollo con Mole are probably my two main courses. Pretty tasty mole.     Just recently got a liquor license serving beer and margaritas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kd4mh5M76AYIug6Ozrt8Uw"
  },
  "KDAPt-bZyP8cSbDTkfUHSQ": {
    "date": "3/19/2019",
    "text": "Food: Not authentic at all like they claim (for those that say the food is authentic idk what yall be eating) but its still ehh okay.   I called in for a take out order. Had to explain my order to the girl 6 times if not more. At this point my patience is very little to nothing. I get there she repeats my order but skips two plates i had ordered. I ask her if she didn't put the orders in & she rudely replies to me saying \"I did I just told you what I have on here i did mention it.\" I told her that she didn't or else i would be standing there asking for the two missing orders & to repeat what was on my order. She repeats my order & im just standing there pissed af! So i tell her \"you see how now that you repeated my order you took longer? That's because now you said the whole thing now before i pay you i want to check my order because I have a feeling my order is completely wrong.\" Sure enough everything I had ordered was wrong but not because the people that cooked it but because of her not writing down my order right even though i repeated myself numerous times.  Check your food before leaving the place. Because they will lie to you saying they checked it when they didn't & when you get home everything is wrong. Sometimes they don't even know their own plates. So be sure you got what you ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvPgyVPzWr_Vhj7ADPOJow"
  },
  "NmL63kS7sBszIUX3E1q14A": {
    "date": "11/27/2018",
    "text": "Best Mexican restaurant in the Metrolina area.  Try it and find out first hand what an amazing experience this is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hl1Uo1pH7YVYm3tDMVkl-w"
  },
  "lfzHhVgiSVK4jl4WPUPoUQ": {
    "date": "3/11/2018",
    "text": "Everything is authentic from the decoration to the patrons, servers, music and most importantly the food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ooBFoFCzS_PaRT_zBAj8ow",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ooBFoFCzS_PaRT_zBAj8ow/o.jpg"
      },
      {
        "img_id": "2bOyxIxTjSeia-UJPelHSg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2bOyxIxTjSeia-UJPelHSg/o.jpg"
      },
      {
        "img_id": "R6_CzzIaYF18UqNa7ruC2A",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R6_CzzIaYF18UqNa7ruC2A/o.jpg"
      }
    ],
    "user_id": "vR9kQOLb38rQz3JBesoWVg"
  },
  "LhnhEssfQJ1MOr9BBdV1Uw": {
    "date": "4/27/2018",
    "text": "Ahhh I love this place. We have been here about 10 times and I had to write them a review now that I'm a yelp user. They are always nice when you come in and their place is bigger than before. Their kitchen always comes out to be the same, I usually order the chicken soup which comes with a quesadilla. The chicken soup consists of chicken broth and a lot of veggies, such as carrots, peppers, very healthy meal and a huge portion too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FffRNoujpQv-1Vjbws8ig"
  },
  "6LoihOlcymMSzIVU7uNefQ": {
    "date": "4/21/2017",
    "text": "I have been enjoying this La Unica location for nearly a decade, and I can safely say it's ruined other Mexican restaurants for me. Nowhere else measures up!  Even during busy hours, I've never had to wait more than five minutes to be seated, no matter the size of my party.   Chips and salsa are delivered right away. I love the mild salsa; the flavor is so good! The chips are served fresh and often still hot. There's a note in he menu that says your first basket of chips is complementary, but additional baskets will be added to your bill. I really think that's just reserved for asshole customers; I've never seen chips on my check unless I've ordered them to go.   The menu, as noted in other reviews, is extensive. I find myself ordering the same handful of dishes over and over (they're so good!) but it would be easy to try something new every time you visit. There's something for everyone, from Tex-Mex to super authentic.   Once your order is in, hot plates are dropped off at lightning speed. My order has always been correct and served at the right temperature. My favorite dish is the chilaquiles, and I've tried all the fajita combinations. And the rice is always perfect.   La Unica is quick, inexpensive, and delicious. I can't imagine why anyone wouldn't enjoy their time here. And seriously, if you have major beef that they don't serve booze, that's a you problem. This place is a gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MMku_YuzfIN4ZQz4GpUloQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. #10 lunch: three tacos, rice, and beans.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MMku_YuzfIN4ZQz4GpUloQ/o.jpg"
      },
      {
        "img_id": "1cg9bKaA-hvid1KKkyeLNQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Vegetarian fajitas, rice, and beans. Perfect for a lighter lunch.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1cg9bKaA-hvid1KKkyeLNQ/o.jpg"
      },
      {
        "img_id": "0cWLjcwzzU28t070-4zqgA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0cWLjcwzzU28t070-4zqgA/o.jpg"
      }
    ],
    "user_id": "0EgbVtQfdNQq3Tapxwl_sw"
  },
  "QvGUgDTxifpPa4hLNLHC4w": {
    "date": "4/12/2018",
    "text": "This is my FAVORITE Mexican restaurant . The food usually comes very fast and is delicious. The salsa is also Great!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f3YJyKX3FiaAriO3SP_7Ag"
  },
  "kJrVpX3V5b8RpljS0DN5Lw": {
    "date": "10/26/2018",
    "text": "If I could marry a Mexican restaurant, La Unica would be my bride. I have sampled widely from the deep menu selection and have yet to find a dish that left me dissatisfied. Many guests I have brought to the Un. Many guests were also deeply satisfied. Even my picky kids clean their plates here. The chips are fresh and hot. Nom nom. The salsa is made fresh in house with a recipe handed down from God. It's delightful. The queso gives me the same feeling I get when getting into bed after washing the sheets. It's one of a kind and soothes your soul.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k79vUxQyHdAi2UIdvcX9dA"
  },
  "1N3Wg7Nt0Kst3QE4F4AGOw": {
    "date": "8/5/2018",
    "text": "Came here based on a friend's recommendation. It's an authentic Mexican place which is awesome. They start you off with chips and two salsas - a mild and a spicier one. I didn't care too much for the mild one but loved the spicy one, even if I finished my glass of water before the meal even came. I ordered the chicken fajitas because I saw a couple served while I was trying to decide what to order and they emerged good, but it's my usual go-to anyway. I thought they were great. It came with rice, refried beans, lettuce, tomato, sour cream, and choice of 3 corn/flour tortillas. Even after eating 3, I still had enough for leftovers so it's a great value for what you're getting. Hubby got the burrito tijuana but wasn't crazy about it because he said it seemed a bit bland. Next on my list to try are the tacos which looked really good or the quesadillas which are another one of my go-tos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovn-Fw1nuh0Ba4XKENI4KA"
  },
  "fJ9hiNPSk5Nre355CvMPKw": {
    "date": "12/18/2016",
    "text": "Quick! Quick! Quick!  I came in by myself and I sat down and ordered four tacos, water and lime, and a side of cheese and within four minutes it was back to me within 15 minutes I was paying, out the door. I wasn't complaining because I was in such a rush but it would've been better if I could've had at least a dos eqius just sip on second slow myself down.   The Tacos de Carnitas were pretty good but super greasy but hit the spot.  I probably won't return because it so far from home and there's no alcohol. I truly enjoy by tacos more when a beer is in hand. However, this place seems great for large parties and very family friendly!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "0bQdh3MkOJiU05YteGzb-Q"
  },
  "mBvsvhUQyF0k43pyE1QmJg": {
    "date": "2/28/2019",
    "text": "The absolute best Mexican food in the entire Charlotte area. Ever time my friends and family come to town they insist on eating there , but no one had to twist my arm. If my wife or kids ask me where I want to go it's always La Unica! The manager always comes by to check on us; the service is great!! In fact they recently expanded because they were so busy! I can't wait to go back. My favorite is \"The No Name Platter.\"",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vR-Glcb9kYQYLHqSgCTCOg"
  },
  "fOeomnK7gc_tDFoNKZRz5Q": {
    "date": "2/7/2019",
    "text": "Great place to eat ! \"Not named dinner\" was fantastic. Daughter had fish tacos which are a family favorite and wife had chicken fajitas and outstanding. Always love La Unica !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ucGx9LfMOkYk_-XvN3VyQ"
  },
  "v2L8pYATiQEvPZnnUXJkoA": {
    "date": "12/27/2018",
    "text": "I am from Indian Trail and now live in Tampa, FL. I specifically make time to go to this restaurant every time I am back home visiting my parents because it is the best Mexican food I have ever eaten. Spicy food is my thing and their salsa verde is my favorite food from any restaurant. I also always get the carnitas and lengua tacos every time I go here. 5+ stars for sure. Wish they had one in Florida.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMqPSN8XzZC_Ey7kF901hg"
  },
  "D3vyWHXjmjwY8pDUJ_Az7Q": {
    "date": "6/2/2018",
    "text": "My favorite local restaurant. Food is consistently good. We eat here multiple times each week. Gotta try it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HL4Iq76dwCLUQwIgEW2J_g"
  },
  "fW_og4v53XhfJn6ap6IQ9g": {
    "date": "3/14/2014",
    "text": "Amazing and authentic. Super clean. Efficient and friendly service. One of the best Mexican food places I've eaten at. Highly recommend it. Best of all, inexpensive! A great value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YAM-GAyz5Hjsbel_wLtsww"
  },
  "LwfdGNuLQrwFD8Wdx5LqQA": {
    "date": "11/22/2013",
    "text": "This is authentic Mexican and it's as good as it gets. My favorite Mexican restaurant in Charlotte (Indian Trail). Try all the different sauces with the complimentary chips so good and spicy. Their 'street tacos' are amazing. Three tacos are really more than enough. Very filling. The restaurant was recently renovated so can accommodate the regular crowds even better. Expect a wait if your going during peak lunch/dinner hours. Super nice staff that is generally attentive. If you haven't been and love Mexican food, this is a must try location.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HG_-DYGnFv3QwnFtB3GVAg"
  },
  "o6f0nPmaakMMpxnKQb3eJw": {
    "date": "8/8/2015",
    "text": "Of the many Mexican restaurants around to choose from, this is definitely the best. I've never had a meal from La Unica that I didn't enjoy. Lately I've been on a taco kick - I love their shredded beef tacos & their carne asada tacos - authentic with cilantro & onion on soft corn tortillas. They also have some of the best horchata.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z_xX4PNF_FCzaCoXFG8pyA"
  },
  "dfhzXzQ3dhfEnR8SHp5NPA": {
    "date": "2/7/2013",
    "text": "THE WORST MEXICAN FOOD!!! AND SERVICE!!!! 1st and last time there. Food was horrific . Rice had to much garlic or condiment and texture was nasty. It seems like they have the dishes ready , but sitting under a hot lamp. Every dish we ordered had no taste/or to much.  My son didn't even touch his burrito. What a waste!!! Horrible, Horrible. I get upset because being Mexican/American we can do much better. These people just got lucky they have a crowd !!! Really NC there are better REAL MEXICAN PLACES (AZTECA) is the place. Good luck!!!!",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6flPs_bKYC43KXq63OiHeA"
  },
  "r1bBOAULsx-i2AktA177pQ": {
    "date": "9/21/2013",
    "text": "My wife and our daughter have been here many times and every time we are amazed by how nice the people are, how quickly we get our food and how fantastic that food is. They have TE best tacos I have ever eaten. It's not really worth making them at home once you've had their tacos. There may be a lot of people there but the change over is quick and you never have to wait more than a few minutes. They do a great job and you can't go wrong.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LP9j1YqgWPJGw1zY_LRuzg"
  },
  "-Xg9Q1N-BULJr4_Kk8B_Bw": {
    "date": "5/8/2014",
    "text": "The BEST mexican food on this planet!!  Our favorite.....their rendition of salsa verde!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THTrPBdb7s5_NCDIeIB06Q"
  },
  "P3SM5TC1SGib2pvvp6GhNQ": {
    "date": "4/23/2016",
    "text": "The very best food. I have been eating at la unica since they opened. Delicious food and great hospitality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X3wIfyxtZN1GTSF7HJiXxQ"
  },
  "UCFU9_Wn4pUT34AJESoiDw": {
    "date": "12/30/2015",
    "text": "Great Mexican food with authentic cuisine was definitely impressed by the atmosphere a top place to go when visiting Indian trail",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIqENP8MSWUaaN78usHnOA"
  },
  "APei-jDffIL2NHtJpt4PFw": {
    "date": "9/28/2013",
    "text": "Very good Mexican food in a very unexpected location.  The restaurant is a bit cramped and always busy.  I've never had a bad dinner here and my GF and I eat here once a month for over a  year now.  The food is always quick and very tasty.  Skip the hot salsa for the chips....too overpowering.  This place is like Azteca minus all the cheesy props and Mariachi band.  The staff is always friendly and will go out of their way to make you happy if the dish you ordered isn't exactly what you thought it would be.  This place is our \"old reliable\" when we can't decide where to eat out....we default here.  Yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlX5pM_u-v57KErnTTNMAQ"
  },
  "847xks4CuBtmGExxsJPYFQ": {
    "date": "12/25/2010",
    "text": "Okay so this is another place that I would have never walked into but so glad I did. My sisters live close and took me once and now I have to stop by every time I am out that way.   There always seems to be a little bit of a wait, usually around 20 minutes, but definitely worth it. Once you are seated they serve you pretty quickly. This place is small and it's always packed. Their food is the best! They bring you chips and different salsas to start. If you aren't afraid of spicy food ask them for the avocado salsa; its a green salsa that is usually made super hot but can be tamed when mixed with their other salsas. Their chips are always hot and taste fresh like their dishes. I usually get anything with Carne Asada because they make it better than anywhere else.   I wish they had a full bar because a good mojito would make this place perfect :)!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dt1lyscFrlqW89CTB71IOw"
  },
  "QIJ0BUmorDJLHIxK7Fdtng": {
    "date": "3/5/2014",
    "text": "Great place for a quick authentic meal. The place is a Mexican blue plate. Atmosphere has improved since the last time we ate here but still not the kind of place to impress a date or stop in for a beer because they don't sell it but the food and staff are great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CX3bu76oIZRGazxlj2Xbjw"
  },
  "idnaEpRuSe_g4IqhHrEHjA": {
    "date": "6/7/2014",
    "text": "Our go-to lunch place if I can get out of the office long enough to sit down for 30-45 minutes for lunch. Always packed, especially at lunch, but the service is incredible and they turn over tables quickly. Recently renovated and expanded to offer more tables. The chips are always fresh and hot, they give you two kinds of salsa by default, and you can even ask for the spicier one for free. The queso dip and guacamole are great, although the queso is pricy. I think you get what you pay for, though, so that's not a complaint!  The quesadilla and burrito Mexicano are my go-tos, because they have a yummy, fresh tomatillo verde sauce. But I love the pollo fundido also, and the taco salad. The horchada is also refreshing!  A very well-run place with friendly, fast and accommodating service and high quality Mexican flavors. A favorite for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2fPRjn49S3MQTfvLZhvZA"
  },
  "xvJmKsiyGi0mq_nXMdEBtA": {
    "date": "10/1/2015",
    "text": "I grew up in Arizona and have lived in Mexico, so I grew up on real deal Mexican food. That being said, Taqueria La Unica is where I go for the food I grew up on, my \"soul food\" if you will. Their \"authentic\" tacos are just like the El Chino taco stand I used to love on the beach in Puerto Penasco. They have 5 or 6 different kinds at La Unica. Everything I've ever had is A++. When I take my Dad he gets what I call \"Gringo-Mex\" dishes like the \"Speedy Gonzales\" or one of their Chimichangas. But literally EVERYTHING is good. I would especially recommend the Carnitas dinner and the Ceviche. They do both of these dishes as well as anybody. Breakfast is KILLER, try a burrito. My wife loves their shrimp plates and fajitas. My little girl (7yo) LOVES the enchiladas. The prices are more than reasonable. If you like avocado, make sure you ask for some of their avocado salsa when they bring out the mild and hot with the chips. If I ever have to eat Mexican food anywhere else in Charlotte-Metro, it never measures up to La Unica. You might have to wait to be seated, but they are fast and it's SO worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KhaZt5rRtBj0Z8k2SSp2ow"
  },
  "l97liJyrsnVKeN1ywKdr9g": {
    "date": "9/5/2013",
    "text": "This place rocks! The food is consistently great as is the service. We've never had a bad dining experience. Very reasonable prices. Go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OoZcKpTe0KOkWY-wSbRQ2w"
  },
  "xL4mULPhUVn2NL2RZhb9Jg": {
    "date": "8/11/2014",
    "text": "The best Mexican food I've ever had...period.  Salsas and queso make it an over the top experience.  A must have if you live in or around Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DCwZn2TrxI0--aARNCQBhA"
  },
  "z3YIV3GzLKTZrV8CTg4PMg": {
    "date": "1/2/2016",
    "text": "My family loves this place.  We have been eating here for over ten years!  Great food and even better people.  We love the Crazy Burrito and Soft Tacos a la unica style.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZNf-EYgx88OXMmgxoTXBQ"
  },
  "f5VYi58MRg8cGkjmLtGDqg": {
    "date": "10/14/2015",
    "text": "We had read really amazing things about the food here but it was just so-so and overpriced at that. We had the no name dinner and the chicken fajitas. Overall, we just felt the price didn't reflect the quality of the dishes. The service was very good and fast.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FurozVdX1flxQV8A358p_A"
  },
  "k0_h2t4YCtxPZFUVarFesw": {
    "date": "8/24/2012",
    "text": "The chips and salsa are very good. The tacos are served with just the right portion of cilantro....muy bien! Beware the grilled jalepenos. They start off sweet but will set all but the most experienced ablaze!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UevMR866WiiPCwqviRsdsQ"
  },
  "gh_EzL4_q2PvllsoFk_Gmg": {
    "date": "7/10/2013",
    "text": "Food was great! The carne con nopales was exactly like my mother in law makes and the barbacoa tacos were delicious. The kids menu is lacking though, my daughter loved the frijoles y arroz however I've tried better ground beef tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahIrbRtptkwDfH040aqjlg"
  },
  "kYaQ1Xn66U_n7nZZ0tp_rg": {
    "date": "11/18/2015",
    "text": "I can't understand why this restaurant has such good reviews.  First of all if a Mexican restaurant doesn't have good salsa, run . . . which is what I wish I had done. The salsa tasted like chili out of a can - the hot was dark and the mild was red, which proves it is canned salsa because the hot would have been red too if it had been homemade.  I ordered a shrimp chimichanga and it was small.  The shrimp were cut in small pieces and actually looked like chicken and they charged me $1,50 more than the chicken & beef chimichangas on the menu.    I think I will stick with Mi Pueblo in Matthews where their salsa is homemade and the shrimp chimichanga has full size shrimp inside and the chimichanga is big.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mv0ekV5qJb0YRMI_XmQj1Q"
  },
  "MaEjFIP5sX55ZqJKeCD2Kw": {
    "date": "8/18/2019",
    "text": "At one point during the consumption of this meal, my daughter asked me, \"Mom, why are you giving me the flirty eye?\"  I said, \"Sorry. That was for the food.\"  Let me tell you something. I'm a California transplant. I grew up on Mexican food. I know what's up with Mexican food.   Here's what's up. La Unica. It's delicious, in that 'make flirty eyes at your enchilada' way.   Get the No Name Platter. It's seafood so you can tell yourself you're eating healthy. Plus it comes with avocado, that's a superfood (right?).   Sit and eat and flirt with your food. It's beautiful and deserves the attention.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "te1EMNcqvSdXYjg1dJ6P1A",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Avocado that comes with the No Name Platter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/te1EMNcqvSdXYjg1dJ6P1A/o.jpg"
      },
      {
        "img_id": "bUDF46wQaI50M-bkw5zuWA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bUDF46wQaI50M-bkw5zuWA/o.jpg"
      },
      {
        "img_id": "BGEWrOB_KleV3iC_UCCNRg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Asada Quesadilla",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BGEWrOB_KleV3iC_UCCNRg/o.jpg"
      }
    ],
    "user_id": "taHuVRFi8NPNHP6VQYZgfg"
  },
  "oJADBHJfAoQa0nzXLnF2pA": {
    "date": "7/4/2019",
    "text": "Fantastic Mexican food. I'm from New York and we have only one place that comes close to this. The ground beef is perfectly seasoned and the free chips were warm with plentiful salsa.  Its definitely worth going. The curb appeal of the place shouldn't even be considered when choosing to come here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-1ecRuDh3fIcEZLA3aq4g"
  },
  "vjT7cxVUW3B4JOVgYGWOeQ": {
    "date": "5/14/2019",
    "text": "We stopped in from work for a quick lunch, and this place was mobbed,- a good sign. The staff was hustling, and very friendly to boot.  I saw a platter of fajitas going by, and I knew what I was having. And, as expected, they were great. My buddy had shrimp and rice in a habanero sauce that looked great, and he said is was!  I'll be back soon. Good place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvW72VWdF6X59pK-MN-CIg"
  },
  "JcpTHajzimp8AT8kk7Ghzg": {
    "date": "4/26/2019",
    "text": "The best Mexican food around Charlotte. Thank you for adding beer and margaritas! They have expanded. That's good and bad. I liked the smaller feel when we knew most of the employees. Now we don't get that same family feel. But still number one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC2sg6Z5nkaMeiKC6_5Hzw"
  },
  "xXYOg0trMmt3PjDuPe7EnQ": {
    "date": "11/30/2018",
    "text": "Had a late dinner at this popular Tex-Mex joint tonight (Friday) and had a great overall experience. Until now my only other experience here was a very unsatisfying lunch so it was due for a follow up.  We went simple and just ordered combos with enchilada, burrito, rice and beans for $8.79.  They were loaded with delicious shredded chicken and the sides were also nicely prepared. We also ordered a side of very savory queso for $5.99.  Or server was exceptional, in fact, servers were hustling throughout the entire place.  Sanitation score was an impressive 97.5. There were few flaws on this visit. Will be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "8Y5OUJ-QTOrMv8GWO_oU3g": {
    "date": "8/16/2019",
    "text": "If I could leave a zero stars review I would.  Two separate horrible experiences that have completely turned me off to a delicious restaurant.    1). In June I went to eat her an hour and 45 minutes before their closing time.  I was told that they weren't going to seat me because they wanted to close early, with a full dining room.    2).  My fiance and made the mistake of giving them another chance.  Upon our arrival, we were seated and given cheese dip, chips and salsa. Mind, we did NOT order cheese dip. At other locations they often include free cheese, and we knew they never had at this location.  Looked to every table and as soon as each was filled cheese dip was delivered, not Requested.  When it showed up on our bill we were confused, as neither of us had asked for it.  Upon talking to the wait staff they lied and said we and everyone else \"always order cheese dips\".  I should not be paying for what I do not order.  The food is good, but employees and management are crooked.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DafS0L-_uOFR87BxI3Tcug"
  },
  "D08HzKpaIg08sdIKwFJnug": {
    "date": "10/8/2018",
    "text": "My parents used to come here all the time, but it has been a while. I decided to stop in around 5 on a Sunday. When we got there, only a few people were eating inside, but that changed quickly. By the time we left it was a full house. The food was good, it's always quick and delicious. Service was alright, sometimes we waited for a while (even before it was busy), but overall it wasn't bad. We got nachos as an appetizer and I got the no name dinner, which has 2 seafood enchiladas and an avocado delight. I'm not sure I would order it again, the enchiladas were okay just not what I wanted and the avocado still had a sticker on it... I was not thrilled with that. We got Micheladas as well (because that's my favorite drink), and they were pretty good.   Good place, just some missteps.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1EME1vpGnCrWO3Eehi3Qqw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Chimichanga",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1EME1vpGnCrWO3Eehi3Qqw/o.jpg"
      },
      {
        "img_id": "1k04cATUsuKaG7gbugTsMg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. No name dinner.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1k04cATUsuKaG7gbugTsMg/o.jpg"
      },
      {
        "img_id": "jZbO8EaxzZcBNG-wPXCg5A",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Sticker still on my avocado...not cool...",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jZbO8EaxzZcBNG-wPXCg5A/o.jpg"
      }
    ],
    "user_id": "PQhb8JJu7Iyz7eIEspFu1Q"
  },
  "d4rvm4oRXW1xm4Qv14XPLA": {
    "date": "7/30/2019",
    "text": "Was very impressed over the quality and freshness of this place. Food was very good. I had the fajitas and my husband has tacos. We both loved our meals. My son likes this place too. The service was on point and very nice. Looking forward to having it again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FR2QwdF_eAXdwJJtqyLbQQ"
  },
  "4QE9u8Sa1aq0ifUjB7R3Bg": {
    "date": "1/1/2019",
    "text": "Came here for a quick bite for lunch. I ordered the chalupa with a side of guacamole. The food was very delicious and you can tell that it was authentic. The guacamole had a lime taste to it which was very good. The food came out quick and was very good. I would recommend this place for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g5wgr3c51b_zLcwlAZX4iw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g5wgr3c51b_zLcwlAZX4iw/o.jpg"
      },
      {
        "img_id": "gW8REiasC97GVdDkniMXkA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gW8REiasC97GVdDkniMXkA/o.jpg"
      }
    ],
    "user_id": "VX7ZafplsYLWKfmQFmU_Jw"
  },
  "We8smyn3st0cZJ3xjiN5Ow": {
    "date": "12/14/2018",
    "text": "Always a favorite of our family's. Execellent food with great service to along with it.  Great lunch specials tha last till 3pm everyday.  Today I had the Chicken soup and quesadillas.  Very generous portion and likely the best chicken soup I've had, perfect on a cold rainy day.  Bottomless chips and salsa is always a welcomed treat.  If you haven't been here, you should.  Make it a regular dining out choice like we do!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U71g1EIo1jLvJLj1xoj3zA"
  },
  "CNVWuxN8yUFETr02l04hxA": {
    "date": "7/13/2019",
    "text": "Best Mexican food we've had since we moved to Charlotte (not counting a taco truck).   Let me explain. It was edible. Asada was a little on the bland side. They put lettuce in the burrito (who does that??). The salsa was very mild. My husband said his burrito was salty.  But I'm starting to understand that everything in North Carolina is bland, flavorless and lacks character. So when I lower my expectations to North Carolina Mexican food standards, it was pretty good. If you use California mexican food standards, it was mediocre at best. To be clear, my 4 star rating is based on North Carolina standards.   Service was excellent, parking was easy, food came out quickly, pricing was reasonable and the restaurant was clean.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4I6yWOPBNifW1q6dYQBd7Q"
  },
  "gwahk8o-OUkVIWhLYwwWcg": {
    "date": "3/3/2018",
    "text": "We decided to visit this restaurant after reading about it on Yelp. Boy, were we disappointed!   Restaurant is located in a strip mall, nothing fancy nor dressy establishment.  Parking lot is small so parking can be an issue.   We were seating fairly quickly but made to think that we had to speed walk to our table by the hostess.  She was in a hurry although no one was waiting for a table when we arrived.  The waiter came over and took our drink order.   We Ordered our food and it came out quickly.  Salsa and chips were good. Cheese dip was too runny and semi warm.   Our Waiter was very courteous and friendly which is the ONLY reason that I've given it this restaurant two stars.  The food was the biggest disappointment ever!  I ordered a combination plate with three tacos, rice and beans.  My tacos were salty and I would've been better off going through the drive thru at Taco Bell.  The rice was hard and the beans were luke warm at best.   Everyone in my party was disappointed with their food and we could not figure out what the fuss about this place was all about.  When we left, to my surprise the line was out the door for people waiting for their table.   Moreover, if you're craving a frozen margarita with salt on the rim of the glass - don't bother.  They don't have a alcohol license, so they don't serve any adult beverages.   I don't think that I will ever be back to this restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QiBofM7hsG2uPrgbbMcOBw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Combination player- three tacos with rice and beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QiBofM7hsG2uPrgbbMcOBw/o.jpg"
      },
      {
        "img_id": "T5YDPAb4ciVUqqPEBmvZrw",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. The wait for a table on a Friday night",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T5YDPAb4ciVUqqPEBmvZrw/o.jpg"
      },
      {
        "img_id": "m4eWLETpbAtuuC5F2Qkbow",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m4eWLETpbAtuuC5F2Qkbow/o.jpg"
      }
    ],
    "user_id": "8EVCarfyVLP14hlS4HVk1w"
  },
  "PzpUBy5JdDR4XZr6uXLA1Q": {
    "date": "5/26/2019",
    "text": "I want to like La Unica because the atmosphere and service is good, but I'm not a fan of white America cheese and that's what they use. I forget, go and then am disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p3N5p9NK2lcBornOHQngQA"
  },
  "I2I5nPYFDfAz8CNBfjzrjQ": {
    "date": "5/23/2019",
    "text": "Best damn Mexican American food in town! I go out of my way to Monroe just to get this food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Md_RKuKRMFZM7EJiJydhhw"
  },
  "5mSNSYhyx1F1b6e-zGsJLg": {
    "date": "2/9/2019",
    "text": "Ok, the food is good, but save your money and DO NOT order their margaritas. I just had 2 and they must have been virgin margaritas since I couldn't taste any tequila at all!   $7.00 each for what amounts to a salted rim glass of mixer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8okt1nl-g2RL3ylWoqj4tA"
  },
  "BqDijhWTZbOpB8f0Cf6a7w": {
    "date": "2/5/2019",
    "text": "I honestly do not know what the big hype is about this place. We found the food to be \"okay\". They claim to be \"authentic\", but maybe that's another way of describing how much cheese they use. I've been to different parts of Mexico, so I would beg to differ on the term.  Regardless, service was fast, but not personable. Ambience is similar to a fast-food restaurant with bright lighting and cafeteria style tables and dining.   It was a so-so experience, and food is cheap.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TsKeGaVVmS2lS6bks5ZLw"
  },
  "Q4e3vtOcuHeWSj4lSIGQug": {
    "date": "8/2/2019",
    "text": "stopped in shortly after they opened with a friend yesterday for a lunch date. i had the arroz con pollo and cheese dip and my friend had a steak burrito and cheese dip. our server was friendly and helpful. overall, the price was too high for the quality. the food was good but just not worth the price in my opinion. aside from the price, id recommend this restaurant to others. if you're looking for an authentic Mexican experience then this is a pretty good place to find it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x87YOOro5qXad9uYqxqjrQ"
  },
  "kCf1idwQQmPjEHIpYageAQ": {
    "date": "12/22/2018",
    "text": "Had not been here in a couple of years. Was seated fast on a Friday nite and the place was busy.  Food came out quick and just like we ordered.  Was hot and fresh and very good. Only reason I didn't give it a five star was because the waiter seemed to have an attitude about something. Not towards us,but you could tell something was wrong.  Still had good service. Left my 20% maybe that will cheer them up a bit. We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZEiKMt8OaVEdJbHfGXjfSw"
  },
  "XXbCxR0HbQVWKRBqaip7MA": {
    "date": "8/25/2018",
    "text": "I decided to try La Unica again and I'm really glad I did. They have stepped up since my last visit 2 years ago!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qhJwMa2m6wXubqEaeKQVwA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Side Rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qhJwMa2m6wXubqEaeKQVwA/o.jpg"
      },
      {
        "img_id": "xlt_zh2vbMF1aS_vnVOs7w",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Tajuna Taco Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xlt_zh2vbMF1aS_vnVOs7w/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "wNM7UTRcwct8Y6tqMiuD6Q": {
    "date": "3/30/2019",
    "text": "Really good authentic Mexican food! Great prices too. If you're in Indian Trail stop in and give it a try. Come early because it gets crowed fast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vms347Z3O3o2zcYD38zTiQ"
  },
  "U6CXzHwGKvOkDvT9g7ZpHg": {
    "date": "1/30/2014",
    "text": "Thank you to all of the Yelp reviewers whose enthusiasm convinced me to try La Unica. Had lunch there today with my hubby. It was exactly what we have been looking for, for nearly 10 years, since moving to Charlotte from Texas. Authentic, fresh Mexican food (without the fuss).   The menu is extensive and includes a varied lunch menu for quick lunch service, as well as a full menu that has me already planning my next trip. I can't wait to try their 7 fish stew (I passed someone having a bowl of it on my way in). Today, I ordered the Tacos de Asada, because I figured the best way to know if they're legit is to try the Carne Asada... And I was NOT disappointed. The tacos were served on a double-stack of the BEST corn tortillas I've had since Texas, and were filled with the perfect amount of seasoned, chopped carne asada meat. They were served with fresh onions and cilantro over the top, as well as (get this) a whole fire-roasted jalapeno and onion. HEAVENLY. The refried beans were very good, not the typical sludge you get in other places. The Spanish rice was flavorful and moist, and made a delicious complement to the dish. I added a touch of their house-made hot salsa (chunky-style with heat!) to the top, squeezed a touch of fresh lime, rolled it up, and savored every last bite.   I was especially impressed with their seafood selections, too many to name, except to mention that every Latino I passed in the restaurant had a seafood dish and looked happy as can be. Next time, I'm gonna pull the, \"I'll have what he's having\" routine.   As someone who can't have dairy, I greatly appreciated that there were many options on the menu that weren't queso-laden, sour cream-covered globs of meat and cheese. I do wish I had seen a few more vegetarian options on the menu, which is the only improvement I can note at this time.  My next trip to La Unica will be at a time that I can enjoy a margarita, and I will be sure to report back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "swUxTfJ96XZJ0ufmljJiXQ"
  },
  "NuySRvlM0LI9VdvzOR8wag": {
    "date": "3/5/2014",
    "text": "We stopped by the restaurant for lunch around noon on a Thursday to find this place stuffed to the rafters. I can't say I have ever seen a lunch place  as packed as this, except maybe Roosters on a Friday. There were a lot of Hispanic folks which really spoke to the authenticity of the place. We were given a booth in the back (it is surprisingly large in there - like the Tardis) and two large menus by a man who seemed almost comical in his \"very tired of the day and of his job\" air. I almost felt bad for the poor guy. The menu did a good job of presenting itself as authentic while still allowing for explanations of what each dish was comprised of for gringos like us.  Mine was essentially a deep fried burrito, filled with #4 spiciness ground hamburger, with a pile of lettuce shavings, some tomato, one plop of sour cream, a wee bit of beans and a queso poured over the top which, unfortunately, ruined the fried crispness. My husband had the enchilada. This was one of those circumstances where we had all the same ingredients, just folded differently, that happens in American Mexican restaurants now and then. Also, the salsas they brought out (without explanation): 2 cute milk bottles. One had nothing but pure red and the other was a chunky, garden-style salsa. We needed to experiment to see what was hot (the red) but they wisely brought out three little bowls so we had one for each salsa and one for a mix of the two. These were either a 2 on the a hot Scale or an 8 so mixing is wise. The bill was something like $17. Overall, this was really good. I think it is a matter of finding your favorite dish and they'll probably do that one spectacularly. Once they ditch that queso....stuff.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gl2y6Ll00_RJ56CfNK5j8g"
  },
  "GDb34NMYym2ATrCz8v4_Pw": {
    "date": "8/28/2012",
    "text": "This place falls into a wonderful category: The hole-in-the-wall excellence. On the edge of a shopping mall in Indian Trail, this place looks unobtrusive but friendly. The menu puts the next smile on your face with its cheap prices. When it came out, a lot of the food looked a lot like that at other decent Mexican places like this, but when I tasted it, it was so much better! Beware of hot sauces/dishes though, they really mean it there. The staff is very friendly.  This is a place for a simple, middle-of-the-week meal out that will make your wallet and your tastebuds happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "up-mcezRNykPU1RvfNFt0w"
  },
  "JaRoV40VAMFcZYUhGHjo_w": {
    "date": "6/6/2015",
    "text": "Amazing; I go here often but my mother who is in town infrequently requests to go here every time she makes the trip.  My two year old loves the rice and beans.  The service to the fresh salsas are amazing.   They have had to expand three times in the last five years.  That speaks for itself!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRztDRQIRQPkyu2UmLfRgA"
  },
  "Mu-qcSuAV-WoVCEZ4Mp8mQ": {
    "date": "12/28/2014",
    "text": "I have spent time opening facilities in Mexico (DF, Queretaro and Tizayuca) and although I wouldn't rate La Unica on that scale I would say that this is some of the best Mexican food my wife and I have been able to find in the Indian Trail area, it's always fresh, and the service is great.  We order a lot of take out and its always correct which we appreciate so as to not have to come back.  We really enjoy La Unica and glad you are in our neighborhood!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6CA9Ir4HQmc4rrY-KhtD1w"
  },
  "03-Ma1yxy_SLHH569kSHxg": {
    "date": "6/27/2016",
    "text": "BEST TACOS around! I always get the car but as \"traditional\" with diced onions & cilantro and they are fantastic!! I only add some of their yummy salsa & they're perfect! Service is always fast and food is always hot & fresh! When you want tacos this is the only place to go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAWe1yW_nn_S4JQ26YUvfg"
  },
  "B7vdnLtLMG53dPsm4Us-nw": {
    "date": "6/14/2012",
    "text": "This place is a must if I'm ever within striking distance. Clearly I'm not alone in my love and adoration by the other reviews on here.  Three words: Authentic. Carnitas. Tacos. Crazy cheap. Crazy delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "atGKp8rOqzthQomt3O3feA"
  },
  "JBTaN4LU95A0ORMwy_L2lg": {
    "date": "3/24/2015",
    "text": "They recently changed their chips and now they're not even close to being as good as the chips before. Still the best Mexican restaurant in the Charlotte area.  One if my favorite restaurants.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcPC0VYsJOCo0T1uFmWbiA"
  },
  "Jx-L-2TfBsSYOPxg6LOhYw": {
    "date": "9/4/2011",
    "text": "For 8 years I have been meaning to give La Unica a try.  Well, I finally did and I am so disappointed that I waited so long!!!   I went during lunch hours on a Thursday and it was busy, but was able to get a seat right away.  I had a Carnitas Taco and a Chorizo taco and a side of rice.  Everything was fantastic!  I wonder if they make their own Chorizo because it tasted better/fresher than any store-bought Chorizo I have ever tasted.  The chips and salsa were good, but I had to mix the medium and hot to come up with something tolerable for my \"not too hot\" taste.  Prices were great ($1.95 per taco and $1.99 for the rice), service was acceptable, and the food came out quickly.  I can't wait to go back!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vbHlFP0Orx1mM5-uBqzYFg"
  },
  "nGa_k7KulMOd2_MNFfKgLQ": {
    "date": "1/25/2014",
    "text": "I love this place. The food is fast, and the salsa and chips are good. My orders are never complex but I've never had a problem with service.  My only complaint is that they are a Pepsi restaurant (usually that's a deal breaker for me) but they get the food right, fast, and reasonably priced so I overlook it and get a water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IDM0j7kI8NZYGSo-imZEbA"
  },
  "HxkfLN2Q-sk7x8Lj3yxCaQ": {
    "date": "3/27/2014",
    "text": "If they told me the truth, they now have a new restaurant in the clarion hotel on carowinds blvd. across from the park..... delicious!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Df81tgjljCcSZ_DJC01o6A"
  },
  "jYzgXm0GgXBtjxXFoFw-ew": {
    "date": "9/28/2011",
    "text": "This is one of the best Mexican establishments that I have ever visited. I have eaten at La Unica twice (about a year apart). My flight into Charlotte was delayed and, instead of arriving at 4pm, I did not get in until almost 7. But my business associate who picked me up at the airport knew that a visit to La Unica was high on my priority list. He took back roads and got us there by 7:30.  What has struck me about both visits is the fact that this place is packed - both visits on weeknights (a packed restaurant is always a good sign).  The chips and salsa are great and they bring you both mild and hot salsa (I mix the two). I like the burrito combination - one beef and one chicken. The food is very tasty and served piping hot.  It's certainly not fancy. But the quality of the food MORE than makes up for the no-frills atmosphere. The service is very good; maybe not outstanding but certainly at least very good. But, again, it is the food that is the star here.  I thought that I would throw this in: They do accept credit/debit cards but not American Express.  Another visit to La Unica will be high on my to-do list for my next visit to Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "936uGPTn7ZMc2-NK9WtK2Q"
  },
  "qOziJkMjJ_U_UXO7k1EZ3A": {
    "date": "10/15/2013",
    "text": "Re-opened! Can't wait to check out the new expanded restaurant! So good they had to buy out the adjacent lots!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7_ARdKo_GT-gjCSRGErXA"
  },
  "m6rl2Kuxal8ZFzZfW2fsog": {
    "date": "10/19/2013",
    "text": "This is our favorite Mexican joint in town. The food and service is consistently good. The sauces seem to have gotten spicier over time, or so it seems!  Definitely try the green sauce- it's delicious and super spicy at the same time. The wait can seem long at times but its usually no longer than 15 minutes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RbqFoVU-sBSBRX2wppzP1Q"
  },
  "I5erollKql8QJKOVrudfJg": {
    "date": "11/14/2013",
    "text": "Don't go anywhere else for Mexican -- this is the best. We eat here for dinner and lunch with everything simply delicious. Salsa is amazing with both HOT and mild versions. Chips are freshly made and served warm. All menu items are typical Tex Mex -- my favorite is the Arroz con Pollo which you should try...Yum!  Oh by the way the prices are low too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zajHbWG4MHjKhmR95AySDQ"
  },
  "tiO3062BFUS0rmq2dXF5Og": {
    "date": "1/9/2012",
    "text": "La Unica rocks.   The authentic tacos are awesome, there a $1.75...try one if you have never had one.  We almost always get the burrito Tuawana...also their ice tea is perfection mixed 1/2 sweet and 1/2 unsweetened.  Staff is AWESOME, some of best people I have ever meet.  To ME there is no doubt this is the best Mexican food in the Charlotte area.  Also, this is in a small strip mall...they also have signs to that read no meetings, no seating before all parties arrive...in other words \"we're too busy to seat you if your not ready....and please don't hang around because we are really busy...\"  (my interpretation)  GREAT FOOD!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4jT8k_MRplRfjIYU8qFPIQ"
  },
  "vmcI7-proIUf9hs-6wA1HA": {
    "date": "3/30/2015",
    "text": "My \"go-to\" Mexican restaurant. We have been eating here for years and love it. The food is excellent and the staff (Victor) is great! Not so thrilled with the new chips, please bring back the old ones. Still best Mexican around!  Oh and the cheese dip and salsa are amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5kE9dvaAqmVuPIm932l1w"
  },
  "cQSaHPFoXNy-LYDfcSV_Tw": {
    "date": "5/22/2013",
    "text": "Proof that quality of cuisine trumps atmosphere.  Great Mexican food that you would not expect to get off of Old Monroe Rd.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "0Kkg3Ie0lv5_xehdpsfYjw"
  },
  "BMu5zolXJl7rISFTrGCU1A": {
    "date": "4/4/2011",
    "text": "As a Mexican-American with an Abuelita that is a stickler for traditional Mexican food, the hunt for an authentic Mexican restaurant in Charlotte has taken many years. I finally found one that makes chilaquiles, and even better,  just like hers! Chopped fried tortillas covered in a creamy tomato sauce con pollo y queso, this warm and cozy dish took me right back to Abuelita's kitchen in East LA.   My boyfriend and I loved the food so much, I asked him to bring me here for our one year anniversary. I didn't need a $7 frou-frou margarita to celebrate, I needed food my Abuelita would approve and a cold glass of horchata (a sweet rice drink, don't be scared to try , it's great for cooling off the spicy salsa!).  La Unica sits in a surprising location, but the packed tables should tell you this place is worth the drive from Charlotte. If you're looking for traditional, no-frills Mexican, come here!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "-9oYn3R9ijfZ3ShqeLHRVQ"
  },
  "OMpB2Fm87ZFWbiBQv737nA": {
    "date": "6/26/2014",
    "text": "By far this is the worse restaurant. We found a fly on the drink. We asked to speak with he manager and she said what do you want me to do. We have no control of the insects that are flying in the restaurant. This is by far the worse answer I have heard in a restaurant",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkFr8m1q1I-Xfw-pnuDTpg"
  },
  "iCteIuQxEPwKGpyXDsaBjw": {
    "date": "6/23/2016",
    "text": "So ya I have never understood why this place is so busy. Never liked it. Only come here to meet a friend that has to lunch close to work. But today I got here ten minutes before her and they refused to seat me!  Mind you it was not during lunch hour. The restaurant was empty. Just wanted to sip my Coke and read a book in air conditioning while I waited for my friend to arrive. Absolutely ridiculous!  Could see if it was a full restaurant or from 12-1 or 6-7 or something but just a stupid policy they had to enforce when it made no sense to the customer. But clearly they don't care about the customer. There are sooooo many better Mexican restaurants in town! Better yet go next door to El Cafetal. Amazing food!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "16tVqtJEznvS6in18KgGaw"
  },
  "MUG_CV0IBWSB_mz-gcW9OQ": {
    "date": "2/5/2016",
    "text": "I have been coming here since they opened and I cannot find anything wrong with them. I cannot understand why some people want to throw them under the bus when they have only been there once or twice. They may not be the best in the country but they are the best in this part of the country. Why are you eating at this place, find you didnt like it then head to another Mexican restaurant? Doesnt make sense unless you eat like a sumo wrestler? Why cant you just say you didnt like the place and the reason and leave it at that? You just have to go the extra mile and muddy it up dont ya? Look at the high marks - it speaks for itself people. 1 or two sourpusses just shows the rest of us were glad La Unica is a success!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2_7x4yYBtvBnkZhAzgT3Q"
  },
  "cX7qOvkV2mhTk2Gba18voA": {
    "date": "4/29/2016",
    "text": "Best Mexican place around. Excellent service and food! I love the fajitas and the melon water. We eat here at least once a week :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlMwYAZRkCA7k1nqo2YE1w"
  },
  "yNZbOM2Hjo_qt7BQgBSmBQ": {
    "date": "8/1/2017",
    "text": "This place has never disappointed me. My whole family and I can rarely agree on where to eat, but this place we can always agree upon. The food is authentic and amazing, and the service is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wn2y5FpLcOfjbie-PWq3zw"
  },
  "l25jhfOVN8jyYK8aRnIeWw": {
    "date": "2/5/2017",
    "text": "Love this restaurant! Always a favorite. Great service and delicious food - especially if you are a vegetarian!! :) you can substitute cheese or beans for most of the meat dishes. Never been disappointed and definitely makes you come back again and again. Two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pa3zCM7Ys7niz26FLAJt-w"
  },
  "C1Jwapd7pthyCOoJe5IkMg": {
    "date": "10/9/2013",
    "text": "If you never find another Mexican place in Charlotte, don't worry - you don't have to!  La Unica is fantastic.  Always fresh, quick, and delicious.  They immediately stock your table with two types of salsa (medium and hot!), limes and crispy wonderful chips.  Then you glance over the menu - I always get the tacos - and boom, best Mexican food ever.  They are located in a little strip mall, but just renovated the restaurant and it's gorgeous on the inside.  They made the space bigger, added more tables, and painted murals all over the walls.  I love this restaurant, and am so happy that we found it.  It's not the fanciest place, but it'll keep you coming back.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "QLgFEumhrHq6LgbEOKCzdw"
  },
  "nWz9jAdJDqXi5eLrtmAWaA": {
    "date": "9/11/2014",
    "text": "Really good food.  SUPER FAST!!  Would have given 5  stars except for the inattentive waitress.  She never came back and checked on us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3_pE4kMHpk-JGi-Z2x06Yg"
  },
  "ht91jhsavkLSWMcR-FJVmw": {
    "date": "5/6/2014",
    "text": "Finally - a place to go for good Mexican food that answers the question \"Why am I paying so much for a fork and plate?\"   All good.  (Joke Hint: Most Mexican food is all the same but for the fork and plate - and the price).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "5pFUx4SJ5YSyIU8tnegtqg"
  },
  "wQp3TNqmg-coTY7y-FpTcA": {
    "date": "3/20/2014",
    "text": "There is no reason to eat at any other restaurant in Indian Trail. La Unica is simply the best.   The service is great, the newly remodeled interior is roomy, well lit and just all-around pleasant.   The real gem is of course the food. In probably close to 100 times eating here over the past 6 years I've never had anything I didn't like. If you are in the mood for something a little different try either the Pollo a la Crema or the lunch chicken soup.   The only minor quibble I have is the flour tortillas. They are just Mission tortillas. Fresh and always warm of course but nothing special. But short of making tortillas themselves I'm not sure what they can do, it's not like there is a tortilla bakery in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLIWM3fp1zCwAKL6iTWuHg"
  },
  "nmj-zunt4AjXcumzspmhJA": {
    "date": "6/28/2016",
    "text": "Certainly not a horrible restaurant but I'm not eager to return. Service was sub-par, with the hostess getting our drinks, and the waitress assuming we were ready to order after waiting on her for over 10 minutes. The food came quickly and portion size was plentiful, but I would rather visit other Mexican restaurants for more authentic food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iinC6DQ1t13oU0WdSjBo8w"
  },
  "CMhUyhH268JLHbf_6kYO1A": {
    "date": "9/3/2013",
    "text": "I grew up with Mexican food, with a father who grew up in Southern California.  While I'm no snob, I'm sick of the faux-mexican restaurants in this area and what they pass off. Well, La Unica is a breath of fresh air!  My 2nd favorite mexican restaurant, and IMHO the 2nd most authentic in the Charlotte area I've tried.  Anything on the menu is good, the servers are friendly and attentive, and the prices are fair. The one complaint I would have is crowd control.  They're almost always busy, you almost always have to wait, and the entrance is a mash of people waiting, leaving and paying - such that sometimes you can't catch their eye to get your name on the list because they just don't know if you're coming or going. But it's worth the wait to have real mexican!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "io1DlZ3nMqe7v5asSJN80w"
  },
  "rD8CgenT65rUDu8SeTF2_g": {
    "date": "6/20/2017",
    "text": "This place is amazing! I am from CA so I am very picky with my Mexican food and this place fits the bill. Their chips are salsa are fresh and delicious. Their green sauce on their enchiladas is perfect and clearly homemade. My husband has tried several different things and liked them all. Their servers are nice, the food comes out quickly, and its reasonably priced! It's always busy but they are efficient with getting people seated and fed quickly. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GrXVycVlGR3exran5sNy4A"
  },
  "-NG40H0jt2PN29D2b_ABVg": {
    "date": "6/16/2017",
    "text": "I love La Unica it is the most amazing Mexican food. There cheese quesadilla is the bomb and the service is fast. Very welcoming and it defiantly leaves you feeling full you might have left overs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyojcywasMHnGKgCf5ZSyA"
  },
  "nuX33hr530vbkI1n1ddq2g": {
    "date": "3/5/2016",
    "text": "They have the best chimichangas. I have eaten there several times and the consistency is great. Whether it is take out or dine it, the food is delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deTNNy7p194jkM19bGnJmg"
  },
  "QWtUcGt8dlwIBppbiZocKw": {
    "date": "2/27/2017",
    "text": "Hands down, the best steak burrito I've ever had.  And, they're so fast!  Unbelievably good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szt4Wg_YLt86Ww289pLLwg"
  },
  "yc3yVBfTZnV6XNI3_RHB9A": {
    "date": "11/3/2015",
    "text": "Best Mexican food in Charlotte in my opinion. If Mexican food is on our minds then this is where were going. We get take out from there typically and its always hot, fresh, and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eLDFcHd7c3A-JNMEP7U1hg"
  },
  "UQzkRDxe3xdunzEmhUAiRA": {
    "date": "10/12/2015",
    "text": "The food here is great and one of the best mexican restaurants in the area, amazing tacos breakfast quesadilla and mole de puerco... Its frequently very busy and you may have to wait.  My only problem with La Unica and the reason for dropping a star is they frequently mix up the mole and you get chicken instead of pork. The pork is amazing, the chicken while still probably better than any other food in the area is still not as good as the pork.  I recommend this restaurant to anyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uwmAepPVwWEbmatydUNLg"
  },
  "AP5wmDkxDjinjG3xTuSjtQ": {
    "date": "8/16/2013",
    "text": "I love everything about this place. I've been coming here for around 4-5 years now, which means they're doing well. In fact, they're expanding into the building next door. Every meal comes with free chips and salsa. This is pretty standard for a Mexican place. The salsas come in two flavors: mild (which is thinner and very tomato-y and garlicky) and spicy (which is a lot chunkier and has onions and cilantro mixed in). If you ask your waiter or waitress, you can get a green salsa and a brown salsa in addition to the two you are given. The brown one is really spicy. The green one looks like guacamole and it tastes like green chiles. As far as the food goes, I'm vegetarian and I usually get one of the vegetarian dinners. Vegetarian Dinner #1 is my top pick (bean burrito, cheese enchilada, and rice). The rice and beans are also very good, but the rice isn't exactly exploding with flavor. Another thing I like about this place is the consistency. If you like something, it will always be that good every time you come back. But, above all else, is the great service. If you go there enough, they pick up on it and know you by name (or at least by face) and they will come over and say hi. Best Mexican Place I've ever been to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mmt965gII5ndQLWG-ztSvA"
  },
  "Fthj-MYDTRW-8BSDrclxbA": {
    "date": "10/5/2014",
    "text": "Yay!  I finally found a good authentic Mexican restaurant in the Charlotte area!    I had a craving for Mexican and tried this place out with my husband the other night.  The service was fast and the food was great.  I ordered steak tacos and got a side of fried beans and rice... Everything was very good!  The tacos came with onions and lettuce so next time I'm going to make sure to ask for cheese and tomatoes.  If you're looking for really good authentic Mexican food, put on your finest t-shirt and sweatpants and head over here!  You won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "vtsRy9LmwJiTYb8AMtoFcw"
  },
  "h0GRyJsLTJwPnq_AnDpLNg": {
    "date": "9/17/2016",
    "text": "Great Mexican food that matches the quality of what I've grown up eating in San Diego. It's definitely different than what I grew up with but still delicious. Their fajitas are top notch. Myself and the family will continue to visit this restaurant when we are craving that Mexican food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uyKhUogRBu_yRRatsqk-jw"
  },
  "12LGvXxVo2l_k3kAF7mRmA": {
    "date": "2/4/2015",
    "text": "Fantastic service and great food. Best Mexican I've had in Charlotte and will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "m3vCwjKAbD8GMAnCQoJCWA",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Cheesy steak burrito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/m3vCwjKAbD8GMAnCQoJCWA/o.jpg"
      }
    ],
    "user_id": "chyyyctm9ckd7q2mtMZ7Ag"
  },
  "sOuvYM506WhG97UZF6d4kg": {
    "date": "11/17/2014",
    "text": "Wow! What a find... Me and my wife were looking for good Mexican food to try in the Charlotte area. So far, this place is close to what we got in California.  In CA, there are burrito places all over. I am jaded about my Mexican food being up to par. The quality of service and food were top for what you pay. Our waitress, Rafaela, was very cool and hooked us up! We will definitely be back soon!!!! Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cGKWH2AiwP0qUfGKtwh0ww"
  },
  "GO_qOD7Fg96--df3_TVG4Q": {
    "date": "9/10/2017",
    "text": "The food is great. But every time you call and place a to go order. They don't read the order back and they always forget an item. You don't get a receipt.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pyJsIJpkgPS8oJKM0EvGng"
  },
  "2MhM9oKQRC2u235XTilnaA": {
    "date": "5/26/2015",
    "text": "This is the best Mexican place in town! My husband & I have been coming here for several years now & have never been disappointed. They recently remodeled too & it's even faster in & out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YA6iEmvrCjjExV_DTSzOOg"
  },
  "D9zAGYU6tRCs95HYQW6KFA": {
    "date": "7/4/2016",
    "text": "La Unica continues to be one of my favorite places to eat.  With the expansion, the wait (at times) has become very reasonable, especially for such a popular place.  Service continues to be top notch and the food always good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0g9Q8hnRjXv3Decrh1Whbw"
  },
  "Gb_kdjuLje8VmRd9_XemOw": {
    "date": "7/19/2014",
    "text": "I absolutely used to love the food here! The burritos and tacos are to die for and their rice and salsa are prime. However, my family disagreed with me the first time after we went and now I see why. It made their stomachs upset, but it didn't affect me and I decided to keep going.  One day while eating I excused myself to go to the restroom and while I was washing my hands I saw an employee walk out of the stall and leave without washing her hands. Gross!!  I'm wondering if this is the reason they only got a 96% on they're sanitation rating (which is pretty bad considering everywhere else I've eaten doesn't have less than a 98). Hopefully the rest of the staff doesn't do this but I'm not taking anymore chances! Especially since the last time I ate there it didn't agree with my stomach, nor my brother's.   I just wish I could have a look in the kitchen to see how \"clean\" it really is!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SI_74d0N6D1U2YEwkix2uw"
  },
  "VDN7WfOpWg4sWmD3x4bX4g": {
    "date": "7/27/2015",
    "text": "Food is excellent along with the service! La Unica burrito is a must have if you like burritos!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cqHnuxoiTBCBeRZOrFuBcQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Shrimp and mushrooms are fantastic!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cqHnuxoiTBCBeRZOrFuBcQ/o.jpg"
      }
    ],
    "user_id": "L-DDf53t85gkHlPz8IZogw"
  },
  "uJFUtCtcDY7Jlc4X_hSwKg": {
    "date": "5/28/2014",
    "text": "Food - 2/2 *Simply the best traditional Mexican food in all of Charlotte.  My favorite item to order is the Fajita Steak Nachos.  The steak is so savory and delicious.  The chips and salsa that they bring out are excellent.  They'll bring you both mild and hot and watch out because the hot is HOT!  I end up mixing the two together.  I've never had anything here I didn't like.  Service - 1/1 *Fast and very friendly.  Some of the staff are some of the most personable and friendly staff I've ever had.  You're food will come out fast!  Price - 1/1 *Appropriately price in the $7-13 range.  Atmosphere - 1/1 *You don't expect much.  This is a hole-in-the-wall and I wouldn't change anything about it.  They recently expanded and it's made a huge difference for traffic flow.  This place is always busy.  We've learned you need to arrive before 6pm or you better be prepared to wait.  Side note- traffic coming down Old Monroe from Matthews is horrible around 6pm.  It could take you 30 minutes to get to La Unica from the 485 exit.  Overall- my favorite traditional, authentic Mexican food.  I find myself craving this food.  It's the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ln0_hxRKmKO1Pj-goraGLQ"
  },
  "yAG_wnLeEv0niGcDtc3vBA": {
    "date": "7/16/2014",
    "text": "After a long hard run at carowinds we decided to stop here. Of the 5 times we have been here there was 1 time that the food was just not as good as the other times. We brought it up to our waitress and she said if it's like that again to let them know. They have the best salsas and selection of salsa that they bring to you. Finally since my family and I moved here we have found real salsa that has a kick to it instead of the full and bland. Every place Mexican restaurant we have been to when asked if they have anything spicier they bring back chili oil which is not how you make spicy salsa. Cecilia's is the only place we eat at in irmo, sc because her food has never disappointed us , the salsa is amazing and we will never go anywhere else unless he head up to carowinds.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgpMtd936y0LtThprIMWPQ"
  },
  "avnKiMGsNbXUtJQo7hb2wA": {
    "date": "9/12/2017",
    "text": "love this restaurant and the owner and staff are very nice. food is always delicious, hot, fast, and reasonably priced, cheaper than other similar restaurants in the area. great place to take the family, friends. i always get tacos here FAVORITE. if you are from Indian Trail, everyone knows where to go to get the best Mexican food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUoUpALW_4oNZR2LEQPAVQ"
  },
  "Moay4q6SExR5K4sqaXp1GA": {
    "date": "9/30/2015",
    "text": "Great food at a great price.  Friday night-  5:00pm, dinner  Food:  You start off with complimentary tortillas and two sauces one mild, one spicy. The excellently made Chicken Fundido is highly recommended! Good portions. Great food specials, combos. Made to order. Fresh.   Service: Was great. The place was very busy, however our server was able to give our table a fair amount of attention. Food came out at a reasonable time and was correct.  Did not have to ask for refills on drinks. Did not have to ask for anything. Well done!   Price: Best value and great food for the price in the area for Mexican. Most entrees under $10. Also combo deals, lunch specials.    Other: The place is very busy during dining hours. Because it is very busy, parking has become an issue. The restaurant is placed along a strip of other stores. Some of these stores have blocked off parking areas for their customers only (not that they have many customers as it is). By doing so, the limited parking during peak hours, have become even more limited!    Tip: Try getting there early on weekends in order to beat the rush and also to find a parking spot.   La Unica is the reigning Mexican Restaurant champ in Indian Trail.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0U7YWdMI8QK0Hq3Zvkk8w"
  },
  "uwB-2o87C7GOl0BqFUR72A": {
    "date": "7/17/2016",
    "text": "This is one of the best Mexican restaurants in town. The employees are nice and the service is always quick (as long as it's not Sunday lol).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MbXiedeu0njxw0ez6_lqmw"
  },
  "LVcT1ssrq6FLADpfZUMWZQ": {
    "date": "4/20/2014",
    "text": "This is the best in the metro area!!! They don't sell liquor and still packed all time. My favorites: Best Chicken Tortilla Soup anywhere! Also the Tortas Carnitas are awesome. The Parrillada Mexicana Pork, chicken, steak, shrimp, Mexican sauce & cactus is a must too. Oh and Ceviche.. fresh each day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_hC3HpKr6I8hn5e2wBYfw"
  },
  "VzrmF4BGpnmhIqSm9m18wQ": {
    "date": "6/5/2016",
    "text": "The food was good. I really liked the hard shell tacos. Service was quick and polite for the most part. Strange rule that they will not seat you until everyone in your party is there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J-cgAPODjO4a0bdOTgujnA"
  },
  "11Klz-jx5f__1qeLNHGttw": {
    "date": "12/3/2012",
    "text": "The Hot Salsa is very Hot, the mild Salsa is very Mild, Both were VERY Good!  They give you some Lime Wedges - In my Bowl I mixed a three parts Mild Salsa with one part Hot and a squeeze of Lime Juice!  My Girlfriend had a Chicken Chimichanga... I'm not sure I have ever tasted one of these and I know I do not want one again... She said it was very good!  My Soft Pulled Pork Taco was very Good and the Hard Ground Beef Taco was good!  Our Server was GREAT!  She knew we would not like certain things and would like others!   Mr. Union County Physique World told me there is Mexican Food and there is Mexican Food, this would be the later!  Mr. Hoy Approved!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IBck6SXzZ9iu90HrPgP74A",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Pork Soft Taco",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IBck6SXzZ9iu90HrPgP74A/o.jpg"
      },
      {
        "img_id": "gpsbK9IlnE50Cwoe7yuSuQ",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gpsbK9IlnE50Cwoe7yuSuQ/o.jpg"
      },
      {
        "img_id": "fYkfcc1uVVoyGgkytxcQVg",
        "caption": "Photo of Taqueria La Unica - Indian Trail, NC, United States. Chicken Chimichanga",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fYkfcc1uVVoyGgkytxcQVg/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "E9k0t3IvY793rSW4iQltUw": {
    "date": "3/13/2014",
    "text": "This place is located in a small shopping center that looks a little questionable but this restaurant is a secret gem in the heart of indian Trail.  They changed the inside and instead of a big cafeteria looking restaurant, they added booths, decor and sectioned parts off to make it look more intimate and bigger.  The servers are super friendly and attentive.  They offer two salsas that greet you with chips when you first sit down.  Food is delicious and the portions are very large for the price you pay.  Two thumbs up!! *NOW SERVING ALCOHOL!!  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9euBoJoMJcOc609IH1nOAg"
  },
  "dFZvgDRwQ3pYgYv0HuJW7w": {
    "date": "2/1/2016",
    "text": "Great Mexican food!   This little restaurant doesn't look like much on the outside, but is nice on the inside.  It's luckily close to my home also.  Their Mexican fare is fresh and very tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ev01-JgclVpbVbG52XhKJg"
  },
  "JZDzQCjrrcqvrdRRnQMWhA": {
    "date": "8/17/2014",
    "text": "We've eaten here before, the former times during the dinner rush. Those dining experiences were 100x better than the awful service tonight. We arrived around 8pm tonight, we waited at our table for 15 min before our server opted to take our order. My biggest pet peeve (which is why I hate being seated in a back table tucked away from server stations) is being unattended for more than 10 min ESPECIALLY when it's slow!   So we finally get to place our order and boom server doesn't know the menu yet. Because apparently what I ordered was a new one for her. Above all, they came back confirming my order thrice, thereafter, one time another server confirming. To top it off, my order came out wrong anyways and our drinks never once refilled. At that point, I've succumbed to their poor service and decided I could skip a meal. At check out, we're asked, \"how was everything?\" Glad someone else was with me to kindly pass a, \"it was great.\"",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pwGVcpdjPevhBhh3zfYV_g"
  }
}