{
  "L0ftH0Y1uam7w5d4oKI-Fg": {
    "date": "5/3/2017",
    "text": "We have frequented village tavern in their Greensboro location for years. When we moved to Charlotte we were excited to try their Charlotte location. We took my mother and a father in law to eat on a Friday night while they were in town visiting, along with our two children. It was a short wait to be seated, however, once we were seated it took forever to receive our drinks and even to place our drink order. Once we were able to place our drink orders and received them they were awful, both of our kids drinks tasted like watered down juice. Our bar drinks were horrible and had to be sent back to the bar. Once we then placed our food order it took over an hour to receive our food. We watched as other tables that were sat after us received their food ahead of us. Long story short, our experience was very sub par as was our service. The waitress was over worked and the bar and restaurant were understaffed. When we spoke with the manager she only offered us an excuse of it being a busy night (as if Friday's aren't always busy) and then she offered us a free dessert. No thanks! After such a long wait for food our kids were tired and we were ready to leave. Again, not what we would have expected from Village Tavern.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "43FlusMRM5jP24_OfU9aMA"
  },
  "Ca-fK1v1NAN19nW4gzBh8A": {
    "date": "8/4/2014",
    "text": "It's been a long time since I came here for lunch (now that I don't work in SouthPark). It's less packed than I remember, which is good, because parking is always a nightmare here. My friend and I sat outside on the patio, which was nice and quiet (only 1 or 2 other tables out there). Waitress did well in general, given the fact that we're her only table outside.   We were able to get in and out in an hour, more or less, which is a key for any lunch spots on a work day. My half and half (half chicken club and soup) was solid for $8.95. My friend's roast beef rueben (whole sandwich with a side of fries) was pretty big portion for $11.95 (and a big sloppy mess to eat). The fried calamari $9.95 was good, but not sure if it's worth the price.  Crazy thing is I really wanted the trout, that was my favorite lunch dish there for the longest time, but I just cannot see myself spending $18.95 for lunch! The salmon entree was cheaper.    Village Tavern has always been a solid spot in South Park. They still have happy hours specials (4-6). And it's one of the nicest patio space to enjoy a nice day out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "bDH9eVY_sq8aFbt5j1HX7Q": {
    "date": "10/3/2011",
    "text": "A long time ago I vowed never to come here again after a terrible experience when I first moved here.  For years you heard this advertised on a popular radio show so you assume if so and so promote it all the time it has to be good.  Well my first experience was horrible but again that was over 15 years ago.  So tonight I was in the southpark area and decided to give VT another shot.  After all, everyone deserves a second chance, even if it is 15 years later.  Apparently this was group night as I was seated next to one large group and there was another one at the the other end of the dining room.  The place was loud!! -- a little louder than I'd consider comfortable.  I mean I couldn't even hear my waiter tell me the dinner specials.  Service-wise it was average.  It took a while to take my drink order only to be told that their beer menu changed and what I wanted was no longer available.  Then it took a while for the drink to come out.  The menu was too broad.  There was a little bit of everything and not one real specialty which made it difficult to decide and not one thing really stood out to me so I went with Chicken Colorado which I've had before at various places under various names...Chicken breast with bacon topped with cheese, barbecue sauce, scallions and tomatoes.  It really didn't differ from anyone else's interpretation of it.   The food was decent but again it didn't really stand out.  Service was slightly better than the food but still not worthy of more than a 20% tip.  All an all, this is average.  The place reminded me of an upscale Applebee's and both points are not enough for me to make a 3rd trip.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "tNeAsW2javHF2sRYB8neoQ": {
    "date": "11/19/2015",
    "text": "Great food, awesome service.  The dessert of warm butter cake was more than expected and very decadent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccyZJ4HCYy_HW8C7XnrEbA"
  },
  "UehoVn9XD5XHxnkKSr6vAA": {
    "date": "7/17/2016",
    "text": "Arrived for Sunday brunch about 11:15.  Thirty minute wait for a private table.  Open seating at bar and high tops. Chose the latter.  Fast attention from staff.  Excellent menu selection.  Reasonable pricing.  Reservation suggested, but not mandatory.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sZWDEmF8mOhJRAdYvjoSbQ"
  },
  "aHSDy7vi31a5qKWlgm-a0w": {
    "date": "5/15/2017",
    "text": "Went for Mother's Day brunch. Four in our party, cousins came from out of town. Was excited because of the reviews. Ordered Spinach dip, spring rolls and crab cake for starters. Spinach dip was tasteless with hard stale tasting chips. Sent back and got another spring roll which took too long but we enjoyed. Our food was served to three of us as we were informed as the food was arriving that they were out of waffle/French toast batter.  Completely unacceptable.  We should have been notified before the meals were served. It was Mother's Day Sunday Brunch and it was not busy. Not sure how they ran out of such an important ingredient. The person's food that was left out had a four hour drive back to Atlanta following brunch so her meal was ruined because her reorder did not come until we were just about ready to go. The others meals were less than desirable as well. My daughters crab benedict came with well done boiled eggs on top, my cousins blacked chicken alfredo  was bland with runny alfredo sauce, and my nuevos rancharos was just blah with canned black beans. The manager was very kind and understood our frustration and took care of the bill. He sent us their famous butter cake which was fine; however it did not make up for a ruined Mother's Day dining experience.  I felt doubly bad since I suggested the Village Tavern and it was terrible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wf4b072acylnVKNyHRgXIw"
  },
  "dAvl_5fk0RQCkxdvWghRlg": {
    "date": "5/8/2016",
    "text": "This was my first time at the village tavern.  It was just ok.   The Asian chicken salad was awful.  It had a weird dressing. Thank goodness my husband was willing to switch with the crab sandwich.  That was ok.   He didn't even finish the salad.  The best thing there was the sweet potato fries.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N1YxlI1isrMfQox0JZ746g"
  },
  "Fbq66yqWnclgBUmCIiRgGg": {
    "date": "5/19/2014",
    "text": "My wife and I joined another couple for Sunday brunch a couple of weeks ago.  There was a ton of nice outdoor seating and the menu looked very promising.  I ordered an omelet, which I couldn't wait to try.  Well, let me rephrase that...I could, and I did wait.  It took around 35-40 minutes to get the food for our table.  Most disappointing was the fact that we never even got an apology for the food taking so long.    With that being said, once we got the food it was actually pretty good.  Although I was so hungry that it didn't have to be that great to scarf it down.  Another positive was that the prices were very reasonable.  I will probably try it again and hope to have a better experience, but it will have to be on a day that I can eat a snack before I go...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nFgdvXE0NfqQodRq1xICaw"
  },
  "b7EiYgM05JyhWJa2bIURLA": {
    "date": "10/12/2015",
    "text": "Really enjoyed our meal here! Prime Rib was juicy, tender, and perfectly seasoned. We were a party of four who was on the last night of an eight day touring vacation and we all agreed that our dinner here was the best of the week, and we had eaten some excellent meals along the way!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Zac3GncGRKPb4WjSypd4g"
  },
  "nepN3Nh3-CisMUx5fbS3ew": {
    "date": "11/7/2011",
    "text": "The Village Tavern is part of a somewhat upscale chain and a long-time Charlotte tradition - they have been here at least 20 years in the same location (we used to hang out here back in my college days.)   The service here has always been hit or miss... sometimes it's been really good and at other times it's been pretty dreadfful.  Over the years, I have had some really good meals here and other times, not so memorable.   However, I do find the Tavern to be a nice option when you have a group of people because generally everyone can find something on the menu...everything from salads, burgers, pasta, pizza, fish entrees, meat, etc.  They do have one of the best patios in town for when the weather is nice.  From time to time, they will have a band out on the patio which is cool.   As for appetizers, some of my favs here are the house-made fries, crab dip and Ahi Tuna Sashimi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "RucYdfIzIJ9PqDYcnTVQGQ": {
    "date": "4/3/2016",
    "text": "I have been here several times. Great for large parties or just you and your spouse. The food is great and so are the drinks. Love the margarita with house-made mix. Also tried the butter cake and the carrot cake. Both were huge shareable portions but very good. Walking distance from the Renaissance Hotel which is why we love to stay there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "17e8LpzJMF_TJsBPKpubfQ"
  },
  "llnvOTVaQ3qnrdM6_6rwbA": {
    "date": "7/14/2015",
    "text": "It's just too crowded & way outside the South Park Piedmont circle area. Food is mediocre & drinks aren't strong. It's the place you regret going to because you're completely isolated. I know crowded normally means place to be, but that's not the case here. Plus the staff isn't very helpful- from the gals at the door to wait staff. Sure if you work next door it's probably great, but don't waste your time making it a destination.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChZfGasEOvRzvzZePBGMAQ"
  },
  "cL-nDUtC3-79kVkDV4soSg": {
    "date": "1/13/2016",
    "text": "Visited during a business trip, didn't make reservations, but figured hey that's ok I'll wait and have a drink or two from the bar...Umm no service unless your seated there as the staff can not see past the counter...Atmosphere was nice not over the top but nice. Food was good had the Spaghetti squash and veggies, nicely prepared and presented well. Service was friendly...overall 3 stars gave an upscale look/feel, but lacked in real overall service for the look",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nu-FTDipFDrhHb4x5iI2Ww"
  },
  "-XcTWtVwgaueXSm-_9qKTA": {
    "date": "2/23/2013",
    "text": "This place has has always been my favorite place for a long time.  chip n ranch app is great! my favorite filet in town and yes ive had filets at other places high end. ive had plenty of items on the menu to say its all good.  Recently my wife and i would go in on sundays to grab brunch. noticed a lot of the staff there complain more and more. (kinda like im watching the movie Waiting) if your gonna complain go into the kitchen not at the service station for customers to hear.     if the staff stays snotty ill find another sunday brunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jfy2usYXLrH8LAPyWgMXyA"
  },
  "a-Nsi8yn0RdANj4UVkLriA": {
    "date": "2/1/2013",
    "text": "Village Tavern brings back so many memories to me.  As a Charlotte native, my high school friends and I would dine here before cotillion dances and always felt like super cool adults.  The restaurant has not changed much (it still offers outdoor seating which is stellar in warmer months, or under the tent with heaters in cold months).    To be honest, VT is the type of restaurant I want to give three stars tops, but I just can't.  I am a big ambiance person, and it is just very chainy looking on the inside.  All that aside, the food, in my opinion, has gotten better over the last couple of years.  I have found myself requesting to go here over some of the newer trendier restaurants.  The new bacon wrapped scallop appetizer was outstanding, as well as the crab dip (hard to mess up in my book).  I have to agree with Giannabrie, the zucchini squash with marinara dish is freaking fantastic. So much flavor. You don't miss the noodles at all. It's a full feeling that you can feel good about!  VT also always has good drink specials.  I am a fan of the half-priced wines by the glass on Wednesdays.    The food is consistent, good prices, and nice portions for your money.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "ov8NUu0iXo9YKs35Q_FCkQ": {
    "date": "3/3/2013",
    "text": "Went here tonight for the first time.  Have to say the place was just alright and nothing spectacular. The hot crab dip was awesome. We literally scraped the bowl! I had the shrimp and grits....it's was ok. Not the best I have ever had and this was due to the thick grits....just wasn't all that great. I had a side of asparagus which was seasoned well. My boyfriend had the ribeye with sauteed spinach and mashed potatoes. He said the ribeye was ok and not the best he has had. But the sides were great.  The ambience was not really my style....but it was decent. I think I would probably come back....maybe....no guarantees",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EAzSNwbXHcevJZV1TjrvJg"
  },
  "Ey8e1RYppE4pcrbYmaE57g": {
    "date": "12/28/2012",
    "text": "We are new to Charlotte (less then a year) and try one different restaurant ever week, and this was a great choice. We happened to pick up their brochure at the visitors center so we thought we'd try it.   I had the chicken Marsala and it was as good or better then Olive Gardens. It came topped with a very tasty grave with bacon and mushrooms. It was absolutely delicious and was a nice portion size.   My husband had the grilled meatloaf which was an unusual choice for him eating meatloaf at a restaurant. It turned out to be very good! He also had the spinach as the side it was yummy with a hit a salt for flavor very good. It to was a nice size portion.  We will definitely be going back. It was so much to choose from on the menu we both had a hard time making up our minds, So will be returning to try all the other yummy sounding menu items",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hfCROYyTyVrUPQ1C75trDg"
  },
  "QtAipTmgEetMgE9-dye0Dw": {
    "date": "4/14/2013",
    "text": "This place can be easy to miss and forget about, due to its nondescript location but the food really is good.  I've actually been pleasantly surprised by the food. I expected it to be on par with say Applebees but it's more on par with Firebirds.    The macaroni and cheese is to die for... although the past two times we've gone it's been really overly greasy. The mashed potatoes and green beans are probably my favorite sides as I think they are very well done. The prime rib I had was delicious and I've had a regular steak there too that was awesome.  My friend really likes the Cowboy chicken!!    So basically I've never eaten anything bad here. The ambiance is kind of like a chain trying to be classier which is perfectly okay. The booths are comfortable and the lighting is fairly dark but not so dark you can't see anything (because they have windows for natural light). Their outside patio is great on summer nights as well. All in all I give it 3.5 stars but I'll give them the bump up as I know I'll be back again :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "vpcA79IAZHyTs8TCDvNKaQ": {
    "date": "12/6/2016",
    "text": "For the 2nd year in a row we decided to go to Village Tavern for our annual BellSouth/AT&T Christmas luncheon. We reserve the heated tent on the patio.  It's so festive, plenty of room for seating and mingling.  We had an option to have a set menu or order from the menu.  We had close to 60 people so we were informed it may take a little longer to get our food if we didn't do the set menu since everything is done from scratch.  Well that didn't happen, we took our chances and ordered from the menu!  The wait staff - Melissa, Brittany, Kevin and another gentleman that I'm sorry I didn't get his name were excellent!!  We needed for nothing!  We all ordered from the menu and it took no time for us to get our food and everything was hot and absolutely delicious!  I heard not one bad comment about anything.  Jenn stayed in constant contact with me about our reservation because the numbers kept going up on attendance.  I had the pleasure of meeting her when I first got there.  James Ragin/General Manager came out and introduced himself as well.  Everyone was constantly checking on us to make sure everything was up to our standards - the space, room temperature, food, beverage.  You couldn't ask for a more professional staff.  Everything was EXCELLENT!!  I highly recommend Village Tavern either for a small lunch or dinner and a large group like we had.  We'll be back next year for sure! GREAT job Village Tavern!  Thank you for everything, including your staff for taking such good care of us.  You made us feel so special!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YVOLsWmyNxUR4peDa_Be8A"
  },
  "3h1Kt2-CVFK2r_ppOYaemg": {
    "date": "9/13/2012",
    "text": "I work in the Rotunda building so I go to Village Tavern for lunch occassionally.  The food is just okay - nothing spectacular but nothing awful; I guess I'd say it's average.  Last time I went I had the crab cake sandwich which was sort of bland and soggy; the time before that I ordered a salad which was also just average.    Their service is good and it always seems to be busy during lunchtime.  The patio IS nice if you're having a drink or just want to hang out with friends.     Village Tavern is not a terrible place but it wouldn't be my first choice for dining.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "q31O77-MclraWve3vmBDmQ"
  },
  "Vbox5vG9wp63S-9wuE2yDg": {
    "date": "1/19/2016",
    "text": "The cheap looking awning as you approach the place made me a bit skeptical of the place (located on the side of the Rotunda Bldg)... but once we entered I was pleasantly surprised.  At this point I can't think of anything negative to say about Village Tavern.  I've been twice... once for dinner with a HUGE group (Fall of 2013) and once for lunch (December 2015)... service was good both times... everyone enjoyed their meals.  Everything I've ordered has been DELICIOUS... pizza, kale salad, deviled eggs, crab dip, etc etc (see pics).   Parking was a little tight when we went as a big group back in 2013 (but it was a Friday night and we went a few hours after they'd opened).  The view was gorgeous... we could see light snowfall and city lights - ambience = 100! :)  Diners were in all sorts of attire... dressy, business, casual, panthers jerseys... so come as you are! :)   There's indoor and outdoor seating and the bar is a pretty decent size.    Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Mnq-ocnWIjMbcvqM__V4NQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Pimento Cheese Deviled Eggs w. Candied Bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Mnq-ocnWIjMbcvqM__V4NQ/o.jpg"
      },
      {
        "img_id": "FgnBqkLHkFbTehEKa3xQMw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Hot Crab Dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FgnBqkLHkFbTehEKa3xQMw/o.jpg"
      },
      {
        "img_id": "bOILQCa5Clv-b7ydnUbPjw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. The spread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bOILQCa5Clv-b7ydnUbPjw/o.jpg"
      }
    ],
    "user_id": "GbNQMoMiYGYfGNwMH2OV1w"
  },
  "pWh7nnodwq_KJF-wT0wPeg": {
    "date": "3/4/2017",
    "text": "This is where I wish we had .5 stars because I really thought this place was not quite a 4 but more than a 3. We were here for a Thursday night for a birthday dinner. We had a large party with one waiter and he handled the group well. So the service is good. The menu is pretty big with many selections at different price ranges. I wouldn't say the menu had anything particular that stood out. I ordered the blackened salmon sandwich with sweet potato fries. I liked how they gave you an option of what side you wanted and the sweet potato fries were not extra. The sweet potato fries were very good actually and seasoned with cinnamon sugar. I also ordered an appetizer salad and it was a general salad. The salmon was decent and fresh. In addition to dinner I got the organic Malbec wine and it was very smooth and a good price. I thought this was different because usually restaurants have more than one Malbec but this one had several to choose from so I appreciated that. This isn't a place I would go out of my way to go to but it is a good option if you are hungry and in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Xnk0CVEFvk_nKUJm4zllKQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Appetizer salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Xnk0CVEFvk_nKUJm4zllKQ/o.jpg"
      },
      {
        "img_id": "eABPLUZtpYL8NztCteOVuQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Blackened salmon sandwich",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eABPLUZtpYL8NztCteOVuQ/o.jpg"
      }
    ],
    "user_id": "Hqh3__TgG8hNSGnnmuEYhQ"
  },
  "VZseFat76S2eFdHKEjrAkw": {
    "date": "9/19/2018",
    "text": "Really good dinner..,.... hubby had pasta with shrimp and said that his dish was delicious....I had a burger which was also very good...... overall atmosphere is nice!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "STESvkC7qjgcxENtrCL7gg"
  },
  "M9yUzdCLZwMoENzFSTr-lA": {
    "date": "4/7/2017",
    "text": "Went for the first time on a business lunch around 12 and was very impressed.  It was already packed so we had to drive around for a parking space but luckily it didn't take long.    Dining: Seating was full at the regular tables with a 30 minute wait so we decided to sit at the family style high top tables, which was pretty neat! Since it was first come first serve seating and there was only 2 of us, we found a spot quickly.   Service: Awesome! I hate I forgot our waitresses name because she was the best. I tend to yelp everything when trying new places so I already had an idea of what I wanted from the lunch menu. I happened to mention to my lunch partner that I read how good the cajun seafood pasta was but it is only served at dinner so I would have to come back...he asked the waitress if it was possible to get it for lunch, she was so sweet and went to ask if it could be made...I was so excited when she said the chef would make it for me!   Food: Order the hot crab dip and thank me later.  Delish! My seafood pasta was so good and full of shrimp and scallops (I asked for no sausage). It has a spicy kick just like I wanted.  I was too stuffed to try dessert but will definitely be back to taste the warm butter cake I read about!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eSMG5qmwO_H_3xh50TMAGw"
  },
  "_j_Ymyv1Ql1WqwqVGk3ueA": {
    "date": "6/8/2018",
    "text": "Holy cow. I thought I had seen it all, but this restaurant managed to put it \"all\" in one awful basket. First, they served me a $15/glass Quilt Cab in a run-of-the-mill wine glass. Ok. Picky? Maybe, but \"they did not have a bigger glass. Then the waitress then asked me how I wanted my Ahi Tuna starter \"cooked\", I should have known. When I nearly hit my head on the plastic take out box left on the banquette behind me, I should have known. When I heard the waitress, who had just pitched the \"5$ Friday night margaritas, mojitos and Moscow mules\", explain that \"mojitos are the ones with mint\", I should have known. When they filled a to go box at another table, at the table, I should have known...But, I stayed anyway, and ate a mediocre, Chili's would have been better and less expensive, dinner. Shame on me.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WEkqqSK8rYqxyy620pf-nw"
  },
  "DatMejXEPKKQV_SFuEV6Ng": {
    "date": "6/17/2017",
    "text": "My husband and I decided to find something different to eat. I will admit I was hesitant due to the outside  of the building. We made a great choice. This place is a hidden gem.  His steak was cooked to perfection. It was delicious and no steak sauce needed. I went with the blackened chicken Alfredo. It was absolutely wonderful. It was served with lots of chicken and seasoned perfectly.   We also had the drink specials. My margarita was great and not watered down at all.  This place is beautiful inside and our service was great.   We will visit again soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h9_YlzD1Tx5GzWoTUq6r-Q"
  },
  "dwRe0EvxXrx5pemqHaeJKg": {
    "date": "3/20/2017",
    "text": "The first time I've really felt compelled to write a review.  Food was excellent.  The ribs were fall off the bone and all 4 at the table agreed that my father in law's steak was one of the best we'd ever eaten.     Special comment goes out to our waitress Laura.  She was excellent.  If I was still in sales management, I would have offered her a job on the spot.  She was both friendly and profressional and I really look forward to eating here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3wWfpqdF8wERGydaGfmaQ"
  },
  "6x2s_psKpUUWT-wowzc1Ig": {
    "date": "1/24/2018",
    "text": "I went here for a wedding!!! There food was so good that i had to put them on my bookmark list for the next time I'm in charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPRj4rsoXNsuOCqh8Kxacg"
  },
  "27QWqVpDG9t4yRYUH49BDA": {
    "date": "4/13/2017",
    "text": "Went here for happy hour and had a couple drinks and a few appetizers . The flat bread was delicious , the nachos had a lot of potential but when it came out there was only a few good bites and the rest were just plain empty chips . The French fries were really good , thin and crispy . The margaritas were good . Im just gonna go with that the service was a little off at my visit , we didn't get asked about anything or checked on at all . We had to flag someone down in order to get new drinks and waters ..... it was a pretty busy place so I'll be back to give a second chance .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2FcGYaav23lrTekeEXqK2A",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Flat bread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2FcGYaav23lrTekeEXqK2A/o.jpg"
      },
      {
        "img_id": "I8BOSRyHyzhRJje8W8pcTQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. These had lots of potential the few chips that were actually covered in sauce were really good .",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/I8BOSRyHyzhRJje8W8pcTQ/o.jpg"
      }
    ],
    "user_id": "5guEZeu_A0Ab_yCQuVSZMw"
  },
  "GwZeJOg9xJUir_IVY4ULDA": {
    "date": "3/25/2016",
    "text": "Highly recommend for lunch. Sit on the patio if weather permits. Lots of selections on the menu Wonderful crab cake,real lump crabmeat. Tuna melt was hot and fresh served on good rye bread. Server was prompt and helpful I will definitely go again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvs6n04dKZheWJVzhB7TDg"
  },
  "9hu8crRCjOWILHakiro2LA": {
    "date": "9/16/2017",
    "text": "Great deck, loved the spring rolls. Splurged on steak o'poivre. The cut of meat was great but the sauce tasted like liptons onion soup poured over it. It was nasty  The waitress said she was sorry, but showed little concern, no other comments, no discounts, no concerned manager. Very disappointed in food and customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gScdAnnG6rbdIfFkdlgBjQ"
  },
  "ijYLDAAjjUzIcjg71YYX8g": {
    "date": "5/24/2018",
    "text": "Went while on vacation in South Park. I would have to say meh, at best. Wife and I ordered two old fashions, server didn't ask what kind of bourbon but I ran with it anyway. These we not old fashions, they were bad bourbon with water, no bitters, orange slice maraschino cherries stirred together. This is one of the only drinks I have ever returned. I ordered the clam chowder and received a 3/4 full cup of descent soup with no crackers or bread even offered. My wife had a Cesar salad that was a large portion that was just okay. I ordered shrimp and grits, they were again he just okay. I was not happy with the large pools or red oil or grease that was on top of the grits. This was the first time I've ever had S and G so I was a bit disappointed. My wife got the blackened tilapia with crab cream sauce. It was pretty tasty, but the sides looked and tasted uninspired, average rice pilaf and some soggy yet well buttered green beans. The 3.50 craft beers were a nice treat. Our service was rather poor, the server was new and not in tune with the customers needs. I was chuckling because the table had a now hiring ad in the specials placard. I also laughed when I looked around to see random bread baskets placed about the restaurant. I guess it's my fault for not asking. We were told all the food was scratch made, but I'm a bite skeptical myself. Not my favorite place while in Charlotte, but seeing how busy they were many must like it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HqQ7aHcSvLJ_zxtVyY7q3A"
  },
  "NCj5UVRciYTGTUcZwZjoDA": {
    "date": "11/3/2017",
    "text": "Called ahead of time to ask if dogs were permitted on the outdoor patio. We were told it was okay to bring our dog. Drove 30 minutes to eat here only to be told at the door that dogs weren't allowed due to state code (further research indicates this is False). We informed the manager that we called ahead of time to specifically ask. She blamed it on a misinformed employee. No offer to give us a gift certificate for our trouble or anything. Clearly a very poorly managed restaurant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BO49QZ5P25PJRXBKaTZROg"
  },
  "1JkV1jFyWS6tQIPVQ0VB5A": {
    "date": "3/27/2017",
    "text": "Best pimento cheese burger on the planet. Great outside seating and a nice place to go for Sunday brunch.   Definitely recommend reservations for high traffic times and getting there early to find parking since the parking lot is super tight and still under construction.   Still a great place and a wonderful place to go have lunch on a beautiful day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E8Ia8e6wLJ45ByYTXM1YNw"
  },
  "7QTyr6DFFCEZIq8u8MHiLg": {
    "date": "6/26/2018",
    "text": "I love this place!  Dan, the bartender, makes the best cocktails. He's enthusiastic and wants you to enjoy his drinks. Appetizers favorites- potato chips w ranch is a huge order, great for sharing. I also like the spring rolls and the crab dip. I'm a creature of habit and always get the flat breads, but the salmon and trout are always good. Finally, I think this place has the BEST desserts in town...the double decker cheesecake is TDF, butter cake w vanilla ice cream and key lime pie are my other favorites. Oh and don't forget the chocolate torte. Never had the carrot cake or apple dessert. Go and enjoy the patio when it's cool out. You won't be disappointed here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3YObiXG3F8X1JBj2b3QxTw"
  },
  "DIS5yWzK0sPfvLUrYKtZ2g": {
    "date": "6/2/2018",
    "text": "Another of my favorites in Charlotte!!! Great food and ambience. Their bartender is super in mixing and you'll want more than seconds cocktail drinks. Surprisingly for the quality, great food, higher end service and decor this place is very well priced. As a vegan/vegetarian and sometimes even pescatarian (I always choose balance over perfeccion), they are friendly, helpful and always accommodate to all my dietary restrictions and choices (which of course if you follow my reviews aside from great food you'll notice, flexibility and service are rank within highest in my ratings). In addition, they are family friendly, their bar gets super busy for those looking for conversation, and a good time. I highly recommend making reservations ahead of time as it kind get busy. You must order the grits and shrimp or scallops dish (it can be very greasy but they will accommodate to no bacon which makes it super greasy). Their Moscow mules drink is amazing I think because of the ginger beer they may use. If you live in Charlotte or you're just passing by, this is a stop you must plan to make. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uXgbU3ngclTNGwOnGJbHeQ"
  },
  "yW4SyPsHpE3JepWpG_9nUA": {
    "date": "10/23/2015",
    "text": "A girlfriend and I finished our salon appointments at the same time and had a free hour for lunch so we chose Village Tavern. I used to go in Winston-Salem all the time as an undergrad at Wake so every time I go here, it's nostalgic.   Parking was \"extra special\" today for some reason and it took some time to find one. We ended up walking quite a bit. Parking has been an issue every time I have gone to this location in Charlotte. But, it was worth the hassle.  Despite the lunchtime rush, we were warmly greeted and seated quickly. Our server was gracious and honored my tight time commitment; I had a waxing appointment to get to!  We decided to do quick appetizers and wine. Our glasses were brought to us immediately. Never make me wait for wine! And appetizers followed shortly after.  We split hot crab dip (what I always got while at Wake) and ahi tuna. Both were delicious!  I had to rush out early but enjoyed the brief visit to an old-time favorite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtIBG55GolSXI3qjcQFExg"
  },
  "sMGc4_b4e5F00GochpAbOg": {
    "date": "10/19/2017",
    "text": "I had a business lunch here this week and it's the first time I've been here in many years. This place has really changed for the better. It still brought back many fond memories of my college days when we would show up on a Friday evening and party on the huge patio! Good times! Ok, back to the review...this place was packed for a Tuesday at 11:45am. That's always a good sign. I ordered the blackened chicken alfredo and it was on point. The price wasn't bad either, $12.95. You have to expect that when in the SouthPark area. The service was fast and friendly. I will be back to try more of the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "1ozOiEk31YwDWmi-J6YBNQ": {
    "date": "6/18/2017",
    "text": "It was Father's Day today we made reservations no wait called at 10:30 got the time I needed...the waitress was great very attentive!!!!! Love love this place been going for over 15 years now....took a break though when they had changed the recipe for the homemade veggie burger to scared to get now but the turkey burger is good too!!! My dad really enjoyed everything we had the spring rolls and pimento deviled eggs and he got the trout as well as I and also the warm butter cake!!! He enjoyed everything!!! Good Job Village Tavern",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RJ9-KzLWqJAazylxsh0Xdw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RJ9-KzLWqJAazylxsh0Xdw/o.jpg"
      },
      {
        "img_id": "eyHeKLB5ECqwCaUFM4yEiA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eyHeKLB5ECqwCaUFM4yEiA/o.jpg"
      },
      {
        "img_id": "Eqiph2NSqYnkAYyaUmWObA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Eqiph2NSqYnkAYyaUmWObA/o.jpg"
      }
    ],
    "user_id": "7Z-Sap4z-E2JK1NL1csquQ"
  },
  "VgMr-t2vaa_MDlhH24K_BQ": {
    "date": "6/24/2015",
    "text": "This is a long overude update since my last review in April 2013.  In late 2014, Paul C, a great Yelper informed me about the renovations and menu changes Village Tavern made. He swore it was worth giving it another try. So, I took him up on grabbing some dinner and have since been back several times.    The interior of the restaurant has been updated, more open and modern and not so dark as it was years ago.  The menu has kept some great staples, added some new additions, and I heard there is a new chef, which may explain the happiness we have had in the food. I have been for brunch and dinner and enjoyed a variety of items, but the crab cake dinner/sandwich and fries stands out. The fries are cooked just the way I like them. A little thicker and with the perfect amount of salt. And, one funny note. I don't typically mention a house salad, but they could have served one of the freshest house salads I have ever had, and it was huge. Served with lettuce, cucumbers, tomato, croutons and egg, it was great. And, try the Village Vinegerette, loved it!  I will forever thank Paul for making me give Village Tavern another try and think of him everytime I am there. Check it out.. Oh, and don't forget to try and enjoy the patio on a nice night.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ke5u2p_VCK8clXj_4XI6qQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Crab Cake Entree with Fries and Cole Slaw",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ke5u2p_VCK8clXj_4XI6qQ/o.jpg"
      },
      {
        "img_id": "NaTG8zNDqaduzzCIIrZKFg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Margarita Flatbread with Chicken !",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NaTG8zNDqaduzzCIIrZKFg/o.jpg"
      },
      {
        "img_id": "lzk2Q3U7etw6cM4BTwj_mg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Crab Cake Benedict",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lzk2Q3U7etw6cM4BTwj_mg/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "Pno5x2HfbFUeL6Dn3kGF9A": {
    "date": "9/19/2018",
    "text": "It was a yummy dinner...great patio but staff should not be putting umbrellas down at 9:05. That is like asking patrons to leave",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTnErcGQOILFmDYFz3FOIw"
  },
  "ujSsQRGmrzTH8GDK2VFmpA": {
    "date": "7/6/2018",
    "text": "Okay this place is good, don't be disuaded by my three star rating...it just could have been better if I'm going strictly off food. We are here because when j came I had a four month old and eating outside where I can fit a stroller is preferable in case he loses his mind. Village Tavern has a really nice (large) patio where were all comfortable bringing a baby (bonus..the baby did not freak!). Now to the food- I ordered the pimento BLT and the kitchen had a mix up so I did not get my food until way after every one else was done eating.. which is strange because a BLT is not very involved. Anyway, it was extremely bland. I honestly would never have known that there was pimento cheese on it if I couldn't see it with my own eyes. The bacon tasted like nothing. It was very strange. What a waste. The dip duo appetizer was good with guacamole, but the pimento cheese still wasn't great. My mom had a large salad she said was good. All the food being brought out LOOKED great. Wonderful presentation. I'll have to go back because maybe my sandwich was a fluke. I can imagine having a good brunch on the patio and downing mimosas one day!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDv9HzZUPw1b_uQW0vVCOA"
  },
  "tOYGmkO-UajMuOKZl5dUqg": {
    "date": "12/9/2017",
    "text": "This restaurant has a nice, relaxing atmosphere. However, it's kind of hard to find using the GPS because it's connected to a corporate area. Nevertheless, I came here for the first time for a team work dinner. The dip duo was ordered as an appetizer (for 4) and the serving size was really small. The tortilla chips tasted as if it was cooked in old oil so we ordered a new batch.  The dip was not work almost $14. We all ordered steaks (i ordered the ribeye). The steak was good - nothing amazing. I will say that the sweet potato fries were phenomenal. Service was good as well. Still recommend this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vnKJNipNCE-i7UM8a95EyQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vnKJNipNCE-i7UM8a95EyQ/o.jpg"
      }
    ],
    "user_id": "9-sfZC204MD_mwX1nV_zuA"
  },
  "YfK6akyT-49e8ON2GoRYKA": {
    "date": "4/29/2017",
    "text": "Not really sure why some people like this place so much.   First off, where the heckers is this place located? It's like in some weird building...is it in a hotel? Business center? Mafia front? Who really knows?  We sat outside, and we were the only people there who were under 50 years old for quite a long time.   The pimento cheese dip was average. Pretty greasy. Cocktails weren't great. My chicken salad sandwich was unimpressive. I mean, it's just chicken salad, but I could taste the mediocrity.  Our server had all of the social charm of an ex-con. He was brusque and inattentive. Never refilled our waters, so we were pretty thirsty from the humidity.   I mean, it's going to taste better than fast food, but I'm not clamoring to return. It's definitely not worth the cost.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TLkPHRJX9yCJhy1kQXTe5Q"
  },
  "WGNOVmt7DSGxARATpU1Png": {
    "date": "7/11/2018",
    "text": "First I'll say I've been here twice before. Everything was fine. So we are tasked with finding suitable places for the occasional work dinner and I chose this place. Party of 14. The services was extremely slow - there should have been two waitresses for a party of that size. The food when delivered was delivered to the incorrect folks so that person kept saying \"sorry all of our table numbers are messed up.\"  Additional sides were never delivered - and again we are a party of 14. We ordered several drinks that we had to constantly ask about. After dinner we ordered several desserts - no water at the table. We asked. Then I went to the bar to get water. The warm butter cake was awesome but you really needed water. It's heavy.  I'd only come here again with a very small party. They just couldn't handle it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "62iJA4H2pWRFhafpQqhGaA"
  },
  "aVnUymnvNIY_D05NWMesjw": {
    "date": "7/21/2018",
    "text": "My wife and I met my sisters family from Pennsylvania's there for dinner. We had a great night. The service and food was outstanding. Stephanie, our server, was attentive and pleasant. I had the crab cakes, they were perfect. Everyone was happy and stuffed as we left.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yTtH1_41i5llMvLkzEqV1g"
  },
  "Ede3IPc1rb9z9A_iUeDqlQ": {
    "date": "7/30/2018",
    "text": "While my wife & I were visiting our son and daughter in law as they welcomed their 1st child, we had the pleasure of dining here twice. The 1st time was great so we decided to eat there again the following evening. Both nights we experienced great food and service. Our server Melissa the 1st time was great and we also met J. P. Swanson, the GM. He came over and introduced himself and also just really talked to us. Since we were into for a few days we decided to go back the 2nd evening and had Alex as our server. Again great food and great service. And again, J.P. stopped by and asked about our new grandson. J.P. also told us about the Village Tavern down here in So. Fla.  If you want great food and service check this place out! John A.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GTo6zPne68gsJQ6Ec3vdgw"
  },
  "DcZdU5KclVrzqTABwB1Yzg": {
    "date": "11/13/2015",
    "text": "(Update) What I can say is the only issue is the service. Sit at the bar or try to get anyone that has hair or has an American accent to count on your service being great or better than great.  I Love their food and their management staff when something goes wrong, they go out of their way to fix it.  Use caution they have so much on their menu all the ingredients are not listed on all items at this time, so if you  order something like a contract make sure you read the fine print that not everything is listed.  Please check it out and keep your expectations reasonable and I do not think you will be disappointed in the food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4o0KkpAkyO6r0NHXmobTeQ"
  },
  "U65pD4kH86AUQk-XjeP0HA": {
    "date": "10/12/2017",
    "text": "Standard charlotte tavern/fare. Above average sandwiches and burgers.  Don't miss out on the thai chicken nachos and the relaxing patio on one of those nice charlotte evenings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_pOEDJODvaBQwr_KMdG0LQ"
  },
  "7gs7N-iUc_VCe-HnXwVblg": {
    "date": "9/15/2016",
    "text": "Brunch at the Village Tavern was recommended to us as we just moved here from Cali. The French Toast had a delicious vanilla taste to it that I really enjoyed. I didn't care for the \"hash browns\" that it was served with. They definitely weren't hash browns, they were more like dinner potatoes. The side of Applewood Smoked Bacon was pretty good. My hubby had Southern Shrimp and Grits, which were good but very buttery. He devoured it.   We enjoyed our mimosas on the patio under the bright yellow umbrellas on a Sunday afternoon. I deducted a star because of our server. We had to constantly call for her attention since she never checked on our table and she was short when talking to us.  Overall nice atmosphere and good food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kLEFEFmedWMPv-NNpcXTcg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Sunday Brunch on the patio!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kLEFEFmedWMPv-NNpcXTcg/o.jpg"
      }
    ],
    "user_id": "DNhXVl921KYzSEn8s1kMlQ"
  },
  "C5T6C0EFa8eFyiRAdBpYZg": {
    "date": "9/9/2017",
    "text": "After evacuating Florida and S. Carolina due to hurricane Irma, we arrived in Charlotte, NC. Our hotel recommended this restaurant and we were  so pleasantly surprised!   The food, the atmosphere and the staff were fabulous! The welcoming staff, especially Nash, the mgr. ,was so helpful. The food was delicious..... great menu and large portions! The restaurant just underwent a $500k renovation and it looks great!  When in Charlotte stop here for brunch, lunch or dinner and enjoy the outside firepit! Yum!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rNHl5H6Lf1ASAR_FzeGCqQ"
  },
  "ggT8D7uKM5GErJHW_iftHg": {
    "date": "12/31/2018",
    "text": "We love Village Tavern! Everything is always delicious and the service is impeccable!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ylDsJV4mguyt6VlLzaV4cw"
  },
  "5eFNTDg37Ybod2eHyT4LNg": {
    "date": "4/19/2018",
    "text": "Beautiful patio to enjoy a refreshing beverage. Shared the spinach dip with my spouse -- it wasn't bad, but the cilantro, which was prominently listed on the menu as an ingredient, was undetectable. I suspect it was omitted from our batch of dip. Service was spot-on, so I won't deduct a star for the missing cilantro. I would probably enjoy that lovely patio on a beautiful day with a solitary piece of toast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNjj-uGmFVHz9rhIxUuvYw"
  },
  "vqOWxGrqbWgUMYexhkZ1XA": {
    "date": "8/4/2017",
    "text": "Great burger. Such a wide variety of items on the menu. Service was great. Super easy lunch time spot. Definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1w8gtv2rTiUHhNZ9v6cCNg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Pimento bacon cheeseburger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1w8gtv2rTiUHhNZ9v6cCNg/o.jpg"
      }
    ],
    "user_id": "-m9VlH-YZ3DDTlelvaj9LQ"
  },
  "Fv35PBGqhPeDA_Px_GAedQ": {
    "date": "11/28/2016",
    "text": "The food, the service, the ambiance, everything was amazing! For my appetizer I had the crab dip which was creamy and didn't taste too fishy. There were so many options on the menu that all sounded delicious so it was a hard choice. I ended up going with the Cajun Seafood Fettuccine with the Tavern salad and I'm glad I did! That had to be the best starter salad I've ever had. The veggies were fresh and the bacon was crispy like I like it. The seafood in the pasta was fresh and plentiful and the sauce had the perfect amount of spice.   I can not wait to go back and try some of the other menu options!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3oQC2C83lFLDyNCv7BFrrw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Cajun Seafood Fettuccine",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3oQC2C83lFLDyNCv7BFrrw/o.jpg"
      }
    ],
    "user_id": "GnS71POxE5o2Uell9V_2Zw"
  },
  "6VcPHRejn2-DwnjPdEj70Q": {
    "date": "5/31/2017",
    "text": "In town for business, so I'm a great big party of o-n-e.  After looking at reviews for places within walking distance of my hotel, I decide on Village Tavern (figuring the food looks good and I should be able to get a seat at the bar because according to reviews, this is off the beaten path).  Not only was the place packed - but there was no room at the bar.  After looking around (discouraged) I went outside to head to my backup choice.  It was then that, I assume, the manager comes out asking if I'm looking for seating for one and would I like to come back in he has a table for me in the back.  My server, Amanda, was friendly and wonderful.  New Yorkers can be plenty nice but we hate the phrase \"the big apple\".  Not sure how folks from Charlotte feel about \"southern hospitality\" but this was True southern hospitality.    Ordered a cab to drink and the ahi tuna entree salad - both delicious.  Then splurged and ordered sweet potato fries - which are as great as other Yelpers say.  Thanks, Village Tavern, for making this New Yorker right at home in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Aivizwfckqp4jrUpGflffQ"
  },
  "CXKu5V0RUsc3w9VsBf1rcQ": {
    "date": "10/3/2018",
    "text": "Their crab cakes were amazing. We came here during a busy time and the waitresses/waiters were adequately attentive despite being busy. I had always wanted to try this place and its not a visit I regret.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QqN0ofMXo_lYg7cl4ZhZMQ"
  },
  "Zjzm9VlDrTwvs1forWUJ4Q": {
    "date": "8/6/2017",
    "text": "The food is very good, but service is super slow. Maybe they were short staffed?? I got the Chicken Marsalla, chocolate torte for dessert, and a blueberry mojito.. Drinks took about 20 minutes to come out. Also when I ordered a decaf coffee to go with my torte, it came out cold.. Overall not impressed, unless they can speed up service, then this place could be awesome.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M-4btdSsSNB5xaReeQB7yg"
  },
  "WQx7i1Mh0e1iL-GLORqzgw": {
    "date": "8/10/2017",
    "text": "We had a business dinner here and it was excellent.  The restaurant has a great selection of local and regional beers, standard beers and mixed drinks, so everyone was able to get what they wanted. The ahi tuna appetizer (we shared) was excellent, as were the spring rolls and the bacon wrapped scallops.  I had the rib eye steak and it was wonderful.  I asked for it charred on the outside and mooing on the inside and that is exactly how it was delivered.  Marvelously flavored and exceptionally tender.  My sides were equally exceptional and I don;t think anyone left a single thing on their plate. The service was prompt, friendly and fun.  We were looked after without feeling that someone was constantly hovering over us. Great place to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3QOXeNdpBii3Ei2MOYquQ"
  },
  "iYbpvpqqv3bf6F3KMJf2qw": {
    "date": "10/25/2018",
    "text": "Well the rating all depends on what I am rating.  The food is great!  The service, well then that is a different matter.  It all depends on who the server is, several of them are fantasic and others specifically Alex (a woman), and Stephan need to find another occupation!  Working with the public especially serving the public is not their specialty!!! It doesn't help to bring issues to the management team either which is VERY disappointing!!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tHZUDURtx7t-xrxpiTTDw"
  },
  "0l8p_rcSR6Ge3JD790u69w": {
    "date": "9/6/2017",
    "text": "We tried Village Tavern for lunch. The sweet potato fries were excellent, but the burger left much to be desired. I ordered my burgers Medium and it came out on the rare side of medium rare. Half price glasses of wine made up for it though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbYLTYRIzPP9SqJvUsp4jQ"
  },
  "2zO0evEbZg8QD9Xsw0a9eQ": {
    "date": "1/31/2017",
    "text": "Excellent, fresh & delicious food! Exceptional quality of food! Service was terrific as well. One & only drawback is dated decor/atmosphere, otherwise a great place to eat!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EwXx0oXo_WHGXTtUpsN_hw"
  },
  "yxyXY3PJ4ZXg693-aynl6A": {
    "date": "5/8/2015",
    "text": "Best Shrimp and Grits EVER!!!  Quick service  Large variety on menu  Recommended by many",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "78-gbeGIlu8sRZKzGWHjeg"
  },
  "F8mj8RIcNhYBpDva187VXw": {
    "date": "11/20/2015",
    "text": "Great place and super friendly ... I love that from outside it doesn't look like it would be a nice restaurant ...but I was very surprised. It's a cute date night/ business dinner kinda space also I did expect more from the food but it wasn't horrible...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Mlu_Wsavo2KqV65TfPLrog",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. The Meatloaf... my only concern was it tasted like Bison, it was thinly sliced, and tasted deep fried.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Mlu_Wsavo2KqV65TfPLrog/o.jpg"
      },
      {
        "img_id": "57Io4_nVFVoGj3pT8XmPyQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Shrimp and Grits... The Grits was very creamy that&amp;#39;s a plus but the Shrimps was mildly flavored and buttery.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/57Io4_nVFVoGj3pT8XmPyQ/o.jpg"
      },
      {
        "img_id": "D-nH2GEEgdExtJLB0SY8rg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Palmetto Deviled Eggs... Very rich flavored but that Bacon tho super delicious and savory",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D-nH2GEEgdExtJLB0SY8rg/o.jpg"
      }
    ],
    "user_id": "lnVUOrQVbQjYljC9ufKMiw"
  },
  "1Jmp6QC5Ilv4kBIIQGD3_w": {
    "date": "10/18/2015",
    "text": "Food is good and the service is prompt. The servers could use more personality though. Kinda dry and formal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qDIQwEZkVnxNmR7y6c_b3g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Eggs Benedict with Spinach.  Very good ‼",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qDIQwEZkVnxNmR7y6c_b3g/o.jpg"
      }
    ],
    "user_id": "KZbJtiPRKX0ScIRu_Y5Cjg"
  },
  "eD5nktAgGf8MVfAZ9zS2YQ": {
    "date": "1/21/2015",
    "text": "Great food Great Service Great Atmosphere As a person who travels often I dine out a lot. It was refreshing to got to a place that is casual with great food. Our server was attentive and it was a great experience.  Thank you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "X9kCoEveyZ0WEpz2cC0pDw"
  },
  "Dez7Iu2FNPY2X-ZqXO9zIw": {
    "date": "1/10/2017",
    "text": "We enjoyed a lovely lunch there today.  I had the crispy chicken sandwich, which was excellent.  My roommate had the meatloaf which was wonderful.  We also had the calamari for our appetizer and it was very tasty.  Our server Andrew, was outstanding!  He had an excellent and engaging personality, offered clear and measured advice about the menu, and resolved a dessert issue with both humor and diligence.  I would very much recommend this place as a family friendly establishment (both kids enjoyed their food) with traditional fare done very well at a reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ynlrnAZ-wSQI72tN5VVl1g"
  },
  "yEJ8S6tjXEZ7MwQNr3iiOA": {
    "date": "9/27/2016",
    "text": "Had lunch here today Ordered caprice salad and 5oz fllet with ff and green beans Everything was great and seasoned very well Beans were ok but I like them a little more crisp Dessert was carrot cake very good and very sweet and served warm different also had expresso was ok but they need to make foam   however was served with a lemon which is the correct way Norwood my server was good Place very busy Will return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq95ut3ReIzR_30YJxyXug"
  },
  "_tLqWfK0-l2h07pKTEHDOA": {
    "date": "11/6/2017",
    "text": "We came from Staten Island, NY to visit some friends. They had never been to this restaurant before, but other friends of theirs recommended it so we thought we would give it a try. We went for lunch  today, Monday, November 6, before they took us to the airport. Our waitress Julianna, was courteous and very professional. I ordered a sangria, she brought a glass with some liquid in the bottom of the glass and some fruit, I thought to myself what a small glass of sangria. She then proceeded to pour a small bottle of prosecco into the glass.  It was a very tasty glass of sangria, very different. I ordered the crab cake sandwich, which I thought was one of the better crab cakes I ever had. This is a great place to try, and the prices were reasonable. Nice atmosphere! Great all around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h8lbJnuLlEBcy4LM9G6Kfg"
  },
  "bNc88qIV3F-rDRGVUp6t6A": {
    "date": "3/12/2016",
    "text": "My post is mostly about the staff attire. My adult beverages were tasty, my Flatbread pizza was yummy and the outdoor patio was awesome. Our server was great and intelligent.  Here's my gripe and it doesn't apply just to this business.  I'm not old or crotchety, not even 40 yet but I absolutely hate seeing restaurant staff in black yoga or spandex pants. There's no class in yoga, pants and slacks is more appropriate.  Please no more yoga pants.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oovnv51Qp8-RKJ402-jHWA"
  },
  "k9B_Z-xOhGUFWA07Ec-b9Q": {
    "date": "9/17/2012",
    "text": "You know what, I like this place.  It is easy to forget about good ol' Village Tav!   They are tucked away and removed from the mainstream \"southpark area\" so it is easy to forget they are there!  But, I am glad that we stopped in this past weekend.  It was a good reminder that this staple, south Charlotte location has every right to still be alive and well.  I ordered their spaghetti zucchini/squash dish.  It was incredible.  It had fresh broccoli and cauliflower mixed in with the garlic/olive oil and tomato sauce.  It had great texture and flavor and was just the right portion!  I left feeling healthy and satisfied!    Hubs ordered a \"gourmet burger\" but the only red flag is that he was not asked how he would like it cooked.  That can sometimes mean frozen patty or that it isn't made to order in some way.  It ended up being decent but not amazing.    They have so many  great options on the menu to choose from, such as pizza, fish, sandwiches, their homemade potato chips, dips, nachos, pastas, etc.  There is certainly something for everyone.  I had their crabcake meal a few months back and I have to say it was the best crabcake I have had in Charlotte.....hands down.  It had huge pieces of crab that were juicy and very fresh pouring out of the patty.  It was not stuffed with breadcrumbs or some other filler...it was really 95% crab.  It was a while ago that I had it so I need to get an update on the crab situation soon .    The atmosphere appears to be a bit pretentious when you first walk in.  It is lined with dark wood, a pretty vibrant bar scene, candles and dim lighting.  The outdoor patio is huge and they have a ton of specials going on throughout the week, including live music.  The prices and the menu itself let's you know that they are down to earth and you are welcomed even if you didn't just wrap up your 18th hole.   Are you going to see some loafers and khaki's?  Sure.  But were we perfectly comfortable in our jeans, beaters and t-shirts?  Sure were.    Overall it is a diversified spot that has many benefits and is worth keeping on your radar for a decent night out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "bARJiMsRbopARbT1QFVXYw": {
    "date": "7/2/2017",
    "text": "brunch: really great food. not sure how they can charge $5.40 for two black coffees, and keep a straight face. service is good too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BWB9zU6iGKXi3V607mGumQ"
  },
  "LqftyDsDPMG769Uuz3tF6w": {
    "date": "11/30/2016",
    "text": "Though this restaurant can be a little hard to find, it is well worth it. My wife and I literally just had one of the best meals we've had since we can't remember when. Dip Duo, mixed salad, Colorado Chicken, Filet, vegetables ... Wine ... All were excellent! Highly recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b75BXeX03WCTKlM3DNfAIg"
  },
  "CPAqzGTW4B0cuwc163cVAw": {
    "date": "6/10/2014",
    "text": "When I first started in the construction industry 15 years ago, before SouthPark was packed with every kind of restaurant imaginable, the place to see and be seen after work for my crowd was the Village Tavern patio.  Good times!  Flash forward to 2014...  I have been maybe 3 or 4 times in the past 10 years.  With my visit in June 2014, I noticed that they have remodeled extensively (my waiter said Labor Day 2013).  Gone is the heavy wood paneled wall that separated the bar and the dining area, the area is now very open and quite lovely.  As another review stated, the parking lot was deficient to begin with and now that construction barriers are blocking off one street, it is even worse.  Luckily,  I was early, so I was able to find a spot.  Had I needed to search for a spot, I would have crossed the street to SouthPark.  My waiter was pleasant enough, I recognized him from a previous visit, so it would seem he has been there for quite a while.  My drink was kept filled, food was brought promptly and smoking hot.  The food: Spinach Dip ($8.75) - Just as I remembered it - this is not your typical spinach dip.  While creamy and loaded with spinach, there are chunks of tomatoes and a definite jalapeno *zing* under the melted cheese topping.  I would like the tomatoes to be a little smaller, but that is a personal preference.  Served bubbling hot with tri-colored tortilla chips, this made a decent starter.  3.5/5 Gastropub Burger ($11) - Well, I didn't love it.  The caramelized onions were kind of tasteless.  The flavors didn't do it for me, it just tasted rather mushy and off.  With that said though, the burger itself was very juicy, cooked to medium perfection, though maybe someone was a little heavy handed with a peppery seasoning.  The bun also held up pretty well to the messy toppings and juicy beef. The potato salad that I got as a side (they also have fries or sweet potato fries), tasted exactly like the red skinned potato salad that Harris Teeter has, but it was sprinkled with bacon - it was good, and not overly mayo'ed.  2/5 (I would not order this burger again, but I would try another of their burgers, those coming out of the kitchen looked quite good).  Overall it was a nice visit.  With all of the food choices in the area, I don't know that I would rush to return, but it was a nice enough meal with good service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_UUCG81Mwnx04bbYRjz00w",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Gastropub burger (burger, caramelized onions, gruyere, mayo) with potato salad (sprinkled with bacon!).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_UUCG81Mwnx04bbYRjz00w/o.jpg"
      },
      {
        "img_id": "c5Gtoqc1Wc7amScEuG2kag",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Spinach dip (with a jalapeno kick) served with tri-color tortilla chips.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c5Gtoqc1Wc7amScEuG2kag/o.jpg"
      },
      {
        "img_id": "ChTNgoIepfEtKYpAnALtiQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Water is left on your table in a lovely bottle for you to serve yourself.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ChTNgoIepfEtKYpAnALtiQ/o.jpg"
      }
    ],
    "user_id": "zsZBYWYEmLLs81_f-HHM8w"
  },
  "LHV1Dd-t3_LB33Q8HYx2fw": {
    "date": "7/11/2016",
    "text": "This place is awesome! I had the salmon blackened and it was seasoned and cooked perfect. The mac & cheese is amazing. Will definitely return again. The service was excellent as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4sA5G9r3KAY4vX4fKTf6A"
  },
  "s4A5NVUF4oWvG31GRn5lcw": {
    "date": "6/28/2017",
    "text": "Seems to be more of a bar crowd. one hour wait for salad and Salmon. Salmon was very dry, over cooked and was loaded with butter. Not prepared with good health in mind! Salad was small for the price and again, loaded with salad dressing! might be a great place for a drink or burger. Probably wont be back anytime soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YcavLAfSkOvqNMf4VskO5Q"
  },
  "zjmW88DWZxR3Ayggr03hkg": {
    "date": "5/28/2017",
    "text": "My boyfriend brought me here for dinner and I wasn't sure what to expect. I associate Tavern with Hickory Tavern. This is nothing close to it. Tavern is all they have in common. The restaurant is very nice although, we opted to sit outside. It was the best choice. They have such a pleasant outdoor seating area. The staff was very quick to help with getting our table set up. There was a light breeze that evening, music was playing and they have strung lights that come on. I enjoyed seeing the green grass and the trees swaying in the wind. We ordered the crab cake dip and we were worried it wouldn't come with enough bread. We asked for the bread basket but it turned out that the bread that comes with the dish was more than enough. I ordered coffee and it was perfect. The crab cake dip was so good. I ordered the crab cakes and they were very meaty and accompanied by the tarter sauce, they are the best crab cakes I've ever had. The drinks, the food, the service and atmosphere are perfect.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nwb6gPI79b_a8FYr4JbOjQ"
  },
  "sLtycQ9z_1e-yBLY9hkzPQ": {
    "date": "2/12/2016",
    "text": "The service is always wonderful here!  They're sincere and truly friendly. The food has always been exceptional as well. It's one of my favorite places in Charlotte I can't wait until it's warm to enjoy the patio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "D9VXiaqwfWMGM7RGl0aFbQ"
  },
  "moSyQTdyQHNVQWRQMcQIXg": {
    "date": "7/1/2017",
    "text": "Food was excellent. For coming from out of town and looking for good tasting food, this fit the bill just fine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cMHT5JXj4qBfekph1ejx9w"
  },
  "yiJofwt7VC6Bkr12YSqtkg": {
    "date": "8/22/2016",
    "text": "Always been a nice little place and never let down with my order. I have had a variety of items on the menu and always pleased. The outside is nice when weather is permitting! Staff is friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pG0PV0YnFyY_XJq9S-gM1w"
  },
  "uhBgMQMs0HGSJ0qjSPvSgw": {
    "date": "8/15/2018",
    "text": "Village Tavern was the first restaurant I ever visited when I lived in Charlotte - I have been back countless times since and every single time have left having an AMAZING meal. They are consistently great. The service is phenomenal (Andrew is our favorite waiter!!! We always ask for him) & the menu is so extensive! Have had many things on the menu but for sure my top highlights are the bacon wrapped scallops, crispy chicken tacos, mac & cheese side & carolina burger - just to name a few. If you are in the area this is a must!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sv6mwFXEHwq_dszDuwErrw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sv6mwFXEHwq_dszDuwErrw/o.jpg"
      }
    ],
    "user_id": "yaK6JKQO44zeKh973B4D-Q"
  },
  "1JXg9WD4e0aor8iZhMMXtQ": {
    "date": "5/26/2019",
    "text": "Went there on Sunday for lunch. Noticed a number of tables were not bussed as well as many places at the bar. Decided to sit at the bar for faster service...bad choice. After sitting at an in-bused seat we waited for 15 minutes with NO greeting, help, etc. did notice though that the manager in charge had plenty of time to feed herself olives from the bar stock. I think this place is relying on the past to remain relevant.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xR_30GgQK8JCuz1UxktO3w"
  },
  "jxEsWL1NKL8eefOXdoVynA": {
    "date": "10/11/2016",
    "text": "You'll be blown away by the fab interior once you step inside from under the unassuming awning. This is my second visit, even though I've been wanting to come for months. The few times I could have visited, I didn't feel dressed enough to have a sit down. There were patrons dressed casually, but mostly everyone was a dressy casual.  I planned to have some calamari as an appetizer since I didn't try it last time, but my date chose the hot crab dip, and it sounded great to me. It tasted even better. I think he was saying it wasn't lump crab, but I couldn't hear much over my internal humming- the dish was great anyway. We even split the last chip! LOL   While I waited for my Cajun pasta, he had a salad and soup, both to his liking. He also chose the special Chilean Sea Bass with asparagus. We were taken aback by the small portion. At first, I thought it was a side, but that was his meal. Thankfully he ate those other dishes before. He said it was splendid, but felt that for the price a bigger piece would have been the right thing to do. I on the other hand, had more pasta than I could handle. The scallops were big and juicy! Perfect bites.  I still haven't made it out onto the huge patio yet, maybe next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AITJWVBZE2t5lcChMfRRpQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Sea bass",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AITJWVBZE2t5lcChMfRRpQ/o.jpg"
      },
      {
        "img_id": "H0PbkReHBzs_vBxTt5n4AQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Cajun seafood pasta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H0PbkReHBzs_vBxTt5n4AQ/o.jpg"
      },
      {
        "img_id": "xV_AEd4ZcCMfmQTbxdIgnw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Crab dip",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xV_AEd4ZcCMfmQTbxdIgnw/o.jpg"
      }
    ],
    "user_id": "7U3H1iJZ04FbadJtt2Npjg"
  },
  "sDEjOARkS5mp8nLpwmudoA": {
    "date": "8/22/2018",
    "text": "We just keep coming back.  The crab dip is very tasty and I love the warm pita bread served with it.  I tried the sweet sriracha margarita and it didn't disappoint.  It was delicious.  I will be back again...and again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dHRchS7reL10P-EpYXYUiA"
  },
  "QUglsAfNMl0Wk-CsasoaHg": {
    "date": "3/15/2018",
    "text": "Not sure why I forget about this restaurant, but I do.  It has been in the Rotunda Building for as long as I remember.   Today, I met my friend, John L, for a long overdue catch up session/lunch.  Could not find a salad that I wanted, mainly due to bacon bacon and more bacon, as well as other items that are not my favorites.  So, I got the grilled salmon with green beans and sweet potato fries.  They nailed it.  The salmon was cooked exactly as I requested.  The beans were delicious and the fries tasted like they were coated with cinnamon sugar.  What gets better than that?  The fries were served with a honey mustard sauce for dipping.  Yum yum yum!    This restaurant has a certain classy style.  It is not stuffy, but not too casual.  Service was efficient, however the server could have been a bit more engaging.  While I wish there were some different salad options, there are many other good dishes on the menu.  Plus, I realize that most people are huge bacon fans.  The bar area is elegant and I think it would be fun to just go sit there sometime.  I need to return here more often.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "FsaU0NW3IoQks55duFd2yg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FsaU0NW3IoQks55duFd2yg/o.jpg"
      },
      {
        "img_id": "jMDb9brECHKjq7sp3cN82Q",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jMDb9brECHKjq7sp3cN82Q/o.jpg"
      },
      {
        "img_id": "jtzwGpmL_S_erXrspGqEjg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jtzwGpmL_S_erXrspGqEjg/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "SzpEVQuBskLACEd-7HeT8g": {
    "date": "1/12/2019",
    "text": "Absolutely perfect! I had fried oysters, the home made tarter sauce had little chunks of dill pickles,  wedge salad with blue cheese and sweet crunchy bacon pieces unforgettable!.... Simple and perfect, but the Prime Rib full cut made me smile, my preference is med well done and ordering steak can often be iffy, I was amazed at how perfect my steak was,  roasted to perfection, no need to pick around to avoid too pink/red or too dry areas ; the knife glided thru piece after piece,  oh So good! What did I have to drink.... Jalapenos Margaritas! Restaurant ambience, service and almost too many menu choices... I can't remember a better dining experience in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FymEaUmx5--YuSVseocDWw"
  },
  "Kjmk7lbVVAoHGQkzleFr4A": {
    "date": "11/5/2017",
    "text": "What can I say -- this is one of my favorite places in  Charlotte.  I love the ambience, bar, noise level good, food and service are great. I was in town for only a couple of days, and this place was on my mind.  We typically bring our own bottle of wine, and their cork fee is minimal. We had a late reservation, so got their early, sat at the bar--great cocktails and had the crab dip.  Once we sat down for dinner, my dining companion and I both had the steak au poivre - can't beat it!!! Overall, always a wonderful experience, the wait staff are always personable, and the ma get makes his way around the dining room.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVndZxvQAnZ59AT9xLckRg"
  },
  "Z2TqAiL2dOnYwfOEVVQB_Q": {
    "date": "6/17/2018",
    "text": "We came on Fathers Day to this establishment and was nothing but impressed the wait time was a little long but that was only because it was Fathers Day so it wasn't to long, and they always kept us updated about the table. I had the salmon with green beans and Mac N cheese. I asked for well done Salmon and it was cooked to perfection the sauce was good. We had the spring rolls as a appetizer and that was good. The best of the meal was the Warm Butter Cake...When I come back I have to get that it was so good. I would be definitely coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "X4-pNiQeQhmHw1wTbDDcgg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X4-pNiQeQhmHw1wTbDDcgg/o.jpg"
      }
    ],
    "user_id": "Ft-NtC6A2xFevDBquf12tw"
  },
  "z4Cx0FWUGNCr6gIP_20FRw": {
    "date": "1/2/2019",
    "text": "The food and cocktails will save this place every time. Service is slow which is unfortunate, the server did apologize profusely (I'm assuming short staffed). The Filet Mignon is superb and cooked to perfection, 10/10 would recommend. Other than lack of staffing this place is wonderful!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9UMSozQJEbLKNn-gUYoVyA"
  },
  "cndEFNlMT6boCiZZ9lm_8w": {
    "date": "7/29/2018",
    "text": "The whole experience was so good. The service started off shaky.. by the time we finished the appetizers.. we were so pleased. The food was terrific.. the ambience is pleasant. Our new favorite spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8IeILPFo2v4OWK1EpiC4cg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Great food better service. Very Chic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8IeILPFo2v4OWK1EpiC4cg/o.jpg"
      },
      {
        "img_id": "zFiv-stI7BiHD1dcVBFHvA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zFiv-stI7BiHD1dcVBFHvA/o.jpg"
      }
    ],
    "user_id": "_bkmz0GKpZdmOEhryfFBjg"
  },
  "bKJl8GehMrdkZ0O7FmHrkw": {
    "date": "7/13/2016",
    "text": "I've only been here once, but I loved everything about Village Tavern....  Food - Village Tavern has one of those menus, that has you wanting to try every single thing on the damn menu!  There's many different options to choose from, they all sound amazing.  Here's the three items I've tried...   -Hot crab dip is an awesome appetizer option, pita bread comes served warm and soft. -Chicken Club is one of the better \"clubs\" I've had in recent memory.  Its pretty much a chicken sandwich served with plenty of chicken, ham and bacon served on warm, toasted bread (see pics). -Chicken Colorado was awesome!  All of the different foods - the chicken, black beans, rice, cheese, tomatoes worked perfectly together.  I am not sure if it was worth $18.50, but then again maybe it was.  I can't say one bad thing about the food here at Village tavern.    Service - Sat at the bar.  The lady bartender/server was awesome.  No complaints at all.   Ambiance - As others have stated, Village Tavern has a very unassuming quality to it.  It's kind of hidden in the back of some office/retail park.  The only way to identify Village Tavern is by the janky, blue awning that marks the entrance.  But once you're inside, its quite a different feel.  Elegant, open, classy, quaint, are all adjectives that come to mind.    The only thing I regret is that I am just recently discovering this hidden jewel in the heart of South Park.  There's about 20 other items on the menu I want to try. The service and ambiance are above and beyond my wildest expectations. No doubt I'll dine at Village Tavern again and hopefully soon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "39y341CR6NK6l5-HMj1S4A",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Chicken Colorado w/black beans and rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/39y341CR6NK6l5-HMj1S4A/o.jpg"
      },
      {
        "img_id": "3ipB-wo8zTVwvQt5_raXhQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Chicken Club w/fries - fries are great as well",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3ipB-wo8zTVwvQt5_raXhQ/o.jpg"
      },
      {
        "img_id": "zgWH_5lCySoZsQ4BsZjC5g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Chicken Club w/ham and bacon! Awesome, simply awesome man!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zgWH_5lCySoZsQ4BsZjC5g/o.jpg"
      }
    ],
    "user_id": "R_wlZO-jKFGEVJnSfWISqQ"
  },
  "gUxNbtbc58OZqqJUQFNeFA": {
    "date": "5/11/2019",
    "text": "I love the environment but when I ordered my drink, an Arnold Palmer, it was too tart and watered down. I also ordered the Cajun Seafood Fettuccine for 23.95 and my noodles weren't fettuccine in fact my plate came out with angel hair pasta. My mother ordered the same thing and she had fettuccine and it tasted completely different from mine. Turns out they'd ran out of fettuccine but they didn't make me aware of this until I complained about the food. For this to be such a high end restaurant I am very disappointed. But my waiter Stefan was very apologetic and understanding on the restaurants behalf.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_tIbC356oaARfOOezNnXg"
  },
  "U-S6uP2dC9tTgK16TyajXQ": {
    "date": "6/29/2017",
    "text": "Went back for the bacon!!!!  Since I was hungrier this time, ordered the Chilean sea bass with sticky rice.  It was cooked and seasoned perfectly, melted in your mouth delicious.    Would order this again and again with of course a side of the bacon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "VxhQZjpD6GewWxnJGBzCTQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Hong Kong - style Chilean Sea Bass",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VxhQZjpD6GewWxnJGBzCTQ/o.jpg"
      }
    ],
    "user_id": "WoE8rLUh8Pu76lWw8soohQ"
  },
  "8n7C-wCQQRWRrPoJ8Ybklw": {
    "date": "11/29/2018",
    "text": "This is probably one of my all time favorite places to eat. The food is always good, the service is superb and they are very polite. One of my favorite things about frequenting this establishment, a sandwich they make but is no longer on the menu, the prime rib sandwich. They will still make it for you if you ask and they will even prepare it for dinner if they are not to busy. Hands down the best for the money. The same sandwich at 131 Main is DOUBLE and for some reason not as good. I have not ordered one bad thing from there and i have been going for over 10 years. I even frequent the one in Atlanta when i'm down there for work. Don't let a little bad press ruin your opinion or detour you from eating here. It will be a mistake. I will definitely be heading back in the next couple of weeks for another bourbon and a definite prime rib sandwich.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jm-XvLte1o5XUxYP-YP-YA"
  },
  "aVS8CvGgdHDVJD60KbybWw": {
    "date": "4/14/2018",
    "text": "The patio matched the food & service; lovely! I enjoyed the bacon wrapped scallops while my fiance's dish was the Bacon Jam Burger. Mine was delicious and recommend for a plate or to share. The burger was tasty, but I felt it could have used a bit more flavor; maybe grilled on open flame or smoke? The fried on the other hand were excellent: perfect diameter, texture and seasoning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vruhLNLY_PaeLSrG7-vK7g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. New awning color",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vruhLNLY_PaeLSrG7-vK7g/o.jpg"
      }
    ],
    "user_id": "eACxj9MP12DWf4aBIPX8aQ"
  },
  "_SdfrQ2YXgQFe-EbwXAMqg": {
    "date": "11/6/2018",
    "text": "Great in every way!   The firecracker as well as oyster tacos are extremely well put together.  Spinach side is awesome.  Ask for Alex.  She is a great server-best I've seen in years!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wz-e7fiJjLbxOvuudD8YHQ"
  },
  "JSH3s1SFBruaYZqgqvhh9Q": {
    "date": "9/20/2018",
    "text": "Mediocre. Maybe I ordered the wrong dish. Marsala chicken had minimal sauce and no taste of Marsala I could detect. It was maybe a 2 oz portion and this is not a fine dining/small plates restaurant. The dish was about $18.   My salad cane then the entree before I had 3 bites of the salad.   Convenient location to local hotels but I can't recommend it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONpTP68aIgol4i-w2aH5sg"
  },
  "AhF_w_xIoYkJW5FjtVo2Ew": {
    "date": "8/16/2018",
    "text": "The bacon cheeseburger was amazing. The service was a little slower than i expected..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6SPHRQw3leU-Xs98d_zJmg"
  },
  "FAfCEeYWFkskjSQGXVm-mw": {
    "date": "1/7/2018",
    "text": "Great Sunday brunch. Drinks were lovely as was the meal itself. Our waitress Mary Catherine was the sweetest, most attentive waitress ever. Highly recommend a visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5lrtJir0GAgyhpPZs88Sig",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. French toast on brioche bread, with a small side of house potatoes and a scrambled egg.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5lrtJir0GAgyhpPZs88Sig/o.jpg"
      }
    ],
    "user_id": "gDDGUo1GoRSkqkeq3EtsvQ"
  },
  "e__MVOuPCjrQTBN-oixO8Q": {
    "date": "3/31/2019",
    "text": "We have been to Village Tavern many times for dinner. Alway a great experience. Today we tried brunch. The menu choices were very good. Service was good. The coffee and the food both were served like warm at best. Need to be sure the food is served HOT as well as the coffee.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6qx6UTGlZeOoXAOyAJpeQQ"
  },
  "QAFmja5rNRH7-zeX1tANVg": {
    "date": "10/24/2008",
    "text": "We love this place--which truly has that Tavern feel, as you'll see--and usually eat here before going to the move theater at the mall nearby. It kinda has a weird location--you can't really walk to it from anywhere or anything, but it has a huge parking lot so it's easy to get to via car.   And get there you should. There's a great bar there if you're up for a drink and a huge outdoor area if the weather's nice; you can have drinks back there as well food. One time we were this summer a guy was performing while we dined, which was nice.   The menu is pretty extensive and American-y, as you'd expect at a big ol' tavern that pumps the food out, but it's surprisingly good (though not the healthiest place now that I think about it) and high-quality.   I love their salads--all of them (and they have a lot). Try the Greek with the grilled salmon if you want a proven (and healthier) option. Pair with some wine, and you're all set for a great meal. And that's worth mentioning: tons of wine options, all very good.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bduV2PTTGWKIIcPX6gjPrw"
  },
  "c4L3blJtiROmenaMmkpyag": {
    "date": "11/14/2011",
    "text": "I love Village Tavern - it's a Charlotte legacy. But, it seems to have been frozen in time with a predictable menu, a stale atmosphere, and a medicore overall experience in the first floor of the dated office building. What VT needs is a facelift - to redefine itself in the offering of Southpark cuisine. If the beat up wooden tables and furniture aren't enough, then treck down the long hallway to the mens or ladies room to get a sense of life in the 90s. I am cheering for you VT, show us what you're made of!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wz6nekYXj4wZ39UKgaVHJA"
  },
  "GTuAZ6hwvGcWnEfp5uUyiQ": {
    "date": "12/17/2013",
    "text": "Sitting on the huge patio with a glass of wine and live music on a nice night is what makes this place for me. The food is above average but not the most unique menu around. Also, don't be fooled by the humble entrance....I almost didn't go in my first time there. give this place a chance and you'll be happy you did!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UNrsJNUy6IzHIo-jST6LIw"
  },
  "APODO1Glt-01ffahg18d7A": {
    "date": "9/14/2011",
    "text": "My absolute favorite restaurant.  Flank steak sandwich, spinach dip, potato chips, and the tort.  I always want all of them and can never decide.  A must try.  And definitely sit on the patio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBxGcRtTwMFtTzURgg9vbQ"
  },
  "6gGR2MM0BrblO0gdC9dfwQ": {
    "date": "9/23/2010",
    "text": "Nice lunch stop. Had the crab cakes. It was good and service was friendly and prompt.  Maybe my rating would be even higher if I was there for dinner and cocktails. Will stop again when in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_juRpfIoSmt3_wRVlvKtA"
  },
  "dLQlxDFeW1gJ54akTV2lNg": {
    "date": "12/12/2012",
    "text": "This was my first visit to Village Tavern.  I went on a business lunch with a colleague and client.  The place was pretty busy, which I took to be a good sign.  Not so much.  I ordered the margherita pizza and it was absolutely terrible!  The crust was so hard I couldn't even cut it with my serrated knife.  There was a ton of oil/grease on the pizza and the taste was bland at best.  Definitely the worst margherita pizza I've ever had.  How do you mess up pizza?!  If I didn't have a client with me, I would have complained and ordered something else.  My colleague's food was cold and our client said her lunch was \"so-so\".  Maybe the kitchen was having an \"off day\"?  With all the other choices in the SouthPark area, I don't see me going back any time soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lqg5TlFPuJXT3XvZZRtIPg"
  },
  "0ZvIE2GvE0EPOUaWy5w7dQ": {
    "date": "7/30/2010",
    "text": "I wouldn't say that VT has the worst service in town.  To the contrary, it's actually fairly standard.  What I like about VT; homemade chips, patio seating (when the weather cooperates), subtle ambiance, regularity of the quality.  While VT isn't the most unique and fabulous place in Charlotte, it is good.  I've found a few favorites on the menu and they're always tasty.  I tend to get a modified burger at lunch and, for the price, it's totally worth it.  VT has been around a long time and has a good following considering its weird location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jpitcbcskoYPFg1W8Z0qgQ"
  },
  "ulQTbZ6Lk8u1XParGwnb8w": {
    "date": "6/29/2010",
    "text": "Love their Sunday brunch.  We had steak benedict and salmon benedict.  Everyone loved their food.  It's a great place to bring family on Sunday.  Our out of town guests love that treat before they leave.  Call ahead or make reservations.  They were packed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mvLssa31hEjjLyZZtYpMRA"
  },
  "rJKg0icF9yd0lhwCNuWzQw": {
    "date": "9/6/2012",
    "text": "Don't be alarmed this place is attached to a hotel! The food and drinks was delicious (omg those little muffins they give you) the servers were all amazing although they tried to take my plate at least four times before I was finished eating... But all in all a wonderful place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05N2bImLLaEUkGyMmCK4fw"
  },
  "PE3c3Zpj-6QKYHrMpjbe1Q": {
    "date": "8/20/2013",
    "text": "This place is fantastic. Ask for Cassie's section when you sit. She will take care of you. Drink specials every day and fantastic food selection. A little hard to find but you'll be glad you did when you do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hig_P_awjXTKJhDo1jqkNw"
  },
  "KFxTlfIPIGwEgaAisin8Lg": {
    "date": "5/15/2009",
    "text": "Worse service in town.  Food is average at best.  Prepare to be ignored.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sz84_SyrNYi4wsX__6haLQ"
  },
  "OUrY6C0dPILLbJmUZecV8g": {
    "date": "3/25/2007",
    "text": "Village Tavern is one of my favorite places to go for lunch in Charlotte. They basically cater to all, so you can always find something for everyone here - and they've got a great selection of salads and sandwiches. It's a good place to meet friends for lunch and catch up, and getting a booth seat makes the experience more intimate.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Sc7T4XlLnqhvk6bk0I6iFA"
  },
  "MwrXevwvX1UrCe9qUSQkuQ": {
    "date": "1/23/2009",
    "text": "Pricey, high class, good quality food! Not too pricey though. You get what you pay for. I tried the Small Plate Sampler appetizer and Filet Mignon for my lunch. The food is rich in taste, very delicious. Service is quick and very friendly. The place is crowded for a reason. Interior is very clean, cozy, warm, and a bit dim. Easy to find. There's absolutely nothing to complain about but lots to remember as you leave the place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGYPA6kmF8rdXf95tSMcYA"
  },
  "3Xi6kkljsqI-5lfGs7pYBA": {
    "date": "3/25/2012",
    "text": "yummy ! Tasty new England Clam Chowder with the appetizer wedge salad ! great taste and value . good , friendly service .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5uUOcTyKK1pQYwAL-Xrnw"
  },
  "bxxKO8wy72lJNGxrYo4SzA": {
    "date": "6/11/2012",
    "text": "Funniest dinner service ever!  I know that sounds odd but it's True.  5 of us dined here on a Saturday for dinner, drinks and food was ordered.  15 minutes pass by and still no food while an adjacent table is seeing proper timing on food and drink delivery.  Our food finally comes a along with one salad instead of three.  A little off putting so far.  Our waiter apologizes and we are all offered free dessert from the manager.  Dinner continues and drinks are frequently low with little sight of  our server.  The manager is roaming however and like clockwork 60-90 seconds after she walks by, BAM, table service.  Anyway, dessert time, two of us pass and the rest order 2 double decker cheesecakes and a chocolate torte.  Upon presentation we recieve 2 key like pies and 1 torte.  Poor server must be having a nightmare of a day with his manager right now.  So at this point we all five now have dessert and are laughing hysterically at how many times one guy keeps messing up.  Conclusion here was that he must be new so we let all this slide and just enjoy a good laugh at his expense.  I give this a 4 because I couldn't give it a 5 after all the debacles but all 5 entrees were amazing and the dessert was fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BPuTKrhY6X9aWqJ8MbuEDQ"
  },
  "xDCYR9KbeVbVrfchhXKgjQ": {
    "date": "6/16/2010",
    "text": "I should have known when we tried three or four other restaurants within a mile of this place and they all had 1-2 hour waits, and this one had no wait, that should have been an indicator! This is a place for people to go, when they want a really nice atmosphere, with decent service, but don't really care about  quality food. For the prices, $100 to feed my family (2 adult meals, 1 app, 4 kids meals and 6 soft drinks, no alcohol, no dessert), the food should have been much, much better. Every thing taste pre-made, like out of a can or jar, not pre-made at the restaurant. It wasn't bad food, just way over priced for low end average. I could have gone to Chili's and had better food for less than half the price. Or I could have gone right around the corner to Rooster's or Bricktops and for the same amount of cash, had excellent food. If the Village Tavern wants to see me again, I hope they took a picture, because I will never go back.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pHda0vL2e56dX8LE6IyT5A"
  },
  "Xw8bJS35fKCdz90Yb3aqXw": {
    "date": "9/11/2010",
    "text": "I recently visited The Village Tavern in Charlotte. We dined outside on the terrace and listened to great entertainment while supping on absolutley delicious food!   I had the steak which was perfect! My daughter had some wonderfully prepared fish. Our wait-person, Latisha, was a stellar server! Prices were reasonable.  This is a great place to remember when you are waiting in line to get in at the latest 'trendy' restaurant in South Park... it's half the wait for twice the experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "U9xrSClb-S685CQQZTuY_Q"
  },
  "OUxpnoyPGtzlHnkjSr9rFA": {
    "date": "6/28/2008",
    "text": "The bartender  embarrassed me by sneering at what I asked and standing there snickering with his lip curled instead of helping me with what I wanted.   And the first time I wrote this review it was deleted.   It is the truth, which is legally protected. (Polygraph me!!!)  The food is very good however and the wait staff other than that bartender was also very good.  The restaurant itself has a nice atmosphere and the huge, elevated outdoor patio is great in good weather.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T36mc6cJDso9D-gbDlqBLA"
  },
  "0mwlvNsZbjYFvJrJB8oAnA": {
    "date": "7/20/2018",
    "text": "I've been dying to try this place after reading tons of articles including village tavern in the best patios in charlotte lists. I finally went on a Friday night with a girlfriend and waited about 20 minutes for an outside seat. While waiting at the bar the bartender made us some awesome mocktails! This made waiting at the bar while pregnant super awesome and I really appreciated it. We arrived at our table and the patio truly is awesome! I ordered the pimento cheese and bacon burger and it was AMAZING! The bacon is glazed in maple and it's a sweet/salty heaven. Our waiter was great and attentive, will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  },
  "p6U34fiPP5zJAiHA3lCe_Q": {
    "date": "4/21/2019",
    "text": "Went here for my brothers birthday gathering and this tavern was nicely tucked away in a private setting. Of course, the first thing I check out when going anywhere new is the bar! They have daily specials and to my benefit, I happened to be there on $3 off classic cocktails. I ordered a old fashion spirited which was my first time having this beverage BUT my taste buds were immediately flattered. I proceeded to the table where he majority of his guest were already seated waiting for the arrival of the birthday boy. One thing I did dislike which explains the loss of stars is how no one approached the table to initiate appetizer orders, drink orders or anything until much, much later. I'm not sure of their policy but it just amazed me bc there were several hungry people there as well as thirsty. It didn't dawn on me until I had to get up again to order my second old fashion and I think by this time our server got the hint and finally approached the table. I ordered the calamari and oysters which were a little over cooked and tasted entirely too much like fried flour. All in all, I enjoy a nice drinking spot and maybe that's what this establishment is best for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dh0BM0JoxmitChKTxUIwcg"
  },
  "8UHWFfoJpBXDTO5YOFwfpg": {
    "date": "3/23/2019",
    "text": "Ate here for the first time today and it was perfect. Me and my boyfriend had the chips for the appetizer and I had a martini. The entree we shared was a guacamole burger with a side of mashed potatoes, and Mac and cheese as well. Definitely will be coming back here, loved my experience! Even cut the burger in half for us so that it was easier for us to share!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q2aFodV8zL_tgQvF1JSCHQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Chips",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q2aFodV8zL_tgQvF1JSCHQ/o.jpg"
      },
      {
        "img_id": "m3wURUiJhw7xt66VSyhYKw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Quac burger with mash potatoes and Mac and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m3wURUiJhw7xt66VSyhYKw/o.jpg"
      },
      {
        "img_id": "NJyR1o7WydUccqfxN3CyDg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Martini",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NJyR1o7WydUccqfxN3CyDg/o.jpg"
      }
    ],
    "user_id": "pxvNkO8A5K_ulEZCD-VWBQ"
  },
  "TWwbDT2tHMAHm_DrnFwdZw": {
    "date": "6/14/2019",
    "text": "Horrible service!!!! Sat down at 6:45 and didn't get entrees until 8pm. Came to celebrate my boyfriends 30th (which I called 2 weeks ahead of time for a party of 10) Waitress, Claire or something like that barely checked on us at all and showed obvious irritation at us. What irritated me the most was that at the end of dinner, when she brought the desert for his birthday she just said \"here\" and left. Literally have no idea why we received such horrible service from the start. Food was ok, but for the amount I paid for apps, drinks and entrees I will NEVER come here again for anything. though after the hepatitis breakout they would have valued second chances.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YBQXPwFNkGuiawX797aFcA"
  },
  "eeCDoz7E9ZFCCuxPHxHAPQ": {
    "date": "10/25/2017",
    "text": "I came here to meet a group for happy hour.  Everyone wanted to go here, saying \"yeah!  Let's meet at Village Tavern!  I love that place\"  I had no idea what to expect.  When I first looked up Village Tavern on the map, I thought \"Ok, that's interesting...it looks like it's in an office building.  I'm not sure how fun this place is going to be.\"  It took about five minutes of being there to fall in love.  The food was great (except they left a label on the lettuce, which was weird, but I pushed it off to the side).  I had a salad, although I really wanted to order a burger.  Ranch dressing was really good and I would come back just to find more things to dip in the ranch!  Wine selection was pretty strong.  Great bottle and by-the-glass selection.  I opted for a glass on the Slingshot...you definitely can't go wrong!  It's a delicious red.  Village Tavern has some great weekly specials, too.  Overall, a great place to come on a date or to meet a group.  The bar area is pretty big and they have several communal tables.  When it gets warmer, I definitely want to check out the patio!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "x2h881bY01Bk9eOPTiq9eg": {
    "date": "6/9/2019",
    "text": "WE came here to start my birthday weekend and was not disappointed, Kevin was good server but made some good  drink suggestions. I feel bad I forgot what I ate but I know we had a good experience. I look forward to coming here again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OCpz7-QUss_bodW3yBSGGA"
  },
  "KVCFZaGniYtizW8m7gPk1w": {
    "date": "10/19/2017",
    "text": "So, my friend & I have been here twice. The first time was much better than this last occasion.   LUNCH: Tuna Salad - over cooked! Appalling that they even served it to my friend.   Fettuccini Alfredo- tasted worse than a frozen meal.    They offered to bring us something else, but we both look at each other and decided to leave after the disappointment in quality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fYHb-0VWAaQfxr_Weyn9_g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Inside / bar area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fYHb-0VWAaQfxr_Weyn9_g/o.jpg"
      },
      {
        "img_id": "MyB154pHd7_ko2bZJ_INLA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Inside",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MyB154pHd7_ko2bZJ_INLA/o.jpg"
      },
      {
        "img_id": "lg8nTj0waZgHvFlTRvBvPA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Sanitation Score",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lg8nTj0waZgHvFlTRvBvPA/o.jpg"
      }
    ],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "jOhDmDHY3CTtjuMdU6ibZg": {
    "date": "5/30/2019",
    "text": "Service was great! That's about where the positives stop. We ordered tilapia with pasta and the ribeye with spinach and asparagus. The spinach was swimming in salt water - it was barely edible. Ordered ribeye medium rare - it came cooked medium well or even slightly well. The tilapia was extremely salty as well and the pasta had absolutely no flavor - it was just boiled angel hair pasta. Coffee at the end was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PsrQjxG9Kh70ILKoYTa2JQ"
  },
  "KRzo3PmBcRFHkUixCIYmZw": {
    "date": "11/15/2018",
    "text": "Village Tavern is always my office's go to restaurant when we have visitors or new employees.... Mainly because of location and convenience during lunch time. I always had decent service here but it's nothing to really go back to on my own dime. I always get the fish and chips and we usually order several items to share . There's so many options in South Park that I have a hard time choosing the Tavern as a first choice . I'm not sure what is missing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7n3E1tWpANHJKeeaC0TIBA"
  },
  "wSngzlOxnuvY3OLyfMXZFw": {
    "date": "9/4/2018",
    "text": "I came here once in the past and honestly vaguely remembered it being good but I never wrote a review. I had lunch today at Village Tavern and wanted to make sure I didn't forget again. They give you water for your table which is nice! We started with the crab dip which tasted great. The buttery toast pieces for the dip are awesome. I had the chicken cheddar bacon melt sandwich and it was really good! I am already craving another one. You can't beat their brioche buns. Shoe string fries were yummy and fresh. Friend had chicken club and thought it was great. Friendly service and food came out fast enough. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "dGUOe2TBchiGvU1BNkmTog"
  },
  "QZEc1qe3gVZV8lAG3mMGog": {
    "date": "5/26/2019",
    "text": "Village Tavern has been a SouthPark staple since 1984 but was redone not too long ago, a renovation that updated the whole restaurant and by adding new windows they have brightened up the place. The restaurant is a mix of booths, tables and high-tops. There is a large bar with maybe 20 seats and two TVs. They have a full bar and have a good selection of both beer and wines by the glass. Prices are fair.  The menu is extensive and the style is American-fare. They have super sandwiches and tasty burgers. The beet salad is excellent if you want something lighter. There is also a good number of small plates that are perfect for sharing.   Village Tavern has probably one of the best patios in Charlotte. Perfect for a pre Pops-in-the-Park drink and snack in June or a lazy lunch anytime.  Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_lT3o-DGAU2cHd2sQsl5g"
  },
  "2CTmPOQYqckiR5_gtQsN5g": {
    "date": "10/22/2018",
    "text": "I had the spaghetti squash and zuchinni and it was amazing.  The chocolate martini was to die for and I had like 3 but worth every single one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AV3oGv4qI7qOZtJ_H7LxBg"
  },
  "WCnKHENdE0xJ1zDCuvHMeA": {
    "date": "7/12/2019",
    "text": "Went here for lunch on a weekday and sat outside. Wasn't busy at all but our server was never around. I ordered a mimosa that looked off because it was yellow and the orange juice tasted sour/expired.  I asked for a new one and the manager responded by saying it should taste fine and that I should keep it?? Food arrived and I was given the wrong salad that had chicken added to it (which I did not ask for).  We then had to wait for a replacement as well after the server insisted it was the right one even though I did not order a salad with chicken. Very disappointed because this was our favorite lunch spot for awhile.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wqO_WD7e6kSikxgwD2k_Yg"
  },
  "oufviVQN6BkRDsxFLGQTSA": {
    "date": "7/14/2019",
    "text": "We love brunch here, especially in mild weather on the patio. Have been going here for years and love the Eggs Benedict. The waitstaff can vary from excellent to awful, depending on the day. The wait times can be excruciating unless we go early or late, both to get in and the waiting for service after being seated. That's a drawback for us. There's too much good food available in Charlotte to wait in line for it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ibe7PFSrA_ogf_3AUvv6fg"
  },
  "jSBdxttmqZZoxXrV1OqIyQ": {
    "date": "9/17/2018",
    "text": "Wasn't sure I was in the right place when I drove up but inside looks more like a restaurant.  Delicious salads served perfectly with attentive wait staff.  Definitely a well dressed Charlotte lunch crowd.  A perfect business lunch out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wklmU8CM7czQQBuhOC4k9A"
  },
  "i6ARJ3i4wZSsSh0zarfFJw": {
    "date": "10/12/2018",
    "text": "Terrible service!! Our servers name was Nicole and she ruined our entire meal...I wish I could give 0 stars. We got to our table at 6 and didn't get up to leave until 8:30! We would ask her for simple things and she'd come back 15 min later without it. In the end, we never even got a lot of things. We felt like she didn't care or take us seriously.  One thing that really bothered us was that rather than giving us our own drinks, she gave one person all of them and asked us to pass them out and did the same with all the checks! The food was decent but not worth the terrible service- I won't be returning!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YzBwv88BdrKlfIf_VWwow"
  },
  "hzxplDVuTtQXm02K-5m4Mw": {
    "date": "2/27/2017",
    "text": "Brunch here is a nice kept secret and be prepared for a good wait if you don't have reservations after 11 am for brunch.   The food was cooked to a degree of near perfection. I tried about three different plates considering we had a large group of about 14 people.   I ordered the Brie and bacon omelette and the Brie was cooked just right ! I have to say the best omelette still goes to pancake house on cherry street!   I tried the crab cakes and they were lightly seasoned and delicious with a light brown flaky crust.   This place can be difficult to find because of construction but more difficult because you don't think a restaurant belongs here. Be sure to google or yahoo map it here as parking is in the front.   Nevertheless, I think terrace cafe is better and Nolen's on Sewlyn , but I would say this place is better than about 80% of brunch paces out there and worth the try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "T7_DJ060wkeAq-aP0EkXzg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Village Tarven",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T7_DJ060wkeAq-aP0EkXzg/o.jpg"
      }
    ],
    "user_id": "wcubg4QbsWBhc5bjlkCdDw"
  },
  "n5fz8P9A1l9rr4SeDJY2VA": {
    "date": "6/23/2019",
    "text": "The service is awful. We sat at the bar for 15 minutes and were never greeted or even acknowledged at all, and it wasn't even busy. So we got up and left. Quality of food has also gone downhill and most dishes are hard to eat because they are so high in salt. Not worth it, there are plenty of better places to eat.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzO7CbPdMcJDtlX8CXrX4A"
  },
  "KLRZi3G4PyM8dPRrkIPAKQ": {
    "date": "3/31/2019",
    "text": "Great food, atmosphere, & prices. I love the chicken and broccoli pasta and the fried chicken sandwich. This is my new go to place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iMHlFkz_S60E8hyWLYZwlQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iMHlFkz_S60E8hyWLYZwlQ/o.jpg"
      }
    ],
    "user_id": "4QXfBC1yw9SsLoDLrCexEQ"
  },
  "tQ3Bu8JsPOskt92D8tL-ZQ": {
    "date": "6/18/2019",
    "text": "Village Tavern has been in the Charlotte area for years and for good reason! It's a great go-to restaurant. The good is great, as is the service. We know we will always get a good meal here. New - half price bottles of wine on Mondays. Who knew!? We definitely enjoy their drink specials! Our favorites are the margherita pizza or the loaded baked potato and a side salad. Love the Tavern house dressing...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvW_GJC1W0peHKIrs5EAbw"
  },
  "yASH-0_H92tVq48s50Xnxw": {
    "date": "6/8/2014",
    "text": "Good service, good food, good crafted cocktails, and nice atmosphere.  Several vegetarian and vegan options. (Could always have more: hint).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aG_u0b_0-WBoKEeZzSsP0w"
  },
  "drSzo8djX6cQKzW4Kpw3Og": {
    "date": "10/9/2015",
    "text": "Food was awesome. Chilean Sea Bass was so good. The prime rib was delicious too. The service was great. We will go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRHfQW7D3GnJbIb9qbXR4A"
  },
  "lmrKGHBBNY1jAcRCfndi5Q": {
    "date": "8/25/2014",
    "text": "Recently went here Sunday for a birthday brunch - there was only 12 of us, 2 seep rate tables, 2 separate servers. We sat down and it was over 20 mins before I got fed up and had to flag down a server for drinks. Another 20 minutes went by before the server came back to take a food order, god knows what was taking so long, it wasn't busy and I'm pretty sure we were her only table. The servers were all aware it's a birthday brunch yet made little or no effort to accommodate this. We had to wait over 20 minutes again for our food to start trickling in. 3 people got their food - 5 minutes went past, another two, another 5 minutes and 2 plates Came out. By his time some food had been sat there 10 minutes going cold and some hadn't even been served including the birthday girl! One order came out wrong so had to be sent back, finally the remaking food came out so we could eat. Mine was now cold as were others but we ate as were hungry. Once we had all finished the remaining plate came out to eat when everyone was finished.  There was no apology. No explanation as to what happens and why it all took so Long. The food was ok - slightly over priced for what it was but ok. If I had the option, I wouldn't choose to go here again and I feel sorry for the birthday girl here as no one really had a good time.  Of you go, make sure you have nothing to do for the rest of the day and take an iPad of book to keep you entertained",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iImnb-W4UaMsLsXd9Eq3EA"
  },
  "rwRO_nN0GIJWB2Zxt4mbKg": {
    "date": "8/4/2014",
    "text": "The staff here is top notch. They're friendly and very accommodating. I've never had a bad meal here. If you sign up, you'll get a free dessert or appetizer for your birthday AND anniversary. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kl4qWgFHMKuZIKIuWNE6SQ"
  },
  "VpO6IYv2vO9z1gkda7TlaA": {
    "date": "4/6/2016",
    "text": "Had a great meal.  Service was very good, they have a good happy hour with large selection of beers on tap.  I'd definitely recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uMqQvPG5NvTJoJ2vzGp5uw"
  },
  "rjl9Cv6SLp-il4fdubuDTA": {
    "date": "2/8/2011",
    "text": "I had lunch here the other day after having not been here in years... it certainly hasn't changed.  On a cold day, it was nice to retreat into the woody warmth of Village Tavern, and although it was pleasantly bustling with the business lunch crowd, we still scored a nice table.  I really do like the atmosphere, and in nice weather, the patio is where it's at.  They have a number of vegetarian dishes, all of which are helpfully marked.  I had the house-made veggie burger, which wasn't memorable but was certainly better than a frozen patty from a box.  In my view, they tried to make it a little too much like a burger burger and forgot that veggie burgers should be developed and enjoyed on their own merits.  Next time, I'll order sans lettuce, tomato, and mayo.  Still, it was a nice place for a work lunch, and since they have several veg. options, I imagine I'll be back for lunch in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "m74Y1rKAWoz_HvHRCEVbbw"
  },
  "8dvQvekGcloBBoTQGmpQPw": {
    "date": "7/15/2013",
    "text": "I grew up going to the village tavern in winston salem on the old reynolds property. My mother would order me a shirley temple while she had her manhattan. I am really happy that they have a village tavern in southpark. The food is always consistent and the ambiance is nice. I LOVE their outdoor patio, especially during the warmer months. I feel the prices are fair for the quality of food. The wait staff are friendly and knowledgeable and I  have always had a really good experience at this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYPwbbIS9q9puGf51Zslyw"
  },
  "OAKdEl4OrewYa5gOC15tRw": {
    "date": "6/10/2014",
    "text": "Upscale but friendly  Unlike some other upscale establishments that seek to differentiate their offerings via some exotic (read:  bizarre) ingredients in their dishes, VT sticks mostly to the classics and focuses on prep and presentation.  Appetizer, salad and entree choices are varied and quality is consistent.  Service usually strikes good balance between attentiveness and letting you relax with your drink or meal.  It's a popular place and the surface parking lot frankly inadequate.  One local access road is currently closed due to a massive construction project nearby.  Certainly not the cheapest but with the maddening similarity between far too many restaurants in the area it's a relief to find a place where the food doesn't taste like another rush job from a microwave, fryer or bain marie.  One might not expect a posh restaurant to draw families with kids but VT's proximity to the mall and residential areas means that the little darlings visit in their droves. The waiting area occasionally resembles a McDonald's PlayPlace with outside voices freely exercised.  For a bit of peace be clever about your time of visit, early or late, and/or sit at the expansive bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J32RPJT2j-H9ISH9AnHchw"
  },
  "bpb4Nx97W8zlQ3a-Msa2Cw": {
    "date": "9/30/2013",
    "text": "Awesome burger!    The place looks so great since the renovation!  Great dessert that's new!  Macadamia brownie with gooey Carmel.   And ice cream!   Meatloaf is a great entree as well!  Great staff and awesome head chef!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcjfCdSCzqLJ5clNRE-RCA"
  },
  "_axxRI1AsB8Prr-bVNZPKg": {
    "date": "12/18/2015",
    "text": "I've had the pleasure of Scott waiting on me three times now. I've decided he is better than your food. The food, by the way, is great. Just thought you should know how much I enjoy the food and service at your restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0GzWJAPXTlA0P7YR_wRrQ"
  },
  "Xci2ePOeycf2vlUVFEMyZA": {
    "date": "5/27/2015",
    "text": "New Favorite = Crispy Chicken Sandwich!! Our first visit to the Village Tavern was fantastic. The menu offers different flavors on old favorites. The food is delicous, fast and the service was great. Exactly what I expect when I go out to eat. The restaurant is also clean and beautiful, the type of place I like spending time in. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aPI3UJb9H4Ef-yVxmLDFeg"
  },
  "oRV4PJrDhuMG6__cKljSQQ": {
    "date": "1/1/2014",
    "text": "Really good place great food and drinks at bar and really nice hostess- I would look for Brittany to assist you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TH6eyr-g6iNlospxWRIvDQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TH6eyr-g6iNlospxWRIvDQ/o.jpg"
      },
      {
        "img_id": "GT0v_ehcdQfTaN7zM7Lf7w",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GT0v_ehcdQfTaN7zM7Lf7w/o.jpg"
      },
      {
        "img_id": "tEnHq4I7I4h3C8p8RwwyTA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tEnHq4I7I4h3C8p8RwwyTA/o.jpg"
      }
    ],
    "user_id": "pNTBQY4A61r4ePNd0CNj8g"
  },
  "zWVBAcnJ-Ka9hX-d-Qqwzg": {
    "date": "12/4/2012",
    "text": "One of my favorite brunch/lunch spots.. the mexican omlete is amazing, I sub the black olives for black beans (theirs are super good!), the seasoned potatoes are good, fruit fresh and the muffin hot and tasty. They have an excellent patio to dine on when its nice). I have eaten a few lunch dishes but their breakfast menu is the way to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "U4FWzhRvYeM1SbBHP0phxg": {
    "date": "12/27/2014",
    "text": "Salads today.  Caesar and Greek.  One with salmon and the other with grilled shrimp.  They've got a beautiful crisp Rose not on the menu which goes perfectly with the shrimp.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnmXtVFxAKf7XerPpq_FeA"
  },
  "OJOyO38TPu4SNukGFuIf3w": {
    "date": "12/17/2012",
    "text": "I was so inspired by my latest visit to VIllage Taven that  I am writing my first Yelp review!  I have been going to VIllage Tavern for years.  My family has always used it for a special place for graduation, birthday, etc dinners.  We went when my sister graduated from law school in August. We made a reservation since we were a large party, and since the table was not ready, we had to sit in the hallway and wait, as many of the older people in our party were uncomfortable sitting at the bar.  Then, they were out of most things on the menu, and the food that we did get was only average.  Not what I had come to expect.  Fast foward to this past Friday night.  We went again to celebrate a friend's graduation from law school.  His family had come from PA, so we wanted to take them somewhere we knew was nice.  We again made a reservation since we were a party of 16.  We got there, the table was not ready, and after some back and forth with the hostess, they wanted us to sit outside in a tent (maybe nice in the summer, but not in December), with plastic chairs and at seperate tables, where there was a loud party going on in the tent already.  We told them we wanted to sit inside and together, so they shuffled us back inside, where we continued to wait on a table.  We were repeatedly told that they were sorry, the party that came before us didn't want to get up, but never once did we see a manager.  The poor hostess was trying her best to accomodate, but we really should have spoken to the manager at this point.  We were finally sat inside (around 10pm, an hour after our reservation) and we were 4 seats short at the table.  They told us that we would have to wait until the table next to us got up, which seemed to be no time in the near future.  So, at this point, most of us are sat, some are standing, and we have been there an hour.    I have to admit, we were given four free appetizers (for the party of 16), and that just didn't make up for the experience.  I think after years of coming to Village Tavern, these two experiences have been my last.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yrom9LOu5NeAqXzRAGslew"
  },
  "133owzP_7aTO1Q_qpX6Kdw": {
    "date": "3/19/2013",
    "text": "Pros: Delicious food, great service, awesome patio seating, good drink specials.  Cons: Sometimes uncomfortable inside (too hot or too cold on multiple occasions).   Overall: Would recommend, can get a little pricey but it's worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3nsMwcftirYRa1TX6QHrWg"
  },
  "srzW1F0zQoWkK69p26_VrQ": {
    "date": "5/24/2009",
    "text": "I'm embarrassed to say that I went to the Village Tavern when I was told that they had homemade potato chips with some type of ranch dipping sauce, now although that sounds like a heart attack in a meal, I was game.   Well we were hesitant so they actually let us taste them for free. Now that's good service.   The food was good although not particularly memorable. I mean literally I can't remember what I ordered but the memory of the chips remain!  Oh that's right it was the scallops over fresh succatash which were  really good although not too filling.   Village Tavern, most random location ever, but the chips are good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "1JdAL6t5un5afI-aAFDBsQ"
  },
  "XAnoRv8QwEO50CYjEkbW0Q": {
    "date": "12/2/2012",
    "text": "I've been here so many times and am finally reviewing.  The food is consistent and great.  I can't remember ever having a bad meal here.  They update the menu enough and are adding new items, that I never get tired of going there.  We really enjoy the patio, weather permitting, to sit back, relax, have a few drinks and just enjoy ourselves.  It's a little oasis up there.  It's pretty amazing to me that they've been around as long as they have, and that they are not resting on there reputation (ie: getting lazy).  I've seen numerous restaurants that just get lazy after 8 years or so.  Keep up the great work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktrjGQ8hS90OO3bB_Y1ltw"
  },
  "WpWHyfqx6FG1SbYaXhAnPg": {
    "date": "3/27/2015",
    "text": "I did end up returning at the request of a friend and was treated very differently upon making my second request for a reservation. Thank you for being beyond gracious, kind and helpful the second time around! Sincerely appreciated!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S5MoEIN8RSrbbkBuJIZCCg"
  },
  "TnQkVPfMVJvQ_Tf4i1Ijgw": {
    "date": "7/25/2011",
    "text": "Such a shame that I came here during an awful heatwave, their outdoor patio looked spacious and nice. The place looks pretty nice inside with dark wood, warm colors, and dim lighting all around.  I went for the restaurant week menu while my date just wanted something light and ordered off the menu. Starting off with the crab cake app. it was flavorful and the crab tasted fresh and slightly sweet. My only complaint would be that it is freaking tiny! I ate it in 2 bites, and I take tiny bites so I hope this is not representative of their regular size crab cake app. If it is I recommend ordering the crab cake sandwich as an app which was more sizable for only $2 more. Next came the salad which I really liked, not too much dressing and a nice flavor combination. I wanted their maple cured pork chop initially as an entree but they had run out of it by 6:30 apparently. So I settled for the server's recommendation of bayou shrimp. The sauce on the shrimp was a bit too salty, the rice it was served on helped a little bit with that though, and the seasoned green beans served alongside it were probably the most awful I've ever had. There were stems and very tough fibers on them that were extremely hard to overlook. This was quite a shame since they were seasoned nicely and I liked the flavors but they were quite inedible. Dessert however was just awesome, I opted for some warm apple cobbler with vanilla ice cream and caramel sauce drizzled everywhere. Delicious!  Service was surprisingly attentive even though we visited during crw. The food was overall enjoyable even if I feel like portions here are a bit on the small side.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "FWu2O-8ESEGYCQSfKf49-A": {
    "date": "8/28/2019",
    "text": "I really do like this restaurant a lot.  When I first moved here for my job I was in Winston-Salem a lot and must have gone there once to twice a week.  I enjoyed the appetizers, the meals, sides and craft drinks.  The service was always good and sometimes exceptional.  They were and are a busy spot, but you can go and enjoy a comfortable meal and get a seat by the fireplace which I love since it was cold out a lot.  I would give different cuts of meat a try and most of the time the meat was cooked to my liking and if it was not it was taken care of.  I always love a restaurant that brings you hot bread and softened butter and they sure do that.  Desserts were good and a great ending to your meal.  Things to try:  bacon wrapped scallops, spinach tortilla dip, pimiento deviled eggs, pizzas, french onion soup, steak au poivre, flies and the list goes on.  There are many a locations to choose from so if you are moving through town you should hit at least one of them.  ToGo orders are well done and worked out well for me.  This is a solid restaurant and a good choice.  In fact, just writing this makes me hungry and want to order from there now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW3jfs9TLzvm9Xc3d6kaTg"
  },
  "KNVwuZoHsTpJ_1y5ubFj0A": {
    "date": "8/27/2019",
    "text": "Came here to celebrate my Grandma's birthday. Strongly suggest making reservations especially if you a group. We were able to bring in an outside birthday cake with candles and the staff stored in kitchen until the end of our dinner. We really appreciated that; she was so surprised. The food was good ranging from burgers, grilled meatloaf, pasta, crab cake sandwich, teriyaki chicken. The spring rolls were very good and filling. Saturday is $3 off martinis; so definitely recommend the three berry cosmos. I ordered crab cake sandwich it was more of a crab cake salad- I wouldn't recommend. It was very busy so it took our waitress a bit longer to take our drink order and food orders but she had a few tables. Otherwise the experience was great and my grandma fully enjoyed her dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JgaVjfpNs0HEpLVfY3opRg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Chicken teriyaki",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JgaVjfpNs0HEpLVfY3opRg/o.jpg"
      },
      {
        "img_id": "n27yRxZ7YnoR2c0rU4Az7g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n27yRxZ7YnoR2c0rU4Az7g/o.jpg"
      },
      {
        "img_id": "bT2Glvvr29tWJozG9lKlhA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Grilled meat loaf",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bT2Glvvr29tWJozG9lKlhA/o.jpg"
      }
    ],
    "user_id": "7gg29jxOEulX5m6f1mWaqA"
  },
  "zUNh1krukBuuG41N51Vzuw": {
    "date": "9/5/2019",
    "text": "Food was great! Wife and I walked in late one Friday night, got sat right away, and ordered pretty quickly. The server seemed a little less than happy to get sat with another table. He was pretty impatient with us, but everything else was perfect. Great steak and burger. Good value. I'll swing back by again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "navR8o68VnkAGeLWcBpebw"
  },
  "ZOjcYIRorQUcb_i7kUeBVA": {
    "date": "6/21/2019",
    "text": "Went in for late lunch.  Place has had a makeover.  Nice.  Contemporary.   Good was delicious.  Cobb salad was huge.  Wished it hadn't been tossed in dressing I would've taken half home.  He had grilled pimento bacon.  Very good.  Sweet.  He said a little too sweet at times.  Like me.  So I'd back off that if you want savory.  Place looks nice.  Service was great.  I'd go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0PqYJdtDydTkQ9kOVtV-_g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0PqYJdtDydTkQ9kOVtV-_g/o.jpg"
      }
    ],
    "user_id": "hVXj8lnaTIMLTkD_yjSj6A"
  },
  "xda7xcXkaaAAxG6TI7QwIg": {
    "date": "8/31/2019",
    "text": "A bit hard to find (it's on the side of the building). Food and service were great. It looks to be a local hangout. I had the trout which was cooked in soy sauce with a sweet taste. It was different, but it worked.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owq1tbYDMWGF1GgoxDjaMQ"
  },
  "kyAmIbUM3QMAfTZTzO6oww": {
    "date": "7/24/2019",
    "text": "Came for restaurant week.  Complimentary bread available upon request. Spinach salad with poppyseed dressing was delicious (bacon, tomatoes, bleu cheese crumbles, cranberries, apple slice, candied pecans...i got it without the sliced egg).  Cajun seafood fettuccine was good.  Just wished it had more heat/spice ( I would have loved to add some red pepper flakes). Warm butter cake was delicious (large portion, big enough tilo share).  Ice cream was thick and creamy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VEwc1lyrDSwF06F-jzN-CQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Warm Butter Cake",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VEwc1lyrDSwF06F-jzN-CQ/o.jpg"
      },
      {
        "img_id": "QYxGPkl6UyK3Yse6CQibSA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Ten spice glazed salmon with rice and masher mashed potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QYxGPkl6UyK3Yse6CQibSA/o.jpg"
      },
      {
        "img_id": "pbsDmF5GphqexKH6Ik48CA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Cajun seafood fettuccine with shrimp and scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pbsDmF5GphqexKH6Ik48CA/o.jpg"
      }
    ],
    "user_id": "_Eqb21vAxZ6bKIsNc8_ILg"
  },
  "RVPHEr0mpqx22sW0htRPpg": {
    "date": "8/25/2019",
    "text": "I highly recommend this restaurant! From the moment you enter the door you are greeted with a smile and seated almost instantly. The ambiance is very soothing and dimly lit. Waiters are very knowledgeable of the menu and will give their honest opinions of the food if questions arise. You can modify your food any way you would like.For dessert: WARM BUTTER CAKE-it is out of this world!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Akmo641Jq1akUrNK8TJdnw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Akmo641Jq1akUrNK8TJdnw/o.jpg"
      },
      {
        "img_id": "SwbzSZEn_968U0x_8FYeZg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SwbzSZEn_968U0x_8FYeZg/o.jpg"
      },
      {
        "img_id": "xLKRzUeGoTFDxhdgfH-iOA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xLKRzUeGoTFDxhdgfH-iOA/o.jpg"
      }
    ],
    "user_id": "VgBu8JlfHeaq_4c8xQQt7Q"
  },
  "xoLD-jdBlAvCKhz7WYUQPA": {
    "date": "2/2/2019",
    "text": "First time here with some girlfriends for dinner. The atmosphere is amazing and so are the views. I ordered the ten spice salmon with the Teriyaki Glaze. It came out really cold, which I asked for it to be re-heated, and the second time around was good. Waitress was pretty good at coming back to the table for how busy it was tonight. Gave 4 stars because food shouldn't be that cold no matter how many people are dining there Overall a great place to dine, so I'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uhzW9vVaEFpZb49nJADvEg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uhzW9vVaEFpZb49nJADvEg/o.jpg"
      }
    ],
    "user_id": "3YgXi49G--O9LHHw4arKPA"
  },
  "JB65dadYaX4QwLAnwoX9fw": {
    "date": "2/2/2019",
    "text": "I came with colleagues for a work dinner, and they have some pretty great selections spanning different types of cuisine. We shared appetizers, including calamari, seared tuna, and charcuterie. All of that tasted good. For drinks, they allowed us to try some of their beers, and I ended up ordering a Dunkel, which was good as well.  For dinner, I ordered a short rib, which came with green beans and mashed potatoes. Everything in that dish went very well together, and it was all cooked perfectly. There was quite a bit of food, so I wasn't able to finish all of it, but it was definitely tasty.  The waitstaff was friendly and helpful too, so overall it was a good experience!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8VPCVY70TcE353gRruotWQ"
  },
  "2AcZIXAq6I3mQcU1JmgbEw": {
    "date": "7/7/2018",
    "text": "The food, ambiance and staff are good.  A solid location and decent menu with a great bottle list.  The last time I went though it smelled horrible in there, so I left and went somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "spNZPNRvsS0mPyucZUaqyA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Tilapia",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/spNZPNRvsS0mPyucZUaqyA/o.jpg"
      },
      {
        "img_id": "Be9kVQRsM6Kvo5zIdqnwSA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Carolina Burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Be9kVQRsM6Kvo5zIdqnwSA/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "6ful9n4I_BvqAa_9-fgEGw": {
    "date": "8/16/2018",
    "text": "Everytime I looked places to drink and dine in South park area, thus place would always come up and this time I went ahead and tried it. Went on a Saturday early evening, there was no wait to sit outside and so we sat out. The service was slow even though we didn't order a ton of items. Constantly had to remind our server to bring items. The drinks were good, I liked the Tiki drink I had and my friend liked her margarita. we enjoyed the free bread but didn't quite like the food we paid for haha. The thai chicken nachos were just okay, could have had more chicken and better sauce and the spring rolls too lacked taste. We didn't entree here and decide to leave after sub par service experience and not so amazing food. Ambience is cute for a date night. PS: you can park free in the underground garage.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cUaQtLWHiOcWioue_rsCGQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Drinks!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cUaQtLWHiOcWioue_rsCGQ/o.jpg"
      },
      {
        "img_id": "dlQPtrgFnu8UGgWqC0Eztg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Drinks",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dlQPtrgFnu8UGgWqC0Eztg/o.jpg"
      },
      {
        "img_id": "wMcX4lOCcq__akMEm2mSkw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Spring rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wMcX4lOCcq__akMEm2mSkw/o.jpg"
      }
    ],
    "user_id": "oJVkBWeyirjR4h8x2PpN4g"
  },
  "SvhsEVCgyBM6XozlKkhICg": {
    "date": "1/9/2019",
    "text": "I was a little hesitant to try this place after reading the reviews, but we received gift cards for Christmas and gave it a try.  Other than being in an odd location, we found the experience to be enjoyable and the food was fantastic.  I had their asian fish special and I can say that it will bring me back again as it was savory, fresh and filling.  I also had a few drinks and they were all delicious.  We finished off the meal with their butter cake and let me tell you, that is pure delight!  Wow...its cake with melted butter and that is really all it needs...but then they do better and add ice cream!  Wow.  Don't let the reviews scare you away.  We had a good experience, including good service.  You should definitely give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xP44f7NXOyRnTglOL2JnCQ"
  },
  "49cJ_R8RtoFJ7o8e6rxJbA": {
    "date": "8/3/2019",
    "text": "Decided to come back after the \"safety issue\" eating here... got the new grouper pasta dish and tasted like limp noodles in water.  Zero flavor and will not be back ever at this point. Fingers crossed fish was ok.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4skrKtLzb38XS0qWaWAD4A"
  },
  "S-vQ_bGcpL7oJAtJcnkHAw": {
    "date": "11/21/2018",
    "text": "Yelp removed my last review of Village Tavern because someone at Yelp incorrectly decided that my review was motivated by the recent media coverage related to Hepatitis concerns at Village Tavern, rather than actual experiences there. For sake of clarity, you should know that I work around the corner and have eaten at Village Tavern over 30 times, including (unfortunately) relatively recently, and the following is based on those experiences. I used to love it. That is not currently the case.  This restaurant started out great years ago, and was more or less an institution. Then it was remodeled, and it was even better. And it was great until about a year or two ago, and then it declined precipitously.   Why that happened, I do not know. But I know this: within a short period of time, the glasses and utensils became consistently dirty (similar to the SouthPark P.F. Changs, also quite nasty in this respect); many of the waiters became slow, discourteous and curt; the cocktails seemed week; reservations no longer seemed to matter (i.e., I would reserve on OpenTable and still be asked to wait 15 minutes); and everything that had been good about this restaurant disappeared. And you can read the recent coverage in the Charlotte Observer for confirmation of some of my concerns about cleanliness here.   The last time I ate here, which was over the summer, my waiter, a guy with an English accent, greeted me with a \"What do you want.\" Other than bringing the drinks, food, and the check (all of which were thrown down on our table with a grunt) he never returned again. He never checked on the quality of the meal, never refreshed our sodas, never asked if we needed anything else. The entire ordeal must have been a huge inconvenience for him. That kind of service at Village Tavern is not at all unusual these days.  As for the food, there is a school of thought that says if a restaurant serves everything, nothing is likely to be exceptional. That is definitely True here. At Village Tavern, if you dare to go now, you can get everything from nachos to a steak, or from pizzas to a reuben. Fish, hamburgers, you name it. At one point this summer they had pasta-less spaghetti. Probably still do. It is all terribly plain. Except the pasta-less spaghetti, which is actively bad. A watery, gross mess.   I would never recommend that anyone eat here. Period.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LrW1IlMqL8G529jaqM6M-Q"
  },
  "u3dv7TbhePWalMSR8ycVww": {
    "date": "9/26/2018",
    "text": "This is a really nice restaurant and bar.  Quietly eloquent and slightly masculine decor, there is a large bar surrounded by tables and booths.  There is a huge outdoor patio that is excellent on moderate days which receives the same service and services that takes place in doors.  Very much a business lunch spot sprinkled with ladies taking a break from nearby mall shopping.  And children have space to play outside, but need to be supervised.  Menu is excellent.  Many choices, so just about anyone will find something that they like.  Prices are reasonable and the wait staff are professionally on point.  Parking can be an issue as they just have a long strip outside the entrance.  Tight to turn around and if it is very full you need to park in adjacent parking areas.  We have eaten here for lunches and dinners, many times bringing neighbors and friends.  We are somewhat regulars.  You can easily converse at your tables without shouting or waiting for a noise pause.  The atmosphere hums, making for a pleasant meal or just drinks and snack.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "s6gxmUgw1GbWsA5JOcZb9A": {
    "date": "7/19/2019",
    "text": "Village Tavern is always a great spot for lunch. The food is consistently good, service is always good, and not overly expensive. I definitely want to try the brunch because I've always had such a good experience here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1YX4fSP6B97CDxkeOBq6DA"
  },
  "1f7dNjacAQX56lg4zrDlqg": {
    "date": "7/18/2019",
    "text": "Wonderful staff and the food is always on point. Very busy lunch crowd which says a lot about this place. If you can make reservation or get here early.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyewEg_3PWs93epfR3E29A"
  },
  "AK8djxb3r3QV9-M98tXYVA": {
    "date": "7/1/2019",
    "text": "We came from out of town for a visit and was recommended this place by a friend and it did not disappoint.  We got the crab dip and it was really good...the steak my hubby got was tremendous. I got the chicken Marsala - scrumptious!! It seems like a super fancy place but it's still casual dining.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5RXIlRDjuMg22m1x3dVH9Q"
  },
  "vFCyv3zisy80zqaNg9505w": {
    "date": "8/18/2019",
    "text": "Here is another example of a great restaurant in South Park.  Had lunch at the  Village Tavern with Austen as our server.  He was polite, attentive, and knowledgeable.  He made great drink and food recommendations.  The atmosphere is classy, but not stuffy.  Had the brussel sprouts (outstanding), Baja salmon taco (also outstanding-probably the best fish taco I've had), and the sweet potato fries (good, but would have preferred salt on them instead of sugar).  The bartender and hostesses were all friendly and welcoming. Can't wait to go back to sit on the patio when it's not so hot. Highly recommend the restaurant...this is now at the top of my favs list.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYuaNdX7SFHmZbymxxc-RA"
  },
  "XTsyaYiZNMZGkV5TsCq5Jw": {
    "date": "6/23/2019",
    "text": "The interior has a nice atmosphere with a beautiful bar area. I can see ya why they were so busy on a Friday night! The staff was all very friendly and we had very good service. And all of our food was fabulous! Make sure to save room for dessert!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lWJ5TtqB5EQCGSADgVqDeQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Fried calamari appetizer. So delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lWJ5TtqB5EQCGSADgVqDeQ/o.jpg"
      }
    ],
    "user_id": "za0eKkga1gyVyMmZzYzPqw"
  },
  "xT1Ck6Ih-4uRm3GgysjFCw": {
    "date": "5/14/2010",
    "text": "Mmm... 4 stars for half priced cocktail Thursdays. Breaking my longest running New Years Resolution of no-hard-liquor here was worth it. Had a pama-tini and it was girly and delicious.   Crab dip was great (LOTS of crab meat), bruschetta was a-ok (bread could've been more flavorful), home made potato chips probably tasted better when they first came out, and calamari was a tad too crispy. Flowing drinks, fantastic patio, Sinatra impersonator = pretty cool place to chill after work.   Although, note that if you don't meet the visual requirements of the hostesses, they'll give you the up and down (and not in a good way).",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "fS8Y6Fdg1Jh51NFy8FXmyw": {
    "date": "6/24/2013",
    "text": "The appetizers were better than my entree.  I had the ribeye. It definitely was not a prime steak. It was cooked properly, but a bit tough. The service is attentive.   I like the wine list.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LYeNDh6jHyyQs8gH_sotQ"
  },
  "XtrzHhbK_NJ38PtzTL2zzA": {
    "date": "8/28/2010",
    "text": "Village Tavern is my go to when dining in the South Park area. I've been going there for years and have always had a good experiences. Their hot crab dip never disappoints but most recently I tried their Miami Burger and spring rolls which were both flavorful and satiating. Service has always been good and you can't beat sitting back on their patio area and having some cold ones.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-BhL9T73Ck9CyqvuKdfPGw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Miami Burger---burger topped with ham, swiss, dijon and pickles.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-BhL9T73Ck9CyqvuKdfPGw/o.jpg"
      }
    ],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "eYIgMNLLGqydGg0a_mXdpQ": {
    "date": "7/20/2016",
    "text": "Food great, service not so much. I went about a month ago. I had a Caesar salad with steak. The dressing was very good and you could tell it was made in-house which is key to making a good Caesar salad. My friends liked their salads as well which had fried chicken in them. We sat outside on the patio which is nice. The service was not good though. The wait stuff was rude and acted like we were such a burden. At the end, they overcharged each of my friends by $30. That was the icing on the cake. We talked to a manager who fixed the overcharging on the cards but all he really had to offer besides that was a \"sorry you feel that way.\"  Needless to say, I will be back sometime because I haven't found a better Caesar anywhere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COcxImq8rtxh2jjyViFbBQ"
  },
  "l14k1i9fWIFuB9WnYl27cA": {
    "date": "12/15/2013",
    "text": "Service was poor. When I arrived the hostess looked at me like a had 2 horns sticking out of my head. Waiter was missing for 20 minutes. Food was great",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e-uP2U3Aq4JUUQU9D96jRw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e-uP2U3Aq4JUUQU9D96jRw/o.jpg"
      }
    ],
    "user_id": "uB1yje63LhAZNBQW4WX--w"
  },
  "qP07d1iowjhi1dXPPwkxdQ": {
    "date": "7/6/2016",
    "text": "My wife and I recently visited the Village Tavern for drinks and small plates. We loved sitting on outside patio enjoying the beautiful weather. We shared an order of spring rolls and Cuban sliders. They were both delicious and we will definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2xkD9y1OETA_ltGMI_rYZA"
  },
  "wSUW0QLCwsDVC1lwQrd7iQ": {
    "date": "3/19/2016",
    "text": "I had meant to post this review sooner but I'm glad I waited. This is our favorite restaurant in Charlotte. This is the first restaurant we dined after after moving the Charlotte based on a recommendation and I am so glad we did. We have been to Village several times and it never disappoints. The food is wonderful, my favorite is the crab cakes, but it is also the atmosphere. It a great place to sit and relax and enjoy your meal being taken care of by incredibly friendly staff. We will continue to visit Village whenever we can. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OsF2zOp2TCAMGqlqy9ep1Q"
  },
  "eSXPJ0rSa_C17XMVSTuY7Q": {
    "date": "4/10/2012",
    "text": "GREAT Patio! Fantastic atmosphere!  Daily specials... my favorite? Thursday's 1/2 priced liquor drinks AND appetizers! Heck to the yes!  I enjoy sitting outside on the vast patio in the comfy furniture or hanging out at the cozy bar. The food is good-all I've ever eaten were the appetizers, and they're fantastic!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MpM0gAw6bhc79l2pdK8w9g"
  },
  "rBqZ4vejnxJNZCPktsIVgw": {
    "date": "3/30/2014",
    "text": "Ok, this is our go-to place to eat. The menu has something for everyone. We usually eat here once a week. The spring rolls appetizer are great. Shrimp and grits, excellent. The green beans are very good. For desert, get the butter cake.  Let me say that again butter cake!! How in the world can you go wrong with butter cake? You'll be glad you went here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ntl7I9ZPGpsFtII_MdF3Lw"
  },
  "VN2UNVGSxVWejob6Gm5pNw": {
    "date": "7/14/2017",
    "text": "I ordered the entree spinach salad which is great - and I'd had many times before. It comes with chicken and is again, an entree. After 25 mins, an empty sparkling water bottle and my husbands empty beer - the server brings me a side salad and my husbands sandwich.   I was like hmmm this is tiny and there's no chicken. I'm pregnant and starving (hence the long wait) so I was like leave me the side salad.   He said it doesn't come with chicken but I can get you some - gee thanks!  So kindly, he brings me a plain chicken breast after I've finished my tiny salad. The server is totally oblivious, I'm finished and all of our drinks are still empty due to the ridiculous wait. The person at the table behind us ordered the same salad I ordered, (I had entree envy) so clearly I'm not imagining the salad I've had in the past. So the additional chicken was added to the bill and we paid more than the actual salad I ordered. We would have ordered more beer and pellegrino but that was too much effort to deal with this server any more who is not mindful of the situation. Terrible service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oq5b9tymbE3q25aTfQTOOw"
  },
  "lqCeaTC7U3ODmerp_0K6zA": {
    "date": "2/29/2012",
    "text": "Do you remember the old Seinfeld episode...\"they are good at taking reservations, but not keeping reservations\"...well that is the story here.  After waiting almost two hours beyond our scheduled time, they sat us.  The food was no better than average.  We did not leave the place saying, \"wow that food was great, I can't wait to try it again.  This was my first time here and likely my last.  As I read some of the other reviews I can see that my service was not out of the ordinary.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fqs8RhJhWETiN0TgTvDiAA"
  },
  "Ae9C_-j2UuJfBTEHhHPOiA": {
    "date": "6/25/2012",
    "text": "This is a lovely irish-style-pub-restaurant with a beautiful outside patio. I've always received good service here and have never even had to wait to be seated, despite being mostly full each time. They have a good variety of wine & beer with a full bar and their menu is varied enough to suit most. This place is great for everything...a quick drink after work, small dinner with friends, even just for dessert! As others have said, the patio is huge with a lovely view and definitely the best place to be, as it is elevated and has fountains built into the walls beneath. I highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YquccrXP2YfD97BMghxreg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Shot of fountains behind the patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YquccrXP2YfD97BMghxreg/o.jpg"
      }
    ],
    "user_id": "fPfHIg0qkHKF1q_nB27NMQ"
  },
  "cmy1R8vpCWzrlow7rsQvDQ": {
    "date": "1/7/2016",
    "text": "Great place for the patio in summer. There can be a wait for a table but no rushing once you're there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rITV0jp-ZUNuPnQDZF3iPw"
  },
  "taXpZI2vrnZF-A4d6s_SyQ": {
    "date": "4/29/2016",
    "text": "Excellent!   Food, service, ambiance outstanding. Quiet inside with a large patio away from traffic.  Well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zsrm110fr9sFm0llTIu3VA"
  },
  "u2oV0n9Hz8d5zYwqKxC0Zg": {
    "date": "1/2/2014",
    "text": "Love the renovations. Bar is great and all the beer selection is good. My favorite dish is the pork chop. Simply amazing! Dry rubbed steak is tasty too. Keep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fHmLUdPQ7KPWxY23Tc0udA"
  },
  "CmMuz9Dg_q4f1wdTxVXBCA": {
    "date": "9/19/2009",
    "text": "A little on the expensive side, the Village Tavern is in the South Park area and is appropriately priced for that neighborhood. It's across the street from my office, so we're in here often.  Don't miss their own made chips with ranch dressing. Excellent on the side with one of their burgers instead of fries, they are just as good as a shared appetizer if you're just having drinks.  Speaking of burgers, don't miss 'em. Good quality meat with the right toppings, or get one of their pizzas. I like the margretira which has sliced tomatoes and fresh basil.  I've been here a bunch of times and I'll be back again a bunch more!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "jItnueAsUQtkM7BWAc1D7w": {
    "date": "10/28/2014",
    "text": "Fabulous! The blackened bayou shrimp and shrimp & grits were both amazing. Good selection of local craft brews. The service was great and the staff was knowledgeable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xnILwlD_ECBo4O-VaX9H9w"
  },
  "WaRIey-3xGJXO-86gjgSqQ": {
    "date": "11/22/2014",
    "text": "This spot is definitely one of m y favorite places in Charlotte. Food and service is always great. They've definitely stepped up their game since remodeling the inside. Very stylish and up to date.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8eV_d5qzqdBcwrItV3KI9g"
  },
  "t-zQpqQPEl2eSaIkBPh6lg": {
    "date": "10/30/2014",
    "text": "Our food was delicious! Huge menu with lots of variety. Service was great - attentive, kind, and timely. Prices were reasonable and half price wine on Wednesdays! I'll definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y3b3y4-aMuNZ6isXRcgwSw"
  },
  "y7Wxa8POGgNW74B-tV_4SQ": {
    "date": "8/4/2014",
    "text": "The staff is very attentive and the atmosphere is welcoming. We also enjoy bringing out of town guest here because the menu has something for everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cieYY_7jIbXRhUjMibfegA"
  },
  "5dyqItIgVRnu0UFViKmYHA": {
    "date": "3/21/2018",
    "text": "Tried this place out after moving to the Southwark area and had a craving for prime rib. Placed a pick up order and got there within the 15 minute time frame they gave me. Food was ready, and hostess and bartender taking my order were very nice. Ambiance of the place looks very nice and quiet, so I'd like to return for a sit down dinner one evening. Got my food home and was pretty good. Rib was cooked just the way I like it, medium. You could cut it with a fork! The mac and cheese was good, and the sauteed spinach was good, but a little salty for my taste. Bottom line-you get a good meal for a decent price so I'll go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6RPJmhzbkaCRoDwPIL-lg"
  },
  "y8Ygnl3I98UV8JEXfOalmA": {
    "date": "7/25/2017",
    "text": "Went for restaurant week excited to try a few things and once I compared the restaurant week selection to their actual menu realized there was less than a 10% savings (less than $3) they were offering. Seems a little shady for the False pretense of getting a good deal for restaurant week.  Due to this I ordered off the regular menu and got their prime rib which was quite tasteful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nr19STnBAttLO6FipE2Zjw"
  },
  "5xS6QvrbAFWICz8lHX6aDA": {
    "date": "4/16/2016",
    "text": "Had great prime rib with my wife last night. We sat outside at the fire pit, server was great! Look forward to going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oCIfB_Eyp5hAekehThBXnA"
  },
  "SUcPtRIZsuGTmR0tgp_miA": {
    "date": "4/22/2016",
    "text": "I visited this place last month and it was great! I have been before they renovated it and would consider is average. Now that the menu and decorations have been updated, this place is great! I had 2 items from the appetizers- the calamari and the scallops. She had the veggie burger. We split the apple crumble with ice cream dessert. ALL WERE EXCELLENT! The scallops had a teriyaki sauce and there were 3 large scallops on the plate. The calamari came with some kind of sauce but I changed it to a marinara which was good. The dessert was huge, fresh, and the ratio of ice cream to cake was perfect. DEFINITELY COMING BACK!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LcahV8saJd80ACayce9MLQ"
  },
  "zLvHkqamXgzU2jSdgpi_lg": {
    "date": "8/29/2016",
    "text": "Nice enough place once inside but the two things I ordered were surprisingly weak. I ordered the Cobb salad and it was probably the worst example of this typical entree salad I've ever had. It was literally soaked in average blue cheese dressing - think slop. Everything was chopped up and mixed together soaked in dressing.  Then I decided to order the \"spring rolls\" hoping it would be better and giving them a chance to redeem themselves in my opinion - oh well that didn't happen! Think American style egg rolls with 3 different incredibly average dipping sauces.  So lesson learned - pleasant walk to the restaurant but the food is badly executed. The service at the bar though was fine no complaints - friendly and complete. The kitchen and the implementing of dishes is where the failures lie.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-BsIr1vUNyHveUPdS_rqWw"
  },
  "THKOaNx01bCwntFsoyv-VA": {
    "date": "4/2/2017",
    "text": "My daughter and I had a wonderful late lunch today and everything was perfect! From the service to the food, everything was top notch. I haven't been there for many years. I pretty much forgot about it. It's so out of sight. We will definitely have to make it a regular destination from now on. Next time we'll have to sit outside, weather permitting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cGHLn3VspB6hiuGuknHdNQ"
  },
  "PI7X9TPLLZ6-8Rvq8u5qKw": {
    "date": "6/9/2017",
    "text": "To start the food here is awesome. And here comes the but.. The service is mediocre at best, but tonight was terrible. I came here with two people, and I believe they were very dismissive to us. I do not know if it was because of our age, gender, or what but what we received was unacceptable. Were told three different things about where to sit and the wait time before we were then told they weren't sitting anyone. I just felt disrespected..",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GF8vkrDk8ZE_q3suZTMplQ"
  },
  "OWqV6oMbOX2r9hlDz5NmaA": {
    "date": "4/14/2017",
    "text": "Amazing patio. Good food and drinks. Great spot to go with a group to enjoy the patio setting",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lM262njxrKt55RXZhbyuRA"
  },
  "vucywXnURzvXn11ArBemow": {
    "date": "7/17/2017",
    "text": "I love their burgers and Moscow mules! Gorgeous outdoor space overlooking South Park! I love that I live within walking distance. Great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7s7x9VbNs2LuId_Wr0cLpg"
  },
  "OPbeMCicDZW5rIt7UV8aNw": {
    "date": "7/17/2017",
    "text": "The Clam Chowder is delicious. It was the first time that I've had that type of soup with a bit of a kick.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixGKe5bMTrx6K0QxlNVL-A"
  },
  "xhBtpPqErnPVwCz4q8qZyw": {
    "date": "7/14/2016",
    "text": "Very nice experience. Laura, our server, was very friendly and capable, patiently handling our talkative, distracted party of eight. The dining area was a bit smaller than I expected - basically just one decent sized room. The big outside patio was closed due to rain.  I had the fresh fish tacos with blackened tilapia. They were tasty, but messy to pick up and eat. We appreciated the gluten-free menu and lots of options for my wife. She got the grilled salmon and said it was wonderful.  We would gladly return to Village Tavern!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LCkrtfx7l-W2FlBgMoo2wg"
  },
  "F_wM3vIng7Nqw7PpzTp2fg": {
    "date": "5/2/2014",
    "text": "I came here for brunch after deciding a 45 minute wait at Terrace Cafe was not worth our time. They let us sit ouside on their giant patio on a gorgeous windy Charlotte spring day. With the tree tops in full bloom, it almost felt like we were in another country. Really great location.  The staff was really great and friendly and did a good job checking on us.  The only real reason I am giving this a three star is because for the price, I was not really impressed with the food. And above all else that matters. Please don't misread me. The food was not bad at all. There was nothing wrong with it. I just think for what it was, it could have been much less in cost. That is just my personal opinion and I'm sure that is not True for everyone or perhaps even across their menu board.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ntq_6n5SpkZGmNHXnEmlNQ"
  },
  "hE4AGh4vX8z9z-FzsvowWg": {
    "date": "11/19/2016",
    "text": "Great spot We had an unexpected overnight layover in Charlotte, read some reviews on Yelp and TA. We are a very picky family and I have Celiac (gluten free) Great fish and chips, kids chicken tenders. Awesome shrimp and grits.  Gluten free menu was great. Very good burger. Would highly recommend. Don't order the guac. Good service and atmosphere. I would give 4 and a half if possible",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OFV3QgCGuuy7OElMKQG3vA"
  },
  "GwSnrkvQZV9aKhOUC0e-Ww": {
    "date": "7/4/2017",
    "text": "Always a great meal and terrific service.  Beautiful restaurant and bar with a fantastic outdoor patio.  By far my favorite go to place as it is consistently great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UUbrKI4cK3gVOmAbsS_tlA"
  },
  "7Wxu8qLuhk5Qh6D-_Cj8RA": {
    "date": "6/5/2015",
    "text": "We visited recently and have just given up.  We've been 3 times and it never gets better.  I would have assumed a Thursday evening would have had a great environment but we were a group of 6 and there couldn't have been more than 20 others.  Bar menu was good, appetizers we only okay.  We specifically asked if the turkey burgers were fresh ground and fresh patties or frozen.  We were assured they were great fresh burgers but it came out in a flat circle, not a juicy fresh patty.  I ordered a 'very rare' 16oz Prime Rib and it came out most certainly medium well, very grey and no juices.  Quite a disappointment from what I had seen photographed.  It was an hour from closing so I didn't send it back.  To have purchased the Prime Rib, and app for the table, a bottle of wine, and a Turkey Burger, the total with 20% was $130.  I could certainly find better places in SouthPark and the Midtown for that price.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "zvFeFboNMXqes2x5yqxpYw"
  },
  "V0zuqLBKFA6PeMnWtK5Bag": {
    "date": "1/20/2017",
    "text": "I ordered santa fe burger with no onions and sweet potato fries! One of the better burgers here in charlotte and the sweet potato fries were awesome!! Village tavern is def a hidden gem in south park. The guacamole on the burger was perfect! Will def be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NYehuvg_xXxkyG4F0y238w"
  },
  "cGOLgpmYdBag8ab6Iand9g": {
    "date": "12/13/2013",
    "text": "Came here for a holiday party, and it was A-OK.    SERVICE:  On-point.  From entrance to exit, they did a great job of emphasizing good service.  Was greeted by hostess and GM or assistant GM was nearby and walked me over to the party locale which was set up in a nice area outside the actual restaurant, but well-heated.  Service at the holiday party was great.  Cleared plates for us, took drink orders, and had the right attitude.  Dunno the chick's name, but she did a good job.  Even when I was leaving, the hostess dude caught up to me and asked how I liked the event and bid farewell.  It seems minor, but the restaurant service was hospitable.  FOOD:  Pretty average.  I'm not sure if its our fault (do we select entrees?) or theirs, but the spread was eclectic.  Chicken skewers, boneless chicken wings, egg rolls, veggie mix, meat balls, some broccoli-cheese casserole-looking thing, and flat soda.  Please check your soda before serving it - probably left over from the previous holiday party or something.  Egg rolls were soggy upon service and meatballs were cold.  It was a hellishly random collection of dishes that didn't really go well together.  If it's the holiday planning party committee's fault, then sorry Village Tavern!  I'm not particularly interested in trying the restaurant itself based on the food.    dmo out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJBUXpkWLEQMwRWi4XQnxA"
  },
  "MtgiEh-CP0NRWfZ-aBu5kw": {
    "date": "2/26/2017",
    "text": "If you are from Maryland, DO NOT get the crab cake sandwich. You will be disappointed. Think of McDonalds Fish sandwich. The bread was not toasted. The bun was like a blue ribbon cookout burger bun. The crab cake, wasn't a cake, it was a patty. Smh... it was terrible. Granted it was not called \"Maryland\" crab cake sandwich... but still should have had more flavor and better presentation. Bottom line---Do Not get the crab cake!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EBz8TYhwXlByvPckBDUptw"
  },
  "bBNRb3izJvrpKy9MpPnV_A": {
    "date": "9/11/2016",
    "text": "Stopped after work Friday evening to meet a buddy of mine.  He is from Greensboro, but had a business meeting in South Park. So I suggested we meet at Village Tavern...a staple in my mind for the great food, drinks and atmosphere.  I moved from South Park in 2012 and was really looking forward to hitting Village Tavern again. Yikes! What a disappointment :(  At 5:30 the patio was practically empty.  But actually, that was great for us to sit down, have a drink and chat.  We chose a table with the umbrella closed on purpose...the weather that evening was awesome.  Unfortunately, no less than three employees, one of which appeared to be a supervisor/manager, came to our table, reached over us WITHOUT ASKING, and opened the umbrella. When we made it clear we did not want it opened, one employee even said something like, \"All of the umbrellas will be opened\".  Basically meaning, \"Regardless that you are a patron who out of all the establishments in South Park, chose Village Tavern after work as your place to unwind, we are going to decide for you whether the umbrella on your table is opened.\"  The last employee who tried this left our table with an attitude...all because we did not want our umbrella opened...really?  It's not as if the patio was clamoring with patrons...there was literally just four other tables with customers when we arrived at 5:30.  We left at 7:00 and still the patio was half empty. Wonder why...this place used to be slammed during happy hour.  I left feeling embarrassed that I chose Village Tavern to \"showcase\" the South Park area.  Thank god for our sever, Laura, who really saved the day with her energetic smile and willingness to please.  She smoothed over the ridiculous actions of her fellow staff members with ease.  A True gem :)  Go Laura!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "GspQF-dcFeODUwehxy9pwA"
  },
  "clEur35lu_lO1dHYtQYz0A": {
    "date": "2/12/2017",
    "text": "Small place with good ambience.  The food was good.  I would go back again.  The service was good.  Nice selection on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JHsoFyNbYcorujk3i_hbg"
  },
  "E_G5lN-dohKcV2oYHuohLw": {
    "date": "8/10/2017",
    "text": "This is my go-to restaurant in Charlotte. They have a huge menu that has something everyone can enjoy (and I have been enough times to almost try everything on the menu.) None of their food disappoints. My favorites are the salmon sandwich and their chicken marsala.   The restaurant it self is beautiful and never too noisy which is great, I tend to bring my family here often and that is a big deal for them. Service tends to be pretty good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "_M9NXDWLgVIPRKnIdm4isA"
  },
  "Ex7gqG1UJzxYk4ROZmey1Q": {
    "date": "7/15/2016",
    "text": "Here on Yelp this restaurant only has two dollar signs and the description says burgers, bar. It had some pretty great review so we thought why not try it out?   From the description we think it's a casual restaurant. My boyfriend and his friend are wearing nice t-shirts, should have worn at least a polo.. From the start of the dinner our waitress Katie treated us like we A. Shouldn't be there and B. Like we couldn't afford to be there. It was actually quite insulting.   We started with drinks, some Moscow mules, they were pretty good but did taste like they were made with ginger ale instead of ginger beer. Our waitress said she would bring us water, but didn't until we asked her again.   She did not come back for at least 15 minutes and when she did she skipped asking us about appetizers and asked if we were ready to order dinner. Which we weren't, but did order the hot crab dip. It was delicious.   After another 10 - 15 minutes she came back to take our order. We asked her what she suggested and she offered several of her favorites from the menu.   I had read that the Mac and cheese was really good so I just had to order that, and the Pimento Bacon Cheeseburger. I was actually disgusted by how much grease was on both the burger and in the mac and cheese. The bottom bun of the burger was soaked in grease, I did not eat it.   My boyfriend ordered the firecracker shrimp tacos and absolutely loved them! Our friend had the shrimp and grits and said they were good, but very greasy also. The three of us are currently suffering from some stomach issues.. If you know what I mean.   Overall I felt like this restaurant was overrated and the service was personally insulting because of what the guys were wearing. Or maybe I'm thinking too much into it and the server just didn't care about making our experience great.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oPJeZhuZvKwKRon-NY8wQA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Moscow mule",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oPJeZhuZvKwKRon-NY8wQA/o.jpg"
      },
      {
        "img_id": "e7TIjxhTzHHG1lyi_4Gu1Q",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Pimento Bacon Cheese burger with Mac and cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/e7TIjxhTzHHG1lyi_4Gu1Q/o.jpg"
      }
    ],
    "user_id": "JejWIZV1EmFZ-jXJzj5kZQ"
  },
  "nW4OJu0MIJDJ67ZAS4NbYw": {
    "date": "6/3/2017",
    "text": "Amazing service and food waitress serving us was very nice and I enjoyed the atmosphere. I ordered the blackened salmon sandwich soo juicy and the fries were fresh and crisp.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CkFKF6wHpip-jQC0_6CkXw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CkFKF6wHpip-jQC0_6CkXw/o.jpg"
      }
    ],
    "user_id": "vvYUEUO_GXRqTv9mPO6SYw"
  },
  "Ct6IVw2bT6aEeAKN5jUQiw": {
    "date": "2/22/2017",
    "text": "We love this place!  They have a great food selection so there is something for everybody and everything we've had has been delicious. The apple cobbler is the best thing I have ever had. They also have a great large outside patio",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmUk9b83y5c8LHkJNV7P4w"
  },
  "MnOAGxW0uEE9JXbyTJZzAw": {
    "date": "4/19/2018",
    "text": "Phenomenal!  Came here with a colleague for lunch on a weekday.  Food and service were outstanding (deviled eggs and burgers).  Both the manager and our server Kevin were friendly, gracious and very professional!!!  Can't wait to visit Charlotte again so I can go back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E2M6N7_cKdBes0mtIgFgZQ"
  },
  "q85tP6Q9XgQ4w-fWJnX-CA": {
    "date": "11/3/2015",
    "text": "I went to VT for brunch last Sunday. They say it's hard to mess breakfast up but trust me, I've seen it happen. Village Tavern's serves up a very nice & tasty brunch..  Loved the.... 1. Coffee + creamer that they bring out individually  2. Ham & Cheddar Omelet - excellent 3. Waiter let me sub the awesome blue & blackberries instead of the potatoes (thank you!) 4. the Muffin  Also loved the decor inside. We sat at the newer community tables because there was a little wait for our own. Everything was great and I will soon be back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iSx8XtymVIBpyo7SOQAOtQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iSx8XtymVIBpyo7SOQAOtQ/o.jpg"
      }
    ],
    "user_id": "7GIcGERUfVvOx_TNYomGcA"
  },
  "v0TJcIKq4cJTy7zUfMbmIQ": {
    "date": "12/22/2014",
    "text": "Looks much fancier on the inside than the outside. However be sure to dress-up, casual doesn't really cut it here.   Service was slooooow - food was alright, but nothing too exciting.   Best Tip about this place: If you're under the age of 40 you'll be treated like you're 15 and your mom just dropped you off at the mall.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZzxVXZVorsG96na4oUB3ag",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. greek side salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZzxVXZVorsG96na4oUB3ag/o.jpg"
      },
      {
        "img_id": "3lAka0vBPvqk3Dg5jWW-tA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Thai Chicken Nachos: spicy chicken, Thai peanut sauce, sweet peppers, snow peas, cilantro, scallions, Cheddar and Monterey Jack",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3lAka0vBPvqk3Dg5jWW-tA/o.jpg"
      },
      {
        "img_id": "QjctjXclJo0R9BmFt3El_g",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Sangria - so much pineapple in here",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QjctjXclJo0R9BmFt3El_g/o.jpg"
      }
    ],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "4717048yW6SHuofKGPMIIg": {
    "date": "9/24/2017",
    "text": "We walked in on a Thursday evening for dinner without a reservation. No problem. We were greeted warmly and seated immediately. Our waitress (I think her name is Melissa) was very helpful with descriptions of items on the menu and recommendations. My husband ordered a local craft beer (25oz/great value) and we got a bottle of wine for the table. The wine was a great Malbec (Argentinian I believe). We both ordered the steak au poivre. IT WAS DIVINE!!!!!!  The sauteed spinach was the best we have ever had. For dessert we ordered the carrot cake. It was super moist with delicious cream cheese icing. Fabulous dinner!!!  We absolutely recommend Village Tavern, and we will certainly be going back soon!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntfDZ4DrxOf2rSEYkvxydA"
  },
  "8Dqpnx9sHMXlhbXFeR1iqQ": {
    "date": "7/22/2016",
    "text": "We walked to The Village Tavern from the hotel and it was worth the walk. We ordered the pimento burger and tavern burger as take out. Both burgers were very juicy and cooked to perfection. You know it's good when the juice is all over your face and fingers. The bread had the perfect soft toast texture to add to the deliciousness.  The ambiance was light and friendly. There were people dressed up and people with t shirts Nd shorts. Everyone who worked there from the hostess to the bar tender were friendly and appeared happy to seems. The secret sauce on the tavern burger is quite spicy but the heat goes away quickly. The onions on the pimento cheese burger make it sweet I would definitely order food from there again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "miXpp-7ZhcTaVRf4zd_jcQ",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Tavern burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/miXpp-7ZhcTaVRf4zd_jcQ/o.jpg"
      },
      {
        "img_id": "ZTFpBGeeXTQa4MnVHLQyKA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. The pimento cheese burger",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZTFpBGeeXTQa4MnVHLQyKA/o.jpg"
      },
      {
        "img_id": "eJ0XM-sQn6UUGuhRNGGFHw",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Great place to eat!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eJ0XM-sQn6UUGuhRNGGFHw/o.jpg"
      }
    ],
    "user_id": "bK9MtBCK5DDHeXBSdD39Jw"
  },
  "9vwcnj2f-iCQk_wGTUts6A": {
    "date": "5/5/2016",
    "text": "I would describe my girlfriend and my visit to Village Tavern as the quintessential 4 star experience in my opinion - everything was good, but nothing really blew us away.  I ordered the pimento bacon cheeseburger and she got the crispy chicken tacos. Her crispy chicken tacos were probably the best part of both meals; the crispy, spicy chicken went perfectly with the sweetness of the slaw. The sides of rice and black beans were just average, however. My pimento bacon cheeseburger was good, but the bacon was overwhelming. It had 4 huge strips of bacon, which normally I wouldn't mind but the bacon was simply too sweet. I know that sounds odd, but it was almost candied bacon with strong maple/sugar taste. My comment after my first bite was \"wow that was really... sweet\", which is almost never something you say eating a burger. I took 2 of the 4 strips off and finished the burger, and it was better. The burger was cooked medium as I asked, but it lacked a great char or any meaty flavor that you look for. The caramelized onions were excellent but the pimento cheese was average. It was a decent burger overall, and I enjoyed the sweet potato fries on the side too.  Our server was pretty friendly but somehow just seemed a bit odd in his actions. Also I got mayo on my burger after asking for them to leave it off, but that was no big deal to me since it took 5 seconds to scrape most of it off. We were also pretty set on trying the brownie dessert after an initial glance at the menu, but he actually talked us out of it when he described all the desserts and said the brownie and another choice weren't very good. The food was solid, but nothing really wowed us and made us strongly want to come back. I'd say Village Tavern is a good, safe option for quality food but nothing that you must try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ghjy_jegOllPjIQspoDD8A",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Pimento Bacon Cheeseburger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ghjy_jegOllPjIQspoDD8A/o.jpg"
      },
      {
        "img_id": "DeF-jp_CxjRzsMGwH1LyDA",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Pimento Bacon Cheeseburger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DeF-jp_CxjRzsMGwH1LyDA/o.jpg"
      }
    ],
    "user_id": "aLqp_fe64ugZFuwMpsXLiw"
  },
  "c1bwssxJoSt45vPaQhYTIw": {
    "date": "3/30/2016",
    "text": "Awful. Terrible. There is not one good thing to say about this place.  We had a party of four. All 4 of our meals were overlooked.  We had 3 orders of crispy chicken tacos and the chicken was so burned that we couldn't even cut into it.  My chicken Colorado was burned to a brick. Awful. The waiter never came back to check on the food after the food runner dropped it off. All of the orders were burned and cold. It took an hour to be served after placing our order. After dinner we moved to the bar to have a drink and the bartender was HORRIBLY rude.  Awful.  Dear owners....Please just give up and close.  They obviously don't care.  Do not waste money here.  We finally walked out.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "AiVwWqhYIOVGsQn1GFFiKQ"
  },
  "xFQrWoVhd7a3u-J5a9joQw": {
    "date": "8/12/2017",
    "text": "Every time I visit Village Tavern I expect more than I receive, but I'm always hopeful! The food is good, the atmosphere was a little lacking but over all it's a nice quiet place for a date. Village Tavern's reputation far exceeds the real life experience. Even with the lacking service I would return for a quiet date, with little distractions and pretty good food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BGT1FMhD9OUaiJalyiSt8w"
  },
  "vTDKclFTyKUi1rWxzz1AVQ": {
    "date": "8/8/2017",
    "text": "In the few years I have been visiting Charlotte this ranks as one of the tops. We went for dinner and I liked the atmosphere right away. The menu is large with good options to please all palettes. I ordered the prime rib and there are 2 options 12 and 16 ounces with 2 sides and bear aisle or creamy horseradish. A man we assumed was the owner walked around and asked diners about their meal. Really everything was excellent. Will definitely repeat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "Eq4yvl4cOPvVhkD92hxcuQ": {
    "date": "8/31/2017",
    "text": "I was out to lunch with two very old friends and I have to say my focus was not entirely on the food as we caught up. The crab cake sandwich, while not particularly memorable, was good as was the potato salad. The butter cake was decadent and delusions. This is a must have dessert, if you save room. I look forward to coming back and having more from the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "9dcbRcecRwahOk56-r9-RA": {
    "date": "3/20/2018",
    "text": "This place is great!  Amanda behind the bar being one of the main reasons we keep coming back!  Food is consistently good and the drink specials are solid!  Hidden gem in the south park area...that is unless you live here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "si-sigbPPkNGUbC7Y6Cq-Q"
  },
  "g773JvUSP-olnftLclBt6Q": {
    "date": "11/15/2016",
    "text": "Went here during lunch for my birthday last Monday with my girls. I thought that it was pretty good. It was a bit hard to find for me and for all of my friends but thankfully we found the restaurant. Our server was nice. I think that maybe he was annoyed by my cousin's vegan questions which honestly I would've been annoyed also but he did a good job at helping her out with it. He recommended some drinks for us and then ended up buying mine since it was my birthday which I thought was sweet. Hope to come here again with my boyfriend some time.  Appetizer: Flash fried calamari - loved it entree: chicken colorado - pretty good drink: (forgot what it was called but it had the word 'cuban' in it) - pretty good, i also tried the painkiller which i thought was good also",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j_G47semHWDQngp2IYV6TQ"
  },
  "pq2pgGLPOHOgKENXI5D5Ow": {
    "date": "5/15/2014",
    "text": "Went back to VT last night to meet a friend, and the food, service and atmosphere was just as good if not better than my first trip here!   First important tip: Wednesday is HALF OFF WINE night! Ya HOO! There are some exceptions on their \"higher end\" stash, but I can live with the other choices. So I ordered a Meomi Pinot Noir, and for half off, the bottle only came to like $20 or so! GREAT Deal since that's about what it is in the stores (yes I know, but I've come to grips with the dreaded price doubling of wine in restaurants).   So to start, my friend recommended the freshly made chips with ranch sauce. Perfectly crispy, a little salt, and yummy ranch dressing. Spot on. Personally I would have liked a TAD more salt on them, but no major complaints.  So I've seen their steak menu and after a LONG, HARD workout, I convinced my body that I need PROTEIN to feed those muscles of mine.......my brain fought back but the muscles won! So I ordered the 10oz Filet, cooked medium rare (of course - I'm not a fan of shoe leather), and opted for their cognac cream sauce. I make a killer Au Poivre with Congna Cream sauce at home, so I admit to being a little snobby when it comes to this sauce. Quite frankly mine IS better, but this one was pretty good. I'd recommend the Bernaise Butter over the Filet though.....that will be my next choice.   For my side I chose the Gourmet Mac and Cheese and the Spinach. Both were excellent! The Mac & Cheese was very good as the outside was crispy (i.e., slightly burned) and I LOVE THAT! My only addition would be to add a dash of Truffle Oil. But that's just me......I'm a Truffle Oil fool. The spinach was cooked perfectly as it was sauteed in olive oil and garlic, with the requisite amount of wilting yet maintained a good firm texture.   OK so I've talked about the sauce, but have been remiss to describe the FILET! One word: PERFECTION! The quality of the beef was excellent (Prime???) but it's the way it was prepared that was awesome. The outside was crispy due to the apparent high heat oven yet the inside was literally MELT IN YOUR MOUTH tender! And as you can see in the photos, it WAS cooked perfectly to Medium Rare. All this really needed was a little butter on top (again recommend the Bernaise Butter) and it was truly superb! Coming from a Beef town like Chicago, I am singing this restaurants high and well-deserved praise!  All in all this was a GREAT meal! Very reasonably priced for the quality of food served, and the service is always very, very good.   Kudos to the Management Team at VT! Don't know if that's recently changed or what given some of the pooer reviews from the past. But this is my thrid time here and all three times, each has been FIVE STAR EXPERIENCE!  Bravo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "qsxA0tMWvrovHanfFxJaSg",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Perfectly cooked Filet....Medium-Rare!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qsxA0tMWvrovHanfFxJaSg/o.jpg"
      },
      {
        "img_id": "LCoPKE9E6GrBdLxp5hb2ew",
        "caption": "Photo of Village Tavern - Charlotte, NC, United States. Gourment Mac &amp;amp; Cheese! Crispy &amp;#34;burned&amp;#34; on the outside. Yummy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LCoPKE9E6GrBdLxp5hb2ew/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "wW5k-868N7mw1exIbxrzHQ": {
    "date": "4/5/2018",
    "text": "VT has several locations, I used to frequent one in Winston-Salem, NC. They have a good menu but the Charlotte restaurant is poorly designed making seating problematic. They have booths on the perimeter of the space along the windows, and a sizable bar area on the other side of the restaurant. In the middle section there are about six four tops tables situated very close to one another and very close to the bar. The bar has long high top tables and IMHO is too large. They could remove some of the bar space since they aren't really a sports bar and extend the regular dining area.  I will also point out that the restaurant is located in area with hotels and office buildings and has a small parking lot. There is no street parking. You sometimes have to wait for a diner to exit the lot to get a spot.  The first time we went to this location, we were seated at one of the four tops and we were right on top of a group for whom they have moved tables together. We were able to move to an available booth. The last time we were seated in the same are and a group with several kids were seated a  long high top table very close to us. As is often the case, the parents were not attending them and the kids were running everywhere- as a side note this is NOT a  good restaurant for small children; they do not appear to have areas to accommodate families. We asked to be moved to a booth or another four top away from the kids and were told those were reserved for reservations who had not shown up yet. The fact that we also had a reservation didn't seem to matter. After our server spoke to the manager, the best he could do was put at a high top in what looked like a hallway off from the bar which would have been like not being in the restaurant at all. We decided to leave and went to another restaurant.   We will not return. It's too much hassle to dine here and there are numerous other restaurants in Charlotte that have  comparable menus and offer a better dining experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S6XOGg1gJ-5iNWj0Au-zgw"
  },
  "j1siV2NbqGTPEDJdu1m1lw": {
    "date": "6/5/2017",
    "text": "We enjoyed the great ambience of VT last night & had a wonderful time. Kevin, our waiter made the evening even more enjoyable. My wife had Chicken Marsala & I had one of the best blue cheeseburgers in years. Hand cut, hot, salted chips added another layer of taste. Great selection of wines by the glass & Kevin advised us that Wednesday in 1/2 off all wines all day Wednesday!  Caution: the two desserts we had could have been shared, HUGE! Freshly baked butter cake w/raspberry sauce & ice cream & hot apple cobbler w/ice cream could have fed four people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d-xImQdoBuylR6KKCZxUOw"
  },
  "T6vPOnLTE2ZK-rCUCp4VkA": {
    "date": "5/21/2017",
    "text": "Pretty good experience eating at the village tavern. The hot crab dip was amazing. I am from Maryland and it is probably one of the best I've tried! The pita bread that was included was hot and paired great with the dip. My entree came out and it was not hot so I sent it back with no problem. The second time it was better. I ordered the kids salmon for my toddler and it taste good! It was a very large portion that I could eat myself. The location is a little hard to find, but besides that it was a pretty good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SKHDFrzeJEB2tnB95G32WA"
  }
}