{
  "bahSj9ezR8m-FhT8cscUfg": {
    "date": "4/8/2012",
    "text": "Another big box breakfast joint, what can I say, all the standard. It is just off a major highway, so unless you arrive before 830am or so on the weekend, be prepared to wait. If you want more detail just see my review for the IHOP in the Charlotte University area. The difference here is that the service is down a notch or two. While the service at the University location is at a minimum competent , it really can be lackluster here. I'm not expecting Brown Derby level service either, but I would like our coffee urn to be kept filled, and for our orders to be brought out together.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BpYIF-uCq8zCdoqo6whLkA"
  },
  "hB_DHBRvOJxiP4yPnK4VqA": {
    "date": "9/7/2014",
    "text": "As I-Hops go, it is pretty typical.  My wife loves getting breakfast there at all times of the day.  I've had both breakfasts and lunches ..mostly sandwiches.  nothing great, but it's passable.  The waitresses are usually good, cheerful, and attentive ( tho occasionally you get a clinker ..but that happens everywhere).  These are hard working ladies so leave them a reasonable tip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTapQZqThBcUPZgfS9qwhg"
  },
  "3Ec7ivYvrpBQWl7j6E8zXw": {
    "date": "10/2/2012",
    "text": "So I used to loooove going here!  Now I go every so often and usually wonder why after Im there.  Went on Saturday night and wow...what an experience.  There was a group of teenagers there celebrating something. Now im not an old dud, I know teenagers aren't quiet and they are with friends and having a good time.  However, they were comlpletely disrespectful.  Yelling and singing and clapping so loudly that other patrons in the restaurant couldn't even hear conversations at there own tables.  Then they were actually standing up and walking over the tables while singing and cheering!  So while i understand the actions of these rude teenages is not the establishments fault, how they handled it is.  And they did nothing.  When our waitress came to out table we couldnt even hear her it was so loud and the manager just stood their and watched the show, did nothing and said nothing to them.  But as we had time to just sit and look around as we couldnt hear one another.  It reminded me of a really nice hotel that you felt special going to, then it gets super run down and no one takes care of it anymore.  As I gazed out the window to see cracker barrel and knowing we could've eaten better for cheaper just across the street.  This was the last straw.  Won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kpJdIG57gQHtiM-ezx7DxQ"
  },
  "0xjzv16NgGf2GPoCsd3dwg": {
    "date": "4/7/2017",
    "text": "The place was just kind of dirty, even the Parking lot had trash everywhere. Food was just ok, and wasn't served hot.  Soda was pretty flat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wgYZjDDQNWhwEoNkljs3Yw"
  },
  "SgqMTNjxiOF_CMYnHXN4vQ": {
    "date": "8/1/2017",
    "text": "Service was slow and there weren't many people in the restaurant. Food was mediocre, I've eaten at better IHOPs in the past. I ordered a healthy omelette  off the menu with fruit,Unsure how fresh the fruit I ordered was. I should have just ordered something unhealthy, at least it would've been quality. Witnessed a waitress or runner pick something off the ground then proceed to serve other dishes. Coffee tasted burnt. Maybe I just came on off day, but more than like won't come back due to the negative experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JL-R7fztAsXMi_Op5x0uGg"
  },
  "eF-EQM79fqHvWpOCNFEM9g": {
    "date": "5/16/2016",
    "text": "Came in to have a birthday dinner with the kids and had a blast ! Our server was great and the manager was very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XVFK29jztPpKrgas9Ofpbg"
  },
  "KA-_KivBuMOGo8fcFx0bvw": {
    "date": "8/29/2015",
    "text": "I'm going with 3 stars. What I did like about my experience is the waitress Nicka was timely and polite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaDFqhqEav6QAjpKDRFVjA"
  },
  "qZAzKz7A5qZbnaExTgT56g": {
    "date": "4/16/2013",
    "text": "This place is always packed. Why? Am I missing something? Someone please tell me! I have only been for Breakfast and it's moderate at best. That morning I had scrambled eggs which I truly believe were a week old, turkey bacon which was grossly undercooked and pancakes which were light, fluffy and very tasty.  The service was good. Our waiter was a little shy, probably his first gig but still very nice, polite and attentive.  The opinion at the table was the pancakes ruled and everything else was unacceptable. With that said, I honestly can't see myself frequenting this place often just for pancakes. I need more to choose from. That's why I ask you to please tell me what I'm missing. Why do so many people frequent this place? Is there a secret menu I don't know about? Am I visiting at the wrong time? What? Tell me!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "TxnCLljqXZlKCOpsCreqxQ"
  },
  "WksA19jr_1E9Rz8XtU2Mqg": {
    "date": "10/31/2014",
    "text": "Very poor service. We came at around 8 am and not very busy, but the service was slow and substandard. After being seated for about 10 minutes, we sat watching another table, who came well after us, received service before us. Once the waitress came to our table, she never introduced herself, but only ask if we're ready to order. She didn't bring out creams for the coffee or straws for the water and juice, we received the creams after we asked for them but not the straws. As for the napkins, we had to use the ones that hold the utensils. After we received our food, it was literally no more than 5 minutes, when she came back and put the check on our table. And here's the best part, as she walked away she asked us if everything was ok, and did not pause for even 1 sec to hear our response. And that was the only time she ever \"checked\" on us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzxY-Be_JVKGPBykEH2uUQ"
  },
  "0FSshuCDyXmSFGsZBM_SZw": {
    "date": "4/11/2011",
    "text": "I've been to this IHOP a couple times, usually on Sundays... sometimes we beat the Sunday \"church\" crowd, and sometimes we get stuck in it.    Overall, this IHOP puts out decent food, my only complaint is the wait times and sometimes the service due to it being slammed.  I'm sure if we attempt to go anytime other than a Sunday, my service experience would be a lot better.  This past time I went with a friend and we waited about 15min for a table... when we were escorted to our table, the table was meant for 4 people and then there was no chair on the other side.  That that I didn't want to get cozy with my buddy, but it may look weird if two guys were sitting side-by-side at a table meant for 4 people!  When we asked for a chair, the hostess looked at us with a puzzled look, but then obliged and pulled the chair from the adjacent table.  It took a while for our food to come out, but you can see the kitchen was slammed....  the food lasted about 5 seconds as I inhaled it into my mouth.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "-UyF1uWOVhHLSxDufLGpkw": {
    "date": "6/8/2015",
    "text": "Horrible experience. Im very lenient on my reviews but for me to give this place 1 star it had to be ridiculously awful! Came on a weeknight around 9:30 after choosing it over waffle house because the bf wanted to \"chill\" a little after a long day of work. Well, we did \"chill\" alright...an hour long chilled and waited for 2 entrees. They sat us down at a booth that just had got sanatized therefore it was still wet and i mean wet wet with strong fumes that i breathed in for 10 minutes before it dries out. Then came the utensils, wrapped in white napkins...only if it was completely white! How could you not see stains on both white napkins?? yet they put it neatly on our table as if nothing was there. If that was how they present themselves to customers, what could possibly be behind closed doors?! No acknowledgement whatsoever of timing and we had to ask how much longer for her to go check after 50 minutes wait. The food came overcooked, they forgot the bananas that supposed to be on the french toasts, asked for it and didnt get it till the toast was almost gone. Overall, quality of service and food were one word \"poor\". Never again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Oxk9QrcJ_HmhshODt3FWfg",
        "caption": "Photo of IHOP - Matthews, NC, United States. i didnt ask for stains on napkins.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Oxk9QrcJ_HmhshODt3FWfg/o.jpg"
      }
    ],
    "user_id": "0GIAHvDT2cFBIXAyFjVazA"
  },
  "ByRiFAWwMI2iqd3i6Tvz-w": {
    "date": "4/23/2010",
    "text": "For some reason in Charlotte, when the hostess tells you the wait will only be 10 minutes, it'll actually be 30 minutes. This was the 2nd time this happened in two days at two different establishments. -_-  I have never been a fan of IHOP, but will go when majority rules. Coffee is watered down, syrup bottles sticky, food mediocre at best. I got the Harvest Grain 'N Nut pancakes.. I don't really know why, but I wasn't feeling anything on the menu. Pancakes were slightly soggy and only bearable with a large helping of syrup. Hashbrowns lacked flavor and had to be doused with ketchup and hot sauce. There was a lot of hope for the New York Cheesecake Pancakes at my table..everyone was disappointed.  I suppose this place is only good if you're just looking to get really full. Service was decent, not stellar, but it's an IHOP, so it was decent.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "mEdxYBdwsiz4Yk8zDytHqA": {
    "date": "8/21/2015",
    "text": "I absolutely love this place great service you must ask for Jessica or Wendy as your sever. Food is amazing and of great quality try the sirloin tips they are the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ALsO5QDW0wvuIp3PGl8gxA"
  },
  "9Ssi2YvYWOpC8ixRmHRUgg": {
    "date": "1/11/2015",
    "text": "Great service. Food was to order, hot and delicious.  Place was clean. The only reason it didn't warrant five stars is price.  No one wants to spend $30 for a breakfast for two unless it's at a vacation destination.  IHOP on Independence in Charlotte doesn't qualify.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvtXEfd-kXFf4JyyDITLeg"
  },
  "uwvXLg_wCNMBH9t2VU5-vA": {
    "date": "7/2/2012",
    "text": "Here on 4/28/12  Decent food for breakfast . Colorado Omelettes was better than anticipated . Had potroast, bacon ,ham ,sausage , and cheese stuffed into and on top of the omlette. Coffee was ground and brewed here and served in the gold pot kept on our table. Syrup served warm in a clean, non sticky caraf. Very good !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5uUOcTyKK1pQYwAL-Xrnw"
  },
  "EdpBiYYEfS2UPCi_1-_4DQ": {
    "date": "6/16/2014",
    "text": "Not many places motivate me in such a way that I feel compelled to walk out but say for 40-minutes, at least 25 of which were unattended.  The 25-minutes were order-to-walk out.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0g9Q8hnRjXv3Decrh1Whbw"
  },
  "gb9UkKJ9NxIzuhvBD-8W-w": {
    "date": "11/26/2015",
    "text": "I will never go here again. Went here on Thanksgiving day for breakfast with two friends of mine that I haven't seen for months. We were seated immediately and were given our menus. That was about the only positive thing about my experience. Our server came for the order. I'm not a huge fan of pancakes and I resumed to tell the lady that I didn't want any. She stared me down almost in awe that i didn't want any. She asked me what I wanted instead I wasn't sure what I could have so I asked if I could have an extra strip of bacon. She laughed and said no honey you can't get no meats. I'm sorry but I didn't know. I'm sure the lady must have been unhappy because she had to work on Thanksgiving, but you don't have to take it out on the customer. The food itself was complete garbage. No flavor on the meat the bacon was too salty and the hash brown were way too crunchy. Overall a pretty negative experience. Thankfully I don't live in Charlotte and I won't have to visit this location again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEBE1amG2uukfZ1k8ECa6g"
  },
  "fP34XpI2ebm0ZT1FYn2uXQ": {
    "date": "5/17/2016",
    "text": "I love IHOP. I hate this location. Service is BAD. Even the Manager doesn't care. I am not sure how you mess up mashed potatoes and steamed broccoli, but they managed. The rest of my meal is coming back up as I write.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pqI0q5cK3dr-74PoDFawgQ"
  },
  "peGi1W6qiaDS1Th7gJnUzw": {
    "date": "5/8/2016",
    "text": "Visited this location on Saturday May 7th at about midnight. The service wasn't good but the food was. When we walked in we told the host up front that we had a party of 9 and he rolled his eyes and said under his breath that it was going to be a long night. He was very rude and acted like we were a major inconvenience. I'm guessing he hates his job or at least that was the impression he gave. Absolutely zero personality!Once we finally got seated the waitress was nice and our food came out quickly. The restaurant seemed to be short staffed and it was prom night so I'm sure it was a bit overwhelming for the employees. I just didn't see a need for the young mans attitude.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhCfV9ssUSR6WTClOUp5tw"
  },
  "KwHbvUjGEL3iYTVPLOTtxw": {
    "date": "3/22/2014",
    "text": "I hate going to ihop but my sister is a big fan so we always go if she can convince me to leave the house. We're always treated well and if there were problems, it would get fixed right away.  The other day, our waitress was named Dalilah. She served us several times before and was always nice and refilled our drinks without us having to call out to someone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9uEhHf2KhWmyqdUGKFJIA"
  },
  "ohJRu61Br0rny4NVPuJ3ew": {
    "date": "2/27/2011",
    "text": "I've lived in Charlotte for nearly half my life and have gone to this location for about a decade now. I always get the same thing The Country Omelet. Back in 2002-2006 they actually had a great manager at this location I actually knew him and think the quality of service and staff was a lot better when he was there. I think this IHOP has gone down hill over the years the staff isn't as professional as they once were and the food is just ok. However when they advertise a $4.99 special for breakfast you really shouldn't expect eggs Benedict.   My husband and I decided to stop by the other night for dinner. My husband loves the Chicken fried chicken and we were disappointed to find out that IHOP no longer has this on their menu. I was kind of shocked because that's always been a stable go to for me. I'll also note this in the tips.   If you're a people watcher like me then this is the place to go to in Matthews. I noticed over the course of our 40min meal that four waitresses made themselves large cups of chocolate milk and then took breaks in their break room, which is through the double doors going into the dish washing room. Also, while the wait staff was waiting for the food to come out from the kitchen they kept yelling Happy Birthday over and over again to one of the waitresses. It was a little annoying to hear Happy Birthday every 5 seconds yelled in the kitchen but I guess I can understand that every work environment needs some morale boosting.   Overall the food was pretty good for the price but I've had better at IHOP. I do have to agree with Annie about the hash browns. In the country omelet you get hash browns and mine we're hardly cooked prior to going in the omelet.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jVuyNd_1xknblSSBQYNAEw"
  },
  "q9aGA3dmp9tyVT7s1-17hA": {
    "date": "1/3/2013",
    "text": "Ate here for lunch with my Mom.  She ordered the crepes while I got the cinn-a-stack french toast.  Though they seemed to pack a lot of Cinnamon between the french toast slices (to which I scrapped some off), it was very good.  My mother also enjoyed her crepes with strawberries.  The staff was friendly and the facilities were clean.   Compared to other \"IHOPs\" I have been, I felt I made no mistake here, it was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBs9C8XnE8Py8yji7EF3nQ"
  },
  "rZjrNWlW626rIZB51W6DhA": {
    "date": "9/13/2012",
    "text": "It is an IHOP and they are all pretty much alike. This one is o.k. as to when you go and who is cooking at the time. It can be really really good or really really bad. I would say what times we have been to this one that it has favored the good like 75%. We would go again as it is close to us as long as there isn't to much of a line. It can be a fairly long wait on the weekends. Parking runs out quick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSp0l4VCndo7Q4Icv53kaA"
  },
  "72pELUHgcIRDzwpuLYXCBA": {
    "date": "12/30/2018",
    "text": "Will our server was Awesome!! But kitchen staff needs to be replaced. Super slow, the restaurant was not busy AT ALL maybe 10 tables in the whole restaurant and it took 45 minutes for a burger and chicken and waffles to come out and even then they got my burger wrong. The bun and tomatoes smelled like chemicals. The only redeeming thing about this restaurant was our lovely server will, who made jokes and kept us happy while the kitchen staff failed to make food in a timely fashion.  I could've made both at my house in that time. Truest pathetic. Just skip this location unless will is in. Also menu is very deceiving on coffee. Says Iced coffee is free refills but it really isn't. They lie. Don't even bother.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zBKG6I6kfKO3A-wIfiFtXg"
  },
  "Ck5it_DUvGnHuFE6y47Mcw": {
    "date": "6/10/2018",
    "text": "Ordered the pancake sliders, no flavor at all. Was very disappointed with the food and our waitress was nice but smelt like cigarettes. We went to check out and nothing was organized as far as our tickets plus the cashier caught an attitude when my family and I were trying to tell her what we ordered.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNd0G2PLBymnW0zfWn0-6A"
  },
  "vgmujUG4HFKmyJrvJHYbmA": {
    "date": "11/2/2018",
    "text": "this is the slowest unorganized ihop i have ever been too. we waited 20 minutes to be seated even though multiple staff members walked passed us and didnt even acknowledge us. the phone rang and rang and the host was more concerned about cashing other people out and not sitting customers. she then got an attitude when we asked what the hold up was. do not eat here unless you want to wait to be seated",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z-Dcdwv8PV-0Cyfdq11HFg"
  },
  "A4LSVRFqKkBzgsuFs04qVA": {
    "date": "11/30/2018",
    "text": "came straight from another ihop that was treating us terribly to this one. it was a little slow to get seated and for our food to come out, but i didn't mind at all. especially not when our server Misha came out. she was the kindest, funniest server i've had anywhere in a long time. you could tell she really cared about her job and about making people feel at home. not only was this clear when she was serving our table, but her positive energy radiated through while she was working multiple tables at a time. so kind and talented and willing to go the extra mile. the world needs more people like misha.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GkLWw4vvqe2lDzZm5KYsWw"
  },
  "5utLjnIHWFhBF_nO7umNXA": {
    "date": "5/25/2018",
    "text": "Rude waitress. Snappy attitude. would've been nice to know that the wait time just to get our drinks ordered was going to be over 20 minutes and to order food almost 30.  had several servers come around our table and no one helped. would not recommend coming here if you're hungry . You'll end up starving here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hulxeMRSodiJXosqFx0awA"
  },
  "PMTgSFxYWpakvxybhaJznA": {
    "date": "5/25/2018",
    "text": "Since day one I have had a problem with this place. First experience I ordered pancakes which were all you can eat and they told me I can only have one. The second time the waitress was very very rude the third time they told me I could not place an order over the phone then this last time they charged me $18 for two stuffed French toast bacon and a hash brown. This place sucks I would not recommend it to my dog.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ax6CrCgmaKidZXSCXdBKOQ"
  },
  "-8UPrzou2dHrB7opTLBsZg": {
    "date": "12/27/2014",
    "text": "Your basic IHOP, if in a somewhat challenging location on Hwy 74 and like every other greasy spoon in Charlotte, operated by Greeks.  Of chief note is that the ham-n-cheese omelet was a proper omelet -- multiple layers of beaten egg encasing the filling, not just scrambled eggs folded twice and dumped on plate. Also, the hash browns were cooked to crunchy in spots, rather than left raw in spots. My preferred approach.  Watch where you park and lock up as there are some sketchy motels about, but this'll do in a pinch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FykiYEa6OoVGN_FN_EOD4w",
        "caption": "Photo of IHOP - Matthews, NC, United States. Starter set",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FykiYEa6OoVGN_FN_EOD4w/o.jpg"
      }
    ],
    "user_id": "blbQ4tvXCDhOYSrSjJz23g"
  },
  "aWnG4R47Fn_tWjDbS1CILQ": {
    "date": "6/30/2016",
    "text": "I've been to many IHOPs many times. Every other location I go to, either in Charlotte or in another state on vacation; for some reason it is never good. I like to excuse it by saying maybe I went at the wrong time? But it shouldn't be like that. I should have had a good experience every time I go. I'm talking about the food itself and not the service. That review could go on another IHOP location. But this specific location in Matthews is always great. Every time I go here the food is always good. Service from the servers is usually good.   That day I checked in was when I had brunch here and there was someone training a new supervisor or something? They were the only problem I encountered at this location so far. I mean I'm not expecting to eat at a 5 star restaurant with great customer service. But when I walk into a restaurant, I feel as if workers should at least act like customers matter. Greet them with a smile and seat them or let them know there's a wait. The two workers did not do any of this. I think the trainee was shy or nervous but he was laughing about not wanting to do anything while the trainer spoke to him in an unprofessional way that should not be in front of customers.   Overall, I love IHOP because it's 24/7 and I'm obsessed with pancakes. The Matthews location is better than any other location I've been to at any time of the day. If the servers could act a little more professional, that would be cooler.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pDFXe8Yu1JTr4tIHqWFcug",
        "caption": "Photo of IHOP - Matthews, NC, United States. Sirloin steak with eggs combo &amp;amp; Philly cheesesteak with fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pDFXe8Yu1JTr4tIHqWFcug/o.jpg"
      }
    ],
    "user_id": "3sIQBftKmmppYJ9okcE3GA"
  },
  "t35oy2yyE7J9j6kUS4Yitg": {
    "date": "2/27/2018",
    "text": "Ask for Jessica if she's working. She's sweet and she'll take care of you. This location is not my go to ihop but that's just bc sharon amity is more convenient to go to and quieter in the evening. It is open 24 hours which is nice when you're hungry at 2AM. I've never had issues with the food. I would say that if you see people lining up outside, get ready for a wait. It might not be worth dealing with rushed staff and long wait for the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "remy6phKEJFdwVGNVOkPRA"
  },
  "BizzCvYp2yEGT4VQOtU_6A": {
    "date": "11/3/2017",
    "text": "You can smell the dirt the moment you walk in! I'm an IHOP lover,  but this location should have it's logo ripped off! Let's start with the lady who called herself the manager,  she was the nastiest person I have ever encountered for no reason, no smile,  no joy,  no customer service skills,  no \"Hi, welcome to ihop\" just a look like she can't take the smell of the place either! The waitresses looked like they were miserable as well. Had the \"help me\" look.  I couldn't even bring myself to order. Was scared I would catch the misery bug!! By far the worst location I have ever been to without ordering food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-aebe7O9rRVH9KVLRKoacg"
  },
  "zudXa_zlKWKYF2_lzhgu_Q": {
    "date": "8/3/2017",
    "text": "-bacon tasted horrible  -food was late -food was made wrong Asking questions while I was choking.. -bathroom was gross -over all food was gross.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUD5wtlw1DrWziP-_xVNXw"
  },
  "QQ6ZtXM124xNS_mLLSXFsA": {
    "date": "7/15/2018",
    "text": "Don't come here if you're in a hurry as no one has a sense of urgency. Some of the tables are directly under the A/C vents and blow cold air all over the food. They won't let you move without making a huge deal either. Food is good if it comes out right and prices are average. Some of the staff are really friendly but some are super grumpy and unprofessional. Yet... I keep coming!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GMoBLEsR9SSW__5PAJHj8w"
  },
  "ZAE5ZSxS4WNGVSSOcBdPkw": {
    "date": "8/6/2017",
    "text": "This IHOP location was clean and centrally located near hotels and shopping. Since it was Sunday we had a bit of a wait. However, the wait was too long. Our waitress was nice and the food came out quick. When I come back to stay at the location I will go back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W8PCus77Hunrmo21Wh98bg"
  },
  "V6fGqKL_sGeyQxX_vEctAg": {
    "date": "4/30/2017",
    "text": "Sat here for 15 minutes and did not even get coffee brought to us, water, nothing. Flagged down another waitress who said ours was getting our drinks. Nope.  Got up and went to panera instead. Many empty tables and lots of servers.  I will never in life return!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "L-CZ3leGWIHKM4_J-3yoBw": {
    "date": "4/6/2016",
    "text": "I have to be honest IHOP has really stepped up it's game the last 2 times I've been it has been pretty darn good and though everyone talks about how great Cracker Barrel is I was just there and IHOP was much better! Now it had slipped for a few years and I wasn't interested in going but we had a gift card and we did. I had the country fried steak and egg breakfast the portion of steak was huge with yummy gravy 2 eggs hash browns and pancakes. I opted for the Cheesecake pancakes because they make a delicious dessert (or I think so anyway ). My dad got the steak tips dinner with corn and mashed potatoes which he said was very good as well. We left full and happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IWw6oRL5Vft4lHT5AJc2jA",
        "caption": "Photo of IHOP - Matthews, NC, United States. Delicious cheesecake pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IWw6oRL5Vft4lHT5AJc2jA/o.jpg"
      },
      {
        "img_id": "NDsOkpAB-HP14oEBEX2mIw",
        "caption": "Photo of IHOP - Matthews, NC, United States. Steak tip dinner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NDsOkpAB-HP14oEBEX2mIw/o.jpg"
      },
      {
        "img_id": "Z2TETobqUygaVJQ__rAd_Q",
        "caption": "Photo of IHOP - Matthews, NC, United States. Country fried steak breakfast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z2TETobqUygaVJQ__rAd_Q/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "JQCp19IN0wWacqkR6ptAXw": {
    "date": "6/7/2017",
    "text": "It pains me to leave IHOP a 2 star review. IHOP, in the past and going back many years would get nothing less then 5 stars.  Lots of good memories eating here while much younger and as I got older. Lots of good memories taking my own family there, with no worries of the normal long wait on weekend mornings sitting outside waiting for your name to be called.   That long wait was frustrating for most but for me, it was a good thing. If we didnt have the time to wait, no prob, we go elsewhere. If its a lazy day, the wait was a good thing. Its hard nowadays to spend quality time with your family. Heck, its hard to spend any time with your family nowadays. Everybody is busy, everybody has things to do, everybody has an iphone/etc attached at their hip. So even having the time, whether sitting at ihop or at your own table in the kitchen. Everybody is glued to their phones/ipads etc.....  My rule was simple. No smart phone/ipad use while in a car. Even if your not driving. While you may not be driving, guaranteed the driver is pre-occupied with the 3 other people in the car yapping about this FB post, that thing on twitter, this email/ to and/or from so and so.....and etc  2nd, all phones/tablets etc are off during 'family time'. Period. We have enough hours in the day to click on our phones.  Back to IHOP. I hate one of my all time favorites is now not even an option we consider any more.  Was never concerned about slow service. Good things were meant to wait for. Every table full, a 1 hr wait for a table, the servers are swamped. Not the servers fault. Not the restaurants fault that so many like it they are willing to wait an hour for a table.  To me, this was a great time to spend with my family. While looking forward to a terrific breakfast.  However, now, many terrific items are no longer even on the menu. Most everything is now far higher in price. I accept and understand that. In fact, I expect it.   But quite simply, the food has gone downhill. I dont mind that everything now is twice the price. But I do expect the food to be the same.   They still have great pancakes, crepes, etc....But what happened to these terrific large, stuffed omelets? Ok, so they are now twice the price. Ok, they dont come with a stack of large pancakes. They now come with 2 very small pancakes. No problem. But they went from 3 large egg's in each omelet, stuffed/filled with whatever ingredients your omelet comes with, to 3 medium eggs with half the ingredients, and now, not sure. My last 2 visits, I went with my normal 'go to' omelet and my family went with their go to items (french toast, crepes, pigs-n-blankets, fruit, burgers etc..). We always left stuffed and normally with a large doggy bag, other then crepes, pigs-n-blankets, fruit, which could be eaten in one sitting...tasty satisfied and filled up, no need for doggy bags.....  Not the case anymore. Omelets are 75% higher in price, half the size, half the fillings, 2 small pancakes and no need for a doggy bag. Normally, you are quite filled up after 1/2 your omelet and half the pancakes. Now, your plate is 100% cleared.  The burgers? We used to get 1 of 3. Monster bacon, Monster bacon with egg, or just a regular monster, with your choice of side. We always went with the fries or the Potato soup.   The burgers were huge....ample side of fries or large side of soup....You would be stuffed after eating half.   Like the omelets, you now no longer need a doggy bag for the burgers. They dont even offer the monster burger with egg and some others. You can get them for $3-$5 more, but even then, its not filling. half the fries or 1/4 the soup as well.   Very disappointing. IHOP, always a staple/look forward to family event on weekends, when I was young and as olderwith my own family, is now off the list. Even the kids no longer want to go there, let alone look forward to it all week long. In the better days, even I thought $3 or $4 for chocolate milk and the same $'s for a glass of OJ was excessive. But 100% acceptable. After all, they are in biz to make money and you are paying a premium to sit and relax as somebody else cooked and served the food that filled your belly and your families belly and it was worth every penny. But even now, that Large Chocolate milk, used to be large and obviously Hershys. The OJ, was still expensive back then, $2.50 for a small 2 gulp glass or $4+for a large, which as most know is easily guzzled quickly.  Now, while it still tastes like hersheys, the choc milk is basically triple in price. The small is not enough for a toddler, the large is half the size of what the small was awhile back at twice the price, both with obviously much less hersheys syrup in each. The OJ, the same, itsy bitsy cups at 3 times the price, and I hate to say this, but they are watering it down very obviously.  Its sad a staple in our lives is no longer.....  Go with Cracker Barrel Or Stacks. Tad pricey, but honestly, both are worth twice what they charge & the food is GR8!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6UfPPTGEOPs9Fr0AmXGiw"
  },
  "b-wPptPSmLb5P4ia7NWpfA": {
    "date": "12/20/2017",
    "text": "I come here late at night and the service is careless. I asked for cheesecake stuffed French toast and a fried egg and got bananas and strawberries on plain french toast with a scrambled egg. Lol. And then I sat there not eating it and nobody checked on me so I had to ask for some butter. I'm not going to complain bc maybe she's having a bad night but It makes me wonder how some people can serve and care so little.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Jlk66Xn0TM575fFPGV-tA"
  },
  "yDl8C-qQeRVNLUOUYds_NQ": {
    "date": "12/18/2016",
    "text": "After some months of not eating at ihop, mt wife and I decided to give it another try. I don't know why waitresses do not write down orders, especially one like ours that has several changes included. The result of not writing it down led to 5 errors in our food. We ordered the appetizer sampler, and that came out fine. Our drinks we also correct, except that we had to ask for straws twice.   My order was the breakfast sampler, eggs sunny side up and pancakes were supposed to be cheesecake pancakes. My eggs came out scrambled.  My wife had the split decision breakfast. Here eggs were supposed to be egg whites with cheese, they were not. She asked for a side of dry toast...it was loaded with butter. Here pancakes were supposed to have banana and cream cheese drizzle, and they were plain. But after getting all that corrected, and now half our food cold, my wife started to eat here eggs and pulled a long black hair out of it...she has light brown hair.    All these errors lead to being aggravated and eating cold food.  Why won't they just write down the order? And get it right the first time?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LXKET0pwT_rt9l_jWuOPWw"
  },
  "cKXT0PRRsTZhLPUMdf8j9w": {
    "date": "12/23/2014",
    "text": "What is there to say about IHOP?  Food is always consistent and hot.  It's cheap eats.  Service is always quick and polite.   This location, however, stays busy.  Give them a plus for being located next to Krispy Kreme Doughnuts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1jbAZCXnpbO1GmjhXvO7Ew"
  },
  "dg8TQF53f3PRVejS_MUU5w": {
    "date": "10/11/2013",
    "text": "If I could give 0 stars I would. A friend and I decided to stop and try the stuffed french toast. We're chatting away waiting for our food and drinking and here comes a cockroach running across our table. I immediately grabbed my purse and stood up. Our waitress came over and was just as shocked as we were and kept apologizing (she was new so I'm sure she had no idea). We told her that it wasn't her fault and we wanted to cancel our order and leave. We spoke to the manager on the way out and he seemed like he wasn't surprised when we explained what we saw. Thank God we didn't eat. The only thing nice about this place was our waitress. Will never go back though. That ihop has been there for a very long time, it's time to clean and remodel or shut it down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DrXv10YqdsAp8y1XF83Iiw",
        "caption": "Photo of IHOP - Matthews, NC, United States. Cockroach running across our table, disgusting!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DrXv10YqdsAp8y1XF83Iiw/o.jpg"
      }
    ],
    "user_id": "tT0gBLkdMvmDoqqvHuVMfA"
  },
  "8zRSQOpnaZ-iYcLC4plYlg": {
    "date": "8/8/2019",
    "text": "great place to eat my waitress dana was nice my food was pretty great pancakes were delicious .great atmosphere for it being 4:00 am .even tho i was sleepy you guys were more alive than i am keep up the great work .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vwl_INBp7rcFFuSXOPKYuA"
  },
  "fLM0X2dN0vE4xy06Oc3DOA": {
    "date": "8/25/2019",
    "text": "Terrible. The kitchen crew put whatever they wanted on the sandwich I ordered, sent it back and ordered something different, and then the same thing happened. The floors had trash from previous guests both in the walkways and underneath the tables. The staff seemed to be uninterested and annoyed when asked for something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_EuDgFKqgK6CngTrl8Rvw"
  },
  "ILM0knLlTIbOIPwpMW9mmw": {
    "date": "8/15/2019",
    "text": "Worst breakfast.. the waitress took the dirty coffee pot that was sitting on the table with old coffee and went and refilled same pot for us all dirty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7wWoxdZJD2QMX0_zN7DtJA",
        "caption": "Photo of IHOP - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7wWoxdZJD2QMX0_zN7DtJA/o.jpg"
      }
    ],
    "user_id": "5CeDMNFD71BUhaS1d2lc-A"
  },
  "410sN0chaXXVD9u-1Mwt_g": {
    "date": "2/4/2019",
    "text": "Pretty good food. Of course IHOP is not fine dining but if you are just in need of a variety and pretty good quality this is the place. They currently have a french toast hot chocolate which is sweet but pretty delish! I recommend it. I got the country fried steak and gravy which I enjoyed with eggs and hasbrowns... It is not super flavorful but for the price I cannot complain. Also had the strawberry cheesecake pancakes which were good and did not even need syrup. A good solid place if you are hungry and on a budget.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GnAFulXDFbNUOpTMZSB9YQ",
        "caption": "Photo of IHOP - Matthews, NC, United States. Orange juice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GnAFulXDFbNUOpTMZSB9YQ/o.jpg"
      },
      {
        "img_id": "ShLD3s-g35YGAqUJGvnkjA",
        "caption": "Photo of IHOP - Matthews, NC, United States. Big bowl of grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ShLD3s-g35YGAqUJGvnkjA/o.jpg"
      },
      {
        "img_id": "yC4UFgBM90ZONhUh6kzWZQ",
        "caption": "Photo of IHOP - Matthews, NC, United States. French toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yC4UFgBM90ZONhUh6kzWZQ/o.jpg"
      }
    ],
    "user_id": "jdcOF4skk75rjefgKBPIyQ"
  },
  "qSJUG-Kh9uTGMAftIh7BxQ": {
    "date": "9/20/2018",
    "text": "Let me start by saying I understand it's a chain, it's a diner, and we were there about 3am...but I feel like IHOP is so...average...like the food is okay, but truthfully overpriced for the quality. My chicken tenders were good but super small, the omelette was over cooked and had no sour cream or Serrano pepper which was on the description. All I know is Steak 'n Shake was closed and it was literally our only option at 3am.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9VJbs7iRl3O-mSiTPwHnAg",
        "caption": "Photo of IHOP - Matthews, NC, United States. Chicken was kind of pathetic",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9VJbs7iRl3O-mSiTPwHnAg/o.jpg"
      },
      {
        "img_id": "RnSgyfbRrUGOEGV_B1DcqA",
        "caption": "Photo of IHOP - Matthews, NC, United States. Pancakes were only okay part",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RnSgyfbRrUGOEGV_B1DcqA/o.jpg"
      },
      {
        "img_id": "RDY0IItFKIHgUnEmGKibeA",
        "caption": "Photo of IHOP - Matthews, NC, United States. $9.00 for chocolate chip pancakes that were only okay",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RDY0IItFKIHgUnEmGKibeA/o.jpg"
      }
    ],
    "user_id": "PQhb8JJu7Iyz7eIEspFu1Q"
  },
  "BnnqAQ0WVtqhzYasYPPDEw": {
    "date": "3/25/2019",
    "text": "The wait was long!! Establishment needs to be updated.. of course the day I come they don't have straws...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N3X0PonAtuCiRI-VPee5sA",
        "caption": "Photo of IHOP - Matthews, NC, United States. IHOP Seating",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N3X0PonAtuCiRI-VPee5sA/o.jpg"
      }
    ],
    "user_id": "j1CvXoShwGpiUE24YpwJAA"
  },
  "7qlFzVBxRmLj5ODwKjjRvw": {
    "date": "1/26/2019",
    "text": "We sat down at our table at 9:50pm, and we ended up getting our food at 10:50pm. While we were there we had to order our meals twice because our server lost our ticket and didn't put it into the computer after 30-45 minutes of us being there. We got refills on our drinks only when we were forced to get up and asked another server to do it for him. Then we had to ask another server to check on our food because it had taken so long, and when we did get our food my order was wrong and the pancakes came out uncooked in the middle. After an hour and a half of agony we asked for the check and were handed the wrong one, and it took another 5+ minutes to get the correct one (he only gave us one meal off mind you). When we were finally ready to leave we asked to talk to the manager who completely blew us off, didn't listen to anything we had to say and hushed us away by saying that she'd take care of the check. Neither our server nor the manager was any help to us as we were left frustrated for our entire meal. By far the worst experience i've ever had with any server and will never be coming back.  I would like to add that I myself am a server and have a pretty good idea of how a restaurant should run. This location is very obviously poorly managed. Every single table that was used was left dirty with the plates everywhere. When a table left without paying because their service was so awful, no one said anything about it or seemed at all surprised. The manager was in the kitchen cooking the whole night (most likely meaning they were understaffed). She also refused to acknowledge that one of her servers wasn't good at his job, and was rude when we wanted to share anything about it. So many negatives about this location, I would not at all recommend going.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HdnJg1kuz0kRA7QkpLWR3w",
        "caption": "Photo of IHOP - Matthews, NC, United States. Incorrect order with one piece of bacon ripped in half to look like two",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HdnJg1kuz0kRA7QkpLWR3w/o.jpg"
      },
      {
        "img_id": "EQfvhRmOUJpU9W1OZQ74lA",
        "caption": "Photo of IHOP - Matthews, NC, United States. Raw pancakes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EQfvhRmOUJpU9W1OZQ74lA/o.jpg"
      }
    ],
    "user_id": "EBHTC7MGcOPgY1J2AAXtDw"
  },
  "ZT6JhB5qsOiMtQ6fnDIRZg": {
    "date": "5/19/2019",
    "text": "***THE YELP WAITLIST OPTION DOESN'T WORK AT THIS RESTAURANT!****  Joined the waitlist before we left home and were told to arrive in 15-30 minutes.  When we arrived at the restaurant to check in, I advised I had joined the waitlist through Yelp.  No one seemed to know what I was talking about at the hostess stand.  The hostess proceeded to ask the other employee at the check-out counter and she said they used to have the waitlist option but not anymore.  So, I put my name on the \"other\" waitlist at the restaurant to wait another 25 minutes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-X-4mxTU8W4SPhtu02noA"
  },
  "wvYU0x76BWOB0LCy7dDjkg": {
    "date": "9/29/2018",
    "text": "1 hour and 30min to bring food and it's not clean, horrible customer service. Worst ihop in Charlotte. DONT COME HERE. Paper and food on the floor and just makes you want to throw up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mzUX73gApChNyq66pS_itg",
        "caption": "Photo of IHOP - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mzUX73gApChNyq66pS_itg/o.jpg"
      },
      {
        "img_id": "d9f8ID-kSTgJ3S698UvzGw",
        "caption": "Photo of IHOP - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d9f8ID-kSTgJ3S698UvzGw/o.jpg"
      }
    ],
    "user_id": "qfBOUkCMwwGTlECpqAjEHg"
  },
  "rkof-dHgkHjF_TjaxEWbsg": {
    "date": "3/29/2019",
    "text": "Not bad. Had breakfast here on Friday morning.  Had blueberry pancakes, hash browns, boiled eggs and sausage link.  Pancakes were good, sausage links were cold, hash browns and eggs were fine.  Decent breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOhyDyMWN7ckYDNA4C-JDA"
  },
  "w4exhi--YWehBoBN18-COQ": {
    "date": "7/21/2018",
    "text": "Ok, I've been in a lot of IHOP restaurants. A LOT. Most of the time it's hit or miss. But, this IHOP was outstanding. The service was perfect with a server that made sure we had everything we needed. I think I got pancakes that were HOT for the first time ever at this particular IHOP.  We were seated immediately and at no time did we feel ignored or rushed. Overall it was the best IHOP experience I've ever had. Thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yoOIgcTUZ5QZ0wsgSfHrkQ"
  },
  "mDfpuUya5LI24AxVH1hOng": {
    "date": "1/8/2018",
    "text": "Delicious breakfast made hot.  Friendly staff.  I made an order once recently.  The woman over the phone mistake my side order as a substitute.  I returned to the restaurant for the correction.  Immediately the manager recognized me once I came back and took care of the situation.  On my way I went with my meal still warm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "VA8WMTNqbCHoyKRk1pPVHA": {
    "date": "3/28/2017",
    "text": "Decent meal if you're up late. I like their breakfast meals and chicken fingers are a sure solution to your hunger. The employees are working hard and getting your orders quickly and do check on you.  My weariness is after midnight there is some undesirables in the restaurant. Like cursing almost starting fights.  Many times I felt bad for the employees with the idiots eating here and also staying way over the necessary time to have their meals.  It's a restaurant...not your hangout!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JU54PFtLnY-zZweOrxsmvw"
  },
  "qjc6-2wqmTpSFfxPQvXPvg": {
    "date": "2/16/2019",
    "text": "It's All-star weekend, so you can imagine the crowd. They handled tje large number of people quite well. We were sat after about a 5 minute wait. The server, Nakia, was quick and attentive, considering the circumstance. The food was as you would expect from IHOP. It was all positive,  this day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k_3kwR3Oo1R4FMJGWE8NMg"
  },
  "J54mPEuQ2vVNQXOvuwy8Ng": {
    "date": "12/26/2018",
    "text": "Food was great. The waitress was friendly and polite. We were seated as soon as we arrived. Quiet and clean. Pleasant atmosphere. I love coming here. Every time I'm in Charlotte,NC... this where we go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ot0077D7oiYFN_DDVpowsA"
  },
  "2VMzjpu1GK9nWowSDzsf7g": {
    "date": "12/1/2018",
    "text": "I went to this IHOP last night around midnight. During that time I imagine servers are tired and I don't anticipate everyone to be energetic and eager to interact with me. However, my server Misha connected with me and the others at my table instantly and made us feel at home. MIsha's customer service skills exceeded my highest expectations. She was constantly engaged and attentive to all our needs, no matter how small. Throughout our time there, she continued to make jokes and light conversation and I left feeling like I had a new friend. I could tell she was passionate about upholding herself to the highest standard and I appreciate her dedication. Thank you Misha, I'll definitely be back!  -Lexi",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UoPa-FMhYWHDjLfFzw6Ww"
  },
  "y_Rjv_go7SigzH5nLyogzQ": {
    "date": "12/21/2018",
    "text": "Had to find someone to seat us, server was baked and didn't know menu, food arrived cold then server told us they needed to wash some silverware to get us some, toast was giant hard croutons, over easy was under easy, table advertising was covered in syrup. Seriously bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ud65cwlP7UDINMl5FKOQQ"
  },
  "MFqZ56deAD5hvoLW9eEdYQ": {
    "date": "9/6/2018",
    "text": "This was our 2nd visit to this location. Unfortunately, it was worse than the first.  When my husband and i first arrived, the manager walked right by us to check someone out and didn't even greet us. We waited a short time and a lady came and sat us. We waited some time for our waitress to come get our drink order. We ordered coffee and water. We sent my husband's coffee back 2x due to lipstick being on the coffee cup...gross!  We got our food and mine was cold and not to my order. After trying to get it correct, my husband and I offered to pay for our coffee and left! Our service was slack, food was nasty! We went to another restaurant and had a great meal. We will never go back to this Ihop. Two visits and we are not happy. Do not go!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s65mlOXwNc0lZHae43-Npw"
  },
  "5stuwxcDk3mIHd8Mk8FAHg": {
    "date": "6/25/2017",
    "text": "WORSE SERVICE EVER! DO NOT EAT HERE!  I came with my family for a late breakfast. After 20 minutes of wait without water or coffee. I flagged a waitress who was passing by to ask her if she could get someone to take our order. She called one lady who when she came she didn't even write the order. Keep in mind there was 6 of us. When they brought our order it was obvious that it was completely messed up.  What makes me even more upset is the fact that the place was empty and counted a total of 13 servers! WTH???? And you can't even write down a simple order ???  They need to start hiring decent managers and decent servers instead of the redneck hillbillies they have working here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AkvjMi2odf8jkScK8DHLeQ",
        "caption": "Photo of IHOP - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AkvjMi2odf8jkScK8DHLeQ/o.jpg"
      }
    ],
    "user_id": "PkFr8m1q1I-Xfw-pnuDTpg"
  }
}