{
  "WtYilJnYk9fpPzspwmU5jQ": {
    "date": "10/19/2018",
    "text": "Not great diner food. The food was OK, but nothing special.  Waitress had to come back twice to ask me what I had ordered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mWLIJNihqHS9xzS5z11kCg"
  },
  "mYNLWEzBEt0Amcn9hgor6w": {
    "date": "10/19/2018",
    "text": "The food was delicious but I had to order another dish because a side of eggs was not offered. They also did not offer hot chocolate. I would go there if there was something specific that I wanted but I would probably go elsewhere if I wasn't sure and was looking to try something new.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_CAJLewwxYSUfCiYOvpt8Q"
  },
  "N1sgVGDkrgHM329vFC11nA": {
    "date": "6/30/2018",
    "text": "My wife has hashimotos thyroiditis along with borderline celiac disease, which means that she cannot consume any gluten, grains if any type, dairy, or nightshades. Needless to say going out to eat can be very challenging but there are options as long as the kitchen and wait staff is corporative. When we walked in, we were greeted by the hostess. My wife asked for a gluten-free menu to start. The menu said they used gluten-free buns, but my wife also can't have any grains including rice flour whichch is a common ingredient in some gluten-free breads. She asked the hostess if she could ask the kitchen what ingredients are in the bread. We watched as the cook in the kitchen yelled at the hostess saying that \"nobody's ever complained about our gluten free bread before so I'm sure the lady (my wife) will be just fine!\" That's when the hostess embarrassingly repeated what the cook told her. My wife then heard the cook yelling at her for the whole restaurant to hear, hat she shouldn't have any troubles with the bread. My wife then tried to gently explain that she needed to know the ingredients because she has to be sure that there are not other allergens in the bread as well because she had more than just a gluten allergy. The cook then loudly yelled at my wife in front of everybody which was humiliating! The other patrons were shocked that this cook was doing this. We left immediately because I knew that if I stayed any longer I was going to beat the s*** out of that guy in front of everyone. It took everything I had to not go back to teach that guy a lesson. I called the manager and told her what happened and she said that she heard about it already. She said she was going to do something about it but I know she didn't because I recently heard from a friend who said that same guy is still working in the kitchen.   Needless to say, I will NEVER go back there again. There are other choices who have employees who are at least a little sympathetic towards those with food allergies. I understand that perhaps the cook was having a bad day, but that doesn't give him the right to yell at someone just because he made a bad career choice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oQ2w85pR6Jr2_xp_K8jn9A"
  },
  "WsWp-C-RYODiwsUoFflkrg": {
    "date": "4/11/2018",
    "text": "This place is ridiculously amazing. The wait is usually a long one but so worth the wait. The food is awesome and boy is there plenty of it. The staff are so patient and courteous. Give them a shot, you will not regret it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vMY0tigZrBLKTj-GkgrAAQ"
  },
  "SOZslFfXWO5o4NWjgHoIbA": {
    "date": "7/15/2017",
    "text": "This is a great place.  Food is very good and you get plenty of it. Service is excellent, fast and friendly. Best seat is at the counter.  You a great view of the food prep. Its like looking at the cooking channel live. Great fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNVe1zldH_184KeP1G43Og"
  },
  "K1vRHQX9RtP3to6VKrD9hg": {
    "date": "2/23/2018",
    "text": "Delicious!! Hash browns perfect, service impeccable and spicy chicken biscuit with honey amazing!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsQeJACz6bxIanxolMtRPg"
  },
  "_nHIcWceAybADx-y_FGvpA": {
    "date": "7/7/2017",
    "text": "We enjoyed our sandwiches for lunch. She had the Grilled Reuben and I had the Pastrami on Rye. They were both great. Once we were seated service was excellent. We have tried to eat here previously but we're not willing to wait. Glad we finally tried this busy place!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VsuqtPlOXQnLoqU4iJ_VOw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VsuqtPlOXQnLoqU4iJ_VOw/o.jpg"
      }
    ],
    "user_id": "dIIPdD2TW_PZb-U396e1LQ"
  },
  "zz9G2UCokfeAkqWLJhL7tA": {
    "date": "4/23/2018",
    "text": "Great diner! Love coming here with some friends! Reasonably priced too. Will be back again for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oBTJsroDYzMG2XLGfx2iEw"
  },
  "sX7QP8btrERPK5ll7zaIiA": {
    "date": "9/22/2018",
    "text": "We stopped in on a Saturday, late afternoon. The place was empty. We were seated right away on the patio and were promptly greeted by our server. We ordered the loaded chips appetizer and the Monte Cristo sandwich. The loaded chips were very good and had a ton of pork on it. Highly recommend. We were full by the time the Monte Cristo arrived but we sampled the sandwich and it was very tasty as well. We packed up 80% of the sandwich and 30% of the chips for the road. The menu wasn't what we expected but we were pleasantly surprised and would recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "py4MyhThMBV4d4ZUK0AwoQ"
  },
  "0mUaWhDywVcDO-zUlLtJQw": {
    "date": "11/12/2017",
    "text": "Chicken and waffles are AMAZING! Everything we had was excellent and the prices were very reasonable. Will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "mM_cWutLMyF82bQhFCldeA"
  },
  "05YT6H5m5qaHgZsQ-6AUYA": {
    "date": "9/19/2018",
    "text": "Second time eating here in one week. Our family loves the comfort food especially the Reuben, hamburgers and chicken dishes!  Clean restaurant and excellent servers. Chad took great care of us!  Will definitely be coming back regularly. So many food choices to try! Priced right and quality food. Love the atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a9s94xiEC9lzUXHxSPjYjg"
  },
  "tSxFdow4v56gsLZ5awXNaQ": {
    "date": "7/23/2017",
    "text": "Family breakfast at Metro Diner,  very good again, crowded but we got sat quickly, the chicken and waffles were excellent, the Oscar omelette was good also. Huge portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jt-E9wyIfsm66yMicqJBTg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Chicken and waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Jt-E9wyIfsm66yMicqJBTg/o.jpg"
      },
      {
        "img_id": "62GqhvsK0iKHzhb6FUFcAQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Oscar omelet: crab and asparagus",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/62GqhvsK0iKHzhb6FUFcAQ/o.jpg"
      },
      {
        "img_id": "ocBgVwdQTYDInq-nktZsFw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Huervos Rancheros",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ocBgVwdQTYDInq-nktZsFw/o.jpg"
      }
    ],
    "user_id": "-SpxqMoZJjCQ80f2_T4UnA"
  },
  "iGLPXS34Q-xfdhHjh1P1cw": {
    "date": "11/24/2017",
    "text": "I just recently moved up from Ft Lauderdale and was driving on Independence blvd when I saw Metro Diner. I was delighted that there was one here being that I ate the ones in south Florida, there were 7 of us. Well I was so disappointed in the food that I was so Embarrassed about telling everyone about how great this place was. The food came out warm the philly cheese steak was way over cooked, the fries just didn't taste good , well I can go on but I won't. Will give it one more try because I really love Metro but just one more.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zclqZBfDwX5Exn-mddE0Dg"
  },
  "JeVkKI6Se50cW0SR7r-WJg": {
    "date": "3/11/2018",
    "text": "Great food.  Interesting options to choose from.  They have flavored teas that don't have to be sweet.  Service has always been prompt and the wait times have always been quick.  One of the spots in our regular rotation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z9ICbsRBjZ7ZeMEIgcWh2g"
  },
  "K9PhA1BejLYtJd1AONbddg": {
    "date": "6/29/2017",
    "text": "Really good new place in Matthews.  Food was great & service was outstanding.  Cant believe what they did with the building.  Very light & airy.  We had the meatloaf & fish & chips. Sauteed veggies were wonderful & haven't had mashed potatoes this good in years.  Fish was crispy & hot. Very large portions   We have been 3 times. Once for breakfast, once lunch& once dinner.  The food was great each time.  Our Grandson was with us the 3rd time & he couldn't finish the food.  I have never seen this before.  Portions are huge. My favorite breakfast item is Johns sandwich.  Service is great& servers are always very friendly & checking in often.  Metro will be one of our go to places.  So many things we want to try on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cHy9HaToSF6DQrnDGEdmxQ"
  },
  "YEjWvX6OyV_AGcHkWfgCpQ": {
    "date": "9/6/2017",
    "text": "I am glad to report a great first experience at this fairly new restaurant in charlotte near Matthews.  Great food good service! Breakfast all day!!!  I will be back...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ISC5I19lqnQzaCZS5JQLg"
  },
  "iLbml_e0hfoGIifIKNitNw": {
    "date": "1/27/2018",
    "text": "Really good. 20 min wait but worth it. Waitresses were spot on. Answered every and substitution request immediately. Got the eggs benedict with avocado and hash browns, subbed turkey sausage links. It looked exactly like the pic, that's rare. Clean, comfy. Just overall great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sI_XU4Lb2G5w106aFDkvpw"
  },
  "_LJLGGdx0aVr0FnSfnFIsg": {
    "date": "2/28/2018",
    "text": "Today was the first time I've visited Metro Diner. I had a taste for chicken and waffles, so I did a quick search to find a place that would serve it at dinnertime and came across this place. I was very pleased with my experience here! I didn't think to take a picture of my plate before I started eating, but I was very satisfied with what I received. I was a little hesitant about the sweet and spicy syrup and strawberry butter combination that they served with the waffles, but I was pleasantly surprised. The helping of chicken is huge: a breast, a wing, a thigh, and a leg. I ended up taking three of the pieces home because I got pretty full off of the waffle alone. The service was very friendly and pretty fast considering how busy they were. I'll definitely visit again in the near future!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5bIuD902yzuUjAZcUTF6iw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. I couldn&amp;#39;t wait to dig in! Chicken and waffles with strawberry butter.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5bIuD902yzuUjAZcUTF6iw/o.jpg"
      }
    ],
    "user_id": "o1_0VyTDXkKvVNErwzt9Tg"
  },
  "aJo462OyB6FesMlhKpU7NA": {
    "date": "2/22/2018",
    "text": "I went for the first time Wednesday February 20th 2018 , heard such great reviews , I walked in at 9:45 for a fantastic breakfast and was told to sit wherever I liked , sat down in the section with the most people to make sure I didn't put the waitress out , I sat and waited for service , I was in between 4 other people and waited , after 15 minutes of being ignored I was very upset , the waitress came to tables all around me but never acknowledged me, didn't offer a menu or coffee , I finally got so discouraged I got up and left , I stopped at the hostess station and waited another 4 minutes to express my displeasure , I was told sorry , I told the lady it was my first and last time !! It wasn't even busy and I was ignored , I've never been so embarrassed to try to do business with a local restaurant , will never go back !!! If I could give minus 2 Stars I would !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JmzaVOu0xMcgjAt8vQ6H9Q"
  },
  "DulhufmdUyu-Hknl14ucYw": {
    "date": "2/8/2018",
    "text": "Food is delicious, huge portions.  Ate on the patio, which even being enclosed and having heaters was a bit chilly.  Was with  a large party, everyone got something different.  Everything was a big hit.  We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYT85xcaEzWR572LvQI7IQ"
  },
  "6UiCMQ2iAeIj0nbcneLWSA": {
    "date": "6/27/2017",
    "text": "FOOD:  Huge Portions....everything that passed by our table looked delicious.   I met my match with the pork tenderloin sandwich.   My friend got the pot roast....he said he felt like they played it safe....but it was still good.  My other friend got a basic breakfast.... he was OK with his too.  Cost:  Pricing was all over the board.   More expensive than typical diners....but the large portions justify it.....I guess.    Service:  Seems to always be on a wait...but I believe thats because its new.   Our server was full of personality, very efficient, and was just great  Atmosphere:   not a very warm feeling environment...kinda basic .... with an old skool throw back kinda feel.   Location: Easy to find, lots of parking, lots of places to wait.  Would I go there again?  Yes.   Is it the best in town...not quite yet...... but its not bad.  My only MAJOR SUGGESTION -   Later evening hours....till at least 10 or 11.   You are losing business by closing at 8.  There are very few places in Charlotte that are open to eat past 9 PM.  That is frustrating.   Later evening hours would be a HUGE plus!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "T6AxtFTt1lw_DzM-g9hjjw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Fried Pork Tenderloin Sandwich. ....  its MASSIVE!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T6AxtFTt1lw_DzM-g9hjjw/o.jpg"
      },
      {
        "img_id": "2znkF9cWu3gDgOS37LDVpg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. 2 Egg breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2znkF9cWu3gDgOS37LDVpg/o.jpg"
      },
      {
        "img_id": "22oDvGMJSsuJBTjTuXy29g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Pot Roast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/22oDvGMJSsuJBTjTuXy29g/o.jpg"
      }
    ],
    "user_id": "g_Q6VOqWQDE_ktlHC-LZNw"
  },
  "XUuEN2qpNCoOMRs87CRSlg": {
    "date": "2/10/2018",
    "text": "Much better places in Matthews to eat. Service is bad. On one occasion we sat 15 before we even got greeted by our server. That same night a table left as their server never came either. I would not recommend this place to anyone.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xB56jfFEPG0iMbnMc_R6cg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. This is supposed to be an egg white omelet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xB56jfFEPG0iMbnMc_R6cg/o.jpg"
      }
    ],
    "user_id": "UFjRQAC6iwnNCACvilUhcg"
  },
  "suzJPzE-fnaSnIWtvO3dnA": {
    "date": "6/11/2017",
    "text": "Brunch. Let's talk about it. Lets talk about Metro diner.   I pull right up to the front of the building. I say building, but it's really the edge of one of the buildings in the Matthews festival shopping center. The one opposite the Harris teeter.  I digress.   There are a few families milling about outside of the entrance. Judging by the jam packed outdoor seating area, they must be waiting for tables. Any place that has a wait at 10:15 on a Sunday , let's just say that's a good sign. However I also don't see a single person in the outside seating area or among the about millers that looks like me.   Some of my people abide by the rule that if you don't see us at a restaurant, then the  restaurant must not be all that good. I don't agree with that per se, but I distinctly remember thinking, \"hmm. I might be the lone brother in here.\" I took a moment to prep myself for that possibility.   My worries were immediately abated when, upon entry, I was greeted by 2 bright eyed young ladies, one of whom looked like me, and was invited to seat myself at the bar next to another lady who looked like me.  If you've never eaten at the bar in a diner, what is your life? There are few More interesting and enjoyable foodie experiences than watching 15 people operate a short order kitchen during a heavy food time. You've got 8-10 short order cooks, limbs and pans flying away. 2 kitchen managers are yelling out orders in that secret diner code. You order a Benedict Florentine? No my brother, that's a Vinnie. You've got a floor manager somehow keeping every order straight and calling out for runners, and these runners! They appear seemingly from the aether ready to get that Vinnie to your table, along with about 17 other orders, somehow not dropping a single plate.   It's like watching that hallway scene from Daredevil season 1, except you get waffles instead of adrenaline.   Everyone there was super friendly even amidst all the chaos of the brunch rush. I, being me, bugged the floor manager About different delectables as they would come out. I learned about corned beef and potato hash. I learned about strawberry butter (STRAWBERRY BUTTER!). Then something glorious happened.   I saw my order as it came out.   I have to tell you about the eggs. They have mastered the art of short order eggs. First, the scrambled eggs were dreamsicle yellow. They looked fluffy and creamy, the way I've only seen the Gordon Ramsay's of the world get them to come out. The omelettes (I got one) (more on that later) were like little pockets of sunshine. So yellow, with just the faintest hint of Brown when you get up close to them. The closest thing to it was the omelette I saw Jacque Pepin make on his tv show about 15 years back.   Ok. So lets talk about my omelette. It came out wrong. I ordered an American omelette with added asparagus (you can get asparagus in an omelette, and that's what life is supposed to be). The American is thinly sliced ribeye, mushrooms, onions and cheese. I got 1/3 of the way through my omelette, when I got the oddest notion.   You see this was one of the 2 or 3 best omelettes I've ever eaten. In all of life. It's easily the best from a technique stand point. The omelette was solid on the outside (remember the whole vaguest suggestion of brown thing?) But the center. It was like custard and souflee had formed a holy union in the middle of this omelette, and I was the only one invited to the reception. It's a testament to how good of an omelette they make that it took me a third of one too realize:  my steak omelette was missing the steak.   I asked about it, hoping to get some steak on the side, so I could finish the omelette as God intended. NOPE. What wound up happening was so much cooler.   First the shift manager, or GM - a young brother with a headset and veto powers (more on that later) - came up and had a short convo with me about how an American is supposed to be. \"Steak is supposed to be falling out the side of the omelette from the first bite!\" He said, or something to that effect. He then orders me up another American with added asparagus \"on the fly\". Cool right? I get to have the full American experience plus, I still have my fruit and bacon, which was now Former bacon. I ate all the bacon is what I'm saying.   I wait with my fruit cup, munching away on strawberries, continuing to marvel at the efficiency of the kitchen staff/ floor staff synergy. Another miracle happens.   I get not only the full American, steak literally falling out the sides, but my FULL FRICKIN ORDER again! Double fruit. Double bacon.   Now the veto powers. I get the first order comped. SOP, right?  GM sees my check, picks it up, and puts down another check. I look at it. Other than my coffee, he comps the entire meal. That's service above and beyond the call of duty.   Oh, yeah: I recommend and will be back in 2 weeks for those waffles.",
    "rating": 5,
    "rated": {
      "funny": 12,
      "useful": 16,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "JZVWAQEodlVWdDEVeOHhaQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Omelette perfection",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JZVWAQEodlVWdDEVeOHhaQ/o.jpg"
      },
      {
        "img_id": "QWaMuRTjN2pa3NIbt1Eq6w",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QWaMuRTjN2pa3NIbt1Eq6w/o.jpg"
      }
    ],
    "user_id": "sY3sHDwBDNwqxnImXXA-nQ"
  },
  "IpV7wB427cob3TL8VlL6wQ": {
    "date": "8/9/2018",
    "text": "Love this place. Great food good service. Tammy was out server. We didn't have to ask for anything. She was very professional. We will be back to see her.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_NT_tZdAZnGzKYHjrGtiuw"
  },
  "F34Og7KPntSwubZ7cA7DqA": {
    "date": "4/14/2018",
    "text": "My mother and I came here for breakfast on a Saturday, we were seated promptly and given a choice of coffee. I got the flavored coffee of the day and my mom got the regular stuff...we checked out the daily specials board and decided to split the Key Lime Pie stuffed waffle and then took a while longer to find something \"not sweet\" as our other item to split (2 egg breakfast to the rescue). Eggs were a perfect over easy, hash browns were crispy, bacon was done just the way I like it (biscuit was a little dry)...the stuffed waffle??? An entire Belgian waffle with an entire slice of key lime pie (with the crust), waffle then folded on top of the pie and then covered in a glorious raspberry sauce! Omg...such good food and the service was excellent, the kitchen was moving like a well oiled machine! Will definitely be back for more!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cHVVaR_3FbIqkv4Pulf-oA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. 2 egg breakfast and Key Lime Pie stuffed waffle...OMG!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cHVVaR_3FbIqkv4Pulf-oA/o.jpg"
      }
    ],
    "user_id": "_ycIButTFN9KDAJQQndl-Q"
  },
  "PIy9Ds7J17v5UGnxAYwUFA": {
    "date": "10/12/2018",
    "text": "We had a great experience tonight. The wait for 2 people was 20 minutes and that was okay with us. The waiter was the best I've had anywhere in years. The food came out fast also. We ordered comfort food and it was plentiful and tasty like mama cooked it way back when. The staff was busy and the place was packed with a few parties of 10 people. Once again I give a shoutout to the swiftness and courtesy of the staff. We'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g-9-aR1KEWt0QyrxL5CYUA"
  },
  "nN9JBFiK20iMbLdIGrPsug": {
    "date": "8/12/2017",
    "text": "Comfort food menu-very hard to find something healthy. I just started a new diet and was limited to a salad or grilled chicken and squash.  We went on a week night around 6 and this place was packed! We were told there was a 30-45 minute wait. Lots of people already waiting outside... We were offered the bar for immediate seating so that's what we chose.   The restaurant was loud. Especially sitting at the bar since the staff yell back and forth at each other. It was fun to watch them cook however.   I got a salad with grilled chicken. Nothing special. All of their salads were typical everyday salads....nothing to return for.   My mom got the roast-she said it was very good. Fell apart with a fork. However it was supposed to come with veggies and it looked like she got the bottom of the container.   My dad got the chicken pot pie-looked good. He said it was tasty but the biscuit topping was tough.   Overall we might come back but not our new go to spot.   Wait staff was nice. Looked a little frantic-maybe they are still getting the swing of things?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "liN8_DMhruzRdfRoa9twkg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Roast beef",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/liN8_DMhruzRdfRoa9twkg/o.jpg"
      },
      {
        "img_id": "SbMfv3COFT79YgMy5eV3Yg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Regular sized chicken pot pie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/SbMfv3COFT79YgMy5eV3Yg/o.jpg"
      },
      {
        "img_id": "8-nJvy2LTl5hE3Y0P4O74w",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Grilled chicken salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8-nJvy2LTl5hE3Y0P4O74w/o.jpg"
      }
    ],
    "user_id": "rW8WuLpZPk9btE3TgkQw2Q"
  },
  "gRRdiB4rZAA3EThYDgLJfg": {
    "date": "6/8/2017",
    "text": "We're big fans of the Pineville location so we were thrilled to see one opening closer to where we live and lucky enough to get an invite to the soft opening today.  Honestly can't say enough good things about this place, everything is wonderful, the food, the service, the restaurant itself.  Today we met Julie - the managing partner of this location - and she and her staff really seem to have it together.    The food: (I'll upload some photos!) - I had the Yo Hala on the Square.  Delicious item I was really hesitant to try in the past, but it was amazingly tasty (and huge!).  Hubby had the Charleston Shrimp and Grits, also fabulous - I had a bite, definitely the best either of us has ever had.  Teen daughter enjoyed the pound cake French toast (it's her *usual* from the many trips to the Pineville location), teen boy ordered the grilled three cheese with bacon and tomato, and then after he finished his, he finished my Yo Hala and his little sister's chicken tenders and macaroni and cheese and his Dad's shrimp and grits (he'll outgrow this phase, right??) - and his opinion was that it was all wonderful.  If I had a complaint (I really don't!) it'd be that having a location here in Matthews really isn't encouraging me to cook at home more.  Not at all!  Full opening is Tuesday, counting the minutes - and I'm going back to *my* usual - because as much as I enjoyed the Yo Hala, NOTHING compares to their fried chicken and waffles (with strawberry butter to die for... SO GOOD!). Trust me, this is the place you want to go, breakfast, lunch AND dinner.  ****** Update:  back again yesterday and now (sadly) I've had to go gluten-free for health reasons.  Never fear - they have a great GF menu and were able to get me some seriously tasty eats!  I had the breakfast pie (I'll upload a photo) - eggs, mushrooms, peppers, cheese.. all kinds of yum and the fresh fruit on the side was wonderful despite the upcharge.  Hubby had the Monte Cristo (photo of that too!) because he has no gluten issues and he also was thrilled.  Definitely will be back (likely before next week lol!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KFJbuvpbriEt8ik0amlMrA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Monte Cristo with cheesy grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KFJbuvpbriEt8ik0amlMrA/o.jpg"
      },
      {
        "img_id": "CrXfIA7bErNHeoVJHCgs1g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Breakfast Pie",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CrXfIA7bErNHeoVJHCgs1g/o.jpg"
      }
    ],
    "user_id": "Mqx5qS4_pF6yY1id5lS7ag"
  },
  "0el9ak03xrhKNYPSeWFdeA": {
    "date": "4/12/2018",
    "text": "I have been meaning to come try Metro Diner and this morning had the opportunity. I ordered the San Francisco Eggs Benedict. It was fresh and delicious. The Hashbrowns were cooked perfectly and the flavored Coffee of the day was Bavarian Chocolate and that just completed the meal. So good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GuxRtIJqXNLh8MgSssxr7A",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Fresh and oozing with poached egg deliciousness",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GuxRtIJqXNLh8MgSssxr7A/o.jpg"
      },
      {
        "img_id": "IZYllYb0iUgqij_QCOkXxQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. San Francisco Eggs Benedict",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IZYllYb0iUgqij_QCOkXxQ/o.jpg"
      }
    ],
    "user_id": "8YFFXPRXe2QqhvUyQNV00A"
  },
  "QGBNN1Q0yebIRDOgm3MfTw": {
    "date": "1/8/2018",
    "text": "Me and my girlfriend went here about three weeks ago on a Saturday afternoon. We loved it! The food was delicious! Our waitress, Leslie, treated us like royalty. She did it with a smile. Check this place out  you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FD4t6fpVvRZ1KNHGNOaytA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FD4t6fpVvRZ1KNHGNOaytA/o.jpg"
      },
      {
        "img_id": "cHmR3y-9H8EXCc140Aq8DQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cHmR3y-9H8EXCc140Aq8DQ/o.jpg"
      },
      {
        "img_id": "kajxfHLHjtw4qB9swTAXrw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kajxfHLHjtw4qB9swTAXrw/o.jpg"
      }
    ],
    "user_id": "mWo-q1z-NtHWpmzHcaDcGQ"
  },
  "KwvPwsiEv5l0IMo2RFav4A": {
    "date": "9/14/2018",
    "text": "This place is awesome. Great breakfast, love their crispy hash browns and the waitress kept the coffee coming. Very happy we found this gem. Decor and music were also good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3V70YY58E_6PlZ8py2nzQ"
  },
  "p2a6oaRq0ltOC7CKUauevA": {
    "date": "7/22/2017",
    "text": "Of all my reviews do I rarely give out 5 stars but this place deserves it. The customer service is off the charts in this place from the time u walk in the door till you leave. I sat at the bar and got a birds eye view of the kitchen and the cooks got it going on. I believe my servers name was Amber she was great. This place is the bomb and I will be back. I ordered the giant fish sandwich, I got mines grilled but u can get it fried or blackened which I will try next time. Phenomenal, hands down the best Diner I've been to in the city and there were a lot of people in and out of this place for the location of it. I was very surprised I don't even know how long it's been there.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-W5-GiVKysPbZK29V-khJA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Food that was sitting in the window. Looks good...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-W5-GiVKysPbZK29V-khJA/o.jpg"
      },
      {
        "img_id": "qjCjxEgBrEBMDARsyIOqfg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Giant grilled fish sandwich with a side of fries. You can get it blackened or fried also.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qjCjxEgBrEBMDARsyIOqfg/o.jpg"
      }
    ],
    "user_id": "Hf1dov8HZLiXvfrxIeTZVw"
  },
  "VeldSzJBOFiqILQ-HZE6HQ": {
    "date": "12/30/2017",
    "text": "One star is a gift! And that is only because the portion sizes were decent  & the sandwiches were tasty.  The downside is I paid $9 for a BLT and over $8 for chicken salad. Our server Rachel basically nonexistent. Like other reviews , we also were not provided napkins . We waited over 20 minutes for the sandwiches (kitchen's fault) . We saw Rachel socializing with the staff for a while as we waited for her to return to our table with to go boxes & to retrieve our payment.  This was our first time and unfortunately will not return, not worth the overpriced food and poor service. We will drive out of our way to continue to patronize our favorite diner on Central Avenue (Landmark Diner) where the food is amazing, prices are better the portions are larger and the service is outstanding.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ONAMRXbTosi2ULOnQiPzdw"
  },
  "Hg1-KyPCs_5Q2R6vuLSBtg": {
    "date": "12/28/2017",
    "text": "I'm being generous with three stars and as I typed this I'm not sure why. Sooo demerits! 2 stars it is. I had the biscuits and gravy and the chicken biscuit. The food was just ok. The chicken was tasty however.   The service is what gives this place a 2. I was told to sit wherever I want but there was nothing but dirty tables available. When I asked someone to clear the table I seemed to annoy them. I ordered coffee and while the waitress and I discussed refills, she decided I meant I wanted my 2nd cup of coffee with my check. I asked for napkins never happened. Not a one. I've also been staring at my to go order for 15 mins. I tipped 20% but I'm kicking myself for that as there was zero service. I'm Legit NEVER coming back here.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "KG83JB2lGOjR4u4X1BXeYg"
  },
  "ub-4bZVU5fOFJZWrS48YQQ": {
    "date": "9/3/2018",
    "text": "Have been to Metro Diner three times now.  The first two times were amazing!  I was waited on by a phenomenal waitress, didn't catch her name.  The food was excellent!  So my dad came in town today and because we had raved about the place he insisted we take him there.  We get there and get a horrible waitress.  Poor customer service and bad attitude is what she gave us.  The food wasn't even as good today.  So the manager came over and we asked about the other waitress.  Apparently she's relocated.  Poor us!  Will try again in a month or so but if we don't get better service and food we are done!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rk89Iv0VRzmtJ9f7eQHKMA"
  },
  "_WXHZQsmR0HfbgcvRELgzg": {
    "date": "6/9/2017",
    "text": "Took my boys there for dinner. It was awesome.  My son had the biggest breakfast hamburger I've ever seen in my life. And it defeated him. I had a awesome vegetable avocado wrap and my little guy had what he claims to be the best chicken tenders ever. Sitting outside on a breezy afternoon was a bonus too.  We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A8iiN6p95ddjIQfv0dZgWw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Super delish avocado veggie wrap.  And enough for lunch the next day!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A8iiN6p95ddjIQfv0dZgWw/o.jpg"
      },
      {
        "img_id": "Hsc-qtAyvr0Efa-g6yWIbw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Craziest breakfast burger I&amp;#39;ve seen.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hsc-qtAyvr0Efa-g6yWIbw/o.jpg"
      }
    ],
    "user_id": "7a_jU2HocMW2yTpckbnLNQ"
  },
  "lDFCtAlOokxnoq-wog8SlA": {
    "date": "6/25/2017",
    "text": "4 STARS ALL FOR THAT BIG FISH SANDWICH!  I got the fried fish sandwich for brunch and it was EVERYTHING!  The fish was very fresh.  I think that's probably all I would order from here on.  Breakfast is so so.  We tried this spot when we lived in Jax too and the breakfast was never all that.  So I would definitely come here for just lunch or dinner.   They could also use a little more friendly waitresses, the hostess and managers were the only happy faces.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "22Mz4K-VgzJgQgHg8eFfmQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/22Mz4K-VgzJgQgHg8eFfmQ/o.jpg"
      },
      {
        "img_id": "Wz6gGwp5Sr5C6UwsC9-AVQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Wz6gGwp5Sr5C6UwsC9-AVQ/o.jpg"
      },
      {
        "img_id": "Bq1Zclc8Lt7Fp7AR9Wq5HQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Bq1Zclc8Lt7Fp7AR9Wq5HQ/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "DTv7gO_WyAdE7RNlvyHXWA": {
    "date": "2/17/2018",
    "text": "My Spot BUT if you get Bradley as a server, ask for someone else!!! I've had him twice & each time he was a DB! No personality, no \"you're welcome\" after multiple \"thank you\" just not personable. He came to my table to take my order and to bring the check, however, I saw him at other tables multiple times. The food is usually stellar, but today I received a plate full of grease. I ate here often when I lived in Jacksonville, and multiple times here in Charlotte, and I will say today is definitely a disappointment!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O-lAEgPRCWbpIm18HB74Ew",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. I love this place and Fran the manager is awesome!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O-lAEgPRCWbpIm18HB74Ew/o.jpg"
      },
      {
        "img_id": "sEXVhQTzJLgeyMkKOk2z5A",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sEXVhQTzJLgeyMkKOk2z5A/o.jpg"
      },
      {
        "img_id": "s59J1xYkH-_-wxADGcAcJQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/s59J1xYkH-_-wxADGcAcJQ/o.jpg"
      }
    ],
    "user_id": "4loetgoZG3T1zzP0hplXAA"
  },
  "Vl4K6VWB8fl8cuUf0fhzgQ": {
    "date": "1/23/2018",
    "text": "I dined tonight with a group of Elite Yelp member tonight. Pretty cool event for my first time attending one after being Elite for a year.  I sampled many entrees.  The Huevos Rancheros was pretty good but I omit the egg or have it scrambled.  The fried jalapeno wasn't hot which was good.  The croissant French toast was tasty.  I had my first chicken n waffles tonight.  The strawberry butter sauce was a favorite for everyone.  The chicken was hot and crispy (not salty at all).  The andouille sausage in Charleston shrimp and grits brought out the flavor.  Otherwise it would have been quite bland.  The meatloaf was quite interesting as it consisted of many types of meats in one.  The vegetable mix and mash potatoes was a nice addition.  The Holy Devoli burger was stacked and perfect for a cheese lover.  This is a good restaurant as it has a variety of choices so patrons can come back to try something different every time and establish favorites.  The service was the upmost attentive, food was warm, good presentation.  I would expect everything to be the same as a patron.  I feel they were sincere regardless of the type of occasion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JkVtFvgCJgCBdnjtHjL66Q",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Burgers n fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JkVtFvgCJgCBdnjtHjL66Q/o.jpg"
      },
      {
        "img_id": "jfmrggGMKthd2mzD8-p5sg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Meatloaf",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jfmrggGMKthd2mzD8-p5sg/o.jpg"
      },
      {
        "img_id": "BR_cGJjdigPhMlQ5lurgsg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Andouille Shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BR_cGJjdigPhMlQ5lurgsg/o.jpg"
      }
    ],
    "user_id": "DaUJvHMmKoDDT3vB_ltJ6g"
  },
  "TzqYjyOaMHcn4FWql6-vSA": {
    "date": "1/30/2018",
    "text": "I would say, after eating here, that i would return. Food was quite good with generous portions. Atmosphere was nice and cozy. By the time we left, around 8pm, the place was packed. Tuesday! That says a lot. Service was ok. The Reuben was a bit greasy but tasted good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sgHTJdMd5RPcTc7WFzowDA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Meal portions are generous. Au Jus sanfwich, reuben and soup n sandwich. Also get a side. I chose a salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sgHTJdMd5RPcTc7WFzowDA/o.jpg"
      },
      {
        "img_id": "rdgNWeEl8EPZP2brnfLKOg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. We got there at 6 pm and by the time it 2as 7:30, the place was packed. Tuesday. Quite popular in the area.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rdgNWeEl8EPZP2brnfLKOg/o.jpg"
      },
      {
        "img_id": "xn5Hs2ce1EgV8-0ho7rU5g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Mt first time at this diner. Nice atmosphere and a good selection of food. Breakfast all day. The portions are large.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xn5Hs2ce1EgV8-0ho7rU5g/o.jpg"
      }
    ],
    "user_id": "WadXZbiBf1QVAV6wqGJ1YA"
  },
  "iweuiy8IWkoGfznUs9Elgg": {
    "date": "12/4/2017",
    "text": "I would give Metro Diner a 4-star review because I am generally a fan of the food there; however, there have been some problems with consistency recently. I don't know if management looks at the reviews and corrects issues, but there are some people working there that I can only assume don't care. On one recent experience as I was taking the utensils out of the paper bag, a wad of paper fell out. Then when I pulled the utensils out of the bag, there was a rather large piece of paper - likely napkin material (about 3/4\" x 1-1/2\") that was \"glued\" to the knife inside the bag. I assume that a human is putting the utensils in the bags after washing them, not a robot. If a human is stuffing the utensil bags, clearly the person doesn't care about what they are doing as the foreign material was very easy to see. My wife ordered breakfast and the toast was badly burned - completely black crust and flat sides. The hash browns are usually very good - nice and golden on the outside and just cooked through on the inside. On a prior visit they were overcooked to the point of being blackened on the outside and very hard all the way through. I doubt any of these incidents are up to the standards of Metro Diner, but it looks like no one is paying attention. It's hard to believe any restaurant would send such obviously burned food out of the kitchen.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-b0suxr0Sel6Q7lw52vtmw"
  },
  "25ba2HXJDTeKDoYv6srhpQ": {
    "date": "11/12/2017",
    "text": "Well that was an experience....and not the kind I want to repeat. After waiting about an hour to be seated, we then waited another 40 minutes with about 50-100 other restaurant patrons who also had no food for our food to come out. I can put up with a lot in the pursuit of a good hungover Sunday breakfast; however, after being told that there were three managers working in the kitchen and not one of us got the right order, I was a bit confused to say the least. One of us had eggs that definitely had just come right out of a chicken in the kitchen. Another one of us got eggs that got extra cooked to make up for the lack of cooking in the other eggs. My potatoes were definitely chopped and plated raw. My fiancee got a wrap with sour cream...we're vegan. And my other friend got everything that she asked for to not be in her food in it. Were we comped for any of this? Nah. Like I said, it was an experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vf1eAEnD39uPW4gF0m5hOg"
  },
  "SSyLbGizq2t0sdi61cT64g": {
    "date": "12/1/2017",
    "text": "Food is pretty good so is the service. Today I ordered the chopped Salisbury Steak. While the food tasted good, the steak was not chopped and did not come with most of the items listed. Again the food was good, however the chopped steak was basically a large burger without the bun. A bit disappointed when I realized I ordered a bun less burger with gravy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pi0Hh4x6KtRNvanQXuiB4Q"
  },
  "439nruhnUsGY3txvYxDGTg": {
    "date": "11/24/2017",
    "text": "Excellent food we have been here a few times now. For breakfast the food is some of the best and I have yet to be able to finish it all, come Hungry. We have also been for lunch and got the meatloaf and my wife got a Rueben, again you will leave full. Meatloaf was moist and tasty, the Rueben piled high. Everything we have had was great and service is always good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cu2YPI6d7_dwnzFngT7tPQ"
  },
  "7yy-F_boAbPhpugbyj_0vg": {
    "date": "9/21/2017",
    "text": "First time visiting Metro... I ordered the chicken and waffles. My daughter had the philly and fries. The chicken came out a little to crispy for my liking and it includes white meat, which I don't like. The waitress immediately addressed the issue and the manager even came over to correct it. This time around, it was PERFECT!!! I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1lb6sFkKUHa8KvuCY20hGQ"
  },
  "IV3VkLPZKskShzHn8ciKjw": {
    "date": "6/27/2017",
    "text": "We had high expectations after reading all the positive reviews and decided to give breakfast a try. Sadly our expectations were not met. The biggest issue is training! The staff seem to have a willingness to provide service but lack structure and training. I walked in with my kids at 10.30 am and the hostess told us sit anywhere. A free for all, no menus, no guidance just pick a table! The problem was none of the tables were clean inside or outside on the patio. We sat at a dirty table and waited for about ten minutes until Chastity came and cleaned our table. She then got us menus and  proceeded to serve us, however you could see that she along with the rest of the staff were overwhelmed. She brought coffee but no creamer and then we had to wait for silverware. By that time my coffee was cold. The breakfast food is mediocre, nothing to write home about. I ordered eggs with sausage links and waffles for my kids. The eggs were rubbery and tough and the sausage links were deep fried. Is that a southern thing? The waffles were fine. The manager should have been on the  floor clearing tables today and meeting and greeting guests. Not a good start for a new restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oOdlZO__9NSMRwiYBrwn6g"
  },
  "qDE1hMo_1yaZkxtPPYIG3A": {
    "date": "6/21/2017",
    "text": "Lackluster Lunch Experience.  Got the shrimp Po' Boy sandwich and fries.  The shrimp wasn't well seasoned and the fries were pretty bland. There was generally nothing amazing/really tasty about our lunches (went with 2 coworkers). Will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "e9IV6FFPJyzGra-onFQ-eQ"
  },
  "i1KsJQHTiT7WFFIrlK7T5A": {
    "date": "11/7/2017",
    "text": "Wonderful! What a great atmosphere. Customer service is great, perfect spot for our family. We will be back. Classic food, I have only had the breakfast but it was great! Nice touch being able to get your own beverage while you wait. Truly feels like you are at home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqxT0m98S_SSmA9zGNWyFA"
  },
  "OnkMjB5dY416EOyPwZ1UyQ": {
    "date": "6/15/2017",
    "text": "Enjoyed a hearty breakfast cooked to my liking at a reasonable price. Our waitress was spot on with the coffee refills and big smiles. Metro offers the lunch menu at breakfast time as well, so maybe I'll venture a Minorcan clam chowder on my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9x0pzVf2UDcXYzZ21ax6ww"
  },
  "P55mw4xqBZrJNwoEZN2JDw": {
    "date": "10/7/2017",
    "text": "The food was good and the service was excellent!  It was super busy, but they got us to a table and got the food out very fast!  They certainly have a well trained staff who is happy to be there and treats guests very well!  I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hcZl8l1ZbkSN8w6UddZHcw"
  },
  "zQOL2yKvOk3Ciqh7u6w8hw": {
    "date": "8/26/2017",
    "text": "I'll start with the food: breakfast burger is delicious and large. The over medium egg on the burger was cooked perfectly. The Onion rings were also perfect. My wife had grits that were obviously real grits, not quick or instant. They were creamy and one of the best bowls of grits ever. Her scrambled eggs were fluffy and cooled to perfection. The gravy biscuits were also perfect. We can't say enough good things about the food or the generous porportions. What? Only 4 stars? Let's move on to the service. Our server was very nice and very sweet. Attentive? Not so much. Never noticed when drinks were low. Had to flag her down to get extra napkins because she wizzed by us every time. At check time (and we needed boxes) my wife got up to go find her. A little more effort on service and this is a 5 start all the way. We WILL be back and try more items from this epic menu that serves breakfast, lunch, & dinner all day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "opPMmpahSirQ4nmNkIAnug"
  },
  "7ThK-dDokLsuF4rg4X5JkQ": {
    "date": "9/29/2017",
    "text": "Great place! I called ahead and was told they don't take reservations, so we went anticipating a long wait - we had a party of 22 hungry college runners and it was Friday night.  However, we were seated quickly even though the restaurant was quite busy. The manager Julie went out of her way to take care of us both when I called and while we were there, our server was excellent and really nice, and the food was delicious and inexpensive. A man named Darius, who made sure the orders came out correctly, was very kind and friendly to everyone who came in. We really enjoyed it !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s69uQuanAP1yPwmwHbhjfw"
  },
  "6JVYwdjUn2eRBJFK8xca7A": {
    "date": "9/18/2017",
    "text": "Visited Metro Diner 9/18/17 and had their chicken and waffle. For the first time I can say I enjoyed eating this meal. I have tried it at various locations but have never been blown away like I was this time around. The chicken is marinated for 24hr giving a fantastic savory and salty taste with great texture. The waffle was prepared well, but what took this platter to  another level was the strawberry butter. The mixture between the saltiness and crunch of the chicken, paired with the sweet and fluffy waffle, followed by the soft fresh butter created, a mouth full of orgasmic flavors and textures. I will definitely return and highly recommend to others. Furthermore, their portions are very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEeyBTkKeBRqIXY2JEZrdw"
  },
  "_Q_ABNAKTOsjdlxX0NjJyw": {
    "date": "7/18/2017",
    "text": "Very good diner. Everyone was very friendly and the service was very quick. I had huevos rancheros and for the most part it tasted really good. There was too many black beans but again the flavor was good. I would probably have used green chiles instead of jalapenos. Eggs were cooked perfectly. I will definitely come come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t9iyU9wSe0a9x6faoNuPmw"
  },
  "yWngxNRrZjc5KpOzciQ6wQ": {
    "date": "7/7/2017",
    "text": "We have visited twice. First time food was good service was awful but that was the first week they opened. Visited again this evening and we will not be back. My husband got the Greek omelette. The filings were just set on top of the eggs and were cold. The side of grits were so thin it was like eating chunky water. Service yet again was terrible. When the waitress brought our check she was chewing food. She disappeared often and hardly refilled our drinks.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfdK0uvbuknyhcfxQalguQ"
  },
  "b77RGBw1nKsJr0vs89AlrQ": {
    "date": "7/7/2017",
    "text": "Great food. Great service.  We ate at the original location in JAX Florida earlier this year and enjoyed it.  Food at this location is just as good.  Unique home style meals.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LWE0NcSW5j45vLyTW98_aQ"
  },
  "ccD_HdN-lzMlg7-mEuEcwQ": {
    "date": "7/6/2017",
    "text": "Went for the first time last night. Great new neighborhood place. Good food and portion size and very reasonable prices. Looking forward to our next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4AXIRoEGUxGKOSK9GJfl5A"
  },
  "lUqz6n01iAuBm4hDdwBmSg": {
    "date": "7/6/2017",
    "text": "I am sitting here now. This is my third or fourth time. I love the pot pies and have only tried them so far because they are so delicious. I almost got up and left today, though, after being told to sit where I wanted, doing so, and then feeling invisible for 5 minutes while two other parties came in and got menus and drink orders before anyone came to my table. I'm sure it was just an oversight, but hopefully, the staff will work on noticing customers as they are seated. That said, my sweet tea is so good, and I'm looking forward to that first bite of yummy pot pie. So far,  all my servers have been great (once I got noticed).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ccCKmujXSABIYAEZBrxgPw"
  },
  "wU0huPt5cT5T0b--l1OeNw": {
    "date": "8/8/2017",
    "text": "Love Metro Diner. They actually know how to scramble an egg!! Lots of food for the price. And friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NJvnBlhimIGx_a-uiuRKDQ"
  },
  "fFmIqvrA7TqZTgGHN7MqJg": {
    "date": "7/30/2017",
    "text": "We really enjoyed the breakfast here but lunch food also looked awesome. Food was great, service was excellent, large portions and reasonable prices. Wait time wasn't bad at all 15 mins on a Sunday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-41ngRmyetmxs60gZ-PxA"
  },
  "b9AkQbVmcpnGgyiYPLoOmg": {
    "date": "7/23/2017",
    "text": "It was ok, wasn't anything special. Homemade corned beef hash was good, not outstanding. Wife got biscuits and gravy, was good. Very expensive for breakfast! I will give it another chance, if I have extra money",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzYjBvPJD5NHoNP3uQI4cQ"
  },
  "fyNRoVKdjdDF7Eo1FQ6uOQ": {
    "date": "7/16/2017",
    "text": "A friend of mine took me to Metro Diner last night which is behind Carrabbas's on E. Independence in Matthews.  We sat at the counter and had a blast - the food & service were outstanding, huge portions and great prices.  They open every morning at 7 AM for breakfast and close at 8 PM during the week & 9 PM on weekends.  They have a location in Pineville and are opening a Huntersville location in October.  One of the guys behind the counter told me they have 63 locations across the country and were reviewed by Diner, Drive-ins & Dives in 2010 at their location in FL. Go try it and let me know what you think!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mv0ekV5qJb0YRMI_XmQj1Q"
  },
  "Ph8s_XTZaeTBtomqes5DgA": {
    "date": "8/4/2018",
    "text": "After 7 months and a bad experience we decided to give this restaurant another try. I ordered the shrimp and grits. It was delicious, and made differently than I expected.  We will come back again",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vj6hFe9H1EqzaeZCul72Tw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. The shrimp and grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vj6hFe9H1EqzaeZCul72Tw/o.jpg"
      }
    ],
    "user_id": "ksrxBKCPd5MJqy0nsMzIIQ"
  },
  "z_Mhl79e5zqMkslEWnwQEQ": {
    "date": "11/13/2018",
    "text": "I never feel good about giving 3 stars or less. It has to be justified.  Today is one of those days.   I know my review doesn't have pictures of the menus, but feel free to look one up after this.   Have you ever gone out to breakfast and the bill was $40??  Sure.  Now picture how many people it took to get to $40.  Are you counting 4 or more?  Me too.  Our bill was $40....for 2 people. 1........2. $40.  No mimosas, no steak and eggs(which is $15.....why??) not even something extra to take home for a little later.  Each of us got a meal that costs at least $10.  (Eggs, bacon, and a side, why does that cost $10+???). Omelettes, $10.  A breakfast sandwich, $7.   This is ridiculous.  The only reason this review got three stars was that the food was good.   Not $40 good, but what you'd expect out of a chain restaurant.  I'll never go here again.  I'm sorry.  I'm sure the food is good, but I can go and get a breakfast sandwich half the cost anywhere.  And any True\"diner\" is more than half this price.  So to sum it up, if price doesn't matter, enjoy!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "nwYigov-wnAETjjgrHKBNw"
  },
  "856EBtiAIhru18j3wPP7nA": {
    "date": "5/23/2019",
    "text": "This is a place you must go!Great food, great service,  in convenient location that is not congested.   A rare gem just out side the city,  with outdoor seating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4M_K0QLttHT7Loej95Ilow"
  },
  "eTJKYm0h1ojIMgfWnD-wRg": {
    "date": "6/5/2019",
    "text": "Food is always great. I always try something new and it always impresses me. Well run restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nd364x7hIXY8hub7XCYJLA"
  },
  "kCygJxDj6PAkbctfkhzq7A": {
    "date": "6/15/2018",
    "text": "Metro Diner is a great, clean place to eat breakfast, lunch or dinner at. With a wide variety of food to choose from you can order breakfast throughout the whole day. Personally, I tried the Cajun chicken pasta and had a huge portion size. The pasta had some spice to it but not extremely hot and had excellent flavor. I look forward to my next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aSWXqVmEvALexYknxSjmfg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aSWXqVmEvALexYknxSjmfg/o.jpg"
      },
      {
        "img_id": "aGmt-lGkHTNJ1H3bbn4HYw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aGmt-lGkHTNJ1H3bbn4HYw/o.jpg"
      }
    ],
    "user_id": "YzDD6cc_UtXmAICA_m-C7A"
  },
  "ORFRLTv1WUo5gX4ZX7auHQ": {
    "date": "5/15/2018",
    "text": "This is my second review.  My first review was 5-stars, but I feel obligated to have a disclaimer  My wife, son and daughter were there today for lunch. We have been there probably a dozen times or so and have always loved the food and service - but this time was bad  While delivering the food to the table, the waitress was guiding the 'deliverer' by saying one plate goes where.  For my wife's meal she said 'And that goes to the old lady'. She didn't say it loudly, but all three of my family members heard it.   Not that it makes any difference, but my wife is 52 and probably looks mid 40's at most (not a gray hair on her head).  Obviously my wife was quite upset (BUT STILL TIPPED).  The waitress was a young blonde female and is in the wrong line of work!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2PhZSJPK1-pxwwrAgkkaA"
  },
  "7kKf0c8QmpmFKdJCcGCVzQ": {
    "date": "11/6/2017",
    "text": "This diner was an unexpected surprise.   I went to get my car service early on a Saturday and wanted to grab some breakfast so of course I did a quick search and saw this place had some pretty good reviews. We arrived around 9:30AM and waited to be seated about 5 minutes before our table was ready.  The restaurant was already buzzing with the Saturday morning rush.   The waitress came to our table and took our drink orders. She came back twice and there was so many options on the menu I couldn't make up my mind. I finally settled on the Western Omelet, Cheese Grits, and a Biscuit. We waited for about 25 minutes for our food which I thought was a little long for breakfast but they were really busy and I had some time to burn so I wasn't that concerned. The waitress checked in with us and told us it would be ready soon.   When the omelet arrived, I thought I had too much in my omelet and wouldn't like it but man was I wrong. The omelet was delicious with nice chunks of ham. The cheese grits had cheese on the top and they were good...but then I realize there was also cheese on the bottom and by stirring them up a bit they were even better. Lastly, take my advice.... get the biscuit. The biscuit was freshly made and falling apart. I have seriously been craving this buttery, soft yet crunchy biscuit since I first taste it. I placed jelly on the biscuit and it was even better. I honestly could have just ordered a biscuit and been happy.   As we were leaving there were a lot more people waiting so I could tell we got there at a good time. If you are going on a Saturday morning perhaps get there before 10AM. I know they are building another location a little closer to me so I definitely will be visiting again.....for the biscuits of course.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Tqa02_ei_4mbmSSkBs8MUw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Western Omelet, Cheese Grits, Biscuit",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Tqa02_ei_4mbmSSkBs8MUw/o.jpg"
      },
      {
        "img_id": "jOAKHST85BYLeml2LNa2vQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jOAKHST85BYLeml2LNa2vQ/o.jpg"
      },
      {
        "img_id": "FMUTvQ_UE4YCeAH5lfSEcQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FMUTvQ_UE4YCeAH5lfSEcQ/o.jpg"
      }
    ],
    "user_id": "2h553AAk5GT_DsWBQQLL_Q"
  },
  "qTNvzFEmBhxedWTa4zlwPg": {
    "date": "4/7/2018",
    "text": "Been here 3 times so far and this is my new goto spot on the weekends for breakfast/brunch.  The staff is friendly and accommodating, this is always appreciated.  We almost tried eating at a new place in the area this afternoon (where Fuddruckers used to be) until I read all the reviews regarding their service.  Makes me appreciate a place that has friendly people who have their system down pat.  On to the food.  I've never had a bad meal here.  The Eggs Benedict is awesome and is something I could eat at any time of day.  Today I had the biscuits and gravy with 2 poached eggs on the side (which I pop on top of the biscuits).  It was very good.  The gravy is light and creamy, less salt that I prefer but I imagine its healthier than the gravy I make (with bacon grease and butter).  I like this restaurant because they have a good down-home dishes they do really well and many of their dishes have a higher end feel to them due to attention to detail and quality ingredients with a slight twist (good quality baguette/texas toast, fresh cut avocado, fried jalapeno slices, strawberry butter, homemade soups, etc).  They get all the little details right and that makes the food good.  They do all that right with the food yet the diner feel is cozy and casual and not some high-priced stuffy eclectic hipster joint.  We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TlX5pM_u-v57KErnTTNMAQ"
  },
  "WADOfa9dKCHDFsD5zrCxOw": {
    "date": "3/25/2018",
    "text": "GREAT NEWS!!! Applauds!!!   This Metro location is fantastic ...blows the Pineville location away, NO comparison whatsoever. This location has a solid management team, the host was extremely helpful & friendly. Our server was accommodating, personable and super sweet!   My husband ordered the pot pie ...it was so DRY you could have used it as spackle. The server quickly took it back to the mgr. they jumped into action and had it remade. They thanked us for bringing it to their attention... she had the kitchen tweak the process and the second time around it was very tasty. I would recommend ordering it with extra sauce, live & learn. It was delicious!  The mgr. came by our table to inquire if it was moist ...we told her it was \"perfect.\" She admitted it was super dry, nothing like straight forward candor & handling things proactively. #TRUEprofessional    My broccoli cheddar soup was equally as tasty!   Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zza-gQ2jzjAAJkalUHuO6Q"
  },
  "M5zxhr10mXq5nhdua3r3ew": {
    "date": "10/24/2017",
    "text": "I ordered Belgian waffles and the chicken and biscuit sandwich. Both were good. I wanted to try these all but yes it was a bit filling and I didn't finish. I asked for the waffle to be a little crispy because I like a little crunch in it and they made it perfect! Served with butter and syrup. You can ask for a side of strawberry butter to put on top if you wanna try. If you do, it's a very sweet combo with the syrup FYI...the chicken biscuit sandwich was good too. I asked for a side of their spicy sauce instead of them pouring it over the chicken cuz I was afraid the biscuit would get soggy. Overall it was all good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r7bFFiQF58E_R0EhmlKMDA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Belgian waffle &amp;amp; chicken biscuit sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/r7bFFiQF58E_R0EhmlKMDA/o.jpg"
      }
    ],
    "user_id": "XUj77xRuCaVvT7hrYKb8tQ"
  },
  "v7anEy-0MCKJ7NHUtIS3OQ": {
    "date": "5/18/2018",
    "text": "I have  a lot of food allergies. If you have food allergies, don't go there! I was yelled the first time (literally) in front of 20 customers or so and sick from the food the second time. I've never experienced such disrespect and lack of compassion at a restaurant until I ate here.  Response to owner: We did call and spoke to Julie. She said she was aware of what happened and was very apologetic to my husband. She invited us back in but we did not want to return after that incident. The cook not only yelled at me, he yelled at your hostess in front of everyone waiting to be seated. I would speak to them as well.  We did return another time, only to get my order wrong and get sick after eating at your restaurant...not to mention the two hour wait to get our food. Your staff needs serious training in the area of food allergies and customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Sx9LuS28WC7pjF2nH0zfg"
  },
  "JMzVm0A651jw3w5zK_Rxrg": {
    "date": "10/17/2017",
    "text": "So glad that Metro Diner opened up this second location in Charlotte.  It's much closer to us than the one in Pineville and occupies a space that I've always liked.    We've visited this Metro Diner several times for breakfast so far since they've opened (and brought several out-of-town guests here as well).  Obviously we've loved our breakfasts since we keep coming back.  It's nice to have an alternative to Stack's Kitchen in Matthews, which we also love, but is usually difficult to get a table for breakfast on weekends.    We've even eaten dinner at Metro Diner once on our most recent visit.  During this visit, we came by on a Saturday evening around 7:30 PM.  There was a line, so we decided to do some shopping beforehand and come back.  We got back around 8:30 and there was no line.  However, we noticed on the door that they closed at 9:00 PM.  Yikes!  Being a diner, I just assumed they were open later, like maybe 11 or 12.  We still went in because the place was super crowded, so it's not like we were the only ones there.  (Hint: maybe you should stay open later?)  We were quickly seated and greeted by our server Taylor.  She was super friendly and speedy.   My partner ordered the Western omelet (yes, breakfast (and even lunch and dinner) is served during all hours).  It was filled (and overflowing) with ingredients.  Since I've had their breakfast items several times, I wanted to try something different.  I opted for the Bold City Burger -- Provel cheese, caramelized onions, bacon, sausage (yes, both!), fried jalapenos, and garlic aioli.  It tastes as good as it sounds.  It was truly amazing -- juicy and flavorful.  I'd definitely order it again.  There are a lot of side options to pick from; I went with the sauteed veggies, which happened to be yellow squash and zucchini that evening.  They were a little charred, which is my favorite.  Another good choice.  I could have eaten even more of them.   Since opening, Metro Diner has been a great, new breakfast option for us.  Now they've become a dinner option as well.  Good food at a reasonable price.  Now if they can only stay open a bit longer...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "UIA80CNA-pQZLnI8J4fCqw": {
    "date": "5/17/2018",
    "text": "Ordered the meats lovers omelette. Decent and the hash browns were good. Food for a non busy time took awhile. Server was nice and overall experience was good. Fiance did not like her crab cake benedict tho, too fragrant for her liking, pineville location wins for me",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KCKbA9TGW0NqcCSQJ8ZEKg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Meats lovers...sorry messed up the hash browns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KCKbA9TGW0NqcCSQJ8ZEKg/o.jpg"
      }
    ],
    "user_id": "JgFqF4i6r-MvNWHHccKYbQ"
  },
  "wN9fYdPOA6SLfrq81ZJnDA": {
    "date": "3/10/2018",
    "text": "Came here for lunch since it's by my job and I couldn't stop thinking about coming back after a great Yelp Event here. Lunch was crazy packed so we just ordered to go. I tried a lot of food which was all great so decided to go for something new. I ordered the 3 cheese grilled cheese with a cup of tomato bisque soup, perfect for the cold weather. My coworker ordered the Cajun chicken pasta. My sandwich came with a tomato on it (which I dislike reg raw tomatoes) but it was easy to take off so I didn't complain. The hostess did see my face and me take it off and offered to just have them make me a new one because it's so fast to make but I assisted I was fine but thanked her. That was very nice and observant of her. The soup was a little too thick for my liking but the favor was really good. The pasta was hot and the cajun seasoning was just right.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "O3cItff0mKAfXtl5VmbW2w"
  },
  "JJ37QSmj14cf4uCsOO5gAA": {
    "date": "10/26/2018",
    "text": "I love their homemade corned beef hash.  It's as good as it gets.  Make sure you get hash browns instead of home fries.  They cook their home fries in the fryer and not on the grill the way I like them.  Great diner food in Matthews. Can't go wrong with this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fl8DPymDhND4ktOrmfnfEQ"
  },
  "OzTtbbve4jtxQPOuC6Gmww": {
    "date": "11/27/2018",
    "text": "The people are nice and the food was great! We got served in a timely manor with no long wait",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DJoURRGd0B5qvGlBG2H8w"
  },
  "ymkmDk8Nw_AFKCtkYwvDCw": {
    "date": "3/31/2018",
    "text": "Hubby and I tried it on a cold wet Sunday morning. This place was jumping the wait was suppose to be 45 mins I think we waited for 15 max. (Yay) we were seated and had an amazing waitress who explained the specials and even helped me decide. The food came out amazing and the cheese grits I will have again. Worth a visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ZlBgVsg4Jw_S8LrjtlQ2w"
  },
  "VzubPtIjFiyU6XlYIi9p3g": {
    "date": "8/13/2017",
    "text": "Must place on bucket list lol.  Basic diner with awesome food.  The waffles n chicken are some of the best had and the strawberry  butter just makes it next level!!!!! The scratch made corned beef hash with two eggs cooked perfectly medium and the fluffy moist biscuit with yup more strawberry  butter was just slap yo momma good!   I live at least 30 mins away but plan on another visit!   Peach  tea was too sweet for my taste but I don't like overly sweet drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sM9sEKD3P8TP2bWG5qjOwQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Chicken  n waffles.  More yummage!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sM9sEKD3P8TP2bWG5qjOwQ/o.jpg"
      },
      {
        "img_id": "j45mOeqLc-tW5Z_9O_bpxw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Scratch made corned beef hash! Yummage on a plate",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j45mOeqLc-tW5Z_9O_bpxw/o.jpg"
      }
    ],
    "user_id": "5_vvuAY9sOVbJtBon8ce2A"
  },
  "1RjhKdEuDAiBIGea5A3aPg": {
    "date": "3/24/2019",
    "text": "Matt was my waiter. Very nice guy! Mimosa was strong n tasty!! Nice atmoshpere, food was great!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZjMlZzX8yrqUjX-bvRPrw"
  },
  "NftZfWvsDOdvzwENxcEUeg": {
    "date": "12/27/2018",
    "text": "We ate brunch here. When we walked in, I was reminded of the diners in Pennsylvania. It was a busy  Sunday morning and we waited about twenty minutes to be seated. The coffee was readily available for those waiting-reminiscent of my hometown greasy spoons. The food was worth the wait. The food was excellent. One of my sons, who is vegan, really loved being able to modify the vegetarian wrap. I enjoyed the breakfast croissant French toast. Pay the extra for the house strawberry butter. Service was fantastic. We enjoyed it so much, we planned a brunch outing here with my women's group.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jj88n2OosOOfwMCKNImPYQ"
  },
  "ood0_E9qtXja94ajqztTrw": {
    "date": "6/14/2017",
    "text": "A niche filled for the Matthews area.  Comfort food done reasonably well and not Dilworth priced. All the Classic Breakfast, Lunch & Dinner fare you'd expect.  Decent service and good presentation",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tmVP8lkRswI-h9--lhWThA"
  },
  "cB2cyFKdSMOODseh2fCIPA": {
    "date": "7/31/2017",
    "text": "This was their Apple dessert!! It was huge!!! And yummy!!! Our lunch group tried this establishment out on Tuesday, I'm pretty sure everyone liked what they ordered. There were some pot pies, ooooooh the chicken in them were such big pieces and tendeeeeerrrr!! The meatloaf and veggies were WONDERFUL !!!  The grilled cheese was a favorite. The service was very exceptional, great attention to the drinks and really genuinely nice ladies!! See ya soon!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "C4zMj8zI94zqRAdITjI5-w",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. HUUUGE!!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/C4zMj8zI94zqRAdITjI5-w/o.jpg"
      }
    ],
    "user_id": "RvXBv0iyvFu9jSz4M2mnyw"
  },
  "qgXi0-lKfNbQZSTnGOZCPw": {
    "date": "6/6/2017",
    "text": "Came to opening day today with my dad. He had the Philly cheese sandwich and I had their fish sandwich. We also ordered one tea and a regular coffee. The sandwiches are really quite large and will satisfy even the biggest eaters. The fish sandwich was even larger than the Philly and I picked the mac and cheese as the side. The fish was perfectly cooked with lettuce, tomatoes and tartar sauce. The tartar sauce is a sweeter tartar sauce so keep that in mind but they do put the sauce on the side. The taste was amazing...no complaints!. The service was also excellent and we never asked for anything. When we left and walking to the car, I dropped my coffee. A waiter saw this happen and brought me a coffee outside! Great service! The cost isn't the cheapest but worth it. We paid $27.00 plus tip for the above.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0yEYglmt3jRQMuRcWQI4YQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Great fish sandwich!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0yEYglmt3jRQMuRcWQI4YQ/o.jpg"
      },
      {
        "img_id": "PeyEnuhyF6vQgQcL_8l1IQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PeyEnuhyF6vQgQcL_8l1IQ/o.jpg"
      },
      {
        "img_id": "E3r_IsQ6Qnwy5ZqsaakBWg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Regular coffee is good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/E3r_IsQ6Qnwy5ZqsaakBWg/o.jpg"
      }
    ],
    "user_id": "r3E0r1_pX4kQIZxQC9XLwQ"
  },
  "HxWDdosB5E6cuEHqb0y94Q": {
    "date": "7/2/2017",
    "text": "So happy the Metro Diner opened in Mathews which was badly needing something like this.  Good old home cooked tasting meals at reasonable prices. You can get breakfast, lunch or dinner anytime of the day.   My wife had the regular chicken pot pie which was still pretty big and there is a jumbo if you're really hungry.  It was fantastic.  Loaded with fillings and chicken if you like chicken pot pie it's a must try.   I had the pot roast which was also really good.  Comes with mashed potatoes and some vegetables. The pot roast was so tender I could cut it with a fork.   Pretty good service although our server kinda disappeared for a bit but no big deal. Everything that was coming from the kitchen looked really good and I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "v_yafSwbsY8szKCofEy2LQ": {
    "date": "6/10/2017",
    "text": "Everybody still in training mode it must be.   Extremely expensive eggs. Close to 8 bucks for 2 eggs. They told me the hash browns are shredded potatoes the picture on the menu shows potatoes cut up. This is going to be a play by play review.   We'll see pictures wife's pot pie veggies not all the way cooked thru , my links were supposed to be well done they came almost uncooked.  I will go no further except to say they compensated my meal.   So they may be worth a second try in the future now that I know what to order.  Avery was very good a great server.   My wife and I said that my granddaughters food was the best.   She had gravy and biscuits.   They do have military discount don't care how much but proud to have one. Sorry picture of wife's was not in there.   All the people were great and friendly. Might try a diner someday.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "JINVIC46qzmCI7QdDJCvYg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JINVIC46qzmCI7QdDJCvYg/o.jpg"
      }
    ],
    "user_id": "80ddx3lGxwrEu8hJYV0AIg"
  },
  "z_k7ETXn1P8Drnm3cwAj_A": {
    "date": "5/25/2018",
    "text": "Food was great and survive was just as good.  They have something for everyone.  I highly recommend this place to anyone who eats.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yu_gn-rHOp0YjpKjl9HkgA"
  },
  "GjaMKjYEcWSPhsMO1kdvIA": {
    "date": "6/25/2017",
    "text": "They were quite busy for lunch on a Sunday. While sitting and waiting, I was able to observe the great team work and good service they provided, unlike the sister restaurant in Pineville.   Lunch was better than our breakfast experience in Pineville location.  My husband had the avocado wrap with grilled chicken and onion rings. I had the burger between two grilled cheese sandwich with their chips. We enjoyed our meals. It's your typical diner food, with a good selection and friendly service. Also a beverage center you can help yourself while waiting.  You can sit at the counter and watch the kitchen staffs and first come first serve.   Recommend and will come back for good diner food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsqrqT_Rg_H4kNoGjZna4w"
  },
  "5EXsEVsFWr8il13FRAxczg": {
    "date": "5/22/2018",
    "text": "We eat breakfast here every Sunday. The food is great, prices are a little high and most of the wait staff are very friendly. One time our order did not have all of its ingredients so the manager comped us and corrected the order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3juA-0j4RUzAVe__9k6Pg"
  },
  "kFEB-l99NOqls7HpuQfaag": {
    "date": "11/20/2017",
    "text": "I'm not sure how to express my gratitude, though will give it a try.  On the upswing from a bout of Flu that has kept me out of work for days. Finally out of the house to run delayed errands & went to some local \"Southern\" restaurants in hopes of chicken noodle soup....none to be found.  Stopped @ Metro on way home. Again excellence & expectations surpassed. Got the chicken soup, & yes...it did feed my soul..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6IGAHju0q450GfQMRGBuqw"
  },
  "Pp4MHRDu-uxQkz3KzoUn_w": {
    "date": "5/20/2018",
    "text": "Good food but not so great service. Have tried this place 3-4 times, and almost every time I've been here for breakfast I had to wait forever to get just one refill on coffee! They also make you feel that you can't linger a little bit--they need that table for the next customer. And it costs almost twice as much as breakfast at Mikkis where they have great service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9qDyMtxU15ESTKMVEDLtg"
  },
  "SHbNSmAeMQca942F9h0jUQ": {
    "date": "10/8/2017",
    "text": "Great place to take the family and enjoy a great meal. I really enjoined the Chicken and Waffles. You will receive a whole half chicken and a great Belgian waffle. Make sure you try the Strawberry butter. The breakfast selections are great. The lunch menu is large. Enjoy the food!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Eg1pIjvEAHlhtaL5j6sBDA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Eg1pIjvEAHlhtaL5j6sBDA/o.jpg"
      },
      {
        "img_id": "slHlSeGZmWd09_hAMeBBkw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/slHlSeGZmWd09_hAMeBBkw/o.jpg"
      },
      {
        "img_id": "-Z3UrvTfEBvdvXKDW0hWVA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Z3UrvTfEBvdvXKDW0hWVA/o.jpg"
      }
    ],
    "user_id": "6muuNUH2PZZk1lpTXkRHyQ"
  },
  "vrEjBRl4P4rbn637Aue4Qg": {
    "date": "6/9/2017",
    "text": "Amazing service, amazing food. Will defiantly be back! That strawberry butter whip on the waffles is soooo good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iQxcI-DpQkSA8Z0X3oRZFA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iQxcI-DpQkSA8Z0X3oRZFA/o.jpg"
      },
      {
        "img_id": "8dWxuA0MlcSsTl_XLKkKgg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8dWxuA0MlcSsTl_XLKkKgg/o.jpg"
      }
    ],
    "user_id": "b6ris09qm-WlSkg68pWthQ"
  },
  "GKuRZSLbv-n5mRizdMN0tQ": {
    "date": "4/5/2018",
    "text": "Their parking lot is small and fills up quick but it's soo worth the wait! On a busy Friday, we came in for brunch and were a little overwhelmed by the large menu full of delicious options! Yolanda, our server, helped us and gave us great service. She did not rush us at all and was always around to ask if we needed anything despite the fact that the place was full. She was a phenomenal server and I will make it a point to be back just because she made such a great impression!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0odt9w_vzEyez6H832rvA"
  },
  "zRAfnFr7-5uwk2hx0WD8wA": {
    "date": "2/16/2018",
    "text": "This place is a win in every way.  I've only been for breakfast but my family has enjoyed many lunches there also.  The atmosphere is so welcoming and each booth and table have a sense of intimacy where the conversations stay within the company you came with.  When you think of diner, you think of basic but this diner is anything but.  The portions are large and always presented and tasted that the chef took pride in making it.  The staff is ALWAYS friendly and remembers you.  Winner winner nutty french toast winner!!  ;)  GO and ENJOY!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9euBoJoMJcOc609IH1nOAg"
  },
  "qco1ScYu-KFcx9bykch2QA": {
    "date": "4/2/2018",
    "text": "Boy oh boy this place is life. This is a go to restaurant. I had the chicken and waffles. There was flavor all through the chicken and waffle. They also have a strawberry cream that looked like butter but it was mmmm good. My son had the bold city burger and he loved it it was a sausage and hamburger patty burger with jalapenos mushrooms chipotle and lettuce on it. He said it was delicious. There fries taste like heaven (says my son). Our waitress provided great service Once you come here you will definitely come back for more!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFUdaM_5H9Hdn7wpSOhfxg"
  },
  "pQtvW4v1ZHFFg3WgaXLt2A": {
    "date": "7/2/2017",
    "text": "This is one of the friendliest and flavorful restaurants I have been to in the area. The staff is wonderful and always smiling and knowledgeable about the menu.   Loved this place so much had to come back for breakfast and absolutely was happy I did. While you would think that blueberry cheesecake stuffed waffles would be sweet these were wonderful and they make their compote in house which just shows the love and care they have for their food.   The biscuits and gravy were also fantastic plenty of sausage in the sawmill gravy and full of flavor. I leave with a smile on my face and a happy belly every time.   Thank you for the superb food and service. I will be back time and time again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "utKS9x3ZEd6tWgwsaj8XDw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/utKS9x3ZEd6tWgwsaj8XDw/o.jpg"
      },
      {
        "img_id": "vEGYU_HL_qXN75uIdewhQA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vEGYU_HL_qXN75uIdewhQA/o.jpg"
      }
    ],
    "user_id": "RM04WnJcmQqhLITCS_LQ0Q"
  },
  "CmovAGFXY-2l8-z7TvtC7w": {
    "date": "7/28/2017",
    "text": "Delicious food paired with efficient service this place is a win-win in my book! The menu offers a variety of options and specials every day. The restaurant is cozy and all staff was friendly and helpful. The veggie omelet (egg whites), english muffin and  home fries were great- definitely recommend! Love that they include asparagus in their veggie omelet!!! The others in my party enjoyed the spinach salad and the grilled cheese with tomato and bacon. Good portions, fresh food! Will definitely be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4bTwqx8GZ0Txnd419uTTlw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Veggie omelet, home fries and English muffin!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4bTwqx8GZ0Txnd419uTTlw/o.jpg"
      }
    ],
    "user_id": "lad-a99UPEA2EoABtdutjA"
  },
  "D3pvpD-KbcyAQmoT_l3V7Q": {
    "date": "7/15/2017",
    "text": "Went unplanned for brunch with my brother and mother. We were in the are and googled places near by. It was quite busy, about a 15 min wait to be seated. Service was great, friendly staff hostess, and waitress.  Food was plentiful. Huge portion, everything was served to perfection. No complaints. I had the two eggs breakfast with bacon and grits. My mother had the chicken and waffles (she loved) and had plenty for a Togo box. My brother had the Swiss mushroom burger.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xIpR2nYYbZG-haANrxvYGw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Two eggs bacon and grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xIpR2nYYbZG-haANrxvYGw/o.jpg"
      },
      {
        "img_id": "F_TokgypGjdKBj9iMKO_9Q",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Chicken and waffles with the sweet and spicy sauce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F_TokgypGjdKBj9iMKO_9Q/o.jpg"
      },
      {
        "img_id": "G9WFmAfiwH35W_K6WnNGUg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/G9WFmAfiwH35W_K6WnNGUg/o.jpg"
      }
    ],
    "user_id": "KtpmSnpGkfLuocvhrgv02w"
  },
  "DNv4628AFPytgEnnY0I_Dg": {
    "date": "2/12/2018",
    "text": "This place is great. It's like home cooking done to perfection. The strawberry butter on the waffles is to die for and the staff is ultra nice and friendly. Will be going back to try more things.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8kC3rwqvHFozQBEh17uRw"
  },
  "AOWY25xw2graYQXPEc5pbQ": {
    "date": "8/12/2017",
    "text": "Stopped by Saturday morning for breakfast and decided to make my order to go due to the 25-30 min wait...not a problem.  Ordered the Southern Benedict with cheese grits at the recommendation of the staff and was very disappointed with the quality of this dish. Not to mention my food sat for 15-20 min before it it was given to me after I asked of the progress. I asked the manager to check the quality of the food before I left and he assured me it was fine.  As expected, my portions were incredibly small for Metro standards, there was almost no gravy which was one of selling aspects of the Southern Benedict, my poached eggs over done and the cheese grits had clumped due to the temperature.  I have been to other locations and the service and quality at those locations were fantastic, this was very disappointing. On a bright note, the manager did give me a voucher for my next breakfast so I'll give this location one more try.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1jhT7zjGOqPDAPGcGjpXUQ"
  },
  "XNbqQH9Mly9W8C3_4h_isA": {
    "date": "2/16/2019",
    "text": "Just want to share this is a fantastic restaurant and the team knows how to get the job done! Excellent service and great food.   The hostess Mave? our waitress Sam, and her backup Skyler made our Saturday breakfast a great experience without a hitch! Line was out the door and well worth the wait, but we grabbed a seat at the counter. Kitchen was cranking and the team was doing a great job getting hot food out fast! We had the Western Omelet and the Belgian waffles.  Can't wait to come back and try more things on the menu! Awesome job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jJB-i2bLnjidauP5Z3Q_bw"
  },
  "HgHzHk2ImlUTHl6Bo4ewmg": {
    "date": "1/2/2019",
    "text": "Great place to eat. They were short a waitress Monday night,but country style steak and mashed potatoes was fantastic. Went back for breakfast on Tuesday. They were very busy but service was good and the chicken and waffles was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zTJ6uC2Q_gOuUXCaBc18XQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Strawberry butter was tasty",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zTJ6uC2Q_gOuUXCaBc18XQ/o.jpg"
      },
      {
        "img_id": "cz-hob8Bb80qjNgLAeUQow",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cz-hob8Bb80qjNgLAeUQow/o.jpg"
      }
    ],
    "user_id": "G2m30V_09VmEFZQelv9uFw"
  },
  "2oHXbOli6nFJQFe_NFFimQ": {
    "date": "3/30/2018",
    "text": "Excellent fruity waffle with the best turkey sausage I've ever tasted!! There's always a crowd at the Metro Diner, and this was no exception.  The place is buzzing, the waitstaff are friendly and the atmosphere is casual and relaxing. Recommended.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EHq8HvrDG-VaJ8rjyjVUYQ"
  },
  "ZwWirSvFsAoBCCjY8_ykrQ": {
    "date": "4/18/2019",
    "text": "I just moved to North Carolina from New York and I was look for a good place to go the brunch with my kids. Metro diner is great! The waitress was the sweetest and the food was so good! We really enjoyed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHf2H1YaLnDAivrRqeXAGw"
  },
  "_MM_2TLomQyYE1qQaDbpPw": {
    "date": "10/7/2018",
    "text": "Delicious diner food! I enjoyed the Monte cristo sandwich for dinner, which is like a double portion. They fry the sandwich & it's a double and it's yummy with raspberry jam. They also give you a ton of French fries. Their menu is full of good entrees, meatloaf and shrimp and grits are tasty too. Good service and even some mixed drinks for brunch like mimosas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "6MKWj5Ud1QlR40lTE6OHbQ": {
    "date": "8/18/2017",
    "text": "This place was surprisingly busy for a Monday afternoon!  I came for lunch and it was packed.  This is not my type of restaurant, but I came for mom because she had been here before and enjoyed it.  They have beer and wine. And also a specialty drink that maybe changes daily or weekly? Anyway, this day it was peach iced tea. They had two daily soups, I got the broccoli and cheese and it was delicious.   I ordered the avocado wrap and it was not my favorite.  I didn't see any avocado at all.  It had way too much spinach and it also had fried jalapenos, which were good, but way too much!!! I think they could lighten the spinach, add more fresh avocado, and only a few jalapenos and it'd be perfect!!!   A little pricey, but not too bad. I may try this place again, but only if mom wants to!! She enjoyed her hamburger steak at least!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "hjzALFkHHFxMjTVc8JhixQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hjzALFkHHFxMjTVc8JhixQ/o.jpg"
      },
      {
        "img_id": "FqimcyejPm6eCH3SVxHJkQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Broccoli cheddar soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FqimcyejPm6eCH3SVxHJkQ/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "vNwND4K6Chdrja65pF8W3w": {
    "date": "3/12/2019",
    "text": "Large menu. Sustenance is great, neighborly hold up staff. They readily oblige extensive gatherings. 4 stars since burger meat was cold and nourishment isn't new (or doesn't appear as though it's newly made). This is as yet a spot that merits a visit or two.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "imSrve3okPHodAWkjcTU2Q"
  },
  "T5vHMJbq3vlbvGzOoM1qJg": {
    "date": "2/9/2018",
    "text": "This was my second visit, the first being a yelp elite event, and my wife's first visit. I remembered how awesome the food was during my last time here and I was very eager to share this with my wife.   It was weird that all day I had a craving for chicken and waffles, so when she let me know she wanted a big, juicy burger, I knew where to go.   The service that night was awesome. Our waitress was very attentive, helpful, and kind. She was definitely top notch!   The chicken and waffles were cooked to perfection. They were actually better than I remembered them. Let me tell you, few things are better than getting exactly what you want. That meal hit the spot.  My wife loved her burger, as well. She had enough left over for lunch the next day. She said she was impressed with Metro Diner and looks forward to coming back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Y8AnzqYWw8A2XQ36WHjtQw"
  },
  "rkVbXOOXVaBsG7N7J3RaIQ": {
    "date": "3/24/2018",
    "text": "Amazing! This is the second location that I have been to in Charlotte and the food was consistent and delicious. I ordered the croissant French toast and it was so buttery and soft. Not too sweet and not too bitter...it was just right. The hostess stand needs a bit of work but other then that I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VGVKYj5FrY5GQjuNuAa8Fw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VGVKYj5FrY5GQjuNuAa8Fw/o.jpg"
      }
    ],
    "user_id": "j6c0PKCAHiR6tI2EqZByow"
  },
  "XzGf4WaGWCmt_30h8GNWhg": {
    "date": "3/16/2019",
    "text": "The food is good and the staff is excellent! I love meeting my friends here for breakfast when we have time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-mLOLtm15hl5IowV__OY3g"
  },
  "8YokwF8yEBsVcHLzbnAJwQ": {
    "date": "1/27/2018",
    "text": "I caught the metro! 2nd time at metro 1st time at this location and just like the huntersville location! Great! Food. This was my 1st time getting the fried chicken and waffles. More than enough chicken, the waffles were crispy and the strawberry butter was good! This is becoming a sure go too in charlotte!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "98D4Nr5H6WcbYhAyG8GsIw"
  },
  "hVCjfk5uCNj4oQ3rup7hJg": {
    "date": "12/11/2018",
    "text": "This is one of the best places to get breakfast,  lunch or dinner in Mathews.  You can tell the staff truly cares about the quality of the food and customer service.  My family and I have been here several times during the busy holiday season,  and every time has been fantastic.  Or current favorites are the classic eggs benedict (with added spinach) and the Monte Cristo sandwich, but truly everything we've tried on the menu was delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bw2pSDSS7Pt6ESB-X1KA7w",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Beef tips with zucchini and squash (front) Burger and onion rings (back)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bw2pSDSS7Pt6ESB-X1KA7w/o.jpg"
      },
      {
        "img_id": "CaAWqnWdjjU_8CTxgTjXzQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Monte Cristo sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CaAWqnWdjjU_8CTxgTjXzQ/o.jpg"
      },
      {
        "img_id": "XuX3GV9U8zdOSBWECJ8GSA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XuX3GV9U8zdOSBWECJ8GSA/o.jpg"
      }
    ],
    "user_id": "Q1V9bDJQUCT23dr5W3snAA"
  },
  "3etP4RCRksCL-ZN35N25Uw": {
    "date": "7/20/2017",
    "text": "It didn't start off well. Stood there at the stand waiting to be acknowledged let alone seated. About 3-4 minutes and it sure seemed longer. As I was turning to leave a cook sad hi and if I've been helped.  I ordered the meatloaf plates I was in the mood for some home cooking. I didn't leave hungry. Two large pieces of meatloaf, mash potatoes, and grilled squash. Gravy on top. Meatloaf was a little to soft, mushy, for my taste. My mom made the best.  Will I go back, for sure. Hopefully better service. But the food is good and filling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7s0lLsEEorPjThEuzf1zEA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Meatloaf Plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7s0lLsEEorPjThEuzf1zEA/o.jpg"
      }
    ],
    "user_id": "M0cI78odeq_GKqLzk8sIrw"
  },
  "wNGAEVBuP9FlbwcscWV7FA": {
    "date": "3/26/2019",
    "text": "Omg this place is beyond amazing the food is super fresh and cooked to perfection. I had one of the best meals ever. Coming back tomorrow before we leave NC....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L5TZNazp-J7nFBjuKr9Lag"
  },
  "7w9mHCJNNETE4d44gWh0dA": {
    "date": "8/11/2018",
    "text": "How do you spell perfect? I now spell it METRO! And perfect is what you get when you visit the newly established Metro Diner.   Their selection is great from their daily specials, to their eggs hollandaise, to their delicious lunch platters-there's a plate to satisfy every palette! So if you looking for a great restaurant with an amazing staff and down home cooking that hits the spot, it's the Matthew's Metro Diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6a3NkvCCcs3GoQrmJqb7jQ"
  },
  "bQmevrHR2LeM_-bOwKzTXg": {
    "date": "7/16/2018",
    "text": "I went here on a whim a few days ago and it was fantastic there was a bit of a line but the line moved quickly, we waited for just about 10 mins if that. The staff was very nice and attentive. The food was delicious as well I stayed in the basic side as I normally do to try out new places but my boyfriend took on the Holy Davoli sandwich and WOW such a big sandwich with a healthy side of crispy onion rings! We laughed as he tried to take hi first bite the sandwich although big was very delicious! We will definitely be back in the near future!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7fOiXmeWz6x30HXOYmFuRA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. HUGE Holy Davoli sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7fOiXmeWz6x30HXOYmFuRA/o.jpg"
      }
    ],
    "user_id": "n0HMmummGVb-dYOHZIjnIA"
  },
  "kECucV6iZp40KsF84jcTcw": {
    "date": "8/6/2017",
    "text": "This place is awesome!!My friend and I went here today for brunch/lunch and was very pleased overall.  Food:A wide variety of choices and more than enough portion sizes.We ordered the Shrimp & Grits which was really good.We also ordered a side of hashbrowns and cornbeef hash.The cornbeef was really unique to me.It consisted of shaved/shredded cornbeef and potatoes.  Service:From the host all the way to the cook behind the counter,the customer service is superb.By name,I interacted with Sherry and Julie and they were both on top of it.What stood out to me the most was that despite how busy the cooks were ALL of them seemed to enjoy their roles.They interacted well together,communicated effectively,and were all patient with one another.I kept telling myself there was no way I could do what they were doing without messing up an order somewhere along the line but they presented to be a cohesive team.  Prices:Appropriately priced for portions and quality of food  Setting:Not that big but big enough for a diner;there is outside seating  There are so many things I want to try on the menu so I'll be back again soon.Thank you Metro Diner for being a great addition to the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gXv4AVuqLFy8onzwY28kaA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Shrimp &amp;amp; Grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gXv4AVuqLFy8onzwY28kaA/o.jpg"
      },
      {
        "img_id": "uazsoNILoBL5-oby63Fv2g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Cornbeef hash",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uazsoNILoBL5-oby63Fv2g/o.jpg"
      },
      {
        "img_id": "WEQbSb7zMhIfr8QmdAZvyg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Hashbrowns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WEQbSb7zMhIfr8QmdAZvyg/o.jpg"
      }
    ],
    "user_id": "sgqj8Nvg43iv-l8-MlC01A"
  },
  "qlxNNBCbbRlFFbNcKWArwQ": {
    "date": "5/13/2018",
    "text": "Overall Under-whelming  On the positive side, the place has a welcoming exterior with a small area for patio dining.   It is easy to find in Matthews Festival, close to the Home Depot and Texas Roadhouse.   The interior decor is pretty standard, nothing stood out one way or the other.  They serve breakfast, lunch, and dinner all day! Any place that serves breakfast all day always gets one star just for that as I am a night person.   When we were seated I noticed the table was not clean and there was some food caked on.  I asked for the table to be wiped down again.  However, it was still sticky whenever I put my arms or hands on the table.   We were looking forward to the chicken and waffles with the strawberry butter.  My son ordered this to try and I ordered one of the egg breakfasts and upgraded my side to corn beef hash.  I also ordered the Cheesiest Grits.   The waitress was a bit of a character.  She did not seem super knowledgeable about the menu.    Plates and utensils were placed down.  The utensils were in a wax paper like wrapping - only a fork and knife (no spoon).  When my tea arrived, there was food caked on the plate with the teapot (see photo).  Also one of my two napkins had food on it (see photo).  I was very apprehensive to eat with concerns about cleanliness.    Now for the food.  The homemade corn beef hash is potatoes and meat (no onions, peppers etc.)  I like it like that but it was pretty tasteless.  The Cheesiest Grits were disappointing - plain, unflavored grits with a thin layer of melted cheese on top (see both photos). I was expecting cheese flavored grits with cheese inside as well.  I was never brought over a spoon with the grits and had to ask for one.  No butter was brought over with the toast.  The waffles were nice and fluffy, the strawberry butter is very subtle, in a good way as to not overpower the dish.  The waffles come with \"signature sweet and spicy sauce\".  Our jaws dropped when the waitress came over with a bowl, asked us to hand her the hot sauce on the table, and squeezed some hot sauce in the bowl and mixed in regular pancake syrup! (See photo) I think it would be better for them to do this in the back and leave the \"signature\" recipe to our imaginations.  The chicken was very bony, very salty.  I was expecting more of a honey flavoring for some reason that would go better with breakfast.  The crunchy coating was unremarkable.  The waitress at one point came to our table and motioned with her hands.  We had no idea what she was indicating but then she told us to hand her our plates.  She did not ask if we were done.  We were, but she should have confirmed.  We were asked several times if needed anything so she was attentive, just a bit unconventional.  The chicken & waffles were almost $16, definitely not worth the price tag.  I used the Ladies Room on my way out as I had to wash my hands from the sticky table.  The restroom could have used some cleaning, would grade it a B- as I have seen much worse.  To top it off, it was Mother's Day.  We came at a non-busy hour and two girls were at the host station with no other customers to attend.  They were giving out flowers to mothers and I wanted to see if they offered me one.  It was pretty obvious I was a mom, and although they DID thank us for coming and bid us a nice day, a flower was not offered.  I know I could have asked or taken one, but I wanted to see if they did so.   I am glad to see others had a more positive experience, but I felt the establishment was not clean, the food and service were neutral.  I went with higher expectations but unfortunately will not be dining here again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mFEZUGlYFCv_luLruLlvKA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. This is the exterior of the Metro Diner in Matthews",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mFEZUGlYFCv_luLruLlvKA/o.jpg"
      },
      {
        "img_id": "MyoHLjASQ2bo1ny0PZfeTQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Another picture of the cheesiest grits... You can see the cheese only consists of a small layer on top of plain grits",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MyoHLjASQ2bo1ny0PZfeTQ/o.jpg"
      },
      {
        "img_id": "Zylo4UqzcU2DvPYVL5XsIw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. The signature sweet &amp;amp; spicy sauce. They squeeze hot sauce into a small bowl &amp;amp; mix in pancake syrup. I&amp;#39;d rather this remained a mystery",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Zylo4UqzcU2DvPYVL5XsIw/o.jpg"
      }
    ],
    "user_id": "sbyBKdPhwZgAs4DwKAHCoA"
  },
  "Y1IDr7Z_9Rm7mG7TLaD7ew": {
    "date": "6/27/2019",
    "text": "Great food and service. I would recommend this establishment to anyone for a good meal for the whole family. My in-laws were very happy with everything and mentioned how clean of a diner it was.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xf7D4eIAq8by2MZD8Oy5-w"
  },
  "zO7OvzcuxpHH8vK4usBMRQ": {
    "date": "2/13/2019",
    "text": "LISTEN!!!!!!!....... LISTEN......!!!!!!!! LISTEN....!!!!..... This food!!!!! This Customer Service!!!!!! Sheesh I will DRIVE (And I won't do this for every restaurant) a whole day to for this. Thanks Ashley (for waiting on me and my client).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2rT5ibNxuLbKUlcCEaGFw"
  },
  "yqyVN40gUYOS7xEM3-32BQ": {
    "date": "2/27/2018",
    "text": "Went in with an open mind not knowing what to expect. New place and all. The food was good no complaints but nothing to write home about and a little pricey for what they offer. There are other restaurants that offer the same things that are cheaper very close by and taste the same if not better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KjuOOQq54GDTE6F0Es_XHw"
  },
  "wsq3fXP0V2JUCCkdhBePgg": {
    "date": "8/23/2017",
    "text": "I LOVE Metro Diner!  We have only lived in Matthews for a few months, but this place has been my favorite discovery so far.  I lived on the coast of North Carolina for many years, and never found a place that made crabcakes benedict there.  It is a breakfast to die for!  I have raved about it to my coastal friends and my new friends that I work with uptown.  I did once get hashbrowns instead of the grits that I ordered, but they were so good that I didn't send them back!  The servers are always friendly and I always leave full and happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVzMB7-2FKXCR8p1WMeMaQ"
  },
  "N6YCrl0Xpggkl1ui-Pg07g": {
    "date": "8/19/2017",
    "text": "Everything was just okay. We had the Philly cheesesteak and the meatloaf after a wait and a half to get seated. Maybe my expectations were too high but at the end of the day there was nothing special about the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0idBAuyMvzZzD1o66tNluQ"
  },
  "lY01-OUU0Z5OuNoOTn3EZA": {
    "date": "8/8/2017",
    "text": "The food is great.its one of those dinners where you just won't to keep going back to because you have your on favorite dish.thanks metro dinner for great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJshnvDtAoh7PNAUraCOSg"
  },
  "Hk-b5QmpxoqQGysIBREYtQ": {
    "date": "2/17/2018",
    "text": "They do a pretty good job here. The wait staff seems well trained and the food comes in pretty large portion size and is usually pretty fresh. There tends to frequently be a wait...which I suppose speaks to their quality.  The negatives: significantly over priced. Also every time I have ever been in Metro there has been a smell of something burning that hits you as you walk through the door. It is also pretty loud when it is crowded and they are not super fast. I would recommend though, as overall I think they do a good job",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0apDfgUq_MyAllXng_RCw"
  },
  "DUiokqLjere2fr5f7JxSIw": {
    "date": "2/16/2018",
    "text": "The service was off today. We came in for lunch with a 15 min wait witch is common. Unfortunately, our party of 4 ordered and all but one meal showed up. After 20 mins still not food or a reasonable response from management. We have been here on many occasions without any issues. I had high expectations when I arrived today however that is now not the case. I sure hope it improves the next time. Becky the manager was very polite and apologetic. Would I go back yes. Food was good service not so much.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XwGiDU2jMm5RfWK88E9C9g"
  },
  "K04zrN3ORGrovTeCKOMGsQ": {
    "date": "7/27/2017",
    "text": "Great food and service. A new favorite restaurant for our family! Whether your are craving breakfast or meatloaf you can get it all! My favorite is the crab cakes egg benedicts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Or_ECfauRvNe7BtUu-O5w"
  },
  "ZohqBRJvG3zxtDRacn89qA": {
    "date": "7/11/2017",
    "text": "Visited first time last Saturday about 5pm.  Got right in and seated.  Service was ok, food was decent.  Kids meals were fabulous (which means we will be back)  Server never checked to refill drinks and I had asked another server (or runner/food server) passing by and she said she'd help but never did.  Finally our server came back and filled us up and then took another 10 minutes to get the check.    I had tomato bisque and it was awesome - they actually took it down from the soup of the day board while we were there - I'm assuming b/c it sold out - it really was that good.  I had cheesiest grits on the side and they were average - I expected cheese throughout and it was actually just melted across the top of the dish-blah!  Husband had croissant french toast - both kids finished their kid's meals and then helped him polish off his meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKTBjeRFRkTZXWb12gQQdw"
  },
  "3tAvDsuExucX-uO35HIGtQ": {
    "date": "7/4/2017",
    "text": "30 minute wait, friendly staff and all the food I saw come out of the kitchen looked good. Not many vegetarian options so I had grilled cheese and hubby had chicken and waffles. Fries were hard/old but the chicken was marinated 48 hours so it was juicy and crispy. Waffles with strawberry butter very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ebYcIR2bO0wpwGFipxeYPA"
  },
  "D7lP6he0MA70lo22LNEY5Q": {
    "date": "1/29/2018",
    "text": "Just a diner.  Not much to satisfy someone who is into healthy or clean eating.  Atmosphere was nice for a diner, and service was good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xcpn0h3ecnA0He_chefhkA"
  },
  "Ma2k3iIRvWAOVGTmEwNCPw": {
    "date": "12/18/2017",
    "text": "Good food , but bad service, just my guy maybe. After asking for my first drink refill , I never received it or saw him again till he brought the check when I was finished with my meal . They seem in a hurry to take your order & get your food to you & then that's it . He never asked how was everything or did I need anything. After getting the bill , $ 13.78 before tax , I planned on tipping $3. Paid with a 20 , waited for my change . He brings back a 5 & walks away . Any waiter that expects a tip knows to break up bills so that someone can leave a 20% tip . But I guess he knew what he was doing , while waiting for him to come back by to break 5 , he disappeared again , not having all day to wait on him again , he got the whole 5 , but I won't be back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gTE48ELx1mz-x4hmyB8btw"
  },
  "vgJZ8HRbsX-AQ3uLxYnU2g": {
    "date": "6/23/2017",
    "text": "Service was great the moment we walked in. You don't know how much it means to be welcomed with a warm smile, and the smell of good food helps too! Love the decor of the restaurant too. Clean and nice! Our waitress was Alicia H and she was courteous and attentive. My first time ever ordering fried chicken with waffles and it was perfect. It's pricey for one person BUT it's so much food! You really could share it with someone else. It's literally half a chicken! It was tender, juicy and crispy on the outside. Love! We went right at 10:30 so there was no wait, but when we left at 11:30 the restaurant was packed which is a good sign. Highly recommend and will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nbpoCpYHL9fGRmQy59pP5g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nbpoCpYHL9fGRmQy59pP5g/o.jpg"
      }
    ],
    "user_id": "GwdeigD9o-tBK7NH1v3qyg"
  },
  "EuFNV2EfuFww6C7gJxNxuw": {
    "date": "6/17/2017",
    "text": "Awesome restaurant. The chicken and waffles will leave you staggering from the flavor and monstrous portion. The manager Rashad is attentive and professional. I recommend this place highly and will be a regular!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0EaYroH6On7CxoPnUk_Iw"
  },
  "LNO0t0rECt3bf6b4-xM0yQ": {
    "date": "1/21/2018",
    "text": "Love love love the Metro diner! We've been there three times so far and have had a great experience each time. Every time we gone there's been a wait, but it's always been less than what they tell us (usually get quoted 20-25 mins and get seated in about 10) and we enjoy a complementary coffee while we wait.  Generally we've had quick service from the wait staff, who overall seem very knowledgeable and eager to please.  I've always gone with a group, and some of the dishes we've gotten include the Fried Chicken and Waffles, Breakfast Pie, Biscuits and Gravy, Philly Cheesesteak, Bissell Breakfast, and Yohala bread (they usually have different fruit varieties of this).  Far and away the chicken and waffles is the star of the show!  Comes with half of a chicken (you can get all white/dark meat or a mix which is what it standardly comes with) that they season 24 hours prior and that is perfectly crispy outside and wonderfully juicy inside.  It comes with this awesome strawberry butter on top of a thick fluffy waffle. You can have regular syrup but I highly recommend the sweet/spicy syrup that their server mixes at the table for you.  And at my last visit when I wasn't that hungry but couldn't resist that dish, my server informed me that you can get a half portion, which includes half of a waffle and two pieces of chicken, either white or dark meat. This was perfect for me!  I've also had their honey chicken biscuit and side of breakfast potatoes at one visit which was delicious too.  The yohala bread is yummy and a good plate for the table to share.  They also have brunch drinks (mimosa and Bloody Mary) and the drinks are quite large and cheap compared to many brunch places!  I highly recommend this place, will definitely be back for round four soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X4knH8ShU9wntVRNjPDgfw"
  },
  "F7bbOYKD2aOquxN9UZptVw": {
    "date": "1/16/2018",
    "text": "Very good diner, it reminds me of home (NJ)! Good selection, especially for breakfast and their specials. The staff is always very nice too. Be prepared to wait to be seated on a Sunday morning/afternoon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F4rNopgEoE3H4_QeQylO3Q"
  },
  "GCgxByL0a5PYFDhcbpGTbw": {
    "date": "11/23/2017",
    "text": "It's Thanksgiving but with kids out of town I decided not to cook. Thought my husband and I could find a restaurant to have our turkey dinner this year. Went to Cracker Barrel but it was a 2 hour wait. Went to another restaurant in Matthews but they wanted a little too much for a 3 course lunch of turkey. Finally ended up at Metro and was seated right away and ordered the special; waffle made out of stuffing topped with mashed potatoes, turkey and gravy. It was very good; the only thing missing was the green bean casserole. A lot of food and then the dessert (which we had to get to go) came  with the meal for free. Great deal and it was reasonably priced and didn't have to wait all day. Thanks Metro. We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tavQWM6XCH_ybziig2HQ5g"
  },
  "4z1gOg1O5FJeb0AwbLbURg": {
    "date": "12/30/2017",
    "text": "I don't usually do this, yet I felt compelled to. I visited Metro Dinner in Matthews on December 29th, 2017. My server was A very kind lady named Candace. I must say that she was on her job, then another server we later found out his name was Mark. It was nice to see them working in tandem, very pleasant and I will be bringing my family back. I felt like the only guest she had. The food has always been wonderful, but my service has never been so warm before. They are an asset, and as a local restaurant owner, and a diner regular you've done an outstanding job. I tipped them both, watched them, and there sense of urgency made us feel important. I also watched her help others and keep a smile on her face. Those two work well together and your manager that was on her job. A nice blonde headed lady came and spoke to us, first time ever at that location. The winds of change are upon you. I have found that the food at places can be so/ so, but if the service is good we always go back. We went in for breakfast today, again stellar, but the service was not what I had last night. We will come back, we just know who to ask for next time, so anyone using Yelp, go to Metro in Matthews and ask for Candace and or Mark. I never laughed so much, and even my husband tipped better than I have ever seen him do before. So give this place a shot, the food is to die for and the portions are huge. Nothing better than homemade food, fresh flavored coffee and she talked us in a piece of chocolate cake with milk. If there were more than 5 stars, I'd give them to you.  Signed Very happy Diner!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jVTfN12DDB62Q80dGKKalw"
  },
  "UXooMZsQCe-vEQHnjAfGhQ": {
    "date": "12/15/2017",
    "text": "This is my favorite restaurant! The menu has many tasty looking choices. While looking at pictures on the wall I noticed that Guy Fieri from the Food Network \"Diners ,Drive-ins and Dives\" had visited. My next visit I will try the menu item he suggested. All portions are wonderfully adequate! And they serve breakfast all day! My 1/2 fried chicken was just delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gjgoa8-vBJ-TroGkYDdlng"
  },
  "Ku6H_ZblDWmtdHnq__p1AA": {
    "date": "11/3/2017",
    "text": "We went today for the first time. One party member ordered hash and really enjoyed it.  Second party member ordered Phill Cheesesteak and home made chips. He enjoyed the sandwich but thought the chips tasted funny - ate them anyway. I ordered a chicken salad sandwich with french fries. The chicken salad sandwich was good (chicken could be cut into smaller pieces) . The french fries were NOT good. They tasted like the grease in the fryers needed to be changed badly. I left over 90% of them on my plate. The waitress was friendly and attentive. When she asked if I wanted a box to take the fries home - I told her no I did not like them. I asked how often they change the grease and was told twice a day. She said I was not the first customer to voice that concern today. Waitress said she would let Mgr know, which she did (We heard her tell Mgr). Mgr never came to table. I did hear Mgr tell cook there was a complaint about the fries tasting funny. I certainly was not looking for a free meal or huge discount, but offering to take $2 off the total ticket because of the fries would have been very decent of Mgr.  Unfortunately, either the Mgr couldn't be bothered or didn't care. We might or might not try the place out again, but I hope Mgmt is more responsive to customer complaints while said customer is in the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8e40jEz1RHZdpgjsVo_HSA"
  },
  "TO-kzNv64DWo1rGQSGV_1w": {
    "date": "7/3/2017",
    "text": "This was our 1st time trying this place the waitress was very sweet the service was ok in general I'm giving it 2 starts because of this I ordered white toast I get a biscuits that's 1 , my husband ordered French toast in pound cake batter there was supposed to be 4 of them we got told you only get 2 at breakfast time when there is no such thing on menu 3 when they arrived it was just simple pound cake dipped in sugar and lightly fried no egg nothing  4 honey mustard is mixed with mayo  yuck !!!  We will not be coming back here",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zm7JoOWw1ZG0y1fqdtxZdQ"
  },
  "q1E0mC-XC-iteGgbdPlU8g": {
    "date": "8/26/2017",
    "text": "The food was fresh, hot and seasoned just right.  The location was clean on the outside and inside as well.  The staff was friendly and always smiled when speaking to the customer.   I'm so happy there's a diner close by instead of traveling to Southend.  Can't wait to take the family there again for another great meal.  Bravo!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bHVOl1xrtHH2HfXlreIk_w"
  },
  "Dr4a490ibCJlRXynCRvD_A": {
    "date": "8/24/2017",
    "text": "Stop in for breakfast on a Sunday and the place was very busy. But the great thing was that the wait was not to bad. The menu has a great selection to choose from and the staff is friendly and the food was good. Thankfully it is close to home so we will be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "IxISWD_-y3kCk09qdA_dSQ": {
    "date": "7/26/2017",
    "text": "Great service and food. Had the crab cakes benedict with home fries and coffee. Will definitely make a return visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0psV5ognESp805vfnV1zxw"
  },
  "zUoR9q5BFGYSRaVqNC4U9g": {
    "date": "8/14/2017",
    "text": "OMG this place was GREAT.  Hubby and I visited on a Monday for brunch and we so delighted at how great it was.  Our server, Jessica, was just the best.  Her 3rd day on the job and so attentive.  I had the breakfast pie.....to die for.  Also had biscuits and gravy and they were DELISH.  Totally recommend this for breakfast at least.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGIwHeGai_oQZZssGIL3rw"
  },
  "5-cIBLvdAErOC5HPjlbB8g": {
    "date": "9/7/2017",
    "text": "Super place to eat. Sometimes too much food. We had a couple of issues with wait staff with not getting the order right but they offered to fix it...enjoy the chicken and waffles.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JJ8wI12iSxPUNvtsYsxw1g"
  },
  "43-gfPP9f5Dg__oyOt9BRg": {
    "date": "7/27/2017",
    "text": "Absolutely loved the CHARLESTON SHRIMP & GRITS!!!!!! The grits are fried in a lightly crusted patty served on top of some delicious white sauce. It was super mouth-watering! Great atmosphere, family friendly, and a place to meet up with friends! This is our new breakfast joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TahdAmelmlCBsSDeDTWOhA"
  },
  "YRFibsfvdW4qM5gOZck6xw": {
    "date": "6/4/2017",
    "text": "We stopped here and when we went in it was the opening for friends and family but they let us in anyway! I had the Cajun chicken pasta and hubby had the fried chicken.  My pasta potion was HUGE and the sauce had a bite but not too spicy.  Mushrooms right consistency.  Wonderful dish! Now the fried chicken was out of this world amazing.  The skin was soooo crispy and flavorful.  The waitress came out and mixed up syrup and a special hot sauce that was on the table into a little bowl and you dip the chicken in.  Absolutely amazing. Hubby had squash that was very thinly sliced juicy and well seasoned. For a first night they are open, service was great. This is a big place inside.  They also serve breakfast which Matthews desperately needs, it is vey difficult to get into a breakfast place after 8:30 am on weekends. They have outdoor seating. This place I believe comes out of Florida and was on diners drive ins and dives.  Everyone else was really enjoying their meals too.  We can't wait to go back!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v8dPL6KRq88jZke-N7KGDQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Fried chicken! 3 huge pieces so so so good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v8dPL6KRq88jZke-N7KGDQ/o.jpg"
      },
      {
        "img_id": "JyScryJrkE0q52TuT6a8Jw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Cajun chicken pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JyScryJrkE0q52TuT6a8Jw/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "6iKqGa7-4KkgilcExDgwvA": {
    "date": "7/19/2017",
    "text": "We stopped in the other day for a really great breakfast. I got biscuits and gravy and my bf got the chicken and waffle. You get SO much food for the money. It's a little on the pricey side but I took more than half mine home for later. They gave my bf half a fried chicken! The strawberry butter with the biscuit was really good. My sausage gravy was yummy. It took a while to have a server notice us and take our drink orders. Then it was even harder to get a coffee refill. This place would get 5 stars if they paid a little more attention to their tables!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AdbJTvrMJdZD2PQi5Hb_iA"
  },
  "lDvrrCI6yjNT1pw35ujxwA": {
    "date": "4/6/2018",
    "text": "Just keeps getting worse!! I blame management.  You can see the misery in the poor workers face! Used to be a favorite place of mine but after watching the kitchen I witnessed  rather unsavory attitude from management I will not go back ever. Workers should not be spoken to in the manner.  No human should be treated that way.  Such a shame. Food has suffered as well and the menu has gotten just boring.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-aebe7O9rRVH9KVLRKoacg"
  },
  "a9AtAU6tVqERxHwYFknqiA": {
    "date": "4/1/2018",
    "text": "The breakfast was fantastic and the portion sizes were huge!  The wait staff was extremely friendly and caring even when it appeared that they were crazy busy at the time.  Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MHwVbYPx68D4ZmyTjbuDxw"
  },
  "SLxZXtQpg6J6stfTiXKSrA": {
    "date": "8/5/2017",
    "text": "Have been here several times since opening and the food each time has been great.  Staff has been good as well. Slight waits each time, but that's True of any decent spot in Matthews.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UUydYUxKOBlRQb3Is51dPQ"
  },
  "Px7tzxbElpyaASV6XKnk0g": {
    "date": "9/19/2017",
    "text": "I think I have found my new favorite place to eat. Friendly service. Scrumptious food. The peach tea is wonderful and they even have it unsweetened.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HPBXg2fDUgI_QUcywgP8lg"
  },
  "M28vIjmDlcRBs-yUE_gMwg": {
    "date": "9/18/2017",
    "text": "My family and I came here for lunch today. We were sat in a timely manner, our order was also taken in a timely manner. My dad and I got one of the daily specials, The Cajun Big Fish. It was excellent. My mom ordered the Metro Club. It was HUGE! She could only eat about a quarter of it but took the rest home. Her fries were cold and extremely salty. It was a bit pricy for lunch. Might come back again as I work in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GUBrTPT2-SX8fmGVBGZDlA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GUBrTPT2-SX8fmGVBGZDlA/o.jpg"
      },
      {
        "img_id": "2nJqLMbHlJHWZX9PUxabjQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2nJqLMbHlJHWZX9PUxabjQ/o.jpg"
      }
    ],
    "user_id": "PMdhsUS7lwKJPpzR3ucV7w"
  },
  "kqFgO042kb05iq66D08KLA": {
    "date": "7/16/2017",
    "text": "I have been here a few times already.  You can tell these people have been in business a while.  They have their act together.    The food & service have been very good.  I have gotten their chicken salad on a sandwich & also on a salad.    I will be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1iLEL7fxB4hOLSo3tt-KeA"
  },
  "5ijFcdaeTLiex5RP8dJ6xQ": {
    "date": "7/15/2017",
    "text": "This place has the best reuben sandwich I have ever eaten!  Meals are hot, saucy, and sloppy.  We loved it.  Husband had the Holy Davoli which is a burger + grilled cheese hybrid.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RMj-nHoyJs7kcH-gnMAM5g"
  },
  "w6p0NvxTua5JT8eH2Yokow": {
    "date": "7/6/2017",
    "text": "The fry chicken tastes just like my mother's. The best fry chicken I have ever had outside of her house. For that alone you get 5 stars. I liked the waffles and strawberry butter as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOnSKxF7FUJmGAsjiZGLtw"
  },
  "VaSVycizJV0CIjT-jdSPdg": {
    "date": "7/2/2017",
    "text": "You can't go wrong eating here. I've never had a bad meal and today was ahhhhmazing! We had the chicken and waffle and a side of home fry potatoes. The waitstaff can't get any better. Love love love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EjnrGfxCmoygi5ar3r7kdg"
  },
  "L7jzHWF4JaJoBCIgPygHeg": {
    "date": "11/20/2017",
    "text": "I don't think I've ever been to a place where the majority of the group was unhappy with the food.  There was 7 in our group. We witnessed a drink, delivered to another table, being spilt on the customer.  Within a few minutes at another table and a different employee, another drink was almost spilt.  Let's say I was on edge, I didn't want to leave soaked. Silverware, but no napkins, had to ask for them after food arrived. Chicken Pot Pie - over baked, with little to no creamy filling.  Inconsistent cooking as another table's looked wonderful Reuben - ok, not the best, not the worst, mac & cheese side was cold and did't have a good taste, replaced with fries Burger - ok Chicken & Waffles - no complaint Monti Cristo - awful, meat didn't taste good, oil used to fry was old (over used), in the fryer too long, 2 other people tried it, one agreed the meat wasn't good & the oil was old, the other spit it out Burger - asked how wanted cooked, ordered well done, received medium maybe medium-well, fries were cold, fries were replaced Chicken & Waffles - sauce wasn't included  At the onset, I thought this will be good, maybe I'll bring my husband here, at the end, there is no way I'll step foot back in here.  The one good thing was the take home bags (both Chicken & Waffles, since it was half a chicken, and the Reuben since her husband will eat anything).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lymuoUZYDtExk8Ef1_WT-A"
  },
  "DO4mgEzF0Xa5h2kMy0Ot6A": {
    "date": "9/3/2017",
    "text": "Roast beef was so-so.  Not fork tender, but a good portion.  Mashed potatoes were excellent.  The juice/gravy was salty but no other seasoning noted- black pepper, bay leaf, would have been nice. Husband ordered chicken fried steak with mashed potatoes. For the price, should have a vegetable side offering as well. Noted that the dinners did not have vegetables as sides which other similar restaurants offer. This would be a plus if vegetable choices were included.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hG-HZQDLGC7qZFzxMKPSLw"
  },
  "IieSm85nBqZF_PSYBgf-fA": {
    "date": "6/7/2017",
    "text": "Awesome food! Great service, even though they just opened they are still making it happen with excellence.  Don't wait to discover Metro diner, it is one of the greatest restaurants in Charlotte.  Come with a big appetite because you'll get plenty of food at this restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D5Wuk3QmdIhnARj61Xy1wA"
  },
  "U1Tnz7oYju2o4bqxKM-IVg": {
    "date": "5/18/2019",
    "text": "I was looking for a spot that served huevos rancheros and stumbled upon this diner. The restaurant was bright and clean and had a good health rating. It was Saturday morning around 11 and we were seated right away. Our server, I believe his name was chad, was great! We ordered the huevos rancheros, a Belgian waffle, and a daily special: crab cake eggs Benedict. All three were sooo good!! Nothing on the rancheros tasted generic- very flavorful bean mix, fresh salsa, freshly fried jalapenos and tortilla chips. My hubby got the eggs Benedict, which had the whites almost whipped to a merengue texture while still leaving the yolk intact and runny. If I lived near Charlotte this would certainly be a regular place I'd visit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qSie74-P7VumP3oUZTDoFA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Crab cake eggs Benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qSie74-P7VumP3oUZTDoFA/o.jpg"
      },
      {
        "img_id": "XXLG3IIyRf1MqBjCjhz3xg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Huevos rancheros",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XXLG3IIyRf1MqBjCjhz3xg/o.jpg"
      }
    ],
    "user_id": "BhSvZVM-dV0teW0gWG_E9w"
  },
  "T3DR6XuA8gK_ouu71r17xg": {
    "date": "12/20/2018",
    "text": "I was in the Matthews area and was thrilled to see a Metro Diner close by. We went in and were greeted and seated with a smile. The server asked us if we had ever been there before and then shared the daily specials with us. Our waitress was very sweet and may have been new because she had a \"back up\" server it seemed, so we had double the great service. We finally decided on our meal, hubby had pancakes, bacon, hash browns, eggs, English muffin and I had the fish sandwich that wasn't on the menu but as I was scrolling through yelp, I saw it, showed the pic and they made it happen. All of my husbands food was delicious but I had a snafu with my sandwich. The bread was stale. Very hard and tough but the inside was delicious. I immediately informed the server and they took care of it and had another one made. The manager came over and apologized and said they would make sure the bread was fresh and toasted. And the new sandwich was perfect! The coffee was a bit watered down and I'd love it if they had a strong brew option. Nothing like a delicious meal with watery coffee but it was tolerable but I won't likely order it again! Still a fan of this diner despite the bread and coffee. Give it a shot!  That is all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U7Bfif8SSEr-WhdCj7InBA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Fish sandwich!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/U7Bfif8SSEr-WhdCj7InBA/o.jpg"
      }
    ],
    "user_id": "bv2Q8Y6WdfUpX3sDHyTq9A"
  },
  "fIe9tekiZdtqnxgaUS3w8A": {
    "date": "7/4/2019",
    "text": "First time there today. Probably the last. My wife and I both had the western omelette. It had no taste and seemed undercooked. We were both sick the rest of the day.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDjNTCSsc72dSiWvOMOW5A"
  },
  "kLHtAN7SnPZ8U6Zo6BFb_g": {
    "date": "12/15/2018",
    "text": "Breakfast on a Sunday with familiar friendly faces and awesome pancakes. The wait is never too long even with the Sunday crowd. Love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ieib5fHP0hvY8qx87upkpQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Sometimes you want to stay in bed but you still want an awesome breakfast!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ieib5fHP0hvY8qx87upkpQ/o.jpg"
      }
    ],
    "user_id": "D83OXU0gO768yHw-65GGPQ"
  },
  "fuiWBlx0_sro62Vtdj1q9A": {
    "date": "6/12/2019",
    "text": "Food: Absolutely amazing. I ordered the chicken tenders, a biscuit, and grits. The food was perfect for breakfast. It's truly all American soul food. The chicken was crispy and didn't have much grease like most restaurants. The biscuit was probably my favorite part it was perfectly crispy. And the grits tasted good, but I added cheese for extra flavor.   Service: We had two servers a older man and a younger women, both were pretty nice and respectful. Overall they were welcoming and got our orders correct. Also they gave refills whenever they saw a nearly empty cup.   Inside Restaurant: The interior was very clean and old fashioned. The floors were clean and the tables didn't have crumbs or smudges. And their bathrooms were also pretty clean.   Overall enjoyed my experience here, and I recommend it to anyone visiting the area or those simply looking for a good all American Breakfast place. A well deserved 4 stars to Metro Diner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VEx_bFQiDTbCFfHsf5P0xQ"
  },
  "QEe5FNB4rstgdyujS6PPgA": {
    "date": "5/12/2018",
    "text": "Yay!!!! REDEMPTION , We came back to Metro Diner in hopes our experience would be like the first and it definitely was great.   The young lady at the hostess stand with glasses had a smile and greeted us right away , our service was attentive and courteous.   The food was delicious , we received all the correct orders and the portions here are equal to the money you will pay .   My veggie omelette had asparagus, mushrooms, onions, tomatoes , and peppers . The Udi's gluten free toast was a perfect choice .",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "iZ5w63w_-nLZSyEPF2ogow",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Club sandwich",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iZ5w63w_-nLZSyEPF2ogow/o.jpg"
      },
      {
        "img_id": "U39Tc1CJhUPBNEiu2AEzXg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Veggie omelette with hash brownsand gluten free toast",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U39Tc1CJhUPBNEiu2AEzXg/o.jpg"
      }
    ],
    "user_id": "lUXifKGBbbRUNxaPnuekXw"
  },
  "-ccaDEdvANacTOhpRGowoA": {
    "date": "4/27/2019",
    "text": "The service was incredible. Shoutout to our superb server Tammy and the kitchen staff; the food was plentiful, hot and delicious! They had a 2.99 mimosa special and were prompt and cheerful as soon as we walked in. I would come back again and again, thanks Metro Diner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JmYr2Ib6VYU3B37VQ9tAyg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Board of Specials",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JmYr2Ib6VYU3B37VQ9tAyg/o.jpg"
      }
    ],
    "user_id": "hrVmiK2qnjB38cBhKCbMjg"
  },
  "CEFVqQHbhfhkP4Zp8a1mcA": {
    "date": "5/29/2019",
    "text": "I really like this place, and so do a lot of other people, - it's always busy. Nice feel to it; great service; excellent food.   What can I say, I had breakfast today. Decided to order something I have had elsewhere and was not all that good. And to no surprise, that dish here was very good!  If you don't eat here, you are missing out. What else can I say?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OvW72VWdF6X59pK-MN-CIg"
  },
  "umwGAMKcagD33hGM0LeIjg": {
    "date": "7/23/2019",
    "text": "Just got back from one of the biggest meals I've had out, for some time. My friends and I decided we were going to try out the Metro Diner. It's out there a way, so it's taken us some time to try it out. This afternoon was the time. I had the meatloaf plate. It had two large, gravy laden slices of meatloaf, thankfully no ketchup, mashed potatoes and sliced squash, with a chunk of bread that they called a baguette. The meat loaf, on the surface was a little dry, but quite moist and tasty once past the surface. I enjoyed it and despite my initial estimate that I'd be taking some of this home, I ate the whole thing. It was great. As today was a bit chilly inside, I ordered a cup of coffee. Not sure if there was supposed to be refills, but a refill was never offered and I didn't ask. Service was a little slow initially, but she was friendly and very sociable and once we had our drinks, we settled down to order. Most everyone else had the fried chicken. If you have a healthy appetite, then this is the place to go. They don't skimp on the servings, you get a FULL plateful. Everyone was satisfied with their meal and stuffed when we were done. I'd say you can't miss if you go to Metro Diner. Good service, good food, good prices. We all enjoyed our foray out to Metro Diner and I would not hesitate to recommend you give it a shot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5U7qNWbnFNnL7Dye6GFh7w"
  },
  "yQSz_ArGE3gkANkYet14Tw": {
    "date": "9/30/2018",
    "text": "This place is yummy! We went to brunch and there was surprisingly no wait but when we left at 1130 a line had formed. I got the western omelette and it was delicious :). They have a pretty good selection of brunch and lunch items. I would likely come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "htSeUdtL7Bl_mc06CXEKFA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/htSeUdtL7Bl_mc06CXEKFA/o.jpg"
      }
    ],
    "user_id": "5oPWsXIx_WaHQNItL3RwpA"
  },
  "bIPjD0pFjS3aZlf_eiEuAQ": {
    "date": "7/13/2019",
    "text": "Excellent quality food, large portions served with a smile. This place has excellent daily specials, impressive eggs and waffles too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5B-QEd_Qlzq64fvEHoTivQ"
  },
  "7BWe3n4IUSt-iuV297A1xw": {
    "date": "6/17/2019",
    "text": "This place is so good. I ordered the chicken and waffles and let me tell you I thought they were going to give me chicken strips but it was a whole chicken. Food was awesome and the service was great. I will go back to try them again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqXlL9J2cNjY5e-6t3ZPhw"
  },
  "Gfk54y2pm2ynYe7-h_Uw2Q": {
    "date": "6/16/2019",
    "text": "This is a good diner for home cooked meals. The amount of food for each dinner is huge. You won't go home hungry. I've enjoyed a few of their breakfast entrees. Also have a pot roast entree that is as good as at home. There is a selection of desserts which I have not tried.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3wCGAHPzVsYnpOvPmLDhg"
  },
  "voSLApmPVJhPlciK2I34Kg": {
    "date": "6/30/2019",
    "text": "Great atmosphere and super friendly service. Our server, Angel, was wonderful. We had breakfast, and the food was really good. Generous servings and a nice selection. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1_bNPSrwqQ6D8T7G4Zuf5g"
  },
  "qKLLk4Yd0Q__eGXSY5C2hQ": {
    "date": "1/14/2019",
    "text": "This is the first time I've eaten at metro diner. I found out about it on diners drive ins and dives the menu features classic diner dishes like chicken pot pie, shrimp and grits. The prices are pretty reasonable and the daily specials never disappoint I always order the croissant French toast and it is delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "NDa3RAblROfZSGTPE6W_pg": {
    "date": "5/24/2019",
    "text": "My husband and I are visiting from New Jersey, wanted to find a local dinner to have a good breakfast. Went searching on my yelp app and found this spot. From the time we entered they were very welcoming and warm.. Music selection was great for all us 80s babies lol Menu had a good variety of food.. Our food came quick and HOT. We cleaned our plates and enjoyed each bite. Our waitress April Jay, was awesome!! Once she seen we were about to leave she brought us 2 to go cups filled with what we were drinking, that was so nice. We highly recommend, We will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3B5Iw-0EzekcmELSPPnOCg"
  },
  "Zp_NFST4c4O0I-Y85GXXFw": {
    "date": "10/25/2017",
    "text": "After a great experience at the Pineville location I was looking forward to this location, and a great breakfast. Unfortunately my expectations weren't met. I arrived on a Tuesday morning, just shy of lunch so decided to order breakfast...it had been long morning dealing with the auto repair shop and rental car company, ugh. So, enough about that, back to Metro.  I ordered the Western Omelette with an English Muffin and Hash Brown and I added a side of Sausage Links. The Omelette was good, but nothing great. I wish the cheese was more combined and melted. As for the sausage links, ugh. Not my favorite. My English Muffin was not toasted, which I did send back. Overall, it was a nice breakfast, but nothing great. I did love their coffee and the staff. Like the other location, service is outstanding. For now I'll probably stick with their Pineville-Matthews location.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "O_yQIJsa5rerTjOUNkNClg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Western Omelette, salsa on the side, and Hash Browns!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O_yQIJsa5rerTjOUNkNClg/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "9ibnyIRFiG-U54r7AjQu-A": {
    "date": "11/14/2018",
    "text": "Went for brunch on Friday. Around 11am was seated super quick. Staff friendly. Had the avocado toast today! So fresh and delicious!!! Super impressed!!! Place was nice and clean and the atmospheric friendly. Plan to go back soon -------- Had to drop a star on you Metro Diner.  11/14/18 decided to meet with family. My cousin has never been and she flew in from Arizona.. food was delicious today. However the servers where not at their best today. Kinda disappointed as it was my cousins first time. I arrived first at 11:30am and asked for a coffee and the lady that sat me said my waitress would bring me that. The waitress came, wasn't pleasant at all. One by one our party arrived.  we ended up with another waitress who also seemed not happy to be there.  Glad the food was great and the company was even better.  Idk why the servers seemed irritated. If they would have been more amicable I would give this place 5 stars. They were slow to refill our coffees. Kudos to the chef though! Food is delicious.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQvH8qh1wDdPkk5gG6OuWA"
  },
  "UcPFJuYQqq70VUxQ6VjjuQ": {
    "date": "10/3/2017",
    "text": "Love the Comfort Food.  Chain out of Jacksonville FL and one of two locations in the Charlotte area. Third to open in Huntersville off Gilead before Thanksgiving.  We had dined at the Pineville location several weeks earlier and were impressed so we decided to give it a try as well.  My wife is not a breakfast fan so we time our arrivals so that she can get whatever she wants and I still have an option for breakfast if that is the direction I want to go.  Pulled in, checked in and were told about 15 to 20 minutes. No problem and guess what, we were seated in about 10 minutes.  Good service after we got seated.  Looking over the menu, my wife ordered iced tea while I went with the Peach Flavored Tea.  Both were very good.  My wife surprised me. She who does not like fish or seafood other than crab, ordered a fish sandwich with a side of fruit. Double surprise in that she actually enjoyed the fish. Nice and moist, very flaky etc.  Side of fruit was a nice treat also since it was more than just melon filler.  I had the Chicken and Waffles and it was great although I will admit I have never had it served with Strawberry Flavored Butter.  We really enjoyed ourselves and look forward to the Huntersville location witch is closer to our house.  Generally very good except somewhat crowded but otherwise would recommend to any one who is willing to wait a bit.",
    "rating": 4,
    "rated": {
      "funny": 11,
      "useful": 20,
      "cool": 15
    },
    "photos": [
      {
        "img_id": "y9yAUmvchj0Lxei5LZULgQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Outside waiting and outdoor patio.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/y9yAUmvchj0Lxei5LZULgQ/o.jpg"
      },
      {
        "img_id": "eoFsxkFOt3-j_-o7G53zTA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Dining Room and Service Counter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eoFsxkFOt3-j_-o7G53zTA/o.jpg"
      },
      {
        "img_id": "nQj2Rrei3XD2HAOkKQZuiQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. A fish sandwich that even my wife who hates fish, likes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nQj2Rrei3XD2HAOkKQZuiQ/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "ADBsGU-OOdqVNgWsoLcQYQ": {
    "date": "1/20/2019",
    "text": "French toast. Bacon. Mac & Cheese with the waffle & pulled pork. Potatoes & cheesy Eggs. I enjoyed the food. Will be stopping by again. The sauce that goes with the chicken is sweet & spicy. The chicken is fried to perfection & seasoned well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JGTDsVbFqZx3ArK1QZk-QQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. French toast. Bacon. Mac &amp;amp; Cheese with the waffle &amp;amp; pulled pork. Potatoes &amp;amp; cheesy Eggs.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JGTDsVbFqZx3ArK1QZk-QQ/o.jpg"
      },
      {
        "img_id": "oJpf7DJ5ZAySF8azxMvAdw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. French toast. Bacon. Mac &amp;amp; Cheese with the waffle &amp;amp; pulled pork. Potatoes &amp;amp; cheesy Eggs.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/oJpf7DJ5ZAySF8azxMvAdw/o.jpg"
      },
      {
        "img_id": "jcw-ax87qjHvCp1XtMeqPw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. French toast. Bacon. Mac &amp;amp; Cheese with the waffle &amp;amp; pulled pork. Potatoes &amp;amp; cheesy Eggs.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jcw-ax87qjHvCp1XtMeqPw/o.jpg"
      }
    ],
    "user_id": "UuwfJOvFDb91-JYbDM_UEg"
  },
  "qB_b2dMxJe1EcTNVJsrT4g": {
    "date": "7/19/2017",
    "text": "Very Busy , Very Very Overpriced , Food is Average at Best .. dont see the big deal , NC will never understand The True Meanings oF diners,  Closes at 9pm which sucks .. Diners should be 24/7 but here restaurants in Charlotte are scared of the Zombies after 10pm ... My favorite Diner is Midnight Diner Near Uptown Charlotte,  This chain Place blows",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "y87tYtJCYS_gxGuGjHqzAQ"
  },
  "juz8VU7QwH_vZeo-COAzyQ": {
    "date": "7/12/2017",
    "text": "As a chef I always root for a new place, sadly I am mostly let down, not this time. We went tonight after we left HomeDepot. I knew it had opened but was not sure where. We went in around 6 and were seated right away . My husband ordered Salibury Steak and I had the fish and chips. Both we spot on, I have to say this was the first time ever I ahve gotten actual hand battered fish in Charlotte. The fires were hand cut and crispy, cole slaw great and four pieces of fish. My husband had the Salisbury Steak Special and he cleaned his plate. He said it was hte best he ever had. Now unlike other people I watched the kitchen crew who really have to work in a well orchestrated team or service will go to hell. It was a beautiful scene to seem them all work and follow , fill the orders and expidite. I know not what the average person looks at but to me it only added to the great food. I can't wait to try breakfast (as this area has no good options) I saw some waffles with fesh strawberry butter go by and lunch I saw some beautiful rye bread on plates and I want that next time. Thank you Metro Diner for surpassing my expectations of mediocre food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bOS8YfYRt7Pa320yMRVNPQ"
  },
  "2jA5gcJgJ8h59Jpp3GfydQ": {
    "date": "7/16/2017",
    "text": "People hyped up the chicken and waffles WAY too much. Waffles were not crispy at all and the chicken was mediocre. I was so upset with the way my meal turned out, I was really hoping for better. The yo hala on the square was also way to sweet but the besides that, I did enjoy it. The hashbrowns were okay, not crispy enough.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3FD37YR27h_KAgmi9Rni2Q"
  },
  "Epma6iXi-hpsxD_ICXWy0Q": {
    "date": "11/24/2017",
    "text": "Best breakfast in Charlotte.  Have frequented both the Matthews and Pineville locations many times and always enjoyed my meals.   The value is great as are the daily specials.  If you haven't been you need to check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Go-rIlltT4H2XrF1gHNIAA"
  },
  "5V0wYKI741JpaVkQ_zSFjQ": {
    "date": "8/29/2017",
    "text": "Went in today around 1:30 ish and it was pretty busy for a Tuesday 20 min wait. Our waiter was nice .. I ordered the steak and eggs, the steak was bland but the A1 gave it some like and the caramelized onions I ordered. The grits was tasty so I'd definitely  be back and try some other things out on the menu. I can say the wait didn't seem unbearable it went by quickly and they did a good job separating the eating area from the general seating.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EuCgY09kt_y1lqjscQzrw"
  },
  "vBrLWudHhQ-AKuv9HNM_YQ": {
    "date": "10/11/2017",
    "text": "We heard a lot of things about this diner before finally stopping in yesterday for lunch.they were moderately busy and our waitress seemed a little behind. She asked us to hold on a second politely a few times before finally taking our order. She seemed knowledgeable of the menu items since we had a lot of questions. The cook came pretty quick and everything was delicious. Can't wait to come back for breakfast",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yuy93fizz_A75ewJZHreHA"
  },
  "etSrAIHWgqvtvwN6TJRf2Q": {
    "date": "4/12/2018",
    "text": "Breakfast is good, not too expensive. They have good choices for kids. The service is usually pretty great. Lunch and dinner options are not super but will do if you have no other place to go. We prefer the breakfast. The weight can get long after 930 or 10 AM.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kt3J-u1s6yLgsObSfC68mg"
  },
  "qkaF0ScUqu1ne0bsj8wH1g": {
    "date": "3/21/2018",
    "text": "the second metro diner I been to and it is as awesome as the other one . i had the Sandi Benedict witch was so good . The waitress was very friendly as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oLo1A_HdRIgRacXQ0hTrWQ"
  },
  "p-haIweARBLxwqkT6NfkFQ": {
    "date": "8/24/2017",
    "text": "The staff seemed new when we experienced brunch here. They were nice, but seemed confused every time we asked a question. We were expecting the same menu as the Metro Diner in Fayetteville, but it's not exactly the same. Maybe each location has a different specialty. We were a bit disappointed also because the dishes we ordered wasn't as tasty as we'd expected.  Hopefully it will get better because everything we ordered at the Fayetteville location was amazing. We ordered 8 different dishes and they were ALL delicious!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "edzNp8etn4V123VPgMBi3w"
  },
  "WbmxpspuJ3SKQ3D8DUgLJg": {
    "date": "6/17/2017",
    "text": "In from Cleveland, OH and tried Metro Diner on a whim. I'm considering myself lucky that we did!   In our party of 5 everyone had something different and it was all equally delicious!  The sausage gravy & biscuits came with 2 eggs and hash browns. Definitely enough for 2 people and the flavors and cook was perfect!  Most perfectly cooked hash browns I've ever had. The breakfast burger was amazing and again cooked perfectly, especially the egg, right amount of yolk running when bit into. The Philly cheesesteak was exceptional and very large. I can't wait to visit again. Definitely a 5 star",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-HyRtYSCnJWR8ERCIeCHFw"
  },
  "ybowauKC7Du5GMu_6oCHlQ": {
    "date": "6/3/2017",
    "text": "We had the pleasure of partaking in the soft opening. The restaurant was clean and well situated. Our waitress, Chastity, did an excellent job and was friendly. She knew the menu very well and was attentive. Having ordered from all sections of the menu, all the food came out quickly, together and warm. My Blackened Shrimp was delicious. Waffles, grilled cheese and chicken tenders were delicious as well. Chicken tenders were real chicken and the breading  was perfect. The restaurant was a little noisy, that was expected as they were very busy and it is a diner. We will definitely be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3oKiGlc_RicjXg76Kllqg"
  },
  "mOtzBSJJrzVjOiUsf8q7gw": {
    "date": "7/29/2017",
    "text": "Love the place up until now I loved the food, today I got the chicken salad salad even bought extra chicken salad I saw it was fat in it before I left didn't think nothing I just put in a napkin and threw it away. Got home ready to chow down and every dang bite was fat nothing but fat fat fat fat. I was so disgusted after 3 bites I gave up and packed it up.  I will be returning it in the morning I'm upset I didn't even get to eat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyPcC88XQlXruvh5UBmkYw"
  },
  "Ob6gFcftEPxgE_v2GBEwVQ": {
    "date": "7/5/2017",
    "text": "Metro diner is still really new in the area and I've already eaten here three times the food is really good and worth the price they give huge portions and service is usually good they have the best shrimp and grits and really good French toast I can't wait to go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "iVWtnR3Z-yKtzl56Ko8qSw"
  },
  "ex5xuBGzi1bJIjXkW-uLbg": {
    "date": "9/25/2017",
    "text": "We dined and found it to be just OK. Nancy did like the omelet she had was good. My platter just lacked much flavor- I had Biscuits and Gravy which was rather plain eggs ordered scrambled soft were over cooked. Likely we will try it again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LQDMhRTov_Tw8AwH4gtbDw"
  },
  "BTT_ZQ3mxmN3_KmGkpbpAQ": {
    "date": "5/6/2018",
    "text": "This is a fabulous place to eat...the food was outstanding and the staff provided great service! We had a table of 10 and everyone loved their meal! We will be going back for sure!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fGCEytcun2YObl0uoqhcGQ"
  },
  "S2INtn-ZrpXN4TUjyd3KDg": {
    "date": "8/2/2017",
    "text": "Awesome place to grab fresh diner entrees for lunch & dinner! Breakfast hasn't been a solid win for me here but I have only tried 1 menu item (the Breakfast Pie) && tried to make it vegan... failed miserably. Everything else I've ever had (especially the fish n' chips & onion rings) was great as far as quality & freshness is concerned!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3h_OspCFs3FClJtfuYU9mg"
  },
  "KE_PtPMnG-7dSYaAdPpt7Q": {
    "date": "8/29/2017",
    "text": "Ordered the Cajun fish special and huevos rancheros.  Fish was overcooked, sauce was ok, sauteed veggies were good.  Huevos rancheros the tortillas were burned/black, surprised they served them.  Otherwise the flavor and quality of that dish was good but the ratio of toppings to the tortillas was poor, not enough to get spread around.  Brocolli cheddar soup was surprisingly thick but tasted good, served on the cold side though even though specifically asked for the soup to come hot. Service was good but they didn't bring any napkins to the table and didn't check on us for a long time so we could let them know.  Has potential but will not go back soon.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFP5b5ZXPHmtiFjD-Kftiw"
  },
  "ThJUaRSLsGAicpuzbt-5Aw": {
    "date": "6/4/2017",
    "text": "Wow, what a great experience!!! Gold star service from all staff including the trainees, and the food is phenomenal as always from Metro Diner! A really great and contemporary atmosphere where you always feel welcome and well cared for! Even though the place was packed I didn't feel like I was being pushed out the door, everyone was very helpful and thoughtful and made us feel like family. Just 15 minutes from Charlotte, it's really convenient to grab a bite and head into town! They will always work around your dietary needs and genuinely want to provide a great experience all around. Whether you want a family brunch or just to grab a bite with a friend late at night, this is my go-to place! Highly recommend their Chicken and Waffles, the Yo Halla on the Square, and the Shrimp and Grits - some of our favorites! I am also personally a hashrown addict and boy are theirs good!! Prices are really reasonable with generous portions and incredible quality. Thanks to the whole staff and manager Julie!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tJ4dqqd1z_nzNabbEMaxSQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Deliciously simple breakfast classics",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tJ4dqqd1z_nzNabbEMaxSQ/o.jpg"
      },
      {
        "img_id": "EoDow__mEmRzVVdFXucKEg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Shrimp and grits and biscuits and gravy!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EoDow__mEmRzVVdFXucKEg/o.jpg"
      }
    ],
    "user_id": "wdH7pUVzJcb-q6Y2ndP6cg"
  },
  "9udRPCGn1SqEWKFeCoNxNA": {
    "date": "10/29/2017",
    "text": "The waitress was great, but the food was subpar.  Very greasy and felt like reheated leftovers.  Not freshly made, just reheated.  I was excited to go, hoping it would be good, but was disappointed.  They were busy and the service was good - just can't say the same for the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uooPT_PA8gx29F4jG8p3bw"
  },
  "lAmhtsUEBnw-nY2qVd8nuA": {
    "date": "8/27/2017",
    "text": "This is a great breakfast, lunch and dinner diner. Food is great and the service has been amazing every time if been here. Would recommend it to anyone in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V9aTPohfwsnec5WUb5LWsA"
  },
  "fVD6aaRYO6K8WGzQyAXMaw": {
    "date": "8/24/2019",
    "text": "I had such an amazing breakfast that I almost order another one lol. The service was fast even with the place being packed. They were friendly too. The menu was priced very well, not expensive at all. PLUS the portions were not small. That's great, of course lol.   Very well ran but the most important thing.... the food. I am still shocked at how delicious the food was. Definitely not a low grade diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWnbuWyHX3Nr2C09dtWqwg"
  },
  "Sw4DQ6dx09ATOTZJussGCQ": {
    "date": "8/25/2019",
    "text": "So I couldn't give a zero since yelp only allows you to give one star as a minimum so I guess we'll start there. I've Been wanting to come to Metro diner for some time due to the fairly good ratings that the establishment has.  I was with youngest son and we came in on a Saturday about lunchtime and of course we knew we'd have to wait but we were lucky enough to sit at the bar and actually watch the cooks create the meals. It's a novel concept I certainly like it however you need to make sure that you're actually following food safety rules.  We were greeted by a great waiter who is promptly taking our order and then we sat and watch the kitchen staff it took about 15 minutes to maybe 20 minutes to get actually get our meal.  During that time I didnt witness any kitchen staff change their gloves after touching other areas or their clothing or face area. This is called cross contamination and for those of you not in the food service business that's a big no-no.  I watched a who I can only believe was a kitchen manager take the trash out and then turn around to come back only to begin and prep food again without changing his gloves. Now I have no idea that he didn't change his gloves but he was only gone for a few seconds and the same gloves appeared to be on that he had before so I have to assume the gloves weren't changed.   Two other preppers I witnessed wipe things off on their clothes and then continue to touch food again, it's a big no-no they should've change your gloves.  I ordered the Swiss burger and it sat underneath the lamp for probably 7 to 8 minutes before it was served to me the reason I know this was because I was sitting next to the serving area. The bun was left on and by the time the food got to me the meat of the burger was cold. I explained a manager that I wasn't interested in eating it because the meat was cold, she then explained to me that they never placed a bun on top of the food it should've been left to the side. That wasn't the issue the issue was the meat was cold the lettuce was wet she just didn't listen to me. She had already came to the conclusion that the bun was the issues.  My son ordered grilled cheese with some fries, fries were way too salty almost over salty and not edible so we didn't finish that meal.  In the end the manager told me that she was buying our lunch, I knew I wasn't paying for something I sent back and didn't eat. It was a nice gesture however I think she thought I was paying for it and was doing me a favor. Not sure if I miss understood her or she me.   I explain to her that she just needed to take my meal off and I would continue to pay for my sons meal but explained that she Wanted is to come back so we'd have a better experience next time.   Experience wasn't bad it was the food that was bad therefore I will not under any circumstances come back to that establishment again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M6-A6F0B3kM5i94Kr0XHcw"
  },
  "KsMqnzUrRlUv4LM_vYxpuQ": {
    "date": "8/21/2019",
    "text": "Late lunch today and even at 1:30 PM on a weekend, Metro Diner was quite full. We arrived just as the wait list cleared, so keep that in mind if you're thinking about popping out for a quick meal.  I chose the meat lovers omelet minus the potatoes and the bread. Hooray for the keto diet, which is still working for me. It did not take very long to be prepared and arrived at the table still hot. They have Louisiana Hot Sauce at the table, which is a nice variety to the usual Tabasco.  Our service was good. Our waitress kept the water glasses filled, cleared the dirty dishes and took care of the check swiftly. I'm a fan.  [Review 11647 overall, 1428 of 2019.]",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 13,
      "cool": 13
    },
    "photos": [
      {
        "img_id": "A1TZj4zAUmh_oNkAC1jlTg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Menu at Metro Diner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A1TZj4zAUmh_oNkAC1jlTg/o.jpg"
      },
      {
        "img_id": "5Jn5qcMedaTi36E4yBiiOg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. The front of Metro Diner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5Jn5qcMedaTi36E4yBiiOg/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "otwGqLQ9F97u-1c_kdeBqg": {
    "date": "6/24/2019",
    "text": "$2.99 mimosas and bloody marys all day, every day. I believe my work here is done, end of review.  I was first introduced to Metro Diner last year when we did a couple elite events with them. I've been a big fan ever since. There's a real lack of diners here in the Charlotte area, so it's nice to have a few of these in the Charlotte area. They're a little nicer than your typical diner, not so much hole in the wall.  The menu is huge, they have it all. I usually get the San Francisco Benedict (two poached eggs, Canadian bacon, sliced avocado, and tomato). I get hashbrowns with it and add cheese, peppers, onions and jalapenos. I really love their Chicken & Waffle. First of all, be warned that it's massive. It comes with a sweet strawberry butter and a sweet & spicy syrup type sauce (it's sooo good, I would probably eat a shoe if it was covered in that). They also have this crazy Holy Davoli burger. It's basically a burger stuffed in between two grilled cheese sandwiches. Delicious.  Make sure to check the board, they usually have specials as well. Everyone is really friendly here, always have great service. They also have a counter you can sit at, so you can peep in the kitchen.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 11,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "R0dJS0NDkbSP8-ZNnH7USQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. San Francisco Benedict and hash browns covered in cheese, peppers, onions and jalapeños",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R0dJS0NDkbSP8-ZNnH7USQ/o.jpg"
      },
      {
        "img_id": "quNivOS_ZqOE0hLlmz5Bvw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. I added peppers, onions, cheese, jalapeños to my hash browns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/quNivOS_ZqOE0hLlmz5Bvw/o.jpg"
      },
      {
        "img_id": "C2JMmIB7JDlaKKmT8_3qhA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. San Francisco Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C2JMmIB7JDlaKKmT8_3qhA/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "41unVfldLOCOpHuNPOhHNQ": {
    "date": "7/24/2019",
    "text": "Honestly, This place kicks ass. Everything is great! Service is quick and friendly. Food is fast and good quality. Large menu. Breakfast, lunch, dinner....all of it is great!   Prices are very reasonable. They have new specials every day.   Atmosphere is very much like a diner. Nothing fancy but well maintained and clean.   It's always fairly busy but they get food out quick so you're not waiting too long, if at all. I've never had to wait for a table of two but usually a larger party has to wait a moment. Weekend mornings and lunch seem to be the peak busy time.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7YZ9-buN4RMh3ymKd70OCg"
  },
  "MR61GFn6Hbrwd0-OnVg5tg": {
    "date": "8/24/2019",
    "text": "My first time here and it lived up to my expectations which were high based on prior reviews.  They were very busy and I sat at the counter.  The kitchen was rocking.  Fast service, good coffee and tasty food.  I had the biscuits and gravy with hashbrowns and over easy eggs.  The portion of biscuits and gravy was huge and delicious. That alone could have filled me up!  The eggs were perfectly done.  What more could you ask for?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dMjEzxbn30O3SovJAE5h1g"
  },
  "ipP8cKIBG2XuAZkvDnbnrA": {
    "date": "8/2/2019",
    "text": "OK so have to start this off saying I am little bias for diners!  There are not a lot of True diners out there, but when I walked into this place at 10:45am and asked if they were serving lunch yet the hostess replied, \"We server everything on the menu all the time.\" YES! a True diner!  I get to work fairly early and am usually ready for lunch anywhere between 10 and 11am.    Was greeted by my server right away and served my requested beverage.  They started to loose a star here because after looking at the menu for just a minute I knew what I wanted and trying to get the servers attention was a bit annoying, especially when the people behind me, left and tables was cleaned then new person sat down and ordered his meal before she ever came back to me.  However she was very kind and kept my drink filled (very important to me) and redeemed that number 5 star.    Haven't tried a lot on the menu since this was my first time, but I got the Philly Cheese-steak and fries.  Portion sizes were ample and food tasted really good.  Nothing too fancy and traditional diner food cooked correctly!    As I mentioned I am bias for diners and they hold a special place in my heart because my Grandfather took me to diners as a boy (many many years ago), he loved local diners and he would have loved this place.  I was thinking about him the whole time and our restaurant visits.    If I had any complaints it is only that too many people know about this gem and you have to hit them at the right times if you don't like waiting.  Highly recommend trying them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7NSm_YA1GJWTxYHk41_8Hg"
  },
  "X2u3JP6XDgfUwBu85jHrdg": {
    "date": "8/21/2019",
    "text": "Great food. I had the fried green BLT. My date had the tuna melt. Both were delicious. I ordered the special drink, $2.99 bloody Mary and it was OK. It tasted a little too much like celery. Next time I'll definitely order the $2.99 Mamosa instead. Those drink deals were fantastic!!! I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TmsA6yF8RCYRbSTMHYLUxQ"
  },
  "YjQeBQNM101pt6YFH8_UkA": {
    "date": "6/14/2019",
    "text": "Metro Diner is one word phenomenal! I have been here many times since the opening and I have always has the most amazing food and service. Everything I order here is so good. I had the breakfast club yesterday and I was Leary but it was delicious! The coffee is wonderful too, they have the best country fried steak I've ever had. And then they is this cinnamon roll pancake omg it's heavenly. The biscuits and gravy are like grandma used to make, fluffy ommlets filled with fresh fillings.  They have the best staff everyone is very attentive and nice. If you haven't been please go you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8kjqvDIbyWDmZvStiTc0sw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Grits and cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8kjqvDIbyWDmZvStiTc0sw/o.jpg"
      },
      {
        "img_id": "koyNb0XTLxHTVAe3bc3y7Q",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Coffee",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/koyNb0XTLxHTVAe3bc3y7Q/o.jpg"
      },
      {
        "img_id": "UENqE0t27gU-yoJzp6w01Q",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Breakfast club and hash browns",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UENqE0t27gU-yoJzp6w01Q/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "vV4Rix2h5ZrTBK7FRGLaqA": {
    "date": "7/21/2019",
    "text": "The customer service was average but I was greeted at the door the waiter was very busy felt a little neglected. The food was worse than the service to me. I had a Meat Omelet, the eggs felt and tasted artificial the ham had the texture of bologna or a hotdog and the bacon was over cooked and salty. The hash browns were very greasy. The atmosphere was pleasant quiet and clean. The manager did stop by our table and inquired about our meal. She did offer to exchange my meal. I won't let this first impression deter me! I will try again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jzCHOmZekCz-s8sV01A2gQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Salisbury steak mashed potato, squash and zucchini.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jzCHOmZekCz-s8sV01A2gQ/o.jpg"
      },
      {
        "img_id": "fnHmWQTvkkai0r3f0D4AzA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Meat Omelet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fnHmWQTvkkai0r3f0D4AzA/o.jpg"
      }
    ],
    "user_id": "xQ5zCz7WPVB4PSEvFKLJgw"
  },
  "rpJ_Uq208mhjmMTdUiYbcA": {
    "date": "4/24/2019",
    "text": "We stopped in for brunch on a rainy Saturday. The wait was a bit long and the restaurant was really busy and noisy. You can see the open kitchen and all kinds of plates lined up to be run to the tables. I remember my breakfast being average. The plates of chicken and waffles looked quite amazing yet I did a double take when I saw the caloie count.The service was good and I can see from the wait that the restaurant is popular.  It was ok yet not a place I will seek out when back in the area.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "5l9GugRzua-G12VaolsjUA"
  },
  "aO-eGE3Og34QoBsazewdKA": {
    "date": "7/16/2019",
    "text": "I always leave here so full and satisfied. They have a great selection of both breakfast and lunch/dinner foods as well as daily specials. Their portions are huge.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgkwP0DGGvgfocAKPqSEtw"
  },
  "gtz3-0_wK91n8a32IRYnPg": {
    "date": "8/21/2019",
    "text": "Great place to stop for breakfast on a road trip to the Keys!  They do seve you a LOT of food, so bring your appetite.  Staff was friendly and food was hot, fresh and tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6YHwXp1xWZ7JgszmYQpUPw"
  },
  "CBWBSdG96JseLg326J9ylw": {
    "date": "7/13/2019",
    "text": "The Metro Diner, when we arrived we were welcomed, our waiter was attentive and friendly! I started with $2.99 Mimosas. Those were fresh and crisp! I enjoyed them and highly recommend to all my Mimosas lovers!! Let's get to the food! I ordered The French and fried chicken vs. waffle and friend chicken . I should have gotten the waffle. I enjoyed the flavor of the French Toast yet not the consistency but delicious none the least. But my teammate did order the waffle and fried chicken she enjoyed it. I did taste the strawberry butter and it was very good.  Now, I KNOW why they are famous for their fried chicken, it's DELICIOUS!!! Soo flavorful!!! Definitely get something with fried chicken!! From the greeting when I was welcomed to the food, I highly recommend all to enjoy what The Metro Diner has to offer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dnOEHOtH4sdE1R-WYdITEg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Waffles with strawberry butter and fried chicken!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dnOEHOtH4sdE1R-WYdITEg/o.jpg"
      },
      {
        "img_id": "VQn7xVtJGfA5l5wb5_uFkg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Fried Chicken, thighs were still cooking when food cane brought it fresh from the grease!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VQn7xVtJGfA5l5wb5_uFkg/o.jpg"
      },
      {
        "img_id": "fX4EirGVTnsQ-sDGY_fvWQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Croissant French Toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fX4EirGVTnsQ-sDGY_fvWQ/o.jpg"
      }
    ],
    "user_id": "3ZpbgBek2lGQErMkS4stBA"
  },
  "CiIVOoVSkQl3CdKvq1fL6A": {
    "date": "8/10/2019",
    "text": "Probably my favorite diner. Consistently good food and service. The features (like chicken and waffles) are amazing. I get standard breakfast food.almost every time and on always love it. I could eat here every day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ryFLB4WLRXGC7pQ9jJ1Wmg"
  },
  "YdpzFUq2teS5UAH4cK_uPA": {
    "date": "8/25/2019",
    "text": "I usually love this place but I didn't even stay today. The reason because the hostess was horrible. She couldn't be bothered with our high chair request and treated us like crap and told us it was a 30 minute wait when I saw 3 open tables and a couple open booths.  We then told her we weren't going to stay and she rolled she eyes and huffed.  Glad I didn't give them my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-n_oZSsu8ObAsKWWlXbefA"
  },
  "kxC1IPEMKvYXiyX8_tn-Xg": {
    "date": "6/14/2019",
    "text": "My favorite diner, Lacey the manager are so nice and friendly, place is nice and clean. my husband ordered Chicken and waffle they are so delightful it's crispy, juicy, tasty Southern comfort food. I ordered Huevos Rancheros and it's also delicious. Portions are generous. We will be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_zcTp4sBZduuCLIFSM9YyQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Huevos Racheros",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_zcTp4sBZduuCLIFSM9YyQ/o.jpg"
      },
      {
        "img_id": "WjXuz2r6ZT13z5-EI8mb-g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Chicken and Waffles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WjXuz2r6ZT13z5-EI8mb-g/o.jpg"
      }
    ],
    "user_id": "Rm0PKpq0cTolfatZKaQBug"
  },
  "-vfm02ZcI-7iqrSlFlf0sw": {
    "date": "8/16/2019",
    "text": "The portions are huge and the prices are low. Great place to go if you are feeling hungry. The Montr Cristo is amazing and deep fried. They also have incredible desserts. I have only had a few items off their regular menu because I am usually enticed by the specials they have each time I go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qvcc6ifikSJgVl8B21ApWg"
  },
  "TWXycmIGIBHw8j_mNcJnFQ": {
    "date": "9/24/2018",
    "text": "This chain is actually really good . Plentiful amount of food for lunch and dinner . I like this spot . Staff is friendly and helpful in choosing a meal. Is clean. I got the omelette and it was real good. Also got a big plate of Home fries. Probably could've ordered a smaller version as it was huge.   I'd definitely go here again to try some more choices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QnFAqgoDoPQBnJLkeKRaRQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. June 7, 2018",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QnFAqgoDoPQBnJLkeKRaRQ/o.jpg"
      },
      {
        "img_id": "NhY-zrahm5cbvZ8B_MblXw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Charleston shrimp and grits - really good... this is actually a small portion. Home fries were just okay June 7, 2018",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NhY-zrahm5cbvZ8B_MblXw/o.jpg"
      },
      {
        "img_id": "eM4afpI8ws4IsAQGq64EtA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. June 7, 2018",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eM4afpI8ws4IsAQGq64EtA/o.jpg"
      }
    ],
    "user_id": "JU54PFtLnY-zZweOrxsmvw"
  },
  "FTxyeywp7yEDfEEiEcSCVA": {
    "date": "8/9/2019",
    "text": "Had breakfast here on Monday morning with out of town company. We all ordered something different but all of the food was well prepared and the portions were good sized.  Also the Mimosa's were good.  Service was very efficient.  We will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3dDC1jtLnt726PJoElQ4dQ"
  },
  "5bv3lyNPGMqdGEVUNIEixw": {
    "date": "12/29/2017",
    "text": "Great food but the removing of the Monte Cristo from the menu hurts its rating. Bring it back and I will raise the rating.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JUuL1ZCQY86QDK66nKL_0w"
  },
  "wfSE0XcpIpY4JY1KFf0ZnA": {
    "date": "8/2/2018",
    "text": "We drive 25 minutes from our home just to dine here. The customer service is phenomenal especially if you are lucky enough to have Shavonne or Ashley as your server. The food is wonderful! I recommend their breakfast which is served all day and their Country Fried Steak (a special not a regular menu item, but wish it was). Even when there is a wait, they seat people very quickly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "anAJJraH6da-JjXyCHFBCg"
  },
  "cSSdKO8o_Z-lhEINZ1anpQ": {
    "date": "7/1/2017",
    "text": "The most amazing fried chicken and waffles I've ever had !!! The staff is excellent!! Rashaun and Jewels took excellent care of us and went above and beyond !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SE1nnRjY1lwpRGrwLsIxFg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SE1nnRjY1lwpRGrwLsIxFg/o.jpg"
      }
    ],
    "user_id": "MDv6tRcb-bfuUDU-GXsTUw"
  },
  "DVX6Ina9q7KLCyBvYJeyTg": {
    "date": "11/10/2017",
    "text": "Awesome! We found a diner we can say we love to come back too! Taste just like Brooklyn! Delicious food and great service! So happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IkbpHuciH0SQ_yy39D7Eog"
  },
  "So_v7xWgNy6kQHzvxFgyng": {
    "date": "7/21/2018",
    "text": "Excellent customer service. Prices are amazing considering how big the portions are no matter what you choose to get. Not the biggest menu but everything is very good. Would recommend for any time of day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Twn1sYthN20_Al3Qrn8DjQ"
  },
  "PNJ6nmODQ_NVnPAQUG15hQ": {
    "date": "6/3/2017",
    "text": "Attended their soft opening tonight.  Saw a very dedicated staff pull it off!  And generous patrons supporting the USO.  Had the Charleston Shrimp and Grits.  The grits cakes were crispy.  The sauce was savory.  The sausage and shrimp were generous.  Sat near the expeditor.  Saw a lot of chicken and waffles go by.  The chicken pot pie was very popular.  Saw a batter dipped sandwich that I am going to have to find on the menu.  Welcome to Matthews.  We needed a good local joint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "faWZa2yL6oXJyO5qSybKWw"
  },
  "mSbLDyPFvU8Lkj3B5O3FTw": {
    "date": "10/4/2017",
    "text": "Fried chicken and waffles yo. That's all you need to know. It's going to change your life.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhK03LAwo5pNZQJAWkAAog"
  },
  "ohfOyxyrOgmrI7DbZhjsfQ": {
    "date": "1/7/2018",
    "text": "First time here. Pot pie was excellent/Fish very good. Love the inside and the food was out quick to the table. Food was tasty and priced fair. Staff was very courteous and friendly. Manger came to check on us also. We will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "prH8uUERTM_SBWi89PXZYA"
  },
  "Vw3bShUGRqJfuq0398tQ4w": {
    "date": "7/14/2017",
    "text": "We decided to try this new restaurant in town from which we've heard a lot about, when we arrived it was quite busy the hostess informed us that the wait would be 15 to 20 minutes, a party of 7 arrived probably 5 to 10 minutes after we did;  as we waited and waited for a long long time well over the 20 minutes they said we would wait, the party of seven was sat before us. The food was good my Philly cheese steak sandwich was okay, pretty small though.  Everyone's dinner was okay, service considering it was a service manager who took care of us was I guess friendly, nonetheless I was very upset about having to wait so long and having a party of 7 sat in front of us noting that we were a party of six. I am not sure I will come back to this place it was a very bad experience overall because there was no acknowledgement of why we waited so long, no apology or anything.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B7DW-abvjGLPdbu7cPB5Jg"
  },
  "vOrlbkNVwM00tBAyo2N93g": {
    "date": "8/31/2017",
    "text": "First time at Metro Diner, great choice of breakfasts reasonably priced. I'd certainly come back for more!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tVWh1jhao0eg6w-whl6gkQ"
  },
  "xU6_3AHUTphCbTAocHrFhA": {
    "date": "8/13/2017",
    "text": "Oh, dear lord....this is what we have been waiting for!  An adorable place with a free DIY coffee bar while you wait! They served French toast that must have had 2 cups of blueberries on top. It was so large that my bottomless teenage son ate it for 2 meals. The burger was a half pound and then had a mound of stuff on top! The meatloaf was excellent, the hot turkey plate was bliss but....THE BACON. IT MUST BE ILLEGAL. This stuff has a texture I've never had before. It's thin, which usually isn't good, and its crispy, which I hate, but it shatters like that fine sugar crust on a creme brulee. It's stunningly good - so good that we encouraged the table next to us to order it and they thanked us when we left.  The wait can be long during the after-church hours but they serve breakfast all day. It's old school but brand new and has the best of everything. It's what great diner food should be, which is the hardest thing of all: huge menu options and it all has to be excellent. They succeed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gl2y6Ll00_RJ56CfNK5j8g"
  },
  "0gkrTtLujMsmWsRsLvQ1Lg": {
    "date": "6/30/2018",
    "text": "Omgoodness!! First time won't be our last. Great selection, amazing taste and excellent service! If you're looking for a traditional diner with breakfast, lunch and dinner choices, this is your place! Sit at the bar and enjoy watching the chefs whip up your meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z2TrwhsvRFPd-QgNlJy-FA"
  },
  "TIMUiNhYf66565TzBUlycQ": {
    "date": "12/29/2017",
    "text": "I had my first visit to Metro several weeks ago and it was a wonderful experience.  Kudos to Steven, Lacey and Liz for their excellent customer service and making me feel at home.  Food and service were outstanding.  Keep up the good work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtWWWkuHKp7Af1_s2DGd5w"
  },
  "CFUPlt2vVDE6oOq0yuu98g": {
    "date": "6/20/2018",
    "text": "Cool menu. Love the new dining option. Their specials are quite unique and tasty. Expect a wait on weekend mornings but there are benches outdoors.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XKz4RwBgMPoZYYMGX4nPzg"
  },
  "mdgh_5q2V95sNw9lncgtIQ": {
    "date": "1/17/2018",
    "text": "Love this place! Great good with HUGE portions, that can easily be split between two people. If you don't know what to order, I would suggest sitting at the bar. That way you can see everything enticing! But, I would highly recommend the chicken strips and waffles.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0DTTyxJFpGCgSA2Mf3wxvA"
  },
  "NjgxEvM3Y2zjBaI-QP82_g": {
    "date": "12/18/2018",
    "text": "Went there yesterday for a late lunch (about 3pmish).  Got served a COLD what was to be a Hot Turkey Plate.  Had to send it back, meanwhile the other person is eating their lunch alone.  So consequently we had to eat in shifts watching each other eat.  Practically had to beg for refills on our beverages to the point I got up twice to find my own refills.  So needless to say the service was awful!!!  One would think that since the restaurant wasn't busy the service would be good, NOT!!!  Had to complain to management, which the server should have let the manager know what was going on but I guess if you can't keep the drinks filled then you don't have enough common sense to let the manager know what went wrong at one of your tables.  The manager did pick up the tab which was the only right thing that happened.  WORD TO THE WISE...serve the food at the right temperature, and get better servers!!!!!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7tHZUDURtx7t-xrxpiTTDw"
  },
  "VbXrAtlCOvdyq27sbBJBnw": {
    "date": "6/8/2017",
    "text": "Had a great lunch and the service was super even though we were there on the 4th day they were open.  Had the Eggs Benedict and the eggs were PERFECTLY poached, which is not easy to find. My husband had the Manhattan Clam Chowder and a 1/2 sandwich which was also good.  We will be regulars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFxfwApVYskrIqCaXO-6UA"
  },
  "B0_WqoDqY1U4i2CSPapPLA": {
    "date": "7/9/2018",
    "text": "can't go wrong with anything there. but i always get the fried chicken and waffles and a shake",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aMeG7MyIyQD2_A-RMvNDqQ"
  },
  "34r0lERrgEmvNKXZXJVX1g": {
    "date": "6/7/2018",
    "text": "We've been there a couple times now, and the food has always been very good.  Service can be a little slow at times, but not so bad as to register a complaint about.    One thing I will comment on tho is the interior decoration.  I've eaten both outside on the \"patio\" and inside, and prefer outside ( tho it'd be good if the management could stop people taking smoking breaks on the bench around the corner).  But the inside just looks too dingy to me. I don't know what the owners were striving for in the design look, but it doesn't shout \"diner\" to me at all ... not like the ones' I've experienced in the NorthEast. The checkered floor appears grayish instead of black and white ..maybe a good cleaning would help. The dark wood booths also lend to the cheap, almost dank feel.  More like an old barbecue joint than a modern take on a \"diner\".  The entire inside needs to be lighter and brighter ( I suggest the owners take a look at the interior at Stacks for comparison).     So good food and good people, but please upgrade the inside a little !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTapQZqThBcUPZgfS9qwhg"
  },
  "ASWHZcqeVYJNzASZHScCmg": {
    "date": "4/28/2018",
    "text": "Food is always good here! Lately the service has not been the best - waitress rarely came to refill drinks & bring the check; had to tell another waitress our order at least 5 times before she could get it right. Luckily the food is good & the managers are great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LP05yQGERO7dHPOUa9pang"
  },
  "8Pq6m2EOYj_PiiEkdTDS0Q": {
    "date": "5/8/2019",
    "text": "Really bad experience.  I've waited two weeks to write this so that my thoughts would be correct. We walked in and asked for a specific server that we had in the past and were told that we couldn't have him as he had no tables available  (think metro diner...he's the reason that we came back).  We were settled in the back room which we had once before and is a death sentence for good service as you're out of site and forgotten. My oldest daughters order was incorrect and thus sent back. By the time her order returned everyone else in the party was virtually finished.  My youngest daughter, who is a vegetarian, pulled out an insect on her fork roughly the size of a cooked piece of rice...eyes visible!!  When I showed it to the manager she stated \"...I'm sorry, the staff didn't clean the dirt off of the vegetables properly \"...um, dirt doesn't have eyes!!! I am not a person to cause a seen but when the bill came and we were being charged $42 for lunch (6 people, they didn't charge for either of the aforementioned meals) I was kinda taken back. How did they justify charging my table ANYTHING when a health code was potentially violated?  Very disappointing experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkFBC9wC5o7zL8pvcx4WtQ"
  },
  "PFN4BP2CFOyHHa0c8vuaGg": {
    "date": "10/12/2017",
    "text": "This was my first visit here and I will definitely go back. My food was fine. I had an omelette but would not go for that again. My daughter had chicken and waffles and swore that it was the best ever. Her friend had chicken tenders and Mac and cheese and cleaned her plate completely. I'm looking forward to the Huntersville location that will open soon as this independence location is not convenient for me. The staff was very friendly and welcoming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IdH17rW0NYOXCA05P2dQog"
  },
  "ePh2b1Cljdyg10MS-itlkw": {
    "date": "10/15/2017",
    "text": "I ordered a simple plate of French toast with powdered sugar. The husband ordered the turkey dinner plate and the girls had chicken fingers with fries and the breakfast platter.   To keep things plain and straightforward, I really wouldn't make this place my go to for breakfast or diners overall.   ALTHOUGH, their chicken fingers was light and crispy. Probably if you're craving for some fried chicken. This would be the best option for that. In fact I would recommend their fried chicken over anything else on the menu.   The staff were beyond friendly and accommodating.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x53Dwd0eSh8wuqCI7_fVLQ"
  },
  "uEJZ8Y0Y7HAdffeA5jXklw": {
    "date": "5/31/2018",
    "text": "Fantastic food.  Omelettes are huge and you get a lot for your $!  Excellent for breakfast or lunch. The service is very good.  Highly recommend Metro Diner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdLlIg0aWGkFAtvXyuo6HQ"
  },
  "vR_ADqBlEfVEqUjJK_jtyQ": {
    "date": "7/7/2018",
    "text": "This is a great diner. The veggie wrap is awesome. I add chicken in mine and put the chipotle ranch on the side because it can be spicy with the fried jalapenos. I definitely recommend trying this place out. You can dine in or do take out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cv4c3mUZn1z6IhoOc18t4w"
  },
  "RNroAqZgqlNa8EnVdKHhoA": {
    "date": "10/8/2017",
    "text": "I have been a loyal supporter of Metro Diner in Raleigh for some time now. I am happy to have one to enjoy in the Charlotte area as well.  Our server Taylor was beyond awesome from drinks to check (and beyond when I forgot my box of leftovers)! I love the breakfast offerings so much that I had yet to go beyond that section of the menu. Today, I finally convinced myself to try the other side. Ok, so I didn't completely step away from my fave type of food because I ended up with the breakfast burger. This ain't your typical patty with an egg on it. I was presented with a monster on a bun. The meat was well seasoned and cooked to perfection with a nice char on the outside. It was topped by a slab of cheddar, crispy hash browns, thick cut bacon, and a freshly fried egg. This burger was beautifully made and that 1st bite made me wonder what else I've been missing in this place! I wish I was exaggerating the awesomeness of this burger. My lunch date kept giving me side-eye with all of my exclamations of delight with each taste. I pride myself on trying new things but this may become my first \"usual\". As good as it was, it was too big for me to finish. The point is, have a burger. Better yet try everything because I've never had a bad bite in this place! Bring a date, the family, and your appetite this is it folks.  Service 10/10 Food 10/10",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RUehcICitpHeW7kzukyX9Q",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Breakfast burger. Best I&amp;#39;ve ever had!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RUehcICitpHeW7kzukyX9Q/o.jpg"
      }
    ],
    "user_id": "kKmHOAMkjnYiKwPTxXSIJQ"
  },
  "RuSHRGW7FqLKIPE4F6OXBA": {
    "date": "4/12/2018",
    "text": "Decided to try them out through Postmates. The time it took to get my food was about an hour, which isn't bad considering was lunch time. The food was delivered and it was neatly placed in containers, and they provided lots of condiments without me even asking. The pancake was huge and I struggled to finish it all. But overall the food was good and I am satisfied! Will def order from them again or visit the restaurant. Prices were good too for the amount of food I got.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "siwgZVyeYDTa29x-uMSEJw"
  },
  "RyuNIRcgONm-YFFC_pSxPg": {
    "date": "6/16/2018",
    "text": "This was my first time here and I came with my grandfather. We were greeted right away and sat down. Amazing service. Not sure exactly what our waitress name was but she had red hair and she was very helpful and made sure we had everything we needed. This place will definitely see me again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3WUGJMjEYH2_8cTtIsE-6g"
  },
  "1QQYLzH7orjIyvtJElIPoA": {
    "date": "10/1/2017",
    "text": "Just had breakfast at Metro Diner - our first time here, and we were not impressed. I ordered classic eggs Benedict. There's a whole menu for them so I thought I'd be good. One egg was way over cooked, and the other was way under. How does that happen? The hollandaise was bland, the English muffin was stale, and the tiny piece of Canadian bacon couldn't save it.   My husband had a croissant breakfast sandwich and did not enjoy it. He also said it was stale, with fake cheese, and bland. He got a side of fruit thinking at least that will be good. Nope. The fruit was frozen solid, and he could barely eat any of it.    Next time I'm going to suck it up and drive the 35 minutes to Cafe Monte for a real, good brunch experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCzrUaqLIIyVo-p40K78iQ"
  },
  "xflYRRumzyhi5W4EoIOaOg": {
    "date": "3/10/2018",
    "text": "Consistently tasty comfort food. Not a foodie place but it is great for families. Try it for brunch or a quick early bird dinner. You wont be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "PWc-hPWo4Qv-xd0Spyrk_Q"
  },
  "DdInmDjw7zr_4tViwwEd5A": {
    "date": "6/30/2017",
    "text": "Man... I truly wanted to like this place. It's so close to my home.  Arrived for breakfast, around 8:30a. There was hardly no one in the diner. The place was so cold, my husband and I almost turn around and left.   Place was clean..wait staff was ok. Couldn't believe we waited 40min for two egg sandwiches which was just meh!! I hope this place gets better. It's so close to home!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQ2Awk8RVhJmOzrgcr-Haw"
  },
  "wBv3w0szqQhzC7NW9F0lzA": {
    "date": "12/11/2018",
    "text": "Really like Metro diner. I have been there several times. Food and service is always good.  Really like you can order anything from the menu anytime! My spouse can get breakfast for dinner and I can get dinner. Something for everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewzsGnVGezG2OOrNbOxe9w"
  },
  "TMWCkIveMjEIG5F9TDDZvQ": {
    "date": "10/31/2017",
    "text": "You come somewhere and have phenomenal food and think it might be just an exceptionally good day, but THIS PLACE IS AMAZING!!! It's clean, they're friendly, great prices, and the food is just beyond!! Short waits (less than 10 minutes) each visit, but there's a reason this place is busy!! Check it out!! The Shrimp and Grits are on point!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OVyOGJJv3doZqWMgmYOymw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OVyOGJJv3doZqWMgmYOymw/o.jpg"
      }
    ],
    "user_id": "lBxjoWSTEjfw4CEoNGKxfQ"
  },
  "XM2JgOHRQNnNSWRdEjmdpQ": {
    "date": "6/18/2017",
    "text": "Having frequented the other metro I came in with high expectations.  Perhaps too high.  The food took forever to be brought to the table.  I watched our meals sit at the window for almost 10 minutes.  We were brought three of the four plates, at different times.  The person sorting and distributing seemed overwhelmed.  We had to ask for the fourth plate as I watched it sit at the window while other meals went out around it.  As a result the food was just meh.  My yohala was super soggy, the grits were over cooked and the pot pie was dry.   I'm not sure if sitting at the window contributed or not.   Hoping this is just opening pains as this location is much closer than the pineville one.  Will update the review the next time I frequent this location.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "bqhfMozc8Wp1ty_zDOis_w"
  },
  "s08rFwcu2NDjnq2ByVeXrA": {
    "date": "5/1/2018",
    "text": "I was a fan of this restaurant, but when hubby saw the cook drop a plate which broke on the cook top and the guy didn't throw away the food cooking on it, we decided not to return. Hope no one wound up eating a ceramic shard. Yikes!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jq-QdONgPAc_CMmNDlVvRQ"
  },
  "SlcK9KFYUll80j0w-ilXlQ": {
    "date": "6/4/2017",
    "text": "Excellent experience at the soft opening this morning! The huevos rancheros were like nothing I've ever had before!! So delicious and full of flavor! They were BOMB!! The chicken and waffles were just as tasty! The fried chicken was super crispy and the waffles were scrumptious with that strawberry butter! I can't wait to go back to try more menu items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YWNAjOtQQnzfRli66OscBw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YWNAjOtQQnzfRli66OscBw/o.jpg"
      },
      {
        "img_id": "WpL8-v8N_KlfvPeDz_Y7ng",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WpL8-v8N_KlfvPeDz_Y7ng/o.jpg"
      },
      {
        "img_id": "RT-rjTpCxto3ukVtUF4mLQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RT-rjTpCxto3ukVtUF4mLQ/o.jpg"
      }
    ],
    "user_id": "p4F_uIXRf4mmdR6SX2RxgQ"
  },
  "qw1vwiGcpCU8AF5kLCjd3g": {
    "date": "7/5/2018",
    "text": "Went there for breakfast for my wife's birthday, a few weeks ago. Nice and fast service !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "foW4KX4J_wFt1B4-ai7bNQ"
  },
  "2kj6E2Jeii0zpb41ZOnyfw": {
    "date": "9/16/2017",
    "text": "This is my and Daughter favor Breakfast diner in Matthews NC. Great customer service and friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0R_fcldJ0YeG3vrXACcyUQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Great restaurant and great prices for your buck. Corned Beef it&amp;#39;s my favor dish with pouched eggs. Clean place and friendly staff.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0R_fcldJ0YeG3vrXACcyUQ/o.jpg"
      },
      {
        "img_id": "lUlnI1fRCPQV_nZrw4ID1g",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Best Corned Beef Breakfast in Matthews NC, great prices plenty of food.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lUlnI1fRCPQV_nZrw4ID1g/o.jpg"
      },
      {
        "img_id": "TzwHsoBooiq1Hcjk8GrBPQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Best Breakfast, Lunch and Dinner @ Metro Diner in Matthews NC.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TzwHsoBooiq1Hcjk8GrBPQ/o.jpg"
      }
    ],
    "user_id": "1DLp9XsxOSkXjQ3yOCN6xw"
  },
  "zsDKON9jUSjifVA_HBbsBw": {
    "date": "8/16/2017",
    "text": "Unfortunately went for lunch with a large family about a week ago- ALL of our meals were mediocre-  Went another time, but this time for a simple breakfast.... bacon - eggs and some straight out of the bag potatoes  This will definitely be the final time. *how can anyone mess up breakfast?....  well, they found a way.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZG1ehjxvsEDGkCwzS2y1aA"
  },
  "3GY8zxW4x7nUqU8mJUe6-w": {
    "date": "6/3/2017",
    "text": "After only being in the building for 4 days the Metro Diner team on Independence did an outstanding job. From the courteous host to our friendly and efficient waitress the service was great. The food came in a timely manner, in large portions and tasted great! There will definitely be a second time visit in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "DvC3ua5_IGWui-4g05bYlw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DvC3ua5_IGWui-4g05bYlw/o.jpg"
      },
      {
        "img_id": "YwWmuQEk5Pv1JHahuLKvhQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YwWmuQEk5Pv1JHahuLKvhQ/o.jpg"
      },
      {
        "img_id": "1bqgX-dW-jjUJdlKg3k25w",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1bqgX-dW-jjUJdlKg3k25w/o.jpg"
      }
    ],
    "user_id": "zWfEQR7hXOrD02DEuNeGTg"
  },
  "4Jf0bhZsSZpv-dEO54-48w": {
    "date": "7/2/2018",
    "text": "The chicken. & waffles are really Good! I been here a few times but always got the chicken. My guest got the meatloaf & surprisingly she really liked it. I guess next time I will branch off & try other things! Lol.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0-inO_AgRUjkdRfSiS07A"
  },
  "7hhwz43fhynBvMVu3F7e_w": {
    "date": "3/18/2018",
    "text": "Was great first 2 times, has started to fade. Service is great except lately my orders have been missed miserably. Dishes come out at different times, so not all members eat together.  Have started looking for another go to plac3.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tI5zrmPe5-sRqdE8iSl4yw"
  },
  "-4dLS_5sVTU7HJgyTkNFWg": {
    "date": "6/29/2018",
    "text": "Surprised at how good the food is here.  We have had the chicken pot pie, monte christo sandwich and various salads.  The wait staff is very attentive.  I think it's definitely worth a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0R17nyHQ9SiqQjtnsP33g"
  },
  "dEqPXkRFV4NGQcLMh-dK0w": {
    "date": "6/18/2018",
    "text": "I came to Metro for the first time on a Saturday afternoon, we didn't have a wait, and a very friendly hostess sat us at our booth.  They have a menu with a lot to offer, you can even order breakfast for dinner, watch out IHOP, they also had specials on a board in addition to the menu. I chose the Bold City burger, delicious!  How could it not be?  A burger with a sausage patty, yummy!  I also ordered mixed veggies for my side which were very tasty, better than expected.  I ordered the peach tea and it was also really good. My boyfriend had the Fried Chicken plate, and the mashed potatoes were sooo good.  He also got a huge portion of food, 4 pieces of chicken!   My friend ordered a special which was shredded pork on a cornbread waffle, I tasted her waffle because being the Southern chick I am, I love cornbread,  and I loved that waffle, I could make a meal on that alone, but wouldn't want to because there's too many things I want to go back and try. I really want to go back for breakfast one day.   This restaurant is one of my new faves.  Give it a try, you won't leave hungry. The waitress and staff are also very friendly here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "re5MQkw-ezG6Oj0LHwoITg"
  },
  "_1joQIamj_kr4dKk57PThQ": {
    "date": "8/17/2018",
    "text": "What a great Diner! Everything cooked perfectly to order. Staff was so nice and welcoming. Clean and full of great smells. Will definitely be back here again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pU5_Q0304DK3stWI_mAVYw"
  },
  "lKziOTswGO2M2DwS6GeS_Q": {
    "date": "8/6/2017",
    "text": "Just ate here with my parents and what a great choice we made ! We got a side of onion rings as a quick app and they were perfect! Not overly battered and were excellent ! Please note, we had already devoured 2/3 of the onion rings before I took this pic! So Plenty for us three! Entrees: American burger with bacon- excellent and huge  Pot roast - perfect according to my dad who couldn't but half  Fish and chips - my mom said the batter used was tasty and she would review her whole meal, slaw included as excellent! Service was great! Friendly hostess who took care of us right away, and our server Liz was just as delightful and so wonderful the entire time ! She was so pleasant and offered advice that we followed and weren't let down. Will be back and hope to try the breakfast items next time! thanks MetroDiner. Matthews is thankful you're here !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4b47MpCKqdyoXex0Emp_9A",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4b47MpCKqdyoXex0Emp_9A/o.jpg"
      },
      {
        "img_id": "sZfcjB0-IFRbFtvtdRXy-A",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sZfcjB0-IFRbFtvtdRXy-A/o.jpg"
      }
    ],
    "user_id": "WdA1hUpAXrNAPxfaejU69g"
  },
  "95KySaA0f8vxXEn9hwyE_g": {
    "date": "10/19/2018",
    "text": "My Mom wanted to eat lunch here for her birthday. The food was very good. I will definitely be back to try different menu items. The best part of it all was our waitress, Shana. When you get there, ask for her and then order a mimosa!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "krQ8WngTuqske4EKpovlUw"
  },
  "_ZgpKJFphIFuAa6BUlSqTg": {
    "date": "1/1/2018",
    "text": "Stopped in for a late breakfast on a cold morning with a group of five. Portions are large and quality of each item was excellent. The daily specials were all appealing and my wife especially liked the spicy chicken Benedict. I ordered the biscuits and gravy which were the best I have ever had. Our server was attentive and courteous making regular coffee/juice refills. We will definitely be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "doTTY1rIYJ2dy3bLCorrEw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/doTTY1rIYJ2dy3bLCorrEw/o.jpg"
      },
      {
        "img_id": "vm3ew6bthGN1hB-Il3mCFA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vm3ew6bthGN1hB-Il3mCFA/o.jpg"
      }
    ],
    "user_id": "AjJDBt5fpPTIDpcul6DQcg"
  },
  "qkeiI5OPlrerwMnrdtyjlA": {
    "date": "9/9/2018",
    "text": "River City Hash! Yes! The perfect platter full of bite sized fork bait. It is nice to not even question where you want to go eat, for a meal out. Our wait was slightly longer, at the very popular time we arrived, this Sunday. Well worth the pause before dining, in this comfortable environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AHTHY2Sp3lN0N66aWBgH6g"
  },
  "uHXEpDJMhLDxBGTpM0qcWg": {
    "date": "1/15/2018",
    "text": "Well, The Cali girl in me was really looking forward to trying their version of chicken and waffles, however, we were greeted with the standard glass of water with a side of pure filth! Yep that's right, they gave us \"dirty dish water\", literally(picture attached)! Unfortunately I immediately lost my appetite and could not stay or bring myself to order anything.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OLLggtgUqHqILwZ3qwUMLw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OLLggtgUqHqILwZ3qwUMLw/o.jpg"
      }
    ],
    "user_id": "JKH4VQ1G20gcVTR9KJqEsg"
  },
  "2NeTrHHm_RdBAlJ0rBDybg": {
    "date": "10/5/2017",
    "text": "Listen, I don't just give out 5 star reviews. You've got to earn it, baby! I legit tried to think of a \"con\" to our visit, and there really wasn't one. Everyone at our table loved the entree they ordered- not a small feat. Our table had the pot roast, meat loaf, chicken and waffles, and protein breakfast. Hands down, the star of the show was the chicken and waffles. They give you half a chicken that is perfectly seasoned, perfectly fried, and perfectly juicy - even the breast! Dip it in the maple/hot sauce that the waiter mixes for you, and you're in chicken fried heaven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "fu9T49AULWFBwVwUfLulsw"
  },
  "7cotYWYDrOuOCDUIE-1uDQ": {
    "date": "11/11/2017",
    "text": "Went for breakfast during prime time on Saturday morning. We were told it would be a 30 minute wait, but it was less than that. We were seated in a huge booth in the back which was nice considering it was just two of us. The coffee was delicious, but it took a while to get a refill. The food also took some time to arrive, but the waitress apologized for the delay and said they usually aspire for an 8 minute turnaround. My Greek omelet was tasty thanks to the olives, otherwise it would have been bland. The potatoes were a tad bland, but they were nicely cut. The pancake was thick and satisfying. My husband didn't care for his huevos rancheros because he felt there was too much going on. He would have preferred a simpler take on the dish. Overall, we had a good experience and will return.  My husband ordered a pumpkin cheesecake to go which looked really good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kvHSzOldiV4CnvL8WANaQg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Pancake we shared",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kvHSzOldiV4CnvL8WANaQg/o.jpg"
      },
      {
        "img_id": "eI98b9i_HR9C8VDzb5zxwg",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Greek omelet with feta cheese, spinach, tomatoes and olives",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eI98b9i_HR9C8VDzb5zxwg/o.jpg"
      }
    ],
    "user_id": "A56Cmt5_UvYAL8wZS8zOBw"
  },
  "TzDlNBY5zhoLyOvhIr4lGQ": {
    "date": "12/17/2017",
    "text": "I am loving this place. I've been there twice and so far they have not disappointed. They have a different twist on their huevos rancheros, they are a must try! Great service too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bk-6pjBNZQTcnpBNSTJ1lw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bk-6pjBNZQTcnpBNSTJ1lw/o.jpg"
      },
      {
        "img_id": "yRfB08LPSNtclE_3mCxRYQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yRfB08LPSNtclE_3mCxRYQ/o.jpg"
      }
    ],
    "user_id": "J2DTTrogyWfWe4VLHVvZcQ"
  },
  "x5-jBqyB1rgsststXE73NQ": {
    "date": "1/5/2018",
    "text": "Today was my 5th but far from last visit to Metro Diner.  What do I love about this diner?   Breakfast!!! The waffles, omelettes, biscuits and gravy! Also they have mimosas and a special flavored coffee of the day  The service is some of the best I've ever seen in Matthews. Friendly, attentive, and very quick to follow up on drink refills ( I mention the latter because I hate to run out of my tea/coffee ). The diner is almost always full, the food comes out within 15-20 minutes of ordering and always hot. The tomato bisque soup needs to be in a store shelf so I can buy it by the gallon!!! It's really that creamy and delicious. And don't get me started on the portion sizes , Yowza!!! I just automatically ask for a to go container because there is no finishing any of the dishes I've ordered. Sunday's seem to be the busiest day with a wait, there is also a nice heated patio to take advantage of during the busy times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4O71tI5GrwXxu775zt_7sw"
  },
  "GSdS6-fSxGN2iXkzeqoPpQ": {
    "date": "8/14/2018",
    "text": "Wow, great place with great service!! My waitress, Alicia, was great with checking in on me, being quick with everything, and made sure my order was done right / I was enjoying my meal! The manager, Katie, stopped by my table twice to see how I was enjoying my meal and service as well! Both ladies were super sweet and professional. I got the Holy Davoli burger and... it was delicious! My only complaint is that I got too full! Haha they give you massive portions and it tastes amazing. 10/10 would recommend and I will definitely be coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hyfHwgetCrTcM6XcmRgweA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hyfHwgetCrTcM6XcmRgweA/o.jpg"
      },
      {
        "img_id": "LftqntIz-68XOm3TXbBllw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LftqntIz-68XOm3TXbBllw/o.jpg"
      }
    ],
    "user_id": "LQQxgNn_nqB_6kb4oL3efw"
  },
  "sWm7avZWS4qIYMNV5DQFJQ": {
    "date": "9/22/2017",
    "text": "I'm always here but tonight I saw an exceptional waiter. He was't our server but I wish he was His name was Darius! He mesmerized me with his Quick Service friendly attitude and infectious smile. Coming from a family of restauranttours, customer service is key for me. Our server wasn't a bad server either. Our food was great as usual and I tried something new tonight. The \"pot roast\" and my daughter had the delicious shrimp and grits. There was a bus boy that was incredible doing his job. Sometimes as customers we overlook the smallest things, but I pay attention to details and that was a detail that could not be overlooked. Overall we had a great experience.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-NtQ1dUCbYh1jbYcugP1ZQ",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Pot roast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-NtQ1dUCbYh1jbYcugP1ZQ/o.jpg"
      },
      {
        "img_id": "Z4loA0fSaN6hEaofrpqyew",
        "caption": "Photo of Metro Diner - Matthews, NC, United States. Shrimp and grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z4loA0fSaN6hEaofrpqyew/o.jpg"
      },
      {
        "img_id": "ToLRSYbsnOLVGe6bvdP-sw",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ToLRSYbsnOLVGe6bvdP-sw/o.jpg"
      }
    ],
    "user_id": "OhsCg_yTTSUiRvkTGiPyog"
  },
  "wAsvdwlqRrkXfpUT3ftzYQ": {
    "date": "2/7/2018",
    "text": "I walked in at 7:45 pm or so and the place had a good number of people in it.  I didn't realize that they closed so early (8:00 pm Sunday - Thursday) until after I ate and walked out the door.  Makes perfect sense though, looking back at the body language and cues from the staff. It seemed like they were hoping we'd leave and not order anything, as it took a fairly long time for someone to come over.   Our server was nice and smiley (pretty much the only one there that was) but it was clear what was up when we took our first bite and our bill came.  They also ended up seating a family of 5 with a baby well after us so I'm not sure what the rushing was all about.  I also never got that water refill...  My rueben was just ok. It had bits of hard boiled egg and pickle relish in it.  That is fairly odd and not even listed on the menu like that.  I haven't ever seen those in a rueben and hopefully never will again.  (Edit-big bits, more like chunks of egg whites and yolk.  Not very appetizing and the whites were sort of chewy. I know there are lots of recipes for dressing but I will still stand by my opinion of it not being typical to have chunks of egg on a rueben.) The salisbury steak was good though.   This was actually my 2nd visit but there is definitely an \"off vibe\" at this place.  The first time I got a chicken salad sandwich and tomato bisque.  Some of the chicken was big, dry and chewy and the soup was too much like jarred pasta sauce.    It probably would have been better if they did turn us away this time.  Two strikes is enough for me.  I doubt I will ever be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XCztSSaUdYSf1yk2b1Ta-w"
  },
  "ImUngy22g9azZssbXFNLyg": {
    "date": "7/9/2017",
    "text": "The good - good food, fresh ingredients (ex. hand chopped potatoes for home fries, fresh jalapenos) , great portions, nice job on the interior remodel - can' t even tell it was an Italian restaurant before at all!   The not so good - freezing inside and a bit pricey for breakfast. Waited 15 minutes for one of three tables outside. $10 for a BLT. Wait staff also seem to still coming up to speed on the job on prior visit, but much better second visit. Pleasant service from Ashley.  Can't wait for remaining kinks to be worked out and happy to have in Matthews.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_q_Kgbub1-Ind2t2IIPBRA",
        "caption": "Photo of Metro Diner - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_q_Kgbub1-Ind2t2IIPBRA/o.jpg"
      }
    ],
    "user_id": "K7W2725p70G29t_MGRwicA"
  },
  "PrChi6A3KcdPm2syA-6AAQ": {
    "date": "3/27/2018",
    "text": "A Metro Diner..I had heard a lot about the Monte Cristo sandwich that they had served at one of the other locations. So we came looking for that treat but it has been taken off the menu. I wish they would put it back on because it seems like most everything they make at this location is really good. We had a fairly large group but they accommodated us very quickly.  I was sad to see that the Monte Cristo was gone but I ordered the Chicken and Waffles which was really good. It was crisply fried chicken and nice big waffles and lots of spicy syrup and some strawberry butter. I ordered hashbrowns on the side and they were terrific! My husband had the Bacon Mushroom Swiss burger and it was a good juicy burger also. I ordered the Peach Unsweetened Tea. It was a nice clean diner to eat in. I would go back and would love it if they added that Monte Cristo back on the menu that I heard so much about !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "iYahFU35zgbgx14Riz_3Qw": {
    "date": "5/26/2018",
    "text": "Busy but yummy. We waited a while (weekend morning) but food was delicious & server was entertaining and excellent. Will go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYRToAMsYqIoW6ii5WJcdQ"
  }
}