{
  "AiswCnsuW0MxhUBeY1gBQw": {
    "date": "12/15/2016",
    "text": "12-14-2016 First time at Chili's.  If this is suppose to be predominately upscale Mexican restaurant-YUK!  Salads and dressings are very good and the wait staff very friendly hence 2 stars). We also had cheese enchiladas (totally tasteless-have no idea what kind of cheese it was), the lime rice-way, way too much lime-almost bitter, black beans were flat tasting, beef tacos tasteless, and chicken enchiladas were also bland. I know they offer other food but Mexican was the majority.  We would prefer a greasy spoon authentic Mexican restaurant than overpriced bland crap.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vIv5wMdzpP0B5wngNz99HQ"
  },
  "jKEgxxirjUow5rCBlmmhZw": {
    "date": "3/13/2016",
    "text": "Food fine, service terrible. The restaurant was not busy but waitress sullen, bordering on rude and upset for some reason. She evidently had trouble with another table as somebody else handled their check & she loudly stated she was not going to clean it. She then waited on us, brought drinks wrong, never offered refills, and we had to beg for check. Not the first time I have had trouble with poor service. Again food fine & I will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Yg-8IYNilKfUcLQDG9Drw"
  },
  "Sl_APV-OJmhoTY04NGSXqw": {
    "date": "1/16/2015",
    "text": "1/2 rack baby back ribs with smoked potatoes were good restrooms were clean. Service was OK but our waitress while pleasant was rarely seen. The new sour cream dip was to die for! Also tasted the Cajon grilled chicken pasta with extra toppings was also very tasty",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQyITVf5zdSCo-uvyFqrSQ"
  },
  "mJrOM4l5dC96_6NKzUdUwQ": {
    "date": "12/26/2013",
    "text": "We have eaten at this Chili's location at least a couple of times a week since it opened.  When we go to Chili's, my wife likes to get a couple of mixed drinks.  In fact, the only time she drinks alcoholic beverages is when we go to this Chili's (and when we go on cruises).  Apparently, in the last few weeks, either the bartender (Doug) or management has decided that they were not making a sufficient profit from our visits.  The drinks have become watered down, and we are choosing to buy shots on the side to make the drinks of decent quality.  We will probably choose to eat at this Chili's less frequently, if not altogether.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bbt5U8EGxvPNi1mxJlQvKA"
  },
  "cA8gXWGIYjwZJY5--MJF9Q": {
    "date": "4/19/2014",
    "text": "As my place of work is nearby, I often eat here after I get off. The wait staff is very nice and personable and I've only had one so-so experience. The food is cooked well, and the prices are good. I will continue to come here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LfFYKs3pAt7G4jNK2dV17w"
  },
  "oH_0qihdxSQ5J64h5qWDDg": {
    "date": "11/25/2015",
    "text": "I've always been a big fan of chili's. Pretty good for the most part and a great value. 50 bucks at this place will buy you a lot... But, I was there for lunch earlier this week, and even though the food was very tasty, the utensils were absolutely filthy. I still ate my food after I tried to clean each, spoon, knife and fork with melted ice from my drink and a napkin. I will be back many many times because of the value, but hopefully they will improve the cleanliness on the silverware.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUrPOS9ULwXzqgLudxy6hg"
  },
  "AC3yfjHhUVWo0mhoM6oPPA": {
    "date": "9/5/2015",
    "text": "WOW....not sure how I can say this OTHER THAN receiving the worst customer service and chose to make it extremely clear by leaving zero tip. 3 days later I found my waitress had added herself a tip. Called and spoke to a manager who pulled my original ticket and saw the increase after the fact. She was horrified and eluded to this was a terminable offense. I am going to file a police report as well for fraudulent activity. How stupid can you be to lose your job over $1.56??? Keep your receipts and watch and balance your checking accounts. I hate to think how many people she may have scammed!! Shame on her!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iCSeNEyvnC7ddbLHBG1f0Q"
  },
  "124ytou5l55154uS2CzA5w": {
    "date": "9/18/2017",
    "text": "We haven't been to this Chili's in a while due to issues with poor meal service but we gave it another try today after about a year. Well, fool me once, shame on you. Fool me twice, shame on me. I don't know if it was understaffing or just not caring but either way it was unacceptable. No one seemed to be in a hurry, if they were understaffed. In the two times I went to the service area to refill my family's tea, I could see servers chatting in the back. No rush. Our server never refilled our drinks (walked by numerous times without noticing and my husband had his water refilled at the bar). I had to remind him two times for certain things, got my family's (and the table next to us) napkins since our server was MIA. Poor service. Food was good, so I did give a star for that. I didn't finish it all and after waiting around, got my own to go box. Never an apology or anything. Maybe the management should go next door and get the Chick-fil-A managers to do a little service training. We will not be back and I guarantee the same goes for the 3 other tables around us.  Management needs an overhaul and if they are short staffed, needs to light a fire under some servers or at least show some hustle.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yvzydgCYMmzDiNVQwKm7Dw"
  },
  "DrMkAih53eOGT-rbnns09w": {
    "date": "3/29/2017",
    "text": "This is the third time coming to Chili's and Everytime I have come here I have had raw food served to me. The first two times were the honey Chipotle chicken crispers then the guacamole burger. I loves Chili's but after this I'm done every single visit it takes so long for food to get here then gotta wait again because  my food is raw and has to be remade. Then telling a manger and trying to dispute that \"we have new patties that are pink\" I get that but meat is meat. Meaning if your using REAL meat then it will be pink, but if your trying to tell me or say to me that your new patties are pink does that mean your not using real meat?! I think you, Chili's should do better I KNOW you can do better you used to BE better. Very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UZmSQOG-ga7Xc-4tC7-C0A",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UZmSQOG-ga7Xc-4tC7-C0A/o.jpg"
      },
      {
        "img_id": "GMoAlpNSVg-V0p_tpOw4mg",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GMoAlpNSVg-V0p_tpOw4mg/o.jpg"
      }
    ],
    "user_id": "YClFzY5C4mXqiqdBOnLDVg"
  },
  "gS1nBXqJfqMJQN5HCqwyjg": {
    "date": "7/29/2015",
    "text": "For taking order they took 30 mins & had to wait for one more hour to get the food!!  Food is average and definitely not worth a wait!  Waitress changed in between to hanover to another one!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSv-Wihg569yFUj1Tvk_AQ"
  },
  "gHaXCzdwIuUk5odXaMF8fA": {
    "date": "11/17/2016",
    "text": "Decent food and good service. Step above many of the other Chilis we have been to   Fajitas were delicious.  The waitress did a good job and was attentive.  Love paying at the table so we can leave when we are ready.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "udqBIDdj7v8etVMV2_soVw"
  },
  "jfHYEW1oMWRHTQFaczTQkg": {
    "date": "8/23/2016",
    "text": "One of the best chillies I've been to. Especially in North Carolina, very friendly staff which is a total plus to me! If you are sitting at the bar ask for haley, stacy or Doug and tell them John Sent you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOWlt_27s4YoD1xATtqy5A"
  },
  "cYOXW-PQwp3lQ5ewmsy_DQ": {
    "date": "3/14/2013",
    "text": "First time back to Chili's for lunch in many moons.  Wow have things changed...for the better all around.  Great lunch menu that would satisfy anyone.  We were really impressed and the children's menu was very extensive with a wide variety of mains and sides.    Clean, great bar, super service and management kept checking on our table.  They have come a long way and it is paying off. Don't delay your return...it will be worth it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "6KZ1RhJxd7-Kjv94dhiT2Q": {
    "date": "10/30/2017",
    "text": "We stopped in at about 12:30 today hoping to get lunch. We stood at the host/hostess station for about 5 minutes while the on-duty host ignored us. He was busily conversing with a couple at a nearby booth and totally oblivious to the two couples waiting to be greeted and seated. We did what we always do in this situation; we turned around and walked out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MJwmZ4PtU3jrWc_0uBLAcw"
  },
  "ebgOMtjqgxd6EdGZK0jSCw": {
    "date": "6/4/2016",
    "text": "Worst Chilli's I've ever been to. Our waitress came to our table once to refill our drinks, our food took 45 mins to get to our table and one of the orders was wrong so we had to wait another 20 to get the right order. The manager did not come to our table once and it was just an awful experience. I'm a huge chillis fan but after this experience I will never go to this chillis again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J_uF9t_mPorJ0QsvM4B7AQ"
  },
  "JPYF1qvN0oxDO2ZuzrSfUw": {
    "date": "12/29/2016",
    "text": "Got to love those flatbreads! Shame they stop doing fish tacos though. For that I am only giving it 3 stars. Do stop in often. Always pleasant staff and good service.   Update on service. Walk out twice due to bartender completely ignoring me. Once waited 5 minutes without an acknowledgment that I was there. Clearly the to go customers has priority.   This happened not once but twice. Doug the bartender should be fired. Will never go back there again. Bar service sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyC9doXZndrdKBr7CdUWhQ"
  },
  "kpI5NI0XgZ_zOulPhwSmtA": {
    "date": "5/12/2016",
    "text": "It's always slow everyone I have come. Around 6 tables and waited around 45 min for food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8b8-f-sPoKFJdrVxNmb3JA"
  },
  "Sr4dRlI9TxxwNO07OFy7tw": {
    "date": "6/17/2012",
    "text": "Here's my letter to Chili's via their website:  I stopped by Chili's tonight for a dinner with my friends. We were taken care of by Thomas H. (I believe the first name was Thomas). This has been my best Chili's experience far and away. His brother taught me high school math, so I knew who he was. He noticed my MSU Spartans shirt, and we chatted about Michigan and his brother. After placing our order, he brought us chips \"just because\". It's small things like that that make me want to come back to restaurants. The food was pretty good, but the check really surprised me. He made my friend's salad a side salad on my course and even took off our drinks. He also made sure to stop by several times and refill drinks and ask how our food was. Wow, what an awesome guy. Needless to say, he got a pretty big tip from me.  This experience alone has made me want to frequent Chili's. It's people like Thomas that help a business thrive. Far and away the best service I've ever had.  ____________________________________________  Totally above and beyond. 5 stars from me.  Update: After writing to Chili's, they sent a letter in the mail along with $10 in free food. Class act.  Update: Food and service have taken a dive. -2 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABRH3A37M24GrCR3-bX1Pw"
  },
  "umxLc3NGiJbo55d9jf5A0g": {
    "date": "4/1/2012",
    "text": "This is the best Chilis around. I am addicted to their chips & salsa!  Should you eat in they will refill it as much as you want- their chips are so thin & crisp unlike any I have ever had. & like mentioned before bag you up some to take with you.   I always get the Cajun chicken pasta- love it!! I get extra everything in it- I like a lot of sauce on mine & seems they never put enough. The portion is large!   The 2 for $20 is a great deal for dinner! The lunch specials are great prices also.  I do not however like the ribs- the one time I had them they had a False smoke flavor, were dry & the sauce wasn't my taste.   We normally get takeout that way we can sit home in our jammies in front of the tv watching a movie or 2 ordered from online like Netflix etc. (if ordering a steak for pickup have it under cooked so it will be to your liking once home & re-heated)  Also I love the ease of placing my online order to go with my smart phone app, which if you like them on FB or sign up for emails you can get some awesome coupons!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "VbfaQcyRqSZ0rGvhgg-3Fw"
  },
  "0byU_WZ5Mfp0hyJNzCapqw": {
    "date": "8/10/2016",
    "text": "I ordered the ribs with a special they had going on about a month ago. The ribs were great and everything that came with my order was good. I have no complaints and our server was excellent as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EG0uh7vWOlU0_QSaFxPNCA"
  },
  "-SAm2hdZ6kMQddRyEJV2HQ": {
    "date": "5/2/2017",
    "text": "Do better!! 87.5 sanitation inspection! Yuck!! Washing hands is a requirement everywhere",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W5EaVdoz-Ahq3fMpEEOMyw"
  },
  "8NFN24WWEqlGn8DgjGYVmg": {
    "date": "12/15/2015",
    "text": "I don't know what happened to this Chilis, but it has gone way downhill.  Dirty tables, poor service, food takes a really long time.  We had a server who was working her first night.  I do not blame her, just the management for putting her on the floor with no help or assistance.  Usually waiters shadow a more experienced waiter for a few days.  We even told the manager that she needed help. The manager just kind of disappeared after that.  She was overwhelmed, kept dropping food and clearly needed help.  I don't think that I will bother to go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yK2BYrKP5g-Z8URSnsdHVw"
  },
  "5J7OHVIsyetSxd_0CMamUg": {
    "date": "9/6/2013",
    "text": "I don't usually give the full 5 stars but this place has earned it over a long period of time. It is consistently good and it is a good value. For some reason they are one of the few establishments that can get beer at the right temperature . They know how to do it the right way. It is always perfect.  Look, I have to admit that corporate restaurants have a place in my restaurant rotation. I'm not saying they should be your favorite spot or I'm not saying that you should go here every Friday night - but I am saying that this location is consistently great - they have earned a place in your rotation.  We enjoy it every time we go. What else is there to say? Great staff and great management.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5pFUx4SJ5YSyIU8tnegtqg"
  },
  "MTSmbKI27vsIKT5-eS3CxQ": {
    "date": "7/13/2011",
    "text": "It's a Chili's-what's more to say? I'm an anti chain restaurant kind of girl so when my friends suggested going to Chili's last week, I winced a bit.  But the Chili's experience was a good one-even for a Friday night when parking was scarce. They have a 2 for $20 menu where you and another person can split an appetizer and  each get an entree--not too shabby. We got the guacamole to start with and after experiencing it at authentic Mexican places, it was a bit weak. I got the Margarita Grilled Chicken and the portion was huge! I had a few bites then had to take the rest home since I was so full from chips, guac and salsa. Ok and a $3.49 margarita which to my surprise was quite strong. One of my favorite things about Chili's is that if you get the chips and salsa appetizer they will gladly put some chips in a to go bag for you so you don't even have to stop at Target for chips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "V8AaUJaY5y6jUoi1-SYVxw": {
    "date": "5/20/2012",
    "text": "Very clean, nice location at the Blakeney shopping center. We went on Sunday for lunch and ate outside they have shaded outdoor seating for 20-30 people. All four meals were good. (will try to post photos). Kids burger, chicken chef salad, chicken tenders, margarita grilled chicken; all good. Waitstaff was good. Coulda had them check on me less often (including the friendly manager) so we could eat in peace, but better that than to be deserted by the wait staff. Checked out the restroom; clean. Overall this is a really nice Chili's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ULgYyME9mYico9-UiC1AtQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chicken tenders (adult menu)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ULgYyME9mYico9-UiC1AtQ/o.jpg"
      },
      {
        "img_id": "dAAgj0NYyr87RP_Ubiey9w",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Margarita grilled chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dAAgj0NYyr87RP_Ubiey9w/o.jpg"
      },
      {
        "img_id": "7mEWDjQHDA1nBwTQQI144w",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chicken chef salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7mEWDjQHDA1nBwTQQI144w/o.jpg"
      }
    ],
    "user_id": "WM2fAgIlZJ6AviCrH5iMow"
  },
  "jRei9cmV8fi0jY2JxCX37A": {
    "date": "2/20/2017",
    "text": "An okay place - not the cleanest and my food here is always cold or not cooked properly. Desserts are the best here!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uqiruf3-Dlc-pcmzhnxO7w"
  },
  "y-lJNM3dbRp5Hhd5UsMXeA": {
    "date": "12/20/2015",
    "text": "For starters our appetizers never made it out to us since the kitchen burned it. Which our waiter let us know of the kitchens misshap. When the entrees came out they served one of us an extra blackened salmon burned to crisp on the bottom.  Unfortunately this wasn't the end of our excellent experience they also managed to burn the chicken that someone else ordered. Fire your cooks service despite all the burned food was decent. Thanks for the free dessert.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8sWoo6yGjqqaPCHRHLOWrw"
  },
  "TuFH-Z-u4nf_H27znsQ77A": {
    "date": "10/28/2018",
    "text": "Southwestern eggrolls are amazing!!!! Jack(bartender) recommended the combine any 3 fajitas... Thank you... Service was 5 star, Jack made us feel very welcomed. Food is delicious, very flavorful.. I appreciate everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5F1Vz5DNMcjV3tgGJUwiOA"
  },
  "5AINdEspgbUkJV5itSKBQQ": {
    "date": "4/12/2017",
    "text": "Reasonable prices. Decent variety of menu options. Clean, comfortable atmosphere. Can earn some Plenti points to boot.   Love the skillet chocolate chip cookie!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sIhuIF0vKwjvlp6pfKeyEQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sIhuIF0vKwjvlp6pfKeyEQ/o.jpg"
      },
      {
        "img_id": "kq8SQFG0XkwbfJvW0u-Eog",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Bar area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kq8SQFG0XkwbfJvW0u-Eog/o.jpg"
      }
    ],
    "user_id": "poC1Kk1viGoFxu6CyDaXvQ"
  },
  "8j1Md_2XoVGHHHOuuKxGRg": {
    "date": "8/16/2017",
    "text": "We have tried this location many times.  Even with half the restaurant empty you will wait a long time for a table. Even if the bar is empty they won't let you sit there. I really don't understand why they turn away business. Rarely does the food ever come out without problems. We have sent cold food back several times only to have it come out cold a second time. Service always acts as if they are too overworked.   Not one time out of 10 did things go smoothly. I guess I'm the sucker who keeps trying it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-qNJ1wPReqRSjDIlL2xl_w"
  },
  "zVXHx_chXU9VQqneGEap4g": {
    "date": "12/16/2018",
    "text": "The hostess was in no hurry to get people seated, their wasn't a wait or anything, she's just not worried about it. Then both entrees came out wrong, one was kind of fixed by the manager, the other we just dealt with. Never got any drink refills, even tho the manager came to the table twice. Our server was on the other side of the restaurant taking tables and we were pretty much forgotten about. Server tried to make up for it at the end but it's a little late. Do better Chili's.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6AxR5DP_a2N0C7Xj0xyacw"
  },
  "u5Tm5p63ef9pTBBWSJ8oLg": {
    "date": "8/14/2016",
    "text": "Seated quickly and greeted warmly. We always know what to expect at Chili's.  Our server, Hailey, was an absolute sweetheart. She was very attentive and patient with our boys.   We had our classic favorites: crispy honey chipotle chicken tenders, cajun shrimp pasta, kids' corn dog meal and a sirloin for the pre-teen.  Food was prepared as described.   There was a malfunction with the ziosk and it did not allow hubby to redeem his points. A manager quickly rectified the situation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtIBG55GolSXI3qjcQFExg"
  },
  "jMhFLiyyyiXJ-6S_pGgMCg": {
    "date": "8/15/2016",
    "text": "The atmosphere was comfortable; it's a place to bring the family. Isn't that what these chains are for anyways? You can be anywhere in the US and find a location; the only difference would be the local staff.  I was not entirely satisfied with the quality of food. The broccoli was dry, bland and flavorless. The mash potatoes tasted like instant potatoes that you buy at the bottom of the isle in your local grocery store.   The Salmon had flavor and a pan-seared crisp to it. Though I did find a tiny bone, not much else to say for that, you'd be better off with a burger. Salmon was a mistake.  The chips, salsa and guac honesty, was the best item ordered. I recommend if you're looking for an appetizer.   What was with those table iPads? Completely useless. They never described the purpose; it sat there taking up a huge part of the table, and we never used it. Maybe if the entire menu was viewable?   Overall, can't say that I would recommend this place given the hundreds of other drivable restaurants in the area. So I give this place a merely two stars due to it's sub-par cookie-cutter quality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "V14biv16tlcVUB3iYDCH8w",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chips, salsa and guac",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V14biv16tlcVUB3iYDCH8w/o.jpg"
      },
      {
        "img_id": "TkJGG6LOc7SBF-wJ5xVBJQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Salmon, broc and potatoes",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TkJGG6LOc7SBF-wJ5xVBJQ/o.jpg"
      }
    ],
    "user_id": "3ZspXDft6Dq2AhJNYmAIIQ"
  },
  "CfZ7UPVMc5ppqHiD3mc4Dw": {
    "date": "10/12/2018",
    "text": "I don't know what happened to this franchise.  The food quality has dropped so significantly in recent years its ghastly.  Remember when their chicken crispers were the best tenders around?  Now they are crusty tasteless turds.  Our last visit was a disaster.  The waitress was trying hard but the food was just plain awful.  Even the namesake chili, which has always been respectable, has turned into an over salted and spiced nightmare.  I have been going to Chili's for over 25 years but another visit like the last and I'll drop them for good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7zOYJT0L8nfmuEKoH7RfeA"
  },
  "GYnmmI2VC5oou1sx_igCBA": {
    "date": "4/6/2018",
    "text": "We live across the street from this chili's, and  order takeout at least once a week from here. The online ordering is seamless and so easy. The food is consistently good, and the Togo staff is AWESOME!!- I have never had a bad experience and it's due to their attention to detail and perfect customer service. They go through my order with me, then go above and beyond to make sure I'm taken care of. I also have used the curbside pickup a few times which is so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "40q1MFUYjqeVOmroT1jb9A"
  },
  "zMsjk_75XD8zVzZUsyPxKA": {
    "date": "12/26/2017",
    "text": "Horrible seating. Arrived with my group of 4. There are six open booths and the hostess refuses to seat us because \"it will back up the kitchen.\". OK, I get that. They are short staffed. However, 9 people (3 different groups) walked past the 10 people waiting for a table and walked up to the bar. Yes, they all ordered food and have their drinks in hand and good ordered. I'm still waiting for my table. Manager wouldn't come out to speak to me. Do not come here. I'm not even hungry now. Brutal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "44htyESnx01uplFCqTMO3g"
  },
  "dG99e8-6j_Ry-OPAeM6Unw": {
    "date": "12/16/2018",
    "text": "I placed my order by way of the Chili's app at 6:00pm. I was given a 30-minute wait time for curbside service. I had 30 minutes to burn, so I did some shopping in the area. I pull into the designated to-go parking spot around 6:35pm.  I wait in my vehicle for about 10 minutes waiting for curbside service. I noticed that there were several people waiting in the pick-up area inside of the restaurant. Finally, at 6:45pm, I decided to inside because they were, obviously too busy to come out for curbside service. There was a customer at the counter, looking at a menu. The employee did not acknowledge me at that point. I waited a few minutes to figure out what was going on, then I asked the employee if ny order was ready. She proceeds to tell me that she was helping the other lady. I then asked her to please check and see if my curbside order was ready. She checks the orders on the counter and my order is not there. She then disappears to the kitchen. At this time, I spoke with one customer who had ordered a salad that turned out to be subpar and had to be remade. Another customer had an order of nachos which was on the counter the entire time, after telling him that it was not ready. His order had to be remade because it was cold. Well, I finally got my order at 7:15pm. The salad that I ordered did not have the dressing. Fortunately, I discovered it before getting home. There was a total lack communication throughout the time I waited. It seems to me that a member of management should have come out due to the multiple problems. Someone needs to check into what is going on there and the inability to provide timely service. I understand that it gets busy, but communication goes a long way.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t3upkju1JPQEfPbUCKIqVA"
  },
  "vqXjNubNs_pQgglfQ1TFMg": {
    "date": "7/29/2018",
    "text": "Generally we enjoy Chili's, but have been disappointed at this location for quite some time now. One, the quality of their chips has been less than appetizing.  Some are underdone and soggy and they hardly ever have salt on them anymore.  Two, their newer mashed potatoes are dry, tasteless and are no comparison to the mashed potatoes they used to serve in a skillet. Lastly, on my most recent visit they were completely out of lemons.  A basic staple.  Overall I am disappointed in the direction that this location has gone.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzkCHH0VM2vnjBZZykZF4A"
  },
  "hRtFppdbwoxr6pZHt3ksEg": {
    "date": "7/26/2018",
    "text": "Chili's is my favorite place to stop in to have friendly faces and great customer service! Chelsea , Natalie and Bill, general manager, makes this place a joy to stop in to have a snack, or a drink or a family dinner! Clean, attentive and kind! Kindness and happiness is essential to life's purpose! Come eat or get delivery at Chili's at Blakney at Chili's! Favorite place to come to for a smile and a great price! Super clean and establishment is amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrhAbXBj3fiWbJiAWMohRw"
  },
  "S5Ao8utS1-KmX4TR7HinBg": {
    "date": "6/8/2017",
    "text": "Went here for lunch today and all i can say is bad service. It took a while for anyone to actually come over and get our drink orders and then once our waiter did get ours it took forever for anyone to come and get our food order. The waiter who got our drinks was different from who took our food order and neither one gave us their name. My friends order was overcook and when we asked for a new one the waiter didn't ask what she got so he brought out a different meal and then we were charged for both meals. Both waiters were going to other tables more frequently than ours and so we had to wait longer to get anything.   Luckily the manager was there and we talked to her and ended up not having to pay for the one meal thats the only reason why i gave 4 stairs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6cmJC_PUnldyjH_uPTJvzQ"
  },
  "mrh-OM1oVquRYrXzm8paNg": {
    "date": "10/25/2015",
    "text": "So let's  see . .. My wife  complained  to  Chili's  corporate  about the poor service  and  filthy conditions  of  the  Chili's  restaurant  on Hwy 51. They sent her $25 in Chili  bucks as compensation . So we decided to use them at another Chili's  this time in Blakeney . Our server is Daniella . She was very prompt  with  our drink order and with taking our order. The watermelon  marguerita  is delicious .  Our appetizers  were hot and  flavorful . I can't  wait  to  see  what my burger  is like. Everything was very good. Daniella was very attentive and the atmosphere was worlds better than the location on highway 51.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xq1zRJz5VHgEKiCaI51_Gw"
  },
  "UOS6ApMLetRFqyVlR9F92A": {
    "date": "10/11/2017",
    "text": "The waitstaff was attentive (just the right amount) and the food was up to Chili's reputation, well cooked, served hot and the portions were more than ample. We all enjoyed the experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j4EybfuF3EJyBD7Mxov3Zw"
  },
  "mhiQ8X6r1IpeAvQ2RQ2Skg": {
    "date": "10/1/2017",
    "text": "Food was great. Service was great.  Waiter kept checking on us. First time we have eaten at this location.  My family and I enjoyed our meal.  And will be back.  The atmosphere was inviting and pleasant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kqEyOSsy8-qbAockGYUxyw"
  },
  "xTAghSjakFtHc1kymonhhg": {
    "date": "2/14/2016",
    "text": "I'm a fan of most chili's establishments; however, I am no fan of this establishment.  I will not be back.  Food was not good.  Was literally disgusting.  Dirty tables everywhere.  It was obvious our server was on some sort of narcotic.  I think all the servers are on drugs.  They were all constantly dropping things, refilling wrong drinks, getting orders wrong.  Place is a complete and utter disaster.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLN5ty_Vp6vQycBAJyN-3A"
  },
  "j3IBqc8LGY6o_Rko-LqGWw": {
    "date": "12/3/2016",
    "text": "I always get to go food from this location for the family. The to go staff is very helpful and always check your order to make sure it's right.  The down side is the bartender. I sat there for over 15 min waiting on my to go order and was going to order a beer while waiting and the guy never paid any attention. This experience is consistent each time I've been to this location. Your job as a bartender is to sell as much volume as efficiently as possible. Chilis is losing money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "08A9q7vQFRC6IZEFZPy8Nw"
  },
  "H7pJRaPJXHinEJDeDB3W7g": {
    "date": "8/18/2016",
    "text": "Wander what kind of tips the waitress in the bar gets when acting like a jerk. Host is just as bad.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CX3bu76oIZRGazxlj2Xbjw"
  },
  "0JX70ITnM_Q4N0J5457MLg": {
    "date": "4/11/2017",
    "text": "Came in Tuesday during lunch (4/11)  Had an awesome server but most of all one of the nicest, most accommodating managers I've ever dealt with. Especially for being a corporate operation. Way to go and thanks",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gOoKXNx--20l34wws2gq2g"
  },
  "3tAXCBWC9eae_P1ZrIXAYg": {
    "date": "8/2/2019",
    "text": "This is my first time eating at Chili's in a long time. I usually eat at local places, but we thought we'd stop in at Chili's for a change and we've been pleasantly surprised.   They have the 2 for $25 deal for an appetizer, 2 entrees and a dessert. Who doesn't like their skillet cookie with vanilla ice cream?  The bacon burger and fries were on point. Fries were crispy and tasty.   And our server, Kristen, was the best waitress/server I've seen in a long, long time! Chili's, if you know what you are doing, you will not only hold on to her, but look at moving her into training and management. With wait staff like her, I can understand why this Chili's is doing well. She's doing good things and knows all the regulars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MKLcNrMc4A2mBKJ784PaEQ"
  },
  "lK4deRfKN5cNsTa0vZiw7Q": {
    "date": "1/27/2019",
    "text": "We enjoy this place the people that work here. Excellent environment. The food  is consistent and service is great. Excellent wings and a nice bar.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fO3QOnRa-jCQOq3LSyeF5g",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fO3QOnRa-jCQOq3LSyeF5g/o.jpg"
      }
    ],
    "user_id": "aJcgNs1SaKepTGSxEidedw"
  },
  "a88QHorDK5fLBet6vFVl_w": {
    "date": "11/27/2018",
    "text": "Chain restaurants are usually the same everywhere so this location is same as other Chillis. But, to anyone who is ever craving a chocolate lava cake with vanilla ice cream and is near a Chilli's... your craving will be easily satisfied. The dessert came to table pretty quickky and the melted lava oozed out as I cut through the brownie mmmmm mmmmm. Who would have guessed that this dessert would be so good qt Chillis of all places. Well somenody gotta try it and let others know. So now you all know . Go try it, worth every bite",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZU0ZHlR0JPgtyLcu-jCvPA",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chocolate lava cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZU0ZHlR0JPgtyLcu-jCvPA/o.jpg"
      }
    ],
    "user_id": "oJVkBWeyirjR4h8x2PpN4g"
  },
  "JkueYtrwq4T48_mZTfzvxQ": {
    "date": "5/16/2019",
    "text": "This Chili's was a miss miss. The burger was smashed on the grill which I don't like at all!! Gives a crispy overdone crust. Fries were limp also.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRvP6_HWwRiisM3NiNOG5g"
  },
  "K2abnGOxheUac_dDe4iQlg": {
    "date": "7/28/2018",
    "text": "It's chili's. You know what you're getting. We always sit at the bar, and we always have great service. The food is always good, normal chili's quality.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9J0aZZhj6xbyMDIOwiZjfw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9J0aZZhj6xbyMDIOwiZjfw/o.jpg"
      },
      {
        "img_id": "z6yrux-BCgHoV0XsU9Lddw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z6yrux-BCgHoV0XsU9Lddw/o.jpg"
      }
    ],
    "user_id": "6pHnLYravmZfBtc6Dco9Tg"
  },
  "gjeItIuq4ud0R7t0iWoBoA": {
    "date": "7/18/2019",
    "text": "ate there two days ago and had their buffalo chicken strip salad with chips and salsa. If you sign up for Chili's Rewards they'll send you reminders for different rewards. Only downside is that you have to eat there every 60 days to stay being a member of the rewards program",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RO_7u4Y2n84d-u-GyrxSDg"
  },
  "vixnKBF1MIJEKy5B8jSaYA": {
    "date": "5/18/2019",
    "text": "My daughter and I came here for lunch. Service was quick and spot on. Food arrived quickly and efficiently.  I had the shrimp Caesar salad, delicious and my daughter had a grilled chicken sandwich.  Everything was as it should be. Server was attentive and pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJqdoA6eJlqf30dseNRroA"
  },
  "yprhJi7fv4HINzViGOn92g": {
    "date": "5/28/2018",
    "text": "Best chips in town. Thin and light with just the right amount of salt. The salsa is hit or miss and definitely needs some heat. The skillet queso is not the best and can use some work. I suggest using chorizo, jalapenos and pico.   This location was busy and but we were seated right away. Our server was VERY attentive. Almost to attentive. Every time she walked by she asked how was everything. This interrupted our convo several times. Maybe she is new but it got annoying.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "tWC_6WJ_sijMCjEBI3nb-A": {
    "date": "4/28/2019",
    "text": "My cousins took me to this restaurant and I loved it! There was a large variety of food and the service was excellent! The hostesses there were very nice and they greeted us with a smile! I would definitely recommend for families because the kids can play games on ipads! Will definitely be coming back when in town:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nxj7gNyy9o8IZ9wmuhhxXg"
  },
  "gIOMCJ7C-Cbyljt01sklXw": {
    "date": "4/22/2019",
    "text": "Love the specials and the service was great!! Looking forward to having a new one built in my area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDjqWrSBRUWZwuOu3gvMrA"
  },
  "axk55GGbZyaplCKtzH9OTw": {
    "date": "11/10/2018",
    "text": "Had a great meal tonight at Chili's @ Blakeney. Our food was very good and our server, Dylan, did a great job! He was attentive and prompt with a great attitude.  We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DkzV1tKhrkwzqEkmiGfMxA"
  },
  "WSlqMko27WJPmFLaapQ_rg": {
    "date": "3/16/2019",
    "text": "I just left this restaurant and the service and cleanliness of this place needs to be improved. My son's food came out with extra fried items on it(imagine bacon on the side but it wasn't bacon) I informed the server about this and he said it was meat that was fried with the chicken tenders\".The response was ridiculous. Why would you serve mystery meat??? The floor was so nasty and the overall feeling of the restaurant screams\"deep clean\". The service in the bar area is always mediocre and it was no different today.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G5gmwdbseXdEl8sjljcq6w"
  },
  "PMnGPfseM7_U_ipWjO830g": {
    "date": "1/8/2017",
    "text": "Well, it started out good but ended bad. We sat at a booth at the bar and the server was very nice. He was very attentive too. But at soon as we placed our order, he disappeared. I don't think it was necessary his fault because I noticed he had a good 7-8 tables. Not fair to him or anyone else.   We needed refills on drinks and never got it. My husband got the soup and salad combo and had to flag him down for more soup. I got the egg rolls and they were good. We also got the white queso and it was not good at all. The guacamole on it was brown so it wasn't fresh. Plus the queso wasn't fully heated so it was super thick and lukewarm. We were still waiting on him because we needed boxes. After waiting over 10 mins I just went to their station and got the boxes myself. Two girls sat behind us and waited a good 15 mins before they were greeted and they finally stopped someone. That server gave them drinks but their original server which was ours never came to them. They finally stopped him and told them how disappointed they were in waiting for so long.   I won't be back. Not worth the hassle. We were there for almost 2 hours!!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "C-VIwj1IF4KsnwSgz8-Pjw",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chili",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C-VIwj1IF4KsnwSgz8-Pjw/o.jpg"
      },
      {
        "img_id": "ciFd6Ak17XR6P9W3F2wnCw",
        "caption": "Photo of Chili's - Charlotte, NC, United States. White queso dip",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ciFd6Ak17XR6P9W3F2wnCw/o.jpg"
      },
      {
        "img_id": "wyAqpEFyCLDmHXxljITWlg",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Chips and salsa",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wyAqpEFyCLDmHXxljITWlg/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "pR7uTHZG8IdwFAcKevSuIg": {
    "date": "1/5/2019",
    "text": "1 star is forTerrible Lightning.    Love Chili's but don't like being lit up like a Christmas tree when I'm eating.  Very bright overhead lights.  Need to be softened or directed only at center of tables.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kDxbvBR68-cTbmYVWkkHLg",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Led bright white Light directly overhead",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kDxbvBR68-cTbmYVWkkHLg/o.jpg"
      }
    ],
    "user_id": "FUtMMOqAO9jgazXQZVMfUA"
  },
  "Qva10e7phI693p53GVPmkQ": {
    "date": "1/25/2019",
    "text": "I love chillis. Even as I become more educated on food & try new things, I'll always find my way back home. The service here is hit and miss. If it's busy, there's no way you'll get in and out of there in a hour. If it's slow, you'll still be there for an hour. The waiters / waitresses are always a delight other than ONCE (she was a young girl with a \"trainer\" on her name tag.... wouldn't recommend having her train anyone) the food here is what you would find at chillis. They have revamped some recipes and added some different recipes to their menu which is great. My biggest problem is the to go system here. I used to order to go all of the time but there was always an issue. Wouldn't be ready, left food out of bag, misread order.... pretty much everything that could go wrong, did go wrong. I give this particular chillis 3 stars",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_Ei1qQDfChYFHyVAbtqkg"
  },
  "U7OHj4tCJ0Q_XL3hhbmRvA": {
    "date": "12/7/2018",
    "text": "Morgan is amazing! She's so sweet, patient, kind and also very informative. She made our first and second experience here great. She is wonderful. Our food came out fast and delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uO7XVsfncch_ZUoBXee1wQ"
  },
  "n9ts6osKBLqa4YsjeCUT4Q": {
    "date": "11/23/2018",
    "text": "My glass is empty cause the waiter was the worst.  $2.89 for one drink...took our order and barely  listened to the order, didn't ask how we wanted the burger cooked.  Forget to put in chips for fries and I never got one of my sides, grilled corn. Disappeared in the kitchen and forgot to bring us napkins.  I got up to get them myself.  Sorry if you were having a bad day but basic server should know to ask if we would like a refill.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gc7pItiz4h74DpHYTtSUQw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gc7pItiz4h74DpHYTtSUQw/o.jpg"
      },
      {
        "img_id": "5GxPO3PfR7Y1wAORI5rY1g",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5GxPO3PfR7Y1wAORI5rY1g/o.jpg"
      }
    ],
    "user_id": "HO152pvhzulzR68IW_dUKg"
  },
  "Nl-bAUFH6dhXHATB1TthiQ": {
    "date": "1/1/2019",
    "text": "Well where do I begin.. first, I am only giving two stars because I enjoy the cookie skillet and it deserves at least that. Other than that the food is average  but that's at every chili's location. This location in specific needs to work on their customer service and cleanliness. On multiple occasions I have found hair in my food and on one specific occasion I found a piece of hair in every course I ordered. When I brought the hair to my servers attention he shrugged it off like it wasn't a big deal and when he brought his manger out he did the same. The host staff and servers don't know what they're doing. They clearly need some sort of training and to be told to smile and act like they don't hate their lives. It's honestly pathetic that they treat their customers the way they do. Management needs to step up and do something about this ongoing issue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dggKvVItdiTImN3bhJ_M7Q"
  },
  "poTU91k-ftyo1UyOe1h90g": {
    "date": "11/30/2018",
    "text": "The service was awesome and the ice cream cookie was so good and the fajitas were also awesome they have great deals and it's nice to go out with some friends",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M226uqmZEz3uzYweSTB0cw"
  },
  "fTpI8th65JYXpBU0hSEv2Q": {
    "date": "10/31/2018",
    "text": "I love Chili's! The food never disappoints me. But the service is always awful. I work at a very upscale restaurant where we are known for our excellent service. I would love to talk about coming in to train your servers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "imOzOVjqSiPJYD9oZBkO1A"
  }
}