{
  "MQ7nHdpufoDd9Jw7YkCVVg": {
    "date": "1/21/2015",
    "text": "What a pleasant find. The food was good, not salty or greasy. The portions were huge! We ate the honey chicken twice and then some. It is worth it to get your Chinese take out there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTt0F_ZhihgSoZRAcOH6aA"
  },
  "atKcUYOMYW8-kv37DAhMzg": {
    "date": "6/10/2013",
    "text": "i have ate here several times. the food is good and not to pricey. the best chinese food in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s6ywcgeDV789IKlAyU8isw"
  },
  "2GuXFCpEenIZvesDsOt2eQ": {
    "date": "4/19/2014",
    "text": "We drive quite a way to get take out from Golden China but definitely worth the drive! Dishes are inexpensive but absolutely delish! Try the garlic shrimp or chicken, you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C6iS4IZ3cGw226kdqBehKA"
  },
  "1jfVtKbuVhqEQ2vb0fD1fA": {
    "date": "2/3/2010",
    "text": "We've had a really hard time finding a GOOD Chinese takeout place since we moved to Pineville. While this place isn't exactly around the corner from the house, it's close enough and more importantly hits the mark on everything we were looking for- great house fried rice, good soup, and their entrees are quality. Thumbs up!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "59fivQG4eIGGB3ZpgKBMXQ"
  },
  "dZDLwV2lb4eR62Fj7NTc1g": {
    "date": "7/26/2006",
    "text": "Great prices, super fast service!  Steamed dumplings, mei fun, and crab rangoon are our favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nlxLCCf8hcZK4EDXvpqtUw"
  },
  "vp6tOt6IVYpxrrikGHigqQ": {
    "date": "5/12/2016",
    "text": "WOW!! My family and I are from Florida, and we were passing through SC to go hunting in NC. After reading the reviews of nearby places to eat, we chose this place based off the good comments. They exceeded our expectations!! Very friendly staff, tremendous helpings of food, good prices, and very tasteful!! The manager, I assume by her demeanor, even brought doughnuts to our table, on the house, because she overheard us talking about wanting to try them! We go to NC every year, sometimes twice a year, and I can assure you we will be stopping here every time. Thank you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "nmNgs356iB-x9Kk1ctLTaQ"
  },
  "ad3_pfzMj8ypTYHVYU_Jfg": {
    "date": "6/5/2017",
    "text": "Coming from NJ I finally found the best Chinese food in town ! Everywhere else I've been in charlotte and fortmill SUCKS! Everything I've had on the menu is good ! The staff is friendly and they came from Brooklyn so the Chinese food taste just like home. I don't eat Chinese any where else but here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcI1PuHY1eW0OHkoK27Qcg"
  },
  "LMYYm1-Q4s8cZFYn-Q5bkQ": {
    "date": "4/8/2018",
    "text": "not the best chinese takeout place i've been to. it's good for wanting cheap and quick dinner or lunch but the quality isn't the best",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a4UWcLCRJVcIKWpszd_Dyg"
  },
  "j_HrRDgOplTMBIh_0ntOlw": {
    "date": "2/4/2014",
    "text": "Very good, not amazing or anything, but definitely very good fast Chinese food.  Ordered this for delivery from my hotel room.  They were the only place left open at 10:15 that delivered.  They told me it would be 45 minutes for my food, but I swear it was at my door in under 20...delivered by drones I wonder?   I had crispy orange shrimp which was pretty good.  The crab ran goons were very good.    Don't be afraid to try this place.  Prices were great.  Delivery and service seemed awesome.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "CZ4tdIXmiiMQHQ62lesnKw"
  },
  "HlHqQsVkJighRnZotQ3TUQ": {
    "date": "8/16/2015",
    "text": "This is the best Chinese food in SC! They cook everything to order and its fresh. But the best part about picking up take out or dining in here is the service. The owner remembers you and your family. She always puts extra little treats in your bag. They are like part of our extended family which brings us back often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "hYGsFzmZno2mpxqg1aFsRQ": {
    "date": "6/27/2017",
    "text": "Best Chinese food around. Service is fast and consistent, and the portions are large. Inexpensive as well. 10/10",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TFD3D5HwtF_cHicc9bk1tA"
  },
  "pZ94lu834TgoSegIm4b_2Q": {
    "date": "11/4/2015",
    "text": "Yummm!!! Have been coming here for a long time and have never been disappointed. Delicious fresh food with large portions...yes yes and yesss!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VStdLfuQwEuhsLKb6oW1-Q",
        "caption": "Photo of Golden China - Fort Mill, SC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VStdLfuQwEuhsLKb6oW1-Q/o.jpg"
      },
      {
        "img_id": "Gl4Sm6Igzo-kBK9fAlQYXA",
        "caption": "Photo of Golden China - Fort Mill, SC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Gl4Sm6Igzo-kBK9fAlQYXA/o.jpg"
      },
      {
        "img_id": "3YdJNooaxRwZX9AYA6i7jQ",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Lunch and dinner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3YdJNooaxRwZX9AYA6i7jQ/o.jpg"
      }
    ],
    "user_id": "Josf9U3wagozATXsz4lfQQ"
  },
  "nux9lkwqA-qto6nQqzyeew": {
    "date": "2/4/2017",
    "text": "I have been going to this specific Golden China for almost 10 years. Lee is absolutely incredible at service and the cooks are always on point. She takes fast food to a new level with socializing. She creates customer relationships which is huge to me. When on the phone she knows who I am and knows mine and my family's orders. If I call for me alone she always asks if my mom, dad, sister, or cousin (the usuals) would like anything as well. She constantly asks how everyone is doing and remembers what we last talked about. I love that. I have never had an issue. They are great so I know they get backed up sometimes but I am happily patient, it is never an issue to wait a little. And their food is very good! I usually get either the vegetable lo mein or vegetable fried rice with no eggs and a spring roll... Yum.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TK8QFQdJfOqExD7KlM3O2Q"
  },
  "GXsxuSulowGb9zZPQYdP3w": {
    "date": "10/23/2016",
    "text": "Great food! Whether dine in or take out. Very friendly staff. I recommend the rangoons, haven't had any better!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R6U1A9ctQkAoC_M1p6aWjA"
  },
  "WLTolj9024z92RhtA4akSQ": {
    "date": "5/29/2013",
    "text": "Golden China was fine. Nothing was wrong with the food, but nothing stood out either. I have certainly eaten worse, but then I've eaten better.  Without a doubt, I much prefer Peking Toyko in Tega Cay.    I went in for carry out on an extremely busy Friday night and waited close to 30 mins. But, the staff was working extremely hard, no one was loafing for sure, they were just slammed, so I'm not including wait time in my review.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iWoCUArqFmXvTBM2jsMs5g"
  },
  "IHhkh0t_ZcgoXtalaYVEXg": {
    "date": "2/26/2017",
    "text": "Delicious food. The flavors are amazing. Mentioned when I called in that it was my first time there and they gave us free sugar donuts. Very nice and fast service. Reasonable price for all the food you get.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cc8mg0xzBctgRnK_SdzIzA"
  },
  "tUMcSEvz8rK1mXbgAJIXXg": {
    "date": "3/31/2015",
    "text": "I've eaten here several times and I've never been disappointed! Portions are HUGE (enough for me to eat at least two meals from), and prices are super affordable! My boyfriend and I can each get an entree and share an appetizer for about $22. Not only that, but they're kind enough to throw in some kind of dessert for free with our order. I'd recommend this place to anyone. It's my go-to take out place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lDg4dOR0wf3i7qSgbyzBzA"
  },
  "IQbr2DDHm3Q6Msm0-XtoRQ": {
    "date": "7/24/2016",
    "text": "Really decent hot and sour soup and fried rice. Very easy and quick carry out, and inexpensive.  I wouldn't go out of my way to get there but it's ok.  My hub had the pepper steak and onions, it was a really big portion for the $.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uaKkElyWMAQC5m3KjuM7mw"
  },
  "-n19o-7MlHLycencdM4Ofg": {
    "date": "1/13/2013",
    "text": "Food is real good. They cook their wings when you order so it's not sitting there allday. I took my daughter and she had the General TSO's chicken and as picky as she is, she liked it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v0N40TQGG7Jz-YxR94c7cw",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Sign in front",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v0N40TQGG7Jz-YxR94c7cw/o.jpg"
      }
    ],
    "user_id": "q6Snot2yeJs-dRiSI3Akew"
  },
  "YxpqgBvnzI4OdnLjEU7ecw": {
    "date": "1/11/2015",
    "text": "Food is okay. The woman at the counter is your friend until you have a complaint. We usually don't have issues with them. But the two times that we did they were not very helpful. This last time turned me off to this place. They're reactions to things that go wrong are always the customers fault. What happened to the customer is always right. And we weren't asking for the title to the restaurant. They need to learn a thing or two about customer retention. Hate to say this but we won't be going back there!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-gFqMPf1lOaIy6_f-V5OA"
  },
  "Cpk6-ih4DAYnUReLfznZgw": {
    "date": "7/20/2015",
    "text": "Nothing really stood out about the restaurant. The food was decent; the customer service was okay. The portions were pretty big so you do get your money's worth.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zIMuZ1k-S6X7OFW5Ez9I8Q"
  },
  "Luv-hHeI92pm9wVcGUWbwg": {
    "date": "2/5/2014",
    "text": "Golden China is my choice for Americanized Chinese in Fort Mill. Golden China is consistent, a good value, and very friendly. Look past the American guy who occasionally works the front counter. The Asian gal who works the front is always on top of the details. She knows the regular clients' tastes and regular requests - like no onions in fried rice. The dining area might not look like much and it might be served on styrofoam but you can't argue with the value for the money. Most folks get take out. For what it's worth, there's another Chinese place across the street, next to Food Lion, where I refuse to eat unless it's lunch and I have a coupon for a $4 lunch. I happily pay $6 for lunch at Golden China instead!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZ1kLcA_T2ZiU8poinPGKw"
  },
  "fk93oLcsb3BBlEJwpv5KkQ": {
    "date": "8/9/2014",
    "text": "Golden China is great! They always get my order correct and sometimes even give me sweet rolls extra at no charge. The staff is always friendly. And if I call in a order no matter how big it is they always say 10 mins.. Lol...and it's always ready when I get there. I've been eating takeout here for years and have never been disappointed.. The food is always tasty and hot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3W1LU-ysdtVQ7IgDlYzPdw"
  },
  "m3mS9dPNzH7SnOzvQfq7jg": {
    "date": "3/22/2015",
    "text": "Not bad take out.  Prices are fair. Food is not bad.  Good attitudes. Looks clean. Good service.  What more can one ask for?  We have ordered here multiple times before and will continue coming here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fg5-XX6a10nD51kiy1vdCg"
  },
  "AtZ8KLYd299foiGL7O3syw": {
    "date": "9/29/2014",
    "text": "Food is delicious and prices are great. Don't miss this.  Crab rangoon and chicken wings are a must.  And the owner lady is a real pistol.  Very funny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ogMqrjPOVsQnNIyTFSpoVg"
  },
  "nm879E6pZTQxQlVSsKK9zg": {
    "date": "12/12/2017",
    "text": "Coming from Massachusetts I have a pretty high standard of what Chinese fast food is supposed to taste like. Over the past 20 years I've lived in Florida, Georgia and South Carolina and I have to say that no Chinese restaurant has ever come close to getting all of my favorite foods right. Until now!   I will visit Golden China again and again! It is my new favorite Chinese restaurant! Customer service was wonderful. I showed up around dinner time with my two grandchildren, under the age of 3, in the rain to pick my food up. Not only did they help me to the car in the rain but took her time to remind me to make sure I had the sauce I needed before leaving the restaurant. I cannot Rave enough about this place! I hope it's not a fluke, one-time deal. I've yet to go back but as of right now, outstanding across the board!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "u9HC_LMR7oa6JbkN9G2QXw"
  },
  "614Qsf5lEwu-tZH0-GwqSQ": {
    "date": "2/22/2017",
    "text": "I love this place! This is my go to for take-out! They are always nice, welcoming, and accommodating. I always get the same thing, and the food is really good. The serving size is always huge...well worth the money. I only wish they delivered! Lucky for me, they are just around the corner. Their spring rolls are to die for! This is hands down the best Chinese food in Fort Mill...even better than Red Bowl! Don't even waste your time with anyone else.  As a side note, hopefully they will offer delivery services soon...or at least work w/ a vendor like Uber Eats or Door Dash to deliver for them.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WkdhZ_BLQ9EkwzyNjqjhPQ",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Sesame Chicken (white meat) w/ Fried Rice and a Spring Roll. Delicious!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WkdhZ_BLQ9EkwzyNjqjhPQ/o.jpg"
      }
    ],
    "user_id": "g4pieotQ54iLLEA-1cKVlg"
  },
  "9N9ldnnn7OquzIhC1d8o6g": {
    "date": "1/6/2018",
    "text": "Stopped in for lunch with my son.  Great General Tsos and Garlic Chicken - and quite a bit of both.  Is great that they serve the Lunch Menu 7 days a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h5tIlPnmjUecgCGl9Ck7-g",
        "caption": "Photo of Golden China - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h5tIlPnmjUecgCGl9Ck7-g/o.jpg"
      }
    ],
    "user_id": "7t6vIgNqfe_lB8G4PyYpXg"
  },
  "zxIuS2a6_ruFqpROU51Ynw": {
    "date": "11/21/2018",
    "text": "Great neighborhood gem. Food is prepared to order and everything we've tried is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QXTEffSpdhzSc7HQCkmmg"
  },
  "trHr0RT3VHsFuLmjBJGt1g": {
    "date": "9/21/2018",
    "text": "Golden China has some great food each and every time I visit! I enjoy the quality and consistency of their food. They always provide their customers with very large portions of food in all of their meals, I enjoy coming here on the weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Om5rTU2iwz8g_QU3dVSJQ"
  },
  "Jay4QgRJdTnestVcH_VqUA": {
    "date": "2/24/2018",
    "text": "The food is phenomenal, as is the service! Everything is cooked to order, so you won't get old food that's been sitting around. We order from here about once a month and it is always consent. They give free 2 liter drinks and Chinese donuts with large orders, and since I'm always ordering for my family of four, we always get these free perks! The staff is friendly and remember you when you're a regular. Best Chinese takeout I've been to in a while...so much so, that I drive past the one closest to my house to go to this one. Do yourself a favor and check them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YVD2pxble_O99uOXu-TkQ"
  },
  "V7NN7-4yx_vy0A8iFP_rpQ": {
    "date": "6/14/2017",
    "text": "Tried Golden China yesterday based on the reviews here on Yelp. Ordered for dine-in up front and chose Mongolian Beef. The food came out quickly, and it was good food and plentiful, but not quite as savory or flavorful as I've had at other restaurants. The kitchen was busy and the restaurant was full of workers taking their lunch hour.   The dining area was clean, but also very sparse. Dine-in orders are served with a small plastic fork and there are packets of duck sauce and spicy mustard on the tables, as well as a small bottle of soy sauce.  The only concern I had was the kitchen. It's an open kitchen and they have a ServSafe certificate hanging up, but I couldn't locate the sanitation rating, and being as its in SC, they're pretty generic about their scores anyway.   I witnessed the two women running the phones and cash register also handling raw chicken and eggrolls without any gloves. They were dumping these items into the fryer as fast as they could, so my concern wasn't so much about the food being contaminated by their hands that had touched the cash register, phones, etc. as I was about my credit card being handled by someone who had just handled food bare-handed. I've seen worse in some restaurants, but it was still concerning to witness it right in front of me in an open kitchen.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IZXnSMdOkVdFH-mw6zQBbA"
  },
  "hDVzrw5Bsnybb1R5BCi58g": {
    "date": "3/18/2018",
    "text": "I am still giving them 5 stars even though my order was messed up, they promptly fixed the order and I have no issues.  The service was great and extremely friendly staff, and very personable.  Every regular customer that came in they were greeted and asked specific questions about the customer and their families.  Gave you a real neighborly feeling.    The prices are affordable and you get a ton of food for that price.  The inside eating area is exceptionally clean.  The food taste so fresh and savory I am new to fort mill but please know I will be taking all my visitors to this place when they come into town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6vkVlBbBERqtVvB5g28MQ"
  },
  "l9O73_UY7hfvq7rNdUUrtQ": {
    "date": "6/1/2017",
    "text": "This is my go-to Chinese take out place. It's good. It's close to all of the Regent Park neighborhoods.   We've never had a problem and the wait is short. I would recommend it to any new neighbors who moved in and asked where to get Chinese takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PstJ9fWRElbomul4zKgigw"
  },
  "j1n1XNNgPXZo6Suzy4L4eA": {
    "date": "3/5/2018",
    "text": "Stopped in on my way home from the beach. Service was fast and food was good at a really reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a-GtsZaOlTxOFOOYAIzbKA"
  },
  "qEvETwwABi6WqkE9WvxwKQ": {
    "date": "1/16/2018",
    "text": "This place is everything I look for in Chinese takeout.  Fresh, tasty, reasonably priced and  with portion size options.  I appreciate being able to order small sizes of soups and fried rice.  Lunch specials are great and available everyday.  The food is hot.  The service is friendly.  I'm a fan of the $1 egg rolls!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMElyDkLoPvP7gGG4FxahQ"
  },
  "gCoFxrZC4_taFTJDZ2Ec-g": {
    "date": "11/25/2017",
    "text": "Portions are huge, everything comes hot and fresh when delivered. Great local place. Everything I order is a huge portion that I literally can split with three people. Crab Rangoons are good, rice could use more flavor tho. Fried wontons noodles are always fresh and crisp.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDZKP6CGokUIoQfRmkLhdw"
  },
  "-jNt4DFtmYnfAaV7GYtX1A": {
    "date": "10/27/2015",
    "text": "Stopped by based on yelp reviews.  Great value for the money. Huge servings in the dinner combos, and the food is pretty tasty.  Sesame chicken, beef and broccoli, and crab rangoon were on point!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2gzhASitXuqpnnE0bhqeSg",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Sesame chicken, huge portions or delicousness.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2gzhASitXuqpnnE0bhqeSg/o.jpg"
      }
    ],
    "user_id": "bqhfMozc8Wp1ty_zDOis_w"
  },
  "_z-jkLc01TUeXhv_PSEttQ": {
    "date": "5/5/2017",
    "text": "This was a best chinese restaurant i went recently i ordered a garlic broccoli. i am vegetarian so i ordered with tofu. it was so good and the garlic sauce was mixed well with the tofu and broccoli. i also included spring roll. Good affordable food in fort mill",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bISEEMtcXF15dODVWX2Rzw",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. ambience. lot of space",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bISEEMtcXF15dODVWX2Rzw/o.jpg"
      },
      {
        "img_id": "2_lz0y8oKjwLOeUV4cgiOA",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. This garlic broccoli. i added tofu :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2_lz0y8oKjwLOeUV4cgiOA/o.jpg"
      }
    ],
    "user_id": "dt6Q04XDwgR_Eqro3Pz-Kg"
  },
  "IW6LO2y-I3Z4UAGDprh6Ig": {
    "date": "11/28/2017",
    "text": "My go-to Chinese takeout in NYC (North York County). Prepared with top-notch ingredients, efficient, delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNjj-uGmFVHz9rhIxUuvYw"
  },
  "wzAKjQMK9-3dkVSCxw96Jw": {
    "date": "11/23/2016",
    "text": "I just went for the 900th time today (not really but it's a mainstay) and it's STILL FREAKING AWESOME.  Great job, nice people, you just feel good going here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3c3aNHGUPDwFZhxCe-p8Ag"
  },
  "i2N4KUkeqLSIrt54dZRtKQ": {
    "date": "5/5/2016",
    "text": "Was definitely pleased with our first order and will definitely order again. Let's see 2 seniors and 1 adult (me) ate this one. We ordered the Honey Chicken, Orange flavored beef and then the Subgum Fried Noodles. The egg rolls were nothing to write home about, but were crunchy, fresh and not too greasy.  My favorite was the Honey Chicken - it was crispy with just the right amount of sweet and with the white rice was a perfect combination. The quality of the chicken was high - delicious and seemed to be all white meat. The Orange beef was equally as flavorful, but the quality was \"meh\". A few pieces were a bit chewy (had a tough strand or two), but that does happen with beef. Didn't expect filet mignon at these prices!  The Subgum fried noodles were okay - none of us had tried this dish anywhere before so didn't know what to expect - it was a delicious assortment of meats and the quality of the meats were high. I just thought the sauce (a brown soy based sauce) was a bit bland, mostly just a salty taste, not much spice or flavor otherwise. The noodles were unique. If this dish had more flavor to it, I would order it again and again.  The best part was the \"surprise\" find of these delicious donut like rolls that were in our order for free. They were to DIE for, smack-your-dad-twice yummy.   I thought for Chinese take-out, it's the best in the area and is definitely my #1 now. Other places around, the food seems to be bland or old and the food here by comparison is miles ahead. The prices absolutely can't be beat! Looking forward to trying some new dishes soon.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "KmSrtnyJqj9QLe5FTwuNgQ"
  },
  "1yJRDdkKPu5yU3jwPu8R7Q": {
    "date": "10/21/2017",
    "text": "This is our go-to Chinese takeout in Regent Park. They have huge portions for the price and don't use MSG.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8w-dnquTcwDTde9gVsJj9w"
  },
  "unUkOXBABKkpwocRXCZkbQ": {
    "date": "8/16/2016",
    "text": "I love this place. The fried rice and crab rangoon are sooo good. They make it easy to call ahead to order and pick up later. We did takeout so we didn't stay in the building but there is seating available.  The menu felt overwhelming to me the first time and Im not exactly a Chinese food connoisseur, but I like the variety of the choices. Garlic beef",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hQ1TqduMwre4GxYa-9YHgg"
  },
  "dH0v6SdHWBTDWKX8mQOxlg": {
    "date": "6/15/2016",
    "text": "I grew up in a community in NY that had many family owned Chinese restaurants. In fact, Chinese food became a very important part of my childhood.   Moving around the country, I ventured far and near in search of \"authentic\", \"traditional\" and \"generational\" recipes. But to my dismay, I have been unable to find anything close to that NY feel and taste anywhere... until, I discovered Golden China!   The atmosphere is that of an authentic Chinese restaurant. You walk in and your welcomed by a warm greeter who is part of the kitchen as well as the owner. The kitchen is open to view and of course, you know its the real deal when you can smell the spices, seasonings and oil in the air. Menu is simple, and easy to understand. Prices are very very fair. Ordering in person or over the phone is convenient. The preparations and packing for an average order for us (Egg rolls, House fried rice, Fried chicken wings, Sweet/sour soup, and dessert) which feeds 4, is ready for pickup in about 15-20 minutes. And of course the taste - simply amazing!   I am in love with this place, and would recommend everyone in the area visiting or living to check it out. Oh I almost forgot, they are from New York!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "x3OvJrv_olGJL5qQ9bgGyg"
  },
  "RgSNwV1prm86R_1B3YGEBg": {
    "date": "8/16/2019",
    "text": "Went at lunchtime.  Service was very prompt and food was delicious.  The best Chinese place around Regent Park.  Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dgWxHjvN-6PMV2CqfkddtA"
  },
  "jDKRkyjGIrXRzc6wdkzvRA": {
    "date": "5/4/2019",
    "text": "You get one star. For ignoring my husband when you told him 20 minutes and we sat around waiting for our order over 50 minutes. You ignored him when he wanted to ask where the order was at. You also served other ppl who ordered after him.   Never coming back.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wx9tJ_m5hOa-UiiKtzilaw"
  },
  "XFjbJCLXmmdl_BCcd_WW9A": {
    "date": "3/15/2019",
    "text": "Very friendly staff and super quick to make the food!! I order there pork lo mein and it was fantastic! Needs a pinch  Let flavor bit with some soy sauce and chili Pam made up for it!! Plus it's a good deal for the price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "mObxoWfkWlvzyEXVvsuLhQ"
  },
  "iM1DaXaSjg6nvV-NPzuOJQ": {
    "date": "4/12/2019",
    "text": "My family is always on the search for a good Chinese restaurant wherever we go. Where I'm from, Barnwell, SC we have THE BEST Chinese food ever. So we are constantly trying to find a spot that TOPS it. My son had already told me we must try Golden China. He said mom you've got to try this place...it is sooooo good. I must agree it was good and affordable. We only tried the chicken fried rice and chicken wings. Nothing spectacular. I'm sure we will be back to try a different dish. Meanwhile we are still on the search....",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UmsHHXMwv7vByHnbW42kGQ"
  },
  "PCunKvzg0XJCx4b7aJVJCg": {
    "date": "1/11/2019",
    "text": "For Chinese, this place hits the mark. The only thing that I will advise, is that if they says 15-20 mins for a take out order, expect it to be closer to 30-40 mins. I don't mind this because you can clearly see how busy they are. Every time we've been, the ordering area is completely packed. Also a good sign. The food taste great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "zSd2GqtqMa0rh661T11tHA": {
    "date": "3/17/2019",
    "text": "I'm from New York, so it has been a  journey to find good Chinese food here in the Carolinas. However, in Concord I found a good spot, and at last I found this gem close to home. The food is delicious, you get A LOT OF FOOD! You won't leave hungry and 2 can eat from one order. Great food, clean joint. No complaints, only compliments!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SerdK2DW_2R7z1b9WU97fg"
  },
  "-HWY2NFyQCxRwbQxmJMs2g": {
    "date": "4/29/2019",
    "text": "I've been coming here a long time, it's gotten better over the years in my opinion. My order is rarely wrong, and I usually don't wait very long either. The people who work there are always super nice and accommodating to any modifications I make. Their lunch specials are super cheap, and dinner still won't break the bank.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxRtXVAM9Cy9Q6PV25rSxg"
  },
  "dkOeD-MnUnYMoK2E7gLtUA": {
    "date": "9/12/2018",
    "text": "I tried their shrimp lo mein, general tso chicken, sesame chicken, Chinese donuts, normal rice, fried rice, sweet and sour chicken, and their white rice.  Everything was pretty good and was priced really well.  I don't know if they give you the donuts for free or if it was an accident but I was happy I received them.  They had my order ready in 10 minutes so they are super quick.  I really liked the sweet and sour chicken, that was my favorite item we ordered.  They were super fresh and not soggy at all like a lot of other places  give you.  The shrimp lo mein was good but not great,  I still haven't found a place that had great lo mein though.  The donuts were delicious of course.  I wish the chicken meals we got had more chicken than breading, there was a lot of breading and not a lot of chicken on a lot of them, the flavoring was really good though.  I would order from here again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rgE7iUN2ibB56GNcgxesTg"
  },
  "KLCEjTZtXEa3lhaBq8GJcg": {
    "date": "4/25/2019",
    "text": "The food was very good and prompt. The lady on the phone was nice. Definitely going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMqyj-fpWrABbMlvXFUwnA"
  },
  "405hUI2gE3mRz5nxec8F1Q": {
    "date": "1/8/2018",
    "text": "Once again perseverance  pays off. I am a newbie to South Carolina originally from Long Island NY. So we love our food and Chinese is at the top of the list, next to Italian which is my nationality lol.   I have tried about 4 that we're not even close to the worse Chinese places in NY.   I almost gave up hope but decided to try one more time before I would give up. Glad I stuck it out!  This is better than most NY places I've gone to.  Most of the restaurants I would compare this place to closed down after hurricane Sandy hit in 2012 so honestly, this beats the last several places I went to in NY too.   The beef and broccoli, honey chicken and boneless ribs are not some left over food. The fried rice tastes fresh and the egg roll does not taste greasy.   Also the food DOES NOT have the aftertaste of other cooked food lingering from an earlier order.   Ordered in person around 2 pm and was out by about 2:15. The only problem is there is no delivery service at this time, but they do take visa and MasterCard.   I can only say THIS THE PLACE TO GO! TRUST US NYers!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YX8vf1C35B7WeYk8pwbYuA",
        "caption": "Photo of Golden China - Fort Mill, SC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YX8vf1C35B7WeYk8pwbYuA/o.jpg"
      }
    ],
    "user_id": "u8Id590ohJ6LHh2HdVfiSQ"
  },
  "woSFH5tB9Ngptnh70gEkjg": {
    "date": "5/31/2019",
    "text": "Great food, great prices, good portions, nice owner. My only complaint is wait times but give yourself an extra 30 minutes before picking up. However, sometimes I think he does not start cooking food until I arrive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cWVQ8hve4Lq4oADlM9iJdw"
  },
  "x_gFvhyAt6PHnokiTGJr8g": {
    "date": "4/27/2017",
    "text": "Noticed this almost new restaurant around the corner in Fortmill SC. It had a good rating but from fewer people on Yelp and we decided to visit here. The first thing that appealed to us was the restaurant was super clean! The food was the regular Chinese menu and we got some fried rice and chicken. There may be multiple dishes on the menu but they ended up tasting almost similar. We decided to dine in and don't expect too much of a service - the food comes in paper plates and you got to fetch your own water/soda. The food was hot and fresh with lots of vegetables! It was a relishing good experience! What more could you expect for a  lunch less than 10$.   I would recommend this restaurant to anyone who wants to grab a delicious Chinese lunch at a budget price in a clean place!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Oh36rZXE0ql4gu6KA5WUvA",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. My Plate of approval! Lol",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Oh36rZXE0ql4gu6KA5WUvA/o.jpg"
      },
      {
        "img_id": "b0Kilr6hlxkDxwF-QuYdeg",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Chicken with Garlic Sauce combo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/b0Kilr6hlxkDxwF-QuYdeg/o.jpg"
      },
      {
        "img_id": "Md--gRMoJ_Bj0EwbtQ3PVg",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Tofu, Broccoli and Garlic sauce combo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Md--gRMoJ_Bj0EwbtQ3PVg/o.jpg"
      }
    ],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "plfr_RPRbOHW1oTiHiKOMg": {
    "date": "6/8/2019",
    "text": "I've just moved here love Chinese food this place is great  I've been here about 5 times now every time I go food made fast fresh and flavorful  great prices staff always happy and smiling and never a long wait . Great place to get food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BN_ofVOR2_k5QKQWpHZyuA"
  },
  "pP1YDO0zSFR1HeguVMdIew": {
    "date": "11/26/2017",
    "text": "We have been searching and searching to get Chinese close to NY. We were realizing that we would probably never find one then out of the blue we stopped here and ordered.  We were pleasantly surprised when we tasted our food and it was near perfect. There are small taste points that were a tad different but this is the closest we have come.  The restaurant was larger then I thought, they have the next space as well. There are tables in there so you can eat in. There are boxes of sauces that are a grab and go. We waited a bit but there were people in front of us waiting as well. I mean, I guess that's a good sign. We ordered so much food we got a free soda. If it's free it's for me. We were also surprised when we were opening the boxes we got a bunch of Chinese donuts... it was like we hit the jackpot.  This is our new spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "QFtcFkrpsPVhx91b8veWtw"
  },
  "BmG2B59PXrs_yBu5fD5kFg": {
    "date": "2/23/2017",
    "text": "We wanted to try a new Chinese place and decided to come here earlier this month and order take out.  We went in and ordered, took about 20 minutes for beef with broccoli, sesame chicken, and egg rolls.    The amount of food you get for the price is amazing!  We ate off of it for days (eating the proper portion size people) and enjoyed it every day we had it!    Beef and Broccoli - good, could use a little more beef compared to the broccoli amount, but the broccoli in the sauce was awesome!  Sesame Chicken - good stuff, no complaints.  Egg rolls - typical egg rolls.  They threw in some fried sugar rolls (not sure what they are called?), but they were good too - we had them for breakfast the next day!  Good overall Chinese food, not amazing, just a good go to quick place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9ldTnx9o0_NPTkV638r0hQ",
        "caption": "Photo of Golden China - Fort Mill, SC, United States. Good stuff!  Beef with broccoli and sesame chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9ldTnx9o0_NPTkV638r0hQ/o.jpg"
      }
    ],
    "user_id": "hXQHu4Isp1wZYO6A-I0zQg"
  },
  "gikiYIiKNY4uVqp8w4xg1g": {
    "date": "6/12/2018",
    "text": "Was ok, nothing to write home about. Food was just meh, egg roll wasn't even good. At Atmosphere is not good for a restaurant more takeout",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRvP6_HWwRiisM3NiNOG5g"
  },
  "kouuE-ZMi9fQ-TTKKGLlrQ": {
    "date": "12/26/2018",
    "text": "I've been going here for years and every meal has been fantastic.  The owner is super friendly and there's always plenty to eat from your order.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMY39ePczogMk7bh4oBTDg"
  },
  "v74LVgxbcL37X4cINdwXwQ": {
    "date": "12/20/2018",
    "text": "This place is awesome. The food is always great  and honestly cheap asf. The nice lady behind the counter even sneaks us in some free Chinese sugar things in the bag sometimes. 10/10 would recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QJ2I3f3f7IjZiuqzpkA25w"
  },
  "of6DF5j5Sh3CS4fZ8-8WVg": {
    "date": "12/13/2018",
    "text": "Fast and easy yummy Chinese food. We are repeat customers! It's clean and the staff is nice. They added a bigger dinning area recently too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AX5HW8ghrBUNE705W2xf9A"
  },
  "ptaOX0IxHSsTg5l5J1VtRA": {
    "date": "1/13/2018",
    "text": "Hands down the best Chinese take out in the area. Found out they are from NY and they know how it's done. Large portions and the price is on point too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x6rTVCfO5MRaJSBJRjeCKg"
  }
}