{
  "byMwPzv7Af-22fCrKAaH9A": {
    "date": "12/20/2013",
    "text": "Had baleada 5 and it was really great and cheap. Can't wait to try more.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "U9HYVP8Hyuam4ikVMHjZ5w"
  },
  "KDQGQVvcesKfSKdteyL8eg": {
    "date": "5/21/2013",
    "text": "Fantastic! The food is exceptional, prices are great, and the pictures on the menu are exactly what you'll get on your plate every single time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xSlZoZ1IDejYVgCGGgBbZQ"
  },
  "RpYbg6_51zwPslV7hojk5Q": {
    "date": "3/1/2014",
    "text": "Great food, clean restaurant, & the menu is huge! Try Honduran dishes- they're to die for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LLFy69SeOeWoBYdyyISrPA"
  },
  "fezzQHsluMa_wYszJQ0gQw": {
    "date": "5/21/2013",
    "text": "I would have given this place 2 stars but the food was good. Staff was fairly inattentive, only checked on me once. Beer was not ice cold, and no draft selection. Food was pretty good. I can't remember the name of what I got but it was pork chops on top of a bed of typical Mexican restaurant salad fixings, shredded lettuce, tomato, with a side of white rice and refried beans and fried plantains which were good but some of them were dry and almost cold. Overall I would say meh, I've had better. Also the restaurant seems to be for Latino people not Americans. I did like that everything on the menu had a pic!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKBw8lkqyLtwcy7SQNjoOA"
  },
  "Gsel2I-OfvULHg2QOcbmJg": {
    "date": "6/4/2013",
    "text": "I have to say the food at this place is quite delicious, however, the service is absolutely terrible!!! The plates are HUGE and portions are generous. Just be prepared for your server to not be super peppy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uThh6C2Ei1c2Zo1ZYztsLQ"
  },
  "zQRWVDWS5A7q9WjkJhJF_A": {
    "date": "6/26/2013",
    "text": "Great, authentic Mexican and Honduran food. The best I have found after touring the South Boulevard corridor. The lunch specials, 11-3 including weekends, is a steal. The portions are a crime... Take some home!  Ordered a tamale ($2) and plantain empanada (also just $2) as sides... Both were outstanding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "UUFQeUJO2-Jq1nNM8l58Fw"
  },
  "q7rt5DGHyRoPhneMduh5rw": {
    "date": "12/8/2012",
    "text": "Dos palabras: Me gusta.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4f1k-DnBUxXe6vVzksrrHA"
  },
  "e3maCv0yDfdaJZupNLinew": {
    "date": "3/24/2014",
    "text": "Hands down, this is among the best Latin American foods I've experienced. I am not going to subtract points for customer service, or for servers not speaking English. ARE YOU KIDDING ME??? This is the reason WHY the food is so exceptional. Look, if you want the American experience of eating Mexican food, go to Taco Bell, or On the Border. But if  you want authentic, quality food that Latino people actually frequent on a regular basis, then this is it. My husband and I were taken aback when we were greeted in Spanish, and saw that the restaurant was full of Latin Americans, but it was a GOOD \"taken aback\"! LOL. What went through our minds was: \"Oh yes, we're in the right spot!\" And the food did not disappoint. If you're smug and are put off because you have to wait a few moments for them to bring and English-speaking host to seat you, then that's on you, but you're missing out!  :D",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yrGM68FwzPsMnV6kSAuMtQ"
  },
  "u7n4kRKbNakbnUBygb3A0A": {
    "date": "12/22/2011",
    "text": "Open late, full bar. Really good food. Everything I had was good, even the flan. Huge menu, great prices. My friend had the Guatemalan plate which was like $20 but it looked great( sausage, red beans and rice, chicken, shrimp, steak, plantains and a salad). I thought it was an awesome price. Some of the servers don't speak English. My first one didn't understand me but She had another server that could speak English wait on us. She could've been a little better about Checking on us more frequently, but I personally enjoy long dinners",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UjshtxR8O6IEDGq6-K6vRw"
  },
  "GG8efEiSo_XMOKRe1a3GLA": {
    "date": "1/13/2012",
    "text": "I like this place a lot but i was a little disappointed because they don't do pupusas con frijoles y queso. :(((  They just have pupusas con queso and like two other choices. Other than that its cheap and they were really nice to me so i was happy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OiGB8aM8BbiOWi_zX-TIvw"
  },
  "iVdqxPE9yy3y9cQwQm2MZw": {
    "date": "12/3/2010",
    "text": "The pupusas are terrific but the service is lousy. The food here is great with a great variety of Honduran, Salvadoran, and Mexican dishes. I tried pupusas and tamales here and the pupusas were great and the tamales de elote were average. My friend ordered a half chicken with plantains which he said was rather good. The portions are big and generally a good value for money. The service is rather lousy. I pointed out to the waitress that my friend was overcharged on the bill and she refused to correct it and was icy from then on. She wasn't terribly friendly to begin with but it was solid ice by the end. Oh well.... If you don't mind the service, the food is terrific.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wsyii1OPKbezYerRCqY3Aw"
  },
  "_AdX6YlBIviTSE_pDEWORA": {
    "date": "3/10/2013",
    "text": "BEST spanish food in Charlotte.  They have the best pupusas and the prices are reasonable.  I love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "gdyYCcyqjuwFCgzHDw6tIQ"
  },
  "4uKJ-5dUNGruz41e7QcqtA": {
    "date": "2/18/2012",
    "text": "seated quickly,drink orders brought fast, with spicy and flavorful fresh made salsa hot thin crispy chips, waitress spoke some english, good for me foor was out of this world, just like Hondouras,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MgWEPD6KhaEV_umNH-HMJw"
  },
  "Hc6ZK4VgwLih8qglBtxAtg": {
    "date": "10/8/2014",
    "text": "Love the food! Always fresh, big plates, authentic.  Saturdays are busy, but it is not a fine dining place anyways",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxKdIlgEOUiweY-joDEWDg"
  },
  "AAodu7lmZuRYs2_N0EkaQQ": {
    "date": "1/26/2016",
    "text": "Went there once wont go back again. Place was really smelly for one. The service was terrible lady didn't come around to give me a refill or ask if the food was ok she dissapeared! Then they don't even have a big selection of drinks. This place didn't amaze me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XLAopgQIgpFXSNlNC274UA"
  },
  "cZrkCJesuNO0fTRvK-D56A": {
    "date": "10/18/2015",
    "text": "Horrible experience. Ordered one if the most simplest plates 'Quesadilla w/ Carne Asada' waited,...and waited my family finished eating before I even got my plate. By the time They brought the plate over everyone at my table were done eating, so I had to get it to go. One thing I hate the most is people messing around with my food. This is ridiculous.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QOsLuYw5ihQ8Ine3NEdVrg"
  },
  "E1Z7GHhax2gtVlwLjqghcg": {
    "date": "3/1/2014",
    "text": "We had the tamales de pollo & it was 4.5/5 for flavor & taste. We also had the baleada which was chicken, beans, avocado, Mexican cheese, sour cream which tasted like a perfect combo of savory & satisfying. The servers were polite, helpful & knowledgeable. They were intelligent in suggesting entrees in English. If you are a world traveler take a trip here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "tApvDCi1N9fJUctSktMMYA": {
    "date": "2/20/2013",
    "text": "I ordered the stuffed plantain and a pupusa. The pupusa was ok-good, and only left me craving a fantastic one from el pulgarcito de america. I didn't care for the meat in the stuffed plantain at all.  I also got a mango drink that was very good.  Service was very friendly, but also very inattentive, especially when it was time for the check.  If I were in my grandmother's little town with nothing, I would go back, but not in Charlotte where we have so many better choices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWFc8k7e61RmCJL2xQmWRA"
  },
  "LCLXH6uZ5MmZbDKZbHwqWw": {
    "date": "12/29/2012",
    "text": "huuuge portions, and tasty food!  Just a heads up, most of the staff doesn't speak English, though the menu is in English and in Spanish so you can make a choice and then point if necessary. Even though members of our group speak Spanish fluently, our pale skin immediately sent the hostess for the English speaker on staff. Can't blame them, I guess, but in case she's not there when you are, you can still get a good meal!  As others have mentioned, the menu is fairly large, and encompasses a few different regions. We ordered everything from stuffed plantains to chicken and steak tacos to pinchos to a beautiful shrimp and fish dish, and some were accompanied by fantastic house made tortillas. I ordered the chicken pinchos. YUM! Perfectly cooked, a nice sauce, rice, salad, fried plantains, and a small odd shaped hot dog tasting thing (we've made our best guesses, but I'll just tell you it mostly tastes like a hot dog and looks like it went through a cookie cutter). I couldn't finish my large platter, and actually most people couldn't finish their plate. Hello, 4th meal!  We asked if they had any draft beer, she said \"yes\", but it was all from the bottle. Oh well. Pretty good service, jukebox, delicious food, I'm ready to go back!! CMYE?? (and pay at the counter on your way out)",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "n_zJNVFWUwyzryuFf1v9pw"
  },
  "rAMM6XGeA-8GsSJUc9lITQ": {
    "date": "3/1/2017",
    "text": "Good food but horrible service or almost none ,beside none of them seems to know what they doing!! No refills,rude cashier,won't even make an eye contact,this is the most clear example of crow of monkeys running a restaurant, save your time ,$$, aggravation and go somewhere else .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7_5jTxISv003BYtfGyNU4Q"
  },
  "EMPGr4b1E0qtTQuL49KK5Q": {
    "date": "2/13/2016",
    "text": "My husband and I eat here often. Food is always great. Service is ok! My favorite dish is taquitos but I've tried various menu items and everything is good! As far as service, sometimes it takes a while to get the food out waitresses aren't always very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ouwjb2KdG_zOO28MtNy1Hw"
  },
  "hxl6ciIBKp3fj_kCuSIbiQ": {
    "date": "11/23/2010",
    "text": "More Honduran than Mexican, forgive my categorization.  Lempira's menu is huge, HUGE, like Greek Diner scale with many typical Mexican delicacies (minus Mole), Chile Rellenos, Fajitas, Burritos, Burritos Suizas, etc. We went for pupusas but ended up with more - Boltanos, like an open-faced brekkie burrito, cheese, eggs, beans, avocado. Some sort of empanada wrapped entirely in plantain and deep fried, filled with some sort of rice pudding. Deserty. But delicious.  It can be a struggle to eat here if a) you don't speak a lot of spanish and b) if you're vegetarian, but both of those apply to me and I left very, very full. As we were poking at our various foods, enormous Platos Typicos were steadily streaming out of the kitchen, all large and enticing. Veggies will stick more to breakfast, empanadas, pupusas, and burritos. Be emphatic - some menu descriptions forget to mention ham, etc.  Ask for the spicy salsa when you sit, as their gringo Red is mucho boring. They also do Botela Coke - enough for two to share. 6 dollar lunch specials daily. Breakfast combos served all day long. Lots of wood and curved doorways. Neato.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AgadOZZQJ2mWcMP5OyFSbg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/AgadOZZQJ2mWcMP5OyFSbg/o.jpg"
      },
      {
        "img_id": "_KZgHMUzBn9m6noKA_BQdQ",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. open face brekkierito",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_KZgHMUzBn9m6noKA_BQdQ/o.jpg"
      },
      {
        "img_id": "0k51ReDHLrG9uWpkomCfow",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. pupusaaa!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0k51ReDHLrG9uWpkomCfow/o.jpg"
      }
    ],
    "user_id": "whqfWVBj4x5EDboIVDOymQ"
  },
  "GqggkiagLAfs1WtudGV0fw": {
    "date": "6/9/2013",
    "text": "The food is worth 5 stars.  Minus 1  for no one understanding English.  Call to ask what time they stop serving lunch the person that answered gave me to someone else, the person she gave me thought I was asking what time they open and close, so that's the answer she gave me then hung up. After eating here, minuse 1/2 for the fact they have a full dessert menu but had no dessert prepared. When I got there asked what time they stop serving lunch she said lunch is good all day when I got my bill I was charged full price. Minus 1/2",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aXhMt_8ZDmfpr2QZ3zlmog"
  },
  "6oqgg6nGH7t5O5slDZnn0g": {
    "date": "8/19/2015",
    "text": "Service was terrible. I understand not everyone has to speak English but know and speak enough to take the right order. My friend ordered food and she brought out the wrong one and they still charged them for it. Brought our food out cold. The waitress attitude was awful and was more focused on her boyfriend being there than her customers. I usually have good experiences here but this was enough to make me look at other options.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NVF3lQWhnWkqFs6QiYdXg"
  },
  "6ARmnWo9hFUsVcF2Yzb-eQ": {
    "date": "11/5/2016",
    "text": "Worst experience ever I order a California burrito my dish took for ever out of my groups order and was very burnt I just ate what I thought was safe very rude customer service but what do I expect from a place like this I should have turned around and left be warned",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7OQWQjsLFB-5W2cOrsxTA"
  },
  "EwGgvNsxuik-lgXijDR2_g": {
    "date": "7/23/2015",
    "text": "Wow.  I called 3 times to place a to go order and was hung up on 3 times.  Thought the first two times may have been accidental, but on the 3rd try it became pretty apparent it was deliberate.  Would have liked to try the food, but it's already left a bad taste in my mouth...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHBJl3h8oaKhQZzvkhI1xw"
  },
  "npBOvAUt41BBgBkS5Jgqtw": {
    "date": "5/26/2015",
    "text": "Food is absolutely amazing!!! This is a most if you love Mexican and Central American food!! Totally recommend it!! Service is great the food is on point!! Only problem will be to choose. They have a lot of great choices!! I personally love the chicken in cream!! But their steak is off the charts!! Great food and the price is great. Here you don't pay for what you get... But on the reverse of what this comment usually applies to... You get more then what you think you are paying for. Great food!! Great price!! Great service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dufoZUrTVwPGqa3VmCl3ug"
  },
  "mMYR9zjn3ct04Cig28F9bw": {
    "date": "9/18/2015",
    "text": "Had the super nachos and added shrimp to them which were a dollar each. A total of 5 in an order which is pricey but didnt mind paying for. When i opened the box I found that all 5 shrimps were not cleaned at all which was disgusting. Also the beef used for the nachos seemed like the fatty bits not used when butchering beef. Very disappointing experience these nachos are very photogenic but not worth the money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w4iqghKkHqKQKm-IEzjduQ",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. dirty shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w4iqghKkHqKQKm-IEzjduQ/o.jpg"
      }
    ],
    "user_id": "6yGZkTWtelluuCsBSriu-g"
  },
  "rTJ5CquksgSYcyhaTHvCqw": {
    "date": "1/5/2015",
    "text": "I'm not an authority on Latin American food but it seems rather authentic to me. The staff is nice and they do have a few who can speak English. The menu has English translations which is also very helpful!!  We got the chicken flautas, chicken in a jalepeno cream sauce and the carna asada. The flautas were okay but you could really taste the lard in the tortillas. The Carna Asada was a little over cooked for sure but had a great taste. The chicken was delicious and was very spicy but yummy!! Neither of us were a fan of the tortillas that came with any of the dishes. We just could really taste the lard that they used which is not something either of us is used to. Over all though it's a decent little spot to check out and they are open late.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "txmVrcolOnA3v35SA9o9dw": {
    "date": "10/12/2012",
    "text": "This place is incredible. You know a place is authentic when English is not the first language you're greeted with. This place has a HUGE menu (like 6-10 pages huge) covering several ethnic divisions of cuisine. From Honduran, to Mexican, to Guatemalan, they have it all.  I have the whole fried fish and it was excellent. The plate was incredibly vibrant with bright flavors and colors. The veggies and fish tasted incredibly fresh. Word of advice though, watch out for those tiny fish ribs. They'll do a number on your mouth if you're not careful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIvYBWcoXJdJ22CSLKw5Sw"
  },
  "a5Qzu925PWo00xNbXObq2w": {
    "date": "4/6/2015",
    "text": "L'Empira boasts the best authentic Latin American cuisine in the Central Ave. area. There a lot of similar restaurants within a mile of L'Empira, but L'Empira is by far the best. The food is very good. I've eaten here twice and my only complaint is that the chicken in the tamales had some bones in it. The rest of the food was very tasty. The portions are very generous and the presentation looks very nice. The attmosphere feels fancy, but the prices are very reasonable. Overall L'Empira provides an enjoyable eating experience and I am always glad I chose to go here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09W5Ej_HyDNXVZ8a7rjf7Q"
  },
  "ytgerCxoHxRBLHFiRS7eWw": {
    "date": "11/15/2011",
    "text": "I love this place.there is music playing + a jukebox, bar and big TVs. the menu has a variety of plates from Honduras & Mexico also some American.  Huge portions @great Price highly re comment it..& sure I'm coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ho6P5F22LqCt9_BUOyoWLw"
  },
  "LqUKP3knJVGQyr-Gs7BFTA": {
    "date": "1/26/2014",
    "text": "I've been living on this side of town for almost 6 years, and this is the first time I ate here. Only ordered the chicken flautas to go, and OMG,  it was so good!!! I haven't eaten these since I left NY, and it reminded me so much of this Mexican joint I used to always go to. It was just an appetizer but they add lettuce, tomatoes, onions and guacamole so you could easily have it for lunch or dinner. Ok, rant over. :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "XltYfJ_auDVYQJNX9t9ULg"
  },
  "9zn0wZQ9VueikCZU13gq5g": {
    "date": "1/6/2018",
    "text": "El servicio de la comida es fatal. Los cocineros no hacen la comida conforme llegan las ordenes. Les llevaron la comida a otros clientes que llegaron despues de nosotros y luego nos llevaron parte de la comida y esperamos un buen rato por el resto. Hable con la encargada y me salio un poco pesada y no pidio ni disculpas OJO.. Hay opciones...  The service was horrible. Orders are not prepared at in order. People that arrived later received their food first. The person in charge was arrogant and didn't even bother to apologize. Three tables that arrived after us received their food first and we had similar orders.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jrti1Npb6F3W6i026Uhdrw"
  },
  "fiASY4PmbR6jVz4GTKktQg": {
    "date": "12/13/2017",
    "text": "My girlfriend and I ate here for first time, I asked if they served chips and salsa... server said they were out. I asked again after food arrived and she said the same thing. The food was very good and affordable, but couldn't help but notice another larger party seated received a large bowl of chips and salsa... It rubbed me the wrong way. I don't understand why we were lied to? Plenty of other Mexican style places to eat on South Blvd, don't know if I will go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x8SmZdn-Z6rs0VvTZQeSjw"
  },
  "9DlQJhSKiRJw5Qzh7PfmPA": {
    "date": "3/30/2014",
    "text": "I'm always up for trying new places and my boyfriend loves Mexican so we thought we would venture out of our norm and try some place new.  This place has a huge menu and the prices range along with it. Their lunch prices are what you would expect but if you don't find what you want there you'll pay a premium for their dinner prices. They have Mexican, Honduras and other south/central American food.  The food was very good. Had great presentation, great flavor, and huge portions.  The staff was friendly but the food took a long time. I probably wouldn't have noticed if we had chips and salsa to munch on. Our drinks were never refilled even though they sat empty half way through our meal.  The highlight to any Mexican meal is the chips and salsa. Theirs ended up being very good but we didn't think they served any until we saw a near by table get some. At that point we already had our meals!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zNEDHek30ekPYSRSSXRQ1g",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Burrito...too big to finish!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zNEDHek30ekPYSRSSXRQ1g/o.jpg"
      }
    ],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "xAeKOg5sae60ebmR8a3Z0w": {
    "date": "1/20/2013",
    "text": "So we found this little treasure off of South Blvd, based solely on the awesome Yelp reviews.   We walked in and were greeted and seated right away. Chips and salsa were presented immediately and then we got our menus. I loved the menu...there were tons of pages and options...anything you could possibly want chicken, seafood, beef, steak and great  pictures under most all the dishes so you can see exactly what you will be getting which made me as a hungry and confused first timer very happy!   After some questions and review of the menu we finally ordered I opted for the lunch special, burritos and cream sauce.   Okay, first things first,I agree with the previous review portion size here is here is out of control!!! There were so many plates always coming out the kitchen loaded with tons of great food! I couldn't wait to get mine and I was not disappointed!  When my burritos arrived all I could get out was OMG! They were huge! Packed with delicious shredded chicken and rice... My favorite part of the dish was the sauce. It was so flavorful and had a very nice kick, but if you want to kick it up make sure to ask for some of the hot sauce from the kitchen, it's so freaking good!   Needless to say we both left stuffed and happy! This is a great place for some Mexican grub and I look forward to going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PMlXgQI992q3kzOmuWkVxg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PMlXgQI992q3kzOmuWkVxg/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "VmF71Bl8_yrYUmNwZZXqeQ": {
    "date": "10/12/2017",
    "text": "This is one of my favorite authentic restaurants in the city, flavorful and great portion size. There us a great selection of Mexican, Honduran and Salvadorian foods. The menu is extensive, definitely would try some new each time you go.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QQ_A1yOnB8tCNfylxKsUxA"
  },
  "HgmoEuTHiRZeuWGU4Y0tHw": {
    "date": "12/13/2014",
    "text": "Paul's YER (Yelp Elite Rating): 3 Stars.  Went here with my buddy Paul who raved about their Sunday brunch. Being part Salvadorean, he speaks Spanish so I felt like I had a crutch. Well thankfully I went with Paul because ENGLISH IS NOT SPOKEN IN THIS RESTAURANT!!! For all my fellow gringos out there bring a Spanish interpreter because you won't be able to order. I still am shocked about this but our waitress didn't speak a lick of English nor did I hear anyone else speaking any English except for me and my buddy Paul. I'm still quite shocked about this. So was Paul!  Down to the food. Well, that pesky Language barrier again. I was VERY clear in what I wanted. In fact, I POINTED TO THE MENU and said \"aqui.\" I don't care if she only spoke Farsi pointing to WHAT I wanted should have done the trick. Well guess what? She brought something totally different. Was it good? YES! Very good actually. Then my dish was supposed to come with Chorizo. It didn't. Thankfully my buddy Paul TRIED to communicate to her what was going on and after about 30 minutes a Chorizo finally came out.  What my friend Paul got was quite good as well. But he felt that his beef was over cooked. I tasted it and while I thought the flavors were excellent, it was clearly overdone.  We both enjoyed the food. But when nobody in the restaurant does NOT speak any ENGLISH in your own COUNTRY, then I do have an issue. I'm ALL for speaking another language. Both my parents \"Mother\" languages were not English either (Tagalog and Croatian). But they learned.  I really am befuddled at HOW they expect to have a THRIVING business when NO English is spoken there? I mean, it's GREAT that they cater to the Latin community for sure. But NO English? At all? Really? WTF?  That's all I have to say.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-Biypdg103SEqXBm_kwhnA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-Biypdg103SEqXBm_kwhnA/o.jpg"
      },
      {
        "img_id": "cQyEA_0Lbk0jd5UbWVUIEA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cQyEA_0Lbk0jd5UbWVUIEA/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "BWe_xZU6tawETC2iqC_R4Q": {
    "date": "7/14/2016",
    "text": "The service was okay, the place is in an okay spot as well. The menu is about six pages long and the text is kind of hard to read but there is a lot to choose from. I liked my food. I ordered the \"Mexican Carne Asada\" The menu states the different type of meats and the sides they come with. The horchata was not my favorite.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oYf5m0vyL7AOXBicacw5GQ"
  },
  "sdEq0bzkHtbkVJc3YccOBA": {
    "date": "4/25/2017",
    "text": "Really tasty authentic food.   Downside is they're painfully slow especially if you're white.  It's True.   And if you get take out.  Girl and I love the food though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6XxUziYK9Tr018pSqf_6ZQ"
  },
  "3rRGF8RiKBesdu6E3fyELg": {
    "date": "12/15/2016",
    "text": "This an authentic food restaurant, from the moment you sit down you will know you going to enjoy this place. Try the Honduran parrillada and the baliadas, thus must have.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "38iVPLSqfTsE8a2ukrASbQ"
  },
  "Yz6XGXpQpDWei6BiqWKwJA": {
    "date": "10/6/2017",
    "text": "Terrible service new waitress seen me being young thinking probably I wasn't going to tip her or anything . So chose not to bring me chips and salsa . However , 3 different tables came in right after me and they got them . Never came to ask me if I was good or anything . Food was pretty good tho",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aAftrpA8CLK9MsDWHOcSoA"
  },
  "GmW67LRKrdWiUxwZxnpktA": {
    "date": "10/7/2016",
    "text": "We were heading to The Burrito Factory (also delicious), but on Taco Tuesday, and Taco DAY, the line was out to the door. We saw Lempira next door and my daughter and I had never been, so we stopped in there, and were pleasantly surprised. She ordered the chicken tacos (3 large tacos) to go, and while we waited we decided to have a tasty Margarita in their little bar. The same lady waited on us at the door and behind the bar, and was extremely pleasant and friendly. We enjoyed our short visit very much, and look forward to returning with  group next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "CPodThzsqATG_Bc8a4an_w"
  },
  "FNDGmQtPEvIiaGTfrQtl-g": {
    "date": "4/27/2016",
    "text": "Fantastic service..  excellent food.. large portions..bring your appetite or share with a friend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lMlmswaLzeFDbFe9LI_RUA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lMlmswaLzeFDbFe9LI_RUA/o.jpg"
      },
      {
        "img_id": "n9C60Qqk2IZt8BVorUZ_Rg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. So yummy",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n9C60Qqk2IZt8BVorUZ_Rg/o.jpg"
      }
    ],
    "user_id": "IMV8I_Asb-AK--t9ftSWmA"
  },
  "-bXILfrLMQPZ3FaCbdJafQ": {
    "date": "8/15/2015",
    "text": "I have three words for you that will change your (food-loving) life... CARNE ASADA TACOS...wait I have a couple more words for you too.. CHORIZO TACOS. Not just any ol' carne asada or chorizo tacos but the ones at Lempira...and not at just any Lempira (and Ive eaten at all of them except the one at Steele Creek ..I think ) but the ones at the South Blvd location. A couple things you should know about me first. ONE : I am not one to order tacos when I go to a south of american food spot. I know, its the authentic thing to do, which is usually what I'm all about but something in me needs cheese when the option is there. Oh and a chimichanga..and TWO: I can be a bit lazy at times so I am all about convenience. Why on earth would I drive 20 minutes to a location on South Blvd when there are 2 Lempiras within a 10 minute radius of my house?! the answer is simple. THREE: friggin' crazy good food trumps everything.  Im always so underwhelmed by tacos I've have at other comparable restaurants in town, and even when I've even had these exact \"Lempira\" tacos at the new Central Ave location (bleh) and at the Eastway location (runner up to South Blvd.) they aren't quite as good. Great homemade tortillas, meat is soooo tasty and top it off with a couple squeezes of lime that they provide you and the green salsa...yes. yes. yes. Just please don't go in there trying to get lettuce and cheese on your taco or complaining that the chorizo taco is greasy..its sausage fool, its supposed to be there and trust me its the best part.  So if you are still confused about what to order...here it is: the 3 tacos (at least) which will set you back a mere $6, with at least one carne asada and one chorizo. I usually go 2 CA and one chorizo because the chorizo is really rich. Get them as they come and do make sure they bring you the green salsa that goes with it. You're welcome ;)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gs2sRbzk3mX-hgkDwlbK-g"
  },
  "_2u-cYdx7iFXrg99eKph2A": {
    "date": "7/8/2015",
    "text": "I come here on the regular, mostly for the lunch tacos. If you prefer authentic South American food over cheesy, mild, fatty Americanized SA food then you should enjoy this spot.   Lunch fajitas are great, salsa is a little too mild for me (I love La Unica's salsa verde).",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "phJ5j8RjQMmn0kEv3WGDVQ"
  },
  "PV6eT7knIQBV1Bj5tz9gfw": {
    "date": "12/4/2016",
    "text": "We LOVE this place; absolutely our favorite place for Central American food. We've honestly yet to find any dish that wasn't up to par. Service is not always easy if you don't speak Spanish, but they do just fine if you're patient. Don't be afraid to flag someone down, they're happy to help. You get so much food for a very reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFC_ksWOW5PpppKGeA9XGQ"
  },
  "3oFmBSqQU6GtSXELMzuKlw": {
    "date": "1/14/2017",
    "text": "Really tasty, but maybe heavily salted. Huge portions. Crowded on a Saturday night, but no line. Great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9FPnZGGR1s-vQu5FMTkkCQ"
  },
  "MjnpQgQebYR_vubHYHio5A": {
    "date": "2/18/2017",
    "text": "Been here 4 times now always with friends.  We always enjoy it.  The menu is so large I've never had the same thing twice and I've never been disappointed.  My family has been to Costa Rica and Honduras and we sought out some place to get authentic cuisine.  This is amazingly authentic.  We are usually the only Caucasians in the building and while we might turn a few heads we have always felt very welcome by the staff and the other patrons.  Be sure to find out what fruit juices they are serving that day and save room for some of the smoothest flan in Charlotte.  We are blessed to have a place like this in Charlotte where you can have a little international adventure with such a short drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J-hhWU_p_wE1012PkVnBYQ"
  },
  "hvdOJXub5gKuck1SwtQNfg": {
    "date": "3/16/2014",
    "text": "Came in on a Saturday night......bad idea! I was just ordering food to go, so it shouldn't have been too bad. I ordered 2 pupusas....just 2! (And a small horchata)   Guess how long I had to wait....  50 whole minutes!   FIFTY MINUTES! For 2 little pupusas!   The lady who took my order would periodically look at me and she didn't speak a word to me. No reassurance that my food was on its way. I thought they forgot about my order. On top of that, after she gave me my food, I had to ask for my horchata. She asked me \"what size\"? She should have at least upgraded me to a large because of the long wait and for forgetting to give me my drink all together! Plus, I had to wait another 5 minutes to even get my drink! Ridiculous!!!   The pupusas were ok....not worth waiting that long, especially by myself!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EhIh8Rlu1HA95dIC_CkHTQ"
  },
  "jFRWTAbvG5hH_ESt6Glxnw": {
    "date": "5/7/2015",
    "text": "If I could rate this place anything less than one star, I would. As a server myself, this place gives the worst service I've ever had.  Servers do NOT speak English, and do NOT know their menu. Both my boyfriend and I are white- it is obvious that we were not their preferred patrons by the fact that we switched servers multiple times. Our first server left without a word to us- but visited her Spanish speaking party of four and introduced the new server to them.  My boyfriend ordered something simple- chicken, cheese, and rice. This is known at other Mexican places as \"arroz con pollo\" or, simply, ACP. Our (new) server just nodded and stared blankly. I ordered the chimichanga. For how horrible the service was, the food was not half bad- even though our food did not come out how it was ordered.   The place was filthy- it was dead, but they were sweeping up obviously old food and trash out from under tables. You would have thought they had just had a massive rush. It seemed very dirty- I am hoping my boyfriend and I won't get sick.   I had to walk up to get the check from the counter. I was afraid to pay by card for fear of having my number swiped- thankfully, I had enough cash on me to pay. Honestly, I was tempted to walk out. First time I've visited this place, and I will never return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "608PGQQ_eHhktjqtpswK-w"
  },
  "7oOZC-7qs35vCSIh4ORBzQ": {
    "date": "3/9/2014",
    "text": "Great menu selection would have given it a 5 star rating if it wasn't for the AC Unit, pretty warm eating lunch.  But overall I was extremely satisfied with my selection.  The El Salvador house special plate.  Coming from a cook. The food was made perfect.  Give it a try if you're looking for some Central American food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5qZFiBi49M_fx7_qegZGQA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. The El Salvador Special Plate.. WHOAH!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5qZFiBi49M_fx7_qegZGQA/o.jpg"
      }
    ],
    "user_id": "lzbOiFu190qEhX9tQLFW6A"
  },
  "WJTR_U282O4Ei28iKZmkrg": {
    "date": "8/11/2019",
    "text": "Delicious food for a really decent price. Has become one of my go to lunch spots during the week. Clean environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u7c8PFh1siTt_x2NhdMA7Q"
  },
  "E_Oc7wqlssafgmqDNn_MfQ": {
    "date": "4/23/2019",
    "text": "First off, I ordered tamales de elote con crema and they were super good and it made me happy. My only disappointment was with the service. I walked into the restaurant during lunch time. The counter is right in front of the door and there were two hostess standing there. I walked in and was not greeted by anyone. I waited for a few minutes and the hostess took payment from two tables.   I finally decided to take a menu from the counter myself and order to go. While I was looking at the menu 2-3 men walked in behind me and the hostess greeted them and asked them if they were dining in. The hostess then looked at me and just said \"Are you going to order?\".   I placed my order and got my food quickly. I am just disappointed because I am 6 months pregnant and the waitresses walked by me several times to place their orders at the counter.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BUJs6glj1Xn-P4LdEKeLHg"
  },
  "7wzzgRYsyLUEjqT0y6SaXQ": {
    "date": "11/7/2018",
    "text": "It was a terrible idea bringing me here. Really, really bad idea.   DELICIOSO! This place serves Mexican, Hondurean and Salvadorean food. The menu is EXTENSIVE, there is sure to be something here for everyone. The portions are BIG. I couldn't finish all my food. Casual environment, friendly servers. And best of all, the price is right. For a very decent price, you get a BIG MEAL and very delicious as well.   In all actuality, this is arguably one of the best authentic South American cuisine in Charlotte. Yup, it's that serious. If it's not the best, it's absolutely top three. I haven't met a single person who didn't love the food here. You wont regret trying this one. Come with an empty stomach. Might leave 5 pounds heavier.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VVxDe3-2NdjFPRj1z8Fpgg"
  },
  "2iTavmdcscVB-AtuV19G6A": {
    "date": "6/23/2019",
    "text": "Great newly remodeled place with delicious central American food.  Plantains with refried beans, cheese and central American sour cream is a must along with pupusas! Delicious hand made tortillas stuffed with cheese, refried beans, and pork meat served with a vinegar slaw and tomato sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zHM1ZRbY2C053QsuzusGag",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Pupusas revueltas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zHM1ZRbY2C053QsuzusGag/o.jpg"
      }
    ],
    "user_id": "gX5ANHCpQMpoNMHzpSnN9g"
  },
  "-seYjPaa5iAx2MwGzN2isg": {
    "date": "1/14/2019",
    "text": "Definitely our new favorite restaurant!! I'm not sure if any of the servers speak English, but the menu is extensive with pictures and descriptions in Spanish and English so worst case scenario you could just point at what you want! I speak Spanish so it was fine.  Everything we had was delicious. Mexican coke, pork and cheese pupusas, enchiladas, flautas, a baleada...it was to die for. And reasonably priced too! Service was fast and friendly! Can't wait to come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3S7QKQlLYOLCevuqki64vw",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Chimiflautas lunch special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3S7QKQlLYOLCevuqki64vw/o.jpg"
      },
      {
        "img_id": "vrAD2fyevSvCNh97ry0YUA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Baleada #5",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vrAD2fyevSvCNh97ry0YUA/o.jpg"
      },
      {
        "img_id": "K7UbM95gEIcQKU22NHzSCg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Pupusas revueltas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/K7UbM95gEIcQKU22NHzSCg/o.jpg"
      }
    ],
    "user_id": "LvZ--kzma9nOyTUz2ZHRkg"
  },
  "JBtmbXpiCPBjtk2NPVe_KQ": {
    "date": "10/19/2018",
    "text": "This place is amazing when they get your order right.  Have ordered thru Door Dash a number of times and the regularly mistake bean papusas for pork.  Unfortunately she is a vegetarian.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmyuHkeEuUGM2tqc6LiNGw"
  },
  "h2UZDbHcsc8ZxuB_b5y0kQ": {
    "date": "11/18/2018",
    "text": "This place is the real deal. Food and service is off the chain!! Will frequent this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkOA-3CgeU0KdTE_4Zv7UQ"
  },
  "pZEoUGUsqF0dah4b7FUHSQ": {
    "date": "3/2/2019",
    "text": "Delicious! My wife and I found it by accident. So glad we came across it. This place is our new go to when we go to Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HE3dvmJf2qyDoYzOxN40ZA"
  },
  "mnWnbILXGqSqywRExtjirg": {
    "date": "2/25/2018",
    "text": "This was a good little mexican/salvadorian spot.. Personally have had better authentic food, but if i'm ever getting a craving for some good pupusas I can count on this place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "b9nn2xp5N7hv89RTH3ZJFw",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/b9nn2xp5N7hv89RTH3ZJFw/o.jpg"
      },
      {
        "img_id": "Lqy-5zoT747bOLmLV989RQ",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Carne Asada",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Lqy-5zoT747bOLmLV989RQ/o.jpg"
      }
    ],
    "user_id": "FmG7rhRsUFkpfoQJHX77sQ"
  },
  "pKt1aNCGpmMDqrZcSVIsqw": {
    "date": "10/17/2015",
    "text": "This place might be challenging to really enjoy if you don't speak a little bit of Spanish. While the menu is in English and Spanish, I did a lot of translating between the waitress and my gringo boyfriend. ;)   Food here is fairly authentic and so, so cheap. It's hard to believe the amount of food you get for the price. Papusas & tamales for $2, huaraches for $4, tacos for $6... Incredible! Quality is pretty inconsistent -- some dishes are great and others below average. The same dish might even be great on one visit and not good the next.   Overall, worth a visit though, especially if you catch them on a good day! So, grab yourself a Spanish speaking friend and head to Lempira! I prefer weekend lunch when the place is full.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9pOUsDZVsZzrKWkqXEQtqA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Huaraches de pollo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9pOUsDZVsZzrKWkqXEQtqA/o.jpg"
      },
      {
        "img_id": "8X1ZPE9LttkjtgKQCDRkbQ",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Papusa Revuelta (with pork &amp;amp; cheese)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8X1ZPE9LttkjtgKQCDRkbQ/o.jpg"
      }
    ],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "Nlbj4UwER7MdG7rwtQCMvQ": {
    "date": "11/28/2017",
    "text": "This time we went in and ate it was totally off. The food seem lack luster, missing the flavor of the dish it normally has. All of our dishes didn't have avacados on it, when asked why they said they were out of avacados. Yes, a Mexican running out of avacados. It actually happened. The ribs were full of fat and inedible. The seasoning was off. Will be a long time before I come back agaib",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "egeWhZj4QLO_1u3S2m4idg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/egeWhZj4QLO_1u3S2m4idg/o.jpg"
      },
      {
        "img_id": "eP9gPh50EbAuloK-Ai6-UQ",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eP9gPh50EbAuloK-Ai6-UQ/o.jpg"
      },
      {
        "img_id": "YVqTt4_NNKXmF7cKw6c2eg",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YVqTt4_NNKXmF7cKw6c2eg/o.jpg"
      }
    ],
    "user_id": "EPxevfCcUGXwIGjCbHOQGQ"
  },
  "EcFR1enGdHGVwxQJJMILxQ": {
    "date": "7/18/2018",
    "text": "Good food, fast service, large portions, and a whole lot of mmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ST1-oz8ta0nOOI8l1J7OQ"
  },
  "aSx3juPKqKQqNUKBCr4xiA": {
    "date": "9/2/2017",
    "text": "Great place and food. Atmosphere is family friendly. The horchata was pretty good. You definitely get a lot of food for your buck. Food definitely reminds me of home. Food is authentic and so is the place. English is not first language. Very much enjoyed the place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "h0knWfNvpx1iyMjilhLBWA",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h0knWfNvpx1iyMjilhLBWA/o.jpg"
      }
    ],
    "user_id": "zg3TAzMtKeMocfBIPhHcSg"
  },
  "ObxbcspjZqScdrlvTCZ1vA": {
    "date": "3/23/2018",
    "text": "Love this restaurant! We order food from here every Friday and their food is absolutely delicious! I have never been disappointed with anything i have ordered from here. I definitely recommend coming to eat here because the food is so so good. I promise you won't be disappointed either.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2JYFRbQykKC71-yBxOvycg"
  },
  "YSh8girq1OkP4CoVzIMRqw": {
    "date": "6/21/2018",
    "text": "Food was amazing and authentic. The prices are fairly low and the portions are large. This is a great find.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVwgkS2KCNUI6qENGZSfMw"
  },
  "Y8mD4-LIIXVTP40R3c-ASA": {
    "date": "2/24/2017",
    "text": "Man!!! This place is out of this earth!!! So flavorful and such huge portion! We ordered the huge combo appetizers, which is amazing by itself! So much varieties in one plate! Then shrimp fajitas and pork chop are both amazing too! Best pork chop in Charlotte! Will come back to explore more items on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3kNiFsdv4WwCeqM6seYRLw",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Pork chop",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3kNiFsdv4WwCeqM6seYRLw/o.jpg"
      },
      {
        "img_id": "s90Y4C8iHZqKT_oDHLBA8Q",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Shrimp fajitas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/s90Y4C8iHZqKT_oDHLBA8Q/o.jpg"
      },
      {
        "img_id": "_bB8HGHEhnHW8x2z7SXb5A",
        "caption": "Photo of Lempira Restaurant - Charlotte, NC, United States. Combo Appetizer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_bB8HGHEhnHW8x2z7SXb5A/o.jpg"
      }
    ],
    "user_id": "F7tnylvLI_5KZVWs9PUirw"
  },
  "O9Whdj-ddkDrlT3QaKAW9g": {
    "date": "5/14/2018",
    "text": "Me and my roommate came to this location tonight and were literally denied a table. We walked miles at 11 pm to find a restaurant still open and this was the only location. When we walked in a gentleman (who I assume was a waiter) looked at us up and down and chuckled and walked away. We waited in the foryer for several minutes and literally every employee walked by and just LOOKED at us. My roommate finally politely asked \"can we grab our own table or should we wait to be seated?\". The young lady at the counter wouldn't even respond. She asked again and her response was \"what are you guys here for?\". At the point she summoned over another young lady and they began speaking Spanish to each other.. I asked the other lady \"what time do you guys close?\" And her response was \"we're closed now.\" At that point I knew something was off. I chuckled and looked at my watch and asked \"well, it says you guys are open now and your lobby is packed, so you guys are closed now?\" She just starred at me. She literally didn't even respond. I hate pulling that card. I genuinely feel like we were literally denied a table because we were black and out of place. I'm so angry at this visit and will NEVER go back to this location, even though I'm obviously not wanted there any way. No harm done I guess.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ooejzXrEK1KcuOTIooArA"
  },
  "Ut-f71iRgKZJ81T1VDrmWw": {
    "date": "2/20/2018",
    "text": "They don't care who you are!! They will shut you down just because, they will take your money first and they say they are closed... shame on you them!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "os6ydgkr99JAw33dzucSXQ"
  },
  "j_E5UjAJWDzPB9OiaJMXrA": {
    "date": "1/14/2018",
    "text": "This is absolutely the best authentic tacos you  can get anywhere around Charlotte! Always full of flavor and the tortillas are homemade! They have a huuuuuuge menu! We usually get a Salvadorian Grilled Platter which includes Carne Asada, Grilled Chicken, Grilled Shrimp, Sausage, Pupusa, Plantains, Rice and Beans and a side salad, the platter is around $20 which we always share. We've been going consistently for a year so far. Our complaints usually are that they don't give you much ice in your water, we usually have to keep asking for more ice and they seem to always run out of avocado. The servers tell us the Owner gets too cheap with stocking enough avocado because it's expensive seems to be the constant explanation we get. Other than that, the food is always excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MhfuBoOywWZxmQWximmFvg"
  },
  "a0IS9k3hDSm0VuqaqdAVTQ": {
    "date": "12/28/2017",
    "text": "Was greeted & seated right away. Very attentive staff. They have beer and an assortment of tequila. Food was delicious and extremely fresh. Love the wide range of variety.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eWukU0DS1gy9xZPHpEl6iw"
  }
}