{
  "-5YNds8XHM6q4kAooaceLA": {
    "date": "9/19/2016",
    "text": "I and nine other coworkers decided to dine at Chili's last night (September 16th). Chili's was chosen because we were celebrating a coworker pursuing a different career. We had a reservation for 6:15pm. Our waiter, TJ, advised us that due to the size of our party, he would have someone helping him. Here is where the dining experience and customer service level quickly diminished. There was a long wait to receive our drinks. I understand the bar has to make the mixed drinks; however, waiting for at least 20 minutes is unacceptable. My coworker whom we were celebrating ordered a frozen Margarita. When the waiter returned, he advised her the machine was broken. She attempted to make light of the situation with a joke; however, the waiter was clearly not amused. Her next choice was a regular Strawberry Margarita, and there was still a long wait time to receive that. Her first sip of the drink confirmed it was not a Strawberry Margarita and the color was extremely pale. When she advised the waiter this drink was not what she had ordered, the waiter appeared uninterested in correcting the issue. My coworker had to take it upon herself to go directly to the bar and have another drink made. At this point in the evening, we asked our waiter what had happened with his help? His response: \"I wish I knew\".  We realized there was no salvaging this dining experience. We advised the waiter we would like to cancel our food orders and close out our tabs on the drinks and to please send the manager to the table. We advised the manager of our reason for dining at Chili's and that we were unhappy with the long wait and lack of help for the waiter. The manager was clearly disinterested with our complaints and offered no reason as to why the waiter had no help. She offered no apology and was clearly unconcerned about the appalling service we had received . I remarked to the manager that a simple \"I'm sorry\" would have greatly alleviated our frustration. Her lack of concern confirmed that our dining experience was not a priority. A few minutes later, the manager returned to the table and advised that our food should be ready in 10 minutes. Clearly, she did not comprehend our basic request, nor was there any communication between her, the waiter or kitchen staff. What part of \"cancel the food order and close out the drink tabs\" is difficult to understand? During the duration of our visit, I noticed the restaurant was never very busy or full, and now I understand why. Chili's located at Whitehall Commons # 864, 8164 S Tryon Street, Charlotte NC has lost mine and my coworkers' business.  I was advised via email to include my phone number and a supervisor would contact me in 24-48hrs. I have not received a phone call in there stated time frame.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6QG8oneXiMPmlHu9EhMPVA"
  },
  "wj6lo_SIJjzIWTiHrcKYTw": {
    "date": "7/4/2014",
    "text": "Go sit in bar for drinks. In the dining area you will get great or lousy service depending on server.  One of the best places to eat in the Whitehall area. Very good standard food chain.  Tables for groups is nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fgnfhig1Z_elsq6fFKCrOw",
        "caption": "Photo of Chili's - Charlotte, NC, United States. The food was fine. But why did they seat us next to a booth full of kids with a cough reminiscent of the bubonic plague.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fgnfhig1Z_elsq6fFKCrOw/o.jpg"
      }
    ],
    "user_id": "mZY3NljShzpVihYYT0vk3w"
  },
  "t4QFGha3CWkBIVuoS0rLPQ": {
    "date": "9/15/2016",
    "text": "My husband and I visited there today and I have been sick since I returned home.  First the waitress seemed upset that we came in to start with the napkins and silverware were thrown on to the table.  The food wasn't very good. My husband ordered a cup of chili which was terrible mush with a bitter canned flavor. He also had ribs and mac and cheese.  The ribs were dry and overcooked and the mac and cheese was horrible.  I had a carnita burrito which I only ate half of and within an hour I was sick. There was also a peach cobbler dessert that should have been served hot and it was barely warm.  The manager credited the cup of chili, but the the entire meal was terrible and I would never return.  It was a nearly 50.00 nightmare.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yK7ULw3YtMH89e3ZMc3zCg"
  },
  "6MzhOrhtRbgI_JIceL8WhA": {
    "date": "4/24/2015",
    "text": "This was my first time dining at this location and it will probably be my last.  I wasn't impressed at all with the food or the service.  Right after my daughter and I were seated and given our menus, our waiter came over to take our drink order....Can I look at the menu first? The waiter walked away for a few seconds and returned to our table to take our order, she literally stood over me as I looked over the menu. She did the same thing when it was time to order our food. I was annoyed! Our food finally arrived and it wasn't that great. I ordered the Chipotle Fresh Mex Bowl....I've had better! I guess I was comparing it to Chipotle.  I should have known something was wrong because I had a hard time deciding on what to order from the menu.  At least the Strawberry Lemonade was delicious!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "ThzLUv5QqLjowrusyshurg"
  },
  "kGh_fj7cSIeQrlg_rvdhPg": {
    "date": "8/22/2015",
    "text": "Called ahead for group of 18. Told by gentleman to come on down. The manager came over and told us she couldn't seat us. Very unfriendly and rude. If it weren't for the location this place would be closed. Bad attitude!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Y5VC2aEUtYEvHH-zXHLTg"
  },
  "SAcwO4XaNLxcj1FM-bscIg": {
    "date": "8/30/2013",
    "text": "Location has been upgraded and is quite pleasant...Wings were OK, nothing to write home about....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yCaDISH0R8e5U376zDWTpQ"
  },
  "CRNBVBrLxjgbZfS8lg-uoA": {
    "date": "4/10/2015",
    "text": "Not expecting gormet food but my cheap piece of meat came out raw, like tartar raw. Sent it back to be refired.  Waitress was nice enough but sloooow. Not exactly packed at 11:45 on a Friday. So much for running in and grabbing a bite. Still waiting and it's 12:20. Instead of taking the whole plate, coulda left me the side salad. The avacado slices were pretty good.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0k0PQctiUZWdtdBdDSp2_w"
  },
  "JALxnP9CKfmS82vAT-8J-w": {
    "date": "1/13/2017",
    "text": "I would rate this place Zero stars if possible. Completely horrible service. The restaurant was not busy and we were seated immediately. It then took 20 minutes (no exaggeration) before a manager took our drink order. After that, no one came to our table. I then flagged the same manager down and she took our food order and then told us a different server would help us. The different server came by and said hello. I ordered a tableside guacamole that took another twenty minutes before he walked back to our table with the ingredients. Then, my table mate failed to receive her appetizer salad until we asked for it AFTER the meal arrived. I ordered fajitas and the order came out wrong (ordered steak and chicken and received steak and shrimp). I then asked for the chicken and it never arrived (even after reminding the server twice). The steak was tough (couldn't cut it with a knife without sawing) and I finally gave up. We then asked for the check and waited another 20 minutes while our server chatted with his friends at the next table.  This is the worst Chili's I've ever been too and the worst service I've ever received here. Do NOT go to this location. The Arboretum location is superb and I'm wholly flabbergasted at how awful in comparison this one is.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUA_M0ZqI4hRND3G8D1SFA"
  },
  "u-yKluTldCoM997Sphu64Q": {
    "date": "6/8/2013",
    "text": "Came here for dinner with a friend.   The service was decent but the food was not great at all.  Artichoke and chips - dip was good but the chips were a joke . Paper thin and always kept breaking .  Boneless chicken wings - pretty ok..   Not coming back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sqJSiq09a_BsAAi_4LIhkw"
  },
  "cEkYArZ1lzdja_uVUVvWpA": {
    "date": "11/25/2015",
    "text": "Poor for a chain!!! Like drama? Wsnt to hear servers argue, discussion of whos tickets are short so they worked for free, this is the place. Want a server that reeks of smoke and tries  to cover it....yum. A manager that stands next to you and can't even say hello, how the food.......this is the place. Then I got to hear them comlain about the tip another person  left. Not sure why the even did other than it being a holiday. Food was average chain, service and atmosphere suck.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CmhZd8Jb8iajveePidMC9A"
  },
  "PKR-IsMJ46eYWvNF-NWFaA": {
    "date": "2/1/2012",
    "text": "I don't really eat at Chili's... But tonight we had to go and pay close attention to everything. Can't tell you why, but we had to. The place was nearly deserted on a mid-week evening around 8:30 or so. As per usual, if you've walked into one Chili's (or Applebee's, O'Charley's, Outback, Olive Garden, etc) you've walked into all of them. Nothing surprising there.  They sat us down and browsed through their menu. Shitty beer selection but I already knew that. So, I ordered water and a Sam Adams Boston Lager for Becky and I to split (since, you know, we still had kids to go back home to).  The waitress was nice and serviceable.  Their menu had the usual fare. We didn't browse a whole lot. They had some special where you get two entrees and an appetizer for $20. Of all the things available from that sub-menu that sounded appealing were the fried shrimp, which I ordered with french fries and cole slaw, and the 6-oz. sirloin, which Becky ordered with a baked potato and steamed broccoli. For the appetizer we chose the corn guacamole.  The appetizer came out pretty quickly and it was a very nice  portion I must say. It did not taste like it came from some reconstituted power and the only True complaint, as far as flavor, was that it needed cilantro. Aside form that, it was ok. Not entire sure why they called it \"corn\" guacamole as there was hardly any to speak of.  The Chips... wow.. those things are a joke and they should be ashamed to call themselves tortilla chips. Doritos have better tortilla chips than this crap. They were paper-thing and broke every time you tried to scoop some guacamole or salsa out. They didn't taste horrible... but you couldn't dip them into anything. The salsa was ok as well. Nice and roasty but no heat.  Then our entrees came. Becky got the better deal out of this fiasco. Her sirloin was nicely cooked medium-rare, her baked potato was pretty standard, topped with the usual goodies and the broccoli was nice and crunchy. Everything on her plate was pretty nice and tasted good.  I, on the other hand, got a miserable 8 shrimp on a mountain of soggy fries. They tasted ok, the shrimp did, but I was not happy with the portion I was given. 10% shrimp 85$ fries and 5% of my plate's real estate went to two ramekins with marinara sauce and sour cream. I barely touched my fries, the marinara was pretty bland and disgusting. It's kinda hard to screw up sour cream from a tub, so that was ok but overall my dinner just sucked. The cole slaw was pretty standard but pretty bland as well.  My plate was a prime example of why we don't go to chain, casual-dining places. They just suck. Definitely won't be going back to ANY Chili's unless I have to.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s7XIFcwZnhEUMzSZ4EiAHA"
  },
  "-A45BCvJc9lELXn_W8qKbA": {
    "date": "2/15/2014",
    "text": "Came here for valentines day dinner with a friend. The wait time for a table was not long. But our waiter took forever to take our order. He passed out table about 9 times but never took our order. When the food finally did come my friends order was completely wrong. We complained and they offered to fix it but we were on a time restraint. I got the Parmesan crusted fish which was good but not great. I felt like the fish needed a little more crust. It just had crust on one side of the fish and chipotle sauce on one side also. It was plain. The rice was good and so was the broccoli. Overall it was an okay experience. My friend was really frustrated since she was really hungry.  Might come back",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfxl8gDfn8TfCmSy937wZA"
  },
  "Z8pnCQP5lqD6Mq6R83lgHQ": {
    "date": "1/12/2014",
    "text": "This is the best Chili's in Charlotte. Consistently awesome! Great boneless buffalo wings and the best mac and cheese.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0filG4geYnCwisi6XIOQQ"
  },
  "NtPcUHbVGeX5eCglEtaVHQ": {
    "date": "4/9/2016",
    "text": "Service was terrible. We asked another server for help and got blown off. Shortly after, the wrong  drinks were sent to the table.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "am9kqS72ZkxY-h-hjxl89A"
  },
  "HXikNO05hNCykUilYfhgkw": {
    "date": "10/25/2015",
    "text": "Woah, Chili's .  Not your usual.. Called to order ToGo... Customer service on the phone : lackluster.  Decided to go somewhere else.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPFa1RLqiIPVOcCIqqQV7A"
  },
  "4D3rtnmh0yqhnVFRITuVLg": {
    "date": "4/20/2014",
    "text": "We decided to eat here today since they were one of the few places open on Easter.   My food arrived cold and almost too salty to eat. My boyfriends fajitas were also cold, had inedible parts of bell pepper in it (stem, seeds) along with a hair and he did not receive a plate to eat on.  His mother's salad came with rotten lettuce and veggies and had a burned quesadilla on the side.  Waitress was absent for long periods of time although the restaurant was nearly empty so we had to go look for a manager ourselves.  The manager brought us replacement food that wasn't any better and we were charged full price.  Worst. Why did sonny's have to be closed?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7b18IhXIW42hjOHkPZWTRA"
  },
  "MnKgN5crTUuxROY2aoadtQ": {
    "date": "3/9/2013",
    "text": "Did the $20/2. Chips and salsa good. Wife had vegetarian fajita which she enjoyed.  The pico de gallo was a little heavy on cilantro but overall good food.  I had the Parmesan crusted steak medium rare and it was cooked perfectly.  Great cut. Broccoli was a little dry.  Water didn't taste that good. Friendly staff, but new waiter forgot to box up wife's leftover.  He offered to have them cook up a portion for her to take. We accepted.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTDIfVV-JFfyc6XZMkpk-g"
  },
  "B0DbuzGUzYonkqP6IXABaA": {
    "date": "2/1/2012",
    "text": "I personally hate chain restaurants but my boyfriend wanted to go to this Chili's since we hadn't been for awhile. Once we walked in the door I remembered why. We waited for someone to come seat us for at least 5 minutes. A manager walking out of the door had to yell that there were people up front. After being seated we ordered the 2 for $20. I got the chicken fajitas while the boyfriend got the margarita chicken and we decided to share the corn guacamole. The guacamole was nothing but avacados and jalapenos and was pretty much inedible. My fajitas consisted of burnt chicken, three strips of bell pepper and an entire onion that was burnt. The margarita chicken was bland and the black beans looked old. The kicker was the wait staff. Not once was I asked if there was anything wrong with my food and we never got refills. When I complained about the food the waitress apologized and walked away. Will never go to another Chili's ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pFHNF4X_qUuhpFB4_C1Viw"
  },
  "tSFYzON9TNlQyn1_nf5REA": {
    "date": "8/30/2011",
    "text": "Stopped in here for dinner a couple of weeks back.  Waitress who was manning the bar had a bit of an attitude on her.  She wasn't unfriendly, but she spoke to me in a rather condescending manner.  I'm a big believer that customer service employees need to check their attitudes at the door when they come to work.  Other customers at the bar seemed kind of uncouth as well.  Next time I'm in this area I think I'll pass up this Chili's and head to the Applebee's just up the road.  Same basic quality of food with a friendlier waitstaff and less sketchy clientele.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7LJVdL20mSPU6s7s1O4aCQ"
  },
  "0TokPDoXL1-aCcGGQFSLNA": {
    "date": "10/11/2017",
    "text": "Destiny was a ray of sunshine for me after just walking out of a nearby restaurant due to awful service. She was bubbly, attentive, knowledgeable, and all around fantastic. We will very certainly be asking for her from now on, on Wednesdays here and any time we are at her Gastonia location. Enthusiasm is just one of those things you just can't teach someone to have. But Destiny crushed it, turning my horrible night 180 around and making it into an amazing one. Couldn't be happier! Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QqQ7BsvSx1fZSHme_zD1sQ"
  },
  "M_yqfQ4GvZogCScGkOpmqQ": {
    "date": "4/5/2016",
    "text": "I will admit, we visited this location 2 weeks ago. My boyfriend, my son and I. Service was absolutely terrible. I walked out of never wanting to see another Chilis in my life. Still upset I decided to give the restaurant manager a phone call. I didn't call to receive a free meal or a gift card or anything like that. I simply wanted to bring to his attention the type of service we had just received. Champ encouraged us to come back and I must say I am extremely happy we decided to give Chilis another try. He took care of us and our waitress was great. I really appreciate Champ coming by our table several times during our visit to make sure everything was okay.   Thanks Champ. See you soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV_7h4rSXanvZ592eT_YBQ"
  },
  "NNfN0PzBy9Ng_AiaSBX6zQ": {
    "date": "12/23/2015",
    "text": "It's Chillis. Love the chicken enchilada soup. As of late I've been enjoying the Tex-Mex menu. Otherwise I generally get the appetizer sampler as my entree. I've never received terrible service at this location. They're never packed either. I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-biLfTpwmOtoL9GCMgx2qg",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-biLfTpwmOtoL9GCMgx2qg/o.jpg"
      }
    ],
    "user_id": "9VsUfMdfdATg7Pzf_Ypk3w"
  },
  "pn1j1aEjNM6aE11_jypKfw": {
    "date": "11/18/2013",
    "text": "Chain restaurant ribs, I should be ashamed of myself. They were okay, but certainly not nearly as good as any of the other great BBQ places in the Queen City. But when it's late and you're tired and you're not choosing the restaurant, they're A-OK.  Service was okay. She got the beers taken care of and the check brought out properly. The others in my party enjoyed their meals - the food was hot and it was tasty.  I have no complaints.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "I8Uaae8sKAIbXz9z6fJ0Bw": {
    "date": "7/11/2017",
    "text": "I was in there yesterday with my wife and had lunch the food was good as always the staff very friendly the severs was a little slow but that's ok because they had an girls volley ball team in. I didn't mind. The music pleasant the manger was very poliot the restrooms where nice and clean",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdP3lID2YA1gz_M6QDK7ng"
  },
  "sT7iaZI5RqBUWcOmHjaLLw": {
    "date": "7/7/2017",
    "text": "Chili's on Tryon at Whitehall-My husband and I had visited there last Sept 15,2016 and we added a terrible review because it was terrible.  The Regional Mgr contacted us sent us gift cards for the meal we had and asked us to return again as soon as they made some changes so we waited until July 3 to make our next trip.  We were greeted by the Mgr-Dana and she was very nice and seated us.  Our server was Samantha she  was enthusiastic and helpful on top of everything.  My husband had a ribeye and I had fajitas and we had loaded queso dip and chips.  Everything was correct and cooked the way we ordered. We were very happy with this experience what a change!  This was a five star experience and Samantha and Dana helped to make it wonderful.  Ask for Samantha to be your server when you visit Chili's you will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "apQNLy84m4o-j0QHKQU_eA"
  },
  "8BPGcZG-Bgo2_H3xwH9AUA": {
    "date": "7/2/2017",
    "text": "DO NOT COME HERE!!!! Came in for Sunday dinner with a party 3. Our waitress took our drink order but could not take our food order because she said she had to greet another table who had walked in while we were ordering our drinks. She forgot one of my friend's margarita and never brought it out. We ordered our food and the party of 4 who came in 10 minutes after us got their food first, was able to finish it, walk out and leave before our waitress ever came back to us. After finishing my drink, the waitress refilled my cup with the WRONG drink and walked away. After that, she never bothered coming back. We literally waited over an hour and a half and our food NEVER came. Eventually we just got up and left",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LSlFmG-6RfePpEPvalybMw"
  },
  "huA-1R6g7fbxQlrw37FTwg": {
    "date": "1/21/2017",
    "text": "I was very disappointed. I travel for work and go to Chili's often but this one is sad. I should have left when I saw a 90 rating from the health dept. They were not even 1/2 full. The food took a long time to come out. I had fajitas and the steak was dry, my wife's French fries where ice cold. I am taking this one off my list.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0_eOrLR5-HLQSNHZe9UlUA"
  },
  "rHZdfvqS4gfqrAXaBjLdoA": {
    "date": "2/2/2018",
    "text": "I am only giving 1 Star because it would not let me give any less. I love Chili's food when it is done right and hot. My husband and I were seated and we had to get someone's attention to get service. The food came out Luke warm. We asked to speak with a manager. She said give her a moment but it took her 15 minutes to finally come over. They took my husbands spoon so he could not stir his tea. The server said she would bring him another one but never did. He ended up stirring it with a steak knife. They were making us new food but by the time the manager finally showed up we were so over the whole experience that we left and went somewhere else to eat. The service was SO much better at the IHOP next door.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-NxBEChw3WnfqbB4vl7pSQ"
  },
  "0hTs3cVnG4U-450iNE-vwg": {
    "date": "7/31/2011",
    "text": "I used to love this Chili's and thought for a long time they differentiated themselves from the other chain restaurants but in recent visits their menu options have changed and there's really nothing on the menu that interests me anymore.  The hostess at lunch is the high point of my recent visits.  She is always friendly and if you are dining alone, she asks if you want a paper to read while you wait.  The wait staff is hit or miss here, like most chain restaurants.  Most are there just for a paycheck and really could care less if they give good service or not.  What a shame.   I stopped coming here because of these reasons.  Maybe if Chili's changes their menu again to appeal to me, I may return but for now, no.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "k2f78dzbzvEUYueht2PNDQ": {
    "date": "11/29/2016",
    "text": "This location truly underwhelms.  They always take the longest time with to go orders, literally forever! I called and they told me 20 minutes...well that turned into an hour or more.  This is the third time we've had this experience at this location, I understand weekends are busy but an hour! I ran errands and showed up 30 minutes after I called and when I arrived it still wasn't ready.  I had time to go next door and run another errand and when I returned still no food.  Do better please! This location is the worst",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OqGS5VgyoycnuA-lZOU-bA"
  },
  "rNPfdFW57SsW4KiCXgZAgA": {
    "date": "4/15/2013",
    "text": "It's been forever since I've been to Chili's but my family was visiting and we were starving and we didn't feel like a looooong wait on a Friday night. So we just decided; what the heck...let's just go to Chilli's!  We arrived a little after 8:00pm and there was no wait...whoooo   Our waiter was pleasant, a little forgetful at times but still attentive and nice.   Here goes:  For starters chips and salsa- Classic! The first basket of chips seemed like the end of the bag...all small pieces and crumbs...no bueno... but the next set of chips that we asked for was much better. The salsa was good....I was a bit bummed though, they used to offer a mexi ranch salsa which apparently they don't anymore...but no matter I still like to mix the salsa with a side of ranch dressing. YUM.  For dinner my parents did the Ante Up 2 for $35 with the margaritas, these had absolutely no alcohol. Just a warning, if you like margarita mix and ice then I guess they are pretty good for you. To eat, they both chose ribs and fries for their meal. The ribs were good, they came out warm, but the sauce was delicious. The fries actually came out piping hot....total WIN Overall, it was good...certainly not outstanding but still good.  I chose the fajita trio which comes with steak, chicken and shrimp onions and peppers. With a side of tortillas, lettuce, cheese, sour cream, pico and guacamole. Again it was good, but didn't have a \"wow\" factor. I wish there had a been a bit more seasoning on the chicken and shrimp AND that it had come out sizzing...I mean they are fajita for goodness sake!   For dessert we all shared the chocolate molten cake. Delish! No need to explain...we devoured it. It's just something about ice cream and chocolate cake that just makes me very happy.   Overall, if I'm in a crunch again, I'd eat here but it's not on the top of my list.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "xXSYo5ToRUVqk98Hn34v2g": {
    "date": "1/12/2017",
    "text": "Service was really bad. At the time we came in it wasn't busy. The bartender was very slow. We waited 10 minutes for refill of tea even though they were not busy. Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQj5a2K3rP_U0Dh4mcLAgg"
  },
  "JL3cGmcV3mAAK_ZEUfsojA": {
    "date": "1/8/2015",
    "text": "Late craving for the family on New Year's Day. I understand how short staff it can b but short of food?   The waitress was so loud, everyone knew what was happening in our table. there was a complementary item in our check, she not only made sure we knew but everyone around us knew too.   Although this place is a casual dinning, a little privacy and discretion goes a long way.   Waitresses out there ... Your tip does not depend on the total check. Your performance also is taken into consideration.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ze09lSaOPrRsxmrKeviKpA"
  },
  "k2eAdYrXBXmPbgzk9Ja73Q": {
    "date": "9/7/2016",
    "text": "I got carry out and it was terrible. Boneless Buffalo wings were all breaking no meat. I also got a buffalo chicken sandwich that had no buffalo sauce on it. Fries were cold and limpy. Nothing about this food was good quality. I have eaten at other locations and had a better experience",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q_Pgb-t6clsURXQI1fQM0w"
  },
  "4ItNZdU8xx-Ck76IBp-7hg": {
    "date": "11/16/2016",
    "text": "Dined in bar area recently and had a wonderful experience. I have only been in this particular location a couple of times but the waitress/ bartender remembered what I drank. (She served me twice before). Appetizers came out within minutes. Food was hot and delicious. Fajitas are my fav! The music played is awesome, great atmosphere. Staff and lady manager were friendly. I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycFDRnRv86bv91SnkRWt6A"
  },
  "S-Cr0gIsUOGfBEKd1ln5pA": {
    "date": "2/28/2016",
    "text": "Table of 7 and everybody had complaints about their food. Chicken under cooked, pasta to hard, food was cold, chicken looked boiled instead of grilled and etc. One person got his food after everybody finished eating. Everybody was sitting with empty cups from beginning to end... HORRIBLE EXPERIENCE. Soup was good though.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctmou4VCwYX5FUPkRE2eAg"
  },
  "_DbxxWztGOLk4TDtqI23yA": {
    "date": "9/2/2016",
    "text": "Food sucks !!!! I ask for a media well steak , it was super over cook, at the point it was burt !!! Service was good , food is sooo bad !!! Save your money and go to TGIF !",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_fiErJvQ6OLRV9p1a94Zww"
  },
  "NzHY2PJ6yGQh0jQ3CJeGZQ": {
    "date": "2/2/2016",
    "text": "This location has really turned it around. I'd had a horrible experience here when I moved back to Charlotte and stopped going to Chilis all together, but stopped by a few months ago and WOW. I've been back a few times since...but I'm still afraid to try other Chilis for fear this might be the only one to make a change. Only complaint is that they always seem to forget the fries when I do a take out order.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMJKnaQ1ph88xrP0JCktCw"
  },
  "xZy1rP9Y5R9gYTaqzBYQDA": {
    "date": "9/9/2017",
    "text": "Chili's Bar and Grill, many say just another chain restaurant forced to cut 40% of it's menu, I say a Diamond in the rough focusing on what it does best.  Tell me another place where you are guaranteed what I refer to as the 3 Qs. Quality, Quantity, and Quickness.  I stopped in today around 11:15 with a friend looking to catch up, and have a nice meal.  Once again Chili's delivered.  We were greeting cordially, and seated at the bar.  As soon as we sat we were greeted with a grin from ear to ear from our wonderful bartender Samantha, and our drinks were made in two shakes of a lambs tail. With a menu the size of the latest New Yorker Magazine, you might as well play pin the tail on the donkey to decide what will fill your tummy joy.   Salads, soups, steaks, they've got it all.  All are made with the type of love you would hope someone would show while caring for their first born.   Chili's always comes through in the clutch, and that's why I will never turn my back on them.  They make you feel like part of the family, and it today's America, that's really all we can ask for.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "FvNXrj7dcgkm8lYexTzxEA"
  },
  "YfuRNL10pAk1cIWi0J_yAA": {
    "date": "12/6/2018",
    "text": "I only came to have a few drinks, so I sat at the bar. The margarita was made with love lol as the bartender said. I came alone so I had alot of one on one time with the bartender and I'm big on personalities. She had a great one. I told my wife and she remembers the young lady I described and said she always does great. I hate I'm not good with names but I won't forget the young lady's face. I will come back again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQTBkaYOKzZ-5jCwvOh_Tw"
  },
  "IeFcjruJ-icYNa1JzGzZOQ": {
    "date": "9/30/2018",
    "text": "Went for lunch today and was seated in the bar section. Waitress said they had no lemons for tea only limes. Waitress said it was due to Chili's gets their lemons from California and due to the fires there they can't get them. The Chili's on Tyvola didn't have lemons in August either. A guy sitting at the bar across from me had water and 2 glasses of tea with large slices of lemon. I  later observed a child with a drink with a cherry and lemon when I was leaving. My husband ordered steamed broccoli and it was raw like you would get on a salad bar. The waitress was not very attentive. Won't be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5hpLmL8ib0F3T1c62nRjdQ"
  },
  "INuRWpqwM6_f5lxrQ7SQcw": {
    "date": "3/28/2018",
    "text": "I haven't been to Chili's in a while but they updated their menu and have good drink prices. This particular location has good customer service so far but the food took a while when I only ordered apps.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ICPf18XVzmOR2yLY8LZ_AQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Flat bread and Texas cheese fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ICPf18XVzmOR2yLY8LZ_AQ/o.jpg"
      }
    ],
    "user_id": "txLCR2Cfm28EPNdb6M16Cg"
  },
  "yAdBYBmJVJoydYNRzKsLFA": {
    "date": "10/13/2018",
    "text": "Chips too salty.  New batch too greasy.  Margherita bread unappetizing.  Lots of goofing off and chatter with trainers and other staff.  Won't visit again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BrA1iL7QDANWp5jnovHnoA"
  },
  "8jZIBYAg54xUYg7w1MAEnA": {
    "date": "6/10/2018",
    "text": "Very disappointed on my dinner tonight. I come to Chili's often, but this visit got me upset...First of all it wasn't busy... Finally after ordering order came to the table and my steak wasn't Cooked right..sent it back...and came back out burnt...very disappointed....please take the time to make sure you satisfy your customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hsugco84DLi3yMGdTzH1Fw"
  },
  "hzdTulZarkRVrHcwf_ZF4Q": {
    "date": "2/4/2019",
    "text": "Just left with the worst experience made me not even want to get food, because of her attitude and demeanor of just simply me being there . I use to work at chili's back in the day and worked up to work at a fine dining now.. let me tell you even back in the day with almost no experience, would I treat a customer how the bartender did on 02/04/19 @ 9:30pm. Asked house frozen margarita.. got a presidenta instead, told me it was 5$ so I gave her a ten sat at the bar waiting for change and when asked for it she went off about how it was 8 something so she assumed the rest was hers?? I was like no first off I asked for the house which is 4$ but you gave me this one that now your saying is 8$ and didn't give me change back how weird is she? Never to return.. I understand why I almost got no good tables at chili's because even with the good ones your so use to having them tip you badly you don't realize the opportunities for good ones  anymore and treat EVERYONE badly smh.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6HmTwbkQTLtRwyXX6he13Q"
  },
  "s_mdEae1b5nJb2sfcxUF3A": {
    "date": "9/2/2018",
    "text": "Tonight was my first visit to Chili's while visiting in Charlotte. The waitress was very very slow. She only had us and 1 other table for the first part of our visit. A third table came in a little into our visit and it felt like the waitress was very overwhelmed. We only saw her 2 times after that third table came in(bringing to go plates, bringing change back after SOMEONE ELSE had to take our payment), almost felt like we was being avoided.   If I could give zero stars I would, I will not be back to this location any time that I visit Charlotte in the future.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uRHNkE7EXWTw_uBRhu79fg"
  },
  "rTzul9ZvhH9SqXpO-hO6CA": {
    "date": "1/16/2018",
    "text": "Hi, I am a legit foodie and I use to love chili's. However today when I went to pick up my order from the chili's at 8164 S. Tryon St in CLT NC that changed. First off the website did not work so I called to pick up my order. The lady of the phone abruptly hung up on me without telling me when it would be ready for pick up. I then drove over to chili's and waited 30 minutes for my order of a grilled Santa Fe salad and quesadilla lunch combo. I didn't complain when she forgot my drinks, instead just asked nicely and then thanked her and left.   Once I got back to my office I placed the salad Down on my desk and attended what was left of our manager meeting.  At this point I was starving. You see I am an HR manager who had been doing open interviews since 9:30 AM (nonstop). I only had an hour break (2pm-3pm) so i thought Chili's would be quick, easy, and delicious. So i was so looking forward to sit down and eat my favorite salad before the next rush of interviews. I open the salad container expecting to see grilled chicken slices with guacamole and pico de Gallo smothered all over, with little tortilla strips spread about, but instead I got this....image1.jpeg I got grilled chicken on top lettuce...that was it. Any salad would have more than just lettuce with grilled chicken on top. I was pissed and hangry. I went to grab the phone to call chilis and complain but then a walk in interview showed up and I never got the chance. So thanks Chili's for making a stressful day even worse because I had to settle for my protein bar instead of a real meal.  P.s. I was about to throw the salad away because I HATE fried chicken, but instead I thought I'd make lemonade out of lemons and gave it to this homeless man who always is outside of our store.   A salad that was made with no effort or consideration, was actually used for good because I care for others. Chili's made me wait half an hour for fried chicken over lettuce...what kind of customer service is that?  Sent from my iPhone",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z_bMxJUvxf04hGkzdNJlYA",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z_bMxJUvxf04hGkzdNJlYA/o.jpg"
      }
    ],
    "user_id": "vvxqO5VlXgPeFAptrodXEw"
  },
  "vRGvxEOOzCscqLXRIaqveA": {
    "date": "5/23/2018",
    "text": "Amazing customer service and professional staff. I was impressed. The food was delicious and they had $5 Margaritas that were so good. We were checked on often and given compliments by the hostess. The staff were personable and I appreciated the good service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tWz7nGOSznFgp_VRFmHiFg"
  },
  "4S6PnU0y5wLdbThSIyba6w": {
    "date": "6/21/2018",
    "text": "We had a GREAT experience here today! The hostess and waitress were extremely nice and helpful! We will return again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vypxFkqjgyQ7fE2BVfVsyg"
  },
  "6t7bbulg-pb8MsQ_YISFtQ": {
    "date": "6/10/2018",
    "text": "Service was great! We had Lindsay as our server she was awesome! Food tasted great and encountered no issues during visit! I also want to mention that the hostess older lady was outstanding she made sure that we knew the specials and everything was good. And the way she was making sure other tables and booths were clean was outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Me4GBZkiRFsSQzbxFQEvsA"
  },
  "pejw-NPZXztMfZoATDU0xw": {
    "date": "3/10/2018",
    "text": "I've not been thrilled by Chili's in my neighborhood the past few years but since my friend and I were near one I had never visited we decided to give it a try. First off we noticed the Health Dept rating was much better than our neighborhood location. We were greeted effusively by a vivacious hostess named Vickie. She welcomed us and asked our preference for seating then cleared a booth herself to seat us. We waited a little longer than we expected for our waiter Ricky but another staff member stopped by to let us know Ricky was aware of us and would be present shortly. Our beverages were ordered and delivered in a timely manner. The menu was easy to follow and or order was out quickly and hot. The vegetables were fresh and crisp on our burgers and sandwiches. We loved the REAL tasye of the french fries...they actually tasted like potatoes!  We received refills on our beverages regularly. If you're using debit or credit card for payment a small device on the  table allows you to do that yourself so your card never leaves your hands. Our meal experience was pleasant and satisfying. We left feeling good about our choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QSi3mJFa_9pjqHXA4SoSQ"
  },
  "f2XAGkywGDeEiAOiBmOPbA": {
    "date": "7/9/2016",
    "text": "Chili's is changing their menu...for the better!  They had surprising new selections & healthier side dishes.  My husband got a cheeseburger with fries, he thought it was pretty good.  I tried their shrimp tacos with a side of quinoa wheat berry & sweet corn on the cob...AMAZING!  I definitely would order it again and go back soon. Only problem is the service and cleanliness of the restaurant...very slow and they can do so much better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Cv11FElKvkOFY6La4_t7lg",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Cv11FElKvkOFY6La4_t7lg/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "IWOR-O89HusCxdqQ8A87bg": {
    "date": "5/8/2018",
    "text": "The staff is so friendly and helpful I love coming here. There host victoria is amazing she can enlighten your day from the moment you walk in so friendly and helpful. She's a very sweet women and will make sure you are taken cared of from the time she walks you to your seat till the moment you walk out the door. The manager is nice and friendly checks on you not just once like every other place. The servers are always in a good and delightful mood. This has became my new to go place. I ate there tonight due to bad experience at Friday's. This place I've been to couple times but I'll be here more often. If you guys haven't tried there honey chipotle chicken and waffle there to die for you need to go try it. I appreciate all the hard work and good customer service I get from this place and staff thank you guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fgjgGoojwRYmFkbXcUXWWA"
  },
  "gFMrFSID3RLW0mPsPMgX6w": {
    "date": "3/4/2018",
    "text": "Nice Sunday at chilis..all well prepared and nice. Deal 2 for 22 it's great  my favorite it's a sirloin steak.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enrz69e6H8Euo-PnLh5Itg"
  },
  "Z903yKmhcAKLJecwtGj-7Q": {
    "date": "6/30/2018",
    "text": "I hate leaving unfavorable reviews just as much as I hate bad dining experience. But I have no choice. Last night was the single worst dining experience I can ever remember having. Last night me and my guest arrived around 8:20 and was seated immediately. We ordered cocktails and when they were served we proceeded to order food at 8:30. I ordered a burger and fries, he ordered the sliders and chicken platter. We enjoyed our cocktails while we waited. At 8:45, no food. My cocktail finished. I ordered another assuming my meal will arrive very soon arrive. I notice it's now almost 9:00. Our waitress finally notice we're still waiting on our food. She tells us she's going to check on our food. It's now 9:06. Five minutes later she comes and tell us our food will be out very soon. At 9:16 our food arrived to our table minus my fries. She tells me she's waiting on freshly cooked fries. 5 minutes later different waitress obviously noticed the look on my face as I was done. Over it. She asks if everything ok, I say no. I said I've waited over 45 minutes for a hamburger and still the fries aren't ready. She went back and brought fries within a minute. Both our appetites were gone we were so disappointed. The manager came and apologized and took the meals off our bill, we were okay paying for our drinks. I took a few bites off one half of my burger realizing it was way over cooked. I ate about 4 fries. I couldn't eat even though I was starving when I arrived! MY BURGER WAS BURNED DRY AND CRUNCHY!!I just couldn't get over how unimportant as a customer I felt . The manager left my guest two $5 coupons and me two as well. I left my $10 worth of coupons on the table as they were of no value to me since I'm never ever eating at another Chili's in any location ever again as long as I live. That's how done I was with Chili's!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1C9tr_SIHRCzOKv-XKJj4w"
  },
  "9jn3BQp2Yxk8IGe91vmiQQ": {
    "date": "1/31/2018",
    "text": "I was in yesterday 1/30/2018. Was expecting a typical Chili's experience and was sort of disappointed.  First - The good  1. The hostess was excellent. Funny and made me feel welcome. 2. The Waitress was very good and friendly. 3. I think the manager came by as well and was nice too.  4. The plain Ice Tea was very good.   Second - The not so good  1. Clearly understaffed for the shift.  2. Slow food preparation.  3. Overly Salty and greasy even for a Chili's  I think this location needs more staff at lunch for both the kitchen and the dining/bar area. It could possibly be excellent for dinner, but I dont live in the area and wont likely be going back for lunch as there are a lot of choices in the area.  Thank you for the opportunity to voice my thoughts and hope this helps.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TBLM-kD4rup-tRxqGrTCg"
  },
  "asDf1BUnZgtQGruXvTgutA": {
    "date": "6/8/2018",
    "text": "So I ordered curbside pick up at 12 o'clock today I went to the place and my order is set for 3 o'clock I  checked in at 2:50  a Gentlemen Walks out and tells me oh we're going to Bag it now So I wait and I wait and I wait at the 20 minute passes I'm like what is going on so I walk inside and the manager gives me a mean look she said did your order online did you check in I said yeah I showed her the app she walks to the back and finds my food and she says I didn't know you don't check in I said I definitely check in because I was greeted outside so i told her the employee name from his chilies tag she calls me a lair I'm like what and she holds my food hostage because it's my fault I rushed them for the food I'm wow rushed? I placed my order at 12??? How am I rushing you she folds her arms and shooed me out what a dirty manager what a dirty place the food was ok oh btw i was the only one in the parking lot and on the app it has a check in function and you have to put in your car model and color so you can't tell me I don't know because I'm the only one in the lot and in the curbside pickup lane",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Or_TJ25PH0XH_5cyweJUWw"
  },
  "i8GMx5K4Kn21oUDrB8mGaA": {
    "date": "5/25/2018",
    "text": "The services was decent.  The food was terrible.  We ordered the cheese fries app and the cheese was so hard that it broke the fries when we tried to eat it...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A68DMXdkzIvZ35O8PT02Nw"
  },
  "auhExlCYC12m4yorbzECVQ": {
    "date": "5/12/2018",
    "text": "I'm not sure why this place has any bad reviews, but all I can guess is that they are old and out-dated. I've been to Chili's quite a lot. It isn't my favorite restaurant, but it's usually ok. This place is the exception. First, you're greeted at the door by Vickie. This in itself is reason enough to come here... frequently! Vickie is delightful! I don't care how your day is going, after you interact with this angel, you're going away smiling. Our food came out fast and smoking hot! Every bite, to the very end was hot and the flavor wasn't just dusted on one side, but was carefully and painstaking crafted as though the kitchen staff was working toward their James Beard or Michelin Star! Our server was great too. Never let our drinks get close to the bottom. Even the manager met every table to make sure that everything was perfect. It was. Perfect. If I lived any closer, I'd be a regular here. Actually, maybe I'll move for just that reason!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gDHfy8JEljvourj3WTb5gg"
  },
  "vGcQAHtZCjoLWGa5K6nGIQ": {
    "date": "3/10/2019",
    "text": "Chili's is back baby back baby back.   Chili's to go-- fast and easy, ordered online and was ready for me hot and fresh when I got there.   First, I have to start off by saying I love chili's. It's always good, you get exactly what you expect at a fair price. Today I went with the pick 3 for $10 (always a solid choice). I typically go with the honey chipotle chicken crispers, but today I went with the 6oz sirloin in garlic butter sauce. Better than I expected to be honest. It also came with a drink and an app (chicken enchilada soup) and 2 sides (loaded mashed potatoes and a Caesar salad).    The thing I like about this meal is that I couldn't have made it myself for $10. Living by myself I try not to cook huge meals because of the cost and I end up wasting too much food.   My question is why do people still go to McDonald's or pick up fast food on their way home? For $2 more than a Big Mac meal you can get twice the food and 10x the satisfaction.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rkd1ZxrRJXsgCneIO47mmg"
  },
  "L8WLYdHFQTT6LcOL2K4e9g": {
    "date": "6/18/2019",
    "text": "Talk about a horrible experience.  I went here with a group of 4 (including myself)  There were a lot of empty tables available..but the host told us that there was at least a 15-20 minute wait. We hung around at the bar for a little bit and came back 20 minutes later and the host went on to tell us that there was still another 20 minute wait. When inquired about what was going on, he said that the kitchen staff is on a break and that they should be back 'soon'.   The other patrons at the tables were sitting around waiting until they got fed up and just walked out. I honestly can't blame them either because the service and communication here was sub-par its too bad, since most of the other Chili's are easy to work with.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wGAgebMn_i9EohuGgFFncQ"
  },
  "I_E7DiwGHLtzrtz79vjIzg": {
    "date": "3/23/2019",
    "text": "This is the worse service I've ever had!!!  The waiter was ready to take our order we did ask for one more minute. Well apparently they thought i said 10 (maybe longer it felt longer than that) because that's how long it was before they came back  . It took soo long we were about to walk out when he decided to come back. We didn't have any napkins when we received the appetizer we asked another waiter. Then we never received refills.  I had to drink my mothers water he never asked us if we wanted any refills or nothing. The waiter wasn't attentive AT ALL!!! The place was dirty and their rating i noticed was 90!!!  Save your time and go somewhere else that you can get awesome service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PgC1cEIoFLGXEN_Kp2PrBw"
  },
  "JM9ppd9hIiNCX-XFQ3czXA": {
    "date": "8/20/2019",
    "text": "O Chili's what has happened to you :(    I've been going to Chili's almost 20 year now it has been my sanctuary after a hard day of work or my fun day after a great day with friends and family. This is the second Chili's I have gone to (other being in North Lake) with the exact same problems. We walk in party of 2 and 2 kids they say 15minute wait but half the restaurant was empty! We wait and they seat us. We wait another 15-20 minutes for someone to even acknowledge us! I believe she was the manager or maybe assistant it did look like they might have been short staffed so I give her the benefit of the doubt. We ordered 4 waters and a beer again 10 minutes for waters to come out 20 for the beer. The food took even longer its actually so sad because whenever we go to Chili's now we pretty much know its going to be a three hour process. I long for the days of my President margs, southwest eggrolls and molten lava cakes with no 3 hour service wait! As a long time regular and a long time fan I think this have might been the last straw at least for awhile. Maybe will meet again but for now I'm taking a break.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WU1jQOBAy5C19xoXV75XKw"
  },
  "TzjprP5BWGX3CuQFLHw3Yw": {
    "date": "11/6/2018",
    "text": "Ever have one of those stores where every time you come you remember why you don't visit but once every few years ? Welcome to my chili's review.   For me - It was awful.  From the moment we walked in I knew we should have turned around and saved ourselves the money and time - but we went in anyway.    It was freezing inside the restaurant. I was Seriously freezing the whole time. Thankfully it helped me to wanna leave but unfortunately we did actually attempt to eat here.   The appetizers were so salty I couldn't even eat them. We ordered fried pickles and an order of chips and salsa.   For dinner we chose steak and shrimp fajitas with corn tortillas.   The corn tortillas were horrible. They tasted stale and even though they were wrapped in foil they weren't warm or appetizing .   Fortunately the steak fajitas were good and the  only thing I ate .   Thankfully the coffee was decent.   I would say I'm sure there are folks who like Chills food - I'm just not one of them . Can you eat there and be happy... probably.  I wish you well.   Not my favorite place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-1yKW4Yv2RMB-KhIL1sZNA",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Fried pickles - very salty",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-1yKW4Yv2RMB-KhIL1sZNA/o.jpg"
      },
      {
        "img_id": "pWDaW4ntS9W_gXa65BjqHg",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Fajitas fixings",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pWDaW4ntS9W_gXa65BjqHg/o.jpg"
      },
      {
        "img_id": "5I2KUjkQUw-TnFK5x7K9ZQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Fajitas",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5I2KUjkQUw-TnFK5x7K9ZQ/o.jpg"
      }
    ],
    "user_id": "DYFXCoWpMAkTey_kCQZUYg"
  },
  "5klwrAdT1pia87HU_yAiaQ": {
    "date": "8/18/2019",
    "text": "The food is decent but the service at this location is absolutely horrible. I came with two friends, and we sat at a high top near the bar. It took a while for someone to take our drink orders, and every time our waitress walked by she would ignore us and we would have to flag her down. I believe her name was Myesha. Every time we would ask for something she had this look on her face like we were bothering her. Then when she took our order she didn't write it down and it was wrong - onions on the sandwich when I asked for none and forgot the ranch and honey mustard and took her at least 20 minutes to bring it after the fact and by that point we had eaten our food and didn't need it anymore. Needless to say we won't ever be going back. We were in there over 2 hours and not by choice.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3c2bEw66tk2hp92nUpDCw"
  },
  "_SVnqqjfj52RYjiVlOM7HA": {
    "date": "11/11/2018",
    "text": "Nice that Chili's is celebrating Veterans Day. There was a special menu listing the items that you can get. Very meaningful to see a a table setup with a white table cloth, tilt chair and red rose. There was the Soldiers Prayer displayed. I was able to teach my son the meaning of such a special day.   The food was great, fresh and it came out pretty quickly. I got their monthly $5 special Margarita Hennessy Harvest, strong but not too strong, it was just right! Vikki our host is AMAZING, honestly treats every guest comes in so special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Sjb585mgNQa0M9wi1JZ6Vw",
        "caption": "Photo of Chili's - Charlotte, NC, United States. November special $5 Margarita- Hennessy Harvest",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Sjb585mgNQa0M9wi1JZ6Vw/o.jpg"
      },
      {
        "img_id": "BWWQ-iAh5AQO-AkaZSpfng",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Cajun Chicken Pasta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BWWQ-iAh5AQO-AkaZSpfng/o.jpg"
      },
      {
        "img_id": "LjyHwbodxGeMarD_2WeGhg",
        "caption": "Photo of Chili's - Charlotte, NC, United States. Kids meal",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LjyHwbodxGeMarD_2WeGhg/o.jpg"
      }
    ],
    "user_id": "EJqvMFs6dOLLRu1_SFcl6w"
  },
  "S7dAj3VybuDq8Tzp_WfD8Q": {
    "date": "11/10/2018",
    "text": "4 star for the service! We had such a great time dinning here. It had been almost 10 years since we've been to Chili's. The hostess was extremely nice and explained everything to us including joining their rewards program to earn free apps or drinks. She helped us with the iPad thingy as well. Then we had a great server. Very friendly and fast. got the fries with cheese and chili to start off. Chili was a little salty but still good. I would have loved naco cheese on the fries instead. Ribs fell right off the bone. It was so flavorful. The burger was juicy and it was so big that I had to give the other half away. My guys enjoyed their wings. Definitely won us back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KBozWntwO2VFysAX8-mwAw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KBozWntwO2VFysAX8-mwAw/o.jpg"
      },
      {
        "img_id": "8AK-xpmL_wnhH1TN6C_zWQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8AK-xpmL_wnhH1TN6C_zWQ/o.jpg"
      },
      {
        "img_id": "8Yh60rZU3tUNawYK0FglqA",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Yh60rZU3tUNawYK0FglqA/o.jpg"
      }
    ],
    "user_id": "uGrZg9TypPdVnDgwp82VfA"
  },
  "L9Bh3nahaae45mOTdzqRoQ": {
    "date": "1/13/2019",
    "text": "We came in after experience an hour wait at two other places. We were seated quickly and greeted short after. Our waitress was great! After realizing I ordered the wrong thing, I informed her and asked if it could be changed. She said let me check, went to the kitchen and handled it. I was very apologetic but she was cool with it and said at least you didn't realize it when it came out. The food was excellent. Well priced. Great service.. what else could you ask for?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "E2G0DlJW8zBr1iZKMHy3oQ": {
    "date": "5/22/2019",
    "text": "The Chili's at South Tryon, provided GREAT service today! Manager Michael and server Makayla were AWESOME! The loaded chicken nuggets were a great appetizer and, combined with the chips and queso, had me taking my cheeseburger home (to go) where my DOG devoured it when I left it on the counter while running errands! (Heavy sigh!)  In a world of restaurants with awful service and bland food, Michael and Makayla and the kitchen staff made my visit WONDERFUL!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NooS72oyN7XR7k5vAOp2pw"
  },
  "WMa6BbtSuKkXIAx5FvZ5aw": {
    "date": "7/20/2017",
    "text": "I'm ne to Chili's and I like it. My first visit was sometime in May 2017 while in a Mlps suburb and this one has PLENTY points in effect unlike the St. Louis Park, MN location.   The service here is polite and mannerable but inefficient at best. Today I asked for no tomatoes and got tomatoes. The online ordering system doesn't afford modifications and I get they're trying to avoid people seeking more costing more money but at least let me remove somethings via online. I called to say no tomatoes and I guess it wasn't passed along.   They always seem to have a promo going and I like it.  They make their pickles. The slider burger doesn't disappoint.  I've been to this location twice for take out but today I had to dine in to redeem the $10 and everyone accommodated me.   The smoked wings are not what I expected as they were pale. Not smoked like Sonny's not smoked and charred like Hickory Tavern but it's nice to offer and next time maybe I'll just say smoke or let them sit a bit longer. It is nice to have more than fried.   They are running a summer time special now. Basically bar Happy Hour prices from 4p-7p then again from 9p-close. I don't think this includes weekends. I'll upload the pic so you can see.   Double and Triple check everything before leaving. Things may be overlooked and that's the inefficient part.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "vTNngW3AwXXWWvhn22L1AQ",
        "caption": "Photo of Chili's - Charlotte, NC, United States. New: chicken and waffle app. It&amp;#39;s nothing I&amp;#39;d recommend.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vTNngW3AwXXWWvhn22L1AQ/o.jpg"
      }
    ],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "D3s7X7KpofOUBkO4bPgEUg": {
    "date": "3/24/2018",
    "text": "Lately I've been eating at Chili's a lot. Either to dine in our take out. I really enjoy their food and think the prices are fine. My favorite is their loaded mashed potatoes, one of the best I ever had! So creamy and full of flavors!!! Everything I've had here is good, salads, steaks, ribs. The only think I am not a big fan of is their chicken tenders, I feel like the batter has too much wheat. The service is normally pretty slow around here, it does not matter what time you go. In my last visit I was with a friend for lunch and we were kind of worried about taking too long since we had to go back to work. Then she had an idea of sitting at the bar and was a wonderful idea. They have a 3 for 10$ lunch special where you can get a non-alcoholic drink, an appetizer and an entree for 10$. I went with House salad, their sirloin with broccoli and loaded mashed potatoes, the food was really good! Our server (bartender) was very nice, even though she always alone at the bar at pretty busy time she did a good job. With that being said the only thing I believe they should improve is their service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8fsqFpMH_0Maz2Idk05Rxw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8fsqFpMH_0Maz2Idk05Rxw/o.jpg"
      },
      {
        "img_id": "Af9FSuburwh2jtlzak_ICw",
        "caption": "Photo of Chili's - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Af9FSuburwh2jtlzak_ICw/o.jpg"
      }
    ],
    "user_id": "0mRh6teyYn5n1AmN3fYvZw"
  },
  "R3F5Tq8GGTnHF-6F1H64Cw": {
    "date": "5/5/2019",
    "text": "Horrible service! We were sitting for 20 minutes and no one came to greet us or take our orders. We even heard one hostess day \" Who sat them there?\" After that I told the greater what happened and left. Will never go back to the one in Whitehall again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nwLwYm2oeAK97hKVzfau3w"
  },
  "lexBfknKZNvAEoBm_uyxOg": {
    "date": "5/28/2019",
    "text": "We decided to ignore all the bad reviews for this place and go anyway since it was the closest to us, BAD IDEA. Probably the worst dining experience of my life. I suspect the waiter was high, waited for an appetizer that they informed us was \"frozen solid and couldn't thaw\" 20 minutes after we ordered it, food was undercooked, ordered chips and salsa and found 2 whole slices of lemon buried in the salsa, entree was missing half the order, I could go on. Do not go here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAB4ZIoIRgLeYQ5QhdPr4g"
  },
  "kiPZGzxvhB70v6XXsNiDGA": {
    "date": "3/3/2019",
    "text": "Chile's.....a bar with no white wine...really?? Get with the program...poor management \"0\" stars!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cQmRZZ5Rar81t-YrgjwU1w"
  },
  "ITsxKxyhPgRQSyFsiYYuEA": {
    "date": "3/20/2019",
    "text": "Me and my 3 year old went last night, this morning were both throwing up. I'm guessing food poisoning... very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-L7Dt-LW3YNgPnUQjxVEAg"
  },
  "GKMOrchPGXdp0LFz-UCbcA": {
    "date": "8/27/2018",
    "text": "Got my food Togo and it looked like scraps...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3NoGKLzYcpc6QpRTxqxKHw"
  },
  "Q2oZuj3Gh7-chJgCxuyRTQ": {
    "date": "5/27/2019",
    "text": "They take so long to take our food and when arrive it was missing one plate and one of the meals wasn't right so we send it back we eat the other meal but we finish eating and the missing meal and the recook meal haven't arrive yet  it was my son birthday and I think It was a good idea to take him to eat there but now I'm sure the we don't gonna come back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC-tLtJguo-SPgpve37Cdg"
  },
  "VhjYm4__s7sc-4j27ScWvQ": {
    "date": "1/21/2019",
    "text": "Terrible service. What would possess a person to check out your online order but NOT check to see if the food is ready? I ordered my meal at 7:58......arrived at 8:30. Did there until 8:50 to then be told my food was sitting on THE COUNTER the entire time. I am appalled at the lack of empathy or customer service the so-called manager showed. Offering to comp a cold meal. NO! Just refund me my money, I was on my lunch break and came back late. I am extremely disappointed with this location and will never return",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sfGvwldIDwe5q1w3GrNPOw"
  },
  "59DyT8JoyDIioAzLm47uvQ": {
    "date": "8/27/2018",
    "text": "Went here on a date and the service was not very professional.  The food was not cooked well, the waitress was not very helpful at all. The appetizer of chips was to be free but got charged still. Whenever I wanted a refill on my drink it never happened till I was done eating. I won't return here again or encourage others to bring a date here or give them business at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEXQPLOCIgYoNXeekjL2aQ"
  }
}