{
  "aV74mcDnUI12lo2rXB89ww": {
    "date": "10/21/2013",
    "text": "I think this is the best restaurant in Charlotte. Think of it as a seafood restaurant and raw bar plus imaginative sushi. You can either sit at formal tables or at high tops in the bar area. I've done both but this time we were in the formal dining room. Their signature dish is sake marinated Chilean sea bass and as always it didn't disappoint. I had a steamed lobster, very nice we also had sushi bento box, salmon sashimi and calamari. Well enough about the food, the service was great, informative, friendly and efficient. If you are in Charlotte have a fair bit of credit on your credit card I recommend trying this fine restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ykV2PLJwq7OW8HX4cqSzGA"
  },
  "88AR9zDwtLJi1QSND1C_Aw": {
    "date": "4/28/2011",
    "text": "Upstream is tres chic! I've been there multiple times and service has always been impeccable. What else would you expect from an establishment that has linen tablecloths?   My favorite times to go to Upstream has been for brunch and Thanksgiving . Their brunch is a tad on the high side ($25 I believe) but completely worth it just for a bite of the Brioche French Toast alone.  Along with that I've gone there for Thanksgiving dinner twice and was nothing but pleased with it. They have a complete traditional Thanksgiving spread set up in their bar along with sushi, cooked seafood and other goodies.   At the risk of sounding like George Costanza, they have one of the nicest restrooms I've seen in Charlotte. They also have a cute patio area with cushioned seats that's perfect to enjoy an after work cocktail on and watch the people of Phillips Place. And dare I say, even though it's in the heart of South Park-not an obnoxious number of misbehaved children . To top it all off, they are a part of Harpers restaurant group and offer cooking classes on Saturdays for $35/class (a few of the classes go for $55 or $60)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "wc-td7tCliQLRpE_cJgpJA": {
    "date": "12/16/2012",
    "text": "5-STAR Brunch!! We've taken all our out of town guests here, and they've loved it. Worth the $30pp.  Came here for happy hour bar bites, which was okay.   Never been here for dinner.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "o-IP9-MSTsJpI48JnkNqIA"
  },
  "GGZosl72mVr20EopFH0CCQ": {
    "date": "1/29/2011",
    "text": "My girl and I came here for their Sunday brunch to enjoy the seafood and hang out with new friends.  While the decor of the restaurant and the service was quite good, it's in the food category where this place was severely lacking.  The way they do their brunch is buffet style with an assortment of stations which are self serve and two manned stations, one for carving and another for omelets.  Pretty standard setup.  Along with the buffet they had unlimited tapas that could be ordered for the table.  Meeting our friends there for a Sunday bite was nice.  The table was comfortable, the atmosphere up scale and everyone was generally pleasant.  That's the only reason I'm giving this place 2 stars.  The buffet suffered from the one cardinal sin of any buffet type offering, the food was left out too long.  Congealed mac & cheese, sushi with crunchy rice and sausage that had been dried out from being exposed for so long.  On top of that, none of the shrimp had been cleaned.  Not the large cold shrimp with cocktail sauce or the small shrimp tossed into the omelets.  That's beyond gross and completely unacceptable for a seafood restaurant of that caliber.  Honestly, I'd rather do the brunch at the Ballantyne Resort.  This place was not worth the money and with such a poor showing I won't even try them for dinner.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "W3W6ywndgEOM4mf_DgCb5g"
  },
  "no9pv1LHqc3pd-WkZKKqHg": {
    "date": "1/24/2016",
    "text": "Never disappoints, the service, the appetizers , the sea bass is my favorite, my wife gets the crusted tuna, everything top notch. They take of you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t0SCilaHNy6XBBEqmo3TMQ"
  },
  "gvJO1r__fuUK6YfL8gaJCA": {
    "date": "10/16/2012",
    "text": "Oh upstream how I love thee. Why am I writing yet another update with the same rating as the ones before you ask? So I can tell you about the brunch of course. This brunch is a monster of a buffet and tapas menu combined all for the low price of $25! Hold on you might be balking at the hefty sticker tag on this brunch but let me tell you about all the stuff you can well...stuff yourself with and you'll be singing praises too after you try this joint out.  This being one of my last weekends in Charlotte the boyfriend and I went with a yelpy crew consisting of Travis W., Melissa B., Chad E., And Denise. First off you walk in get greeted and led to your table and handed a nice tapas menu. They could've charged $7-10 for most of the items on this tapas menu and made a killing but nope they're giving it to you as part of the buffet, score! I tried the scallop risotto, crab benedict, belgian waffle, and some other things all excellent! But wait it doesn't stop there you walk into the bar area and BAM! you're hit with a massive buffet of brunch items. You want some smoked salmon and mushrooms folded into your freshly made omelet? No problem. Add some excellently carved prime rib onto that you got some good eats. I was so full before I even got halfway through working on this buffet.  This place has met my expectations for lunch, dinner, and now brunch. Hopefully I am back in Charlotte soon to give it another whirl. Though dinner is a bit expensive and they do need to tell you the prices of the specials lest you order a $45 bento box like I did, the staff is incredibly accomodating and attentive to your needs. Hell they even remembered my name and how I like my tea for lunch after the second time I was there! Give it a try, you can thank me later.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "shpt2jXmzOPBHP2oI-LGHg": {
    "date": "7/14/2016",
    "text": "One of the top seafood spot that I have been to. The service was only there for 3 weeks and you would have never known. She new the menu and was on point.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "clOxRi4i7eDq61w8h3Nt-Q"
  },
  "FklpL7EafZHsHTejvDA21g": {
    "date": "6/29/2014",
    "text": "One of the best seafood restaurants I've ever been to! We ordered oysters, which were great, scallops the best and the monk fish was good too. Creme brule was a little too sweet but still tasted good.   Our waiter, George, was amazing, and he was also great with our kids (2.5 & 4.5 yrs old)!  I would highly recommend this place to friends and family! Great place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k48x3iG0F_1-cBUxs0BIZw"
  },
  "AARR0KMxXekYITRIYPyX6g": {
    "date": "11/8/2014",
    "text": "Great food! Great service! Our waiter was Christopher, and he was fantastic! He recommended excellent entrees, apps and wine that exceeded our expectations. We recently moved to Charlotte from NYC, and this is by far the best restaurant we've dined so far. The sea bass is almost as good as NOBU and the tuna... OMG!! Your mouth will love you, trust me. Enjoy .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "P1DtAF-xnk1uAv1HWiNPPQ"
  },
  "Wy0Uk9KVPVC8zWV7_TqK-w": {
    "date": "2/13/2015",
    "text": "I wanted to love this place.   I've heard many good things about it but hadn't been here for years.   Some of the  service staff was a little too talkative.   I ordered the salmon salad because I was told by my server it was 1 of the 2 most popular entrees on the luncheon menu.   Although the presentation was beautiful, it definitely wasn't that spectacular.  Also, there weren't many people there for a Friday lunch and I'm wondering if I'm not the only one with a critical opinion.  Having said this, my friends really enjoyed their lunches so I am willing to give it another try when the opportunity presents itself.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBWVFM1-pROdC9QEoU3hMQ"
  },
  "4cxd1jF5AXeMKdf0-l3Jzg": {
    "date": "6/25/2012",
    "text": "WOW!  I had heard the brunch here was the best in Charlotte but was pretty doubtful.  We went this past Sunday and it was literally the best brunch ever - not just in Charlotte!!    The restaurant is pretty fancy so wear something nice.  For Sunday's brunch they have a tapas menu with great fresh options IN ADDITION TO the biggest brunch buffet you have ever seen.  The tapas we had were scallop risotto (oh - so THIS is what it is supposed to taste like!!!), Belgian waffles, and the crab-cake.  All of these are complimentary with the buffet so get them all!    All of it was so good - but then you have to go to the buffet.  I was so overwhelmed!!!    Buffet:  Pastries galore, fresh fruit, cheese, grilled chilled veggies, salmon wraps, red skin potato salad with bacon dressing, deli meats, omelet bar, shrimp and grits, baked salmon, roast beef, baked ziti, broccoli and cheese, fried chicken, ribs, sushi, shrimp, clams, oysters, mousse, tarts, bread pudding i - that is all i can remember.  They had to roll us out of there.    Yes it costs $25 bucks but it is WORTH EVERY PENNY.  The food was so fresh and delicious!!!  Mimosas and other cocktails (must wait till noon!) were $5 and the perfect complement.  Can't wait to go back!  It is fantastic!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "SZ-tuI9FVlLtQaUkhrhmdA": {
    "date": "4/23/2013",
    "text": "Food, good. Bar area, so comforting and chill.  Place - I would never have thought it was so cozy, and upscale -- from the outside. I should have known better. I adore the look before the renovations. I have to come back and see what they have done to the new bar.  I just love the atmosphere here.  Food - their selection of food are fresh and delicious.  My husband and I came here for his birthday. He ordered the steak and he loved it. I ordered the mussels which were great and crab cakes that was outstanding. The one thing that got us to come back, was the Costa Rican chocolate that was amazingly decadent. We were told that they have an in house French pastry background chef that makes this. Superb!  So, we would come back here, this time, to the bar to enjoy the chocolate dessert and some fresh earl grey tea (no tea bags found here!).  We came back here again with different friends, had the sushi, which is good.   Service - we forgot our waiter's name, it's been so long.. But he was awesome and took care of us! The service by the bar was great also. Service outside the venue, out on the patio like area was good. My friends and I spent a good amount of time, eating sushi, and enjoying our desserts. Wine selection was great!  Just wished for a little more lighting outside. Just a bit more, underneath the umbrellas.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4m_44zfmfIEnvWxj-qf3XA"
  },
  "6kAHwd-Vz4BMcFqlQhDbgg": {
    "date": "7/27/2016",
    "text": "Very small portions for the prices.  My sea bass was less than 3 ounces!  Desserts need a lot of improvement.  Chocolate creme brulee was nothing but average chocolate pudding with a tiny bit of caramelized topping.  The pineapple upside down cake was noting but a subpar muffin.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TGc_AW-AphjnDGRuoboQ_w"
  },
  "ti7wO8A_zZh2a8FzPmXkrg": {
    "date": "6/28/2010",
    "text": "Absolutely love this place, perfect for Dinner and a Movie. It's located in the Phillips Place plaza which has trendy shops and a movie theater.   The bar or outside seating is perfect for a relaxing evening to enjoy some people watching. Dining room seating usually tends to take longer and the servers aren't as attentive, definitely not good for a quick lunch.   Appetizers to try are; the cheese plate, Sweet & Sour Calamari (my fav) and their Mussel Pot. They have a great sushi selection, I normally have their Spider and Firecracker Roll which is always fresh and perfect. I recently tried their Queen City Roll and its absolutely delicious paired with a glass of Conundrum. The mashed potatoes and baby green beans are a great side dish for any of their menu items. Also, try their bread pudding dessert when they have it on the menu, it's the best in town.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "dt1lyscFrlqW89CTB71IOw"
  },
  "nE2VE2GHKfzfvoIHWszTkw": {
    "date": "8/16/2013",
    "text": "Great brunch! I'm looking forward to going back for dinner at some point in the near future. We made a reservation for 11:45am because I'd read that the wait can be long. When we arrived, there were plenty of open tables and no one waiting. We were seated right away...and then waited for at least 5 minutes with servers constantly walking by before anyone stopped to take our drink order. Then, after the first server came by and explained the concept, four or five servers came over and tried to do the same. This was really the only misstep for us.   We ordered several items off the brunch tapas menu - egg benedict, steak & egg, waffle, pecan crusted trout, and the french toast. They were all good. Then we made our way to the buffet area. The highlights for me where the shrimp and grits, macaroni & cheese, cod, sushi, fruit/cheese, and mussels & clams. Not as great were the peel & eat shrimp (which were slightly hard, but that may have been from sitting on ice for awhile.) I wasn't wild about the cocktail sauce, which had a definite orange taste to it. Also, the salmon from the carving station was just okay.  I'm a Bloody Mary enthusiast and Upstream's was not my favorite. It was by no means undrinkable, but the mix lacked the seasoning and toppings/snacks that make a great Bloody Mary.  The dessert bar offered a great variety of dessert bites - my favorites were the marshmallow/smore on a stick, lemon square, and the pecan tart.  All in all we'll go again, skip the Bloody Mary and focus just on the highlights. I'm also excited to try their dinner and Happy Hour Bar Bites menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IwP_3dLp9z-t-JWYF8r6vA"
  },
  "SmQqgmzIQVJqwONZj9d0EQ": {
    "date": "3/5/2012",
    "text": "I must say I love the brunch buffet at Upstream much better than what they offer for  dinner.  I mean I would have to say it's probably the best brunch I've had in the queen city.  I'm not sure if they switch it up weekly but on my visit they had a spread of salads, steamed shrimp and clams, chicken, brisket, salmon, roast, an omelet station, shrimp and grits, pastas, a tapas menu(included in the price) with waffles, scallop risotto, trout tacos, crab cake benedict, french toast, etc., and an array of desserts........well worth the $25 bucks in my opinion.  The service was very impressive and they really catered to my busy 5 year old(major brownie points).  Everything was superb or was I dreaming?  I think that experience may require multiple Sunday visits.......",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "vaox8YHxkQfJrIVA_KBf9A": {
    "date": "1/8/2013",
    "text": "Upstream is just ok. Maybe I got the wrong thing. I ordered sushi, which had absolutely no flavor at all. I can't remember the name of it but it had shrimp, cucumbers and something else. I'm no sushi expert, but something was lacking. I enjoyed the open kitchen and our waitress was very nice. Other menu items looked good. Brunch may be my next choice for a visit to Upstream.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hBI4eAPpwTOzDpHoqTVi4Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Calamari",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hBI4eAPpwTOzDpHoqTVi4Q/o.jpg"
      },
      {
        "img_id": "BrvRXC_HOA1gl9ChQLvAVA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Calamari (vodka tonic)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BrvRXC_HOA1gl9ChQLvAVA/o.jpg"
      },
      {
        "img_id": "8BdSK0vtSO321hlY_muLog",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Shrimp tempura",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8BdSK0vtSO321hlY_muLog/o.jpg"
      }
    ],
    "user_id": "onsvManL82rHzpcCB3Uyfg"
  },
  "goVe_EDtSzVeolKD9tQwHQ": {
    "date": "9/2/2014",
    "text": "So, I've always longed to go to Upstream, but it's definitely out of my price range. Much to my excitement, I won a gift card in a charity fundraiser at work that allowed me to pay them a visit and taste what I might be missing.  My boyfriend and I went on a Sunday evening at 5:30. We figured we'd miss the crowds that way, and sure enough, it was much emptier than I expected after reading all the reviews. We were promptly seated - the decor was very classy, but not in an overdone way.  Our waiter was very friendly and attentive. He made some very detailed recommendations of food and wine that were accurate, and his subtle jokes and jabs made us feel like we were chatting with a good friend.  We started off with the chef's choice of oysters - 6 of them. They were delicious but also very small, and I wasn't feeling like we got our money's worth at all. Maybe it was because they were East Coast? Regardless, I wouldn't buy them at that price again.  I was jonesin' for some Asian flair, so I my chosen entree was the Togarashi Dusted Big-Eye Tuna, rare. The tuna was tasty and high quality, and the sauce it was in was pleasurably tangy. The waiter had told me to expect it to be spicy, but I didn't find it spicy at all - maybe the seasoning on the tuna had a subtle kick, but not much. What surprised me most was the rice cake. I was almost as excited about it as the tuna, which is definitely not something I expect for rice! It is a clump of sushi rice that is quickly dipped into a flash-fryer to crisp the outside into something so perfect that I'm considering buying a fryer just to try to replicate it. Combined with the sauce, it was divine. My one complaint about the dish was the pickled veggies that are stacked on top. I thought the sauce was super tangy all by itself - the pickled flavor was just all too much. I couldn't eat them. But I cleaned the rest of my plate happily!  My boyfriend got the Scottish Salmon, which he also really enjoyed, especially the curry sauce that went along with it. He cleaned his plate completely! He is gluten allergic, and the waiter was very patient to go through the whole menu with him in detail and let him know what could be made gluten-free. They do not have a separate gluten-free menu.  Our bill came out rather high - 2 glasses of wine, 6 oysters, and 2 main courses came out at $90. We weren't concerned with the gift card in tow, but even with the great quality, it seemed kind of steep.  All in all, if you think a well-rounded meal for 2 at $90 is nothing to sneeze at, then by all means, visit Upstream! Otherwise, I'd save it for a special occasion.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Stkp_hRQdH4miuTVToW2Lw"
  },
  "b77QPd67ZrXUmaLBd5SYwA": {
    "date": "2/16/2015",
    "text": "We wandered over with some friends after a movie on Valentine's Day. We were really just going for a drink but saw the sushi menu and decided to order. The sushi was actually very good. Things were coming out really slow so that was weird considering it was 10pm and not super crowded. I can't comment on entrees but the sushi was good enough for us to makes return visit to try more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z0aUqREfa_TGwZL2GYhWqA"
  },
  "GM6n73WYt7Wn0ObpjOT-JA": {
    "date": "5/6/2015",
    "text": "Went here the other night for dinner and had an excellent experience. The big eye tuna tacos appetizer is a must. Really crisp and refreshing. Kind of small but soo worth it. Great selection of draft beers on tap, as well as some good sakes. Had sushi for dinner. Can't remember the name of the roll exactly, something like yakahama, but it was really good. Also their tuna (maguro) sashimi was really fresh and delicious. By the way you have to ask to see their sushi menu. For dessert we got the vanilla creme Brule and chocolate tort with gelato. Both were out of this world. Great place to enjoy a fun night out, however be prepared to spend a little more than your average dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZUfpwYVX4ABryuIMzWYnLA"
  },
  "VVPJP2TKZ-4V4fWaY2onSg": {
    "date": "3/19/2013",
    "text": "After the Yelp event here where I heard about how fabulous the Sunday brunch is at Upstream, I brought Mrs. K to give it a try.  Great service from the staff, starting from the hostess who brough us to a semi-private booth to the waitress explaining the buffet and cooked-to-order process and even the busboy who refilled our water glasses. I thought it was interesting that the waitstaff was all dressed like chefs - I don't know if that's intentional or not, but I liked it.  As for the food, well, it was excellent! The usual buffet staples like a cooked-to-order omelet station and a slicing station. But also a huge raw bar with large prawns, oysters, clams and mussels. On another table, salads and savories and sweet treats. Bacon and grits and smoked salmon and fresh sushi more!  But where the brunch stands out is the tapas menu. From your waiter/waitress, you order delicious plates that are a perfect little bite. Egg benedict - one poached egg on a crab cake. Smoked fish tacos - a 2 inch corn tortilla filled with smoked fish with guacamole and salsa on the side. Belgian waffles. French toast. Oh, I am stuffed!  Parking in Philips Place isn't easy but Upstream sometimes offers complimentary valet parking. It's well worth the tip to save the headache of finding a spot in the parking deck.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Ijdzx-E7Y1_hotD11SugiQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Smoked fish taco. It&amp;#39;s barely two inches across!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Ijdzx-E7Y1_hotD11SugiQ/o.jpg"
      },
      {
        "img_id": "GQahkD0PVC1iRtbBZ5vLIA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Egg benedict",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GQahkD0PVC1iRtbBZ5vLIA/o.jpg"
      },
      {
        "img_id": "14axnW_txQsc5cC_t-K86A",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Upstream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/14axnW_txQsc5cC_t-K86A/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "9jKIAtFMmMJajjvqVYhsYg": {
    "date": "1/24/2017",
    "text": "Went to Upstream during Queen's Feast. Wonderful restaurant. Excellent service. The crab cakes were a standout! Had the lobster which was delicious. Would definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HGTYVt-nKHQoPY0g9--HMw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Crab cakes! Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HGTYVt-nKHQoPY0g9--HMw/o.jpg"
      }
    ],
    "user_id": "_mSK1woCMsvNdRAJ4b2s1g"
  },
  "75CDxqeoKt7mbFS0_71nKw": {
    "date": "12/6/2016",
    "text": "Our waiter made it a great experience. It's too bad I can't think of his name, but we sat in the bar area and arrived right before they started serving dinner.  For appetizers we had wings, crab dip and sushi.  My fav was the sushi. I expected a little more food to appear on my plate when the entree came, but the taste was standard and typical of a seafood restaurant that serves steak.  Prices are a little steep for the serving size, but the ambiance and service makes up for it.   Give them a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TukQCx7g4COlRyBXzUQAA"
  },
  "xwZD-7-njgN6uJknGR41NQ": {
    "date": "1/17/2015",
    "text": "well, this is most definitely a South Park restaurant. we went there for restaurant week and the food was extremely different to say the least. I think their biggest mistake was not to give you something mid meal to clean your pallet. I have a taste of everything I had and I'm not comfortable with that when paying a high price.  my wife and I and my father had the sea scallops and they were grey and under-cooked. As an appetizer I had the squid which was in a creamy sweet and sour sauce which I won't even attempt again, I think this is what ruined my meal. Just the flavor went through the whole meal.  Overall not a very good experience for me and I do not plan on visiting this establishment again.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EbtobzILlcyD8qQJjUyqdw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sea scallops",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EbtobzILlcyD8qQJjUyqdw/o.jpg"
      }
    ],
    "user_id": "UOWlt_27s4YoD1xATtqy5A"
  },
  "G1qkHZCQhmMrGifLnU_rSg": {
    "date": "9/29/2017",
    "text": "Had dinner here tonight Great service by our waitress Jennifer She suggested our  entrees and she was right on with the Sea Bass and Duck breast Also with our dessert chocolate walnut cake was excellent Luke Andrews manager stopped at our table and checked on how everything was told him excellent  Nice to see both the wait staff and management  checking on things Will definitely go back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq95ut3ReIzR_30YJxyXug"
  },
  "FO91aKSRO4qqXt7xEVawqQ": {
    "date": "10/3/2014",
    "text": "I really wanted to love Upstream, but it totally fell flat. We sat in the bar for some apps and drinks after a movie, and it was one disappointment after the next. The biggest disappointment of all was the management (and this is speaking from two people who worked and lived off of tips in the service industry for years). We weren't looking for anything but an acknowledgment and somehow felt like we were the ones causing problems.....so what happened...  We ordered shrimp dumplings and they came out raw. We sent them back and somehow were left to feel like we were being unreasonable. Call me crazy, but expect food to be cooked and want to make sure there are no risks to eating said food. New ones came out (they were great) but TOTALLY different than first ones of which the management said were \"slightly undercooked\" and he was \"trained that most food was sushi grade.\" Call me crazy again, but just admit the mistake and we all feel good.   Lastly the bill came and Upstream has the audacity to charge $3.50 an oyster for Wellfleets ($42/dozen). Whaaaat!! I'm a Boston gal who knows her seafood. Never in my life have I seen someone charge that amount. Nevermind that the menu says they are $2.50 but they all of a sudden claimed it was a premium oyster at a different price.  I can forgive mishaps and mistakes - it happens to the best of us. I cannot accept management who is so cavalier and dismissing to their guests.  Prices are high here and that is no issue for me for great food and service, however not acceptable if you can't deliver on those fronts.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJMItILp2IOTx6PnoXZ4qw"
  },
  "APyqRwSZ5g-FRWxDl7YuEg": {
    "date": "12/12/2014",
    "text": "My family was in North Carolina for my brothers' graduation from UNC Charlotte which happened to fall on the same weekend as Mother's Day.  I was able to make reservations through <a href=\"/redir?url=http%3A%2F%2Fopentable.com&s=897c359bd752b4f5407d5ea86453c82be2d1913c8d0b51b18d81fc58f52a6497\" target=\"_blank\" rel=\"nofollow\">opentable.com</a> for our large group.  The manager, Kevin, was quite accommodating.  Service was attentive and friendly.    The Mother's day brunch ($34.95) had a great selection of quality brunch items: tender braised short ribs, omelet bar, shrimp & grits, sushi, raw bar, dessert bar. Beautiful outdoor seating. Blood Mary left much to be desired in terms of garnish and flavor. It was quite bland.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "FA0qTPinqNgLTbeYwiikUg"
  },
  "S0WnXo1kk2VwX0frECzKwQ": {
    "date": "2/16/2015",
    "text": "Went to Upstream after finding it listed on an OpenTable Valentine's Day restaurant list.  Decided to take my girlfriend there on 15 FEB (avoid the rush) as she loves seafood.  Should have probably read the Yelp reviews before, but hey...   Anyway, we arrived at 19:35, five minutes after our reservation time.  Hostess sat us within ten minutes of arrival at a booth.  We ordered oysters and wine to start things off.  The half-dozen oysters (Chef's Selection) was good - the New York oysters were our favorites.  Wine is definitely overpriced at this plate, especially considering how little they give you!  We were very happy our visit coincided with half-price wine night, as that made the prices fall back to the \"reasonable but still high\" range.    For dinner, we tried the pecan crusted trout and the lobster special.  The wait was long, but the pecan crusted trout was well worth it - good meat with a good crust!  The lobster was a disappointment as it was overcooked.  We called the waiter over, and he promised to bring us a new one quickly.  Within ten minutes, we had a new lobster that was cooked more reasonably.    As compensation for the overcooked lobster, the manager comp'ed us a dessert.  We tried the passion fruit creme brulee which was quite nice.  Total bill came to $105 (dessert was comp'ed).    I would say that this restaurant is overrated for what it is.  While I like seafood, I think I can find it more reasonably priced elsewhere in Charlotte.  Ambiance was nice, but not worth the extra cost.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ULZ2skM3gn5EeHm009rrQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Oyster sampler",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-ULZ2skM3gn5EeHm009rrQ/o.jpg"
      },
      {
        "img_id": "QcI7GsavU6ULPV262SXwJA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Pecan crusted trout",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QcI7GsavU6ULPV262SXwJA/o.jpg"
      },
      {
        "img_id": "MBWjxCXSFDMLa4k1_LlmLQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Lobster special - overcooked the first time, but decent the second!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MBWjxCXSFDMLa4k1_LlmLQ/o.jpg"
      }
    ],
    "user_id": "-TgH6o0YR2mNwV-RDFNiMg"
  },
  "5SIDQ2TfHRqZ1f6_ibXZHA": {
    "date": "3/4/2018",
    "text": "If you wanna go for Sunday all you can eat brunch, it's gone. They changed it to a menu, which is available on their website.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IadAJgWN20haE3hniLSJGg"
  },
  "dR1EVkIlJEBQfqyBvORWPA": {
    "date": "4/23/2016",
    "text": "2016 is a great year to host women brunch celebrations. The highlight of my month long birthday celebration was brunch at upstream.    THE good: on the list of top Charlotte brunch experiences,  upstream holds the number one spot for me. They allowed my friends to make me feel amazing.  Known as an oyster bar- their excellent buffet food (Sunday before 4) bar is accompanied by amazing staff and beautiful decor.  I was delighted by the small plates and feeling great after 2 mimosas. My favorite were the oysters and crab cakes.   My eggs even can sunny side up (win).  The other good: this Charlotte favorite isn't a secret-upstream is for a mature audience and it was also the choice location for a retirement party in a private room.   Despite the large crowd of important people in other parties - our dedicated waitress showed us amazing customer service.   Can't wait to take my mom for Mother's Day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ne7r8bYdmMfzEop04tuEw"
  },
  "WkSM4FAEUO1MvOCYxqkJng": {
    "date": "10/1/2017",
    "text": "My husband and I had an extremely disappointing experience at Upstream.  We arrived about 7:15 ish and it was not crowded and we grabbed 2 seats at the bar- next to the service bar area.  We waited...waited some more and at one point there was NO ONE behind the bar.  In addition, there was a server that would wander behind the bar and she didn't even acknowledge us.  Eventually we were greeted by a bar tender. I told her we had been sitting there for a bit and she explained that they were \"under staffed\"-    A few minutes later the manager came by and we explained what was going on.  We ordered edamame and it came out timely..but with DIRTY PLATES....I pushed the plates towards the bar.....I was a bit disgusted and we ate the food right from the container it was delivered in.  After what was too long of a wait for a restaurant that was NOT crowded my husbands duck came out cold.  I am not sure what it going on but it just seems that there is not the caliber of service or management as there used to be.    We ask that you address the above matters and bring Upstream back up to the dining experience that is used to be.  I am afraid to say that we will not be back for a while",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R1Rvc1V1m0Hk5AyrUT3YZA"
  },
  "3PZGKr5dTfnVMjT_bdW-Pw": {
    "date": "11/28/2014",
    "text": "Thanksgving? At Upstream?  They were open and served up an extravaganza and if this is any indication of their famed Sunday brunch I need to hustle over to Upstream this weekend.  The all you can eat buffet is pricey ($40) but I think I ate that much in oysters alone.  Offerings ran the gamete from delicious looking cheese plates and salads (I say looking because I didn't sample - saving my stomach space for...) the raw bar, mussels, clams, crab legs, oysters, shrimp, smoked salmon, several types of sushi.....etc etc etc.  Also five carving stations including traditional turkey but ranging to delicious Scottish salmon. Sides were a star, I loved the stuffing with duck sausage and the unexpected pairing of butternut squash and cherries. Also, the shrimp and grits. I went back just for a bowl-full.  Desserts were lovely but not as epic as the raw bar and included an actual gelato cart rolled in for the occasion, bread pudding, cobblers, blondies, pie - you know the drill its Thanksgiving, roll out of there.  Service was conscientious and over the top helpful in a non-cloying not-fake way.  i've had many a nice meal at Upstream over the years and they really out did themselves with their Thanksgiving buffet.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XatJ1Tkqw5dw5n7WeWr_FA"
  },
  "AhdfBQikaiDVIXjcu1eX-A": {
    "date": "4/17/2016",
    "text": "Great food, Great Ambiance, we couldnt have asked for more.  The wife and I went for date night and it was great. We ordered 2 apps, the spicy shrimp lettuce wrap with pineapple and mango's which was phenomenal, in addition to the we got the mussel pot as well. The mussel pot was a nice size pot, with good portions.  I ordered the Wood oven duck, which was made 3 ways that blew me away. My wife ordered the Sea Bass in which she ate every drop. The restaurant is a bit pricey, but you get what you pay for. We plan on going back.  I also noticed that all the employees were asking \" how we were enjoying the food, or how are we feeling\", not just our server which was kind of nice. Even the bus boys cleaning off the tables were friendly. Great Job Upstream!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "80BehEkiNrdKEfQ7AZHoiA"
  },
  "scfeEWTGxHrBZkBblO7CKw": {
    "date": "3/2/2018",
    "text": "Tonight we celebrated a birthday at Upstream that I do not think could've been topped! Our server was delightful, professional, and an excellent introduction to amazing fare! We were three and shared \"The Rock\", which was delectable and fun as we actually cooked our meat on a stone! For the main course we shared lettuce wraps, but with a fish, sans eye, with chili oil, herbs and a salt mixture- this dish was the most fun! Truly a wonderful experience and I promise to return for my birthday if not before!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bLbVhPh_u7_2XM8Yd6q8Q"
  },
  "nHFM6hDvXLzaxZsoaqZu0w": {
    "date": "7/9/2017",
    "text": "My husband and I ate there last night and everything from the service, to the ambiance to the food was amazing! We opted to sit in a booth in the bar area because they had music playing and was a bit more fun. Our server was Josie and she was extremely knowledgeable about the food and the menu and very prompt and attentive. We ended up ordering a variety of raw bar food (oysters, shrimp and ceviche) as well as sashimi and some sushi rolls and it was all fresh and delicious.  My favorite roll was the snap, crackle and pop roll and I loved the variety of oysters they had...yum! Overall.. excellent experience and we will be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TwbR8e0r9N1g85vE01Y8rw"
  },
  "nFXTdCWer_95XWbz4KockA": {
    "date": "3/3/2018",
    "text": "It's been a while since we were here so we were looking forward to coming. Apparently two weeks ago they changed their menu and it is nothing like it used to be. We got the clams (so small and no dipping sauce), the sea bass appetizer (again small AND served in a plastic bag), the scallops entree which was so small and has a horrible flavor, and the halibut which was admittedly the best dish of the night. The bartender did not refresh my husband's ice cube when he ordered a second old fashioned but put a second one on top of the previous one (I know this might seem trivial but it just added to the overall poor experience). A couple who sat down next to us seemed equally disappointed in the menu change. Overall it was a terrible night and I hate we spent $175 on a meal we hated and left hungry and went somewhere else to eat. Hopefully they'll revert back to the old menu as the new Japanese fusion menu they're trying leaves a ton to be desired.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ICxK7mCa0khhluyALOhzQ"
  },
  "Gp-M2BzKTS-n229lji31JQ": {
    "date": "5/12/2014",
    "text": "First time here. Went to see Captain America (AWESOME!) and needed a place to eat before the show. Read a lot of good reviews so I figure I'd check it out.  Was by meself and welcomed by George the bartender. I did sit at the bar. George was great. Very personable and welcoming. I ordered the daily special: Halibut over a veggie succotash. Outstanding! Perfectly cooked fish and the veggies were flavorful. I chose a Chablis (yes the REAL Chablis from French Burgundy) and it paired wonderfully with the Halibut.  I didn't have time to try an app or desert. But the Entree was excellent! I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pQpEcq3OOf0ANzu4UZkW3g",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pQpEcq3OOf0ANzu4UZkW3g/o.jpg"
      }
    ],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "KQ5kqpeOHtbjFXbwlo6dWA": {
    "date": "8/13/2017",
    "text": "We tried this place during Queens Feast- and were not disappointed! Knowledgeable, attentive service and waitstaff, excellent food, great outdoor patio/ambiance. My husband had the Chilean sea bass, and I had the trout. The burrata and heirloom tomato appetizer is great, but small portion for the price. Soup of the day was a corn or crab chowder, and that was tasty as well.  I highly recommend for date-night. Great experience, food, and ambience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F3rXVVlj4T0kQ-vlaYkZgg"
  },
  "rGY1C70vzCrC2NOdAkykkg": {
    "date": "12/2/2015",
    "text": "I love Upstream!  By far my favorite restaurant in the South Park area of Charlotte. They receive fresh seafood every day directly from fishermen not from distributors. They update their menu frequently so the restaurant never gets old. Last night I ordered black grouper, my entree included a very generous piece of grouper with bok choy and peppers. The grouper was cooked to perfection.  Being from Florida, I am very critical about grouper.  This was definitely real grouper and it was a very fresh piece of fish. If you have the opportunity to go to dinner at a nice restaurant in the South Park area, I highly recommend upstream.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VQVhi5ObTQ8PE8glP5ZITw"
  },
  "Cle8q5Tw7Y39sVFiIKd03Q": {
    "date": "4/17/2014",
    "text": "Dinner Apr 17   Stumbled upon this place and glad I did.  Very nice and classy restaurant.  Super competent and professional wait staff.   Had the Calamari and it was unique.  We asked for some additional wasabi dressing to spice it up a bit.  It was very tasty and not huge in size.   Kale salad was very pleasing to the taste buds as well.   Loved the bread, the dipping oil was very tasty and I also asked for some butter and that added even more flavor to the bread.   The Flounder with Risotto was perfectly prepared and just the right amount of food to risotto ratio.  The sauce over the entree was a great accompaniment to the fish and risotto.   Did you know how serious Upstream is about their food?  They bring their fish and seafood in fresh daily!     I will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOvnDd3rMiROTwtIKL_jOg"
  },
  "8RjjyOXGhDh5vZdjGs_7Hg": {
    "date": "3/27/2009",
    "text": "Disappointed every time I've gone...won't be trying it anymore!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SCqaYcRbmXKm6vgyMeIYfg"
  },
  "yG9dLBGBfJCR8Cjn3F1B1A": {
    "date": "10/12/2012",
    "text": "We had had a disappointing meal several weeks ago, but they invited us back to give them another try. I ordered the same dishes (steamed mussels, sea bass, and salmon roe sushi) and all were perfectly prepared this time. The Maitre d' and general manager were both very attentive. Jennifer, our server, was excellent. They have redeemed themselves and we will definitely be backed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "poSnZmC42ku5Nb_heVz61A"
  },
  "SGrOWq60zjv_gAR6WRf8nw": {
    "date": "1/23/2009",
    "text": "I was amazed on my first visit to Upstream. I even went with high expectations since it was ranked Charlotte's #1 restaurant according to one website. I ordered the Pad Thai which was very rich and tasty, and it even came in a fancy slanted white bowl. The second time I went I ordered Pecan Crusted Book Trout, which was also very tasty. (Although not as memorable as the pad thai.) The restaurant looks very nice both on the exterior and interior, service is great, and food is phenomenal. I can see why this place was ranked #1 in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tGYPA6kmF8rdXf95tSMcYA"
  },
  "UzDr7757xWkpkf_BfJBrcA": {
    "date": "12/3/2010",
    "text": "visiting from charleston, sc with 6 others.  we had a nice time in the back private room.  the service was attentive and the waitress was knowledgeable about the specials.  this is a seafood restaurant with asian fusion influences.  i started with the lobster bisque which was average at best.  however, the scottish salmon entree was delicious; perhaps the best salmon entree i've had in a restaurant.  (i'm not a great salmon fan.)  the rest of my party enjoyed dishes like the calamari appetizer and the entrees Mediterranean whole sea bass and grilled filet.  there also was a nice touch where you could mix and match fish, sauce, and a side (i think it was called 'simply sides').  the wine list was considered very good by the oenophiles in the room.  it was overall a pleasant experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9tvVAexqX6_0p_BuIscwMg"
  },
  "s5TsXX4qFNsUu-QR8a2QzA": {
    "date": "3/20/2011",
    "text": "Giving this place 3 stars mostly for the service and the calamari appetizer which were both excellent.  I ordered the Tuna steak with Jasmine rice.  It was good, not great.  Pretty much just a piece of fish with no seasoning and zero effort was made on plate presentation   I asked for some wasabi oil and that at least gave it a bit of flavor.  My date had the Mahi Mahi with butter which I tasted and it did have a nice flavor to it.  I thought the place was bit pricey for what they were serving up which was nothing fancy.  The outside dining overlooked a retail store and their track lighting spot lights were way to bright for dinner.  I don't know the dining scene in Charlotte too well as I was visiting, but I did read a lot of favorable reviews for this place so maybe compared to other places in Charlotte this is a real treat for the locals.  I probably would not go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "686280h_-9WUWYtb3EZj3Q"
  },
  "IY5qx8priZRL1Rs2zruRzQ": {
    "date": "2/10/2011",
    "text": "we were hoping for more of a sushi restaurant but this is much more of a fish restaurant.  the sushi was good but the nigri was expensive compared to other places we have been.  with all the other choices out there - we probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L4lmQcnKSiYMSYIsalK7fw"
  },
  "e3ILvVJOftqNCDzdJtN7nQ": {
    "date": "4/10/2015",
    "text": "I have been going to Upstream for the past 15 years and cannot believe I have not written a review yet.  Years ago this was my go to spot for Seafood.  However, over the last few years I have tried so many of the newer places I haven't gotten back here in a while, and that was my bad.  A few months ago I met up for drinks and appetizers with a Meetup Group and enjoyed the updated bar and offerings.  Although I have seen better Happy Hour prices, the food and drinks were great! I enjoyed the Shrimp Tempura, it was cooked to perfection. A light batter with an amazing sauce.  The sushi was great as well, and the others I was with enjoyed their choices as well.  After being impressed with the food I have since been back for dinner and just this past weekend enjoyed Easter Brunch.  Let me say Upstream offers a great brunch.  Not only do they have a spread, and I mean an entire room, of salads, shellfish, carving stations, hot meals and desserts, they also offer a la carte entrees that can be served individually and brought to your table hot from the kitchen. Some of those items included a trout/crab cake benedict, shrimp and grtis, veggie frittata, and a few more.  The food was all delicous and the service was spot on.  It seemed Upstream was very organized for this day and I will look forward to getting back again soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KpwVLwKEeIG12ZrGIsKcSg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Spicy Tuna Hand Roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KpwVLwKEeIG12ZrGIsKcSg/o.jpg"
      },
      {
        "img_id": "fme2gCnAX4MepeOMkERByw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Shrimp Tempura",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fme2gCnAX4MepeOMkERByw/o.jpg"
      },
      {
        "img_id": "fArjmRMU1VpddkoaNVsCtQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Lemon Spritz",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fArjmRMU1VpddkoaNVsCtQ/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "olRvOJugRUZun79C0YAw5g": {
    "date": "3/29/2018",
    "text": "I can't say enough about the new Pan-Asian menu!  Ive always had favorites at Upstream, but the new fare is making me forget the old. I now crave the Green Papaya salad and the Chicken Karaage. They cook amazing duck for that salad and who knew fried chicken could be so tasty with a Japanese flair! The Bronzino was light but flavorful.  Krispy Fish and Pork Belly wraps were amazing and the portions were generous. We also tried The Rock, sliced NY strip you cook on a piping hot rock at the table. My husband ordered a second one it was so fun and tender! The Hot to Trot cocktail kept me ordering more and wondering why we waited so long to get out and give the new chef a whirl. Cheers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "royfNTQKZ4wqV5O2voERsQ"
  },
  "PN_xPUFfL5aK7wrrjHW1hA": {
    "date": "1/28/2018",
    "text": "It's restaurant week so my friend & I decided to try this place since we're seafood lovers and neither of us have been. We tried to make same day reservations, but with it being restaurant week they were fully booked. However, the lady I talked to on the phone said since there's only 2 of us we shouldn't have a problem finding a seat in the bar/lounge area and the earlier we get there the better. Glad she told us this because we probably wouldn't have gone had she not being we live like 40 mins away. We got there around 6 and there was plenty of seating both at the bar and tables in the lounge. I started with the spicy salmon roll, had the lobster for entree which came with potatoes & a small salad with some type of vinegarette and apple crumble for dessert. All were very good! My friend stated her crab cakes were average and had too much breading - I tried some of the chocolate ganache she had for desert and that was yummy! Service was excellent as well 5/5. Will definitely back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KWM7G0ulq1qUgFgFM2KZZA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KWM7G0ulq1qUgFgFM2KZZA/o.jpg"
      },
      {
        "img_id": "H-lZ7RwxMiYSNYBDmwvvOw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H-lZ7RwxMiYSNYBDmwvvOw/o.jpg"
      }
    ],
    "user_id": "miAFVhZKfIUJj9GX_M8Wfw"
  },
  "8tqWmfyPiAtBxc7XRim9og": {
    "date": "10/16/2016",
    "text": "Possibly the one of the top three best places for fish in Charlotte. Service is wo derful - at the front door as well as wait staff.   We ordered the Lump Crab cakes, the Dug Potatoes with asparagus, Sea Bass, and Salmon. All incredible - in flavor, proportions, plating, temperature.   Each dish had its own flavor theme, and they were reproduced flawlessly. Nothing had too much garlic, too much ginger or any mistake.   This is hard to do: run a kitchen with quality food (especially fish) and quality versions to the table each time.  I will return here, and even enroll in the cooking classes they offer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sFxr5Db79fUbWo-CriMVhg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Lump Crab Cakes app. Wonderful flavor, pickles cabbage with mastered seed infusion.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sFxr5Db79fUbWo-CriMVhg/o.jpg"
      },
      {
        "img_id": "O8n7KJ5sDGZq4ZOu9gkTsA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. The salmon with an avocado puree that includes a spicy twist and a sprout mix, with flavor of a little side of grapefruit and soybeans.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O8n7KJ5sDGZq4ZOu9gkTsA/o.jpg"
      },
      {
        "img_id": "Qw3AGLFK_Ep_uDnF-6YmGw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Dug Potatoes side, which are sautéd with asparagus and red onions.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qw3AGLFK_Ep_uDnF-6YmGw/o.jpg"
      }
    ],
    "user_id": "sWlCr2Z8Mr8fdJrN-eh_qQ"
  },
  "8HCq_MjMwA7mhqZTHItZMA": {
    "date": "3/20/2018",
    "text": "We really enjoyed the whole experience at Upstream. The staff was very friendly and highly knowledgeable. It seems to get better and better each time we go here. Plus the food is great as well. They stated that they will have more dairy free items on the menu soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ygi6CGGOBoIuY1LVCPVx-Q"
  },
  "Kj9rN2RwqFGhbQHAJYclmA": {
    "date": "7/22/2018",
    "text": "I am not sure what this restaurant was trying to accomplish when they redid their menu,  but it is Horrible. They took off so many of their good favorites that they had before. I honestly want in there and had one drink that was way too expensive, left and went somewhere else. Perhaps they can rethink about bringing some of their old items back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wq7CaHIxGl7Zqgfow-93_A"
  },
  "BScDwvXBo8IegRF6l0q9NQ": {
    "date": "3/12/2016",
    "text": "Not a BIG fan maybe it was the Queens Fest Week menu and experience but needless to say it was underwhelming. My husband and I take Datenight seriously as we have 2 teenage daughters & a toddler son so anytime alone away from home is very appreciated to just catch up with each other outside of our busy family schedule and work.   We were excited to try Upstream during Queen Fest Week (Restaurant Week) and the service was subpar to be frank. We were not treated as we expected in such an establishment. We were dressed to that nines and excited to be out. I even made the reservations on OpenTable as I always do when the restaurant is on opentabel and added notes about it being Datenight for my hubby and I. I'm use to restaurants reading notes to take into consideration any special request or to just see if they could get some info on the patrons coming into the establishment and acknowledging them accordingly. This was not the case for us and even after sharing with our server while asking about bottles of wine he still acted unenthused (lol) don't get me wrong I'm not looking for a parade or streamers for being on Datenight I just thought it would make the server smile or chop up some small talk (it ALWAYS does at various restaurant with really good service).  The cost to eat at this place to me warrants some type of happiness in the service as they are there in a position to service customer which is customer service and they should be a little bit appreciative for having work as so many don't. The food was not very good to my husband and I. Maybe we had a bad taste in our mouth already. We both vowed to try this place again to give them a fair go.  Once we do I will update my review (Addendum) accordingly.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUwYlVRuyoImgtaw8Cjztg"
  },
  "GLvXavYhRONOI6G6jhLN_Q": {
    "date": "5/13/2018",
    "text": "Really kind of disappointed. Visiting from out of town. Dined with two vegan friends that specified their diet to the server. They were served salmon roe in their meal. The manager came out to discuss the reason for roe and didn't seem to grasp their diet. Dinner was incredibly slow to get to us for an otherwise not busy night. Food was mediocre at best. Curried potatoes had little to no curry flavor.   Overall will not suggest the restaurant. For the price there's better places in charlotte.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bf54Zx8QP9DxM0TXjV1WRQ"
  },
  "RAOKv-WDxOIcftTlxjI9BA": {
    "date": "1/25/2016",
    "text": "Upstream. First time here. Came for brunch. Met my friends. Friends are awesome. We sat in the lounge. Our server may have also been the bartender. She had great difficulty keeping coffee cups replenished. Don't you hate that at brunch?   The brunch buffet/set up looked nice. The large peel and eat shrimp were delish. I am not Rachel Ray.The sushi was decent. The prime rib was tough. Some of the oysters were slimy. The Bloody Mary's are small and average.  The breakfast basics were good. You can order things from the Tapas menu that are included. The crab cake benedict was good. I am using short sentences in this review. Can you order tapas more than once? I don't know. Our waitress only asked once. Tapas selection looked better than buffet. We still tipped generously. Why? Because we are cool people. We appreciate the service of others even though it may be lacking at times.   In summary. Okay. Not great. Not terrible. Average brunch. Average Charlotte price. Our server - not so hot. Brunch at Georges Brasserie is wayyyy better. No I am not an employee there.  The end.",
    "rating": 3,
    "rated": {
      "funny": 10,
      "useful": 11,
      "cool": 12
    },
    "photos": [],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "2-Zv34tjDo9WtZuZaJl9lw": {
    "date": "10/4/2018",
    "text": "Im so disappointed in my 2go calamari portion for $13. This is unbelievable. This was less than a kids meal portion at mcdonalds. I waited 15 minutes for 4 or 5 broken pieces of calimari. NO, NO, NO, unacceptable portion & presentation for this price. I shall never spend another dollar there.   They need to try to keep their few customers happy considering there were not many patrons flocking to that establishment anymore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E6eFJgLpB7rXr2_zVbzV_g"
  },
  "bjERcIRlb4t7aVUxfgK0KQ": {
    "date": "2/10/2016",
    "text": "How have I gone so long without indulging in the perfection that is Upstream?   Where do I begin? I made reservations for a friend and I for restaurant week. I did so because the entire menu looked fabulous, and actually had desserts that I could eat despite my egg allergy. I did not expect to be blown away.  Three courses was all it took to make me a believer. Actually, it only took one, but I insisted on continuing to eat.   The starter that left me speechless was the curried cauliflower soup. I contemplated asking for a gallon to take home, but didn't want to take their entire stock. It was that good!!! There were scallops, perfectly creamy cauliflower, and fried onions on top. My goodness, I'm craving it now.  My main course was a beautiful braised short rib dish with creamy squash and grilled boy choy. The portion was spot on, but I made sure it lasted so that I could savor each flavor. The short rib was tender, so tender that it fell off the bone, and the squash was a welcome accompaniment. The bok choy however, superb! How could a vegetable stand up to the protein on the plate? I don't know, but it did!  The third course was an apple strudel, alas it wasn't what I asked for, but when they put it on my table...I didn't complain. It smelled divine and tasted like heaven. Gosh. I need to go back ASAP. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "b2xjyZNOqjZagDoGJFKf2g",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/b2xjyZNOqjZagDoGJFKf2g/o.jpg"
      },
      {
        "img_id": "mTCgoKd1ZZGIiYN3Ji0AiA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mTCgoKd1ZZGIiYN3Ji0AiA/o.jpg"
      },
      {
        "img_id": "nWBEmEXd7GHi3M7Lo0XtEw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nWBEmEXd7GHi3M7Lo0XtEw/o.jpg"
      }
    ],
    "user_id": "IdD1Z_PMqF0zUn3uZWSeAg"
  },
  "MAZotCejA7ODwwJoOihsiA": {
    "date": "3/29/2018",
    "text": "The service is great!!! Food so fresh and delicious, no complaints! I will definitely come again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KfCmgxgI4iD8JeXcW1Erw"
  },
  "WX_VLUNgr3xbiEKG3eZ6nA": {
    "date": "2/3/2018",
    "text": "First off the place is nice. The atmosphere and the food we got was great for the most part. The reason I give it two stars is, one they brought my wife hush puppies with her meal that were grossly under done as in raw batter like it was filled with pastry cream. I mean this is the south there are a thousand restaurants around you that do hush puppies how can yours be so bad. Second I ordered a salad that never came. I was extremely excited to try this place and left feeling like I would probably never go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f-ua_rks85kyq40EZT3KKw"
  },
  "znf-9z1Jf2JW8q69tpe2Ig": {
    "date": "6/11/2017",
    "text": "Went here for Sunday brunch and it was packed and full of delicious choices, did not realize it was a buffet and it was $27! So I ate as much as possible trying to not look greedy in front of my friends.  They had salmon, prime rib, pork loin, and the brisket was phenomenally tender.  Shrimp and oysters and sushi. Mac and cheese was kind of velveeta shells-y but the squash casserole was so awesome I wanted to take the whole tray to my table.  Salad and bacon and said have and bread pudding and layered chocolate trifle. Desserts. And you could order French toast and waffles off the brunch menu for free. I asked for French toast but they forgot to bring it. You have to go for brunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mVcAsvHlfSRQaRHcsJKB2A",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Brunch you gotta go!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mVcAsvHlfSRQaRHcsJKB2A/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "0RXj8x7cTxhxZRQ-zcoCiA": {
    "date": "2/17/2014",
    "text": "Yep! This place gets my approval as another solid Sunday afternoon brunch spot!   I came Sunday afternoon with about 10 girlfriends. Even with our large party, our waiters and waitresses were great. They kept clean silverware coming, tapas plates by the tower (basically we ordered everything on the menu and they brought them out three plate with different options at a time) and our water, tea and mimosa were always full!   The brunch selection was phenomenal!  Here are a few of the highlights for me:  -Made to Order Omelets -Salmon -Steak and Eggs -Fish tacos -Waffles -Shrimp and Grits (sooooo good) -Fried chicken -Ribs -Bacon and Sausage -Mac and Cheese -French Toast  As if that weren't enough you also get your choice of salads, sushi, fruits and if there's any room left they even have desserts!   Seriously, there's no way you'll leave here hungry. I'm already looking forward to my next visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "UGpPizUxviBeUI3Zuh_cQA": {
    "date": "7/21/2018",
    "text": "Amazing seafood dinner.  Everything we had was spectacular. Great martinis.  Green papaya duck confit salad.  Crab cake croquets.  Lobster with foie gras dumplings.  Passion fruit profiterole.  Not a single thing that was not outstanding.  Friendly and fun wait staff.  We went for Queen's Feast week so it was a little cheaper than normal, but it easily would have been a good deal at a higher price.  Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t64PCVe-LK34tL0eBoOiJg"
  },
  "ktyFlaQVC4nQafvx7hOkOQ": {
    "date": "4/20/2018",
    "text": "The service at Upstream is always outstanding. They recently changed the entire menu in the restaurant and bar area.  We have been twice since the changes because this is one of our favorite restaurants. We've had private parties here. The new menu is a huge disappointment - too drastic of a change. This is now a Japanese restaurant not a seafood restaurant.  The sushi menu now has less options.  We went on a Friday evening and the place was pretty empty - assume others don't like the changes either.  We won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2EpiJ3J3uoygBhjfUsrgLA"
  },
  "da4TE_BGZo0A2mwJ7wVqAA": {
    "date": "4/8/2017",
    "text": "Amazing quality seafood.  Went with my wife and we got 3 appetizers and 2 entrees (the appetizers are small...good things come in small packages).  Everything we got was good including the creme brulee to top it off.  Service was good but one side dish I ordered was forgotten and a sushi menu was never offered to us (would have loved to have tried it)... so not quite 5 star service...but close.  The food is so good the service could have been terrible and I still would have rated this place high.  Yelp says this place is \"dressy\" so we wore business casual.  Many patrons had on jeans and one dude was wearing shorts...so next time I'll be a little less dressy and a little more comfortable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "85jHfbkf7GrDejV_Ukz60g"
  },
  "KLxYMPv8h_A41p-1V1MsUQ": {
    "date": "1/26/2018",
    "text": "I had the opportunity of eating here for the first time ever and let me tell you that it was some of the best seafood I've ever ate. We started with appetizers. We shared the oyster salad and not just standard Calamari, but sweet and sour calamari, which was very unique and tasty. For the main course I had the Sea bass and my dinner date had the lobster, both were fantastic! The best part of the dinner was our waiter, Yekta, who was one of the best waiters I've ever had. I can't wait to come back and I'll definitely be requesting Yekta for our waiter.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "195dIoZsD4mUgilR8kG0tw"
  },
  "bEMhlNVfNJ1uVw6tAxfWOA": {
    "date": "2/16/2017",
    "text": "Wicked weed on tap however I simply could not get over how tiny the food was. Two tiny tiny tacos will run you $13. The bartender was very nice though.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MaoJsewEjD2TLKhezVZo-A",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Tiny tiny tiny food. Just enough to make you hungry.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MaoJsewEjD2TLKhezVZo-A/o.jpg"
      }
    ],
    "user_id": "MQUJi1FzqiEkuBlvvRrZzg"
  },
  "Pcp_lIGwdFgEOr53OYXY9Q": {
    "date": "9/7/2016",
    "text": "My husband and I don't often have a chance to go out to dinner. When we do, I want it to be wonderful. Tonight was our first time to Upstream and they did not disappoint us. Food was fabulous. Service was great. We will definitely come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pKU7LYb7tzdqczCq2tvQ4w"
  },
  "9Eak8U5vgHnGGNwvzFvuqw": {
    "date": "8/31/2016",
    "text": "Love this place. Great selections and some real treats. Nice bar and nice little outdoor spot when weather cooperates. Service is good, but like anyplace, it depends on who you get and how busy they are. Over all, great place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvwt8q7UNRrLIKhkB9zsWw"
  },
  "8tbRdfIzASxeqq54z71RAA": {
    "date": "3/1/2015",
    "text": "Likes: Great service. The calmari is the best that I've ever had - fresh, tender and not hidden behind a deep-fried batter. The sea bass is also the best rendition of this fish I've ever had.  Gripes: The shrimp & avocado ceviche was just ok and was missing the avocado. The restaurant is a bit loud and hard to hear everyone at a larger dinner table.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CHUwl3xykFfWHnz_F6VIzg"
  },
  "MGG5n_mGXyHrKVrrQ2SKRw": {
    "date": "7/25/2014",
    "text": "This is a review for my last night Restaurant Week dinner. And I am torn about how many stars I should give. Here is the thing, the service wasn't great, but as crazy as it sounds, it was the best bad service I ever had.  RSVP for 2 at 7:45pm, my friend and I arrived on time (gasp!). Hostess said there's a booth for us, but then she changed her observation (to no booth). We offered to wait in the bar area if that's easier, but she pretty much told us they've been behind on schedule and best for us to not miss a table when one is available. We stood around for a few minutes awkwardly (my friend was desperately needing a drink apparently), and finally we got sat in the 1st side room on the left, at a 4-top (with only 2 chairs) toward the back, next to a party of 10.  Water person (what's the PC term for water boy?) came and filled our glasses. And that was as much action as we received for 10+ minutes. It's starting to bring back the memory of my Fahrenheit nightmare. Ironically I'm with the same friend! I think he and I and fine dining just don't belong together. Meanwhile the 2 waiters assigned to tables around us just came and gone and never even batted an eye at us. I finally waved down the water person and softly asked him \"who's our waiter?\"   My simple question led to an array of apologies. Manager showed up and offered us drinks and brought us menu. We got assigned a waiter, we placed an order of the chef's choice half dozen oysters and the night slowly proceeded. By slowly, I meant we didn't finally leave the restaurant until 10 to 10pm. Thank goodness the 2 of us have known each other for years, and had plenty to chat about. It would have killed any potential if it was a 1st date situation. Imagine the silence...  Food wise the RW menu was solid. There are plenty of options (and not just salad). Essentially the entire menu was up for grab, some involves up-charge. I personally was perfectly fine with my seafood soup (it's not very curry, don't let the name scares you), my 1-lb lobster (split in half, and amazingly they left all the brainy gooey goodness for me to tear into, though some may argue the meat itself was a little overcooked) and creme brulee. It definitely worths the $30. My friend had the NC shrimp salad (huge portion, not sure if I liked the dressing, but it's whole shrimps on greens), seared tuna over rice cake (definitely digging the rice cake), and flourless chocolate tart and ice cream. Tuna has a small up-charge (I'm thinking $6).  At the end, they pretty much comp everything but our dinner. 2 managers have repeatedly apologized for the service. I couldn't even be mad at anyone. I guess if I'm to have bad service, it's best when they owe up to it and try hard to make up for it without me even having to ask. We didn't expect them to comp ALL the drinks (I only had 2 glasses of wine, but my friend went all out on his double vodka tonic). We made it up on tip because it's not our server's fault.  So at the end, it was a good night and a great dinner. I decided that 4-star is deserving given the circumstance.   Food - 4 Value - 5 (for Restaurant Week) Service - 2 Afford - 5 (lol)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "VlB82MuRQU9HZOWDZA7ZbQ": {
    "date": "7/23/2015",
    "text": "The food is amazing!  The staff (Susan both times I've been) is very knowledgable and definitely will steer you in the right direction. They are accommodating and welcoming! My 2nd time trying octopus. The 1st time (at another restaurant) didn't go so well, so this time, made me a believer! My mahi mahi with blue crab fritters: shut up. The blue crab fritters were super light \"hushpuppy-ish\" on a spicy oil. That paired with my Pinot Noir... The fish was perfectly flaky! Well, I thought I was happy until I got to my dessert. That was hands down the best vanilla ice cream and the perfect pairing with the flourless chocolate torte. All in all, I definitely recommend spending time here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RtQ4W8GgzJW3lb2Dm0U9QA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Woodfired Octopus",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RtQ4W8GgzJW3lb2Dm0U9QA/o.jpg"
      },
      {
        "img_id": "4v3whI8CaGJ4fHn6NqhFBQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. 1lb Lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4v3whI8CaGJ4fHn6NqhFBQ/o.jpg"
      },
      {
        "img_id": "67QdoH8u2LRdnHdaaHjSxg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Mahi Mahi with blue crab fritters",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/67QdoH8u2LRdnHdaaHjSxg/o.jpg"
      }
    ],
    "user_id": "79xyOOv12RyNeErO5zAB4w"
  },
  "mOeS5Gvfd2bSXbkc0ESjYw": {
    "date": "7/18/2016",
    "text": "So I have to confess.....I have been a bad patron of this amazing place!!!!! But I have good reason, I don't live right behind there anymore. So I have started going back and let me just say the place has gotten even better! The food was OMG amazing, the service great, overall restaurant perfect. Drinks were soooo smooth and good....got our drink on, and it made us order more food - we ate bar bites. Shrimp tempura and lobster tempura - lets just say more please!!!! I am making an effort to start going there more often, and I will be back this week on Wed.......counting the hours......  Such an amazing place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOXdZVz1PxGGwPq6PSXeGQ"
  },
  "T_APNMQkXvBTbWH-f-bkTg": {
    "date": "2/28/2016",
    "text": "I normally do not give bad reviews, however I feel I need to share this so no one else will be disappointed. The Sunday brunch buffet is overpriced for the selection served and the shrimp and grits have barely any shrimp.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-A9XLdzSSZz6jxJSu_CBNQ"
  },
  "nEsWiWi62A7kaZ0K1q_CpA": {
    "date": "2/4/2016",
    "text": "What I love most about this place is the customer service. The live is alive and well in the South here.  I had the steak and potatoe (had fancier name)it was good but it wasn't memorable.  The servers and cook came over 4 or 5 times to check in on us and the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sVn_rNopTpPik0iL_Xm7ag"
  },
  "opkT1lcp3Hr01fZFDYNWxQ": {
    "date": "8/9/2014",
    "text": "It had been a while for me and Upstream hanging out together. We had broken up over brunch one Sunday, but I was ready to give them another chance for dinner.  I was here for a business dinner and all in all it was a pleasant experience for everyone. The menu is seafood heavy and we wound up ordering calamari and mussels to share. The tomato sauce for the mussels was some of the best that I have had in a long time. The calamari was good too, but nothing to get too excited about as it  was pretty standard calamari.  For entrees, we all chose a different fish option from tuna, bass, halibut and black grouper. I had the grouper and it was a great dish. The menu describes it as \"Tim Griner's Line caught NC Black Grouper\" and the fish was definitely fresh and cooked to perfection. It was accompanied with local field peas, sweet corn, wood oven roasted tomatoes, bacon and a ramp vinaigrette. I would definitely order this plate again, unless one of the other fish or specials was calling my name. Service was good and certainly better than I have had in the past here. They were busy on the weeknight that we stopped by so there were a lot of servers running around.  So I guess that my relationship with Upstream is back on again, but I think that we can both agree that it's ok for us to see other people as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "yYgnxxpbStQMppFSHH7MCw": {
    "date": "8/24/2009",
    "text": "I brought my partner to Upstream for his first visit.  We had a table in the middle of the dining room.  I love the look and decor of Upstream (especially the ceiling!) so this felt very cozy.  The only disturbing thing about it was the noise level.  There's no wall between the cozy dimly lit dining room and the loud blaring kitchen.  I understand (and enjoy!) the concept of \"open kitchen\" dining, but I think that should be reserved for different types of restaurants.  The open kitchen didn't feel right for an upscale seafood restaurant that can/should be used for special occasions and dates.    Anyway, we had fantastic service.  Just be prepared to enjoy an hour and a half relaxing meal.  To start, we tried the bento box appetizer, which was a combination of different things (sashimi, sushi, beef, eggroll), but I think next time I would go with just a couple of sushi rolls.  We also splurged and added the flash-fried calamari as it sounded so good when our server was describing it to us.  And she was right.  It was very tasty and not at all chewy. It also didn't include the baby squids with attached tentacles that you might normally find in calamari dishes.  The only disappointing thing was the portion size.  Good thing we got the bento box, too!  I ordered the sea scallops for my entree and chose the Japanese ponzu sauce (there are 5 choices!) to go with it.  The three tennis ball-sized scallops had a LOT of flavor to them and the fingerling potatoes on the side were tasty, too.  Again, though, the portion was pretty small, but with all things added up, we were full by the end of our meal.    All in all, we had a very enjoyable experience, but I can't say that when thinking of places to go in the future, I'd return anytime soon.  There are so many other options out there and Upstream didn't \"wow\" us enough to return time and time again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "-s5rD_qZEPyTHu4SH-l3ow": {
    "date": "2/21/2016",
    "text": "Went for the first time today... or so I thought ..... after going inside realized I had been here before a few years ago but it was not memorable in a most negative way...      I read the menu last night..  had no interest in a buffet brunch.... totally off buffet food basically because people don't care about others so who know s what little extras you would consume ....  Anyhow .... I was under the assumption the lunch menu would also be available .... found out SundAy's it is not..   I should give the place a chance for lunch on another day or dinner.... I probably won't...  Best    Me ...  PS met the owners on a plane some years ago on route the Bahamas ... they were very special ..... ha",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enCUhmlUx6uZDwzWv8yCOQ"
  },
  "KQKziMcynAOZ9ntevG6C8Q": {
    "date": "8/2/2014",
    "text": "I live right by here and go a lot. Staff is super friendly, food always excellent & great selection.  I usually just sit at the bar and order tea and dinner. It's more casual than the dinning area and I go alone often.  It is expensive, but you know that going in and it's ALWAYS worth it. The freshest and best quality seafood in town. I'd rather pay more for excellent than a little less for mediocre. They have oyster specials for $1 through the week during certain times and from 5-7pm a bar bites menu where many rolls and food is 1/2 off. Great time for dinner. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LuJevEFXTKvAkKBR1kmylg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Lobster w wasabi butter. Yummmmm!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LuJevEFXTKvAkKBR1kmylg/o.jpg"
      }
    ],
    "user_id": "8TDZyVFg5X-nYogNgu4dQQ"
  },
  "7pmhRCuYaYB98tvg_oBe9g": {
    "date": "10/22/2015",
    "text": "Overpriced for the quality.   I only had sushi and oysters so can't speak for the rest of the menu but overall I was dissapointed with Upstream.   The sushi rolls were mediocre at best and their version of New Style sashimi was pretty terrible. It was basically dried out, overly thin and the flavor was not good.   The only saving grace was that it was happy hour and according to the menu the items marked with an * were half price.... Or so I thought until the bill came. Turns out the sushi menu is very misleading and it was full price which amounted to just less than $90 for two rolls, a poorly prepared salmon sashimi and half dozen oysters which I left the selection to the server who of course picked the \"non happy hour\" ones...  I've paid $200 for omakase at sushi restaurants out west and happy to do so if the quality is right but this was way off the mark.   Definitely wouldn't recommend as I assume there must be better quality sushi in the Charlotte area.   I gave it 2 stars instead of one because the service from the waitsatff was very good despite the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MwUbaK8f9vVSynQt83_xwQ"
  },
  "cweKUsfc8wRjelGrsCAfew": {
    "date": "2/20/2016",
    "text": "I usually am skeptical about inland sea food restaurants. I have not been here for many years , what a pity. The food is excellent , wine list is good and service is also very good. I will be back here next time I am in Charlotte, even thought it is a bit of a trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qfWTMX-SkHZgGheplo3t9w"
  },
  "A-Sbqedj29jTNrOfuIXBPg": {
    "date": "11/24/2017",
    "text": "My husband and I were so disappointed in this restaurant! We had made a reservation for Thanksgiving dinner. The first table the hostess attempted to seat us at was crammed in the bar right on top of the adjoining table. We asked for something different and we were rudely forced to wait. Once we were finally seated, we were ignored by the wait staff for 15 minutes before someone stopped to ask if we wanted a beverage, but we had no beverage menu. I guess we were supposed to just guess at what was available. Again, we were ignored by the wait staff over and over and over again while they hustled around to the surrounding tables. When our waiter finally realized we had been there over 30 minutes without so much as a greeting, he did apologize but he continued to pay extra attention to every other table but ours. The meal was buffet, and every time we went in for a serving - the dishes were cold and empty! We waited time and time again for more dishes to be brought out but almost everything was cold in the serving trays. Oh, and the prime rib was RAW! I love Rare prime rib - but this was RAW! Save your money! We $150 for 2 people and it was not worth the money! If you were looking for very subpar food and service - by all means enjoy. My husband will not be returning. Ever.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vVE-LQkDNUFXyo3O78sSNg"
  },
  "gLZTJonF5I_k1XG0OB39CA": {
    "date": "8/6/2013",
    "text": "My boyfriend was a gem and treated me to a surprise date night during Restaurant Week. Unfortunately, he didn't try to make a reservation until we were on the way to Upstream... Opps. (I still think he gets an A for effort, no?) We were pleasantly surprised that we could walk in and eat in their cozy bar area, which to me, was just as good as sitting in the dining area. What a great option!  Our server was courteous, professional, and prompt. She truly knew her stuff and was very patient when it came to questions about the wine and strong pairings. We shared a nice bottle of wine; he enjoyed clams as an appetizer and I the Lobster Bisque. For our entrees, I had the Scallop Pad Thai and he the Tuna. All we cooked to perfection with really strong infusions and personality. It's very apparent that the Executive Chef really has a talent and is extremely accomplished and takes the considerations of his food and creations quite seriously. The presentation was spot on and it was extremely apparent that the food was made with very fresh ingredients. Ever have a meal where you just feel heavy? Though I did a number on my entree, I left feeling content and truly satisfied.  What sold me on why I will always be a fan and look forward to return visits is how their management team responded to an 'incident'. During our appetizer, my boyfriend chipped his tooth while eating clams, as a clam was not shucked just right. The server and manager offered their deep, True apologies and then offered to take care of any dental fixes. I was really impressed by they're concern and jumping right into to offer a fix. Bravo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "sq8rtkRoKA7KQKhlU4_yuQ"
  },
  "TIRl9AgcoJ3-ebNMMRFnBA": {
    "date": "3/5/2016",
    "text": "It's a great sea food restaurant, I had a few dinner there and l liked it. But I recently found out the lunch menu is great too and much cheaper. I live behind the restaurant, when I take a walk every morning, I see a sea food truck stops at the restaurant around 9 am everyday, which means you get fresh sea food everyday! Try the fish sandwich at lunch!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2sQs4QSmZrleLUsW1Uk7FQ"
  },
  "QyKLIidE1J7graIgfpsmPQ": {
    "date": "6/17/2015",
    "text": "Left hungry, Really!  some items on the menu we tried were good, Oyster corn chowder was excellent. Fish on the other hand came out in a soupy mess of uncut vegetables. Crab cake app was bland. Shrimp appetizer consisted of 2  shrimp some what large, but they were not fillet and stuffed with crab either. No seasoning. Bring your Tony's and tabasco, You will need it.  W",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "imEWX3K4AYAn1g4sO38jsw"
  },
  "Z2t86IbGPdTyh3SNYeY2TQ": {
    "date": "4/22/2013",
    "text": "Phew, where to start with this place!!!!!!????   This review is from a 1 time dinner experience on a Saturday.   The ambience is excellent.  Comfortable seating, spacious, and beautifully decorated.  Fun crowd that is business casual.   Our service was excellent.  Really personable, made some solid recommendations and just really pleasant.    The food was INCREDIBLE.  Let me spare your time and tell you that if you a very fresh tasting seafood dish whether it be sushi or oysters...go here.  Presentation is great, portion size is nice, flavors outstanding.    Overall, one of my best meals ever.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofyqBdgClwRuA5KtZAfUPQ"
  },
  "jntoFTKm5UpxcUXHukZEkg": {
    "date": "2/27/2013",
    "text": "We went for the Sunday brunch.  So good it was worth getting fat for.  Everything was super fresh,  our Waiter was totally on the ball and the perfect mesh of attentive without being intrusive, plus he totally didn't judge me for my third order of french toast.  *I* judged me, but it was too good to care \"Look away, I am going to lick my plate now...\"  I don't think there was a single thing I didn't love and the fresh omelette was sooo good.  The veggies were all perfectly cooked and super fresh.  My friends and I have agreed, this is now a weekly tradition that we intend to diet the rest of the week for.  Side note: The food was so good even my picky four year old sat quietly and ate.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 3,
      "cool": 5
    },
    "photos": [],
    "user_id": "6O5Q0kyHUqcc_Vl2_uVCbw"
  },
  "49zxiM8rEpLfkp5vLAovcw": {
    "date": "1/17/2016",
    "text": "Since the closing of LaVecchia's Seafood Grille, my thirst for upscale seafood in the Queen City has gone largely unquenched.  That is, until now, when I had the chance to go to Upstream this past Thursday evening for dinner with my dad.  Food:  In case it hasn't dawned on you yet, this is mostly a seafood spot.  Therefore you should probably at least have a taste for good, fresh, seafood before dining at Upstream.  To begin with, we ordered a trio of appetizers - the Sweet and Sour Calamari, Lump Crab Cakes, and the Black Iron Mussel Pot.  All of the appetizers were different than similar renditions I've had of these popular seafood dishes.  The calamari was not your traditional fried and breaded calamari.  Instead, the calamari was pan seared, not breaded at all, and served tossed in a thick sweet and sour sauce - very tasty!  I loved the MUSSELS!  The tomato-garlic sauce the mussels are served in suited me perfectly.  The crab cakes were probably my least favorite of the apps - they were good, just not great.    We split the salmon for our main course.  The salmon was, in a word, flawless. It was super tender, succulent and bursting with flavor! The pearl pasta and scallops it was served on top of, was the perfect compliment.    Ambiance:  As we were able to be seated right away, we really did not have a chance to tour the restaurant that much.  But from what we were exposed to, I certainly have no complaints.  Quiet, classy, upscale, friendly, chic, are all adjectives that come to mind when I think of the ambiance at Upstream.    Service:  Let me just say, our server, Brooke, was super friendly and was one of the most professional, knowledgeable servers I've ever encountered.  She was knew the menu from front to back.  She was willing to accommodate any request we might have.  The only thing that topped the delicious food was the unforgettable service.    I think my seafood crusade can finally come to a rest - I've finally found in Upstream, what I've been so desperate for over all these years  - great service, upscale ambiance, and fresh, quality seafood.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 15,
      "cool": 14
    },
    "photos": [
      {
        "img_id": "5vAaHPulzGCHkYbhyEJsJQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5vAaHPulzGCHkYbhyEJsJQ/o.jpg"
      },
      {
        "img_id": "gpyuP4TQv6qH_KOBV092KQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gpyuP4TQv6qH_KOBV092KQ/o.jpg"
      },
      {
        "img_id": "j2DYznY_sV24wjXHwq6FFg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Crab Cakes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j2DYznY_sV24wjXHwq6FFg/o.jpg"
      }
    ],
    "user_id": "R_wlZO-jKFGEVJnSfWISqQ"
  },
  "Jkv9pH5CmhS5v90_UIv37Q": {
    "date": "6/25/2017",
    "text": "I'm really torn here between a 3 and a 4 star review. If not for my most recent visit to Upstream I'd have given 4 stars. I've only come for brunch though, if that's any disclaimer.  On that note, generally speaking the brunch is good stuff. Their buffet carries a wide selection of options from gourmet to staple southern eats. There are raw oysters and cocktail shrimp to mac and cheese to charcuterie to sushi to cuts of roast beef to cheesecakes and cobblers. There's really no rhyme or reason to it, not that it's a bad thing. I think people like the options. Of course have bloody marys and mimosas. They also pass you a menu of about six small dishes you can special order straight to your table. These include shrimp and grits, trout (my favorite!), a mini omelette, Belgian waffle and eggs benedict. I'm mostly disappointed in their choice to remove the shrimp and grits from the buffet and put it on the menu. I suppose it is still endless though.  I never can complain about the flavors of things here. I like most of what they serve but for a majority of it I wouldn't say that it's worth the hefty price of $25+ for all you can eat brunch. We all know we never get our money's worth at buffets anyways. The service is also a bit spotty so I would find it difficult to further justify that high cost. The experience in general isn't bad. The location and atmosphere in the restaurant is an attempt at fancy that clashes with the buffet style set up and some of the more basic food offerings.  Ultimately I'm not saying I wouldn't come back here but it wouldn't be anytime soon simply because of the price point. I'm going to be out searching for better quality at this price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "su5Jqnu1idTWEWIh_sXZXg": {
    "date": "2/24/2018",
    "text": "Went during restaurant week! I enjoyed the shrimp appetizers and the Lobster. I need to get back there to have more! The service was great. They were attentive but not over the top. I am looking forward d to trying their cocktails.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wjp4S6ea7qWvVxXCRWdvog",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wjp4S6ea7qWvVxXCRWdvog/o.jpg"
      }
    ],
    "user_id": "m62APm7P1cmcibpv9XRTNg"
  },
  "MRtX9mKHQo4Ur-BSdJI7cQ": {
    "date": "8/6/2017",
    "text": "Got some time to kill? Great! Be prepared to sit in here no less than an hour. Every time we come here the service is incredibly slow regardless of how few people are sitting down to eat.  Today, for example, (August 5) I came in alone and sat at the empty bar and had 3 sushi rolls and it all took over an hour.   I stood in the entrance for a couple of minutes as the first couple in front of me was seated. The hostess came back to answer the phone, still not acknowledging me to tell me just a second or placing the call on hold. I ended up seating myself at the bar, assuming bar service here would be as attentive as literally anywhere else.   It sat at the bar for about 5 minutes without being acknowledged by the two people appearing to be working the bar. They would pop in the bar to make a drink and leave...they didn't stick around. After it was painfully obvious I was there and not leaving, then I was given some water and menus. About a minute later I was asked if I was ready to order. I was not I had just been given a menu I am not in the least familiar with. Nobody came back for over another 10 minutes. After someone finally came back around my order was taken and the sushi arrived quickly. Seems the only person being efficient in the bar area was the sushi chef. After I was finished with the 3 rolls (which doesn't take long for a person eating their first meal of the day at such an hour) I sat and waited for someone to to make an appearance for me to ask for the bill.   I arrived at 1:22pm and left at 2:31pm.  I didn't want to sit around. I was just grabbing some lunch at an uncrowded place before picking my husband up from Longview...but I was late .   I shop at Phillips Place regularly and that is the only reason I've kept giving Upstream a chance, because I'm there. I don't go because the food is just spectacular, it's ok at best. With better service, I could justify the cost as I do with many other places. Also, with better service, we all could have saved 30 minutes on this experience.   Seriously the biggest waste of time and worst $40 I've ever spent on 3 sushi rolls. I can guarantee it will never happen again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q4OeVCSL3e5LDoUdltmySg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Deconstructed tuna roll.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/q4OeVCSL3e5LDoUdltmySg/o.jpg"
      },
      {
        "img_id": "0ANve9DWav8dxLW35rymog",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Deconstructed tuna roll and salmon roll.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ANve9DWav8dxLW35rymog/o.jpg"
      }
    ],
    "user_id": "Nisi9niOcx8-mgm0Oa2oHQ"
  },
  "6koHyhKejK-3uGqBAOpTBw": {
    "date": "9/4/2018",
    "text": "This place is awesome - we had been here once many years ago and had not been back till tonite.  The new menu is great - and the food is so so good.  I had banana leaf wrapped sea bass - the best I have ever had.  Our new favorite restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6J8xGgdHp1c__ZmM-P7KEA"
  },
  "DPoQmGILC3rmBlP81eftZw": {
    "date": "4/30/2017",
    "text": "Even after more than a decade and a half, this place is still one of my favorite, dependable go to places for a celebratory contemporary meal in an elegant but non-pretentious setting. Great seafood spot with a fusion and Southern cooking twist that results in hearty meals, extensive drink choices, and catered ambiance.  Food is always creative and tasty but service seems to fluctuate between fantastic and inattentive pacing.  Can be a slight downer of you're with a large group waiting on your entrees for the night, but overall not a deal breaker.  Nice spot to be able to relax one on one or with a group to take your time, have great conversation, and create special culinary moments together.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Uxcfla1lmWzH8dPr0KK8JA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. A sneak peak at the dessert menu, with both solid and liquid desserts.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Uxcfla1lmWzH8dPr0KK8JA/o.jpg"
      }
    ],
    "user_id": "kNFZuS-VTBt3lc37HwS-yA"
  },
  "aROAT_CYz8wunUuv3-YAwg": {
    "date": "1/3/2019",
    "text": "Went for New years day brunch. Brunch is unlimited but not buffet style. You order from your waiter two small plates at a time. Plates are small portions (example: calamari came with two pieces and sushi roll was 4 pieces). I wouldn't have minded any of this if service wasnt so slow. The plates are only a few bites but it took 10-15 mins to get your next plate. It took us almost 2 hours to taste everything we wanted on the menu and we were still hungry. Our waiter seemed overwhelmed and appeared to be annoyed whenever we ordered another plate. We also got some very fishy tasting oysters that we spit out immediately. Eventually, we were tired of waiting and just asked for the check. Only reason this gets any stars is because the food was actually very good (exception of oysters). Maybe I would go back to try their regular meals but brunch isn't worth the time or money. TL;DR brunch is only \"unlimited\" if your willing to spend a few hours and don't mind a grumpy waiter, however food was good",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H61dNiTHkySboLikXA8zIA"
  },
  "c5hEr_jgFc9wg3_3M7QgwA": {
    "date": "12/18/2015",
    "text": "The most amazing bar I have been to! Excellent customer service and knowledge beyond a millennium.  This place masked the best drinks and the food looked very unique. I feel bad for showing up after the place was closed.... The bar was open and man, was it impressive: an exclusive mixologist made my drinks... He asked what decade old fashioned I wanted, and asked if there was any other way to make a whiskey sour when I asked if they use egg whites!!! Wow, impressed, professional, no holds barred the best bar I have been to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fsPH_MdPiUm0kMsDwCMKXQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Masala spiced pumpkin spiked bourbon over orange juice? This place is ridiculously crazy good!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fsPH_MdPiUm0kMsDwCMKXQ/o.jpg"
      },
      {
        "img_id": "Tv-UC71Lr_nHmlvPKCLAgw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Prabu punch!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Tv-UC71Lr_nHmlvPKCLAgw/o.jpg"
      },
      {
        "img_id": "XAlUoHJW3qxlYSBr7CLE5A",
        "caption": "Photo of Upstream - Charlotte, NC, United States. 1920&amp;#39;s old fashioned!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XAlUoHJW3qxlYSBr7CLE5A/o.jpg"
      }
    ],
    "user_id": "rJOnnKFLsAWsqZf26PH8_A"
  },
  "SP_HGc3ATBxceGrJuqwGMA": {
    "date": "6/4/2018",
    "text": "I'm currently kicking myself that I didn't come here sooner! Both myself and my husband were seriously impressed by our experience here. We came at a super random and off time (Memorial Day), and ordered a few cocktails, apps, and entrees. SO GOOD! Seriously, I don't think you could order a bad meal here.  The steamed sea bass was my favorite, but the crab cakes were equally incredible! The quality of the fish here is just beyond amazing, and I truly don't think a review can do it justice. Go and try it for yourself, you won't be sorry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzCgd62svU_tmtawMqQTQw"
  },
  "x8KjKMSaIsEs3jsVH_9t2Q": {
    "date": "1/11/2019",
    "text": "Not the best food experience. Staff was very attentive but the food just did not deliver.  Salmon dish was cold , potatoes some cooked some hard..mg friend had the sea bass and it was over cooked.. the chicken sandwich was very tough seemed like dark meat extra fried .  Again, staff was great but food was not.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4TWNdzGuAYT7Pa7ocZipAg"
  },
  "Ls34M-WiMxHlUic4ld2Z8A": {
    "date": "10/11/2016",
    "text": "We have done the Sunday brunch three times now. We love the fresh seafood like oysters, muscles, shrimp, and smoked salmon. There is a carving station and they always have different home style food to choose from. Very little on breakfast items. They do typically have breakfast meats. Also the tapas plates tend to be more breakfast oriented. We love the french toast, nice and gooey!  They also have a salad bar, sushi and a dessert station. The desserts have been different every time we have come. If you want to order a cocktail make your reservations closer to noon. If you want to avoid the crowd come when they are open. We tend to get there at 10:30 am right when they open and have the place to ourselves for a bit.  The staff is always exceptional from the hostess, to the servers, to the people restocking the food.  We like to treat this as our special occasion place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PZfPUg6Y_2mYeSld4jOjXw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sunday brunch tapas menu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PZfPUg6Y_2mYeSld4jOjXw/o.jpg"
      },
      {
        "img_id": "zNGWDDH73QAGb5HgdkjwPw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sunday brunch desserts.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zNGWDDH73QAGb5HgdkjwPw/o.jpg"
      }
    ],
    "user_id": "07fvGXQhmO24Qm5GAPfFIQ"
  },
  "3lg8-1kpiqa5gY8xKA_mpQ": {
    "date": "12/24/2018",
    "text": "Took a group to enjoy brunch for my besties birthday.  Small plates, seldom brought out timely. Many went without food, we were starving the whole time. Ended up picking up the tab, no discount, just apologies. We went to another restaurant. Total rip off. Don't waste your money or time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cTwajm4PbGwrz69yrakiBw"
  },
  "Ir3DG2mtIOx3L0914s1ngg": {
    "date": "1/7/2017",
    "text": "Amazing dinning experience!  This is the place to be for any big celebration!  The service is excellent, they know how to treat you right.  The servers are very knowledgeable about every dish on the menu.  The sushi is outstanding...the super crunch roll is to die for!  I was celebrating a birthday, so I got the surf & turf for dinner which was excellent.  The presentation of the food is incredible, I didn't know if I should dive in and eat or just keep taking pictures.  The sea bass is also a great choice with the lobster dumplings.  Lastly, the dessert is phenomenal!  We ordered the white chocolate coconut cake, there are just no words to describe it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Px1n4Hwj2Vg0Vv4-cc_o5A",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Px1n4Hwj2Vg0Vv4-cc_o5A/o.jpg"
      },
      {
        "img_id": "2069eqRkUwY3-tmY19_baA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2069eqRkUwY3-tmY19_baA/o.jpg"
      },
      {
        "img_id": "_glPflyW0rp9k8txKsJURw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_glPflyW0rp9k8txKsJURw/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "KmFfpoF_r7I0z544qFrd-Q": {
    "date": "2/17/2018",
    "text": "Okay.... my husband and I used to ADORE this place. Apparently there is a new chef and the whole menu has turned into this weird asian fusion thing. All the menu items that my husband and I loved are completely gone. We ordered the east coast oysters which they were out of so they gave us the west coast oysters. The oysters were not very good. They were big but chewy and fishy. The only reason I gave this place a second star was because of our server. I believe his name was mark and he was incredibly nice and seemed to be the only server there that had his shit together. You could just tell he was extremely disappointed by the menu change as well as he told us he has worked there for five years. We left disappointed and probably will not return. Bottom line... if you loved this place and their food before I promise you will be disappointed if you return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSBHIF_SUVnw_XMDPi0oHg"
  },
  "VFWBC76KVtT1MgS1Jf0VMQ": {
    "date": "4/3/2018",
    "text": "Upstream was one of my favorite restaurants in Charlotte. I had read about the changes at Upstream, I decided to try it by myself.   As a good food lover, I don't mind to pay more but I do care about well designed and well cooked healthy food. At Easter Sunday buffet, I saw big chunks of iceberg lettuce, devil egg, thick cut irregular shape raw country ham; quite a few side dishes thickened with flours and cream; and very oily asparagus. Spanish paella was so over cooked that the shell fishes were all completely dry.   The traditional Italian lasagna should be multi-layers with juice, tasty filling and cheesy topping. The lasagna I saw was baked in individually in 4\" -5\" shadow dishes with no more than two layers. Top was blacken and It was dry.  Upstream was famous for their fish cooking skills, their salmon use to be so tender and juicy. But yesterday's salmon was completely dry.   It was indeed a big change at Upstream.   The service was good and the waitress were very kind and helpful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EfkETeJbGy_B5A06ezHSIw"
  },
  "tzV6OXUD4WVnj9xff4Uhvw": {
    "date": "10/19/2017",
    "text": "Extremely busy tonight - usually love this place and the service is impeccable - we waited almost a half an hour for appetizer,  going to miss our movie so we said to cancel it and bring us our check -they ended up comping our drinks because the service was slow. This is a classy place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OmNHgq98kJk0mxjXAr8f9w",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OmNHgq98kJk0mxjXAr8f9w/o.jpg"
      }
    ],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "nELAR_JaeTOBxZm2U_d24w": {
    "date": "7/29/2016",
    "text": "Last night at Upstream was amazing amazing AMAZING. This was my first time dining here (after many recommendations), so I decided to invite my foodie mom along with me. The restaurant itself is beautifully decorated and classy, but not too stuffy that you can't laugh and enjoy yourself. Our waitress Corrine was attentive, but not overbearing, and personable. Even when her section got busier as the night when on, she grabbed a floor manager to visit our table if she couldn't to make sure we were not forgotten, and to accommodate us.  To start (we participated in the Queens Feast menu), we ordered the Thai Coconut Soup and Heirloom Tomato and Melon Salad. Both were delicious, but hands down, the soup was out of this world. For our entrees, we both ordered the Mahi Mahi with Sucotash. The fish was cooked to perfection, and whatever cream sauce that they put on top was so delicious, we asked for bread to make sure we got every last drop. And finally, my favorite part of the night: DESSERT! We both ordered the Bittersweet Chocolate Creme Brulee, and this was the most decadent and yummy dessert I've had in a long time dining out. Clean plates X3 for both of us. They also offered wine pairings for the Queens Feast menu at 3 glasses for $15, which is a steal (and they were pretty decent wines/pours at that). *I uploaded pics!*  Overall, the recommendation was right on point with our experience, if not better. The meal was well-paced and spaced, and at no point in time, did we feel rushed. We were greeted with smiles at the hostess stand, and every wait staff member was courteous and pleasant. Corrine was great, and the food was amazing. Upstream has definitely earned 2 more patrons. Cheers to a job well done!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "E6eyks4d74gPXo0jIDEiMw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Cappuccino at the end of the night (love the presentation dishes)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E6eyks4d74gPXo0jIDEiMw/o.jpg"
      },
      {
        "img_id": "GcEXmi_3u6ejwXhLaMQF8w",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Bittersweet Chocolate Creme Brulee",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GcEXmi_3u6ejwXhLaMQF8w/o.jpg"
      },
      {
        "img_id": "RB49hJQ0nugxihLod2dm4Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Mahi Mahi with Corn Succotash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RB49hJQ0nugxihLod2dm4Q/o.jpg"
      }
    ],
    "user_id": "ET3OjKglazr9KvhXCxuwdA"
  },
  "vsZl9zR0WUziadGobWxkwQ": {
    "date": "8/18/2017",
    "text": "I've been wanting to try Upstream for years and finally had the chance to enjoy the Sunday brunch buffet with family.  After being seated, our server breezed by to let us know he would be taking care of us and that he would be back to take our drink orders. We sat for nearly ten minutes before we were able to order drinks and be directed to the buffet.  It's critical to note here that Upstream was in no way busy at this time. I didn't see any other servers, so I'm left to believe that the gentleman taking care of us was the only employee on the floor.   Our drinks arrived well after our first trip to the buffet and only received sporadic refills. We had to flag him down more than once to ask for tapas from the supplemental brunch menu; once we each ordered something, he'd inaccurately relay the order back to us. We had to correct him each time.   From the time we arrived to the time we left nearly 90 minutes later, the buffet was never replenished. The spread appeared picked-over on our first trip and slowly deteriorated from there. The young man behind the carving station looked miserable at his post between the fruit fly speckled pineapple tray and the dried out sushi platter.   Near the end of our meal, brunch service began to wrap up. Employees swarmed the remnants of the buffet and weren't heard from again; when we left the place was like a ghost town.  If I were to try brunch again, I would go at the beginning of service so I knew I would get the full experience. There's a lot of room for improvement here.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0EgbVtQfdNQq3Tapxwl_sw"
  },
  "HBdgmVxYbcJpPCgfgyaoBQ": {
    "date": "8/20/2018",
    "text": "Unhappily surprised. We had a party of 5 (two big birthday celebrations) and had been to Upstream many times over the years, but not recently. Sad to say, this time was not satisfying at all and the restaurant has changed.  The appetizer cart was cute, but he didn't make it all the way around the table so some people weren't offered anything. We had the lobster bisque (called Dim Sum Bisque), which was sweet (like coconut milk with sugar added) and had no lobster flavor.  The miso soup was tasty but had huge undercooked leaves in it that were impossible to eat with a spoon. We had the mussels which were good but then, a nice broth was leftover in the bowl and not a single piece of bread for dipping.  The raw oysters were TINY (like the size of my fingertip) and pretty flavorless. We had the Hamachi appetizer, which was nothing but a fried dorsal fin with the bone detached , and a tiny piece of meat. It was flavored exactly the same as the Saki Seabass entree. The other seabass entree was similar and they were about 4 oz. of fish.  (Everything has the same flavor --coconut, lemongrass, soy, Saki, so if you order one thing, you've tasted it all). My son had the crab risotto (which must have been crab broth risotto, because there was zero crab in it). He left hungry. My daughter liked her salmon, but again, flavored the same as everything else and a tiny portion that even a 13 year old finished in 5 minutes. The halibut was thin and boring.  The sides that came with our entree was a cold vinagrette salad of some sort. We realized they had placed the sushi menu on the table, after we ordered appetizers. Waiter never mentioned it. The wine was good and the service was good, except that he insisted we stay for the \"birthday treat\" (small donuts) and then tried to charge us $16.00 for it. Our meal was over $400 before tip and not one of us really liked our meal. We love good seafood and we love Asian food, but this was not creative in flavors, was too skimpy on portions and way overpriced. Upstream used to be awesome. Sadly, it's off our list now.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwe7jLDEMl7hX-bnIUleOQ"
  },
  "7vTvPfJCcK26RjXALXPhJw": {
    "date": "7/20/2016",
    "text": "Exploring a different part of Charlotte outside of my beloved Uptown, I found myself in this cool little mini- town center and stepped into Upstream. My barber said they had \"bomb\" sushi so I needed to verify this, it was a strong statement.   1st, yes the sushi roll I had was amazing, full of fresh crab and ingredients, very flavorful and had the spicy kick I needed!  Must Try out: Sakura Roll - very filling. Warning: the presentation threw me off, looked like glop, I even looked over at the chef like \"hmm\" but I dived it and that was AMAZEBALLS! The topping WA blue crab, Sriracha sauce and some other yummiess.   2nd Must Try: sweet & sour calamari - they ate more like calamari steaks vs the thin joints we know and love. Very flavorful and great spin on calamari.   3rd, I was full after those 2 items.   Yes, it's a little pricey but guess what great sushi, nice atmosphere, totally nice for a date or friend get together and if you hit the bar b4 7pm there's 1/2 off food specials.   Bartender was pretty cool too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RKQtULCMSf9MHJZreZmsyQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sakura Roll- spicy crab",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RKQtULCMSf9MHJZreZmsyQ/o.jpg"
      },
      {
        "img_id": "kD_OApZ3WkTRfNxoPpkzmg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sweet &amp;amp; sour calamari",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kD_OApZ3WkTRfNxoPpkzmg/o.jpg"
      }
    ],
    "user_id": "XrgcHURVAe_wys_jdweKLw"
  },
  "0wve0nhnNfHvgAtssTbQmA": {
    "date": "2/6/2014",
    "text": "I've been trying to snag a good table at Upstream on RW for the past year! Finally, I nabbed one! There was six in our party and we had a 7:30 reservation. This was the first night we had left our newborn daughter at home with a sitter and the whole ride there I was thinking \"I hope this is worth it!\".... Oh my gosh! It was!!!! I ordered a pineapple mojito and promptly finished it due to the fact that it was absolutely delectable!!! (And had another, of course) the RW was wonderful and extremely varied. I ordered the crab cakes and WOW! Fantastic party of flavor on my palate! Oh! SO! Good! Next was the ahi tuna on this rice cake thing--- um.... Holy smokes! Amazing!!!!! The ponzu sauce just completed it!!!!! Bryan had the flounder which was prepared perfectly over incredible risotto...... Yummy choice as well! Dessert was ok although I should have ordered a third mojito. :) truly, this restaurant is definitely a place to enjoy apps and entrees. Go grab dessert at Pinkberry's afterwards.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VP0jOO0u-z0JIxZ52bQtJw"
  },
  "2ImYxRWHovU1x5iKx0RiEQ": {
    "date": "1/26/2012",
    "text": "Upstream has slipped... both in quality of food and service. Seems to need a 'refresh?' Once the best seafood in Charlotte, now just down right inconsistent and often mediocre. I hope you make it but I think you will need some tweaks to keep things going. Resting on your laurels?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wz6nekYXj4wZ39UKgaVHJA"
  },
  "CWjRxTVAxi7YhIobziJ1ig": {
    "date": "10/24/2008",
    "text": "As far as I can tell, Upstream is the best (nicest) restaurant in Charlotte, and I'm not sure it's close. Most people I've talked to tend to agree. It's just awesome: classy, hip, with great food and service. The one downside? It's super expensive, but it has every right to be, because it's outstanding. Of course, I say all this having gone there for a firm dinner, when everything was free to me. But whatever.   Great bar scene--big bar and cocktail tables for before and after your meal (or if you're there just to hang out). Super call outdoor lounge area for nice weather (definitely check this out if you're there during warmer months). Amazing dining room atmosphere--great art, great ambiance, great table stuff. Just the best.   And the food. Everything I tried was better than the rest. If you're really feeling zesty, go with their signature dish, their sea bass. It's awesome, although super expensive ($38). I gotta say, if you love fish, it's worth it. Indeed, if you're a seafood fan, this is your place. You might not love as much if you're not into seafood, although there are non-fish options should you desire them.   But if you're there, go with the fish. You will NOT be disappointed at all.   Amazing date place if you really want to impress. Or if you're just pretty loaded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bduV2PTTGWKIIcPX6gjPrw"
  },
  "aq2rzawAaozZbk-u3rFPCw": {
    "date": "1/12/2009",
    "text": "We dined there for a nice evening dinner out...  seafood dishes were all tasty and well prepared.  Drink/wine service good as well.  Like the atmosphere all right.  But a restaurant is only as good as its creme brulee - or so said a rather eccentric Brit I worked with some years ago.  Theirs is made off site the prior day.  Bleech.  They're good (on all but the dessert) but they're not as good as their price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "enaSpC9aA7u2wq_KH5SXGA"
  },
  "pcaEuTe9uf5-9rcnxWgd5A": {
    "date": "1/6/2013",
    "text": "Been going here for years - there was a couple of years when I thought it was going downhill, but not anymore!  They just renovated the bar area - I actually liked it before and I like the renovation - it's ...softer I guess - squishy couches vs. all of the hardwood - not sure which I prefer.  Anyways, we always sit at the bar vs. the dining room area, which feels a little too formal for my liking.  The bartenders are super friendly and have good suggestions and the food here is always spectacular, in my mind.  Their sweet and sour calamari is my favorite; the raw tuna tacos were very good, but it's a small portion if you're sharing - only 3 little ones; the Queen City roll was good but has too much rice for me.  Highly recommend the tuna tuna tuna.  The Saki marinated sea bass is expensive but well worth the price.  I could bathe in the broth it comes with.  The brunch is the best I've been too - even our kids love it.     We've started getting takeout here and I was really surprised at how good it was, given takeout usually is half as good as it is in the restaurant.  Big fan!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "3zIjK0tsOJqoLLedQ7XlDg"
  },
  "fmKuzXlBFqlcZdDW4uMpSw": {
    "date": "8/29/2007",
    "text": "Came here to have dessert and coffee one evening after a big night of sushi and wine.  There were five of us and everyone got something different.  Each dessert ran around $10 and the coffee was $6.  The restaurant is very modern and hip - the wait staff seemed pleasant enough.  Looking around I could see this would be a great date place if you were looking to make an impression.  The dessert presentation was uniquely plated.  We all tasted each others desserts - they were all good...creme brulee, chocolate molten lava cake, rhubarb cobbler, ice cream cones (you get two tiny cones 2 inches tall) - and an apple martini.  Very trendy - yet casual.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AKGZ5E6qcH3g36PxK8aCkg"
  },
  "cB7CH1m3xDM90DStZPpv6w": {
    "date": "5/16/2012",
    "text": "Seems like a restaurant that caters to corporate dinners.  Unsurprisingly, I've only been there for business related dinners.  Wait staff was friendly.  Everything I ate was good but the Sea Bass entree was especially good and the tuna appetizer stands out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ClkXyrKWhOvbSdHQidI_0A"
  },
  "YNsVd0xEmkCKx2h-ZFxpEA": {
    "date": "7/14/2012",
    "text": "My boyfriend and I ate here during Restaurant Week a couple months ago and had really high expectations, based on reviews and friends' experiences. However, we were sorely disappointed. As soon as we said we'd be ordering off of the Restaurant Week menu and did not order wine, our server seemed to dismiss us and proceeded to treat us as second-class customers since we would not be ordering more expensive items. The service was extremely slow, and portions were ridiculously small. The quality of the food was mediocre, except for the dessert, which was pretty good. In addition, the ambiance was too loud to be able to have a conversation across the table. Overall, I do not recommend this restaurant and will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vm4G8L3OknQFHwp-1etXkw"
  },
  "oYXVJIBmR0BtDtnhwm90nQ": {
    "date": "9/12/2012",
    "text": "Delicious and unique seafood offerings, I had not been back in a number of years (for no particular reason), but I was quite pleased and will return again sooner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O1KPaX3LiQ2N1s_ON0wF-Q"
  },
  "oOeYWl6uiydFrTrkoA4J2w": {
    "date": "2/4/2012",
    "text": "Disappointing. Overly salted entree as well as very salty side of roasted mushrooms.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rxB773OpU9HLOquZ2Dgf6w"
  },
  "X1p4a2c9JkLDOj0RRs18Nw": {
    "date": "2/19/2014",
    "text": "The sea bass dish is the best! Pricey as heck but delicious! Service is always good as well. I was proposed to here, but that's not why it gets a 4, Upstream truly offers up some good stuff! Always fresh oysters and a very good menu. I don't like getting seated in the overflow room which happened on our last visit here but the bar area and main room are always pleasant to be in. Brunch is also really good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1xbil7KgcFngYsiRVvbHw"
  },
  "xlASkO3aBZ0cNDRTlnZRpA": {
    "date": "2/16/2014",
    "text": "Must try the sea bass. This place is on the pricey side, but you will get a great meal. It is incredible.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B5euhZ_KOtCyeC7jf_InBQ"
  },
  "4ly6wckeXmBSozjLCTeS0A": {
    "date": "7/1/2010",
    "text": "My boyfriend and I decided to go see a movie this past Sunday & wanted to grab a few appetizers before heading that way. We walked over to Upstream to check out the menu and immediately loved their options!  We headed straight for the bar where we were greeted immediately and requested two waters and two menus. About 5 minutes later we were still without waters or menus & our bartender was nowhere to be seen (there were only about 3 or 4 other people sitting at the bar)...so I had to go to the host stand to look for some.  We each ordered the lobster bisque and decided to share the sweet and sour calamari. The lobster bisque came out lukewarm which made it completely unappetizing and had one small piece of lobster in the middle that turned out to be rubbery when we went to eat it!!! We moved on to the calamari which was AMAZING and delicious!!!! Unfortunately, it was a pretty small serving for what we were paying so again we were disappointed but this time with the quantity. While dining our waters actually sat empty for pretty much the entire time the food was in front of us...very frustrating! We finally flagged down a server who was passing by to fill us up, which she did, BUT was not happy about it which she made very obvious with the annoyed long loud sigh she let out as she walked away.  Throughout our meal not a single person stopped to check and see if our food was good or if we wanted to order anything else. We were never spoken to after our order was taken and had to flag someone down to request our bill.  My boyfriend and I eat out ALL the time and usually spend somewhere between $100 - $400 for dinner each time we go out (which is at least once a week). This time we were in and out diners who were excited to test a new place for a potential new date spot...they failed completely! We can forgive soup being lukewarm or even overpaying here and there....BUT not being completely ignored like we had no place dining there because we were only ordering a few quick appetizers and water. Best of luck to other diners, we unfortunately must have come on a bad night...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "qpWqiIH8nJRvoglt18mgww"
  },
  "GJMZzS_YybqzdiAaLwlbOg": {
    "date": "1/24/2011",
    "text": "Wish it had been better when I made my one and only trip.  The menu was smallish and nothing quite appealed to me.  But I know others have enjoyed it very much, maybe I am an exception.  I like the wine suggestion it was top notch.  Staff was efficient and friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xABAy0m9ZAP2QjBvvILGQQ"
  },
  "A0b2So_ulvKAZI5fvjETaA": {
    "date": "3/30/2011",
    "text": "Always excellent, service is outstanding, sushi is better than most in the city, the rosemary steak rivals the best steak houses in the city and the sweet and sour calamari appetizer is amazing. Ask about the boxes and towers if you are dining with friends as thats a great sometimes off the menu option. This is always my first call for seafood and the brunch and Sunday 1/2 price wine special is great. Its not a cheap eat but good value for money and the bar staff are excellent if you want more casual dining",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-v3fJZb7Vfqm-1volmencQ"
  },
  "7j9DagkpMBWcxJwOWhSiag": {
    "date": "9/1/2013",
    "text": "Great service and delicious menu.  Everything we ordered was done perfectly.  Hardest part was what or order with so many tempting recipes.  The mussels and the lobster bisque where phenomenal.  Staff was super friendly and we enjoyed having our waiter review each of the entrees and the ingredient.  Great relaxing evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cuh93k2LLuhiyoVh7AaeFA"
  },
  "dsBLYw8ATKofmMw6wRJCag": {
    "date": "7/20/2010",
    "text": "We had heard great things about this restaurant and were very excited to go.  What a disappointment.  The service was sooo slow.  I think we got water about 10 minutes after being seated. It must have taken another 10-15 minutes for the waiter to show up, and when he did, it was as if we were bothering him.  We ordered two seafood entrees, two beers, and an order of sushi.  The taste was average and the portions small.  When we ordered the sushi, we laughed at the amount we were given. For the price we were expecting more.  The atmosphere is fine - nothing special. After about 1 1/2 hours, we left $65 lighter - and still hungry. So we headed over to Dean and Deluca...",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYMswS6c9RON29oda91Xaw"
  },
  "6oHQ2dAwB4DHQCoe57bn3w": {
    "date": "7/8/2011",
    "text": "I went there for my birthday with my wife and my mother. I wanted somewhere that you could get really good seafood. Upstream was it. The calamari they served us was some of the best Ive ever had. it was different, but completely amazing. The beer list is also very impressive. I would recommend the White Rascal if you like beer.  The entree I had was the seared ahi tuna. It is best served rare, and it comes with tempura fried green beans. The green beans have a honey balsamic coating on them as well. Let me tell you... it was one of the best things Ive eaten in my entire life, and hands down the best vegetable. I could have eating a bucket full of them. The dessert was the Carolina Blueberry tart. I inhaled it, it was amazing. All in all it was a perfect birthday meal. The service is impeccable and the establishment itself is beautiful, gorgeous. I highly recommend this restaurant to anyone in charlotte that is looking for upscale seafood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D3WCBNi5nFA_n_vYvr5XTw"
  },
  "P4N228f6KvX9wssCkcmNSg": {
    "date": "2/7/2010",
    "text": "Came here for restaurant week last July when I was visiting a friend in Charlotte. We were able to get a table outside and had a view of the shopping area. I started off with the cream of crab soup which was okay, and got the sea bass as an entree. My friend and I both thought are meals were okay, but nothing special. Service began as fine, but as the meal progressed became a little absent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UWzAJf1CxoE8UE6i4wmR2A"
  },
  "dXLPRyPgusBbytL732j4NA": {
    "date": "4/19/2011",
    "text": "My husband and I LOVE the atmosphere and the sushi at Upstream!  We go there on date nights, and it is perfect.  We have had a lot of sushi at a lot of different places, but no where that we have been to can top Upstream.  One of our favorites is the surf and turf roll which has steak in it as well.  All of their rolls that we have tried are exceptional...we have never had a bad roll!  In fact, the sushi is so good, that we haven't tried anything else off of their menu.  The only reason I didn't give it 5 stars (and I would have given it a 4 1/2 if that had been an option!!) is that their wine menu is overpriced.  There is only one Zen by the glass and it is $11!!  The cheapest wine they have by the glass is $7.  So, I never get more than one glass of wine, but it is worth it to taste that yummy sushi!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTqssbXB-OiGVpYj8jLdag"
  },
  "lRVFGnuObqfk1GhlVu7F5Q": {
    "date": "3/10/2015",
    "text": "This past weekend my husband &  decided to give Upstream a try. We were not disappointed. We arrived early because we were unsure of parking and anticipated possible traffic issues. Traveling there led to an unanticipated road detour but we still arrived early. Parking was no issue. This was a new location for us and it was very nice, clean and well lit once t got dark. There is a movie theater there too so we figured this is a great spot for dining & taking in a movie. It was a little chilly but we noticed plenty of out door seating. We were seated for dinner shortly after arriving and we had a wonderful waiter (Greg). His opinion was spot on with the recommendations for everything from cocktails to entree. We started out with the Spicy Shrimp Lettuce Wraps. Be prepared to create your own wrap-this was fun. My husband chose to eat the shrimp and pineapple/mango/Napa cabbage separately. The flavors were great. My husband had the Surf & Turf. He enjoyed every bit of his meal. His lobster was cooked perfectly and the claw meat was removed for easy eating. We eat out quite a bit with steaks being my husband's choice for his meal. He ranked his American Wagyu Flank Steak as 2nd best ever. His Surf & Turf had equality great accompaniments. I got the Sake Marinated Wild Sea Bass...MmmMmm Good. In looking at the meal I thought it would never fill me up. Oh boy was I wrong. This dinner  was delectable. Not a heavy meal but filling. I was able to have desert afterwards. Everything on the menu looked outstanding. I am not a sushi person so I would not try it but the reviews are good. Oh I didn't mention the cocktails. These were real drinks. It is so disappointing to get a cocktail that is supposed to have alcohol but gets watered down-this was not the case. I would love to return for their brunch because this would be more of a sampling of the chef's creations. The bill was not the highest we've ever spent but it was up there. I read some of the other reviews and I'd say that this place is upscale so be prepared to dine well & pay well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7uSp0cMPXm3R7TmTg-nAXw"
  },
  "oO_FjEj4iCq8GfYpAQjKDw": {
    "date": "9/19/2013",
    "text": "Upstream is one of my favorite restaurants in Charlotte. It is nice to get away from all the cookie-cutter chains and go somewhere different like Upstream with amazing, fresh food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bfvs0BdhljfHqMFRPKWjZQ"
  },
  "UgxT4mStBKiJkZu4ytGNyQ": {
    "date": "2/13/2013",
    "text": "I've been here several times, the food is fantastic, but the service is often terrible. They tend to be pretty inattentive and have at times been rude. They do have probably the best brunch in Charlotte, which is just about all I go there for anymore - it's $25 for a full buffet with a wide range of dishes.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oj4eWeeMjcR1hkAnckzgYw"
  },
  "pHaOCCFhWMDQ80U1u6Afhw": {
    "date": "9/8/2015",
    "text": "This is always a go-to spot when we visit Charlotte. If you're lucky you'll catch it on a night when Greg Crawford is working the bar. He has a great attitude and makes his customers feel so welcome. Great sushi and cocktails and brunch, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "axvzlXKaWShKETjxoFE7aA"
  },
  "JbAzXjAl5OpYon6vb77oNg": {
    "date": "4/1/2014",
    "text": "We had the signature sea bass dish which was amazing! The service was lacking but we would be willing to give this place another try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MM2m4Rcp3IBt0yeNcfAdgA"
  },
  "8nSOfynzxhGM1MmCbPar0A": {
    "date": "7/22/2013",
    "text": "Huge fan! Lots of room to sit, comfortable environment and the food is incredible. When I went last night, we sat at the bar for a little while and ordered sliders, muscles and sushi-- Being a pescatarian, I ate and loved the muscles and sushi. I've also been with my family another time where we have gotten shrimp and fried oysters as an appetizer and those were delicious as well. For dinner I enjoyed the salmon- it was grilled perfectly and everyone around the table enjoyed their meals as well. This is a definte thumbs up place and perfect for date night, birthdays, family dinners or when you just want a nice but comfortable place to have dinner!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY60vzf0u0HasO7R_-b_uw"
  },
  "c-nwWKUkXjjxJQmloi_OqA": {
    "date": "11/24/2012",
    "text": "I've been to Upstream many times.  I've had some excellent meals there, with some perfectly prepared seafoods.  I love their mussel appetizer  which is served in a cast iron pot and is enough to share 2 or even 4 ways as appetizers, but is also plenty for a main course if you like.   Service can be mediocre and slow at times, as it was at a recent lunch there.  That won't stop me from returning, but it would be nice if the service was equal to the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zYX5XlT2Kn-NxbKa9mK-0g"
  },
  "j3VZRr0JJ4gUBtULTUSjHQ": {
    "date": "6/4/2015",
    "text": "I had the pleasure of hosting a corporate event here. The venue, the food, and the service were excellent. I look forward to hosting more events and dining here in the future. Best restaurant in Charlotte by far!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgZwuu4z0GTW4D8k1krneQ"
  },
  "um54f6wGkWw1xswOIfde-w": {
    "date": "11/8/2014",
    "text": "I came to Charlotte on a business trip and checked out yelp and picked this restaurant.  I had a reservation for 7:30 but was not seated till 8:05.  I ordered the lobster and it was not fresh.  The server was fantastic but not the lady in the front.  Horrible customer service and just gave me this attitude.  Whatever, this is the last time I am coming to this place even on my next trip.  The 3 star is for the appetizer and the server's excellent service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOIfV0Tx8Q4xE5_upnGWPQ"
  },
  "NudNcsjYYgJHbvyy3j1Fdg": {
    "date": "4/4/2010",
    "text": "Go on Half Priced Bottle night! I went one night with a friend and had a bottle of Elyse \"Korte Ranch\" Zin for $35!!! I wanted to take one home, but didnt have the guts. Sushi is always enjoyable, even though it is no longer being prepared at the sushi bar. The Executive Chef, Scott Wallen is super talented and has a great staff in the kitchen, pressing out dishes that just work! Wine list is good, although, at one time a much more \"Seafood Friendly\" one that has now given way to the big names. Service is always good, but if you really want to have a good time, sit in the bar area! If I could give Upstream a 4.5, I would!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "OxotAxEJpj627-RJev70-g"
  },
  "8DCY2X9xVfLf_bVI90Cf1Q": {
    "date": "8/12/2009",
    "text": "While in Charlotte for business we ventured to upstream for dinner.   My company was awkward, at best. Two gentlemen, the closest 30 years my senior who are business associates. But the guys wanted fish so I went along for the ride.   First impression - I liked the outdoor seating area.. it looked like a fun place to grab apps and wine with friends, but that wasn't my fate on this particular night.   Instead, we were seated in a booth, in the back of the restaurant. Yay.  On to the food: We shared an assortment of sushi and sashimi off of the sushi menu. I'm a sushi snob so everything was pretty mediocre. But to my associates, apparently it was great considering they didn't say two words during this course.   On to our mains - as a west coaster, generally 4pm is not my dinnertime so I went light: the Gazpacho was slightly spicy, flavorful and the dollop of creme freche was the perfect topper. Unfortunately my second course, a melon salad with some sort of duck bacon didn't make the grade. Boring, blech, nothing impressive. The dishes my fellow diners ate looked good, but I really can't comment any further.   Even by LA standards, this meal seemed pretty pricey and not particularly outstanding.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "_CfYTgDSnjV7Y0z1acFrcg"
  },
  "9LRk_k_O9BVMiw2FViypfQ": {
    "date": "7/27/2012",
    "text": "To be fair, I generally stay as far away from swanky Southpark as possible except for an occasional trip to Earthfare. However restaurant week and the meat-eater's friend being a chef at Upstream led us to visit this week. We showed up around 7:30 during restaurant week, expecting a bit of a wait. The hostess was very pleasant and offered seating outside on the patio right away or suggested a drink in the bar while we waited. We chose the bar.   This seems to be more of an older 50+ crowd with a few exceptions. Mostly business casual attire but I didn't feel out of place in dressed up jeans. The decor is traditional Southpark - dark woods and colors.   The bartender greeted us promptly, presented the wine list and gave us a few minutes to decide. They have an extensive (and pricey) wine list and a handful of specialty cocktails and martinis. Drinks were served and that was the extent of our bartender interaction. He seemed to get in the weeds a bit with all the server orders coming in. Not a big issue as we didn't really need anything else but could be a problem if we were trying to order at the bar.    Our wait was as promised - approximately thirty minutes. The dining room is a bit smaller than I anticipated but nicely laid out. You have a glimpse at the open kitchen but not enough to gawk during your whole meal and enough privacy at the tables and booths that you don't hear your neighbors' conversations. Our server greeted us, got our new drink order and came back to discuss the special. I must admit, I enjoyed freaking him out by dropping the \"I'm a vegan\" on him. I doubt this is a normal request at Upstream and I wouldn't dream of showing up without advance warning (which we'd done via the friend).  He consulted with the kitchen and came back looking much more relaxed and surprised with how easy it would be to accommodate me. I had the Shaved Athena Melon salad sans ham, tomato risotto sans cheese and a lovely sorbet sampler with warmed peaches. The sorbet, while really good, isn't made in house. Meat-eater had the Smoked Cod Cake and Lobster cakes, Snake River Ranch Wagyu Flank Steak and French Macaroons. He's still talking about the cod and lobster cakes and how good they were.  I really enjoyed all my courses. The salad did need a little \"oomph\" to make up for the lack of salty ham but overall very happy with our meals.   I was impressed with the service. Our plates were removed quickly, our server was present in the dining room but not in the way, courses were served promptly and glasses kept full.   Upstream isn't my normal type of preferred dining or cuisine but I appreciate any place that has excellent service and chefs that know their food and are willing to make accommodations in a gracious manner for special diets.  I know Upstream is part of the Harper's Group but I thought it had enough personality to not be classified \"just another corporate place\".",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CvNa88mgfe-PAWRNLG_jcA"
  },
  "7RL_sx1r_Rs4PiJS4GKSfA": {
    "date": "3/1/2009",
    "text": "I've been to Upstream three times, spanning a period of around five years.  The first meal we had there was excellent -- service and food were unquestionably outstanding.  Around a year later, we returned for another dinner and this time it was underwhelming.  The food was OK, but when you're spending $200+ for two people you expect an exceptional experience.  Around a month ago, on the advice of a friend, I went for Sunday brunch.  It wasn't the first time I had heard about the great brunch there, so I was anticipating something special.  We arrived around 12:30 and ordered a couple of mimosas.  What they served us was orange juice with a splash of champagne.  We began with a selection of small plates.  I was most excited about the crabcake benedict, but I needn't have been.  Aside from being ridiculously small (it was truly more of an amuse bouche) -- the dish was bereft of flavor.  French toast was similarly disappointing.  So off to the buffet.  We should have checked its condition before we sat down.  It looked like a war zone.  Mid range hotel chains do a much better job of maintaining their buffets better than Upstream.  What was once a smoked salmon fillet was now a ravaged pile of flesh.  There were bits of food and trash around almost every station.  They were out of most of the premium items:  the salmon, crab legs and crab claws and sushi (which I probably wouldn't have eaten from a buffet anyway, but nevertheless...)  I ended up with an omelet -- it seemed safe, although expensive at $25.  All in all a big disappointment.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [],
    "user_id": "ScUX8L5It9BA3BRYrWNXsw"
  },
  "g_0d5jsQZTG9xYmKDXbJlw": {
    "date": "1/4/2013",
    "text": "Upstream has gone downhill, fast. While the bar ambience and feel is still awesome, the sushi in particular was extremely lacking. Spicy Tuna rolls were not fresh and smelled like fish. California rolls lacked flavor and were quite bland.   Service was also not particularly good and there was a very creepy manager who put us off.   It is a shame because Upstream has been a staple of the South Park area for years, but their sushi quality is completely lacking these days. I cannot comment on the main courses as we did not have any.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ms_IgheMoEchpIZ4_0N5ZQ"
  },
  "kTdcLMdky_HVZhTkRCO3mg": {
    "date": "1/4/2013",
    "text": "Love the high quality tuna and fresh oysters.  The staff is super accommodating, friendly, and efficient without being over-bearing.  Clean and classy.  One of the best restaurants in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4MRTkq-7jS70dw-D4bu4sw"
  },
  "4Dt6yzl878Jd0wsaATa0fQ": {
    "date": "12/16/2012",
    "text": "Their Sunday brunch is awesome. Never leave unsatisfied or hungry. They had the freshest oysters today - along with elegant other dishes that begged going back for more. We never are disappointed here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lK4vCj4uIXBiQHvLTxrD8g"
  },
  "ORprH9ADJawyFp-HGo2s3g": {
    "date": "9/17/2008",
    "text": "Back when I lived in Charlotte....  Let me start by saying I am not a big seafood fan. I enjoy it but not a must have on my list of foods. I think it has to do with that type of food. Done well it is fantastic and not it is pathetic.   Upstream does a great job with the seafood. It has a bit of a modern feel to the place and you can feel a bit underdressed if you show up in some casual clothing for dinner but lunch is fine for it. I had the NC Trout which was very tasty whenever I would go there. The Lobster Bisque is awesome. The portions about right and prices on par for a place of this class. It is a good place to people watch. Once caught Chriss Issak there when he was in town for a concert.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zDNZtoOftaS3NFrEP1FNfA"
  },
  "WmLekB5odh-3H1oZVLX1rw": {
    "date": "10/21/2014",
    "text": "Upstream is probably thought of as one of the best restaurants in Charlotte.  I am from Philadelphia where there are excellent restaurants with iron chefs so my viewpoint may be a bit skewed.   The food was good but not great or amazing.  Every dish (except the house salad) was over salted.  My husband had the tuna and I had the seabass. They were both very good but as I said before not great.  We would go there again but for sushi/raw items not necessarily the cooked menu items.  The salad was was the highlight for me (house salad) and the crab bisque was pretty tasty too.   Overall the service was very good but slow.  Our waiter was one of the most knowledgeable wait staff we have encountered since moving from PA.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9qnO6VAjN99CoxtQrKd4Q"
  },
  "GFTcBZzCsyMwu9mC8v6-pg": {
    "date": "7/1/2012",
    "text": "Went there last Sunday night for a special occasion. It wasn't very busy and we were seated right away. The waitress was excellent and knew the menu very well.  The manager also stopped by a couple times to check on us.  I had the noodle bowl with scallops, shrimp, etc. it was very good.  My wife and daughter shared the rib eye which was big enough for 2.  That was good too. Other members of the group had fish and everyone enjoyed their meals. Don't have anything negative to say about the place. For me it is a special occasion place but it is not as expensive as a high end steak house   It was my second time there and I will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TS_u3wKiD0rMLanZqVbcUg"
  },
  "xQcMVv1FXv7FSntUGd0XYg": {
    "date": "5/29/2014",
    "text": "Thought Upstream was a delight. Our waitress was excellent. She was very knowledgeable about the menu and her timing was perfect. She was very attentive but did not hover. The food was fresh and delicious. The crab cakes are full of real crab, not bread or fillers. The sea bass is a must try as is the sushi. Nice atmosphere. We went on a weeknight. Almost all the tables were full but the restaurant wasn't noisy.  My only disappointment was that the entree portions were a tad small for the men in our party so maybe I should deduct 1/2 star. I won't just because everything else was perfection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sn4wP8OChuZYCrzmdrZyfg"
  },
  "JzkNFsJXpuqwngul79SHXA": {
    "date": "2/21/2018",
    "text": "Upstream has a new menu, which was disappointing since I finally made it out there just to eat the grilled octopus and sea bass entree to find neither on the new menu. However everything we tried was phenomenal and our waitress was amazing and I can't wait to go back!   The new menu is cheaper and smaller portions than the old menu (think entrees in the 20s vs 30s) and has a variety of small plates. I had my first sample of Hamachi and fell in love! We also ordered \"the rock\" which is steak that you cook at your table on, you guessed it, a hot rock. The rock was a fun experience but the steak was difficult to pry off so I doubt we would order it again. The real star of the whole night was the sea bass appetizer that came steamed in a bag with an outstanding sauce. I couldn't begin to tell you what was in the sauce but I can say it took a bit of willpower not to lick the remainder up after the fish was finished.   My main was the steamed bronzini with baby bok choy. It was served with a ponzu sauce and the thinnest sliced scallion on top. I liked it but wasn't as wowed as I was with the appetizers. However it was steamed fish so there's a naturally built in excitement level. My fiance ordered the halibut that I was considering and it was served with some outstanding curried mashed potato. The curried mashed potato was a unique and creamy flavor that we will work to recreate immediately.   Our service was some of the best we've had in Charlotte. Our waitress knew the new menu confidentially and answered all our questions without looking at any notes. My wine glass never quite got to empty and neither did my water. She was around a bit in the beginning as we made choices but stayed away (other than refills) to let us enjoy the dinner. All of our dishes came out quickly and piping hot from the kitchen.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "byFgEkFsldtrXFHygn3WDw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/byFgEkFsldtrXFHygn3WDw/o.jpg"
      },
      {
        "img_id": "8ZRRC3nYNcBO6f0j0eeZpA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8ZRRC3nYNcBO6f0j0eeZpA/o.jpg"
      },
      {
        "img_id": "SSu73kK4aflvXfk6BKHxeg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sea bass - may not be beautiful but I promise it is amazing.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SSu73kK4aflvXfk6BKHxeg/o.jpg"
      }
    ],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "EQ1NWnsS5wIt_kur8BHbFA": {
    "date": "4/25/2019",
    "text": "Late post: went for Easter brunch and it was delicious! This is our 2nd year there and will definitely be back for a third year! Unlimited oysters, unlimited peel and eat shrimp...Prime Rib, Roasted lamb, broccoli and cheese casserole...Asian style chicken wings and drummettes. It was pretty awesome! Oh if you love sweets...you won't be disappointed. I wish they did this brunch more than just Easter! I enjoy Upstream and especially their upscale brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RqPx8X8u7h-9rSYKwOOuLw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RqPx8X8u7h-9rSYKwOOuLw/o.jpg"
      },
      {
        "img_id": "rOuAJMMKFz5vJDJfJbfZrg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Easter brunch at Upstream...everything was great!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rOuAJMMKFz5vJDJfJbfZrg/o.jpg"
      },
      {
        "img_id": "_Ht3PAdxoWI6HZqYFanNIQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_Ht3PAdxoWI6HZqYFanNIQ/o.jpg"
      }
    ],
    "user_id": "KXRFMjgNBoNyl0d4aP6t1w"
  },
  "XkeXHG_5zIun3UlXtGaxMA": {
    "date": "2/25/2018",
    "text": "We tried this place randomly for lunch yesterday. I had heard that it was an excellent seafood place, but I have to admit, I was slightly disappointed.   Upon being seated, we were informed of the new lunch menu...well, it's an extremely restrictive menu. It's basically all sushi at this point, so if you don't like sushi, you're screwed. (I do love sushi, fortunately, but my wife was recovering from a sore throat and would have appreciated different options.)   My edamame was completely unsalted, and since this is one of those \"I know better than you do\" places, there wasn't salt on the table. I find it super annoying to have to ask for basic condiments like salt and pepper. It's a bit condescending.   I had the Snap, Crackle, and Pop roll, which was quite good. The unagi (eel) nigiri was decent. I've honestly had better unagi, though.   Service was great--our waiter was nice and attentive.   I'd like to try this place again for dinner, but if I'm looking for sushi in the CLT, there are spots I enjoy more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YVA0hGQv8Kto8SLe72Zlzw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YVA0hGQv8Kto8SLe72Zlzw/o.jpg"
      }
    ],
    "user_id": "TLkPHRJX9yCJhy1kQXTe5Q"
  },
  "_-Z0lyGNvlF3XrsZZf5QaA": {
    "date": "3/22/2019",
    "text": "The sea bass was good but the portion was very small. The calamari was mediocre and not very filling.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B-jjXKh0-PhjnN6RxFk3ew",
        "caption": "Photo of Upstream - Charlotte, NC, United States. $13 Calamari",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B-jjXKh0-PhjnN6RxFk3ew/o.jpg"
      },
      {
        "img_id": "Bo1KeQH1d6MlArBfSS6kBA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. $39 Sea bass",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Bo1KeQH1d6MlArBfSS6kBA/o.jpg"
      }
    ],
    "user_id": "YOsWzc1kTJqVm7b3HMQg2A"
  },
  "lEld0_9r1geCQNV18uqM4A": {
    "date": "1/12/2019",
    "text": "Sushi was sub par. Service was lacking. We asked for things several times and they forgot or came out 10 minutes later to say it would be a while.  No bread until it was requested, didnt fill the water glasses, ask for coffee or dessert.   We did sit at the bar are with a birthday party but the restaurant was not busy at all. We asked for dessert for the bday girl, took long and came out cold.  Sorry didn't have a better experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RL3EmvzEzsyU7DNdAl70eA"
  },
  "Tu8oB3fuzYANKmMGl15WEQ": {
    "date": "1/26/2019",
    "text": "I'm not one to post, but today's experience caught me off guard.   - Food was ok.  - Drinks were good. - Waitress Ashley was great. - Hostess, didn't get her name, was good.  - Andy, had me livid. Profiler? Did we not meet your expectations as guest? Did we need a haircut? A Suit?  Andy I think helps supervise the local or something, not so much a fan. Why? Let me tell you.   - Jovanni and I out and about, going to the movies close by, but wanted to eat something nice. - I was outside looking at the menu.  - Jovanni enters to get a table. (Jovanni is Guatemalan/Mex, darker skin tone wearing a windbreaker like top) - Host asked him for a name and how many to get us queue, there was no one ahead of him. - ANDY, a mgr or sup, came from behind host and said reservations only to him. - Jovanni came out and said they did not have availability. - Out of frustration, I call (FROM OUTSIDE) to check availability for a table. - Host was cool/good energy on the phone and said we close at ten and have availability now.   Stumped!!! I know, I was too.   - I go in, have Jovanni wait outside. - Table is available, yes no wait.  - Go get Jovanni, Andy's eyes wide open. - We go to table.  Jovanni did not want to go back, I made him. He was so uncomfortable. I felt bad after for him. There was a few stares it felt like from Andy. Jovanni is still talking about it and is wondering how we got different response to availability.  Just creating awareness!!!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "AndAkN9cGRB5bfaW06hg6A"
  },
  "_BSf6ragW8j2QdCf1Bhz2Q": {
    "date": "1/26/2018",
    "text": "Enjoyed a very fine dining experience with my dear friend during restaurant week. Our waiter, Greg, was very hospitable and helped persuade appetizer decision from soup to salad. First, we had two kinds of warm bread with marinated olive oil.  My meal started with the Tega Hills salad which was both crisp (lettuce), sweet (pecans), and creamy (brie). Then I enjoyed the salmon with peanuts, arugula, and pureed parsnips. The surprisingly odd pairing peanuts and parsnips was unexpectedly delicious and creamy with sweet undertones. The salmon was crisy on the outside and tender on the inside! Lastly, I had the chocolate ganache with cherries and coconut gelato. I loved the gelato, but for me the ganache was too rich.  My friend chose the crab cake with pickled veggies and absolutely loved it. Next, she had filet mignon with mashed potatoes and shaved, grilled brussel sprouts. I tried the brussels and they were very tasty: flavorful exterior and creamy, melt in your mouth interior. Lastly, she had the apple pie crisp with caramel whisky gelato. I especially like the cinnamon flavor of the crisp, the gelato was a strong flavor but was a nice balance for the crisp which tasted more like cake than pie.  The ambience and decor was very nice. Upstream is a nice upscale restaurant great for date night, business dinner or family milestone celebrations. Restaurant Week with friends is a great way to try the restaurant without completely blowing your budget or breaking the bank. Our meal including tip was almost $90, however during a regular day it very well could have exceeded $150 as many entrees are easily $35 alone.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "nx5lo_ra89XJWZNPnWKG4Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Artwork",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nx5lo_ra89XJWZNPnWKG4Q/o.jpg"
      },
      {
        "img_id": "QphXKVJX93Ag5-kfMa8QbQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Apple crisp with caramel whiskey gelato",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QphXKVJX93Ag5-kfMa8QbQ/o.jpg"
      },
      {
        "img_id": "l2kV8e01nWp7UIlZAIUKGw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Filet mignon, mashed taters &amp;amp; grilled brussels",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l2kV8e01nWp7UIlZAIUKGw/o.jpg"
      }
    ],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "-0N_rdgmqm1B1FKdQmVrmQ": {
    "date": "9/18/2018",
    "text": "A very disappointing dinner experience. This used to be a very good seafood restaurant for years. No more. The service is good. Attentive but the food was over priced and not that tasty. The menu changed over with the new CPCC Charlotte chef Gene Cato a few months ago. The calamari appetizer used to be fantastic and now tastes like a fast food place. Lots of breading. Butter lettuce salad was so sad looking. The halibut I had was served with leeks I think but which were very tough.  True it's a Tuesday night so not much business but I feel like it's in a spiral. Would not recommend and don't plan to return any time soon. Even bonefish is better ... sorry Tom Sasser I enjoy your restaurants usually but not this time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qs2D-Txa6WX5izewrcm47Q"
  },
  "h3VES2FahDq23yQ8wgq9Sw": {
    "date": "7/29/2018",
    "text": "As always an awesome time out with my Bookclub sisters. We were short in numbers but we had a blast. Good food, convo, and  fellowship. Had a nice corner table. We had 2 to order the salmon,  two ordered the filet and my bestie ordered the lobster. Lobster was a little over cooked per my bestie but everyone loved the crab croquettes. Calamari and the slaw that came with it was great. We participated in the restaurant week deal, wonderful Jennifer our waitress let 4 of us substitute our desserts for two appetizers. Most had the calamari and crab croquettes. Everything was great, love the location relaxed atmosphere and fast service. Reservations was at 6. Seated 3 of us a little early. Prompt service, no waiting, and complimentary valet no worries on parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q36ZuYp890w6cRuNshvBWw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q36ZuYp890w6cRuNshvBWw/o.jpg"
      },
      {
        "img_id": "sdaCgW230b_DrwC_gbY6vw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sdaCgW230b_DrwC_gbY6vw/o.jpg"
      },
      {
        "img_id": "vOXufNedErtXD5uVSx8aIQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vOXufNedErtXD5uVSx8aIQ/o.jpg"
      }
    ],
    "user_id": "KtpmSnpGkfLuocvhrgv02w"
  },
  "UZVwPo_s_rFdJDKzPOOy3g": {
    "date": "1/15/2019",
    "text": "Still a great place for lunch and their coffee cups now work for left handed folks. I had their steak over rice with a coddled egg on top. I  do not know how they seasoned it but it was spicy but so spicy that you lost the flavor; excellent. The have some of the best french fries but if you order a sandwhich skip the fries and get the brssel sprout side. it is great. I do not know what they do to the olive oil that is served with the bread but it is the best. It taste like you imagine a fresh olive might taste like picked off of the tree. While there i saw that they served weekday breakfast 7 - 10 AM so this morning I went back to try them out. At 8:45 AM this morning. doors open and after two loud \"hello\" and no one to be seen, I left and went to renaissance in small shops at South Park where I had the best French pastries in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cziRQQ6D7ogpL1gQWEbqRw"
  },
  "AxIG0T7QTXkgbOwKcAOKdQ": {
    "date": "7/22/2018",
    "text": "Love.  Love the brunch.  Super relaxed atmosphere. Really nice people.    The menu has unique items on it for the foodie in is all, and tried-and-True-all-time favorites.  The bacon is really yummy as are the pancakes.   Five stars.  Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1cOYXNv_1VEFebfk5fQYQ"
  },
  "Sbfml25j3UZphdkfkOpYoQ": {
    "date": "5/12/2019",
    "text": "Lack of service with reservation as well. Food was not enjoyable or fresh as described for an upscale restraunt expected more than was given will definitely consider another place for the next meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZOU4x_ON9mxP0-CHXptgkw"
  },
  "4tl89vttAcQdRKJbz3ctIA": {
    "date": "1/25/2019",
    "text": "My boyfriend and I went here during restaurant week. Needed to make reservations, only slot was 5:30. Hostesses were nice, seated in five minutes. The servers were dressed in a white chef attire. \"90's attire as they call it\". You can see the whole kitchen and chefs cooking through glass panel. More upscale seafood restrains this; nice  and elegant. Had a big menu for restaurant week; great seafood for the price of $35. Included the appetizer, main course and dessert. We ordered the calamari and roasted oysters and were definitely great. Enjoyed the sake marinated sea bass a lot. The tuna was good too; served with book Choy and crispy rice! For dessert we had tiramisu with banana rum and Creme brulee! Definitely will be back for tiramisu. Our server was great with helping us decide what to get on the menu. She was very attentive even when it started to get reallllyyy busy. I loved our experience here and definitely will come back. Wouldn't have came here if it wasn't for restaurant week or special events because it's a bit pricey. But DEFINITELY worth the money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JjqRgvjHGK15wlKiqGX7jA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JjqRgvjHGK15wlKiqGX7jA/o.jpg"
      },
      {
        "img_id": "j4logacF-LewOZBxP5vZww",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/j4logacF-LewOZBxP5vZww/o.jpg"
      },
      {
        "img_id": "Dow2pTE-WUrK0eltW4fBlQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Dow2pTE-WUrK0eltW4fBlQ/o.jpg"
      }
    ],
    "user_id": "48PXTiNRMlIlELvGII3R6g"
  },
  "mdwf6z5lxaG5YBHYE8IxHw": {
    "date": "1/18/2019",
    "text": "Chose this restaurant for Queens Feast restaurant week. Most restaurants use a limited menu for this event but Upstream uses their regular menu and adjusts the prices accordingly.  We had a reservation but arrived early and were seated immediately. The service staff was excellent, very professional, very knowledgeable, very helpful with questions about the menu. The food was prompt, we had appetizers, main course, and desserts. Everything was excellent! I can't remember the last time that I had meal that was this delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4ohyeXJkBJPlxcTlRYI23g"
  },
  "RcEt8WGxLPUXRg1ObaqQQg": {
    "date": "4/21/2019",
    "text": "Amazing restaurant with fantastic service! Made our special celebration dinner a wonderful experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sp0JG5BL0YZrY0B942tXtw"
  },
  "j5tV7TYH9Wb9Ds0FYPLg0Q": {
    "date": "7/24/2017",
    "text": "This place never disappoints! I went here last night for restaurant week and it was excellent. They use their regular menu and offer and of the item for 3 courses at $35. There are some items that have an upcharge but I very much enjoyed the menu that was a set price. For $35, I had the sweet corn bisque, the 1lb lobster and the peach and blueberry crumble with ice cream. We also enjoyed the $15 wine pairing with each course. I cannot say enough about the soup and lobster. One pound was definitely enough with the salad and potatoes. The lobster was so luxurious that it felt like I was eating cake for dinner. Our waitress was delightful and did a great job pairing the appropriate wine with each course. We had an excellent time and I would recommend this for restaurant week every time!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPIRvsT4QPjb5qCrUt7v4g",
        "caption": "Photo of Upstream - Charlotte, NC, United States. 1lb lobster",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OPIRvsT4QPjb5qCrUt7v4g/o.jpg"
      }
    ],
    "user_id": "UZ-jh-H84fdCt4R2Xugz0Q"
  },
  "mBsQ9IWAv1O0ucMvAkEzdg": {
    "date": "7/23/2018",
    "text": "I went with a group of friends for restaurant week.  The service was great (especially for restaurant week). They brought us bread with infused olive oil which was great. They were offering half off Lamarca prosecco making it $17 (a little overpriced for grocery store prosecco), but we still got it.  For Queens fest you got to pick an appetizer, an entree, and a dessert.  I got sweet and sour calamari and it was pretty good, it would have tasted a lot better if the breading was crispier, it was kind of mushy, but the flavoring was great and I have never had sweet and sour calamari before so it was a really cool concept.  Next I got my entree, I got the filet which came with a piece of grilled romaine.  This meal was pretty terrible. The filet tasted like Salisbury steak, it tasted like they just took the filet out of a can, I know they didn't but the flavor was terrible, the others at the table agreed who got the filet.  The piece of Romaine I hope was just for decoration because it was awful. (I have had a great grilled romaine Caesar salad in the past so this wasn't a new thing for me).  I got the chocolate indulgence for dessert and it was good, it was pretty rich, so a couple people who got it in our group couldn't finish it.  It had Oreo crust which I couldn't tell since it wasn't crispy like your typical Oreo crust desserts, but that wasn't a concern, it was still pretty good.  The food was decent here but the steak was a big let down, hopefully it's just because of restaurant week.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rgE7iUN2ibB56GNcgxesTg"
  },
  "lwaz7ZQSHs-q3LUPimw6KA": {
    "date": "5/14/2018",
    "text": "Excellent menu!  I have taken several clients there, Germans included and they have all been very impressed with the menu and the atmosphere of the restaurant.  The seafood is excellent and they always have creative plating techniques.  It's gourmet so there is the small portions but I have never left hungry.  Gotta be in the QC's top 10!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5dDf398fbR1IB858ajhGg"
  },
  "faGdWB4jgEvXTzYuF11NjA": {
    "date": "3/15/2019",
    "text": "\"Sweet and Sour Calamari & Sake Marinated Seabass\". I was a bit disappointed with the food. I understand the Asian twist on the calamari, but the sauce buries the natural flavor. The sauce was not sweet and more bitter than sour.  A dip or drizzle would have been a better choice.  The seabass broth was too salty. The server poured the entire serving into the bowl, so it was difficult to control the broth.  The seabass was very firm and the lobster dumplings less than spectacular.  Overall I was not impressed, especially considering the price.  I may have better luck with the sushi.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giihVb_BzcPZOWpjYVek6A"
  },
  "u5uBaQ7-sjSSXnixQf79Ig": {
    "date": "8/10/2018",
    "text": "Wow, what happened? I've been enjoying this restaurant since it opened. Went in tonight and was not impressed. The menu has been cut back and many of my favorites are gone.  I was told there is a new chef. I think it's better to say there is a new restaurant and I'm not impressed. Very sad to have to write this review.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqlEWyzVjgu9Thx0fcgbBA"
  },
  "qCG4Q6DWc6f2dfsa_ti3dQ": {
    "date": "6/1/2009",
    "text": "Upstream is conveniently located in Phillips Place. I went there on a late Sunday afternoon. I had a nice time and didn't break the bank.   They have great happy hour from 4-7pm each day (although you have to sit in the bar). Select sushi rolls and appetizers are half price and on Sunday they have half price glasses of wine. I think that they have a different drink special each day.  The service was very good and friendly! We sat for quite a while visiting, sipping on wine, and eating and we never felt rushed or that we were taking up too much space and time. The sushi was good (although I didn't care for their version of spicy tuna roll) and they had a nice happy hour variety. I really enjoyed the atmosphere. It's a good place for a relaxing happy hour!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "fG8AOb3Cn0L6YEgOYYmnRw": {
    "date": "6/15/2009",
    "text": "I went here for lunch time.  Restaurant Feel - Romantic. The ceiling is pretty intriguing.   Service - Timely, the waitress is very nice and respectful.   Food Quality - I ordered 2 oysters. One from the East and One from the West. The one from the west coast wasn't that great =T. The one from the east was very sweet, as fresh seafood should be. I tried the bisque, which was pretty tasty. I also had the fish and chips, which was pretty nice. Crunchy, flaky batter, delicious fish. Very nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxSEFw5AlHqNCbueWkRxKQ"
  },
  "cs1tJiLSRVsrKkyWunvelQ": {
    "date": "5/22/2015",
    "text": "This place is a total disappointment. Not close to being worthy of the prices they charge both food and drink and to top it off, the waitress was constantly rushing us. Will not return.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YcavLAfSkOvqNMf4VskO5Q"
  },
  "ypkPlkwdIK-nbrRv3PN-nQ": {
    "date": "4/30/2013",
    "text": "This place by far has the best and freshest seafood in town. I love their Sunday Brunch, so much to choose from!  The manager Ken is extremely nice and makes you feel like a vip. I saw him handle a difficult customer with grace and ease.  They have great patio seating on warmer days with great cocktails and appetizers.  They recently remodeled the bar area and it looks beautiful.  They even offer cooking classes! One of my favorites in Charlotte by far.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2OLYtOMhPyGvieyluzgtQA"
  },
  "c36KMuuItJ42ICdDxFPvBw": {
    "date": "2/18/2011",
    "text": "By far the best oysters I ever had!!! We drove across town from Lake Norman to Phillips Place searching for the best oysters in town and we found it here. I had a friend from NYC flying in for the holidays. We did a take out of 4 dozen blue point oysters for 3 people and it was worth the drive across town just to get them. Every single oysters were nicely packed on ice for the 40 minutes ride home. It was the most delicate and careful driving with the freshest oysters in the back seats. What a trip! We were so happy we finally made it home to try the best oysters available in town. The next time I would love to dine in and try your other seafood entrees.   The manager and the hostesses were very nice and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vdY1pN9w8VHso8qhzSoJWQ"
  },
  "sEeFkjAUKVjq8Y8LUL10yQ": {
    "date": "8/23/2014",
    "text": "It was ok. Parts were good. The sea bass was ok the crab cakes were very good.   I still prefer the bone fish grill. They had great service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ygVwB5N5cp2N93WdcIondA"
  },
  "3TKeO4jZi7DLnLVtRelpXA": {
    "date": "8/4/2013",
    "text": "Gave the restaurant a second shot - equally disappointed.  Bar service was slow, 45 minutes to get an appetizer from an inattentive waitress.  Once at our table, we watched our salads walk around the restaurant twice before the server found our table.  Waiter served the entrees and walked away, never checked to see how our meal was.  While tasty, the portions are small.  Unfortunately, the best part of this restaurant is the valet service.  Don't frustrate yourself, dine elsewhere with friends.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2um7BetWG3N7p3cSnXRTNw"
  },
  "RRr15mIXS7cmKHs2ahWwgw": {
    "date": "2/21/2016",
    "text": "Perfect for special occasions! A really nice place for fine dining and having a celebration with your love one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5QU93DVWP7PpTnx0HXunYw"
  },
  "xej52MFzlifOE7r_SEjMZQ": {
    "date": "3/9/2013",
    "text": "I went to Upstream on a Friday evening immediately after work (5:30'ish). The decor is excellent and romantic. I decided to sit at the bar and I have to say that the wait staff was so very pleasant and attentive. After my guest arrived we were given the open to sit at a table. The staff was very familiar with the wine selection and menu. I had the all natural chicken breast which was by far the best chicken breast I have ever had. The only small setback was that I'm a 30 years old energetic, fun loving female, and most of the patronages were 50+ and a bit snooty ( I say this do to the way some were addressing the wait staff...). Perhaps the time of day that I went played a role in the type of crowd I was amongst. However, I would go again, since the food was excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tR_X6ShczirC9DujVls-mA"
  },
  "kZwCfYVFfh9vVjniOWVQlg": {
    "date": "9/9/2008",
    "text": "This is definitely one of the pricier restaurants I've ever been to in Charlotte, but that's not saying much. The food is definitely pretty good, with some odd menu items, but they really shocked me with how much flavor they had.  The ambiance of the place wasn't too much to my liking, with so many different plates, silverware options, etc...but I'm sure if you're used to this than it's no different than any pricey restaurant. Heck, the waiter even poured the wine for my girlfriend & had her try it before buying (which is apparently customary)...  It is in a nice area of Charlotte, close enough to the hustle & bustle but just far enough away. The food, while not top notch, is pretty good & it sure is a nice place to impress a date, but make sure you bring your credit card.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4WX4RCq9gOKXetBtFTIupw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Outside waiting area",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4WX4RCq9gOKXetBtFTIupw/o.jpg"
      },
      {
        "img_id": "QWenwmqp89xzhFM7WFxWWg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QWenwmqp89xzhFM7WFxWWg/o.jpg"
      }
    ],
    "user_id": "kjYbPkrbgPMVUAjungJ4Aw"
  },
  "bqrsokbmQ5DeHTqykxWMrA": {
    "date": "2/21/2013",
    "text": "I enjoyed a three course Valentine's Weekend dinner with my boyfriend and I loved it! Lobster bisque, salmon and dessert were all wonderful. The service is lovely. When someone walks by and simply straightens a fork on your table for you-that tells me that someone is paying attention to me. I would love to go here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ox6D8HTHgcv5qMmddBL9cQ"
  },
  "YYPzT0_i5sH9_id5CaVPBQ": {
    "date": "5/17/2011",
    "text": "Upstream is a great location for fresh seafood. I have been to this restaurant during summer restaurant week and they had this amazing salmon on a cedar plank with a peach chutney to talk about for days. I have also enjoyed their fresh sushi. Great place to relax and have a glass of wine out on their patio too. I've never been disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k24kSTpZHUdEd-QYXLy3fQ"
  },
  "z--ptoSRreC4gAuhetzVUA": {
    "date": "10/20/2010",
    "text": "Upstream is one of 3 main restaurants in Phillips Place (PF Chang's & The Palm are the other two). Known for it's seafood and brunch, I've been here several times for dinner or some quick bites at the bar. For me, a solid 3 stars. I've never tried the brunch, but heard it's very good. Same ownership group as Zink & Mimosa Grill.  For dinner...I've had the tuna and the scallops. Both were good, and the portions were not too far off from their $25-$30 entree price. Both times I've been there for dinner, we've sat on the patio which is nice and a great view the end of Phillips place near the movie theater. There are some lounge chairs outside near the front as well, which seem a little off placed for me, but it's a nice tough. They have valet parking too.   I've been here more for a quick stop for sushi and oysters with a beer at the bar. There are a few TV's around, so fellas, if the lady(ies) are shopping, go here for a beer and some apps...you'll be able to catch the game in the bar area. Sushi was average to me, but the oysters were good and when I think Upstream, I think of a good oyster spot for me in the South Park area.   I've never had a problem with service and would recommend Upstream to try. For me, I need to still try the brunch!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "xPKwlkRLRlGZyRUrOUYMvA": {
    "date": "4/25/2011",
    "text": "I've been so pleased when I've eaten here.  They food is prepared so well and seems fresh.  I love the waitstaff attire.  It really makes me feel like I have my own personal chef coming to the table.  The servers we have had are always professional & courteous & they & the kitchen are most gracious in altering to our tastes.  They even allowed me to order a favorite dinner entree that wasn't on the lunch menu.  I normally don't care for open kitchens, but even being seated at the nearest table to the kitchen it is unobstrusive!  I usually like booth seating, but really the center tables are the best ones & especially if you want to see and be seen.  The decor is very relaxing which I enjoy.  I also enjoy that the diners that come in for the most part seem to enjoy maintaining the intimate feel of the restaurant and are not overly loud (or don't feel the need to be since the noise level of the restaurant itself is fairly calm)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "etW1iw_8sNOMfjUk7Po2Ig",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/etW1iw_8sNOMfjUk7Po2Ig/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "MvJxqpCYpI6QxoG4ahicYg": {
    "date": "8/14/2013",
    "text": "The food as fresh as it can get.  The black bass was caught that morning!   The chef prepares the most beautiful presentation and uses the most unique spices to make for a great experience.  The  decor didn't quite make sense to me and they could use someone to put together a cohesive theme for the place.  Reguardless, I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "47IumUjFX5GoTAoDP_mE9g"
  },
  "PI8wE5PzvlQJTx1EktrCqA": {
    "date": "10/12/2013",
    "text": "My first time eating here and my first time eating out since having to switch to a dairy and gluten free diet. Our waiter (I think his name was Matt) was extremely sweet and helpful in fact we actually got to the restaurant before they opened and they still sat us! The chefs were accommodating to my diet and happy to do so. I will be back and recommend it to everyone! I had the rock shrimp pad Thai and it was fantastic and a giant portion. My mother had the shrimp burger special and said it was perfect. Bravo what a great place with perfectly polite service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNpP1M-6YklG-YuFBQ9nBg"
  },
  "2HQWtSaQa3KWEYjSjAQ-1g": {
    "date": "8/17/2011",
    "text": "Great Restaurant.  They have the best calamari in town!     Excellent service and great atmosphere.  Try the bar menu from 5-7pm where you can sample the best of everything!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iI32pnnlTzKIIY_afqb8eg"
  },
  "KHphUUvVd53Yvv9eH6a7UA": {
    "date": "10/15/2012",
    "text": "Upstream is a really nice place to dine. When my wife and I moved to Charlotte last year this is one of the first restaurants that we found that satisfied our seafood craving. A year later and this is by far the BEST seafood that we've found. We've been here 4 or 5 times in the past year. The seafood, sushi and steak (and the mussels) were all great. But we really really love the Costa Rican Chocolate dessert. It's excellent. The waitstaff is terrific. Very informative, attentive and friendly. It's a nice place for a date. It also has a really nice outdoor seating area to hang out and have a few drinks, appetizers or desserts. The only thing that I probably wish would change is the bar. It's quite spacious and seems to have a nice selection of beer and wine. I just didn't really enjoy the atmosphere of it. It seemed to be more appealing to an older crowd. But ironically they're in the middle of renovating the bar area quite a bit, so I might have to update this review again in a few months.   I would definitely recommend Upstream for a nice meal, just don't forget the dessert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RsmcsC_A1shrZPt3l0DzGQ"
  },
  "-WQ7srm1YqjxNxMgRG_GQA": {
    "date": "9/18/2015",
    "text": "Coming from Boston, we have sort of high expectations for seafood. My husband ordered Sea Bass and I, the Grouper, and it was perfectly cooked and delicious. Our server was extremely friendly and gave us his honest feedback of not only his favorite dishes, but of almost every single thing on the menu. They also have a very nice wine selection (we are big fans of Burgundy whites). We left with very happy bellies and had a wonderful time! It does however, seem to be a bit overpriced.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qun74RYvTxrFxc1H9QTxXA"
  },
  "G-4G7yKq1NLLi-UcXQW9tA": {
    "date": "4/18/2012",
    "text": "Came here for lunch on Saturday.  This is a review of the Grilled Angus Burger only.  Hot d*mn, you must order this delicious piece of meat.  \"A burger at an upscale seafood restaurant?\" you might ask? So did I.  I felt like I had just found the pot of gold at the end of the rainbow.  It comes with smoked gouda, fried egg (cooked perfectly), and with the crunchiest, most delicious fries I have ever eaten.   Get it, get it, get it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Oz1Tz4LUlLw_UAgEkUiCvw"
  },
  "OjtcVWaTgrAwmIHjYlyX7g": {
    "date": "7/9/2019",
    "text": "Have no idea why the reviews are not stellar. My wife, son, and daughter in law ate dinner there a month ago, and the food, atmosphere and service were all some of the best we've ever had. And we're globe-travelling gourmands who've had some of the best this world has to offer, at any price. We had Thanksgiving dinner there last year, and a couple of years prior. Same all times.  It's not inexpensive, but it's an experience worth every penny.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4aIHDpyd04LU_CZdpvZE7Q"
  },
  "OUOvuupiXWjz86rS9ANaKQ": {
    "date": "7/21/2019",
    "text": "We checked out Upstream for Restaurant Week and had an okay experience. We were sat at the table where everyone comes and goes from the kitchen while the restaurant was maybe 1/2 full - felt like worst seat in the house with just two of us having both our chairs bumped or kicked as staff flew by.   Cocktails were excellent - Old Fashioned and the watermelon margarita.  My girlfriend loved her seafood dishes. Even for restaurant week, she was given a heaping pile of mussels that she raved over. She also liked the salmon, but wasn't thrilled with being told that the temperature she should order left the salmon practically raw. I ordered the wagyu flank steak which also couldn't be ordered above mid-rare (tried twice to order it medium or medium rare). Even at the temp they suggested, the meat lacked any flavor. This was made up for by the onions and potatoes which were delicious.  Desserts were also incredible! Cheesecake and Cherry Crisp.  Overall, good restaurant week spot if you're into seafood. Don't go if you're not. Would have been really disappointed to have walked out of there with a $150+ tab.   Dining experience: 3.5/10 Drinks: 8/10 Food: 6/10",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fstryjR-geqAzyiqXgl3Bg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Mussels app",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fstryjR-geqAzyiqXgl3Bg/o.jpg"
      },
      {
        "img_id": "RbJjRCYl5-JOgCMvuidTfg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Old fashioned &amp;amp; watermelon margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RbJjRCYl5-JOgCMvuidTfg/o.jpg"
      },
      {
        "img_id": "EZGSc9M1TKM5f-cGpLjViA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EZGSc9M1TKM5f-cGpLjViA/o.jpg"
      }
    ],
    "user_id": "iSqJbG1E2qrkBeBl-IF3jg"
  },
  "PAVZpst5sSULUYCtkgbU2Q": {
    "date": "6/22/2019",
    "text": "I have been wanting to try their bunch since I read about it on Charlotte Agenda. I wanted to like it so badly. The menu looked great.   The tasting menu changed since I first saw it, but a lot of the same things were on it still, just a few things that I wanted to try were gone. The price also increased to $30 per person.   We tried most of the menu which included: Sweet and Sour Calamari, Korean Fried Chicken Lettuce Wraps, Virginia Country Ham Bao Buns, Roasted Meatballs, Walnut Pumpkin Pancakes, Curried Deviled Eggs, Country Ham and Pimiento Cheese Biscuit, Pork Belly Benedict, Upstream Slider, and the Roast of the Day.  The best of the food was just ok, but some of it was really bad. The one thing I really liked were the Bao buns, but when we got a second order of them they were not cooked and my husband's tasted like bleach. My favorite thing was the coffee cake they gave you to start the meal.   You can order two plates each at a time. The tasting menu is all you can eat. The portions are small so you can try a lot.   The presentation was good, the service was good. The restaurant was almost empty.   As I said, I really wanted to love it, it just wasn't good. I can't recommend coming here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qzHK3E3cAc6bS5KxLqe9wQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qzHK3E3cAc6bS5KxLqe9wQ/o.jpg"
      },
      {
        "img_id": "agd7Y9vu3pvggHIYap-A2g",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Korean fried chicken lettuce wraps",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/agd7Y9vu3pvggHIYap-A2g/o.jpg"
      },
      {
        "img_id": "L2hvsH-eFiOpvdsBKvtlfg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Roasted Meatballs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L2hvsH-eFiOpvdsBKvtlfg/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "Y4xhqIFfn3MKOoicPOX9ig": {
    "date": "7/23/2019",
    "text": "So tonight's got was  just terrible, I love this place as you guys know, but the creamer was a month old and curdled, we ordered the edamame twice and both times it came out slimy both orders did not try for 3rd time, apparently per the internet slimy edamame is bad edamame. Service by Kaitlyn and Bar by Amber and David is always on point, wife was not pleased you took away her sauvignon blanc from New Zealand. So the last couple of times we have been in has been issue filled, but I will refuse to go below 3 for the moment but attention to detail has dropped off.  I honestly like this place very much. The food and drink has just been off the last 3 or 4 visits.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jpsQ3d2MSXXUEGOHEf0BcA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Yes!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jpsQ3d2MSXXUEGOHEf0BcA/o.jpg"
      },
      {
        "img_id": "JyVvJ7iXFmarAkGgRqaXgg",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JyVvJ7iXFmarAkGgRqaXgg/o.jpg"
      }
    ],
    "user_id": "4o0KkpAkyO6r0NHXmobTeQ"
  },
  "N45SlzLqsjAJJgnZev0jHg": {
    "date": "5/22/2019",
    "text": "I came here for a work dinner so we had a set menu. The service was very good and it's a nice space.   We ordered some east and west coast oysters- very good!  The other apps we had were ok-- crab cakes, kimchi cucumbers, and Korean fried lettuce wraps.  The Bibb salad was disappointing--no flavor.   The sirloin with leek and potato puree was good. I wish the scoop of puree was bigger!  The lemon mousse torte lacked the lemony brightness I was expecting but was plated nicely.   I had a bite of the chocolate rum cheesecake and liked it better than the lemon dessert.   There is free valet parking or a big parking lot sort of behind the restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GV6qJTa0_Ob1_xZPp_nSsQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Oysters!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GV6qJTa0_Ob1_xZPp_nSsQ/o.jpg"
      },
      {
        "img_id": "fOuLhi8khnrJNlNdUjnKqg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Bibb salad (pretty bland)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fOuLhi8khnrJNlNdUjnKqg/o.jpg"
      },
      {
        "img_id": "DUv0gYBPUT3wgfWMkvEnGQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Korean lettuce wraps",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DUv0gYBPUT3wgfWMkvEnGQ/o.jpg"
      }
    ],
    "user_id": "M3IsWEs1ufGslXRae8VV-Q"
  },
  "KW0iNFBNG8Wl9vKYLZnp5Q": {
    "date": "7/22/2019",
    "text": "I had one of my best dining experiences in Charlotte at Upstream.... the food was great. The atmosphere was inviting. Not to mention the wait staff was second to none. As you can see I throughly enjoyed myself. I had the Pecan crusted trout which was great. The Sushi was delicious and Creme Brulee was perfect. Gotta go again.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ERsrhIbgTwzao_rTQnKtpg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Pecan crusted Trout",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ERsrhIbgTwzao_rTQnKtpg/o.jpg"
      },
      {
        "img_id": "wkOraVDvIkUJpxmMpVeGWw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sushi",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wkOraVDvIkUJpxmMpVeGWw/o.jpg"
      }
    ],
    "user_id": "9qeTIHKevxlLBNs2ak4K-Q"
  },
  "h64yRXC4kh2Yn2JXSzmi8w": {
    "date": "6/22/2019",
    "text": "Although the service is acceptable and the presentation is good, I cannot say the same about the food. My wife and I tried 12 different options from their brunch menu. Most of it was mediocre. The rest -- well -- I considered spitting out of my mouth.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "A5yRxTfi3rePP1Ou7LsAIQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Ham and cheese biscuit",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A5yRxTfi3rePP1Ou7LsAIQ/o.jpg"
      },
      {
        "img_id": "tytlyezsmIDTTTaR0Jovxg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Meatballs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tytlyezsmIDTTTaR0Jovxg/o.jpg"
      },
      {
        "img_id": "fY3RmucEiJ-WU17qeJJLKg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Country ham bao buns",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fY3RmucEiJ-WU17qeJJLKg/o.jpg"
      }
    ],
    "user_id": "pBeNjksmGLPlBTaujOqiLQ"
  },
  "H8_kpBTsHVVLwSoELSoOHA": {
    "date": "7/22/2019",
    "text": "My friends took me here for my early bday celebration. I love the atmosphere & food was great. I came back twice for brunch. The first time was excellent and however my second visit after a year or so. They change their brunch menu. No more buffet style...we order basically on the menu and each person allow to order 2 items on the menu to share. Less food to waste I guess.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E6rNQHXVLOuj7FGGmzgMgQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Brunch",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/E6rNQHXVLOuj7FGGmzgMgQ/o.jpg"
      }
    ],
    "user_id": "ebz_nEluxaZ8hEzueLQu6Q"
  },
  "ZG-pCTevk1bHsg9HkDy7DQ": {
    "date": "6/2/2019",
    "text": "My wife an I stopped in for drinks before our movie. It was early afternoon so we had the place basically to ourselves. I played it say and ordered an IPA and my wife ordered a mimosa. I went to the bathroom and when I returned, my wife had the we are leaving right after this.  She explained to me that the bartender poured her already mixed mimosa out of a plastic Tupperware. Was I surprised? A little. We were the only two at the bar. Where's the harm in popping a bottle and pouring a fresh drink? But it would seem it was easier to give us what was left from brunch.  Needless to say we won't bother returning. Small details can make or break your outing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlDD_u9gt9-RTviBWHAy4A"
  },
  "F8SEZUD0f8pQ0LWiwKQPUA": {
    "date": "3/26/2019",
    "text": "Went for lunch for the half price sushi rolls. They were all pretty good. The ones that apply all have a fish next to them. My only problem was our first experience wasn't so hot. When we came in it was quiet and we didn't see anyone at the host stand. We waited around until finally the owner sat us. Our waiter was the bartender and he was really nice but they apparently had two big parties and he had to do that and bartend as well. I don't know if they were understaffed but the service was unfortunately slow and we felt very neglected. It wasn't his fault.  One of our rolls didn't state it had wasabi on it and we were told that the chef didn't usually do that. We didn't get to order much for waiting 2 hours for service and our food to come out. Our last roll also still had some Saran Wrap on it from when they rolled it.  The owner was pretty nice though and understanding when we told him about our experience and apologized.  I'm hoping to come back and give this place another try despite all the negative reviews on the service and wait and despite our experience. Because it was a nice restaurant and the food wasn't bad at all it was just not the right day.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FyikYazQbNoOumDooOQyyA"
  },
  "qBL7-Hge9YCeIKIR_0S4OA": {
    "date": "11/9/2018",
    "text": "I came here to visit a friend for the weekend. We wanted a brunch spot to eat at so we came here. It was completely dead due to the panthers game, so we were seated immediately in the dining room. The website was confusing about the time the brunch ended. We weren't sure if it was over at 2 or 3. I think on Saturdays it is over later than Sunday.   We came there when brunch was ending and they still let us take advantage of brunch. This is what made us drive to this particular restaurant. They had an unlimited brunch tasting menu for $26 with $3 mimosas. They had your typical brunch items and some interesting additions. It ranged from sushi to the roast of the day. The items are small like tapas and they let you order two things at a time.   Because the restaurant was empty we got our items pretty quickly. I ate most of the items on the menu except for the ones that had pork in them, and things I did not want to experiment with like quail eggs.   My favorite was:  avocado salmon toast- had a great mixture of avocado and salmon with a nice flavor.   kabocha pancake- was pretty sweet and flavorful. It is a Japanese style pancake and It reminded me of a sweet potato pancake.   Curried deviled eggs- looked like regular deviled egg but you can def taste the seasoning.   The mini burger- It was a nice size and flavor  Everything on the menu is worth trying and I challenge you to try the whole menu without getting full! The price is great as well even with two mimosas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k6UcPpU8JC8uKwwJIYO2xQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Tasting menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k6UcPpU8JC8uKwwJIYO2xQ/o.jpg"
      },
      {
        "img_id": "mJGktjv0SOxWyE0A6fGo4Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Biscuit and gravy",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mJGktjv0SOxWyE0A6fGo4Q/o.jpg"
      },
      {
        "img_id": "Rh7ZfZGPF3sTavCdbdVQ6g",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Curried deviled eggs",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rh7ZfZGPF3sTavCdbdVQ6g/o.jpg"
      }
    ],
    "user_id": "Hqh3__TgG8hNSGnnmuEYhQ"
  },
  "Mg_GEZEqRrywmEU3OT4AsQ": {
    "date": "9/13/2018",
    "text": "This was a random dinner pick during a business trip and we lucked out!!   Sea-themed interior, but in a tasteful, sophisticated way - not kitschy at all. Dimly lit with tons of ambiance. I almost wished I wasn't with a co-worker!   Service was impeccable. When our food arrived, I wasn't allow to touch it until my coworker could take a proper picture - beautiful plating! To this day, I've never had better salmon or pearl pasta and that can only be attributed to a chef who is a True artist.   This restaurant is a must whenever I'm in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N6VZz-e5mjuHPjYKWaPyMQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Scottish salmon · pearl pasta",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N6VZz-e5mjuHPjYKWaPyMQ/o.jpg"
      }
    ],
    "user_id": "wYMvVO7C5TZdZZnGz47o4A"
  },
  "2fmcCZWx1wpXXXNyhO76LA": {
    "date": "3/4/2019",
    "text": "Really liked this place! The service was amazing and food was pretty good! Our waiter was awesome. There was a chef that came around with small dishes made from local products. I thought this was a unique concept. It allowed us the opportunity to ask specific questions about the menu. He was awesome as well. The watermelon and cantaloupe dish was tasty. I ordered the Bronzino with a glass of wine. The Bronzino was good but nothing to rave about. I give the restaurant a 4 only because the quality of the food didn't reflect the menu prices are a",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cyko1jYGZfnW8-UVUXLtcQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cyko1jYGZfnW8-UVUXLtcQ/o.jpg"
      },
      {
        "img_id": "fbm0h0pja_8uDrBTrkIXbw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/fbm0h0pja_8uDrBTrkIXbw/o.jpg"
      }
    ],
    "user_id": "zJ7eGvoFB6Ss5Yig43jM2Q"
  },
  "WndtlZCgZCWnrPsWjyTV3A": {
    "date": "7/25/2018",
    "text": "Sad to say I didn't enjoy my experience at Upstream   I attended for Restaurant Week and found it it be overrated.   When we walked in, the hostess was very unfriendly and had a bit of an attitude. We had a group of 11 (which we made the reservation on Opentable without any issue) and she acted like we were an inconvenience.   The food was average. Interesting crab croquets appetizer. It was my first time ever trying this dish so I have nothing to compare it to. The breading in the outside was good and the inside was almost soup.   The salmon was served with caviar on top (which I don't believe is mentioned on the menu). The piece I got was thin and unimpressive. No real flavor. Very average. It came with a small dollup of mashed cauliflower.   Our server forgot to serve me Brussels sprouts that I had ordered. It took about 8 minutes to get those out. I was shocked that she still charged me for her mistake.   Dessert was sooooo unimpressive. Chocolate cake was half a centimeter thick. Oreo was nonexistent.   Can't say I'll be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IhPx3NifjoWEvY8-0oiq6Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Crab croquettes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IhPx3NifjoWEvY8-0oiq6Q/o.jpg"
      },
      {
        "img_id": "8d32hEv67u1v4cjqU1E6aQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Tiny slice of chocolate cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8d32hEv67u1v4cjqU1E6aQ/o.jpg"
      },
      {
        "img_id": "KT5rgXdus7YUCUhoRFIiiQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KT5rgXdus7YUCUhoRFIiiQ/o.jpg"
      }
    ],
    "user_id": "146udnwO4772RFXD1i5ruQ"
  },
  "Vu74n1rQezSEbqTxs1F1bw": {
    "date": "7/29/2019",
    "text": "Outstanding experience during Queen's Feast, despite above normal crowds. Excellent service, innovative dishes, and they did a great job at the bar too. We will definite be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f6IjEzG-lXqZrR9dWHvxQQ"
  },
  "sKpDEsMLIx29K5xoMjzNPw": {
    "date": "7/25/2018",
    "text": "This review is for the Queen's feast restaurant week. They have several options for main menu other than typical chicken or salmon dish but there is $15 supplement charge. For appetizers, you have many options to choose. We ordered mussels and crab croquette which they both have on their regular menu. The mussels in a coconut broth and lemon grass was good. The crab croquette with green curry puree is so great, melting in your mouth.   For the main dishes, we ordered wagyu ribeye and sake marinated sea bass(both $15 supplement charged). Wagyu steak was tender and juicy(of course it is wagyu beef! Regular price was $47)but the steak was so small for my standard. Main dishes don't come with any side dishes, just vegetables for garnishing. So it will be good to order side dishes(yes,supplement charges) if you don't want to feel hungry even after main course. The main dish portions are not that big.  The sea bass with lobster dumplings was amazing! The server told us that is has been steady seller for a while. Sea bass in shiso mirin broth was melting in the mouth. It was the best dish!   For dessert, coffee ice cream was rich with cinnamon taste. The profiterole with passion fruit mousse was okay. Expected more puffy and soft pastry but it was rather crispy on the top.  If I go back, it will be for the crab croquette and sea bass!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Hpq2jrIf5n0YUNfL1BpoKg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Wagyu ribeye",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Hpq2jrIf5n0YUNfL1BpoKg/o.jpg"
      },
      {
        "img_id": "E6-Qc1EqG5Ppfz1Ke0xbeA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Crab croquette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/E6-Qc1EqG5Ppfz1Ke0xbeA/o.jpg"
      },
      {
        "img_id": "bKNOHBnDrL652bYO8qySCA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sake marinated sea bass",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bKNOHBnDrL652bYO8qySCA/o.jpg"
      }
    ],
    "user_id": "sbbB6Y4yIZIInvt0LFYYew"
  },
  "cHdLvvchXrbyp0I8jWL6kQ": {
    "date": "1/22/2019",
    "text": "So I got lucky on my visit to Charlotte as it's Restaurant Week which is foodie heaven. From the abundance of restaurants presented my co-worker and I decided on Upstream, as neither of us had been and the options were great. Let's start with how robust the restaurant week menu is, too many great options but we have to make choices. I started with the mussels which were in a lemon garlic broth that was very flavorful with a portion size to match...I then had the yellow fin tuna and let's take a moment of silence for the butternut squash rice cake, first I've never heard of such wonderful goodness and second how do I recreate it. Think rice made into a patty and gently fried for a slight crunch, i'm getting goosebumps just thinking about it and the tuna was seasoned yumily with the edges being done just right...I finished with the apple crisp that's topped with frangelico oh wow is all I have - my entire meal from top to bottom was absolutely delicious and I'll definitely be back if in the area.   My coworker had the lettuce wraps, whole lobster and tiramisu and he stated it all was phenomenal- I can't have my food looking at me so personally I'm passing on the whole lobster but for restaurant week prices I see why it's a hit...oh if you opt for the tiramisu it's not traditional it's lady fingers that are soaked in some type of orange liqueur- I didn't personally care for the taste but I think my coworker licked the plate...thanks Charlotte for a great meal at a great price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2kONG52VCNiVC_3F9OOlbw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Mint tea",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2kONG52VCNiVC_3F9OOlbw/o.jpg"
      },
      {
        "img_id": "U8aDgzubePDSTGOuk6t4EA",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U8aDgzubePDSTGOuk6t4EA/o.jpg"
      },
      {
        "img_id": "C3ytHgIj6cAr13IX8rXktw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Mussels",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/C3ytHgIj6cAr13IX8rXktw/o.jpg"
      }
    ],
    "user_id": "zziWJMYwDjyVi7kJmgRUvg"
  },
  "ZGeP8L8FAljGfzXhNIu5tQ": {
    "date": "6/25/2019",
    "text": "We visited for Father's Day brunch.. it wasn't too crowded but there was a steady crowd. Their brunch is buffet style. This is one of the slept on brunch spots in Charlotte. The food was amazing they had everything from an omelette station, sushi to oysters. Not to mention the servers were friendly as well. I'll be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9EuCgY09kt_y1lqjscQzrw"
  },
  "oK-5dCAahWed3Sk_K_PDCA": {
    "date": "12/9/2018",
    "text": "I ate here on a quiet Thursday evening in the bar area while in town on business. The vibe was nice and the hostess and my waiter were great! I was seated very quickly in a large window booth. I loved everything I consumed this evening! I ordered a specialty Prosecco drink...my own concoction and the bartender delivered!! I devoured my small plate of the Angry King Crab....y'all it was sooo good. The dish was Super rich and the presentation very cool the shell is smoked so that adds another layer of flavor. I ate two orders...smh... For my entree I had the Sake marinated wild Sea bass with Lobster dumplings and shiitakes in a Mirin broth...it was divine. It was light yet full of umami and everything balanced. Unfortunately there was no room left for dessert, I left here with a full belly and a smile on my face! I definitely will be returning.  Little extras... my only negative even though it was slow my waiter left me to my own devices a little too long, I wasn't in a rush but my meal was pretty spaced out. I couldn't be mad though he was so helpful. I dropped my diamond earring, and he literally took the booth apart for me to retrieve it! Now talk about service lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Fn3z9EcmMd32C8mPIzp0Gg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Crab gratin",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fn3z9EcmMd32C8mPIzp0Gg/o.jpg"
      },
      {
        "img_id": "6FMEUTclhjqL-EtJeceSDA",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Sea Bass",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6FMEUTclhjqL-EtJeceSDA/o.jpg"
      }
    ],
    "user_id": "aQsT1E1V2Pp4TktHoXSbew"
  },
  "n3Gy5IBK2Xlg8nXNGCQi-w": {
    "date": "6/29/2019",
    "text": "I come here quite often and the food is wonderful. My server/bartender David was exceptional in service and explained the menu in great detail. I ordered West Coast Oysters, Sashimi and Sushi. The service here is always consistent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hCmUe-_L7bCchhG-eQG8-A"
  },
  "DoKdis9_QN45DClmCuDSHw": {
    "date": "6/12/2016",
    "text": "Very fresh seafood. The best crab cakes I've had! Not overdone with saucey mixtures,  just pure crab meat. I wasn't impressed with their signature bass entree. It was a bit too soupy for me compared to others I've had.  Desserts were ok. I think overall,  the appetizers were the best.  My colleagues loved the lobster. Maybe I'll try that next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hMmJabLkzUuHSfqb7iBNcw"
  },
  "6JS2OQyTpNKbjc8AV6RLKg": {
    "date": "3/5/2015",
    "text": "Visited Upstream with my wife for our date night and we loved it.  I had the Saki marinated bass and my wife had the Tuna steak as entrees. We had the mussels and the lettuce wraps for appetizers.  Everything was fantastic and world class!  The service was great and Kristopher and Mike made us feel like we were the only ones there. Thanks for the fantastic experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEFKbKd0pXTLH1vwVS_mbQ"
  },
  "z9Csef9FPvTwn4ckBdpoLQ": {
    "date": "2/18/2013",
    "text": "I would've given them 4 stars but for a fine dining restaurant they overlooked a lot of details.   It was a snowy Saturday and we had a late reservation. Many had canceled due to the weather, so with a half-empty restaurant I expected superb service. We were seated at a booth with a rough first impression. There was debris in the seat, a big stain on the tablecloth and one of our water glasses was dirty. Then the waiter forgot the lemon I asked for and one of the other staff hit a member of our party's nice jacket onto the floor and didn't bother to apologize or pick it up.  If this were a diner, none of this would have phased me --- but we were about to drop $200 on a meal and expected a little more of a high caliber experience.  That being said, the food was delicious. We had the sweet and sour calamari and lobster mushroom bisque to start. Everyone raves about the sea bass so I got that, but I honestly liked my date's grouper dish better. It was a richly flavored dish with huge chunks of lobster in the mashed potatoes. We split a bottle of Malbec with the meal and had the blueberry napoleon for dessert.  All in all, I left happy with a full stomach... I just wish the ambiance had been as delightful as the food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSMlrwxjCnljiDnqH8EL1Q"
  },
  "y7Vwt3cR4f5MCuxSlYT4jg": {
    "date": "7/27/2014",
    "text": "One of the best brunch buffets in Charlotte. Not only do you get a plethora if shrimp & grits, oysters, salmon etc you also get your choice of tapas which includes crap cakes, waffles and French toast. You will be amazed at how delicious everything is. The chef is amazing. Plus, to top it all off our waiter Micheal was so attentive and knowledgable. You can't beat $24.99 for food this good. We also enjoyed the $5 Mimosa's. Perfect experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "y6KcS1jJNyCgKQWSvxSlAA"
  },
  "aneybwd0vfxC1kLDZq89Vw": {
    "date": "2/12/2012",
    "text": "Glad we tried this at restaurant week prices.  Didn't realize it was  a \"corporate\" place until we got our leftovers in  a bag advertising the network of places it was part of.  We had just said the food was decent but soulless, like you'd expect of a corporate restaurant when that bag arrived to our \"oh, that explains it.\" Typical South side snob crap.  High prices and low quality and originality  for people who want to be seen and spend alot and have the palettes of a 6 year old.  For more of the same you can buy $25 olive oil that's really canola at  Dean and Deluca next door.   Like the reviewer here  with one unsalted and one over salted selection, I will add that the duck was under cooked and the salmon over cooked. DISAPPOINTING",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bYdPeOk6itjHxLf1B02oIA"
  },
  "qeeqAtWLYWDucEJf_yTfmA": {
    "date": "3/30/2015",
    "text": "Last minute trip to Charlotte and did a quick search for places to go for dinner. Upstreams is amazing great simple menu and drinks. Deff will go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NIXzBcdZsN9DR2lnDd-r4g"
  },
  "EFzOBORDvzYA7WJ91y8kXw": {
    "date": "6/13/2014",
    "text": "Fresh, When I think about seafood that is the word that needs to come to mind. Upstream serve excellent quality seafood, in delicous recipes. The staff is very friendly & takes the time to really help you enjoy your dining experience. So if you are craving seafood give upstream a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "T7bFHgWrWx4slesGpuwOzQ": {
    "date": "12/29/2013",
    "text": "Just had...maybe the best brunch I've ever had: and believe me, I take brunch very seriously.  My husband and I were both pleasantly surprised with the bill considering the excellent quality of the food, the variety offered, and the service we received.  We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "W4VhQk3hurVNWgs-0UjJtw"
  },
  "HUTF6_EtleUA_ClrtgZeIg": {
    "date": "4/12/2016",
    "text": "I came in for the calamari and it did not disappoint. I've had seafood all over the south, it takes a lot to impress me ... The calamari is the best I've ever had. Known for their sea bass, it was beautifully prepared and flavorful. It is pricey but worth the splurge.  Eric, my server, was very attentive and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGxGF30Vg9KIcN-NDP_XdQ"
  },
  "es93Sdi5q7uWqWUBTHPuCA": {
    "date": "11/10/2013",
    "text": "I came here a few days ago on a weeknight with 7 other people. We started out with the appetizer tower which came with crab cakes, calamari and mussels. The crab cakes and calamari were great but the mussels didn't seem to be cooked enough. We also tried some sushi, which was quite good.  Once our dinner came, everything went downhill. Our waiter disappeared for a good 20 minutes, no one came around to switch out our appetizer silverware for dinner ware, we ordered a second bottle of wine which arrived promptly but they did not change our wine glasses until we asked and had to pour the wine ourselves.  I ordered the Chilean sea bass and was not at all impressed. It seemed too overcooked and doused in the sauce it came with. Halfway through my meal, I had had enough and didn't even want to smell the fish anymore because it was making me sick to my stomach.  Overall, wasn't impressed by the food and our server (James T.) didn't seem to care about us since he was guaranteed a tip anyway. For a place that seems so classy, the experience surely was not. Didn't feel respected as a customer.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5iY0bL6SwC2PRBsirQ8K2Q"
  },
  "01nV2sAXnwTNcj7wd7LoTQ": {
    "date": "4/17/2015",
    "text": "We have been going here for years and it is always good.  I like the well-thought menu and everything seems to be freshly prepared.  I enjoy the atmosphere,",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqEUGTCX2Wu0XefxfpRPEA"
  },
  "fJyYe9lfVLQL1LcLZmFZJw": {
    "date": "4/1/2015",
    "text": "I always enjoy going to Upstream. Good food choices, a really nice bar and great drinks. A blend of traditional seafood dishes and sushi. When the weather is right, we really enjoy dining at their outside tables. Also, there are plenty of good shops and activities in the area...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KiNaWPr-UKapT3d8OtEQhw"
  },
  "K9lj6faxKkpNkJNIvSyi5g": {
    "date": "9/24/2011",
    "text": "I went to Upstream twice last week: once for lunch, and once for the Yelp elite event.  I was really impressed on both occasions, but this review will mostly talk about lunch, because that will likely be more useful to people considering the restaurant.  That being said: wow, lunch was amazing.  I ordered the atlantic salmon bento box and was absolutely blown away.  I truly forgot that salmon could be so delicious.  Don't get me wrong: everything else in the box was delicious as well: the vegetables, the Asian slaw, and the cucumber salad were all top-notch (and I don't even usually like cucumbers!).  But that salmon... oh my goodness.  It was cooked and seasoned perfectly; it melted like butter upon my tongue.  I'll return to Upstream for sure.  Oh, here's an added bonus: they're relatively pricey for dinner, but their lunch is pretty dang cheap!  My bento box was only $12.  That's pretty cool, huh?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "KijGR31Zq3lV3Wt6qgFing": {
    "date": "8/14/2011",
    "text": "Upstream, you confuse me.   My boss took me to Upstream when I flew into Charlotte for the job I'm at right now, so I have a soft spot for this restaurant.  At the time, and several times after that, Upstream was on my top 5 list.  Now, I'm not so sure I want to pay the money for their inconsistencies.   Here are my notes.   1. Bento Box is the way to go because the preparations are always different and feature a nice variety of creative, well executed dishes.  It comes in a wooden 4 square box.  Items like a jasmine rice with shitake mushrooms, lemongrass scented jasmine rice, or seared tuna with sesame seeds and an Asian slaw. Cucumber salad.  The only warning: when the bento is on the menu at night for dinner, there is no price.  ASK THE PRICE FIRST! Don't quote me, but I'm pretty sure my bento one night was pushing $30 if not $40.   2. The salads are nicely composed.  During the fall, there's a yummy bibb and pear salad with dried cherries I adored, and this summer there is this mixed greens with toasted pistachios and blueberries and poppy seed dressing. I HIGHLY recommend getting either salad with the fried oysters.  But here is where consistency starts to slip. I've had salad here probably 5 or 6 times.  Half of those times, the fried oysters have been under fried, and the batter is a bit pale and the oysters feel limp and taste a bit batter-like.  Once the salad was DRENCHED with dressing, so I ask for it on the side.   3. The mussels are OK. They're not particularly plump.  (They're like the one's at George's Brasserie, not very memorable.)   4. Sushi.  I think sushi is best had at a Japanese restaurant, or where sushi is the star. That's all.  Not standout, and a bit too rice-y.   5. The dessert is downright terrible. I know dessert/pastry is a whole other animal, but honestly, if you have a nice a restaurant as Upstream, get a pastry chef to match. (*Totally agree with reviewer Stephanie in that they may not even HAVE a pastry chef.)   My friends and I had the trio of sorbets/gelato.  They were all icy in consistency and not smooth at all.  The blueberry tart (or I think it was a blueberry tart) featured a HARD crust/shell exterior.  It was bland, and I believe the dough must have been over kneaded.  We brought this to the attention of our server who looked dumbfounded, and answered \"Really?\".  Yes, really.  I'm willing to bet anyone who tries these desserts wouldn't like them.  As a result, these were taken off our bill.   In the end, I do think it's a nicely presented restaurant, with very good service for the most part.  If the food can be prepared the same way every time, and the desserts be brought up to a level that matches the upscale food, I'd be more inclined to bring back another 2 stars.  But unfortunately, instead of suggesting it as a place for my friends and I to have dinner, there are plenty of other restaurants we pick first.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "qRREJl-Z29uyiCCJPE6fZw": {
    "date": "3/26/2012",
    "text": "Let me start off this review by saying:  I got the hook-up for my trip to Upstream.  At the time, I was event planning, and one of the Harper's group gals invited some of my coworkers and I out for dinner/drinks one night after work to show off Upstream.  Everything I ate was PHENOMENAL.    The one thing I will remember always, and will definitely order the next time I go back was this amazing tuna appetizer.  It had a few different kinds in it from seared ahi, to some tuna rolls, but the most impressive part was the presentation.  I wish I knew about Yelp back then, because I would have taken a picture.  There were some tuna things around the sides of the dish, but in the middle was an upside down glass, with just straight up sushi tuna filling the bottom part of the glass.  Spicy tuna rolls on top of the glass.  It was magnificent.    I'm not shy when it comes to eating raw things, and this was HEAVENLY.  Fresh, bright, delicious, and presented in such a cool way.  It's really the only thing I remember, but it stuck out enough for me to want to write a review about it.  I will definitely be back... someday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Sx-NgLzyCBBWT-IKBt9Fw"
  },
  "ypj2DjmEEOt2BOkFQF_-xA": {
    "date": "8/7/2013",
    "text": "We read the reviews and selected Upstream for lunch because my very English Mum loves really good fish, and she knows her fish!  We drove here from Greenville, SC where there is excellent food but Upstream has some of the best fish we've ever had. My husband had the noodle bowl with cod. It came beautifully served with Asian vegetables, soba noodles, and a perfectly cooked LARGE piece of cod...absolutely delicious. I had trade a bite of my lunch to get a bite of his and it was great, he teasingly \"swooned\" over his meal. I had the Chinese chicken salad which was large, full of lovely slices of moist, real chicken, not anything canned. Loads of fresh greens, baby asparagus, carrots, and crumbly noodles served in a light soy dressing.  Absolutely divine!  Now my Mum selected the fresh trout which came with her favorite, real mashed potatoes, and served with green beans. She lingered over her lunch, savored every bite, and scraped the plate clean. She said the trout \"was perfect\" and she was so full she skipped dessert. But not me!! My hubby and I shared a mixed berry cobbler served with vanilla bean ice-cream. Good thing I love him else I would not have shared that dessert!  Served warm, loads of blueberries and blackberries, crumbly topping...YUM!  Service was flawless yet never intrusive. This is a beautiful restaurant and deserves 5 stars. We will DEFINITELY be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "A41rulUxanw5uZu-e-r2Cg"
  },
  "LUD6riaaVIY96q7iBMAfdA": {
    "date": "1/22/2010",
    "text": "I am a big fan of this place. It was home away from home for a long time. I love eating in the bar, because it is so posh and yet kick back at the same time. The sushi is some of the best in Charlotte and the they have a good wine list. The calamari is the BEST appetizer on the menu, but I do always have sea weed salad and some edamame to start..  a glass of conundrum there is over priced.. WAY marked up, but you can get a good Gewurtz that goes well with the spider roll just the same...  They also have great seafood dishes, nothing I have tried has been bad... all the seafood is super fresh..  they have added a great outdoor area for summer too..  just make sure you don't sit out there in bug season.. but it is a great relaxing area to have a glass of wine, people watch and share an appetizer...  Bento boxes are a great way to taste a few different things.  For dessert you must try the creme brulee...  and the french press coffee is out of this world..   alot of people love the hot molten chocolate cake.. little rich for me, but if you are a cocoa lover, go for it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MWuVbyBgP4vD24Rc7UH5xw"
  },
  "Pz4-Zdm6xjX7oXdEdZuxuQ": {
    "date": "11/2/2013",
    "text": "More like Downstream. In town from CA and wanted to try something new. Bad decision. Bad service. Food was bland & ill prepared. What a disappointment.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G0ul8HkzEqlNcgnntIHFTw"
  },
  "DvD6cLbWzDm5V5q-EvKqcg": {
    "date": "4/3/2014",
    "text": "Upstream is my favorite Charlotte restaurant.  One of the few places around town to get fresh seafood, and their tenderloin is divine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phJ5j8RjQMmn0kEv3WGDVQ"
  },
  "8glhrqrKmYh7AhVgz55lYw": {
    "date": "6/13/2011",
    "text": "Awesome, but inconsistent at times.    The first time I went to Upstream, it was for a company event and was just an awesome experience.  It started with drinks in the bar, which has a full bar and can whip up some good cocktails.  Drinks lead to dinner - Upstream's appetizers are fantastic.  The calamari was great.  My entree was seared tuna, and I can tell you I have never had a better prepared piece of (cooked) tuna.  Great wine selection too.   Now, I have been to Upstream at least 4 other times.  I've had 3 great experiences and 2 so-so experiences.  Rather than rave about the other 2 great experiences, I'll touch on the 2 so-so experiences.   Sushi - I was in the mood for sushi, and since Upstream has such great fish, I thought it would be a great place to go.  I was disappointed.  While the fish was good, the rolls and how they were prepared was sloppy and generally, didn't really add anything to the experience.  It's expensive to boot!  If you're in the mood for sushi, you're better off going to other places in Charlotte that just serve sushi.   Restaurant week - While restaurant week is fun, I really feel the quality of food in most restaurant goes down.  Upstream was the same.  The meal was unforgettable, as literally, I don't remember what I got - all I remember was thinking about the tuna I had the first time I went....  tuna mmmmmmm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "m67l1molr2bDueyLZAIo0g"
  },
  "KqAyvTrRjqU3ugEbGrQhGw": {
    "date": "11/4/2013",
    "text": "Ok,  I went during off hours.  Like 2:30 pm on a Monday,  what can I say I'm a tourist passing though,  flight to catch,  need a nice lunch,  a really nice lunch.   The place is beautiful,  good music,  not too many people there it's off hours.  I ordered beet salad,  the beets are a little bit icy,  almost like ice cubes and then Lobster and steak fried rice,  the rice was undercooked. I told the waiter,  he was super nice and offered that I tried something else and that he'd be happy to bring it.  I didn't.  I wanted fried rice.  I'll come back here for dinner for sure. I don't think it's fair to judge them by this one experience.    Perhaps they should pay attention to their off hours when people like  myself might be strolling through.   Service was excellent though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mp542xOufdByeDCKlg_Vsg",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Lobster steak fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mp542xOufdByeDCKlg_Vsg/o.jpg"
      }
    ],
    "user_id": "emrwYkT2KzWaW06lK5NBNA"
  },
  "Cezld9AowM8vK1QgSi5d9A": {
    "date": "1/26/2015",
    "text": "Great service and I enjoyed the decor and atmosphere, but the food was just good, not great or spectacular. If they would drop their prices 20-30% on all items I would be willing to come back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ZBv05Kql-XF2NZBU1M6dLw",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZBv05Kql-XF2NZBU1M6dLw/o.jpg"
      },
      {
        "img_id": "rndRifWGHRgqttP5xWaV8A",
        "caption": "Photo of Upstream - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rndRifWGHRgqttP5xWaV8A/o.jpg"
      }
    ],
    "user_id": "cVfDJ5hgrRKlK4bBaTuQxg"
  },
  "wm6u60oGf3KIWhnjV4LKFg": {
    "date": "3/3/2013",
    "text": "I hadn't tried Upstream.. It always ends up lower than some other place on the Charlotte Restaurant Week list... lol  Luckily, a Yelp Drinks event finally got us in the door...  Their pineapple martini was the favorite for the evening, but the Upstream and the Tsunami martinis were just as delightful...  The wontons with pork belly were crispy on the outside with just enough tasty sauce and meat on the inside... The calamari had a nice, spicy kick... The spring rolls were flaky and adequately stuffed... The crabcakes were straight up crispy yumminess... I could have eaten a whole plate of them...    I know nothing of sushi (it's on my list of things to do this year) and the sushi chef at their bar took time to explain the different ingredients to me...  He didn't even make me feel like a dork because I was completely clueless... Sweet guy...   I am definitely swimming Upstream in the future... lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "UKGSkpclTCX18Uo-aGzfSg": {
    "date": "1/18/2015",
    "text": "So, I decided to try out their special, the sea bass. It was extremely sweet and syrupy.  I forced myself to ignore the putrid fishiness that was underneath all of that sweetness, but that was a bad idea. I had explosive diarrhea immediately after finishing. Have fun cleaning that up in your single stall bathroom. Also, the apple crumb dessert was excessively sour and frankly just f***ing disgusting.  I wasn't planning on writing this review until I had another panicking man rush me while I was on the toilet because he ate some bad lobster.    Friendly service, but disgusting food.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hXGf5jvMEQvXxSLJljpz7w"
  },
  "KyUT5f11t09vp3CeZYcKbg": {
    "date": "1/26/2015",
    "text": "I would like to give 3.5 stars, but it's not an option. The service here was great. I arrived and sat down before folks meeting me there. However, my friend had some issues. The hostess tried to figure out where I was until she was interrupted by management and was ignored. Management interrupting is a problem. Eventually, she found me on her own. As far as the food goes, I had crab cakes for an appetizer and salmon for my entree and my friend had the flank steak. Both average, nothing to write home and tell anyone about. The plus side was our waiter, Eric. He was extremely nice, patient, and accommodating. Disregarding the hostess, service was a 5. The food, while okay, was simply not impressive. For the price, I expected more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "kOFQUVYlvpDd0YASctr9bw": {
    "date": "10/4/2016",
    "text": "Food is aways amazing. Definitely try the muscles. Wait staff can be a bit pretentious at times though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MlhCUi0mqIi--pWlw30iKA"
  },
  "cygSIZ1UDNVTIkUQmt5iCQ": {
    "date": "3/23/2015",
    "text": "Great food! Highly recommend the trout. Service is great. Those who are complaining about restaurant week, well, what do you expect????  Favorite place in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yON7EZzNtH36vHyCnbRpFw"
  },
  "an8Hs1P7i9Va5Acrk72FUg": {
    "date": "10/8/2017",
    "text": "Two stars because there was friendly service. Unfortunately the food was really terrible. We had the brunch buffet and the food was very disappointing. Had trouble finding food that was fresh and appetizing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yIKWunivEyR0MmZIXWmDyA"
  },
  "fALLiSVQoPSyeTzHE2yW1g": {
    "date": "7/9/2013",
    "text": "This is a great restaurant for any occasion.  I went with my family, a party of 5, on the 4th of July.  I heard great things about this place from my brother and it met every expectation.  Here is what we ordered:  -Appetizer for 5 that including jumbo crab cakes, calamari, and mussels.  The calamari is the best calamari I've ever had.  It's not your traditional deep fried style but a light tempura batter that tastes like sweet and sour shrimp.  Our entire table wish we ordered more of it!   -Our meal choices were the steak, bass, royal platter, bento box, and the big tuna:           -The sushi bento box is by far the best deal.  Big portion for the cheapest price.           -The Seabass is by far the best tasting.  I believe it is their signature dish?  Melts in your mouth with miso broth.           -The Royal Platter is by far the most impressive display.  Has tons of seafood including shrimp, mussels, lobster.  The shrimp are massive and tasty.  Mussels are a little on the smaller end.  The lobster is the best lobster I've had (and I live in Seattle).  -They also have a great selection of local and import beer.  I was a little upset that they didn't have Hoegardeen but I decided to get to Nodoijto Beer (I think that's how it is spelled).  It's a very interesting beer with a mojito taste to it.  I also got a shot of limoncello in it which made it way too sweet.    You're going to spend money but its worth it.  Not one of those places that charges a bunch and gives you 1 shrimp.  Not the place to go if you're looking for bang for buck but perfect for a nice dinner with family/significant other.  Can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YL2ijqNlARyAwx7w0Sj4mQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. The app for 5",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YL2ijqNlARyAwx7w0Sj4mQ/o.jpg"
      }
    ],
    "user_id": "LP1heOjIaJwNdnK1PK3cNQ"
  },
  "C0frSdxy16kuxKgoDY-btg": {
    "date": "3/15/2015",
    "text": "Upscale and priced that was. Expensive but very well presented  my scallops were perfect. Staff attentive  I don't go often but on my list to return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hvs6n04dKZheWJVzhB7TDg"
  },
  "uQ9gJWvBSBCAfDZK0SSaWQ": {
    "date": "11/7/2016",
    "text": "Simple elegance, very friendly atmosphere, attentive staff & freshest seafood items in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q2yi0ZHPnPiMwXXD7ZQa5A"
  },
  "qqpM-LdYZ5ejDKKonXvQIQ": {
    "date": "1/22/2015",
    "text": "I went to Upstream with a couple of friends for restaurant week last night. The food was nothing spectacular, especially for the price (which had an added supplement for many of their appetizers and entrees). Our wine glasses were covered in dust and had water droplets on them. They hadn't been cleaned properly. The wine specials that they had all tasted as if they were very low quality.  I had the Salmon, which tasted good, but again it was nothing special for the price. My friend had the Sea Bass, which is supposedly their specialty, but it came out way undercooked and they had to bring out another one.   Overall this place is overrated...maybe they just couldn't handle the volume from restaurant week.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JbGp2BrLMD3HpMTDBISvGA"
  },
  "W7GVTwgYLw34CyOePJAsHQ": {
    "date": "4/30/2013",
    "text": "We first took my grandmother to Upstream a few years ago to get her to try a new restaurant.  We all really enjoyed it and she now takes lots of her visitors here.  On our most recent visit, this last weekend, we were seated at a booth near the entry.  Despite its proximity to the hostess stand, the booth was very private and not loud at all.  Our waiter was helpful with suggestions from the menu.  I got the house mixed greens salad (not sure what it was called) which I enjoyed minus the beets.  The salmon entree was delicious although if I had read the menu more closely, I would have known that this comes with a little panzanella salad on the plate.  It was all still delicious.  The sauce that came with the salmon was amazing.  I must have been having a bad weekend for picking what to order though, because my mom got the tuna entree which I immediately wish I had gotten.  The sushi rice cake underneath the tuna with the sauce all worked so well together and I wanted to switch plates with her.  Now I know what to order next time :)  The prices are a little high here.  They had an incredible number of employees and I felt like I was dodging them on the way to the restroom.  The service wasn't lacking, so I guess this strategy is working for them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_LiSRz1zgAPNvmK5bLMI5w"
  },
  "-AizOVPRJ9lAPWqL_TW88A": {
    "date": "6/12/2014",
    "text": "Upstream was hands-down some of the best seafood I have ever had! And our server was great, he flawlessly waited on our party of seven's need with just the right balance of attentiveness and subtlety.  For our group, our server suggested two \"tower\" appetizers: (4) spicy shrimp lettuce wraps, sweet and sour fried calamari, and 3 crab cakes. We also ordered a variety of local beers and a dozen raw oysters (half east coast, half west coast). I don't care much for beer or oysters to judge (I suck), but the rest of the party raved about both. However, the \"tower\" appetizers were fantastic! Although the calamari wasn't my favorite, I LOVED the wraps, reminiscent of bang bang shrimp in perfect little iceberg lettuce boats and topped with a deliciously sweet-spicy fruit salsa (I ate two, everyone else only got one). The calamari was okay, but the crab cakes were wonderful - very little if any fillers, I just tasted pure, delicate crab with a light, barely-there crispy crust.  Our entrees varied. Most of the selections have an Asian fusion, which isn't bad but I might have liked to seen a little more flavor diversity. I was craving scallops and ordered the Pan Seared Scallops. The three  scallops were some of the plumpest, most succulent and perfectly cooked that I have ever had. However, at the risk of sounding like a complete country bumpkin, the rest of the dish was a complete and disappointing disaster that utterly failed the perfect scallops. Weird, twiggy rijad's mushrooms and way too many of them (TWO piles of those things, posed at opposite ends of the plate like mini pyres waiting to be lit). They were freaky, weird, dry and wholly unappetizing. I didn't like any of the sides or accoutrement (English peas, white asparagus, beet vinaigrette or fennel puree) - they seemed almost a tongue-in-cheek mockery of fancy foods...except the dish was meant to be taken in all seriousness. So, despite the fabulous scallops, so not worth the price.  The rest of the group loved their entrees, varying from huge and flavorful sushi rolls (I sampled a few and they were delicious; I wish I would have ordered sushi instead), to buttery, saucy whitefish dinners. We were too stuffed for dessert, but I and another guy had cappuccinos, which were delicious and speckled with freshly grated nutmeg.  The final bill was high (trust this country bumpkin when she says this place ain't cheap), but not unreasonable for most of what we ordered, and the service was impeccable. However, if I ever make it this way again to Charlotte, I would definitely get a sushi roll and an appetizer, which would make a very reasonable-priced and filling dinner.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lHjm6rCWKo2NMOrStzM9pQ",
        "caption": "Photo of Upstream - Charlotte, NC, United States. I don&amp;#39;t remember what this was but I sampled (of course!) and it was delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lHjm6rCWKo2NMOrStzM9pQ/o.jpg"
      },
      {
        "img_id": "wYp1BmZH9n1RnwLUnrF73Q",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Amazing sushi",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wYp1BmZH9n1RnwLUnrF73Q/o.jpg"
      },
      {
        "img_id": "B_l6YpmBNnnOmALq-6xetw",
        "caption": "Photo of Upstream - Charlotte, NC, United States. Yummy scallops. The rest was a fail.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B_l6YpmBNnnOmALq-6xetw/o.jpg"
      }
    ],
    "user_id": "FcBDHJQEJ_n0RV4hZsJu9A"
  },
  "8zdgP9QwxXepVdLUycApvg": {
    "date": "1/17/2015",
    "text": "Ate here for the first time December 2014, and I'd say I will be swimming downstream next time. Sat at the bar, ordered from bar menu which is small plates and sushi. Order the ceviche which was pretty good and fresh, served with taro chips and such mixed in with diced up avocado and squid. But they charged me for the large size when specifically it has two price points for this dish and I asked for small, and they waiter noted that down. Later I was explained there is no big or small, just happy hour price and not happy hour. Why was this not noted on the menu? When is your happy hour? And why did the waiter not correct me when I said I wanted the small? Our waiter was pretty spacey, it took forever to flag him down to fill up our water and bring out our check, service was kind of a disaster, for a high end restaurant, you definitely expect better. My sushi was first brought to the wrong table and then brought out to me, wow, gotta get your logistics straight. The sushi was OK, order the spicy salmon roll. Nothing spectacular.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zpZLEWweD0Tp6wLTzlZsQ"
  },
  "3PXLCmbMaucjb3g7aMBF5A": {
    "date": "4/15/2012",
    "text": "Pretty sub-par brunch and this place is definitely not headed in the right direction.  Came here for Sunday brunch with a coupla buddies.  Was disappointed at the brunch foods available and the service.  Food - nothing really stands out, which I guess I should expect considering it is a brunch buffet.  That being said, the bar should not be set so low for any restaurant, and they should not be aiming for the status quo.  .  What's up with the tapa-style fish taco? Didn't know you could put canned tuna in a shell and call it a day.  Or what about their grits?  It was more like dried-out mashed potato looking at the viscosity of it.  Would really like them to step up their food quality, even if it is buffet-style.  Been to plenty of really great brunch buffet places, like the Castaways brunch in Burbank, CA.    Service - Hostess was really awkward when we walked in and didn't immediately greet us or ask what we needed--maybe she was new.  The wait was beyond 30 minutes which is understandable.  The other hostess, who was bubblier, asked for our number bc we were going to wander around Phillips Place and told us that she would call when we could be seated.  We returned a little early and just sat outside waiting for a phone call.  She popped her head outside, \"Oh, didn't know you guys were going to just be waiting outside, you can come inside and I'll seat you.\"  The problem was that she was more surprised that we were there.  She should have DEFINITELY called us like she said she would.  To catch us on happenstance outside makes me think that we were not a priority, or that she was not going to call us.  Gotta follow up immediately when you extend extra service like that.  Dishes weren't cleared at a fast enough rate.  Seriously though, it's not like brunch is a new concept at Upstream.  I'm sure the service staff can identify plates that need to be cleared because guests are reloading.  Chaos as some plates were taken while others were left--looking at the plate clear selection, no rhyme or reason it seems.  Empty plates left, while some with left over food taken, etc.    Gave this place a second shot, but unimpressed.  dmo out",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJBUXpkWLEQMwRWi4XQnxA"
  },
  "oXQ_fDkHg5uY844aW24ljA": {
    "date": "1/19/2016",
    "text": "Very good.  had a Corporate Board dinner here in a private room.  The appetizer towers were excellent (especially the calamari and the mussels).  I had what we were told they were known for, the sea bass.  Excellent!!  Sea bass soaked in sake with a sweet broth (sorry chef, I'm getting the nomenclature all mixed up) with lobster dumplings.  Everyone should try this at least once.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "K57kHhdJi_B_hz-DP6Aofg"
  },
  "YDyUWHMmqtHvvtirOjwUbQ": {
    "date": "11/28/2014",
    "text": "I came to upstream for their Thanksgiving buffet. The service was excellent. They were running behind due to a power outage earlier that day but the staff was handling it well. If I ate hear again I would defiantly order items from the raw bar. The oysters and crab claws were delicious. The shrimp and clams were fresh and I enjoyed their cocktail sauce.  I loved their Cesar salad with homemade croutons. I tried some sushi but the rice was underdone and dry. I would try it again considering it was a buffet. Overall I was very happy with the buffet and would love to come back and try their regular menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Iy269paaYw9KrNoUvRPVw"
  },
  "f3BhEC8dHETqPPgIjW7hyw": {
    "date": "7/27/2014",
    "text": "Came here for restaurant week, and had a pretty good time. It didn't blow me away for what I got and imagining what I'd normally pay, but it wasn't bad by any measure.  First, the restaurant is rather large. This means there are servers and such fluttering about all the time, and you feel like you are running some sort of gauntlet just to go to the restroom.  I started with the black kale salad. It was excellent, and arguably the best part of the meal.  My next course was the wood oven roasted Maine lobster. It was cut down the middle for me, and the claws were also cracked for me. Being a land lubber from the land of 10,000 (freshwater) lakes, I don't have a ton of experience eating lobstah. Fortunately, I had a New Englander with me to show me the way. I understood that tail and claw meat was good, but I was unsure of what to eat in the middle. She told me that a real New Englander would eat the green stuff, which are eggs apparently. I tried them, but got a little too squeamish. I would have preferred to crack my own claws or at least get the claw-cracking utensil, as one of my claws couldn't be opened the rest of the way with my hands, but whatever. The lobster was okay. Now I know why they used to feed these giant bugs to prisoners.  Ended with the mixed berry crumble which was okay. Did not blow me out of the water.  Do you want to drop some cash and eat seafood? Do it here, I guess.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuVrNmt7_WtBn1uz5L_p0g"
  },
  "qrB-HWQBWfTf5YH7892T0g": {
    "date": "7/25/2016",
    "text": "The servive was great! She very helpful with recommendations and very knowledgeable about the menu. The food presentation was beautiful. But the taste was a major let down!  There was no flavor and very bland. I love seafood! My friend who I ate with me said the same about his food. The reviews say this place is so great. But I am  hesitant to go back and try again feel like I wasted money for the food turn out like that again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l1ua-UpCUHRQjRteugHaFg"
  },
  "0RbdqzibVQwZCV3O8w57Aw": {
    "date": "6/16/2016",
    "text": "This was my 3rd time visiting Upstream. The first time was awesome. 2nd time was during Restaurant week and it was mediocre. The 3rd time was back to awesome.  I had the Red Snapper and it was crisped to perfection.   Was with my team from work and everyone enjoyed their meal.  Must visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVitpbprQZ1zihsZk8fLKg"
  },
  "JvobE2FpJM9MGL_6hYemwQ": {
    "date": "1/31/2018",
    "text": "I love heading here for their bar bites happy hour. Their sushi is delicious and they have an amazing selection of wines and cocktails. The sangria here is one of my favorites! I usually frequent the bar here, it's one of my go to spots in Charlotte! but the dining room and regular menu are great if you're looking to splurge a bit. They recently stopped having their half price bottles of wine night which is super disappointing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fO0vXycbRO7J8ipAg-bCLQ"
  },
  "9osW7B4svGDs7O1HCJNELw": {
    "date": "1/28/2018",
    "text": "I'm not a brunch fan, but their brunch is incredible! Not only a huge spread, but all sorts of wonderful stuff you can order (at no extra charge.) Can't wait to go again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qV_kTCQbTcVZDSjWcorluw"
  },
  "nXbzu7DHzNU4-u0Sy-13eA": {
    "date": "2/17/2016",
    "text": "Upstream is typically on the pricier side but I was fortunate enough to get a taste of their highly recommended seafood during Charlotte's Restaurant Week. My friends and I ordered an assortment of dishes that came out in sophisticated presentations. The fried octopus was quite a treat! However what stole the show for me was their sea bass. It was cooked to tender perfection and would just melt in my mouth. It had a sweet soy glaze that reminded me of Asian-style sauces.   Overall, it was a great experience with delicious food. A bit pricey for a typical night out but would be suitable for a special occasion and worth trying at least once.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2fcAEP0dH4sPoxVYlAUkpw"
  },
  "-ZXpdOD_dfNHDJmRxTcPPw": {
    "date": "6/4/2017",
    "text": "My experience here was not very good. I felt the food was overpriced, the portions were very small and nothing really stood out. I will make my way there for brunch one, maybe my experience will be better.  <a href=\"/redir?url=http%3A%2F%2Featitcharlotte.com%2F2017%2F05%2F11%2Fupstream-restaurant%2F&s=0db47092b24818500196784d8474954425a977d54b54b815b67d2af762502f2a\" target=\"_blank\" rel=\"nofollow\">eatitcharlotte.com/2017/...</a>",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-1kcEXDmH4tawm4_eiZrg"
  },
  "ThEh-edlqbanadm7lsR2VA": {
    "date": "12/17/2015",
    "text": "LOVE the Sunday brunch!!! I haven't been in quite awhile, but I'm anxious to go back again. The food is delicious.  The service here could definitely be better and more personable. Prices are high! Go during brunch to ensure more bang for your buck!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "I5wBGsszcjgADdJrcRA_8Q": {
    "date": "4/5/2016",
    "text": "First visit was Easter Brunch, and it was Fabulous!! They had more food then I can name the service was Great too!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cSzgnbNnXLnbZl6olPd1yw"
  },
  "Z0nayj9_iKQNBF0k9t-lQg": {
    "date": "10/10/2016",
    "text": "Table for two on a Saturday night. We hadn't been here in years, and we were happy to get a table with short notice. I had the lobster and heart of ribeye combo, and my wife had the NC grouper.  We had the mussels as a starter. Overall, everything was great. The mussels lacked a bit of flavor in the broth. They weren't bad, just not awesome. The grouper with cream corn side was fantastic, and my surf and turf was very nice as well. Desserts of berry cobbler, and bread pudding with chocolate and dried cherries were a great finish. Coffee for some reason is also awesome. My only hang up with the place is it is a bit pricey. They are proud of their food. However, we didn't go here looking for a bargain, and I'd gladly go again, but I would probably skip the mussels.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "75PchRVTALYDN5oSoMtJWA"
  },
  "WglnxR0epjYaSqFMVTMTrg": {
    "date": "1/18/2017",
    "text": "We went here recently for Christmas gathering.  The server was super awesome, food was good, portion size are very small, it very pricey but the food did not wow you.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o8lLpvh65u3Hk-qk3DMPnw"
  },
  "3xq55D8rDiVEd6O_BSw54Q": {
    "date": "12/16/2017",
    "text": "7:45 Reservation and waited until 8:45 without being seated. Just kept telling us should be soon. Why take reservations if you have no idea how to seat people. Terrible management and incompetent hostesses.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSgRzRxs775ki-djbarpxw"
  },
  "LJQYdMAxbh2uXfBGw23PfQ": {
    "date": "3/1/2017",
    "text": "I've been eating at Upstream since it opened and have never had bad meal. Bonus points too for being locally owned.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4nfcEdzGW-pVvQQAxC3KFw"
  },
  "L3oPFYBWNWHv69FoPWwZGw": {
    "date": "1/19/2014",
    "text": "Restaurant Week, January 2014.  I loved the menu that they posted online.  Me, Sweetie and 2 friends booked a reservation.  I called up and making a reservation was a snap, no problem.   I have been to Upstream 2 times B.Y (Before Yelp), and thought it was just OK so it hasn't been on my radar.  I'm not a huge fan of crowds and Phillips Place is crowded. I was happy that they offered valet parking so I don't have to deal with parking.    The menu was a bit confusing to start since it was their full menu with various upcharges for certain items.  Deal is for $30.00 and you could choose an appetizer, entree and dessert.  The waitress was very nice and explained everything and was upfront about the upcharges.  So, for example if you wanted an appetizer of the crab cakes it was an additional $4.00.  I got it now.....\"It's a profit deal\" (Steve Martin, The Jerk).  I started with the Lobster Bisque which was served lukewarm, borderline cold.  It wasn't good.  The bowl that they served it in was hotter than the soup.  Me and my friend sent it back and it was returned just as lukewarm so we forged ahead.  It was just OK in my opinion, it didn't have any lobster in it and was creamy enough but I've had better.  Maybe they cheapened it for Restaurant week?  The Sake Marinated Sea Bass was on my radar from looking online at the menu and in a last minute decision I opted for the flounder.  I'm glad I did.  So, it was flounder, nicely grilled sitting on top of a black truffle risotto.  This was excellent.  The fish was nicely prepared and seasoned.  The risotto would have made Gordon Ramsey proud.  It was probably one of the best risottos I've had, flavorful not watery and the light sauce on top perfectly complimented the fish.  Sweetie opted for the Sea Bass for a $12.00 upcharge.  She didn't think it was all that great and it was drowned in marinade which was a bit gross.  It was flavorful, but frankly a good sea bass should be treated better IMO.  I got the cheesecake for dessert which frankly, wasn't all that great.  It was clumpy and served with some dry granola or something with some golden raisins.  It needed a sauce of some sort.  I decided to save the calories and bring it home for my daughter.....she'll eat anything.    All in all, it was worth it to go for the entree.  The goal of Restaurant Week IMO is to expose you inexpensively to places you don't generally go to.  I'm glad I went back and may try Upstream again soon to see if it's worth the trip.  It's been a round for a while and there's probably a good reason.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "qcaSPutwk885oi2IJMV9ug": {
    "date": "5/4/2015",
    "text": "Exquisite seafood! Our group had a scrumptious dinner here including apps such as lobster tangine, roasted octopus, spicy shrimp lettuce wraps, and the best calamari I've ever eaten! Mains were tuna with incredible sesame ponzu sauce, scallops, salmon & sea bass. We all were thrilled with this delicious dinner & I thought the service was excellent. We decided on cocktails that included a lemon/ginger vodka mix & a blackberry Manhattan.  Fabulous drinks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "SLRBrwoHb0eAAQDOPxTDew": {
    "date": "10/27/2017",
    "text": "Bartender needs an attitude adjustment and maybe she would've gotten a bigger tip. Be respectful of All patrons.  And the place wasn't even busy for Friday. Food was okay. Definitely not what I was expecting of this place. Disappointed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7vbljF7bJkEbUMkSlwg4w"
  },
  "Mlf8rECVAdc1w3OQ6Ivxmg": {
    "date": "9/18/2015",
    "text": "Nice place for cocktails after dinner. We didn't eat here but nice atmosphere and great service for after dinner get together.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dfm69NWJMqvLbQBKlaFd7w"
  },
  "-qpSfSX5a5DI3QiotoY9OA": {
    "date": "1/23/2015",
    "text": "First let me say as a new parent it is extremely hard to go anywhere as a family let alone enjoy a nice meal so when I heard it was restaurant week I dug in my heels and was determined to enjoy a nice meal, even with a toddler in tow. I saw Upstream on the list of restaurants participating and the menu looked great so me, my husband and 15 month old drove 1 1/2 from Hickory for a fun family night.    From the beginning it was bad.  I was told only a few items on the menu was included in the $30 meal and everything else would include an up-charge (which was not on the website when I looked it up).  Ok fine, so I order the crab cakes for appetizer...they were completely bland and had NO salt, like none.  For my entree I ordered the lobster which was the grossest thing I've ever attempted to eat in my life. 75% of it was raw and still had it's guts oozing out.  My husband was in denial and thought it was sauce but when the waiter confirmed this he almost threw up.  So we sent it back and got the scallops instead but they too were completely raw...not even a little done.  Like they were in the pan for maybe 5 seconds and that's it.  The manager finally came over and told me that they generally under cook most of their seafood.  I've never heard of a restaurant doing this but they should at least let the customers know.  I would have told them I like my food dead not alive.  The only thing I had to look forward to was the apple crumble.  How can you mess that up, right?  While it wasn't completely bad, it tasted like one of those cheap diner desserts with lots of apple jelly and no dough.    Needless to say I won't be returning here and wouldn't recommend this place at all.  The only good thing was the service but I can't eat that.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5ii2_AGOy4nGb318GNXjw"
  },
  "CRbHUkrdzs_pGA9GMpS8jA": {
    "date": "12/12/2012",
    "text": "Went here for brunch on a Sunday morning.  The brunch is a buffet, so bring your appetite.  There are different stations for custom eggs/omelets, meats, soup, desserts, seafood, cheese, fruits, etc.  Unfortunately the buffet area is in a small area, so it gets pretty cramped when you are getting your food. Waiting in line for food is something that makes me quite uncomfortable and medieval.  The tapas menu is probably the best thing about the brunch, as they will bring you small dishes of breakfast and seafood options.  In terms of quality, the prepared food, like the tapas and omelet station are quite good.  Aside from that, the mass prepared food is pretty average. The breads and dessert are below average, since they are both dry and flavorless. I think I would have been satisfied if the whole meal for two was less than $30, but sadly it was about double the price.  For the value, I do not think I would return for the brunch.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "PpR78qjGCkN1DtTfoU-mSQ": {
    "date": "12/7/2015",
    "text": "For Sunday brunch, I had 18 oz of prime rib, crab cake Eggs Benedict, pulled pork, smoked salmon, poached salmon, river trout, a selection of sushi, a cheese plate, and all manner of pastries, french toast, belgian waffles, fruits and vegetables. All for $27.50. Which is a pretty great deal, given the prime rib and sides alone would have cost about that much most places.  Looking forward for trying Upstream for other meals. If the food is as good there as it was for brunch, it'll be great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJHJQETuo8AsjUZQuikmcg"
  },
  "NlibxBJpK9vBDWy4_058TQ": {
    "date": "8/16/2015",
    "text": "I finally made it to upstream! It was delish, just as I had imagined! We had to sit outside since they were fully booked inside but I couldn't have been happier. It was a nice night with passing showers.we order a shrimp appetizer which was perfectly made, followed by some calamari (which wasn't fried) -I have never had it that way. I also had the salmon dish which couldn't have been anymore perfectly cooked. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDuI1ZfBxcL5iWEJOWK89w"
  },
  "nmo9hnHOzg5gqcQqhmvTKA": {
    "date": "4/26/2015",
    "text": "Love, love, love this place!  We finally ate here last night and wow was it amazing.  They offer a really good wine selection and we settled on a delicious bottle of sauvignon blanc.   For appetizers, we ordered a medley of starters to split between four of us including - crab cakes, calamari, octopus, and shrimp rolls.  Each app was amazing.  They were presented beautifully and everything was cooked to perfection.    For my entree, I ordered their tuna dish.  It was fantastic.  Everything about it was delicious - I literally cleared by entire plate!  For dessert, my husband and I split the creme brulee and that was spot on as well.  Can't wait to go back and try other items from their menu as everything looked/sounded good and everyone at the table enjoyed their meal thoroughly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1osyO04_hXoDKyGqe_V2Q"
  }
}