{
  "VhQ-9KN21CP9wkYE8l12yQ": {
    "date": "5/14/2013",
    "text": "Barbecue Chicken Pizza.  Need I say more?  ... I guess I will!  I really like the atmosphere of this place as well.  It's a great place to go out to lunch/dinner or chat with friends, almost like a sports bar, but just not as loud and much more spacey.  I'm usually not a huge stickler on service unless it's absolutely awful, and I haven't experienced that here; it's average to fine.  This place incites great moods all around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRNBKh8oj0PZXnkaOxIG9Q"
  },
  "NlD5k7F95zaR4fZPbOc2lQ": {
    "date": "10/11/2014",
    "text": "The food was slow coming out to add to that its wasn't very well prepared and on top of it all the wait staff was very rude and seemed as if they didn't know how to handle there selfs professionally.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c-vE5BrrTyrNJotP2ybS2A",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Just showing the place I&amp;#39;m talking about",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c-vE5BrrTyrNJotP2ybS2A/o.jpg"
      }
    ],
    "user_id": "ynMdDm5y2pmXTHkGbLDieQ"
  },
  "9IzozSiEBD9ts4M2PfDSrQ": {
    "date": "1/8/2013",
    "text": "This was a solid food option on our way from the hotel to the Belk Bowl.  The cafe was situated in a nice looking part of town, adjacent to a garden and had high ceilings and beautiful big glass windows.  Pizza was good, but certainly not spectacular.  I guess it all depends on what kind of pizza you like.  I tried both the Veggie and the Hawaiian.  For better or worse, the sauce was not memorable.  The pizza crust was thin, slightly crisp and of a good quality.  Cheese was not too greasy or overpowering.  Toppings seemed pretty fresh.  I really liked that it was a pizza place where you can get a beer as well.  Though the selection left a bit to be desired.  Either way, I was sated, the food was a decent quality and Fuel completed the job of a much needed feeding.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCg3IFE8LooHWuNE4tHexA"
  },
  "yyH2DiyuGY5nLeR28rKcaw": {
    "date": "4/15/2014",
    "text": "Here in CLT on business. I dig this place. Service was good, pie was good. I went to another location not too far from here a year or so ago. Seems like they had more beer selections but that's ok. I love the retro look!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sPvrlXsOr73YVY3QjFpFdQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Nice napkin dispenser!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sPvrlXsOr73YVY3QjFpFdQ/o.jpg"
      }
    ],
    "user_id": "OhbKL67BCc8iYMMhORov3A"
  },
  "RT03C5CRgybO-WJHciUTJw": {
    "date": "10/7/2014",
    "text": "Stopped here for lunch uptown and had a cheese and barbecue chicken pizza. Both pizzas were real good and the service was good too. The wait was average and they served you at your table when your pizza is ready. Since its called Fuel Pizza, the entire place is designed like a gas station. Pretty cool and different.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lpF55dnjTu6XiFHlevoYsQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lpF55dnjTu6XiFHlevoYsQ/o.jpg"
      },
      {
        "img_id": "DTL-XGYfgDYf-JYx5N5yYQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Cheese and bbq chicken pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DTL-XGYfgDYf-JYx5N5yYQ/o.jpg"
      },
      {
        "img_id": "5H54TZvmkdou2BAsAmFZwQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5H54TZvmkdou2BAsAmFZwQ/o.jpg"
      }
    ],
    "user_id": "dMx-PR1ujNveu6kdQU5Q7w"
  },
  "z9b4Mt0Hk5V3B8fmE3FxXg": {
    "date": "1/3/2016",
    "text": "Not that great for sure.. Ordered sausage peppers and onion sandwich. Mistake!! Burnt minimal inkers and no dipping sauce. Over priced for what it is. Good thing I don't live here in Charlotte",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EvZv1FBodhpSp5MV5selng"
  },
  "fK6DbBqsSa-ALKRocYoTIQ": {
    "date": "9/19/2016",
    "text": "This place offered to split our pizza then nearly doubled our price.  When I asked why they said new menu.  When I asked for the manager they refused to give me his\\her name.  Don't go.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "NvlcCWMB6OpND0qQ8YfuXA"
  },
  "3J2wsGNbr1vwnELYcbFuyA": {
    "date": "4/26/2016",
    "text": "This is my favorite location in Charlotte! First off, talk about GOOD PIZZA!! Even the crust is good..and it doesn't need garlic flavors or butter to be so good, it's good on it's own! I love the people who work here, they are friendly and had my best friend and I laughing the whole time! I love the theme to this place and did I mention the pizza! I never heard of Fuel until I came to charlotte but This is probably my Second favorite pizza place and this particular location with the friendly staff makes it an even better experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KJ4HQfJKlJIx3O4GtuK4gg"
  },
  "QUi9mVBSoFHSas0HAOtziw": {
    "date": "10/28/2015",
    "text": "The pizza is greasy but huge slices. The wings aren't that great and they charge $.50 extra for ranch. When wasn't ranch dressing the price of doing business. It's like charging for ketchup, what's the difference. Not cool!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "42hJPYVSmVF35wmxIcf5oA"
  },
  "Y7mwdnTbuQam-AlvCWdz5Q": {
    "date": "2/11/2017",
    "text": "We had a great experience here.  They were packed because of a volleyball tournament. Customer service was great.  Pizza and garlic knots were excellent. Prices were fair.  I would recommend it.  Loved the BBQ chicken pizza",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8mtD0vTo7YP4z5WfP0pl2w"
  },
  "EyXI8kWIybfISYXriWLwWA": {
    "date": "1/5/2016",
    "text": "Probably the worst pizza I've had in a while. The staff wasn't very friendly. The pizza was lukewarm and just okay. Not sure how this place has such great reviews because even the garlic knots-which I previously believed couldn't be messed up - were awful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6_xE9XG9ZxGpl9B00iRbiA"
  },
  "MEHvF2BLKWvM8UxsL1rWEQ": {
    "date": "7/20/2013",
    "text": "Oof! Sorry Fuel, this was a pizza fail. I had high hopes from the fact that this chain has exploded in a short time, but they were dashed on the rocks upon the first taste of delivery. The pizza was chewy, and not in a fun way, more in a rubber tire way. The taste is \"ok,\" but reminded me a lot of the Chuck E Cheese variety I downed as a kid. There was very little flavor, absolutely no pizzaz, and the experience is not one I want to repeat. We have done better with grocery store dough, canned sauce, and throwing our own ingredients down on the fly.   FYI, we got a pepperoni and a buffalo chicken. Not even any bleu cheese dipping sauce included with the buffalo--what?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Op00-3BG3sNPkB564kXQg"
  },
  "iHbf50pHZn3hP8xMyasNwg": {
    "date": "12/27/2015",
    "text": "We ordered pizza & salad. Great pizza! The sausage is wonderful! Great ingredients...fresh tomato sauce, & fresh mushrooms! The only negative was the crust was a little crisper than we like. The side salad was also satisfying!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oBX9ZFrzlVx_0KnNNsoLJw"
  },
  "dIR9KX4jWgPL9av0vpYd0Q": {
    "date": "12/14/2014",
    "text": "Kind of disappointed with this place. I ordered a large pizza for delivery on a Saturday around 7:00. The driver was very confused and said his GPS wasn't working and then when I finally guided him to my house and paid, I realized he gave me a medium while I order and paid for a large. After spending so much time trying to get the pizza, I wasn't going to wait another hour to send it back and have another delivered. The pizza was very good though and I wanted to be a regular customer but I feel a little cheated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQS5OdzaDhPq1q3ZcBTNmg"
  },
  "W7mfUzyr76DNW0wNQ5KL8A": {
    "date": "9/14/2014",
    "text": "I was here for a conference and my stomach was threatening to eat itself so when I saw fuel and smelt the food from across the street I stopped in. I got the honey BBQ wings, side salad, beer, one garlic and one cinnamon knot. The people at the front counter were VERY short and abrupt with me. I was obviously from out of state and had no knowledge about there ordering process but they kept rushing me and were unhelpful. The wings were hard and not fun to eat. The salad dressing on their salad was good, both knots were ok. My favorite part of the meal was my ice cold beer. I was so hungry I couldn't wait to find another place for lunch- lesson learned. I have three more days for the conference and I will not come back here. Not worth the $16 I just spent-my teeth still hurt from eating the over- fried wings!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "v6LGPL-pm2koVqh6coF8jg"
  },
  "tbjppBW9-fYZ_BzMxUdByg": {
    "date": "2/20/2016",
    "text": "Great and reliable late night spot. Good pizza and good wings. Staff works hard and it shows because the place stays clean and the orders are efficient. Well done. One tip is to try the wings, they are pretty good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-JhmAs9jrddGbyuwPRsnA"
  },
  "3jBJcVg9SA34ttDYgByt1w": {
    "date": "11/4/2008",
    "text": "This Fuel Pizza is one of the few places that you can find open on a Sunday night in the deserted Uptown streets.  We went to Fuel after being totally disgusted by the lack of service from the Uptown Pizzeria Uno.    Usually I just get a slice of pizza and a side, but during this visit, we ordered a Super size Extreme Fuel Pizza (my favorite -- generously topped with all sorts of meats).  We only waited about 10-15 minutes before it was brought out to our table (which was about how long we waited to be seated at the mostly empty Uno).  In the meantime, as we waited for our pizza, we munched on Fuel's yummy garlic knots (a great deal!).    The service we received and taste of our food washed away the bad taste Pizzeria Uno left in my mouth.  We were happy to find it open.  :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qUXVu-2u1YKIbkeSiGj5iw",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qUXVu-2u1YKIbkeSiGj5iw/o.jpg"
      },
      {
        "img_id": "sne29-8ZLZHwk5PEkJbH6g",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sne29-8ZLZHwk5PEkJbH6g/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "WOGfWL3UQtiiTOTOSLLbjQ": {
    "date": "9/19/2015",
    "text": "Ive been to this location a couple times and the pizza is good, but the WINGS are AWESOME! They are the best wings I have found at a pizza joint. The garlic knots are also great. I would still prefer other pizza places to this one though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Gwq4C3-WSLH5A3R5NORFHg"
  },
  "UzfZvXWv_qy4lING9xqFRg": {
    "date": "4/18/2011",
    "text": "This location is right off the Green and it has been a while since I've visited, but Fuel hasn't really made any drastic changes to their business model so it's a pretty steady staple in Charlotte in my book.  Great place for quelling the  late-night pizza fixes and a great way to end the night to lessen the magnitude of hangovers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "gE8SrWmKVH-8ATGMzkTXPw": {
    "date": "4/22/2010",
    "text": "I'm thinking we just came at a bad time. End of night, an hour from closing, 8ish pm. There weren't many pizzas to choose from by the slice and they all looked like they had been sitting out for a bit. I tried the Spinach, tomato and ricotta pizza as well as the veggie pizza. They tasted like they would be really good hot and fresh out of the oven. But they were just reheated slices of pizza. Meh. The cashier also did a little lying when my friend asked if they had any sweet tea. They had run out and still told us they had some. LIES.  Plenty of flatscreens, huge space, fun decor. But, disappointing pizza. At least we got to park for free.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "53QaFbmZojYK0vv3RQagcw"
  },
  "j3noOl8wrKwpzuDgA9rZcQ": {
    "date": "1/12/2016",
    "text": "Gluten free pizza couldn't get any better! I love coming here for pizza. The price has unfortunately risen, but that's ok. Because it is the best gf pizza I've ever had, I will keep coming back here. The associates are always nice. I order online and my food is always ready!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "chD0IU0TaBeKzt3ioUfOMA"
  },
  "M_ZujjxAYpnkX6fO_ZXa6A": {
    "date": "12/30/2017",
    "text": "Nothing beats biting into a wing to find it still pink/raw in the middle. Disgusting place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8F9INxqcan_ceK_pX_xGCw"
  },
  "6KNynTLYfCvw-dufW5c0dg": {
    "date": "2/20/2016",
    "text": "This review is for service never got a chance to grab a slice of pizza.    Looks like a reasonable place, but the staff didn't know what they were doing.   Went there to grab a slice and apparently a Lego festival was next door.  I was told to wait outside by staff because they were 'full'.  I peaked inside and the line was short.    The staff doesnt appear to able to handle large crowds.  I could imagine the service on the weekends.  I left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YLsdK5Jh32ZxcDoknt_7mQ"
  },
  "m5p9aT_1T69RhoUJss-zjQ": {
    "date": "4/3/2016",
    "text": "Should have known when they were not busy at 7 on a Sunday with such a trendy atmosphere, that it would be a bad experience. Slow service, orders were wrong, no tea and rude employees. They got mad when we asked for \"the rest of our order\" they hadn't filled. Bad experience.  Everyone has a bad day in a restaurant...but I won't be going back to find out if there are better days here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GPhTAVlkSZMARDreysfFA"
  },
  "D8BvA1vma-vPQmz0ltE5LQ": {
    "date": "2/24/2014",
    "text": "This is one of those grimy-type/after the drinking/partying/ it's late & I'll eat anything b/c I'm that hungry, spots... The pizza is straight nuked. Seems like bums/misfits hang out here (well late nites anyway ;-)  ... it seemed fairly clean. I honestly couldn't tell if the grungy look was intentional or neglect. The atmosphere has an 80s diner Grease-feel... The layout permits you to see the people working in the kitchen from the dining area and I was just amazed at all the people that were on staff seemingly so busy making WHAT?! My pizza certainly wasn't fresh!  But hey go for it if the stale pizza flavor is your thing :-)",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "SbdrkMeBUiexjkzNaSEQSQ"
  },
  "kYTeZ5ToVDuSvFF-Z4FVug": {
    "date": "7/25/2015",
    "text": "Stopped in here for lunch one day while I was working across the street.  Had a slice of pizza and a soda, the pizza was decent, I mean who has ever had bad pizza?  But there was nothing special about it.  To sum the place up I would call it forgettable.  But if you just want a quick slice of pizza it will get the job done.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "u8WIVYVQxiAFJWLdjJNkIQ"
  },
  "Ud6qnIiJ6wBuNZtPHX8ycw": {
    "date": "2/8/2016",
    "text": "Fuel was good and quick.  There are multiple locations in the area, and we thought this was the one that closed at 3:00AM.  It's not.  They were out of almost everything and we thought \"What the hell is going on?\"  Our bad.  Had we known they were minutes away from closing we wouldn't have come in.  Wife & I split the last three slices of Pepperoni and they were great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6u82x6PkhQD2zm6Qa3mxCw"
  },
  "WnsPsJrEyp4-kzVguuYqjg": {
    "date": "9/16/2013",
    "text": "3 for food. 1 for service. Reminder to self. Don't ever tip here again for take outs.  Ordered a pizza, wings and garlic knots. The waiter forgets wings and garlic knots.   Had to wait 15 more minutes after waiting 20 minutes already for my pizza!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wVSZ4H_AgO48OGPe3VCg-w",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wVSZ4H_AgO48OGPe3VCg-w/o.jpg"
      }
    ],
    "user_id": "yTz7raSht-llS-gC0p9jGA"
  },
  "jSypaCN933GfDhGN4WWBLw": {
    "date": "4/17/2016",
    "text": "Great food, great service. Pizza was very tasty, hot and full of flavor.  Very helpful staff for us visitors to the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0v2KGWQjdzn-YPlsLzhFOw"
  },
  "eQVU2TdXjX8QxGP-MIWWTA": {
    "date": "3/31/2017",
    "text": "Good pizza and open late. Great place to stop after the bar. The service is very welcoming and Paris is the man behind the counter!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KusM8EzBlOSTqbDROdwOgg"
  },
  "rittw2u-mMCCBB1BtRsCQQ": {
    "date": "7/7/2013",
    "text": "Ugh! Why does this place exist??? The boneless wings were crazy salty. Maybe I shouldn't order boneless wings... I normally don't but I didn't feel like dealing with bones that day.   So I got some pizza... Yea that wasn't good either. No flavor to the sauce... At all. The pizza seasoning did a lil something something, but yea not worth even $1.   Huuuu... Again, why does this place exist?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "gdJg8DN2FrGu9YWmvKMKeQ": {
    "date": "5/1/2016",
    "text": "Ordered my pizza just the way I wanted it.  With anchovies. Not the weirdest thing.  Pizza and anchovies. Come in to pick up my order. The kids behind the counter are talking about how disgusting anchovies are and as I'm leaving they are literally pointing out I'm  the one who ordered it. Just ok pizza and terrible customer service.  Won't be back. If I want to be critiqued about my eating habits I'll hire a nutrionist.",
    "rating": 1,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "a3iAiWQo58P1-xd4S4cYmA"
  },
  "QbVjouMHpGJNB65kwws1Vw": {
    "date": "12/2/2015",
    "text": "What better place to go eat after a night out in Charlotte? Fuel Pizza Cafe is a great spot to hit up!  Not only because its close by and one of the few choices that are open at this hour, but it is pretty delicious I must admit.  The wings are a must get here, These would be comparative to a BWW or even a wingstreet kind of deal.  They have just enough flavor for a nice kick in tangyness.  The sauce is just enough where it will not create a mess.  You can also go for the dry rub which im not a big particular fan of, however it was still good enough to my liking.   Ofcourse, you can always go for the pizza which is a bit pricey, but it still gets the job done.  Not to mention the big cookies they have :D.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GQvVZWHN0YjdJxAkHZE64g"
  },
  "t-BdqXjikt8D5sY1rIpg3Q": {
    "date": "11/29/2017",
    "text": "I'm not a big fan of fuel pizza in general, but this one deserves a special shout out because out of all the other fuels I have been to this one by far has the best pizza, I don't know Wether they do something a little different from the rest with the recipe but, other fuel pizza should follow this particular fuel pizzas standard",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oyOVUvK6Gg453uvThx9fuQ"
  },
  "qutRMUcio7EJtM-Kg7mWUQ": {
    "date": "3/1/2017",
    "text": "So we got a lunch meeting catered at work the other day. Fuel pizza was great then and great today for lunch!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVkDs8FRgXPPHPXktA6QCQ"
  },
  "CemwM152mau6EOjjn8b9Ow": {
    "date": "6/18/2016",
    "text": "I usually come here when I'm in town for a convention and it's pretty Foss. But this year I was disappointed in not only the pizza but the service as well. I asked for the Hawaiian and got the Aloha which has jalapenos on it and was a little to spicy for me. Also as I was carrying it out since I got it to go it dropped out of the box onto my shirt and burned me. The dough was not done all the way through and the pizza was not that great overall.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k05q-Li__ftNZwkIS4SmAQ"
  },
  "tOLrijBvv788nZrO-Z-6aQ": {
    "date": "3/10/2015",
    "text": "I like this location as it is right on the green and larger than the other uptown location. The pizza is hit-or-miss; depending on the time you go. For the freshest slices you need to go during the lunch hour on a weekday. Anytime I visit on the weekend the pizza looks like it has been sitting out too long and tastes a bit stale.   The BBQ chicken pizza is a good one. I just wish they would take more of a focus on fresh pizza rather than prebaking them then reheating. You can only get it right out of the oven during their busiest hours.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqIAiKisujzZWEjbdbMxyg"
  },
  "yJbCWHF9fKLYx7BvKTiiZw": {
    "date": "10/21/2015",
    "text": "Great spot for a slice and a beer.  Quick,  easy,  very friendly.   Had a slice if the extreme - excellent.   I'd add the fifth star for beer on tap,  but I might be asking for too much for such a casual place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkUr3Hem_5zsG3RnHaf4dg"
  },
  "-ZW6sJe9628pHXNHU76J-Q": {
    "date": "1/26/2015",
    "text": "This is not a great pizza place ... probably one of my least favorite I've ever had ... and that's a bold statement. Most of my friends feel the same way too. Quality is not good, and the taste is blah. For the price ... you can do MUCH better. I'd take Papa John's over this any day of the week.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4-Oh0TN8-b9gj12_VUZmAw"
  },
  "AAJQmxPTSjNd8PK16JE-AA": {
    "date": "6/17/2010",
    "text": "GOOD NY STYLE PIZZA!!  This was exactly what I was looking for and it hit the spot. The tomato sauce had a nice zing, with a touch of basil. The cheese was thin and the crust was thin and chewy.   The chocolate chip cookie came out half baked, although I've had better it was still good.   $2 delivery fee. $13 minimum order. Smallest pizza they deliver is 12'' which is a small pizza but enough if you're hungry. Love it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "65LV5ZEBYA4ni0tUA03R0w",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Chocolate Chip Cookie",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/65LV5ZEBYA4ni0tUA03R0w/o.jpg"
      },
      {
        "img_id": "zTG30JvQsCRq7zEDc9FA1w",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Cheese Pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zTG30JvQsCRq7zEDc9FA1w/o.jpg"
      }
    ],
    "user_id": "5gbkhlWANGVzQYi_0m3vOQ"
  },
  "GA6QsRaK__4gYkSYMWjjog": {
    "date": "9/11/2017",
    "text": "The WORST PLACE EVER!!! This place sucks so bad, I have tried 2 weeks in a row to order online, I even call to let them know I just ordered, they never confirm the order and new call you back, nothing! I usually try to give people the benefit of the doubt, but I whole heartly, hope they go out of business, what a bunch of slacker, lazy people that work at this location. It's only a block down the street, but they will never get business from me again. Like I could even get them to accept an order anyways... Yelp should drop them from the results.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXBOsuS4wIIRqgBWwA4-zA"
  },
  "SDxc0j3Ck3yfNPAeKIEyeg": {
    "date": "12/23/2018",
    "text": "I would leave no stars but I have to at least leave one. We couldn't even get past the ordering process because I think the person I was giving the order to, had just smoked too much marijuana to know what he was doing.  We asked the employee if we could order about 11 mediums for the next day, and he just kept repeating back 11 mediums? 11 mediums? Finally the manager, we could hear was asking for the phone so that she could take over the conversation. We began to leave the order with her and then was transferred to another fuel pizza location. We then began to leave an order with another young man who promptly took the order and hung up the phone, before we could say goodbye. We didn't feel comfortable with that type of service so we called back to confirm, and we were told our order back to us and it was half wrong. We decided we didn't have faith in this type of service so we did end up going with Papa John's, who definitely seemed like they were drug-free; and PROFESSIONAL!  Thank you Papa John's, we won't be going back to fuel. Fuel Pizza lost a $180.00 order!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DMw0a50H2lmek3xQC8-cgg"
  },
  "chtsuVZWKMSb5DtmlQz_mg": {
    "date": "3/2/2018",
    "text": "You know how they say when you hungry everything taste good, well guess what that shyt is a lie. This place was horrible, the only good thing here was the damn cherrywine pop from the fountain machine. I don't care how cheap it is or how it was open late they were open but I will never eat here again. If you see this location just run..... I'll probably give the one on the north side a chance or I'll just say fuck it and go to the frozen food section a the grocery store because that shyt would taste better than here .",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fPLyR6-k3rjk0it1kLYqFQ"
  },
  "nRikAjtE0PTAQLJ35YmVuQ": {
    "date": "8/21/2015",
    "text": "Highly impressed with the quickness and quality of this little place!  Having an event at the convention center this little pizza joint is on point with location! We got in and out in under 20 minutes.  The chicken sausage pizza was delicious, just the right amount of toppings. Try the garlic knots! They're only 1.99 for 3 :)  Also, go with the combos- we got a slice a specialty pizza with a side salad and a drink for under $10!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pqwrn3tc69IL-z8wuDAjDA",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Chicken sausage, onions and red bell pepper pizza! One garlic knot mmm",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pqwrn3tc69IL-z8wuDAjDA/o.jpg"
      },
      {
        "img_id": "Njgy3REupji5jZYMNd1_lQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Great lunch combos!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Njgy3REupji5jZYMNd1_lQ/o.jpg"
      }
    ],
    "user_id": "K2zkYfB4FROtLZAfZF6lcg"
  },
  "eb0LAWG7CU5yF1wYWC8K8Q": {
    "date": "2/17/2018",
    "text": "This place is great if you're looking for a drunken mediocre pizza slice. DO NOT ORDER THE WINGS. Apparently ordering buffalo medium wings does not mean you ordered wings with sauce on them. Despite the request you will get sad, bland, barren wings.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dDOU5Ti90aFL0BmglKR-Ww"
  },
  "aBuUv06hCnwBFVj80jp06g": {
    "date": "3/28/2018",
    "text": "I wish I had \"listened to the star\" and believed the overall rating for this place. I was in a hurry and it wasn't busy and there were parking spots to be had. I heard the Sirens song of convenience and I paid the price. Horrible reheated pizza. How can you bake a pizza twice and still have a soggy crust? Service was speedy and friendly but the food didn't satisfy at all.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFihPaqHtYPYk1HJbxodEw"
  },
  "dXfeaHXxKQVlok-_YSB8bw": {
    "date": "12/22/2017",
    "text": "This location is BEYOND terrible. The pizza is mediocre, but the service is terrible. There are two customers in the place at lunch at the server forgot to put my order, and the previous customers order in so we both waited for 15 mins. Its just poorly run. Once slice runs you about $4 too. Skip!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wbdujAxJ6ftPI_Y6Pl2bQA"
  },
  "L77us1YmFByMa3Y8TWzW4w": {
    "date": "11/19/2017",
    "text": "I hate to put 1-star because the pizza is good.  The reason I have to put a bad review is because we were having a birthday party at the near by rock climbing facility Inner Peaks. We first tried to call to place an order no answer after four tries. We decided to go to the restaurant to place the order and get them to deliver.  We were denied delivery so we decided to pick up the pizza at an agreed upon time of 5pm. (Ordered at 3:45). Arrived to pick up the pizza at 5pm to find out the pizza were not even cooked or started.  Manager would not offer any refund or condolences for the delay. We will suggest using another close by pizza place to cater your birthday party in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "AgWpCtmhREv6liB2XDke5Q"
  },
  "hN-WoCyH7CUNjr2ijuvFlQ": {
    "date": "9/9/2018",
    "text": "On business in Charlotte. Tried calling ahead every time to pick up and always lef on hold for up to 15 minutes. When asked for manager, they hung up on me. Pizza is pretty good but the customer service is terrible. On 9/9/18, I was left on hold two times and no one ever picked up. Take your business elsewhere",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZHTDSIAHRGgMovOkCPxvgQ"
  },
  "IxAI9zRdwWB6TtGtnCKZxQ": {
    "date": "8/29/2018",
    "text": "Love this place I honestly think they have the best pizza in the city. Big slices and the wings are to die for definitely coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0P9s5kOqz3AQDUMoPGQl-A"
  },
  "t9GHkTc6jwOeuppfxmmGFA": {
    "date": "2/10/2018",
    "text": "Excellent pizza at a great price. Had pepperoni on mine and the balance of ingredients was perfect. Crust was thin and crispy. The sauce was really tasty which is why I decided to write a review. I don't often notice that the sauce on a pizza is highly flavored so it stood out. Fast friendly counter service is a plus. Decor is automotive and would appeal to kids and adults as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCSO8BXOZM0KAsmAlyp2TA"
  },
  "_MMlOGDHCnhqb7Qzla5gfg": {
    "date": "11/21/2014",
    "text": "Nice, Clean, Convenient location, Friendly staff... Good Pizza. However, if you are going to snag a whole pie, do yourself a favor and get one of the specialty pies... the $20ish for a whole Hawaiian was a bit steep for a slightly above average pie. The cal-zone was also really tasty, with a ton of ricotta type cheese inside,, definitely not for the lactose faint.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aZus4WMuvowjlHJSZiPKzg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/aZus4WMuvowjlHJSZiPKzg/o.jpg"
      },
      {
        "img_id": "yg4v_eSAdLllxwEPVd6cww",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yg4v_eSAdLllxwEPVd6cww/o.jpg"
      }
    ],
    "user_id": "Im_pTCVCm-xCvvim1JtdPg"
  },
  "bnPGa7FZk6yZweflOWEdYg": {
    "date": "5/31/2018",
    "text": "This place was terrible. It took over an hour to get our food. Our food was then delivered cold! The calzone was under cooked. The dough was still raw. . The food just did not taste good. We didn't receive the cookie we ordered. No explanation. Said they would call and get us know. Still haven't. I will never order from here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JV2QEI4Wl4pOK1YXDv4Beg"
  },
  "eBCwGYRjTudaeGYjbkvUTw": {
    "date": "9/2/2016",
    "text": "So really the back story is guys from NYC were looking for good pizza and they couldn't find any so they opened their own place? Well they failed so I guess there's still no good place to get pizza in Charlotte. I'm from NYC and this is horrible. First off I'll give everyone a little hint if you ever go into a pizza place who cooks their food and pizza on a conveyer it's gonna suck..I got pizza and the chicken parm sub..totally embarrassing they use frozen chicken nuggets as the chicken. How lazy can you get..do you know how easy it is to flour or bread your own cutlet and make a decent sandwich? If you don't know any better what a good pizza place is have at it..if you want quality run. Run fast....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H7WfuMXv0SVWMe6GYv9Leg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H7WfuMXv0SVWMe6GYv9Leg/o.jpg"
      }
    ],
    "user_id": "64QucEiCGAF-p6xdY0AxbQ"
  },
  "MlwxVWo2D40wW6qS0uFxEw": {
    "date": "1/3/2018",
    "text": "Tough being a Steelers fan in the middle of Panther Country. The server was nice even though she was a huge Cam Newton fanatic. The Calzone was great according to my daughter. All I know was the Dr. Pepper was perfect. The place has a family vibe and would be ideal for watching a football game if they weren't playing the Panthers. I would go back to have fun talking to the staff and having a slice. Go Steelers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0t7vV3qnHsYntbFlCS4_tw"
  },
  "RGVXppZvxjOFyB1YDto2Bg": {
    "date": "9/13/2017",
    "text": "Absolutely the worst ran eatery in Charlotte. It's mass chaos and nobody knows what's going on. Still waiting 45 mins after I ordered a calzone. If you need lunch fast you better stay away!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iCxg9sG2Szmn6Hp-Ctja0A"
  },
  "acDNc2SNB0gbzLD2PObvYQ": {
    "date": "2/25/2018",
    "text": "I hate that this is the closest pizza place to my house. The online ordering is terrible, you place the order online with their Co-company slice and then slice calls it it... except they never do. You end up having to call directly which defeats the whole purpose. Then they like to pick up and hang up the phone, leave you on hold for 10 minutes or they just flat out don't ever answer the phone and then get your order wrong. I keep trying to go back because it's so convenient but I'd really rather drive a few more minutes and not have to deal... i don't know how this location is still in business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiXXbu1kwPuc7CSCwVSQEg"
  },
  "KTpzLZmzQqR9FOx0p0onkA": {
    "date": "1/29/2017",
    "text": "The pizza here is good  the Brooklyn is one of my favorites, the location, the place, it's something to come and enjoy with friends",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YOahNmB8LJChaLGYOXZkBA",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. Great pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YOahNmB8LJChaLGYOXZkBA/o.jpg"
      }
    ],
    "user_id": "pgj-cH1hV0wwxRIFu8_NjQ"
  },
  "AcPc0tz6YPSZjuhkB4V2UQ": {
    "date": "10/15/2017",
    "text": "The personal is extremely friendly in this place, you feel like those are your friends from college, and the pizza is good, and they also have great combos, I like the pizza slide with the salad size. The best of this pizza is that is NOT greasy at all, thank GOD!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z1XHja10GmkbilbMDI8Raw"
  },
  "-9w_6ggadE2_cgQSyUbjVQ": {
    "date": "2/2/2018",
    "text": "They advertised a 2 slice combo w/knots for $7 that we tried to order but were out of knots. The cashier said sorry they are out of knots so for 2 slices we had to pay more than the combo and get less.  The pizza was ok but rating it low due to the cashier not having critical thinking skills and understanding why that didn't make sense and charging the customer more than they should have for something that was not our fault.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQIA50U71msbwAUlLwZjFQ"
  },
  "_Gs_u3vAsdYXhMjGsz_8pQ": {
    "date": "12/26/2017",
    "text": "***  AVOID  ***  I've been a faithful Fuel Pizza customer for years. But the product and service have consistently went downhill over time to the point that I would advise that you avoid this restaurant.   Tonight, we drove 35 minutes from SC just to eat here. The service was below standard. The cashier took 3-4 minutes and two trips to speak with someone else just to determine how to enter our order. Then we went to get out drinks and the ice machine was out of ice. We told the staff and another 3-4 minutes later someone came out from the kitchen to start adding ice. S-L-O-W.   When our food arrived, my slices tasted like reheated pizza from much earlier in the day. One slice the crust was so hard that there was no way that I would eat it. My wife's calzone was burnt on the bottom.   Not a good experience. We won't return. Much better options a lot closer to home. Fuel, you just lost one of your last supporters.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NEpxPeanc90-xEFl9W72Fg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NEpxPeanc90-xEFl9W72Fg/o.jpg"
      }
    ],
    "user_id": "a-F4s_UyVUrHcYbXjtQrqw"
  },
  "UfOPW7iaAKzzjlaJZK628g": {
    "date": "9/29/2018",
    "text": "Fast pizza  to satisfy your hunger craving. Prices are good.   Definitely kid approved.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ruLDwzJpqc8VYROrwbzPA"
  },
  "lk96vytJIt7VG8jdRZkTwQ": {
    "date": "3/15/2019",
    "text": "While the food product is better than average, their lines and customer service during the lunch crush stinks.  I waited in line for 15 min and then they told me to order a sub I had to wait until I got to the cash register.  I asked if they could start it cooking and they said no, they had to wait for the ticket from the cash register.  After I paid, my food came out 15 min later.  So much for a quick lunch.  And lastly, the place needs a good cleaning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcqOOUTQYTmCQ1Gz4GiIsg"
  },
  "Eru3Lr4QGlj6QtYFXynGhA": {
    "date": "3/2/2018",
    "text": "It was fine. We were in the area for a football game and wanted to grab a quick bite before braving the crowd, and the cold... not to mention the obscenely priced stadium food.   The service was quick. My Dad's french fries took the longest (no, I don't know why he ordered french fries). Mom had a salad which she said was fresh and a good size. I had a slice of pizza which was ok. They make their pizzas ahead of time then warm slices to order as many of the pizza by a slice places do. Mine was a little dry and unevenly warmed.   This place was ok for what we needed, but I won't be back unless it's our only option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T3TxHHWRJ2hnTwlLeHu1VQ"
  },
  "KpKz80EW_TXoFrSwRuLulQ": {
    "date": "6/13/2019",
    "text": "First and last time. Came during lunch and it was Anot busy. That should have been the first sign. Pizza was luke warm and had the flavor of sausage even though I got supreme. The wings were dry and cold. Oh well. You live and you learn",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r6fGkJAvlY2muaLkmYZ-CA"
  },
  "O41lRO4T_5uDT6HKluwbnw": {
    "date": "7/29/2018",
    "text": "Had a crazy pizza craving! We came during a bar rush and still had great service. Our pizza was delicious hot and fresh! They did run out of marinara for the garlic knots but it was still so good! Manager was polite and really paying attention to the whole restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Slny6DHILkNeWl0Xlipe0A"
  },
  "gBOZRmzPqOgJdFNwYZteWw": {
    "date": "2/24/2019",
    "text": "Had the best experience here today! Customer service was amazing! Me and my husband were going to the mint museum for our anniversary and decided to grab a couple slices before the museum and there was a girl that took our order, I wish I knew her name but she was wearing a black and yellow sweater, and she was so sweet she saw I was pregnant and gave us our meal on the house just because she was feeling generous and she was so happy for us. And on top of that our pizza was delicious!! We will DEFINITELY be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bzRt7sF-OV4l9qFvOKc7TA"
  },
  "5IHifj6gXs4TeFxKJyfNOA": {
    "date": "2/8/2019",
    "text": "I eat here quite a bit (probably too much) because it's so close to my building.  I have never been impressed with Fuel as more often then not the employees could care less and the pizza is mediocre at best.  This location is different, as their pizza cook Pedro NAILS it every time.  I am not sure what he does differently, but he should be the one training the pizza cooks in every Fuel Pizza.  Perfect sauce / cheese ratio that leaves your slice not too greasy with a touch of sweetness from the sauce, and over all is just a party in your mouth.  Four stars because they got rid of pizza happy hour.    Props to Pedro!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4NGVVr3ZNF7r9-w6hnmmGQ"
  },
  "98kAtE941AeHFu0EJSgoSw": {
    "date": "1/26/2019",
    "text": "This location is terrible. Not only did my pizza and garlic knots take forever , but they were cold. The customer service is grade F. They're unorganized, slow and ridiculous. No sense of urgency on a Saturday after noon and barely any pizza made.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYWQ3Txu9KVvfUz3ZTiBNg"
  },
  "qzHA1W913BSOGl0FFZ8L7A": {
    "date": "8/18/2017",
    "text": "This place gets 1 star for convenience. That's pretty much it. I went twice while working at the convention center and it was solely for convenience.   The first time I ordered a slice and some wings. The wings were way too salty and the pizza sauce is SOOOOO bland! Like they put Ragu on crust and went to work! The next time I ordered TWO slices because I'm a glutton for punishment...and because I only had 20min to eat and get back to my sessions in the convention center, so I needed something that could just sit on my stomach. Pizza was still bland. Nothing changed, as was to be expected. The service is LACKLUSTER! The first night I went, the guy behind the register was really friendly and was working quickly to get my order, and he's half the reason I gave this place a second chance after the first time. The staff the second time...Jesus Christo! The worst. Literally...THE WORST. I'd probably never come back here.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBQfKxAWEXzMWzej3y2BGQ"
  },
  "-YTDp-P3kaAgCPcQlKF4Zw": {
    "date": "12/17/2018",
    "text": "Ordered pizza & garlic knots 40 mins via phone.  Went to pickup and they never could find our order.  What a cluster f$&k inside.  Pizzas were stacked up coming off the oven and the workers looked clueless.  Wouldn't recommend this place at all!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UqTDhXdy6GjKv-51o1JfUA"
  },
  "GtQ-F7mKo3NW2EO1Nu43nQ": {
    "date": "2/20/2018",
    "text": "Hot mess, but it works! Always end up eating at Fuel at least once every Heroescon. Pros are it's really close to the convention center. Cons: Could be slow? Could be fast? Could get your order entirely wrong. Forget your order. Any number of things.  You'd think they would have gotten the chaos of a convention weekend down to a science, but they seem like they like to wing it. That aside I feel for the wait staff out on the front line. They seemed like they were trying their hardest.  Food isn't bad. It's not great, but it's easy pizza. Can't really complain there. Not really sure how they function on a normal day, but it's crazy during an event weekend. Probably will eat here again another Heroescon in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "c-5Ll8ptojXkTh-MDLw5tA"
  },
  "m5jHdunx2wXrGJ_vnf1-Xg": {
    "date": "2/25/2018",
    "text": "I am extremely disappointed in this establishment.  First of all the guy at the register, who claimed to have run a strip club previously, stated that they had no potable water...I know that is a violation. They yelled at the patrons and while I understand the challenges of the location, it was unnecessary.  I will never come back here for anything! I advise not waiting your time. There is pizza at the EpiCentre.  And...after all of that. The pizza was trash and didn't have cheese on the cheese pizza!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y3cjqqsdrHo5Cj5_xibHnw"
  },
  "YYNy1xyGopRZBI6JgwFiow": {
    "date": "3/12/2019",
    "text": "Was in town for a conference and found this local pizza place very delicious! The cinnamon knots were too good! Also, the pizza was very tasty. Will definitely go again if in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXlHv1qpF5W1J6UIsnREqA"
  },
  "Q44Cck7Ystj-SvRABPqg-Q": {
    "date": "11/25/2015",
    "text": "Let's look at the plus column first:  Great location near Seventh Street Market  Really cool retro decor with a boldness and \"filling station\" feel to it  Decent pizza that can be ordered by the slice  Now the minus:  Took a while for someone to notice me standing at the register  $7.50 for two slices was a bit steep  The pizza looked pretty dried out before it was put in the oven  Quite honestly, if Pure Pizza had been open, I would have gone there instead.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 10,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "D0b-uzAU7EYQy1w3tY1auQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D0b-uzAU7EYQy1w3tY1auQ/o.jpg"
      },
      {
        "img_id": "guJbAmwpOe6JBVvTwz0iPw",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/guJbAmwpOe6JBVvTwz0iPw/o.jpg"
      },
      {
        "img_id": "sOkkNYmBP8ILUU63rL40wA",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sOkkNYmBP8ILUU63rL40wA/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "DKT_ZdyoT_P00EDluizlyA": {
    "date": "5/27/2018",
    "text": "This place was a shitshow, the food LOOKED good but we never got to try it because they were out of half the things on their menu, they charged us different prices than what was posted on the menu, there was no ice, the guy at the register had NO clue what he was doing. The pizza looked really good, but it was not worth the headache of trying to order. They were out of garlic knots, they were out of strombolis. They charged us $44 for a family deal that should have been $35. We canceled our order and left. You've got to have the patience and tolerance of a saint to eat here. If they had better systems/training in place they would have a shot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGar5gT_kMerZdrNMTU42g"
  },
  "8DSJKGRy39UCtFDaeOBVVQ": {
    "date": "8/12/2018",
    "text": "Meatball parm pizza is bomb. Make your own with cheese, tomato sauce, fresh garlic & mozzarella is also good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B1PbgZrL3YXfmAWBmifXTw"
  },
  "Cv-U6Ovy0ZVdOFOD1_vOtQ": {
    "date": "5/10/2018",
    "text": "Boooooo! Fuel Pizza is awesome. This location is by far the worst. Sub par in service, taste, and coolness.   Grab a pita next door and don't waste your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ewUI79hQZnaSWJRJZ2GoQQ"
  },
  "kA3664pgLmi-17weeheULQ": {
    "date": "1/26/2019",
    "text": "We loved the decor.  The staff are all really friendly.  The wait was reasonable and the food was worth waiting for,  This place makes a great pizza!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PMLcbKsn_e7cHJFOJGj6hA"
  },
  "awB2lBPAY1h_LHerY1GV_Q": {
    "date": "11/16/2017",
    "text": "I came in around 4 on a Wednesday. There were a couple people sitting inside, but not too many. I went to look at the menu (I was not starved but I just wanted something little to hold me over till dinner (6:30 ish). I go up to order and I noticed they only had three different pizzas to choose from! A veggie, bbq chicken, and \"extreme\" (which seemed to have sausage and ham. I'm a plain pepperoni pizza kind of gal, and a little upset at this point. When suddenly the gentleman behind the counter said they also have a couple slices of pepperoni in the oven. Hallelujah! I ordered a slice and 2 knots with a drink. I love cheerwine, and this is one of the places that actually serves it! The pizza came out pretty quickly.  The staff (that I was in contact with) was friendly and welcoming.  I did take away a star because of the slim selection at the time (but they might have been getting ready for the dinner rush?)  Overall, I did enjoy the place. It seemed to be cleaned up, no messes that I could see. I love the old, rustic, gas station look.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6wqZwWnXt1l-NInReBufA"
  },
  "f6WcIrBQtENLhBXHcSzvig": {
    "date": "5/6/2019",
    "text": "We came in to get a pizza for the Super Bowl. So this review was extremely late. I will say that we called ahead, and drove down to get our pizza. Our pizza was cold. Which is fine because we can always heated up but I don't think it's fine to serve it to your customers.  It was very spacious, but I don't believe the Decour is up-to-date. I would say that it looked a little rundown. But for the pizza that we received it was really good. I would go back but I'm not pressed to make that trip or try to get in anytime soon. So it's one of those things that if it comes up in conversation with a group of friends I'd go. But it's not on my list of places to revisit.  I wouldn't let that stop you from going in an experienced it for yourself. I will say that their pizza was extremely better than bigger food chains. And much more flavorful",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R7MBNhTtgChYBYX5qdqLhg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/R7MBNhTtgChYBYX5qdqLhg/o.jpg"
      }
    ],
    "user_id": "bAV9OzddT7ufO7cfGPGabA"
  },
  "krXnZ0Mak1_icfIFX0wlkA": {
    "date": "4/25/2019",
    "text": "N-a-s-t-y! Dropped by with a party of 8 on a Saturday night before the Tosco Music Party. We almost walked out immediately after seeing their 90.5 sanitary grade but were in a hurry so thought we'd give it a try. The place was deserted at 5:30 which should have told us a lot.  Anyway, as we stood in line, the cashier did not seem too enthusiastic in taking our order; in fact, when we asked asked about allergy friendly options, she said \"if you aren't comfortable with our conditions you probably should not eat here,\" so we canceled our entire order and left. While in line, we noticed everything looked a lot worse than a 90.5. Food prep area was a mess. Tables were dirty. Employees uninterested.   It goes without saying, we still not return to ANY location of Fuel Pizza. I give it one start only because I have to. I deserves zero.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "zch7gdC2PhKuebrD3ZLBCg": {
    "date": "8/14/2019",
    "text": "I was in town for an event and we decided to walk to Fuel Pizza for dinner Saturday night. This was our first time at this location which sits alongside a park in the city which is beautiful. On this night there was a pretty decent size line to order and I noticed only two employees doing everything. Orders were still coming out quickly and it didn't take long for our order. We were pretty impressed with the cleanliness of the restaurant as well as the speedy service despite the lack of employees.  I definitely recommend this location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lI5RZ7ulAHOcjnw3JnBo4g"
  },
  "FgeZMMGZ3TunTiwdKwhAPA": {
    "date": "4/26/2019",
    "text": "I'm always satisfied with fuel pizza the crust is thin and cooked to the perfect temperature. I ordered the grandmas pizza with veggie and the garlic knots are on point",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "pQTRAOtpbu73bjgSJOk41g",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pQTRAOtpbu73bjgSJOk41g/o.jpg"
      }
    ],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "QNW8EFK5RDniSfevVTvxeA": {
    "date": "8/25/2019",
    "text": "I went in after the pride parade and had two slices of pizza that were pretty good, but the reason I'm giving it five stars is not because of the pizza but because of the playlist. They played Cher, Whitney Houston, and Charli XCX. After sitting there for almost thirty minutes listening to straight hits I heard disco tits by Tove Lo come on and almost lost my mind. It took all the strength in my body not to dance on the table and go crazy. Thanks to whoever was controlling the playlist that day you have amazing taste and hope your day is great and I hope you find $100 on the ground today.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TntRoXbX66wGUKF6K2Rxng"
  },
  "5eLfmlfTgV4hILCOxt5Fdw": {
    "date": "2/23/2019",
    "text": "If I eat somewhere before checking Yelp, which is seldom, I like to have an experiment where I try and guess the number of stars a restaurant has after I eat there before I check Yelp.   I was shocked to find that Fuel has 2.5 stars.    Fuel is a regular go to spot for me as someone that works right next door.  While Fuel May not be the best authentic NY pizza you've ever eaten, the quality is consistent, it's a nice big slice, and it's always put through the oven immediately after ordering so it always hits your table hot, with a delicious thin crust and fantastic pepperoni.  Make sure your go-to is the combo with garlic knots (or cinnamon knots if you're a dessert lover).  These always hit your table piping hot and are always delicious.   Another great point for fuel for me is the price.   Two slices, three huge knots and a drink for $8?!  A steal in uptown Charlotte.  Fuel was one of the first spots i hit when I started working here and I've kept coming ever since.  Just cheap, non-pretentious, good tasting food.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uJftKIM8Cpo9lJhxMQB2_A"
  },
  "HjaxMZuA-MNkw-_zqKSklg": {
    "date": "8/21/2019",
    "text": "I was the ONLY customer in line shortly after 5 pm and there was one table of customers. About five people seemed to be working. I stood in line while one employee made a pizza and a male employee watched her. After quite a wait, I finally asked the two if they were open. The male walked over and asked how he could help me. I suggested that for starters he not ignore me. Then he chastised me that he was TRAINING someone. So training takes precedence over assisting a customer waiting for service. Great business model. Judging by the three-star YELP rating, Fuel needs to retool customer service. I left. A vending machine dinner was more enticing than supporting this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0pl84wwRLV4TCasn8n5SnA"
  },
  "wymC67sKb8x998DGQ10cfA": {
    "date": "5/23/2018",
    "text": "I was so tired of going to 7th street market and looking for something close by (on a lunch time crunch). This place is right around the corner and had some markings on the outside of the building that brought me in. I figured can't go wrong with pizza place, right?    Well this place is \"gas station\" themed if you will and the food tastes like it came from s gas station so it's fitting.   I kinda wanted a salad, I'm semi trying to be healthy but all the lettuce/salads displayed were filled with iceberg lettuce. No thanks. So I decided on a slice of pizza and fries. Nothing special about the pizza. The fries taste like Arby's curly fries which is cool with me.   You serve yourself your drink and grab your own everything... ketchup, napkins blah blah blah food from the station behind the fountain drinks.   The prices here are okay. Nothing outrageous or cheap. My biggest complaint is that this place was HOT. It was like eating outside but without any breeze. If you want food fast and to be unbothered by waiters then fuel up with fuel Pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_0N8oVXj-x4yRGeOzesWgg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_0N8oVXj-x4yRGeOzesWgg/o.jpg"
      },
      {
        "img_id": "4k0kDbqip-equJtFSIFNRg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4k0kDbqip-equJtFSIFNRg/o.jpg"
      },
      {
        "img_id": "Tf58PMRq4B1uOKyOiK1Bbw",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Tf58PMRq4B1uOKyOiK1Bbw/o.jpg"
      }
    ],
    "user_id": "VWsPniQ335mkTtWYPksRtA"
  },
  "foUNUq_3Fm8Bzs4H_MVsig": {
    "date": "10/26/2018",
    "text": "pizza place that serves more than just pizza  calzones, wings, chicken tenders , sandwiches and sandwiches .  3pm-5pm is happy hour pizza 1/2 .pay attnerio. to the time because there's no wiggle room .  If you're visiting the Carolinas dedicated  try Cheerwine a Carolina favorite",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NoQXOevDZ4q6OCjZeX3HSA",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States. #cltpizzaweek",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NoQXOevDZ4q6OCjZeX3HSA/o.jpg"
      }
    ],
    "user_id": "7gg29jxOEulX5m6f1mWaqA"
  },
  "EgJ4RCQ65irSKVcshuKcXg": {
    "date": "6/26/2019",
    "text": "I ordered the meat pizza it was pretty good, but the garlic knots were horrible. I Mean horrible!!!Hard and tasteless also the marinara was bland.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uxlXspGNg4rkTtEPZfJV9w"
  },
  "VYtheLxSvjYrta8Er6m-pg": {
    "date": "8/7/2018",
    "text": "I ordered pizzas online today, a very large order, to be delivered at 11:45am.  Received email confirmation through Slice ( the third party vendor that handles the online orders for Fuel), that the pizza was confirmed, then another email from Slice saying the pizza was in the oven.  At 11:47 called to check the status, the Fuel representative answered the phone and said she cancelled the order because they didn't have a delivery driver?    Don't you think that should have been communicated to the customer in real time???    I am now ordering from your competitor and the catering event will be delayed by over an hour, which is a major inconvenience for folks who have back to back meetings.  Maybe the worlds smallest violin is playing right now, I get it, but why not communicate?    Thumbs down.  Communication is key.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-TLItSawQwJXfxDDOoYNWg",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-TLItSawQwJXfxDDOoYNWg/o.jpg"
      }
    ],
    "user_id": "N0IFmT9QdCa1UmSMS19fQQ"
  },
  "5y6_LjVVhdr4A18vSK-RAw": {
    "date": "5/17/2018",
    "text": "Well, it's not that good. Sorry.  The \"by the slice\" pizza looks old and dry. The salads are cheap, yes, but they're tiny.   The pizza itself looks like a decent take on New York pizza. The texture of the crust is right:  flexible but with just a little crispness on the bottom.   But sadly, the crust is almost tasteless. It's not bad, but it's very basic and kind of bland.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "yVMvS4Q7JTxHALm8CTwSZQ"
  },
  "-tHMIdXfrr3zQuZVsQZE9A": {
    "date": "11/14/2018",
    "text": "In town on business and after a long day just wanted to chill in the hotel room so I ordered delivery.  My small Ultimate Pepperoni pie arrived piping hot in just over thirty minutes.  It was a great pizza!  The abundant pepperoni was excellent.  The sauce was really good with a tangy bite.  I loved it but some people might prefer a sweeter sauce. The mozzarella was the real stuff, not imitation cheese-like product.  The crust was excellent with a nice char.   I wouldn't hesitate to order the Ultimate Pepperoni again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "j1-2jDeSpyn20bFI-LcYmQ"
  },
  "d01LbuF0wP8XaEcig-Gq_w": {
    "date": "12/27/2018",
    "text": "Pizza at a decent price. Smooth process to order over the phone and picked up my 19\" party pie in 15 minutes. We did the half/half specialty- half cheese, half pepperoni and pineapple. Well executed. Fuel pizza is a well known chain in North Carolina so trying it at least once is a must!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "spcWkD16-UyUCdeyePYQCA"
  },
  "rLH7iPLhsvooEEzXawRMiA": {
    "date": "4/2/2019",
    "text": "The guys at Fuel Pizza were awesome. I went in there late on a Saturday night to get some Cinnamon Knots and left my bag there! Somehow, they looked through my bag, found the number of a friend of mines, and that friend called me. I went back and they kept the bag for me. Thank you so much!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "d0mleMgm_ewbBe3ag1Mt0Q"
  },
  "FaBlPOj_HjIvvofA110gvg": {
    "date": "4/25/2019",
    "text": "My rating is for the overwhelmingly crappy service I've gotten here in the six weeks I've been working uptown and the six trips I've been there in that time. 1. Bring your own drink. Machine normally low on ice and water is not chilled. You will get warm, flat soda. 2. Had my order given to wrong table once. Had to go up to check and see what was happening. No employees wonder why lady sitting there with number so long. 3. Had the guy who ordered immediately after me get his food first. I wait a minute. Nothing for me. Had to go up to check and see what was happening. It was just sitting up by the oven, ignored. 4. Ordered pickup online. Walk over, sit for a few minutes as I thought I might be early. Go stand at counter, about 20 minutes after original order. Stand at counter for 10 minutes before cashier makes eye contact. Seems no one knows where my food is. I wait and watch. Saw my cinnamon thingy get packed. I see wings, but apparently they weren't for me. Guess where!! They were in the bottom  cabinet of the warmer at least the whole time I was standing there!! No one stopped taking care of the people standing in line in order to see if my food was even done. Ordered extra crispy. Got soggy since sitting in it's own steam.  Lessons learned: A. Bring your own drink. B. Dont bother ordering online, its not faster. (I didn't  even tell you about one takeout order situation I witnessed go bad!) C. If you are going to eat there and not get slices, be prepared to wait 20 minutes or more for food. You may have to get up and go find it. D. They think it's funny when they waste your time.  I'm done with them. It isn't good enough to waste my time anymore.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gvQOqvhD9Sj9wJDHmQIMsw",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gvQOqvhD9Sj9wJDHmQIMsw/o.jpg"
      }
    ],
    "user_id": "nCEp8bPz2P0gcjaarlvJjA"
  },
  "Hb4Bt2cuIK9i4lfHdFjgCg": {
    "date": "3/8/2018",
    "text": "Fuel is a convenient place to get an average meal. The decor is great, but the service is slower than one might expect at a fast-ish food restaurant. I got a chicken parm sandwich, a salad, and garlic knots. They were fine.  I got a soda and tried to use Pepsi's version of the magic Coke machine, and it tasted terrible. Reverted back to the original Pepsi fountain machine.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3orWfsbGeRghIrOsTnp4qA",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3orWfsbGeRghIrOsTnp4qA/o.jpg"
      }
    ],
    "user_id": "SJuVq4TQuq2YDR228croiw"
  },
  "eEfl0PdpoDpRDo20ka9LDg": {
    "date": "2/23/2018",
    "text": "Right across from the convention center.  It's not gourmet and it's not even very authentic NY style pizza, but it's relatively quick, inexpensive, and decent enough.  Think 1980s mall food court pizza and you've got the picture.  My cheese pizza was above average and so were the garlic knots.  The service is mostly friendly and moves the line quickly.  If there's any fault, it's the lack of any artificial sweeteners for the unsweet tea.    But for a quick lunch near the convention center, you can do a heck of a lot worse.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "s75d8PSqVbCJtclvBdne3Q"
  },
  "aCMtvLoa2Cdc-IvQPvEFaA": {
    "date": "6/29/2019",
    "text": "The pizza is pretty good, I will give them that! But oh my god, the service is horrid. By the time the pizza gets to you, it is cold, if it ever does. We had to go up to the counter 3 times over the course of 30 mins to get the rest of our order.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HYf6aq6y649_0yRCMAWDew"
  },
  "qmT9Bw1isUY0lm7qhOXFlw": {
    "date": "7/6/2018",
    "text": "So this place is nothing to write home about but it's also not bad.  We stopped in for some pizza because I didn't want to pay $15 for one pizza at the 7th street market. We noticed upon arrival that Mon-Friday from 3pm to 5pm they have a happy hour special of $1.00 cheese slices, $1.50 for single topping(I think) and $2.00 for a specialty pizza slice.  I noticed on yelp that they sell fries now and so what could go wrong with pizza and fries?  We ordered 3 slices of cheese and one specialty slice of sausage, bacon and pepperoni with some waffle fries.  The pizza came out hot, 2 of the 3 slices of cheese were freshly made and the other two were reheated and bit dried out but still decent.  The waffle fries portion was quite small for 3 bucks and they were really greasy but still palatable. I love mayo on my fries but they didn't have any and the person working offered me ranch dressing which was actually really good ranch, can I buy a bottle?!   Now listen, I fed myself and 3 kids for just over 8 bucks. I'm not going to complain about that at all and I'm thrilled to know that this place is there because everything in that area can be a bit overpriced and everyone isn't rolling like that to buy a $15 pizza and even if you are, maybe you don't want to splurge like that on any given day for any given reason.  It's not gourmet pizza. It's not, put your pinky up while eating pizza.  It's, I'm hungry, I need some food in my belly that's at least average and I don't feel like breaking the bank or I ain't got bank, so there pizza! Now if only they'd work on their air conditioning in there. It was warm and muggy inside and had a tinge of dinge smell. There are TV's all around so I was able to watch some of the World Cup match as well.  So take it for what it is. You'll either love it, like it or hate it.  That is all!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "bv2Q8Y6WdfUpX3sDHyTq9A"
  },
  "PYXExXed5v8-IM8vVW9Iwg": {
    "date": "7/19/2015",
    "text": "not awful but definitely don't think it's worth they hype mainly because the crust is really bland.  service was prompt and folks were super friendly just not a $15 pizza in my opinion",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OY5cnjeqUqsDEWga0o03dQ"
  },
  "BWqnH9uC6Rn6HMtgGi2-Jg": {
    "date": "3/21/2010",
    "text": "We went here before the Globetrotters game. Service was quick, a cross between cafeteria style and table service. The salad was decent. The pizza had good crust and toppings, but was the cheese real? I'm not so sure. I had the worst case of indigestion I've had in a year, but it could have been from something else.   Decor is early gas station, right down to the Sinclair and Pure signs. They had a big screen hanging from the ceiling with a projector showing the NCAA tournament.   I have tried the one on Central and the one on Davidson before, and remember about the same experience. They're all okay, I guess, but not my favorite pizza joints.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "drRKxFz7aO0vuaoL9Aun5w"
  },
  "oXcmTYGkt7oLp0GciAiBuw": {
    "date": "10/11/2014",
    "text": "I was highly disappointed when I came here today. My roommate and I had been to another Fuel across town and it was phenomenal. At this particular location, we had to wait about 1-2 minutes before even being acknowledged at all-- there was no one in front of us. As if that weren't rude enough, we were greeted by a negative attitude by the person at the counter when they finally got to us. When I was asked what I wanted, I began to give my order, but was abruptly cut off as the person left the counter and began preparing my food (even though I was going to say I did not want specific things in my food.) As I attempted to pay, I was told that my card was declined, even though there was enough money on it. When they brought out my food, I realized that they forgot my cinnamon knots. Come to find out, they never even rung them up. One lady behind the counter was very kind and gave me those instead of making me have to pay (the rude woman made them without ringing them up) When I began to eat my food, I realized that it wasn't fresh tasting, or fresh feeling. I'd waited all of that time for stale-tasting food. My roommate ordered cheese fries and they had a VERY tiny amount of cheese on them. We were both thoroughly disappointed with this meal and establishment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLyCRr7txzfGUUdJhm9-1g"
  },
  "4F4zTXy-NuHfzOrBYZgCzQ": {
    "date": "2/4/2013",
    "text": "I was actually pleasantly surprised by this place... not sure if it's because is was 1am, but the pizza was great and fresh. Prices were reasonable, location is great, and the garlic knots were yummy. I'd definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIqlNe1oHxmdvA9q9wMF3A"
  },
  "yTZU797J3P_Vm9eO078WMQ": {
    "date": "3/2/2010",
    "text": "While attending a trade show in Charlotte, I had a few minutes after setting up the booth and needed to grab a quick bite.  and Fuel was just that.  I had a slice of the Extreme Pizza (all meat) and a Hawaiian slice (ham and pineapple).  The toppings tasted fresh enough and the sauce was ok.  The problem is that the crust tasted a little to fast food to me.  It was crispy but there was something about it that reminded me of  domino's or papa john's.  Overall, I'd go back for a quick bite, but I wouldn't expect much more than that,",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "q37opa-mPxMSvjCtGvs2IA"
  },
  "D3-yDLEZs7G6FIEoLCwCxw": {
    "date": "10/1/2010",
    "text": "Is this a chain restaurant? I honestly have no idea.   Let me start off by saying this. This is the best pizza in Uptown. With that said, the pizza is just okay.   It's a shame that there's really not good pizza in Charlotte. The Hawaiian pie is okay. The cinnamon-knots are the best thing on the menu.  If you NEED pizza, I'd go there. Other than that, don't go out of your way.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3CuQAXA_sulXrehQW0B0w"
  },
  "tjP7LgicfPZtj4kOpy6vsg": {
    "date": "2/6/2010",
    "text": "I was in town for a conference, and we were looking for a place to go for dinner.  Downtown was deserted, and there were very few places that were even open within walking distance.  We stumbled upon Fuel and ordered a spinach, ricotta, and tomato pizza and some buffalo wings.    The pizza was good (crust was a little soggy), but the wings were excellent... and I have tried a lot of wings.  The atmosphere is very low-key and casual, and the prices were reasonable considering the downtown location.  A great option for travelers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysOqNklxuSZPQagfd8cUzQ"
  },
  "AAZf-okES35gyPPXU4HSgA": {
    "date": "10/17/2013",
    "text": "Meh.  That sums up the pizza.  I've had better and worse.  Location is good, comfortable interior.  Only had the slices, nothing else.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_ZdvmRtxzdPhLfKuAweS8Q"
  },
  "cGmdRll25H96nWZxw2C0Qg": {
    "date": "2/21/2009",
    "text": "One summer I decided to get in a fist fight with my cousin at a family reunion. He's a lot bigger than me and had a lot more people on his side. Things weren't looking good for me. In the end, my cousin fell backwards and broke the small of his back.  We were traveling from Chapel Hill to Spartanburg. And look, we ALREADY KNOW that we are eating at Pizza Man in Covington, La. tomorrow night. We explained this to the parking lot attendant after pulling over in Charlotte and even HE thought it was weird. Fuel Pizza did not have a lot going for it, but in the end, the parking lot attendant stumbled backwards and broke the small of his back.  First of all everybody, we were floored by the really fun looking Charlotte skyline (and we are skyline enthusiasts to the max, bro). Then we were floored by the really fun Za at Fuel. The food came out fast, it was inexpensive, and was located in a fun spot in the city. Not far from the interstate. It was everything we wanted. We were so satisfied with our experience that we went back in time and warned my cousin about that banana peel and I ended up getting punched in the face.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2OE7uUsx5VDshFzPFK6XUQ"
  },
  "nGTlPhVhaVSDQL8hGkGjlg": {
    "date": "1/11/2014",
    "text": "I tried this place for the first (and if the other locations are the same, my LAST) time!  I ordered a combo of 2 slices, 3 garlic knots, and drink.  The price listed over the counter said $7.99 but when I got up to the register, I was informed that since I had ordered pizza slices with toppings, it would be extra.  I told the guy that I think the total charge of over $10 was incorrect and he stated \"the price above the counter says 'starting at $7.99 - that's only if you get cheese pizza but you got slices with toppings.'\"  I told him I felt this was very misleading and deceptive.  He told me \"we don't set the prices, mam.  That's up to the owner\".  BTW, there were no cheese slices in the case so I think this is a crappy way to upcharge customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "milixvI3Oy4lMhOO4TkZCw"
  },
  "BbK_K0xkaRM4Cs3o5pIvyw": {
    "date": "11/7/2012",
    "text": "Don't order the subs. They don't heat them all the way through so the ingredients are still raw and in some cases cold. Blehh. On the other hand, the staff are nice. I didn't try the pizza.  My advice: go find an ATM and then go to Lola's around the corner instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N13m1drJj_nLtVdsWQNW1A"
  },
  "3ms4kj7wayMeLFKfxJpb1Q": {
    "date": "11/21/2008",
    "text": "Coming from Chicago, I'm a pretty big pizza snob. I just haven't found much good pizza in Charlotte. I'd say Wolfman's is the best, and Fuel is among the worst. It's just not very good. I think I'd enjoy a frozen Digorno pizza much better. I really wanted to like Fuel. Their locations in old rehabbed gas stations are really cute, and there are locations all over, including one that is about a block from my house. But I've just been disappointed whenever I tried it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "obDlv2rubNvTQJ3SrwWRrw",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/obDlv2rubNvTQJ3SrwWRrw/o.jpg"
      },
      {
        "img_id": "sBhaSs0Dnl_LEZoian5PQQ",
        "caption": "Photo of Fuel Pizza - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sBhaSs0Dnl_LEZoian5PQQ/o.jpg"
      }
    ],
    "user_id": "aYF3NR0KpOkPfMbWIrFzmg"
  },
  "iBeE8X9Jua5WVJHv1CanCA": {
    "date": "11/5/2008",
    "text": "The lines get pretty long at lunch time, but otherwise, I've had great experiences here. Even when the lines are out of hand, the staff is used to it, so it moves along fairly well.   The pizza is always good, particularly the whole wheat slice with veggies, and I also enjoy the cookies, which they'll warm up for you in the pizza oven. The brownies are huge and chewy and gooey as well, and the garlic knots are nice. I actually like everything they serve on the side at Fuel kind of better than the pizza itself...but the pizza isn't bad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhWPrEBzorygXA4TpimQ3g"
  },
  "XZNH56hiiP_qUbcA4cPm7Q": {
    "date": "9/26/2010",
    "text": "Fuel is a great spot to grab a quick bit.  They have a yummy thin crust pizza and lots of the usual choices.  Their garlic knots are tasty too.  You won't wait too long or spend too much here but will walk away satisfied.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "N_WB5usUFVBYI_8g7nnh-g"
  },
  "B0DRJrr9PKiotGtp6_l6Eg": {
    "date": "6/2/2011",
    "text": "Wasn't impressed with the pizza, although they had pitchers of beer for $8. The crust of the pizza was good, other than that, I wouldn't go for the food. Just a nice hang out spot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "amPfWTRlngnKwhyzkiT4HQ"
  },
  "va8cduY9iztJ3Z47Xs2fwg": {
    "date": "8/31/2010",
    "text": "The service was not that great. I got 2 slices of pizza and they reheated them. They were still cold when they gave them to me. Not the best pizza place in Charlotte.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ABlYdZLiNDSE2zX1_HBZbw"
  },
  "m5P8aFN78b6ZnjGoliCiuA": {
    "date": "12/1/2011",
    "text": "This place gets everyone wrong.  If you order online, you get there and they tell you the online menu doesn't match the real menu.  So you re-order and wait.  And wait.  Then you inevitably get the wrong order.  Check the number of slices you get!  If you ordered a side item, they are probably out of it.    Last time I was there I got the wrong order FOUR times.  I called them out on it each time, got a replacement, and was still missing a slice when I got home.  They told me it looked like one large slice, but was actually two.   It wasn't.   The service is terrible and the food is pretty bad.   Avoid this place.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vwj9TShCS2jr81rJyD7GCA"
  },
  "kkswtbo4617Tc_29nAgPOg": {
    "date": "1/21/2013",
    "text": "We came here because we heard it had good wings. We felt like some pizza, so combined the two and ordered the buffalo chicken pizza. When we did get the pizza, I was disappointed. It wasn't horrible, but I've had better buffalo chicken pizza. For food, I would give the pizza 3 stars (I still want to go back for the wings though). They get an extra star from me for the customer  service. When we got our pizza, they brought out a BBQ chicken pizza. Usually we would shrug off the mistake and enjoy anyway, but we happened to be in the mood for something spicy. They not only apologized, but boxed the BBQ pizza and gave it to us for free while they remade the buffalo pizza. I was impressed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "8xXrqsdnvXqujnmhX6NcJw": {
    "date": "8/30/2010",
    "text": "I was staying at The Westin across the street. Stopped by at 7pm on a Monday night and had the place to myself. Ordered 9 wings (for about $6) with hot sauce and they were delicious.   As for pizzas, I blindly picked the Hero Pizza, which came with cheese, ham, sweet peppers and onions, but no tomato sauce. In hindsight, I should have stuck with a basic pizza. It was nice, but dry. The \"small\" size is definitely enough for 1 person.   The place has friendly staff who stopped by to see how I was doing.   Overall - would definitely go again if staying at the Westin, but would pick a more traditional pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0xKG3ziMO2wSftjqdCDWg"
  },
  "U1JJ7h5np3ZjVZ545RaDFQ": {
    "date": "4/25/2009",
    "text": "Decent Pizza and bread sticks. Glad to know of a place with root beer in Charlotte. Went when moving a friend to Chicago. Took about 30 minutes to get the pop we spilled cleaned up though we did move tables. That was weird!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i-CZiG-fDcvK5vc4-pwMKg"
  },
  "qVIVK1AY4Ath0A6Jnmg_Zg": {
    "date": "4/27/2014",
    "text": "Literally watched as my pizza came out from running through the oven and it sat on a table for a solid 5 min before they ran it out. They brought out the wrong thing for my friend. Pizza was mediocre garlic knots were good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9gW6Z0_o7-36P5MyYnoig"
  },
  "6o-iElqNWwXPl3ydZqLgnA": {
    "date": "6/13/2012",
    "text": "I've been to this Fuel location twice in the past few weeks, and I was disturbed by how rude the service was on both occasions. One guy in particular stood as as especially unpleasant.  I'm sorry, but even if you do have customers standing in an awkward spot, scowling at them and informing them that they are \"in the way\" is not the proper manner of handling it. I'm sure the location gets a lot of drunk assholes late at night, but when it's 6 o'clock in the evening and you're dealing with a paying, adult customer, you need to at least fake basic social graces.  Other than that, it's Fuel: decent-to-mediocre pizza depending on your luck. Sometimes the pizza takes WAY longer than you'd expect. Just don't ask about it, since it seems to make the employees crankier.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "t7JXSHEXs2vBvYvs8wN3pw": {
    "date": "3/20/2016",
    "text": "Live in uptown Charlotte and decided to try delivery order.  It took them about 1 hour and the pizza was cold.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fViZSUgD9nQv5YYSJAttXw"
  },
  "2hhyoMb0QYV3iqcdbN_qkw": {
    "date": "12/22/2014",
    "text": "This place is a great stop before a Panther's game. It's with in walking distance of the stadium and the food is decent. The pizza is served mostly by the slice. The prices are what you'd expect for a restaurant right in the heart of downtown. I enjoyed the garlic knots and pepperoni pizza but wish I had tried the spinach and ricotta. The place is very clean inside and has the feel of a on the fence upscale pizza place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ObiziSOIAkXHCue5POoZLw"
  },
  "Koy08AasrOVZhWZSAFz6ig": {
    "date": "2/1/2016",
    "text": "Only reason I am giving 2 stars is because the delivery driver was super nice and I gave him a good tip prior to receiving my order. I placed an  order at 2:00 on a Saturday. They were fairly quick, but the pizza looked and tasted like it was maybe a week old. have heard great things about this chain, but I was not at all impressed. Maybe dining in would have been better. I am new to the area and probably will not return due to my experience.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n1RHxEW5371JTCFj0Y0GCw"
  },
  "hzSIIQ9i5F9a2luFYZ72QQ": {
    "date": "8/3/2015",
    "text": "Went to Fuel Pizza for a dinner takeaway on my second night here, since it was just opposite to my hotel. Their menu was vast, with lots of customized orders on pizza & variety of sides. I just ordered BBQ Chicken pizza 12' with no extras & it costs around $15. They used fresh hand toasted crust, with roasted chicken, lots of cheddar cheese & red onions. I felt that pizza was just decent & didn't justify $15 for me (my thoughts though). Quantity of meat could have been more & cheese could have less. Not sure if i visit again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOAzmaTUAw_6INpYkCohYQ"
  },
  "nqVK9bLKUSXLmB0SWcDKxw": {
    "date": "5/25/2015",
    "text": "Came here for lunch with my family.  Friendly, courteous service, but most importantly,  loved the pizza.  Also had a side of Fries that were excellent.  I really liked the old gas station theme, too.  Kind of cool, but not too in-your face.   You order at the counter and they bring you your food, which is my favorite way of doing things.  And prices were very reasonable for what you got in an area of pricey real estate.  I was from out of town, but were I a local, I would definitely be back as a regular.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VhidDtJsUlFnJ-JYy82S1g"
  },
  "u-jbC6i_2jW9YYV0HnCyOA": {
    "date": "9/13/2015",
    "text": "So this isn't the first time I've had this happen.  I live within walking carry out vicinity of Fuel and they usually shut their doors about 30 mins early if not an hour every time I've tried to order.  I guess they enjoy laziness and not making money because if you can't stay open for a carry out order then why be in business.  It's no wonder Dominos and Papa Johns's make it to the next level.  They grow through quality of workers and professionalism.  I wish I could give 0 stars to the lackluster wanna be local pizzeria.  Don't put hours of service on your door or website if you can't maintain them.  Needless to say I've had my last Fuel experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XmdyWCEgGQHVxVdATzSEZg"
  },
  "SCgzpPNpnPYD9Dtf-Jd0gg": {
    "date": "7/25/2012",
    "text": "Delish. This is what Charlotte boasts as its best pizza. Evidently started by a couple of New Yorkers. Let me start with an analogy, and then work backward.  Let's say some North Carolinians couldn't find any good bbq pulled pork in New York. So they start a restaurant. It wouldn't be quite as good as the stuff from home, but you'll go every once in awhile just to feel like you're home. That's what I would say Fuel is like. I'll stop lamenting about all pizza out of New York now.  The pizza here is good. The crust is foldable, the toppings are fine, and the cheese is greasy. Sauce is present but not wholly memorable. Pizza is baked and reheated in one of those rotating oven assembly-line cooking things, a la Quizno's.  Essentially this makes you the Quizno's of pizza.   Okay, I did it again. Seriously. It's good stuff. The thin crust looked awesome. Can't wait to try it next.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuVrNmt7_WtBn1uz5L_p0g"
  },
  "oPVEqBMy44EfyaCwnRb6QQ": {
    "date": "6/29/2014",
    "text": "Pizza that you can get at 3 in the morning if need be after swimming out of the College Street bars. Or, if you happen to be visiting the library or discovery place, a great place to take the kids for a quick lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fOsZN-k8buc1l6liGXegyA"
  },
  "23jqKimO5GMKURAk1fImeQ": {
    "date": "9/4/2012",
    "text": "Fuel Pizza (uptown) Gets 1 star for being in uptown Charlotte' and another star for good customer service. Too bad the pizza is bland and flavorless, the side salad is colorful but lacks a good dressing to at least put it over the top. I thought the combos were too expensive for a pizza so flavorless and unexciting.   You can get a totally awesome tasting, HUGE, super slice of pizza for $6.50. Here you'll pay almost $8.00 for a drink, salad, and a decent size slice. I would say go to Sabarro's instead. You'll pay just a little more, but your meal will taste waaaay better.   The decor is interesting, but looks unfinished. The restrooms are clean, but they look nasty, with graffiti and poorly placed bathroom fixtures. I would think a \"theme restaurant\"  located in the heart of Uptown Charlotte would have a better looking design. Its a mess here. Glad I don't own this restaurant, I would be embarrassed to have it in my portfolio.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rm6QBa-29dOi9C5kQxNGZQ"
  },
  "P22fyriDln4Fx4rUU2nvMA": {
    "date": "1/28/2014",
    "text": "If by somehow you have made it to this Fuel Pizza, you are more than likely hammered just getting out of the bar.  While the pizza might seem like the best pizza in the world, its not.  That is alcohol fooling your tstebuds.  Its's just mediocre fuel pizza",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "2Or6Ay4uWGjEjm_y3SqkYw": {
    "date": "11/7/2014",
    "text": "Delicious sauce. Absolutely delicious. Definitely get garlic knots so you can get a cup of sauce on the side. Ask for extra sauce. The spinach and ricotta pizza is great - there are better pizzas but not by much. They clearly use all fresh ingredients. The owner is fantastic!! Loved him.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pJgbMA85jPLPeQdAQm2qOw"
  },
  "P4mv6REwNdjqGC10qUMLQg": {
    "date": "4/18/2011",
    "text": "Meh is definitely the word.  I ordered online for delivery service this past weekend.  Apparently, their website menu is not coordinated with what is actually served at the restaurants.  For example, I ordered a combo meal (1 specialty slice, garlic knot, and a soda) and they called to tell me they didn't have the specialty slice I selected (even though it was listed as the one made each Sunday).  The delivery driver then told me that they don't deliver pizza by the slice usually, and that they still haven't adjusted the online menu.    Garlic knot was hard and stale.  Pizza was luke warm and nothing special.  They forgot my soda and didn't give any napkins or plastic forks even though I got a side salad.  Unless I got a little buzz goin' on at 1AM on a Friday night, Fuel won't be getting a call again from this chick!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WPNPOHwyyzDH2QBI9ketcg"
  },
  "C3fXEDrokEepYB57y58TUA": {
    "date": "7/23/2015",
    "text": "Pretty weak pizza, pre-made slices always looks super stale...not a very good spot",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bPD81iTD394hjbVp2g4aGg"
  },
  "UXIpGOe36s0enmxwGlBLWg": {
    "date": "3/1/2014",
    "text": "The Garlic knots are good and so are the wings and meaty pizza slices...$8.55! I had the \"C Combo\" with the meaty slice and the salt, pepper & garlic boneless chicken wings...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jqip7VBbQ_pmlDvajffR5g"
  },
  "RSrQZiVIfX27Fhh_jnNh9g": {
    "date": "12/29/2014",
    "text": "So I give this place two stars because the food is good but I ordered delivery at 7:20pm and was told it would be a 30-45 min wait. At 8:08pm I called the store to remind them to call upon arrival to make sure I know that they were there. At this time I was told that the the delivery driver had already left for my order. At 8:20pm, an hour later the delivery had not arrived and I called again. The person who answered was extremely rude and I hung up and called back requesting a manager who said he would check with the driver on the status of my pizza. At 8:32pm an hour and 12 minutes later the delivery driver arrived with the wrong order because they ran out of something that I ordered and never had the courtesy to let me know on the 3 calls that my order would not arrive as I had requested and paid for. I never was given a receipt to sign and was not able to ensure the driver was tipped. I hope I am not screwed out of my money.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zyimZfccgvaZkti9IK_7Zw"
  },
  "nSwaqMW748017zYuyRROAQ": {
    "date": "2/6/2015",
    "text": "Talk about the worst fuel pizza I've ever been to... just walked in from the boat show was there at 630 pm on a friday.... there was nothing but 2 slices of 4 types of basic pizza....they all looked crusty and old. I asked the guy behind the counter if they were going to make buffalo chicken pizza tonight the nasty Hispanic man making pizza was asked by the guy we asked nastier and short he said no only with full one.... looking at the regular slices how crusty they looked I asked if they were going to make fresh regular pizza ....Nasty Hispanic one again nasty and short said ...NO. ..REALLY DUDE...WTF DO YOU MAKE SINCE YOU APPARENTLY HATE YOUR JOB AND DON'T WANT TO MAKE PIZZA. ..We left and we will go somewhere else and never go back there....maybe he will be happier at taco bell because clearly pizza is not his game",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lUqTwRE2fZ9WzJu-jDHeA"
  },
  "cvkg9vuYhNt8OXJ2vAdtZA": {
    "date": "10/10/2011",
    "text": "They are the fastest delivery pizza I have ever had...I travel a ton and often use delivery for late night food or just on busy, lazy nights. I have ordered from here 2X (once last week & again tonight) both times the pizza was piping hot and delivery exceeded my expectations.   Tonight the gentleman even called just to make certain I wanted the pizza tonight - I guess their system showed tomorrow. AWESOME!   Pizza tastes good too and they remember my drink, which companies often forget too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3mwDKPB6gTe_a3V0SDzc9Q"
  },
  "DlIRJy2lU7EPj2J57wrQyQ": {
    "date": "11/9/2012",
    "text": "I was not impressed at all with Fuel. The pizza was dry and flavorless. The only spark of a positive was the wheat veggie pizza. It felt healthy, but still was lacking any flavor.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dozxQ9MFDSLCuvcmt1Wi5g"
  }
}