{
  "F9iLNxl8soJcXqD6i2iqxQ": {
    "date": "3/4/2013",
    "text": "Decent but beware many many kids. A private school is near. If you don't mind snooty rich kids then you're ok",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOWlt_27s4YoD1xATtqy5A"
  },
  "1HC-ctejIdxR-5ScpconCw": {
    "date": "2/16/2015",
    "text": "This large company has it' shit together.  They infused self-serve high tech computers, to rush your wait time along. I find their ingredients to be fresh They seem to always be re-inventing their menu to cater to what the current eating trend it.  Right now it's healthy. New broth bowls are incredibly flavorful. .  My only suggestions would be more affordable prices. Maybe Mondays could be 2.99 bread bowl special or something.I would be nice to see some vegan bakery items. Lets get into the times!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "EuUlaEeuAJ1RPXriKT5RFA"
  },
  "zJC1vY3kxSfa_tPZ8ihTVw": {
    "date": "10/15/2013",
    "text": "I typically phone in my order which is quite cumbersome at times. Lately they've only started making my order when I arrive! It took 50 minutes from the time I called until my food was finished recently. To top it off, the order was incomplete and I had to go back inside. I'd suggest checking the bag thoroughly before you leave. Staff seem disinterested, but the food is good",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ii6q96qK5yCnz-ci5xxsWw"
  },
  "2wcjoFUtiNp4KT3F7gWn9Q": {
    "date": "8/7/2014",
    "text": "I eat lunch at this location at least 3 times a week and the staff is always trying hard to please everyone and they are running around frantically. The biggest issues with this location are NOT the employees, it is the customers and SQUATTERS!!! Why do people think it is acceptable to hold sales meetings there and don't buy anything? They take up about half the tables at lunch and about 2/3 of the parking lot. then there are the PIGS! Those that feel they can eat and make a mess then get up and leave their dishes. Your mother doesn't work there so clean up after yourself!!! People in the Ballantyne area in general are arrogant, rude and obnoxious but they are at their worst at Panera!!! Employees get a +++ while customers get a HUGE thumbs down!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_AHNHruuGKVFQIr-hc1xqQ"
  },
  "sHS3WDl7VYw6GXTTpYdZRg": {
    "date": "2/18/2013",
    "text": "Every time I go there they are always out of the four cheese souffle which is my favorite thing there! And I always come in like 30 minutes after they start serving breakfast so they should not be out!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttXN084ZwQD9rG-Avnl8tw"
  },
  "EUFnmiEhv31KVf7wFUEfSA": {
    "date": "6/16/2011",
    "text": "WORST CUSTOMER SERVICE!!  I ordered black bean soup but since they were running low and too lazy to warm up more, they gave me a partial portion and filled it with (what I hope was just) water to make up the volume.  Once I got home and began to eat it IT TASTED TERRIBLE!!  It was beans with a layer of dirty looking water.  I called the restaurant and spoke to the manager who treated me like I was a bother to her.  I was so insulted!  No apology.  That was worse than the soup!  I will NEVER spend another penny at this panera!!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PN6lYym62G8NAaXgbMaSpg"
  },
  "pyhKX9pi26zb4CSqXMgTfg": {
    "date": "8/2/2008",
    "text": "Panera is a great spot to go to for breakfast OR lunch. Even when it is super busy the line moves pretty quickly, and their food is always on point. In particular, their soups and salads are really good. And if you go for breakfast you HAVE to get the pumpkin muffin top - YUM!!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xbK4oJBRsMYqUEqDQiitUA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xbK4oJBRsMYqUEqDQiitUA/o.jpg"
      }
    ],
    "user_id": "UNSUk0fGl4vhMziQT4qiaA"
  },
  "wqM1yQf12JtP8Sq3_Tyt9w": {
    "date": "1/12/2014",
    "text": "Panera Bread is always a good bet for fast, fresh casual dining.  We tend to end up here instead of McAllisters because the ambiance is nicer.  The staff at this location is friendly and the food is served quickly.  I do find it frustrating that this particular location always seems to be out of bread bowls when I'm craving soup on a cold or rainy Friday (the only time I really think about soup in a bread bowl).  It would seem that the manager would be able to tailor their baking schedule to take advantage of that.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eVQlC1RiB1tYOQGmtUmjPg"
  },
  "E0wVQ-K0zXW7SpFqWg5xVg": {
    "date": "2/17/2015",
    "text": "When I'm home during the week I do lunch take out here all the time. It's straight money every time. I order on the self serve kiosks and avoid the long lines. Out of 50 visits I've never been surprised which is good when you're in a hurry.  If you don't get there by 11:30am the parking lot will be packed. There is a free parking garage to the left of the place and a short walk. You can cruise the parking lot for five minutes and a spot will open if you're not the waking type.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_xTWcnojNYmdbMO_WNlVA"
  },
  "2m84qoBvPFjvhgyd01LWTw": {
    "date": "6/12/2012",
    "text": "Went there for a cookie in the afternoon, although the place was nice and clean, the stuff was friendly, but the cookie (Chocolate Duet with Walnuts) was way too sweet. I was just curious, checked on their website, there is 36g of sugar in this little, innocent cookie!!!! Won't go there again!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n_ogjdaLE_NbUxrquEtxvw",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/n_ogjdaLE_NbUxrquEtxvw/o.jpg"
      },
      {
        "img_id": "xiQe7-22RN1WrZnXtxW-6w",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xiQe7-22RN1WrZnXtxW-6w/o.jpg"
      },
      {
        "img_id": "ioT_mJIfvACnf15Fr4AVnQ",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ioT_mJIfvACnf15Fr4AVnQ/o.jpg"
      }
    ],
    "user_id": "F24FcMj0RMeUGQB_eZu3wA"
  },
  "pzvNq9Q0U7HAuAiSSIF1nQ": {
    "date": "10/17/2011",
    "text": "I had the worst worst boxed lunch from Panera today. It was such a disappointment because usually they do a good job with our catering orders.   My office ordered from the catering menu so you get what they call a boxed lunch.  On the catering menu, they describe the boxed lunch salad as your choice of Premium, Signature or Cafe salad served with 1/2 of a baguette (plain or whole wheat) and your choice of cookie.   I ordered the Thai Chopped Chicken salad - which I have had before and the first time I loved it.  Sadly, this time it was just gross.   When I opened the salad, I noticed immediately that they had forgotten the low-fat Thai Chili Vinaigrette which is usually included in little containers on the side.  Oh well, no worries, I'll live without salad dressing even though last time I thought the chili vinegrette was pretty tasty.    But then I bite into the salad and there is something gritty.  I take another bite of just  chicken and again, there's the grit.  It was also in the roasted veggies.  Did they sandblast the chicken & veggies before grilling them?  Yucko, big thumbs down.   :-(   I really don't know why they advertise that the salad boxed lunch comes with a portion of baguette, but they don't serve that - instead they throw a bag of potato chips in which is a weird accompaniment for a salad.    And my final disappointment of this meal, despite the fact that I requested a toffee nut cookie, they have given me an oatmeal raisin instead.   Oatmeal rasin is ok, but if I am going to splurge and indulge in a sweet treat, I'd really rather it be the flavor I ordered.   What's up Panera at Ballantyne?  Hope next time you do a better job.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "Ya8dhJ7qGb4C37yR4xlO8w": {
    "date": "3/23/2017",
    "text": "I went in this Panera and was very nice to the manager Duane but he was very very rude to me I had a few questions and he rolled his eyes and made a face to the girl he asked to help me instead.. clearly he's a dumb idiot who didn't know the answer to anything about the panera rewards he gave me a bogus answer just to get me out the way and made a face which I don't understand why !!!!! Can't take a couple questions then maybe you shouldn't be the manager!!! I kept it classy since there were people in there of course he was sooooooo mad haha he showed his expression all over his face!!  .. that guy represents trash I see why he probably makes less than 20 an hr .. COMPLETE GARBAGE!!!! For that reason I'm done with buying Panera I came to that location twice yesterday and I'm Sooooo happy I don't have to deal with an idiot like that in my everyday life!!! ^_^ will not be attending this panera again I wanted to throw a banana at the guy!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDU-RPzThkUiD65jJHz6Yg"
  },
  "PFm35ltJup-GYkK5ljTIiw": {
    "date": "5/2/2016",
    "text": "I will NEVER go back to this location  . My delivery order took an hour and a half to make it to my location, my soup was spilled all in the delivery bag and was cold. I returned it with the delivery driver for a credit to my account. I called over there to speak to a manager where CHUCK helped me on the phone. He was very rude, told me that there was no more compensation besides a credit. I explained that other food companies take care of their customers, and he said oh well. I responded with that I won't be back and he hung up on me. I'm very disappointed in his customer service to a customer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zoZJuDHe97r_ICixj4c7wQ"
  },
  "0en9Sz8tVFS6NY40g9TkZg": {
    "date": "4/27/2016",
    "text": "HORRIBLE Experience. I ordered online with few of my colleagues at work and was pleasantly surprised at how quickly our food arrived. Unfortunately that happiness was short-lived once I bit into my half cooked steak & white cheddar sandwich. The meat was literally pink. Wow... any other time this wouldn't be so horrible, however at this moment I am expecting. I calmly called the restaurant and explained to Doug (the manager) what had happened and honestly, given the situation I figured they'd send out a fully cooked sandwich but... WRONG. He actually asked my address and said he'd send me a voucher...??!! Seriously... I'm 6 months pregnant Doug, I'm hungry now. So here I am... in the office typing up this review as I nibble on kettle cooked potato Chips. Way to show that you all care. This will definitely be my last time ordering from them.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oCtxLLhPrXP7TYJMxlfTRg"
  },
  "smhDbgD_xoaeuYFkub5tOw": {
    "date": "2/15/2014",
    "text": "Great food, always fresh and consistent.  This location is packed, but the new digital ordering at the entrance is a great time saver, though I wish you got a receipt then.  You pick 2 is my favorite - greek salad and Cesar salads with a sandwich is my favorite, and their bread is great, always fresh.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPZcg_4iu35i-MeMY0e5Mw"
  },
  "sk2htUvGfTlrRNk5QILWHQ": {
    "date": "3/3/2013",
    "text": "Good, consistent food and service.  Parking can be tricky here.   Not my fav Panera location, because I think half of Ballantyne \"works from home\" at this Panera!  It can be tricky to get a good table due to all the laptop entranced \"customers\" with nary a coffee cup in sight.  Last time I was there with my quiet, well-behaved 4yr old, a woman on a conference call grimaced as we sat down next to her and she proceeded to change tables.  We didn't walk into your office woman - this is a restaurant!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 3
    },
    "photos": [],
    "user_id": "iWoCUArqFmXvTBM2jsMs5g"
  },
  "9r8ljCigBjW939kKtlIT5g": {
    "date": "11/17/2015",
    "text": "Prices on the high side for what you get, but always consistent. Use the online ordering, and your order will be ready for you to grab and go. You can even order online and have them bring it to your table! If you order at the indoor kiosk, don't forget to grab a cup and get your own drink...that part is self service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qVU31qHKgSgGCzKsQ860EA"
  },
  "DKPMlbCGJpEFXyqiJNIMUg": {
    "date": "10/13/2011",
    "text": "This is one of the larger Paneras I've been in.  The restaurant is laid out well too.  Everything is in order as it wraps around the back of the restaurant.   And like many other Paneras, it is difficult to find a seat during the lunch rush hour.  But the food is consistent with other locations and that is what is important.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "hcsraWggr3Kxa3OJrEQS3A": {
    "date": "3/14/2011",
    "text": "Consistency...  that's a good thing about Panera.  Whatever location you go to in Charlotte (or anywhere else) the menu and their offerings stay the same so it's a pretty safe bet if you are looking for something comfortable to choose from as a far as menu offerings go.  I had the sesame chicken salad and it was good as always.  Light on the dressing and tasty.  Didn't have a bad experience, but it seems like there is always a line.  Probably a good sign, but it sucks when you are trying to save some time and be somewhere else.  This location is pretty busy.  The parking lot is very awkward.  I think they were going for the \"what looks pretty\" versus functional.  If you can navigate into a parking space, you should be good to go.... just watch out for those other... (cough) Ballantyne drivers and the possibility of damaging some pricey vehicles (even if it isn't your fault).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "53_rYNm0LsxlG_r3kllHTQ": {
    "date": "9/14/2016",
    "text": "I love Panera 's food but the service at this location is seriously poor. I have a mobility challenge and so I ordered from the outside table using their app--which is a great idea! The manager delivered my food to me with no silverware and no drink. He said I could go inside to get my drink. Does that make sense when I ordered from the table to avoid going inside? He did bring my silverware finally but no drink. Again not my favorite place and its Due to the poor service and lack of common sense",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z2QL3ejICD3Ud8TAAn-0Sw"
  },
  "vvPEg_C8VBJgXtkl_N5KxA": {
    "date": "2/18/2013",
    "text": "Standard Panera. Good food and yummy bakery items. I'm here all the time, and in my opinion, that's enough of a review!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UZ-jh-H84fdCt4R2Xugz0Q"
  },
  "Bs57wbruJ20iOM2B1oSQ2g": {
    "date": "12/21/2015",
    "text": "Service was poor. The young girl (Blair) who checked me out for my cookie was extremely rude! I proceed to her register, I ask for a toffee cookie, she screams \"are you talking to me?!\" With an attitude- lots of \"Tude\" Wth- I'm baffled as to why she is yelling- I'm thinking ok maybe she has a hearing problem or something. But no, she apparently thought I was on my phone because I had one ear piece in my ear- really lady, I'm going to ask someone on the phone for a toffee cookie, when I'm standing in line with obvious eye contact with her. Smh. I just don't get why she was so unhappy that day. Nevertheless management just needs to work on customer service with her- it may have been a personality thing, but I'm in customer service and I always tell my employees \"leave your attitudes and your problems in the car- when you get off work they'll still be there waiting on ya\"... But seriously there was no need for the attitude and poor customer service from her. I simply just wanted a toffee cookie - that's it!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HRnijJrf9ArEcB2KZhdbeA"
  },
  "_QyfvlC50BQOLIGsq-9F5Q": {
    "date": "11/4/2014",
    "text": "Oh Panera, what can I say--you provide some tasty morsels that get my sugar spiking first thing in the morning.  Your associates are always polished and professional (well except one time, but she was till waking up), your establishments are always clean, and you've never gotten my order wrong.  Good on you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YI5sEimxyYrdeFbmsv_ssQ"
  },
  "iNFpdtjJeuoGcefuWxUspw": {
    "date": "8/19/2015",
    "text": "Came in today to grab a snack and the tables were filthy as well as the floor. This place needs a good cleaning!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rw4MCeeV8-CV4yy54aLqiA"
  },
  "YeJH1WoENMfRXHpkLkqVFA": {
    "date": "10/7/2015",
    "text": "Because I typically love panera bread, I've given this particular location many chances. All to end in the slowest possible service, and the staff always forgetting items or messing an order up. I like to come to panera for faster than restaurant service, but obviously not fast food. For how busy this place is during lunch on the work week, they need better staff to make things more efficient. Not great management here as far as I have seen in my many visits. Will choose other places in the area for lunch in the future",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYUrBLu06bKRAXTbzzdP2g"
  },
  "mF8_X5C0LKcecPBskeCNaA": {
    "date": "7/14/2014",
    "text": "Of course, Panera Bread is awesome, as usual. This Panera has the rapid order line with kiosks to order your food and skip the line! Plus they have a table navigator they give you when you do order at the counter. The navigator tells the staff where you are sitting and they deliver the food to you. This was very different from most other Panera's I have visited in past. I love this feature because I was dining with my young child. This eliminates me having to go get the food during a busy lunch hour and leave her alone at the table. Of course the food was so yummy, as it always is. The staff was also very friendly. I love Panera to begin with, but I will definitely be back to this Panera location solely based on all the convenience and technology in this store.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5cfG8-xLBS0kpYp368306w"
  },
  "1KpVVJoz_6YJIbBFAOKaYg": {
    "date": "4/30/2014",
    "text": "You know how Panera is... Almost as good as what you can make at home if you tried but not quite. This one is no different.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tef2QZD01-tFr8-rwnSkQ"
  },
  "pzxDpovAik_LdIYa-beq-w": {
    "date": "3/17/2011",
    "text": "Man...used to love this Panera Bread when I lived in Charlotte previously. Unfortunately...the service/cleanliness has seen better days. Foods still good, but it seems like they've given up on this location. Maybe it was a bad night (...and I know they're not really a \"dinner\" spot either)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SMJKnaQ1ph88xrP0JCktCw"
  },
  "q5Extlop-D9cWGpD06BQcg": {
    "date": "9/21/2018",
    "text": "Have been getting the chicken salad from this place with extra chicken for a while now and last few times there was only around 4oz of chicken total, when should have been over 7oz....got home last night and same story again, tried calling the place to speak to a manager at 8:30pm and nobody answers the phones....called 8 times and give up, will be calling the district manager, i had enough!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UIDCS4nbiK3ZNDv1U8gvfg"
  },
  "hpXF8VFk3B14Y4X1fuQByQ": {
    "date": "9/21/2018",
    "text": "I ordered my smoothie and never got my smoothie, manager did not talk to me when I tried to get her attention 5 TIMES. Love the Pumpkin Bread but service is terrible",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OzcCpFxC3Tv8vELSeigYFA"
  },
  "Xu4-B5sCt5NdmH3vycd9HQ": {
    "date": "7/9/2017",
    "text": "Great place overall. Outstanding customer service, never too long of a wait and the food is always fresh. I always get the steak panini with a side of the broccoli cheddar soup and I have never been disappointed!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8twML7Mdr-FDyeuNhC8zTA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8twML7Mdr-FDyeuNhC8zTA/o.jpg"
      },
      {
        "img_id": "ZCeuYTHNrexqh0hk3dGcfA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZCeuYTHNrexqh0hk3dGcfA/o.jpg"
      }
    ],
    "user_id": "6EQfwlIiowhdl3wRlFDIDw"
  },
  "hv6-XEhE8zFJAXjdbGlwqg": {
    "date": "3/17/2016",
    "text": "I was pleasantly surprised to see all new menu items. It had been a while since I visited a store. I was impressed. I chose a Caesar Salad, but I wanted to try the oatmeal lol. Salad was good portion great price, fresh, and quite a few pieces of chicken. Even though parking was a little hectic the line inside moved fast and my food was prepared quickly. Will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XBwm_biYDD3ZHAKWBg3BRw",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. Almond quinoa oatmeal. Filling and tasty",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XBwm_biYDD3ZHAKWBg3BRw/o.jpg"
      },
      {
        "img_id": "IhkjEB1Rn8jHkAz3sqlPSA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. Caesar salad with chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IhkjEB1Rn8jHkAz3sqlPSA/o.jpg"
      }
    ],
    "user_id": "nDz9yR9IsPa7YpKeqJXRaQ"
  },
  "apHUxMO1qZvwe4hdIuhRjQ": {
    "date": "8/25/2018",
    "text": "The service is very slow and the order is not accurate. Shame the food is pretty good but not worth the headache that poor service brings.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxZ1M1-sdqezvLCgUcfJqw"
  },
  "Qqz8WtBTgSYBRn8WNKRyCg": {
    "date": "9/13/2015",
    "text": "Pretty poor service here - no wonder they're being replaced by iPads.  Came in around 10:30 and the coffee was emptied. Informed a young employee and she rolled her eyes at me and snapped \"I'm aware\" and stormed away. Didn't get coffee for about 15 minutes, there was a very annoyed crowd. A gentleman let the manager know about the situation.   Not impressed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  },
  "cVv5yxblFPTwLXWoyNm-SA": {
    "date": "7/29/2018",
    "text": "The tables are always dirty no matter what Panera I visit. I always have to clean them. I Do like the food that's why I tolerate it but it would be nice if tables were cleaned off.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PmqNpemlYLn9bfRd-xbLFA"
  },
  "GtTMLoMuNWTxVHqEz_vSNg": {
    "date": "11/7/2016",
    "text": "I won't eat at this Panera again. I ordered their Turkey Chili, which I've had several times before, but this time it tasted like they way overdid the spices. I asked an employee and she shrugged her shoulders and walked up. I ate as much as I could then went up to the counter. I told them I couldn't eat it all as it was too spicy. I asked for a to-go container. Maybe I wasn't direct enough,but she should have picked up that I wasn't happy with the meal. I waited about 3-4 minutes for her to return to the counter (not my table) with a to-go container. Unacceptable.   My wife had ordered the Kale and Quinoa salad, but they left out the Quinoa. When she asked about it they first said it was in there, but on further inspection found it was not mixed in. They gave her a side of Quinoa.   On their receipt it says that if the order is not correct they will promptly fix it and give you a pastry for your troubles.  They did neither.   I like Panera, but as for this location it is off my list.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nm3Zjt9R8UwX_piBonXFmQ"
  },
  "hnumCVhIFZ9cIAHd7NlEhg": {
    "date": "9/26/2017",
    "text": "STAY AWAY IF YOU ARE PLACING A CORPORATE CATERING ORDER! Beyond terrible customer service and unprofessional catering manager, Jen. It starts from the top and trickles down when it comes to management and how you play an example of a good customer service. I placed an order online last minute due to a last min request, I went ahead and placed the order, called into the cafe and asked if there was any way they could honor an earlier delivery time than what was given online. The answer was a hard NO, not a let me see if we can try since we are so busy, or any thing attempting to accommodate the request but I understood. An hour later, i get a phone call from Jen, the manager who tells me not only are they NOT going to honor the 12:45-1pm window I selected online but they were possibly going to get it into me by 1:30. I was very irritated at this point because had I known it was going to be even later, earlier in the morning when I placed the call, I would have ordered from another deli that I normally call and they always seem to be able to help me. At 1pm I then get a call from the \"\"Manager\" Jen again, when she mentions that she managed to get our order in by 12:48 exactly and I answered \"oh wow thank you for getting it in earlier than you had anticipated\". She answered back, \"Yeah so we did and just to let you know, we are never going to take an order from you again, we will not honor your orders\". She claims I yelled at her and I didn't. I was actually very monotone, but to say I sounded, unhappy and completely dis-satisfied, ABSOLUTELY. There were so many things wrong with my experience from the moment i attempted to have them accommodate me for my order. The worst of it all was the way in which she went out of her way to still deliver it and ban me. To say this was unprofessional and grossly personal is an understatement. I called corporate and wrote an email. I have gone to the extent of writing this so that others are forewarned on how TERRIBLE this store is managed. If you want a store that will partner with you when you need the catering service, this is NOT IT. When you need last minute requests because that is part of the customer service aspects, this store is not it. Luckily we have more options in Ballantyne, this will not be it for me.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k24kSTpZHUdEd-QYXLy3fQ"
  },
  "A8yafn7JTJTcCjr7yG0Mig": {
    "date": "4/15/2018",
    "text": "Very disappointed in delivery service.  I've ordered from them three times for the delivery.  The first time took almost a hour to arrive but the order was correct.  The last two times the delivery took1.5 hours to arrive only to receive cold food and missing items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "li1MzkzOLVRXbgP_nbxzAw"
  },
  "m9KU8elF75T7mLiEjHEEzQ": {
    "date": "4/8/2018",
    "text": "Bad experience with dirty dishes and utensils at this Panera Bread.  After seeing my son's Mac and cheese bowl with dried up food in the bottom that was the last straw.  It was so bad we had to ask for a refund.  We will not be coming back to this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rPLRG4fz_u5bdr7vG99oCA"
  },
  "r7jSd63ojtwTdkcFwTMlwA": {
    "date": "12/15/2015",
    "text": "Clam chowder and chicken and wild rice soup is my favorite!! Their chicken Caesar sandwich is great too. Their Caesar dressing is probably one of the best I've had. Service has always been good here. I've never had them mess up my to go order. They deliver too!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "mohwWRwyy9fP0vn1tfs6dA": {
    "date": "9/6/2017",
    "text": "Their wifi is useless. Rush expresso next door or any starbucks works better.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TYVs2cO4a95blYdpGatkIg"
  },
  "DfSzylrY1hLRF4hI5BeDmA": {
    "date": "1/27/2016",
    "text": "There is a self service function that is great. The only disappointment was that hey had to keep coming back to me to say they were out of something I ordered. However they did make it up to me and have me free drinks and soup. You do have to clean up your own dishes. It is very busy during lunch time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "KdswzU0xcuYUeQQmYJH7Fw": {
    "date": "5/24/2017",
    "text": "I have ordered to go here about 6 times and every single time the order has been wrong. I was not compensated for 6 of my to go orders being wrong which really made me upset. The only reason this review has more than one star is because the food I ordered in the store came in a decently timely manor and it was very good. I wish they would compensate the people who have received wrong orders.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLgjc3Jh8IQZXf-CbnmCNg"
  },
  "AOXaWBL_TvZLos9UDC6MHA": {
    "date": "6/23/2015",
    "text": "Pros:  *Friendly staff *Quick service  * The new additions to the menu  Cons:  * Sometimes they're clean and other times not so much",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iC_fjhxhNEZh1FIvwu7XTA"
  },
  "ay9MIoyF4KAd6BRS19GlNg": {
    "date": "3/31/2018",
    "text": "this panera sucks ass. i normally love panera, especially the grilled cheese but not the four cheese one because that's too much for me but anyways we show up at 9:15 and there doors to the store are locked already. bitch they close at 10 the fuck. so we call the store and no one answers the phone so we r just standing outside lookin stupid. eventually some lady comes out and is like bahahahah lol we locked the doors! so she lets us in and we ordered food to go. we have been sitting here for like 10 mins now and they are taking five years to make it. when i was going to get my drink they were out of cups it was just bad. the only reason why they got one star instead of 0 is because when I peed i noticed the toilets were eco friendly. don't come here unless ur gonna shit and go.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e4Bc8Am542hryOLlSs2Nqg"
  },
  "ItQ20kF8LM8DCSDcn0KooQ": {
    "date": "2/2/2013",
    "text": "Stopped in for lunch, parking was a bit of a pain because with so many other restaurants and businesses in the area it's hard to find any spaces especially during the lunch rush!   But anyway, finally made it in and was surprised to find there was not a long line! I chose the Pick 2, with half Bacon Turkey Bravo sandwich and half Chopped Chicken Cobb with Avocado salad.  The Bacon Turkey Bravo has to be one of my favorite sandwiches here! It has Smoked turkey breast, bacon, smoked Gouda, lettuce, tomatoes and signature dressing, on Tomato Basil bread. My favorite part is the bread, it's so moist and fresh and pairs well in flavor with the Gouda cheese and turkey breast!   The Chopped Chicken Cobb with Avocado salad was also delicious it has chicken, romaine lettuce, tomatoes, Applewood-smoked bacon, Gorgonzola cheese, hard-boiled eggs, with herb vinaigrette, topped with fresh avocado. It's like a flavor explosion in your mouth! The mix of cheese, chicken and bacon with the delicious herb vinaigrette dressing is wonderful! And the fresh avocado on top is such a nice treat!  I treated myself to a shortbread cookie as well, and it was huge and delicious!   Overall, I had a nice experience here and look forward to returning!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "3atMq-YstD58cfFv6ex_TQ": {
    "date": "11/2/2014",
    "text": "30/10/14  WORST CUSTOMER SERVICE!! in the Night... The soup is cool and i wait up 25 minutes.. i see the soup in the counter ready waiting, i decide go and pick the food but the soup is cool and the sandwich hard. I request talk to manager, and he say sorry..  but i don't know about people in the kitchen... OMG  finally after 26 minutes they replace the soup and sandwich but the order is wrong. Again after 20 minutes he finally bring the right food... finally",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4hfvzykXFoV6AmrTmTOW5w"
  },
  "HT6IStN4jd1ualQNj-JQKw": {
    "date": "9/28/2016",
    "text": "Ordered the soup and sandwich combo Chicken soup and turkey and cheddar and apple Both very good soup a little salty but I like it that way Turkey sandwich was very good however the turkey was in big chunks and kept falling out of bread Think they could have put sandwich together better or at least served it with a fork Girl who delivered food was very Pleasant as were the girls that took my order Will return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq95ut3ReIzR_30YJxyXug"
  },
  "-__sNYzK4z9zW5dArMcl2Q": {
    "date": "4/10/2019",
    "text": "I've ordered sizable lunches and breakfast catering orders from this location many many times since my office is located in ballantyne. The customer service has ALWAYS been pleasant and quick-responding, and the delivery person has literally never been late. I've also gone in before 6 am several times to pick up breakfast orders and they have always greeted me and helped me get out of the restaurant quickly with my entire order.   Out of all the orders I've ever placed, they've never gotten anything incorrect. There have been a FEW cases where the sandwiches ordered haven't looked great or looked like they were thrown together super quickly, but other than that, outstanding location and we will keep using this location for our bulk orders!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "NvTI0n5PhXdJYxTtRPRzrw"
  },
  "_TVoHAqeD9Y_MO9bY7K6vg": {
    "date": "9/14/2019",
    "text": "I ordered for my family of 4 on their kiosk. My entire family got served their food and then they tell me they didn't have my order available. We stopped here on the way to a soccer game so were tight on time.  The right thing to do would have been to let me know after my order was placed so I could have food with my family.  I did receive a refund and chose another item to go, however waited 15 more min for it to be ready and they added chicken when we covered that i didn't want chicken added like 3 times, so it went back and added more time to wait for my food when we didn't have any.  This experience was not good and have felt that Panera has really gone down in quality the past few years.  I will have a hard time giving any Panera my business in the future which is sad bc it really used to be good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "899hwwElsvwLjUysUzEaSQ"
  },
  "kwDGDG3YcbtIMePmPV118w": {
    "date": "12/3/2018",
    "text": "This is not a bad Panera. It's your usual. I imagine it gets packed during the day but I've only been through early in the mornings on weekends. It's always quiet and chill. Service moves quickly and there was a cashier on my last visit who was especially polite and helpful. I don't usually leave tips for places that pay a full wage but when you earn it you earn it!  On a side note, I call shame on Panera for ditching the turkey cranberry flatbread. It was already a seasonal item and I've waited eagerly an entire year in great anticipation of sinking my teeth into that delectable sandwich once more. Alas! It is for naught. They've discontinued it! Rest assured this fact alone brings me back to Panera even less.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HtWo7ORxOylSe3VondXKMA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HtWo7ORxOylSe3VondXKMA/o.jpg"
      }
    ],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "Ph0_xHgO05dj1RQ2ziKn9w": {
    "date": "8/11/2019",
    "text": "When Panera bought Paradise Bakery & Cafe a few year's ago; I thought they would step up their game and be everything Paradise was and more.  But, consistently the order is wrong or looks like they dropped it on the floor and picked it up and wrapped it up to go. We stopped eating inside this location because it is always filthy and/or they are out of almost everything on the menu.  Yet, my daughter still craves a Panera pb&j; and not sure what this is?  This is high traffic Ballantyne...get it together or let something else good come in; PLEASE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yJezMpCUw0_w2XXI-_COug",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. Kids PB&amp;amp;J",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yJezMpCUw0_w2XXI-_COug/o.jpg"
      }
    ],
    "user_id": "SrQz6yOrF9QxWYcAC2DIbQ"
  },
  "q5ZS0MBs86V_t_-LjpgI6A": {
    "date": "4/11/2019",
    "text": "Panera always gives a good bite from a snack to a full meal always delicious. Bagels are great especially the $6.99 baker dozen. Its a staple for home and home in Tuesday for quick breakfast during the week if any leftovers. The salad are amazing the egg white avocado spinach breakfast sandwich to die for. The coffee I am not a fan of but wont based my rating on that because I am very picky on coffee",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SC1-xRMv4UsXPmBStUzuWw",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. Mixed Bagel Combo...Bakers dozen for $6.99 on Tuesdays!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SC1-xRMv4UsXPmBStUzuWw/o.jpg"
      }
    ],
    "user_id": "67vJQsbf5230vtYYtuP5eg"
  },
  "achErOh532KdVL3fuVvA-Q": {
    "date": "2/26/2019",
    "text": "Very good for what it is.  Since I was last here, it appears that they have updated their decor. The people are very nice who work here.  My only pet peeve is that they ask for a tip on the computer screen when you pay for your order at the counter.  This is a bit absurd because all they do is bring your food when it is ready.  They don't check on you.  They even make you clean your own table of dishes when you finish. It's like they guilt you into adding on a tip, and I fell for it.  Oh well, my Fuji Apple Salad was good, as always. I am glad Panera is here and I will continue to patronize.  I may not tip, but I will patronize.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "68pXbbmyWft_pkLxT4hSbQ": {
    "date": "6/27/2019",
    "text": "I waited forever for a PBJ...this is what I got! I usually love Panera but this was so disappointing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3-auFwg5fHZLCCNlJkve8A",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. This is what I paid $5 for...really?",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/3-auFwg5fHZLCCNlJkve8A/o.jpg"
      }
    ],
    "user_id": "jMtzbnUNU8mtfuT1HagIqg"
  },
  "aDMyoK9_M-nmZkFzfP5-8w": {
    "date": "6/25/2019",
    "text": "Our cashier/order taker did not seem to want to wait on us. After talking to someone in the kitchen, he did come back and took our orders. Our group of 3 ordered and sat down to wait for our food. As soon as my order came, I could see that the soup spoon was dirty so I asked the server to replace it and reminded her that I had also ordered butter, which was not originally brought out. When I took my napkin off my plate, I was appalled! The entire top of plate was filthy. I looked under the plate and it was dirty, too. I showed the server when she returned with my spoon and she asked if I'd like another bowl. I was so grossed out by the filthy plate, that I asked for a meal refund. After I received a refund, I was again asked if I'd like to reorder. I had to leave. I can't even imagine how dirty the rest of the restaurant if the dish washer, cook, and waitress did not notice a plate and spoon that were obviously dirty. The spoon had dried on soup on the front and the back of it, the plate had grease and red mayonnaise? smeared on both sides of it. They looked like they had never been washed, just reused after the last customer left them. If i could give negative stars, I would",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1x9ce6BbVzlbfNPn_brQBw"
  },
  "CxlHQ0-Knex521L1GXVyhA": {
    "date": "2/23/2018",
    "text": "Great healthy options for lunch or dinner! Both the hubby and I work so healthy options are a go to at Panera with their salads and You pick two--half sandwich and soup or salad choices. I love the Green Goddess cobb salad with chicken or the Asian Sesame chicken salad. The chipotle chicken sandwich and the chicken noodle soup are my favorites. Also like the roasted turkey and avocado blt sandwich. Typing these names I see how I'm a meat eater and have a fondness for chicken:) This location is busy but the easy swipe station is helpful for when you're getting takeout. Parking is a bit crazy at dinner but you can also use the garage.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "G2RLNdmP5IdWVetMIwZd7w": {
    "date": "2/1/2017",
    "text": "Really nice Panera!  I think the bowl size has increased for the soups. How nice!   Broccoli cheddar soup- Delicious!  Sesame bagel- pretty good.   I like to sub the French bread for the Bagel. Some places charge a little extra. This one did an even swap. Very nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "B-bLVi4naM51j3-5291W-Q",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. Nice seating area!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/B-bLVi4naM51j3-5291W-Q/o.jpg"
      },
      {
        "img_id": "x7-VjFcAuPByRIlKAPS5KQ",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States. where you order!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/x7-VjFcAuPByRIlKAPS5KQ/o.jpg"
      }
    ],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "4XXTfiPfwJKiNoHkfS_IVg": {
    "date": "12/22/2018",
    "text": "Great place to take my daughter for a little dad/girl time. Service is always courteous. Food is good and predictable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Da-e2S47A6UdDfvwKmXzeQ"
  },
  "4OBqWt8OSfusuCKq4bDIzw": {
    "date": "12/10/2016",
    "text": "It's a shame how everything about this once excellent restaurant has declined over the past several years. As a matter of fact, today was the last straw for us, after eating here weekly for the past 10 years. We're done! Let the eternal help wanted sign on the door serve as warning.  To begin with, I had to wait 10 minutes in line with only one person in front of me at the checkout counters while two cashiers fumbled away at the cash registers. I then had to wait another 10 minutes for my food to arrive. My order was a fairly simple breakfast sandwich and was tiny and just ok when it did arrive. If that wasn't bad enough, they completely hosed an order to go which consisted of another breakfast sandwich and a latte. Unfortunately, it wasn't until I got home that my wife discovered the latte had nutmeg added and the sandwich lacked cheese, both in error according to my receipt. As a result, she had to make a separate trip back to get things right.  Food quality had already become hit or miss, as well as the service. For more info, see my prior review. But once again, we will not be back. Save yourself the trouble, either go to a different Panera or somewhere else entirely.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "xKvUejyYkiTsRIySaPRQPQ": {
    "date": "7/20/2018",
    "text": "Love Mediterranean veggie sandwich & plant based summer specials. Fav lunch spot. Can bank on it any day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PBru1qFD4odDt4545WFW0A",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PBru1qFD4odDt4545WFW0A/o.jpg"
      },
      {
        "img_id": "BMRXbd9UeFZvykZ7MuSy2w",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BMRXbd9UeFZvykZ7MuSy2w/o.jpg"
      },
      {
        "img_id": "fJ6kztKDP1DGORfzXdDqYA",
        "caption": "Photo of Panera Bread - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fJ6kztKDP1DGORfzXdDqYA/o.jpg"
      }
    ],
    "user_id": "PmgCjbro6pvc7CYu7V8t-Q"
  },
  "SJpGisHugHgm5YlXBXriOg": {
    "date": "7/28/2018",
    "text": "Worst Panera ever. Completely unorganized and they always get our food wrong. They always act like they're extremely busy, but it's never that busy when we come. Today seemed very slow, yet it took 20 minutes to get our bagels toasted. People behind us in line got their food first. I had to go up to counter that no one was running, ask about my bagels and then they handed us two (not toasted) bagels. While waiting an eternity for our bagels, a customer started literally screaming at the cashier and manager about waiting 30 minutes for the correct bread for her sandwich. I guess she ordered ciabatta and couldn't get them to give it to her. While I think it's completely rude to scream at a person in a service industry, I was so surprised that the manager and cashier actually argued with her. The cashier even yelled back at her to not be rude to someone who rang it up right in the first place. They fixed her situation and gave her the bread, but honestly I think it could have been handled better. Last time we came a couple of weeks ago, they forgot the bacon on my bacon egg and cheese sandwich..... I told my husband there are several Panera's that are far superior, so we won't come back to this one. Although, we will miss the drama.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6pHnLYravmZfBtc6Dco9Tg"
  },
  "c4AF4nRiHMPvszbcN3oxow": {
    "date": "11/4/2018",
    "text": "Orders are never correct. I don't understand. I can see here and there, but almost nearly every dang time I go here something is on or left out that should be. Also the last time I had avocados added to my salad they were frozen? Why Panera, this is extremely disappointing and not work a $12-15 dollar meal.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhKwALl0hU1m1SHV7fdHhg"
  },
  "naSl8Vo2XyMYKdF-iwSqnQ": {
    "date": "9/17/2018",
    "text": "I can always count on a fresh, delicious meal at Panera. Having a bowl of tomato soup and a cobb salad today and it's great! My only complaint today would be that the tables need to be wiped down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZXoV3sJimIyo1GrvsX1sg"
  },
  "6cUgRbqw4IRypiehxjkipw": {
    "date": "10/3/2017",
    "text": "I visit Panera twice a week They are friendly and have Great food in addition I left My book and called and the saved For me",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eto6lvAXwMMPRXf3Mnz-SA"
  },
  "ekNII4NKngelg3FY_es9OQ": {
    "date": "11/18/2017",
    "text": "Ya know what your gonna get good soup, sandwiches and bakery items and this location in Ballantyne is clean and fast.  They have kiosks in front to get your order going then you pay in front. A server brings your food to the table and there is a bottomless drink machine as well as endless unique iced tea dispensers",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "4ZEBJmOdHTQTDjADG0hhJw": {
    "date": "10/18/2018",
    "text": "Horrible! We just left this location about 20 minutes ago. Ordered the frontega chicken for myself and the avacado-chipotle chicken for my daughter. Once we received the food, we drove away and as I was about to eat, found three strands of hair in my sandwich container. We immediately turned around and showed the manager who refunded our money. I should've checked my daughter's food at this point......When she opened her sandwich she found some black stringy like object. Not sure what it was....I will never visit this Panera location ever again!!!!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhXu0gRA4R8ZWwGFoBDqvw"
  },
  "DSkPqvDb63x4yQbilfPdhw": {
    "date": "4/1/2015",
    "text": "Location Location Location, This Panera is located in the perfect spot right in Ballantyne Village where everyone think they are \"holyier than thou\" or shall I say \"the chosen people\". I actually had a place in the area temporary while building my home and got a True taste of the people in the area. Love Love Love everything to do in the area but the people are a different story.  Now regarding this Panera, the food is okay it's not the best. I had to send back my Avocado egg white breakfast sandwich several times because it came out BURNT, then again ice cold, then third time missing ingredients. The younger cashiers are not that friendly and don't know how to provide good customer service.  I've been to plenty Paneras and this one is lower on my totem pole as I rather go to the new one at the Arboretem where they are pleasant and professional and I've never had to send my food back.. Plus the people don't act like they have a stick up their rear end.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUwYlVRuyoImgtaw8Cjztg"
  }
}