{
  "BfjiN5eYkzoIXZQ_BFqqsg": {
    "date": "9/2/2015",
    "text": "Forget the food - the tables and floor were gross.  The tables were so sticky the napkins ACTUALLY STUCK to the table !  The floor was sticky - even in the bathroom !!!  If they are keeping the areas where the customers are in this state, I don't even WANT to know what is going on in the kitchen.  We won't be going back based on cleanliness alone.   However, if you want to hear about the food:  I got the catfish - worst I've ever had.  Breading was flavorless and no crunch.  Baked potato soup was really good.  Pecan pie was just OK - tasted like bought out of a grocery store freezer section.  The salads my friends had looked good.  None of us really wanted to come back though due to the stickiness of the restaurant.  It's a shame, because the O'Charley's I went to back home in Indiana is really good and clean.  STAY AWAY from this one !",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gERe-EPQPDsEkWu2fKeRYA"
  },
  "f1HbH4JeBJEuQXi_a-6XQw": {
    "date": "3/14/2015",
    "text": "Convention be damned. I will say it loud and say it proud \"I love O'Charley's\". This location is close to my house and it has served me well. If you want to go eat somewhere that it doesn't matter what you are wearing or how loud your party is than you are in the right place. They also have a surprisingly good Prime Rib dinner on Friday, Saturday and Sunday.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysJov7uzU832sYwjP4qayA"
  },
  "EL8y6X__2tfkpBqApZKw0g": {
    "date": "9/8/2016",
    "text": "If I could give the place no stars I would. (I just quit this job) I transferred to the Charlotte O'Charley's and it was HORRIBLE!!!! The management team doesn't know how to run a restaurant, and they are SHADY!! Amanda, the bar manager (currently) made one of my new (former) employees cry in front of a customer belittling him and calling him \"stupid\" because he accidentally rang in the wrong food order for a lady. Not to mention one of their older waitresses, Sha, tried to start a fight with me after disrespectfully stealing two tables from me and then proceeded to yell in front of customers, later realizing she was in the wrong. Also, after I quit there (because I didn't give a full two weeks) transferred my last paycheck all the way back to my old O'Charley's in GA (where I don't live) so their restaurant didn't look so bad because I quit after a few days of being there because I was so disrespected working for them and with their horrible staff. I came from a training store in GA and was there for almost a year and LOVED IT. but this team here at the South Tryon store is completely a mess. The managers don't know how to run their store, the servers are lazy and don't value teamwork, and the business is CONSTANTLY SLOW. I don't recommend working there. And the food at this store sucks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bADpRbCV9eEFYtssPAD2w"
  },
  "zpLNoF_Rl-Ku-AQloBd8Pg": {
    "date": "2/19/2015",
    "text": "Food is always spot on here. Went here last night and it was busy, our server Ashley did an awesome job taking care of us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dH8S3--sZvjRIrUk1d3Pfw"
  },
  "k59qt2DPlkNW55iqE1W_Ng": {
    "date": "11/25/2015",
    "text": "I was disappointed. The food was just \"okay\" and service was less than be desired. I wanted to really like this place but just couldn't. I'd try it again bc it's wasn't terrible but not anytime soon",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "li_KQGJT8xHJRW92ncvZsQ"
  },
  "TeFdWFx--1Yvf42jOVB7Dg": {
    "date": "8/9/2015",
    "text": "Food was pretty good. Rolls are great. Service was fine. Typical O'charleys. Love the chicken fingers. Margaritas were absolutely horrendous. Pretty sure it was water with a ton of ice. Tried to give them a second chance on my second margarita, even worse.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCNiw5_UYp37hy-xc3Qh8g"
  },
  "4uXrnmaQjbx6iovaZzUd-A": {
    "date": "6/6/2014",
    "text": "Hate to break it to you guys but I've worked here and had to quit. This place is probably ranked #1 out of the top 5 most disgusting restaurants. I was a hostess and I tried in my best ability to provide excellent customer service as all hosts should. And I succeeded of course, but everything that happened behind me was terrible. The place is unsanitary, they hire for your more for your \"personality\" then your work ethic and they don't clean anything thoroughly... Literally everything is filthy. I would have to roll silverware on dirty tables in the back. I oversaw my manager flip a piece of meat with his bare hands(absolutely disgusting) Free pie Wednesday sucks b/c they leave the pies out all day and heat up your slice for 20 seconds when you order it so you THINK it's \"fresh.\" Majority of the servers are HORRIBLE, and most of them are constantly complaining about how they hate their job. I could not take it anymore. I hate this place with a \"passion\"(if you've been there you'll understand me) lol. But yeah, DONT GO HERE. THIS IS THE WORST O'CHARLEY'S IN CLT!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "UiN82_4h25SOh9EHiRxpOQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Top combo appetizer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UiN82_4h25SOh9EHiRxpOQ/o.jpg"
      }
    ],
    "user_id": "RLOncy9q8fgbwDEstkf_BQ"
  },
  "qUCSAW_yop6zoT2ivqCROQ": {
    "date": "6/16/2013",
    "text": "I love O'Charley's! Every time I visit the restaurant I always get the chicken tenders because they are probably the best chicken tenders I've ever had, and I know chicken tenders...I even have a blog about the best chicken tenders in Charlotte (<a href=\"/redir?url=http%3A%2F%2Flovemetendersincharlotte.blogspot.com&s=90cad90bbcc410f5a09808dd21cebe8f75583daea0af1089da682b8e8be1f908\" target=\"_blank\" rel=\"nofollow\">lovemetendersincharlotte...</a>).  For starters every meal comes with these rolls that are fluffy, light brown, and glistening in butter...clearly a fantastic way to start any meal. Next come the entrees, or in my case the chicken tenders and sides. What makes the chicken tenders at O'Charley's is the fact that the breading is perfectly seasoned before being cooked to perfection, so the tenders come out a crispy, golden brown. Along with the five big chicken tenders you get with your meal you also receive two sides. In my opinion the best sides are the fries and the broccoli cheese casserole. The fries are covered in salt and pepper, but not too much, and they are crispy and plentiful. I love the broccoli cheese casserole because it's creamy, sweet, and there is rice mixed in with the broccoli and cheese so it adds an extra bit of texture to the dish.   If you haven't had the chicken tenders at O'Charley's then I definitely think you need to try them. They certainly are delicious and it's a decision I don't think you will regret.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MIzOFaaA4tRVwDfoGecqnw"
  },
  "6COVnT-lnKscTA1S2Zns0A": {
    "date": "8/9/2015",
    "text": "Pretty good food. Waitress was slow and didn't bring me change when I payed in cash saying, \"I'm assuming you didn't want change?...\" Even if I didn't it's not good to assume. Not to mention the bartending skills we're very subpar. It took 20 minutes for 4 margaritas that had absolutely no flavor. If you're going to be a bartender you should without a doubt know how to atleast make a margarita....let alone within a 10 minute time span on a slow Sunday night. The only thing that brought this up to three stars is that I had a good time with my bros.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xj09c8_l8rSCI_8_F0yC8Q"
  },
  "Ob2AEp2t3MLkC3453_fzAw": {
    "date": "2/3/2016",
    "text": "I am stunned & almost in shock over my experience at this O'charleys.  Now that I have taken the time to read the other reviews, I get it & I am amazed this place is still open.  While dining, a roach, yes you read correctly, a ROACH was crawling up the wall beside me.  If this wasn't bad enough the responses from the waitress, manager and regional or district manager who happened to be there was worse than the roach.  The waitress, I understand because they have no authority, they can only get the manager.  Her response was, I am sorry, but I am not getting it, what do you want me to do.  We said get the manager, the manager had the audacity to  explain that it wasn't a roach because they just had someone come in and say that they did not have any bugs.  She then asked, what would you like me to do because it looks like you are finished eating.  I had half a plate of food on the table & my drink.  Since it appeared that she was not even going to offer to move us, we asked if she could get the critter off the wall.  She proceeded to kill the roach in a napkin and examined it in front of us, I guess to prove it wasn't a roach.  I thought I was going to lose my dinner.  When we expressed that her response was unacceptable, she proceeded to get the District Manager.  Would you believe the grumpy woman came to our table as if we were keeping her from doing something much more important & gave the same exact rhetoric, offering to show documentation that they were told they have no bugs.  UNBELIEVABLE!!!  Please pay attention to this important fact, she said they have no control over bugs coming into the restaurant from the outside with doors that open and close.  Again we were asked, what do you want me to do.  Then she proceeded to say in a very confrontational way, that we obviously had in our minds what we expected her to do. Then said, I guess you don't want to pay for your meals, if that's what you want then fine have a good night and she stomped away.  I wouldn't buy dog food from a place that demonstrated this type of attitude & lack of concern for their environment & customers.  Good luck to anyone who chooses to dine at this establishment.  I hope your stomach can handle the extra protein.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OwDXUT7OigrGX7nONY6hsw"
  },
  "SPzV-jDqxgwslEPMHqlYhQ": {
    "date": "4/1/2014",
    "text": "Don't eat here if you want a relaxing lunch.  Went there for lunch, had some books with me, ordered a cup of soup and a half salad, had about 6 bites of my salad, and the server brings my check, does not ask if I want anything else like dessert or a refill on my drink or a box since they were running me out.  I asked when she came back if I could have a refill since obviously I could not get dessert, a few minutes over the manager came over and said their policy is to give you your check immediately since they have such a large lunch business, asked him to please bring me a refill in a takeout cup and I would leave, seems like they would like to wait on the customers that are already there?  Felt very rushed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7YQ_U1UKQgCxi2agtTisXA"
  },
  "qyWTrrZws-tuwS3CrvWBJg": {
    "date": "8/8/2012",
    "text": "Hello Friends,   I've been to this location many times. My gf bday was the other day and she desided to stop here for a little meal.   The waiter was the life of the party.. (Other than myself of course). His tip increaser (if that's a word) was when the food was brought to the table. I'm a BIG FRY GUY and the 1st thing I noticed is that I had about 12 french fries. As everyone looked at my face and heard me count the fries. 1 person in the group asked, \"CAN YOU BRING HIM 4 MORE FRIES...LOL\"  well low and behold, 5mins later, the waiter brings a place with 4 count em, 1,2,3,4 fries. That got a kick out of the 8 member party. I lol'd so hard I couldn't think if he was tryin to be funny or carry out the wishes of a customer. It was tooo funny.   I told him just for that.. he just increased his tip from me.   The food was great, drinks were good as well.   I'll Beee Baccckkk!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xhlcoVm3FOKcxZ0phkdO6Q"
  },
  "LuO-ISDhI45ex_TXsrGKtw": {
    "date": "4/24/2016",
    "text": "Several in my party ordered steaks some 6oz and 2 9oz. All came out with 6oz steaks and the manager states \"trust\" me it's 9oz. Never asking if I wanted something else and stated she couldn't cook me another because it will come out the same. THE WORST RESTAURANT EXPERIENCE I've had. Horrible customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yC7ifyECzD2zv8foefZgKQ"
  },
  "wRI611AHgSF7ZE0NdbadRg": {
    "date": "7/31/2011",
    "text": "Came here for lunch on a business trip out to Charlotte, NC.  I'm from California, so I had no idea what to expect when we went here for a quick bite to eat.    This place is situated in the middle of a shopping plaza-like setting.  We were seated promptly, however, there were 6 people in our party and we had to squeeze in to a table that normally fits 4 comfortably.  They do have a decent menu with normal lunch items you would find at any chain restaurant.  Wait staff was polite. Food on the other hand was mediocre and a bit on the greasy side.    Overall it was a fast lunch, nothing really special but also nothing really awful.  I'd suggest though that if you're looking for a nice lunch worth talking about then you should find somewhere else to go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "GNbm011Kc2IEqfcTLx1a6w"
  },
  "tm7k863FEC6fyYqbkBAVHQ": {
    "date": "12/20/2015",
    "text": "Horrible service. Took 10 minutes to get our drinks and rolls, primarily because our waiter was flirting with women at the table behind us, giving them his number, and chatting away. Fries were undercooked and unseasoned, chicken tenders were old and dry. Didn't even want a replacement meal! Won't be seeing me as a customer again at this location.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pzQm6AiKGhulnnzh6NG6gg"
  },
  "o-rrOucHwxfqw6JSUy7veg": {
    "date": "2/19/2014",
    "text": "Stopped in here around 12:30 right before start of big Panther's playoff game.  It was one of the closest bars to our hotel other then Ruby Tuesday's that we could walk to.   It was still 2.5 miles but a nice day.    Sat at the bar and had drinks. Drinks are good and reasonably priced.  Shared a bowl of the potato soup which was also good.   Shared appetizer sampler.  I NEVER get appetizer samplers that consist of chicken tenders and potato skins.   i think both are stupid.   However after ready all the great reviews about Ocharley's chicken fingers I thought we would give it a shot.   they were overcooked and tastae like a chicken finger off any kids meal at any chain restaurant.   Potato skins are potato skins.    These both get 2.  the cheese things however were great!    Made a stop the following week  for hh.   Another margarita not as good as the one at the bar first time.  Was lured in by hh priced nachos.   Cheese whiz?   Not!   The only good thing was my first margaritaand the cheese triangles.   And the soup. and serivce was horrible the 2nd time!!  Took forever to get check!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4_XcrRt08sADOdIT5ex3A"
  },
  "rSL5NRXDciP_EckNZ7jnYw": {
    "date": "1/20/2014",
    "text": "We haven't been here in awhile and after tonight's visit we will not be back.  There was an odor outside and a little inside and we later figured it out that it smelled like old, nasty grease.  I ordered the prime rib sandwich and it was disgusting - I couldn't even eat it - I left 2/3 of it on my plate and the waitress never even asked if I liked it.  And, to top it all off my husband and I are both sick feeling now because we think their grease was old.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rw4MCeeV8-CV4yy54aLqiA"
  },
  "3dXZAktT5bwfR6V_76BJHw": {
    "date": "5/11/2015",
    "text": "I was so disappointed that I decided to dine here for mother's day, I usually get a salad to go, which is always good. We got there and the dinning area was quite dirty maybe short on bussers trash on the floor lots of tables left uncleaned. I ordered the Ribeye well done which looked appetizing but was damn near bloody.... ewh, the waitress graciously asked if she could take it back and put it on the grill a little longer, however I don't send food back, i just took it home to put it on my grill. Mother's day dinner sucked!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W8eNVifQ76n8VpQM-5kGww"
  },
  "I31CCP3vfnAlIK1qJ_OaxQ": {
    "date": "10/23/2008",
    "text": "O'Charleys is your typical chain restaurant, with nothing special to offer in terms of food or atmosphere. They have some pretty decent entrees, even though I would probably not recommend going here for dinner.  I've only been here for lunch, & while the food is right above average, they don't have a good lunch menu. The portions are the same size as your dinner entrees, which means you'll pay the same price. I don't understand why places have a lunch menu if it's nothing different than the normal entree...but maybe that's just me complaining.  I usually only get the chicken tenders covered in BBQ sauce & the plate always seems so empty. Don't get me wrong, the meal always fills me up for lunch, but the plate just seems way too big & makes the entree look skimpy.  O'Charley's is your typical chain restaurant, not serving up anything spectacular or that will have you clamoring to come back for more. It's not a bad lunch spot, maybe a tad bit pricey, but I'd definitely suggest going here for lunch over dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kjYbPkrbgPMVUAjungJ4Aw"
  },
  "irkwzmz_iQCeav-V7rEwqg": {
    "date": "5/31/2014",
    "text": "Went here for the advertised prime rib; very poor cut of meat, not to mention poor service.  Either they didn't have enough staff or they were just inept; we had to remind our waitress numerous times for bread, drinks, etc.  We really felt bad for customers next to ours who sat waiting for their food the entire time we were seated.  Lastly, they don't give you a full 1/2 rack of ribs; very limited portion.  It will be a long time before we come back; there are plenty of other options available with better food and service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jxt_xbYQJsNlXIlgC_jM9g"
  },
  "-D--ZnRAlYYlIvPMt9e3sA": {
    "date": "2/26/2017",
    "text": "Went to this O'Charley's today with my boyfriend (on a Sunday around 5:30pm). We walked into the lobby and waited in line about 10 minutes to get to the host stand to be seated by the manager (who was very pleasant).   They quickly cleaned a both for us and we sat down to wait about 5 minutes for a server to come greet us and take a drink order. When he did come over he was nice but seemed busy so we were patient. We waited about 5 minutes, again, for our drinks to be delivered and quickly ordered an appetizer (chips & queso) as well as our entrees (chicken tender & rib combo as well as bacon bourbon barbecue filet mignon) as we were starving by this point.  The server brought back some delicious hot rolls with butter and kept our drinks refilled. After about 15-20 minutes a different server delivered our appetizer and was kind and smiling. The chips were housemade chips with a light seasoning and were delicious with the queso.  After almost another half hour of waiting, our entrees came out. My ribs were good, a little fatty, but good. I got macaroni and cheese as my side and so did my boyfriend. They were both basically buttered noodles with shredded cheese melted on top. Meh.. My boyfriend really enjoyed his steak and baked potato and the fries I got (instead of the Caesar salad I ordered) were kind of soggy by the time I got to them but I liked the honey mustard dipping sauce.  Overall the staff was friendly, the food was good, but it took over an hour and a half from start to finish. Will be back soon to try again, hopefully with better luck.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v4qncYCUm_9zefieALJnjQ"
  },
  "fZiameLZNJjb13hrwxvBGA": {
    "date": "2/12/2017",
    "text": "Had a late lunch here with the wife and some friends. Not or first choice of places to eat but not the last. Service was a little slow but good enough not to complain about. The bread they give you before you order is excellent, especially if you can get a fresh hot order out of the oven. I had the chicken tenders and fries, wifey had the catfish. The chicken tenders are very good and wifey had no complaints about the catfish so I guess it was good to very good. Will return to eat someday again, food is not bad.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Wiq1GSIjoOx3S3KtRTBtg"
  },
  "SGi4S88SjIksEVyUWPpH3Q": {
    "date": "12/13/2014",
    "text": "I usually come here once every 2 weeks or so and order the same thing. .fish and chips which are not bad. Today same thing but the complimentary yeast rolls were no way the norm. Dense and then over cooked. Bottom dark brown.  When I inquired was given a cery lame excuse that it is because it is winter. What dies winter, which is outside, have anything to do with yeast rising in a hot kitchen.  I guess the bartender thought I was drunk..drinking iced tea here. On top  after I complained there was not even an offer to check the kitchen for a better batch or pan of rolls..poor custmer service.   Anyway,  very disappointed with the bread and even more with the lane excuse and lack of customer service. Can someone get it right here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3DzgSwJqsSnFMO3yWO0hA"
  },
  "WCk0y-BpGsujj1eLLxvPGg": {
    "date": "8/13/2017",
    "text": "This place is disgustingly nasty and the staff are always rude. Last time I waited over an hour for my food, why, because my waitress was too busy playing on her phone and not being attentive to her guest. Also not to mention I ordered water and it was only filled up once through out my meal. I will NEVER be back tot his place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MZHsfHXCAZ3MZ9bf3lqBQ"
  },
  "DGyzwBeAnk9SHSVyRgZe7Q": {
    "date": "8/26/2017",
    "text": "Wow just walked into Ol Charley's. FIRST there was no Greeter we waited looked around , then headed to the bar. SECOND the bar itself was DIRTY had not been cleaned and I waited for about 5 minutes and NO NO NO Bartender ( I could have gone behind the bar and made my own drink). So, apparently after staying away 3 years because of bad service and sub par food has NOT improved. When I tell you I will not be back, I mean it. I thought it would have improved and I felt they needed a 2nd chance. There will not be a 3rd and if i could give a minus 5 stars I would.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6rbK10vW0at1PF2YaFNpFA"
  },
  "0QfTUcqRXQNIwwWEtFW46Q": {
    "date": "3/16/2013",
    "text": "The main reason I go here is because of the Southern Pecan Chicken Salad (sans the bleu cheese crumbles).  My mom and I usually split a full order with the Balsamic vinaigrette on the side, which is more than enough.  This time around I tried the half size with a cup of the overloaded potato soup.  According to the server, the half size has the same amount of chicken as the whole size, but less salad - score!  The soup was so rich and creamy - you can taste the buttery, fatty goodness.  Usually the service is great, but today it was slow and just average.  It wasn't even the lunch rush yet!  Our server was very nice, however, she forgot the lemons for our sweet teas and did not refill our drinks during our entire meal.  She did apologize and gave us refills to go, but inadvertently switched my mom's drink with mine.  She also forgot my order of soup and had to bring that out later.  So overall I'd give it 2-stars compared to other places, but the salad deserved a star on its own (and maybe because they have free pie day every Wednesday).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PoYY1CAGOx4dkNgOP1zQHA"
  },
  "ncTFaPUHlzSYdC8gkgX39Q": {
    "date": "8/5/2016",
    "text": "I like this restaurant they have a good variety. I highly recommend spinach artichokes, prime rib, black an blue salad is espectacular and customer service is awesome !!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RmPoD_UNwT5n8kxPaoZeuw"
  },
  "BEoy1kvWhBnVdw-Cxwz_8A": {
    "date": "3/20/2015",
    "text": "Meh. Just a lot of meh. Meh prices, meh food, meh service. This is not a place I choose to go unless my coworkers are having an outing. My experience several times now has involved greasy, bland food, jumbled waiters, and a price tag that just doesn't reflect my experience. I'll comment on a few food items in particular:  Fried Catfish: Soggy and slimy under the breading. I've never seen catfish like this before. Gross. Cajun Chicken Pasta: Oily and bland, doused with cajun french fry seasoning. Really disappointing for a pasta dish, but the chicken isn't bad, so I can stomach it. Tater Tot Fondue: Don't even waste your money. Freezer tots with really fake-tasting cheese. Just bad.  Coworkers that normally clean their plate only finish part of it. I've even seen someone send back a burger because of how mediocre it was. The ONLY saving grace for this place are the rolls, which are pretty delicious.  I honestly don't know who keeps picking O'Charley's for lunch, but it sure isn't me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Stkp_hRQdH4miuTVToW2Lw"
  },
  "fyQrFbfaVPYUDBtzVX03dg": {
    "date": "1/27/2013",
    "text": "After seeing the many commercials of the new menu items, I just had to persuade the wife to take a little trip to the O.  She had the fried chicken salad and I had the Tuscan chicken w/ linguini.  Her salad was fresh, the chicken was plentiful, and the bacon was just an added bonus.  Now, my chicken was the most juicy and tender piece of chicken I have had in a while.  It was properly seasoned, and topped with cheese.  The portion sizes were perfect, and for the money, it was a great value.  Our server was very attentive, and kept our drinks full, while checking on us several times throughout the meal.  This visit will cause me to consider going back more often and as long as they continue putting out good looking food, as well as the quality of the product, we will once again be regulars.  It was a pleasure to eat here today, and we were treated very well by the staff.  NCFoodGuy",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a9P22cg8hMh85q3Scn8gSA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Tuscan chicken w/ linguini",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/a9P22cg8hMh85q3Scn8gSA/o.jpg"
      }
    ],
    "user_id": "WlL5xRcG2paD6XGuACXmhA"
  },
  "L-qkDfd2hXcKlKmNAIJdrw": {
    "date": "8/9/2014",
    "text": "Haven't been here for a while, this last visit was a total disappointment. We ordered clam chowder, chopped salad and salmon. First the waitress bring my water and my husband's beer, the beer was all spilled out. Then we wait about 30 mins for our food when the restaurant wasn't even full. Then, she brings my clam chowder, cold, excuse me!! Who eats the chowder cold?? I asked for it to be warm up. When she brought it back, she was like: \" ouch! It's hot\" like she got burned or something. I tried it, yes, it was warmer than the first time, but it wasn't even close to hot. Tired to ask again because she was being too dramatic. Finally, our food arrives, this is not the first time I order these food, but the they all tasted great previously, this time, fish was not fresh, it has a funny looking and taste. And you can just tell The lettuce in th salad was old, They didn't have the crunchy. When my husband order the salad, he said bulcheese on the side, then it come with bulcheese and honey muster, both in cups that are sitting in the salad, except, the honey muster is spilled on the big part of the salad. When she brought the food out, she also laid down the bill, and said: just so you don't need to wait on me....like I said, the restaurant was not full, and she wasn't serving a lot of table. Anyway, we finished the meal, but will not go back again!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GooAFir_xAaEq_50urUNcQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GooAFir_xAaEq_50urUNcQ/o.jpg"
      },
      {
        "img_id": "0IqXJmd4k7v7h0getx3hJA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Clam chowder",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0IqXJmd4k7v7h0getx3hJA/o.jpg"
      },
      {
        "img_id": "JqhuL92r4z7GyEsZn9WOzg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Salmon is not fresh",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JqhuL92r4z7GyEsZn9WOzg/o.jpg"
      }
    ],
    "user_id": "F24FcMj0RMeUGQB_eZu3wA"
  },
  "1lAxgYVOpI20KnkOUH9sKg": {
    "date": "12/22/2014",
    "text": "I usually like O'Charlies but apparently tonight was not a good night. The salad was old and withered and pretty much not edible. The medium rare steak was hard and tough and I was unable to eat that also... But my 2 dogs at home will be thrilled with this steak!! Thank God the baked potato was safe!!! O'Charlies, please re-evaluate yourselves!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z-KvQAmm_H8agJhLHsqUpQ"
  },
  "dNvJt_WkfrkvIJzcbJSh_w": {
    "date": "1/13/2018",
    "text": "My friend and I came in tonight looking for a couple drinks while we waited on our hubbies to join us. Our server was a very nice wo.en who was obviously stretched beyond her limits. My friend and I chatted for a while, order3d a couple of drinks. The Strawberry margarita was so sweet I had to exchange it for a house margarita. Once our husbands got there, we had to wait so long so had to pay for our drinks and leave. This was NOT our servers fault. She was wonderful. But, she had been assigned a whole room. She had 7 or 8 tables. How crazy! Talk about set to g your people up for failure. The manager came over towards us as we were throwing our cash on the table. I told him it looked like our server was assigned the whole room, and h3 confirmed it. I told him it was too much, and he acted a little surprised. I'm sorry, but how so you expect quality service when she has 6 tables? Give me a break. He asked if he could bring us anything before we left. REALLY?! Where were you whole she was in the weeds? When we were looking for drinks and she was bussing her own tables? Ugh. I'm glad we left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H2g3o8NagtK24uFpMnHUoA"
  },
  "uX-rbSPV75BYNsPVuozdRw": {
    "date": "8/9/2016",
    "text": "Go at least once if not twice a week for lunch, always great food, great service and good pricing.  Clean and friendly.  Sha is great ask if she is working",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yPKeVlvB_o-01iDiUTfzcw"
  },
  "_tvbUvpjUnsHY4UsRKFU3Q": {
    "date": "3/6/2014",
    "text": "Nicole B and I walked 2.5 miles from our hotel because we knew we would be drinking.  They had some good fruity girly drinks I liked, and we shared potato soup which was really good.  We decided on the appetizer sampler because supposedly O'Charleys is known for their chicken fingers.  They were just like any other kids meal, and the potato skins were nothing special.  But the spicy jack cheese wedges were great.  They were something different and very tasty!  We then moved on to Wild Wing Cafe to spend the next 10 hours of our excursion that day.  We returned to O'Charleys later in the week for happy hour, and were very disappointed.  We had nachos which I thought were just gross.  Our friend had grilled salmon that he seemed to enjoy.  But it took almost a 1/2 hour to get our check and we had to go, terrible service!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gF9BKX9fuTPQL-EFvSok2Q"
  },
  "9luisj36ABq4Mhwk8Wm6Ow": {
    "date": "2/9/2012",
    "text": "I stopped here today for lunch because the line at Panera was out the door and I had a meeting right after lunch so I couldn't wait forever to eat.  I was hoping to find something healthy here besides fish and broccoli but came up disappointed.  You really have to either customize your meal a lot or remove things once they arrive to get it really healthy here because there is no shortage on butter, cream., sugar and fried foods here.  I had one of their savory lunch combos which consisted of a house salad with balsamic vinagrette dressing and a baked potato, sans the butter.  This was really average food.  The salad had tons of iceberg lettuce which has no nutritional value at all, croutons, cheese and just a cucumber slice and small slice of tomato.  Very little nutritional value here and then the dressing had added sugar which i didn't need.     The only good point I will say is that the service was good from the hostess to our server.  We were greeted properly, they answered our questions and the food came out in a timely manner.  But I think it's time they realized people are trying to be more healthy these days and need to take a lesson from Ruby Tuesday and put more healthy options on the menu with all the added fat/sugar/salt, etc.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "zknPvAjN7U-Mgz7_Cp_wpw": {
    "date": "4/30/2014",
    "text": "Horrible! We waited 40 minutes to get our drinks. Out of cups!! Really?? Food order took forever. Our waitress didn't show up until we had been seated for 30 minutes.   No bread. Had to ask for it. Once she showed up, it took 15 minutes to get our drinks and bread.  Don't show up here expecting quick service!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKM-t2Fta2m6yF0TPrsxcA"
  },
  "ds9Lt936AKoboMbQwaw14A": {
    "date": "2/6/2014",
    "text": "In general we eat here when are heading somewhere else, and are in a hurry. Today it was lunch. I got 1/2 sandwich and soup combo. The meat in the sandwich was cold, the bread (Texas toast had simply soaked up whatever grease they were using to grill it. Certainly they had not actually grilled the bread -- it was soggy), the bacon was also cold. The pimento cheese was to put it bluntly gross. The soup, tomato basil however, was really good. Too bad I did not just stay with the soup. The tables in this restaurant are always dirty and sticky. Today I took a napkin and wiped down the area in front of me, the napkin came back dark brown and really gross. So the whole experience was not as well as we had hopped.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZLEy3x76eTtlYpi8De7zw"
  },
  "1ROXQmFUhmKJAeGPvcHFeQ": {
    "date": "5/9/2013",
    "text": "Went here with a group of friends for lunch on a Wednesday. Wednesday's at O'Charley's happen to be free pie Wednesday! You can pick a slice of pie with your meal or take it to go. They have all different types of pies to choose from including caramel, apple and peach.   For my meal I got the grown up grilled cheese and a bowl of the tortilla soup. The grilled cheese had 4 types of cheese, bacon, and tomato, all on buttered texas toast. The tortilla soup was very good but not very hot.   I got the grilled cheese without the tomato, and it definitely did not disappoint on cheese. The Texas Toast was a little much bread, and super filling.   The waiter was patient with our large group, but sometimes would disappear for a period of time. Overall the service and quality I have come to expect from O'Charleys.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "DOyRSdq-734mJWN8EB5w1w": {
    "date": "3/14/2016",
    "text": "We went for dinner on 3/14/2016 at 6:45 pm. Very few people, restaurant way maybe 1/3 full of customers. We wanted to sit in the bar area, to see the TV while dining, were told immediately \"no\", that wasn't possible (even though there were empty booths and no one at the bar. Two additional parties came in for tables. Hostess just stood there, asked how many in the party. 10-15 minute waits in a restaurant that had more empty tables than full!?! Staff were crawling all over the place, so it was not understaffed.  Our party got tired of waiting and finally just left. As we left, party of 5 arrived and they were told there was a 15 minute wait, no one ever got seated while we were there even though the place was practically empty. Hostess could have cared less that we left. Sad service, will never go back. Went to Jocks and Jill's instead and had an awesome experience there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q8PIbaDALX2Wp3JhN9qtvg"
  },
  "yhO6pwTo9hseoC2mThJJew": {
    "date": "7/18/2015",
    "text": "The food is amazing and the pies are spot on. I love coming here and the staff are great.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEXQPLOCIgYoNXeekjL2aQ"
  },
  "pK9lW9HyGUtR6-FD3EoyIQ": {
    "date": "2/19/2018",
    "text": "I had the Sirloin steak which was pretty awesome.  I go to a lot of expensive steakhousess and the steak that I got at O'Charley's was just as good.  Trying to eat healthier these days so I passed on the warm bread.  The broccoli and baked potato were both hot, which I like quite a bit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ULqxOKtK8599eZ-FBg7M_w"
  },
  "IzvWaLizM4-IPBM7shTQPA": {
    "date": "3/1/2014",
    "text": "Service was outstanding. I hadn't even pulled out my phone to check in yet & bread was already being sat down on my table. Wow! Portions & service was outstanding! I was impress w/our servers professionalism.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "itulcnlrHQ-0H1NOmslrIg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/itulcnlrHQ-0H1NOmslrIg/o.jpg"
      },
      {
        "img_id": "kLkoWn5WPDIv3q1Vnt_ogg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Fried pickles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kLkoWn5WPDIv3q1Vnt_ogg/o.jpg"
      },
      {
        "img_id": "GuQlgZabxGJzvsgFjF9QZw",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. The cotton candy quickly dissolved into the sprite.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GuQlgZabxGJzvsgFjF9QZw/o.jpg"
      }
    ],
    "user_id": "crxCoOqJ7hatSTwbRSsDCg"
  },
  "1umAIJEwFetH5rB4zdKbeA": {
    "date": "10/3/2017",
    "text": "We were greeted with a warm smile by the manager. He seated us and we got great service. The food was good and so was the atmosphere. I would recommend this location to anyone. We will be back. Thanks guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRje3sGjlxeDc5eUhvpumA"
  },
  "sf4LXq6VuCrMVovhwAgTiw": {
    "date": "3/8/2016",
    "text": "My lesson of the day, do not jump to conclusions. My dad had to catch a flight and it was taking longer than we expected so we needed to get our food to go. We explained the situation to our waitress, Tammy, and she went to get us boxes and bring us the checks.   Unfortunately, my dad couldn't wait any longer and he had to leave. I stayed and paid. I used $20 for my parents check and paid for mine with a credit card. When Tammy brought back the slip for me to sign, she didn't being back any change. Immediately, I became angry and felt like she was stealing.  Of course, I was going to tip her but it seemed extremely inappropriate for her to assume that I would tip her. I asked for the manager and explained the situation. During the conversation Tammy came over. She asked what she did and then she explained that she thought the $20 was my dad's and that since he left, he didn't need any change.  From her perspective, it made sense. We both apologized for the misunderstanding and I ended up giving her an even bigger tip.  The only reason I'm giving them 4 stars is I wish Tammy hadn't gone MIA for 10 minutes before our food came out. If we could have found her sooner, we wouldn't have the mix up and my dad could have taken his food to go.  I would definitely come back. The manager and Tammy were very accommodating and the chicken pot pie is delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WbBEadT84C8dC190pLgzcA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WbBEadT84C8dC190pLgzcA/o.jpg"
      }
    ],
    "user_id": "ZDreldnEsHSmoNmlL5X4RQ"
  },
  "GSUFV0GXN5fTczEcAIcckQ": {
    "date": "6/16/2016",
    "text": "I really like this place. I haven't been able to eat solid food for awhile because of a stomach issue. I started back about a week and a half ago. This was my first steak in about two months. I don't know if that is the reason but the steak was soooooo good and the margarita was absolutely delicious. I'm going back next Tuesday to make sure. No joke. Lol",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OIwh_4P-7khXH2PulSenUg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Ribeye, medium, with mushrooms, broccoli and loaded mashed potatoes.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OIwh_4P-7khXH2PulSenUg/o.jpg"
      },
      {
        "img_id": "3akj8-GhWYmjN5xbHQjK9A",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. This the $4.00 margarita they have Tuesday and Wednesday. It is delicious.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3akj8-GhWYmjN5xbHQjK9A/o.jpg"
      }
    ],
    "user_id": "jifM1TQWQNbbSfqWDc9o9g"
  },
  "OwVTMysGUNHbo50btJXTIA": {
    "date": "1/1/2013",
    "text": "UPDATE!!! The brunch items here are all very good however I think the best deal if you are really hungry is the Overloaded Brunch Platter! It comes with a 6oz sirloin, two eggs, three slices of bacon and a half waffle! Everything is just so delicious! The steak and eggs are cooked to order however you chose and the waffle is light and flaky!   Add a made from scratch strawberry lemonade and I can guarantee an outstanding meal!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "OjlO3XyBEMzI9xMgR4En_g",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Overloaded Brunch Platter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OjlO3XyBEMzI9xMgR4En_g/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "C-viUdZRsHGzVkbp6zj03Q": {
    "date": "5/6/2018",
    "text": "The manager here and the wait staff are incredible! They did the absolute most to make sure we were happy and satisfied! We'll all definitely be coming back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1eqGJzARC7BlAGiZMJmwXA"
  },
  "c9FD2HthlEYGFXpCPRUPzA": {
    "date": "3/19/2017",
    "text": "I am usually pleased with my experience at OCharleys but not this time. The restaurant is not busy especially considering it is a Sunday evening. Although it is not crowded there are multiple dirty tables and the floor needs sweeping.  Despite the obvious work to be done, two employees are seated at a table in conversation. My date ordered baby back ribs which were extremely fatty and not too tasty. I ordered the honey dipped buttermilk fried chicken, it was fried too hard but tasty. My collard greens were too sweet but the mashed sweet potatoes were good.  The customer service needs improvement. We walked in to an empty hostess stand. A waitress walked by, did not greet us but yelled to her coworker that there were people at the door. Our disheveled waitress was not rude but could have been more professional and pleasant. I had to get up to find her to request silverware after we received our food. The bathroom was smelly and unkempt.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "WYKPXp38dA1lhIGzoD3gIA"
  },
  "CzeENgK5deUB1zGtY72zhw": {
    "date": "3/23/2018",
    "text": "Great experience!! Pat was our waiter tonight , service was professional and extremely prompt also the food was delicious! We got the New Orleans Pasta. It was our first time coming and we certainly will be back. Thank you to the staff and management for a wonderful experience !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UL1fGTks4favi4IxfNAIPw"
  },
  "hlk3VDIQuHFva2RwV-4ttw": {
    "date": "2/29/2016",
    "text": "I never dine at O Charley's. Not since high school. The interior has stayed untouched. What's the movie with Ryan Reynolds where he works in a restaurant? It looks EXACTLY like that inside. Everyone here was friendly. The place was super clean (bathrooms included). Waitress was on par. No one at the table was used to house salads not coming with shredded cheese like other steakhouses so by the time we all realized, the waitress made 2 trips back to the kitchen for it. We felt bad and left a higher too for the extra work haha.   I ordered the prime rib, medium. It was sad. A good bit of fat and it just looked SAD. Maybe 6 oz.  for $15. The cook let it hang out on the grill until it was medium-well to the FULLEST extent. I didn't want to send it back since I hadn't had breakfast or lunch that day. The French silk pie was awesome and a good price. I kept 1 star for having an amateur cook on the line on a Saturday night, and 1 for the price. They could make better food to keep customers coming back and maybe a small lit up sign at the actual turn inside the complex (the restaurant is buried behind the IHOP and Arby's).  Cheers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hg9nHKYhRUSKWwgnXgn6Jg"
  },
  "JmzxOvOgdmOf81RUF9oGgw": {
    "date": "2/15/2018",
    "text": "Great food and service - could use some interior updates but well kept .Love free pie Wednesday!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6kffePoc3y6rLo3MUtRYpw"
  },
  "XJtZFYx-xhvQGZCq-D8d9A": {
    "date": "8/5/2018",
    "text": "We used to love this O'Charley's.  The food and service used to be great.  Over the past few months we have noticed a sharp decline, culminating in tonight's debacle.  We've experienced server issues before, but we have kids and if the food is good, I can understand the service industry isn't easy so we tend to overlook most lackluster service.  This time was different and we won't be back.  Tonight was a disaster from the hostess to the server to three kitchen to the manager.  Two different people tried to seat us and walked away to find a table but never came back.  Eventually, we did get a table, but had to go ask if someone would take our drink orders.  Ten minutes later, a server showed up to take our orders.  We waited over thirty minutes for our appetizer to show up.  Then, ten minutes later, three out of six orders showed up.  One order was wrong and had to be taken back.  Fifteen minutes later two other orders showed up.  Ten minutes later the last order showed up.  Our drinks were never refilled and a second beer was never delivered.  The manager never showed up, but did comp our meal when one of our party went through the restaurant to find her.  I don't like to take comps and I have never left without tipping, but I've never experienced such a top to bottom disaster.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gS9p70FbVRskNfE8oeQ0YQ"
  },
  "EL0FLSX95eXDPP21PR9yVw": {
    "date": "4/30/2017",
    "text": "Ok....first time here.  The artichoke dip GREAT.  THE DOWNSIDE?  The tortilla chips made in old oil. Tasted like eating play doh.  Complained to manager and he gave us a 10%  discount on bill. The rest of meal was GREAT. The prime rib tasty and well made. Will be back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R-z10CACfs5nNEG-ZWGFNQ"
  },
  "z6Z_f2APjVvMZcLk0rn8Sw": {
    "date": "2/28/2012",
    "text": "Sometimes you get to choose the restaurants and sometimes the person you're eating with makes the choice. Because my friend has a three year old and he likes the corn dogs on the kids menu, this was her choice.  It's a very standard casual dining. Very similar to Applebee's, Friday's, Tuesday's and the like. No salad bar, but they have a large dining area and a large bar area. The menu is classic American entrees that usually come with fries. I had a turkey cheese burger which was okay. Get the sweet potato fries if you remember. My friend had the prime rib, which was surprisingly a really good cut. Not very marbled or fatty, it was an inch thick and it was all meat. With mashed potatoes, it looked excellent.  Service was good. You have to pay attention for navigating to the restaurant. There are a couple of fast food places and none of them have an entrance through their parking lot.  Here's where I take off the third star. Why did I get charged $2.49 for a soda water? This simple glass of carbonated water (no Coke syrup) maybe cost them 25 cents and that's if I dropped the glass. What a ripoff here. Seriously.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "KWNIRFyeGRKH_t56clv1zQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KWNIRFyeGRKH_t56clv1zQ/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "9iY4jfVFK--rH6Jn-t2hmg": {
    "date": "4/6/2017",
    "text": "I like this place. The bread is amazing, service is OK, and I wish they would Bring back the ribbon fries  I loved them",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MH9e91DOUkK6DkZEBpr-xw"
  },
  "aH4HJMFaeKlstZhdUHxBQg": {
    "date": "12/26/2015",
    "text": "Service is getting better at this place but still has a way to go. Our server was attentive and the rolls and appetizers came out quickly. After that, the meals took a while to come out. The place was not very busy but our server seemed to be covering most of the restaurant alone. My mother enjoyed her birthday lunch. We ordered a variety of dishes which were all basic American fare. Nothing to write home about and no major complaints.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y3M1qBUJLkvENfLK-rGsTQ"
  },
  "JkE5JjS5VyECFIR95bf2CA": {
    "date": "2/12/2017",
    "text": "Brunch this AM at OCharley's. This is always a good choice for brunch if you can hold out until 10 AM on a Sunday. Good food and there usually isn't a wait to be seated. The hot yeast rolls are a good starter and the food usually comes out quickly. Always a good choice for the segway from breakfast to lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4ss64DRMGigk3cep2Ax2xg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Egg scamble....Everything you can think of in eggs over Parmeasan Potatoes.  Toast,, bacon and fresh fruit.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4ss64DRMGigk3cep2Ax2xg/o.jpg"
      },
      {
        "img_id": "DXHE8pzm1nGERZtwOl46Gg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Belgian Waffel,  scrambled eggs Parmeasan Potatoes and bacon. Fresh fruit.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DXHE8pzm1nGERZtwOl46Gg/o.jpg"
      }
    ],
    "user_id": "huY3MY1gWZAw8_aNJD4PBw"
  },
  "O7ONQ_xdIsvUuHVl8RPD9g": {
    "date": "4/25/2016",
    "text": "The family and I made a last minute decision to go out to dinner tonight. Decided on O'Charleys since we've never been there before and the menu looked appetizing. We ordered the Steak & Crabcake, Fish & Chips, and Cajun Chicken Pasta.   First off, the service gets 5/5. I forget our servers name now but he was fabulous. Never let our drinks run out. Kept the refillable drinks full. Didn't hover or crowd the table. He did awesome.   The Steak & Crabcakes get a 5/5 for plate size and taste. This was ordered with the pilaf a baked potato. The steak was cooked perfectly to order, Crabcake was tasty and mild in flavor. Sides were flavorful and not dry at all.   The Fish & Chips get a 4/5. The fish was good and flaky but I wish it was crispier. Not much else you can say about fish and French fries.   The Cajun Chicken Pasta sadly gets a 2/5. It wasn't horrible but I definitely wouldn't advertise it as \"Cajun\" or as having a \"spicy Cajun sauce\". While the pasta was cooked correctly and the flavor of the peppers (green and red, not spicy peppers) does come though in the sauce, there just wasn't anything about the flavor that I'd call Cajun. I hate to say but the Parmesan Shrimp Pasta at Ruby Tuesdays has more of that flavor than this dish had. I think maybe if the chef was a little heavier handed on the seasoning or maybe if the chicken were blackened in it then added to the pasta you would get more flavor. The manager did tell us that most people love this dish with no complaints so maybe it was an off day for the chef. I'd say if you do decide to order this then maybe ask for more seasoning if that's possible. The Bayou Shrimp Pasta has this same sauce (I believe) so maybe it's mixed beforehand.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WN6s1bzmUCcZQaDsp3Cmcw",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Fish &amp;amp; Chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WN6s1bzmUCcZQaDsp3Cmcw/o.jpg"
      },
      {
        "img_id": "kl4jOYzM4p1TlKydXhDEOg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. &amp;#34;Cajun&amp;#34; Chicken Pasta",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kl4jOYzM4p1TlKydXhDEOg/o.jpg"
      }
    ],
    "user_id": "7oOJ3GwCxI4MuqZSwZtAGw"
  },
  "BOljgvH2_UjJQJOWqo9McA": {
    "date": "4/6/2017",
    "text": "Took the kids and wife for dinner the staff was friendly the food was great my kids enjoyed there pie it was my wife birthday and she had a good time. There was people laughing and having a good time my son was dancing with the music the staff thought it was cute.My daughter said that he was been silly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vdP3lID2YA1gz_M6QDK7ng"
  },
  "yTTzOcCOcMFRuTRtwgtqjg": {
    "date": "2/27/2017",
    "text": "I would have given no stars but that was not an option! On Saturday night we made a reservation for 29 people. We showed up a few minutes early and were told they were cleaning up our tables and getting it ready for us. Another party arrived and claimed to have a reservation, yet the hostess could not find it. They asked to speak to a manager. The manager took quite some time to come talk to these people. They explained they had a reservation for 15 people that could not be located. He said they were cleaning off the back tables now and that they could have that area. My husband stepped in and said that we had made a documented reservation for 29 people and were told those tables were being cleaned off for us. The manage preceded to give away our table to the party of 15. Will never eat at O'Charleys again!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H3K9znPfoeI3FQb5CwN4Qw"
  },
  "E_ZRGWHy_tamyPE7twuF0w": {
    "date": "12/6/2018",
    "text": "I went this past week and I can say that I was impressed. The food wasnt coming out as fast as I expected but the service was excellent. I believe Xavier was his name. He took great care of us and had a lovely personality. Me and my wife will be visiting again. If you're trying to get in and out, you may be ok with timing but the service is great. Nice environment and everyone seems friendly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQTBkaYOKzZ-5jCwvOh_Tw"
  },
  "eHbHHonn_sU6jkUgDj7wog": {
    "date": "3/18/2017",
    "text": "Came for lunch with coworkers, and it's a really large restaurant. Unfortunately, our service was a bit slow from beginning to end. I tried the roll that they were famous for, and it was just okay. It was odd that they only gave us 5 for a party of 7. I ordered the fried catfish and fries, and I found the catfish and breading to be really salty. Coleslaw was decent. Overall, this place was just okay, wouldn't be at the top of my chain restaurants.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VwnOICggJ2p7onfDLOnY0Q",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Catfish and fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VwnOICggJ2p7onfDLOnY0Q/o.jpg"
      }
    ],
    "user_id": "iCYMf_sHRevmzWg8la-LVw"
  },
  "sKYm7cmlNBeop1YH7Gn_RA": {
    "date": "3/8/2019",
    "text": "Came on a Friday night and got seated right away. Our server Gary was awesome, very attentive, and our food was great. Definitely coming back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fC61UJcVG1mMVSSbPV-xnQ"
  },
  "YwWnpquqa-jH3MUzwO-P1Q": {
    "date": "6/14/2017",
    "text": "By far one of the worst dining experiences I've had in a long time. We were seated quickly, but that was the last positive of the night. Our party of four ordered cocktails and after five or more minutes three of the four arrived, however, I had leave my seat to ask the bartender to make my drink. Finally, we started to order and learned they were sold out of prime rib at 7 pm. I settled for shrimp with asparagus and mashed, and my asparagus was burnt crisp. The manager did stop by the table after we asked to see him, and did prepare a new shrimp dish. The worst part, it was Free Pie Wednesday but the service was so horrible we couldn't wait to pay our bill and leave. We will not be back. Good luck O'Charleys on S Tryon. You need it.  Happy birthday to me!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HcU6ba7OvOQL0SYlCLU35Q",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Filthy bar, too.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HcU6ba7OvOQL0SYlCLU35Q/o.jpg"
      },
      {
        "img_id": "OS7a70w16LJcRw9IzN3gfA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Filthy tables everywhere.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OS7a70w16LJcRw9IzN3gfA/o.jpg"
      },
      {
        "img_id": "YHp-DYmelLg_xX7MXovCyQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YHp-DYmelLg_xX7MXovCyQ/o.jpg"
      }
    ],
    "user_id": "Qm3OqdoOpnPsQXMGpMHtEw"
  },
  "Y4HCyLh0XHF_GIXOz-Vkzw": {
    "date": "1/29/2019",
    "text": "I tried going there for lunch today and it's PERMANENTLY CLOSED. Bummer. I always liked their daily specials and the Free Pie Wednesdays.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xk8aclARYSM7JYixrKCi6Q"
  },
  "PTQ-34Kb46NCl9yA58c9Mw": {
    "date": "5/31/2018",
    "text": "Waitress was nice and polite, food was not hot. Baked potato was hard, cold, cheese was asked but it wouldn't even melt. The steak was tough for Med well had to wait on 2nd side item... broccoli and it came out cold. Very very small portions. Rolls were good. Wasn't pleased with food at all. Quality in food has definitely declined. Others at table had drizzle fried chicken and they liked it. Salmon also was ordered and not too good was the remarks of. Cooked to long but sat apparently because it wasn't hot.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtpmSnpGkfLuocvhrgv02w"
  },
  "Q3pBvs1wxj4I2YBLlT2puw": {
    "date": "5/26/2018",
    "text": "This was my first visit to an O'Charleys and I would be lying if I said I wasn't impressed.    I went for lunch while on a business trip in Charlotte;  when I first entered it reminded me of a coco's type of restaurant. The service was outstanding and the food was good.  I fell in with their sweet tea.  I can't wait to visit the south again to visit an O'Charleys again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IwEuYa8xKSyTGk0IARoy1Q"
  },
  "Gcmm79g84ts2MSg_cEShDA": {
    "date": "11/11/2016",
    "text": "My neighborhood favorite O'Charley's was simply \"Semper Fi\" today, always faithful to serving veterans with a simply MARVELOUS offerings to the Nations veterans. I had a smothered chopped steak, with fried onions and Bacon smashed potatoes that outdid just about every meal that I ever had there, and that's quite a few. Service by my waitress was beyond reproach. I will be back shortly...after I hit the gym to shake this meal off..",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "yCaDISH0R8e5U376zDWTpQ"
  },
  "R2yrrBE7GOsvWdIV9Yll5w": {
    "date": "12/8/2016",
    "text": "I love ocharleys because the quality of the food is good for the price. We were in and out as quick as we wanted to be. The waiter was attentive but not bothersome and the food came out at reasonable time. I got the pork chop on a bed of bacon collars greens which was awesome ! I also got sweet potatoes which were just okay and a salad which I finished off the next day and was still good. Loved our waiter ... He had a sense of humor and was super nice. I recommend",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_z4yI00BOJpxUES1H62Mtg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_z4yI00BOJpxUES1H62Mtg/o.jpg"
      },
      {
        "img_id": "Fb08tYWBy4nYpqxiL3JJMQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fb08tYWBy4nYpqxiL3JJMQ/o.jpg"
      }
    ],
    "user_id": "jdcOF4skk75rjefgKBPIyQ"
  },
  "dK0MlKHmUQ8axWTt35_IVg": {
    "date": "2/17/2017",
    "text": "So I went to this O-Charley's recently for lunch. I had actually been to a different location for lunch before and tried out their awesome low country shrimp. So of course I wanted to give them another try. They're fairly matched from location to location in terms of food flavor and quality. I particularly like the mashed sweet potatoes. You don't find these everywhere but it's an awesome food concept that I think restaurants ought to be using more.  My experience this time around wasn't as good as before but it wouldn't keep me from coming back. Having come here for lunch, timing was key. But in that regard they lacked...horribly. Our waiter was fairly non-existent for the latter half of our meal experience. No refills and took several minutes to come back and take payment. Meanwhile, we were getting later and later for getting back to work.  On the food front, I tried something different: the tilapia from their $9.99 menu. My girlfriend had the peach chutney chicken. The chicken was flavorful and tasted great. The tilapia wasn't necessarily overcooked but it lacked any proper seasoning or flavor - it tasted dry and bland if not for the diced pico-like medley on top. I had to add my girlfriend's leftover balsamic dressing to it for flavor. I was also not thrilled with their standard for placing the side dish of mashed sweet potatoes on top of a napkin on the plate - the napkin got soggy and disintegrated into the rice and fish.  In any case, I like the idea of getting a free movie ticket with the purchase of two blue moon beers and two entrees. So I'll definitely have to pay them a dinner visit in the near future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "5T4Pjhewv5H-nF1YjRie4Q": {
    "date": "10/28/2017",
    "text": "I like the food at this place but the main problem is always how long you wait to get your food. No matter if it's rush hour lunch time or a slow midweek night, the food takes forever to come. The service is kind of hit or miss. Some days the service is incredible and other days it's the worst. If the service was better and the food didn't take up to an hour to come out, I would rate this place much higher.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0mRh6teyYn5n1AmN3fYvZw"
  },
  "WmEGV6_cnyOwIhXYiGJ8bA": {
    "date": "12/16/2018",
    "text": "We had a little wait when first sat down, and the server who was not suppose to be our came to help us. Courtbey was so accommodating and took excellent care of us If or when I come back, I would love for Courtney to be my server.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wQHUG7tuKCgbp57YcONNFA"
  },
  "mjdcsi15EZSoTgm5GXjXxw": {
    "date": "11/30/2018",
    "text": "My husband and I love this restaurant. We come here often. The food is fabulous.The server are very knowledgeable and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SiKcUUMxqS0W21ybkz3ymQ"
  },
  "ZtTwPgMse7cbV4ff5NDfTQ": {
    "date": "11/30/2018",
    "text": "Great, service was great. Food was wonderful, and we all loved being here. I would highly suggest, everyone to try the fish platter, lots of food at a really great price.  Georgia  burke",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7x4sbc6Ut6lCiyiB9PGvw"
  },
  "jYNVgUw7am16WMCwXki2qw": {
    "date": "11/28/2018",
    "text": "Gaby always provide us with excellent service. She is excellent and makes this our top choice for dinning pleasure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HogQS_L7hlwd3ciz16CYzg"
  },
  "fAha7ztlRov0uw8hceisOA": {
    "date": "2/14/2018",
    "text": "Very good food this is one of my favor place to take the family. I have seen a lot of managers come and leave but the food remains the same very tasty with some good services.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D8-NZKXp9Z01acxvHYM7cg"
  },
  "bHQ1ds1Pb68ZJSwCaq8Vqg": {
    "date": "6/5/2017",
    "text": "The hubby and I decided to dine in for dinner since we were nearby and haven't eaten at O'Charley's in quite a long time.  We were seated fairly quick and our waitress was very pleasant and attentive.  They have new menu items, entree combinations, and a $9.99 everyday menu list as well.  I ordered the steak and chicken tenders combination entree, which comes with two sides (not bad at all) and my hubby ordered the ribs and chicken tenders combination entree (w/two sides as well).  The food was prepared and delivered in a reasonable time and the hot yeast rolls were a plus, might I add.  I ordered my steak medium-well (but a little closer to medium) and it was prepared well-done and quite salty.  Rather than go through the hassle of waiting for another steak to be prepared, I ate what I could as I was quite hungry.  The chicken tenders were pretty good- a tad bit smaller in size from what I could remember from previously dining there, the fries were lukewarm, but the loaded potato soup was quite tasty.    My husband enjoyed the ribs and chicken tenders and really didn't have any complaints.  Again, the waitress and staff were friendly and attentive- the manager even came by to greet us (which was when we first arrived).  Overall, I'm not too sure if we were too hungry to overlook anything else, but I know I'll probably pass on ordering a steak here in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehUIsmNgA8WfiN5X2bVbGQ"
  },
  "dyKp_PVBC7OxWS0vgWdV5Q": {
    "date": "3/9/2018",
    "text": "Worst experience ever. Seated promptly but that's where it ends. Took 2/12 hours to get salad, food came undercooked and cold . After calling manager over several times and another half hour,got the bill. Never again!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vY9fVX8Kx0ZBOyJOc-z1hw"
  },
  "9y1e5-Pma7deQiZ9P_D34A": {
    "date": "12/30/2017",
    "text": "How do I give zero stars? I ordered a salad with the chipotle chicken tenders on it. The first time it came out it had grilled chicken with barbecue sauce on the side. I sent it back telling her that I had chipotle chicken and she returned with the same chicken tossed in the barbecue sauce. I told her again that I asked for chipotle chicken and she and I manager informed me that this was chipotle chicken. My daughter was with me and she actually had chipotle chicken. when I pointed out that they were nothing alike she just said that I was mistaken and left the plate. I ended up not eating my order and still get charged for it without any attempt to make it correct by the restaurant. That will be the last dollar that O'Charleys gets from me",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAb-LxS4wqYikL2SuQx-MQ"
  },
  "B-5FvYbDu6paYThEaNU1yg": {
    "date": "4/5/2014",
    "text": "Warning: This will be frank!  After a few chips from the app that was included in our meal (no choice) found a hair that didn't belong to us.   After saying; I want to return (to another location) to get Prime Rib - I was just reminded of all the farting that took place after the meal. It was consistent and smelly to say the least. I thought it was my body punishing me for going off the \"eat clean menu\" but nope it was mos def this meal.   On to other measurable things:   Potato Soup = worst I've ever had... 0 Stars Bread = ok, they bring it right over ... 3 Stars Prime Rib = flavorful                    .....   4 stars Service - eh, ok.  Ambience - nothing striking  Price - average deal  Location - OMG, I forget what Southern living is like but at least the strip malls are aplenty over this way. And a Sonic's off the interstate.   Overall all - 2 stars  But Diner beWare  FYI: because we had Prime Rib with just soup. Our meat (the entree) came before the water was provided. Ain't that's something?",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "aolAD467g2HqiGojxa4Xeg": {
    "date": "7/13/2019",
    "text": "We had a great time for early dinner here earlier today. Appetizers came out quickly and were delicious. Our meals were just as yummy as we could imagine and despite it only being her SECOND DAY, our waitress Ashley was a delight! She was kind, helpful and super friendly! We'll be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZ_FIbQBo4k-OrSrz7z6kw"
  },
  "en36BO9mjeQnUs9_I4id8w": {
    "date": "8/18/2019",
    "text": "We come EVERY week for FREE pie ;) No more....Our servicer is always GREAT. He gives GREAT service every time. Food was good, rolls are divine.  Until the large bug dropped from the ceiling into my hair, during my meal.  I freaked out another waiter was clam. He smacked the large bug off the table and stepped on it \"yuck\".   No one on duty apologized. I assumed they didn't feel they needed too? I left a message for the store manager to call me. NOTHING!     Needless to say we have to find another restaurant for date night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR0qmXI90phOHo4xalNrsg"
  },
  "sn7XYLjUQ4N2CeCp0Vq4KQ": {
    "date": "9/6/2018",
    "text": "We noticed the servers grabbing rolls with bare hands through the kitchen window as we were walking pass.   Not acceptable. And now I'm worried about how the food is handled back there. NOBODY wants their food handled with bare hands. Especially with individuals who have to touch doors, menus and tables as they work.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kDuQ99U15UzvymVqKpL_hA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kDuQ99U15UzvymVqKpL_hA/o.jpg"
      }
    ],
    "user_id": "Rdd9gBOskv-0jYnl4xbcVA"
  },
  "YKaWH0EGrjtYcvjAH3MHVA": {
    "date": "11/16/2017",
    "text": "I have never been to O'Charley before.. But I heard the biscuits is to die for. So I'm like why not. Little man and I stopped in around 6:45pm on a Wednesday. It's a full house but not jammed pack. Our waiter is Steve. Hostess seated us right away.   Food: 5/5 chips and spicy Queso cheese dip. The chips are potatoes that seem to be lightly fired but not greasy. And the cheese wasn't spicy as mentioned so I'm ok with. Little man loves it.  I had the T-bone steak. 22oz to be exact. It's soo good. Well seasoned and cooked medium. Perfection!   Restaurant: 4/5 They can be slow with busting the table. But decor was comforting and simple.   Customer service: 4/5 Steve was get but at times, it seem like I would wait a bit to get a refill on coke or a box or even for him to take my check.   All and all. I like this place. Will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "A7ON8EEBLBbe6jjg1xTqIA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/A7ON8EEBLBbe6jjg1xTqIA/o.jpg"
      },
      {
        "img_id": "VyIwJMvH2WqTkKDdUNzArA",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VyIwJMvH2WqTkKDdUNzArA/o.jpg"
      }
    ],
    "user_id": "jcURiDqCLY7AOqo8KClJnQ"
  },
  "pum_0QmEnD2PbHs_QGKupw": {
    "date": "7/9/2019",
    "text": "We've been coming to this O'Charleys for over 5 years and consistently we have received excellent service. We've always had nice waiters but one in particular, Jarrell, has given us excellent customer care each time we dine here. Every time we decide to try something new he has always been able to extensively describe the food on the menu and occasionally makes suggestions. Jarrell is always neat, tidy, and prompt with his service and he has always greeted us with a smile. We've been able to spend some of our best memories here with family and friends simply because he always makes us feel welcomed at O'Carleys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Y5_naa4UgIlBg7MFQEJGg"
  },
  "JhZYPIt_962SK-3JknBnSA": {
    "date": "3/31/2019",
    "text": "My family and I went by to eat after church today. Our service was absolutely horrible. Granted we were a party of 10. Of the 10 there were 3 kids. We get seated I asked for 2 high chairs we were told that they were low on high chairs and she'd go find 2 and bring them back. Let's just say she never came back. Our waitress was not equipped to handle a table of 10. She forgot all sorts of things. Never got refills. Orders came out wrong. My side salad had to be sent back because the lettuce was brown and my salmon was extremely cold. Only thing that was great was my soup. But my soup was served without a spoon and I had to ask for it twice. This is a staple place for my family after church and has been for many many years. May be time to take our business elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eV_7h4rSXanvZ592eT_YBQ"
  },
  "7ipT-gu2dBUfk44yXr-cxQ": {
    "date": "5/3/2019",
    "text": "We arw visiting the area and decided to try this place.  I was not in the best of moods and my server Gary was the best.  Lightened my mood, knowledgeable and friendly.  His recommendation for a meal turned into something amazing. I walked out in a way better mood. Thank you.  Please don't loose him.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pVwjLH4HnmUGIr7ZiiYN7w"
  },
  "bakZn8o_mMWnsyqNkg-dWw": {
    "date": "5/3/2019",
    "text": "I went on a Thurday afternoon. I ordered the cheesebuger and ordered salad instead of fries with it. My daughter ordered the corn dog plate from the kids menu. The food and drinks tea and lemonade) were very tasty. And the portions were just right and just the right temperature . The drinks were very cold just the way I like them. And the food, especially those yummy yeast rolls was delicious !!!! I couldnt believe how inexpensive the bill was. . And Noel our server was so nice and sweet and inviting I have to give her a shout out!!! Thanks Noel for being so genuine and pleasant. I wish all waitresses were like you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RaAiV9KiS0gx2MF8-f0mLA"
  },
  "96NY1uJtjXm14xtPjiXc9w": {
    "date": "1/11/2019",
    "text": "Just got this to-go or curbside.  1. Yuck nothing was good. Even the rolls were nasty.  2. Chips are soooo stale  3. Spinach and  artichoke dip was disgusting 4. We asked for a extra honey mustard and the curbside person said \"yea if you come in\"  Don't go the service and food are nasty",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v11fpjpfwnZx-1uHX3jd6w"
  },
  "UgQ_apiixDqxe8yfBeMBIA": {
    "date": "11/30/2018",
    "text": "Great place to eat! My family had been regulars for awhile! Always variety of options!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WBqBsIokw9NmXEKzrsDhrg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WBqBsIokw9NmXEKzrsDhrg/o.jpg"
      },
      {
        "img_id": "J-boiFAYa1XJ9SzZIMY4xg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/J-boiFAYa1XJ9SzZIMY4xg/o.jpg"
      }
    ],
    "user_id": "w7Ro-XmNTVe2aand6nT8lg"
  },
  "kmCRx2li3Pjz3VXc9WXvsQ": {
    "date": "5/16/2019",
    "text": "The restaurant was not crowded but it took an extremely long time to get our drinks and food. We ordered the strawberry lemonade. Apparently it was coming from the bar. It was pictured with chunks of strawberries in it. It came with none. I asked about it. They brought me 1 strawberry sliced in 3 slices. The drink was very sweet. When we finally got our food it was good. Not worth the wait but good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7PhP0SfJnhqyezzvzztqyA"
  },
  "NW4fEXm9lrivRhc2MQ1N-A": {
    "date": "4/3/2018",
    "text": "Love O'Charley's. They have like a different special every day of the week. Tuesday's Kids way free with a paying Adult and they have 4$ house margaritas. The yeast rolls are sooooo good as well as their homemade lemonade. My Server Patrick was OUTSTANDING. When I say he knows how to up sell that is an understatement. He made me want things I didn't know I wanted. The manager on duty also checks on the customers. One disappointment was the Fried Green Tomatoes...the breading is nasty. I believe they fry them in cornmeal and drizzle with BBQ Sauce. Weird combo so I asked for sauce on the side. The food comes out quick and hot...and their drinks are really good too. One thing is they won't let you order more than one alcoholic beverage at a time. This was a first for me. The empty one has to be removed from the table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBxT4_bjFrbZEarWz6vsCQ"
  },
  "KOHlpr79k9P-sG9Bt-_fnA": {
    "date": "2/28/2019",
    "text": "Eli sucks, he should be more like Steven. Food was okay. I ordered ribs and chicken, the chicken wasn't my favorite. Ribs were great but the fries are what sold it. Again Eli be more like Steven.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P_oawcbVaVJXFQ7_tT-IGg"
  },
  "YwWdHgsH0woQw-BQD28k_w": {
    "date": "7/23/2019",
    "text": "Went here with a few of my friends and it was disgusting. My friend ordered a medium rare steak, and it came out to be a well-done. The steak was so gritty that he couldn't even finish it. He also ordered a mac-n-cheese and it looked like they just cooked the macaroni, sprinkled some cheese on top, and threw it into the microwave. It was disappointing. How can you mess up something as simple as mac-n-cheese? I had a garlic shrimp pasta and it wasn't the greatest nor was it the worst. It should have been flavorful, but all I could taste was the tomato sauce and the rubbery shrimp. We decided to share a dessert considering that most of the foods was disappointing and wanted to clear our tongues with something sweet. The brownie we ordered was soaking wet. The ice cream sitting on top of the brownie didn't even melt yet. I was concerned, but it was honestly not the worst we've had on the menu. The service was alright. They did their job.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ujtkz8SDKubxdZpJ527hBA"
  },
  "0Tl-8skLr1_mtTHdJ_M6tg": {
    "date": "1/3/2019",
    "text": "This is my third time at O'Charley's. This location is convenient to where I work and they're usually pretty slow between 2-4 pm when I'm here which I love. I can get some work done and enjoy a decent meal at a good price. I really like their unlimited soups and salads lunch special. Today I decided to order the chicken strips and broccoli. The chicken strips are pretty good but the broccoli is over cooked. This is the first time that I've also experienced terrible service here. I waited for my server for about 7-10 minutes to even let her know that I couldn't eat the broccoli. When I finally got a chance to say something she told me that I could get another side. I asked if I could just get another batch of broccoli but I was told that she already fussed about what it looked like prior to bringing it out so she knows for sure that they're all made that way....in the end I got the mashed potatoes with bacon on top. It was ok...   My friend also ordered catfish and got shrimp instead . He didn't want I wait long again to get his meal. He thought it was just okay also.   Pros: not busy, usually fast service and better wait staff   Cons: bad day (I guess); bad service   I'll try them again hopefully we'll get back to normal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvSpXcSHxFA5zl_LoqF_LQ"
  },
  "GpMT9xj_HOewMkMk_mPTKg": {
    "date": "5/13/2019",
    "text": "My family visited this location for my mother's birthday this past weekend. We have been to O'Charley's before and it was pretty good. This time, however, was perfect! The food was just as good as it always is but our server, Noel, was one of the most amazing servers I have had the privilege of meeting. She was incredibly personable, attentive, and kind. She kept our drinks full, she kept the rolls coming, she answered all of our questions, and was SO nice and funny. Her personality and level of service alone will/would keep us coming back over and over - especially if we can get her again. I highly recommend going to O'Charley's and requesting Noel - you WILL NOT regret it. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6eF1_50OUHu0gwwTGJe8uA"
  },
  "Jj9HFDzXLXRx0Eh_EvrCaQ": {
    "date": "4/27/2019",
    "text": "Worse establishment I've been to, service is awful, had to ask for a waitress and still haven't gotten my food or drink. Would not send my worst enemy here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJcyfdocWkFhvo1f6IgRjQ"
  },
  "2nAXs6xt9I1VhFew8aY3uw": {
    "date": "8/2/2018",
    "text": "Sadly some information  missing from this sign. Like it's not good the day you sign up. So you get stuck paying for you appetizer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tbylhmKoMVq8RqFBm55V4Q",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. But no good for the visit, so surprise you have to pay for the app. That is bait and switch advertising!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tbylhmKoMVq8RqFBm55V4Q/o.jpg"
      }
    ],
    "user_id": "3eAW70d5zqDmK_HaN_BKww"
  },
  "_xLUMGGry97LIXVpMb0KpA": {
    "date": "7/9/2016",
    "text": "I've always had great service at this location. I've gotten to go orders as well as dining in. We always get the prime rib when we come here. It's cooked perfectly and we always get it medium rare. Fridays they usually have clam chowder soup and that's what I always get when I'm here that night. Soup is so good. It's thick and white based and has just the right amount of potatoes and clams. We also love their fried mozzarella pepperjack triangles. It's great with their spicy robust marinara sauce. You also can't go wrong with their chicken tenders and their ranch dressing is on point!   If you sign up for coupons you will also get a good bit of 20% off coupons.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "xZFAEfpvW1ddlOFV2zAhUQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Prime rib medium rare with broccoli and loaded potato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xZFAEfpvW1ddlOFV2zAhUQ/o.jpg"
      },
      {
        "img_id": "bQUUjVOpgItKMmktTw6JSQ",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Medium rare prime rib with rice pilaf",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bQUUjVOpgItKMmktTw6JSQ/o.jpg"
      },
      {
        "img_id": "WfOtiysQvd6NUnhX8NZJzg",
        "caption": "Photo of O'Charley's Restaurant &amp; Bar - Charlotte, NC, United States. Loaded potato soup with green onions",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WfOtiysQvd6NUnhX8NZJzg/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "WFqp_Msyl8eHqMM85t5aiw": {
    "date": "1/12/2019",
    "text": "How is it that i order my food at 209pm for a 245 curbside pick up that i had to go in to get and here it's is 306pm just getting my order. The hostess was very nice and polite even gave me a curiosity drink but what is curbside for it you can't use it and the food isn't ready",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pn9LWm9p7lFUivsGxvbvMQ"
  },
  "7Ugk1XQoSRGOo1DtfsDC9g": {
    "date": "6/4/2009",
    "text": "Frankly, I'm surprised this place has remained in business as long as it has.  I gave it a couple of chances, but always walked away disappointed.  The food isn't really the issue, but it's nothing special either.  The service here is consistently atrocious.  I've had waiters forget about me, I've seen them bring out completely incorrect orders, and I've had cold food brought out after absurdly long waits.  For this type of dining, just head up the road to Chili's and give O'Charley's a pass.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gbLDIMl3C1TePOxlOkBmw"
  },
  "zal9OD8xoHCf3w6qbrSQMw": {
    "date": "7/19/2011",
    "text": "food good.  service great.  it is a chain.  for a chain they do a good job.  they also mix a VERY GOOD martini.  their sunday brunch is very good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iN5kL0PrH0lb_69fZ6difQ"
  }
}