{
  "LLO2nBWpwodujmYds8PZKA": {
    "date": "8/2/2014",
    "text": "Lasagna was oily and overcooked. Table Service was good. Ranch was great. Hostess forced me to let a regular pay before me since I had a groupon and my checkout required more time than the regular customer.  That was rude and inconsiderate of my time. I told her this after the regular left. She apologized.  Overall,  it was ok. I have another groupon so they get a 2nd chance.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "uAmp5DTo0o9_kHcoPi4nXg"
  },
  "YgW56o7KHBDQu4BG4SkHrQ": {
    "date": "9/6/2012",
    "text": "Lunch today at Crown Point.  First of all, the service was excellent and the food was good, but nothing outstanding.  My hambuger steak, mashed potatoes and gravy were good, but I have had better.  My salad was a typical salad made with iceberg lettuce.  My wife had the crab cake sandwich which was good, but she also had better ones in the past..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "drTMOo4p8nL0pnMNEyat2A"
  },
  "lgVFOJOqL7QtCbjPGxJBMA": {
    "date": "6/24/2013",
    "text": "Good southern food with a Greek influence.  Wish this was closer to home. Have the best chicken n dumplings only once a week!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5uUOcTyKK1pQYwAL-Xrnw"
  },
  "To4haIjRILmf55FvVRLlEA": {
    "date": "7/30/2010",
    "text": "Snuggled between several mediocre chain restaurants, this 15 yr. old establishment is proof that Charlotte still has a gastronomical soul.  It's Greek-owned and the dishes reflect that, but they have definitely mastered the art (soul?) of Southern food.  The food is your standard American fare.  Pasta, steaks, chicken, fish, but certainly not generic in flavor! They advertise fried squash on the billboard-crispy golden chips of grease-saturated goodness.  I normally get the stuffed chicken (feta cheese and spinach) for dinner for $8.  That includes 2 sides, bread, and soup!  I'm not kidding!   Homemade dessert includes a killer chocolate cake with 2 types of mousse.  Plus, they have a full bar for all you imbibers of hard drink.  Don't get me wrong though-this is definitely a family restaurant.  You will be seated immediately and the service is top-notch.  Don't waste your time at nearby restaurants that skimp on portions and service-Crown Point is your place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ca7JOg4Tx0oyhze9vFUgpw",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ca7JOg4Tx0oyhze9vFUgpw/o.jpg"
      }
    ],
    "user_id": "7IZQ06zkYSCLQM4JU9kFvg"
  },
  "orZT5S0LWYkffFT_Yr-KQA": {
    "date": "5/27/2012",
    "text": "I have had a change of heart with this place. I think I first went in there on bad days ( mine or theirs). My wife went in for lunch today and their lentil soup was delish, along with their beef roast, which was fall-apart tender. I will be back!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6-5PkPlDNQ82OC6TKXlM9g"
  },
  "yqQAeXqL1sgaJjLPzpDuHg": {
    "date": "7/31/2015",
    "text": "Excellent!  The service was friendly,  efficient  and very helpful. High marks for the food; quality, wide choices, vegetables locally grown, nothing frozen.  Very comfortable surroundings, quiet and spacious enough for effortless private conversations.   I'll be back frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zsrm110fr9sFm0llTIu3VA"
  },
  "m9AUAXpI4II_SxbEUYuj9w": {
    "date": "3/4/2010",
    "text": "We stopped here on our way to Cracker Barrel...more interesting but not memorable.   Okra was a hit with the kids--bigger portions than CB's.  Tried the fried squash. Not worth it, being bland and boring and needing lots of salt and/or ketchup to keep the taste buds activated.   Fried chicken livers were large and crisp and (again) tasteless. Needed lots of salt.   Chicken parmigian was average--not savory and saucy. The chicken beneath the sauce was...wait for it...lacking in zest. Needed salt.   Mashed potatoes and gravy were good. Could have stood a lot more of them.   The food took a long time to come. Very busy place, tilted towards older clientele.   HOWEVER, the bread was worth the visit, all by itself. Amazing little rolls with perfect crust/yeast/softness mixture, resting above the butters so they were melty when applied to the bread.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "nYfu8osX5V1xEg-YeDewzg"
  },
  "ahjRp_O3d2kZoh8nbcx9LA": {
    "date": "6/7/2013",
    "text": "I really like Crown Point! It's family oriented, and the customer service is good.  The last time my fiance and I came here, I ordered the chicken strips and fries. The chicken was nice and crispy, but it had no salt and pepper. It was really disappointing, but the crunch made up for it I suppose.  One thing I love about restaurants is the bread they give you. Crown Point however only gives you as many pieces on what your party is. That's really lacking and it looks cheap.  But otherwise, the customer service has always been good! I will keep coming back for a long time. :)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BNAsSlP2bLJGYLvpe8lfKw"
  },
  "wXXqedchoMpuHmhBZ0t5BQ": {
    "date": "6/18/2012",
    "text": "I went here for lunch today, for the last time. I ordered the fried country steak. I received a piece of yesterday's roast beef, that was breaded fried and soaked in canned gravy.  If you want a so so lunch, don't go here, if you want a good lunch, really don't go here. I have tried this place 5 or 6 times over the past 4 years thinking it will get better, it doesn't.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9dacmjKE8x7huEADPnW3Mg"
  },
  "BvtI6R5Nc3sgCeL3oRRQ4Q": {
    "date": "6/28/2014",
    "text": "Not sure why there are so many positive reviews. The food was just ok. The collard greens were tasteless. Tasted like all they did was boil them in water -- no seasoning at all. The squash was better than what you would get elsewhere but still not all that great. Friendly waitress, pleasant atmosphere. Maybe some other menu items are better but I probably won't go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v_mDjmSdwsXX2fSyafHsA"
  },
  "SAUJC8u8kMpx6ZUByFva_Q": {
    "date": "4/23/2013",
    "text": "We visited Crown Point for the first time last night. We were looking for a local establishment with home cooked meals. I pass by here every day so I looked up the menu online and was pleased with the choices and prices and we gave it a try. The staff was friendly but the atmosphere was lacking....I give it a 2. Dark, dismal, and there were still Christmas decorations up. The darkness was more reminiscent of a lounge than a family restaurant. We ordered one of the daily specials and were pleased. The food was freshly prepared, hot, and plentiful. I give it a 4.  That being said, I would probably only visit here again in a pinch. A renovation to the interior is in order to get me to become a regular customer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nx-vnBAALZo_GMQW6oi8RA"
  },
  "7iD8y50X2PjxClItUnTybg": {
    "date": "12/22/2011",
    "text": "Stay away from the whole catfish. After cut the fins off and deboning it myself, it tasted like an aquarium smells. However after wards they comped the horrible dish, they said they had other complaints.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtfJ_wugg7NPgkoh7mrMfQ"
  },
  "NIkFBgK2IO42fzbaOoeesA": {
    "date": "11/4/2014",
    "text": "I had really enjoyed this place. The food was generally tasty, decent servings, and great price. I liked the atmosphere and how friendly the servers were. It definitely had a family feel to it. But, a few months ago they changed up their menu - they removed their prime rib (which was DELICIOUS) and jacked up the prices on their steaks. Now we will only go there if I'm craving fish (their fish is pretty good). I do not recommend their burgers, though - nothing special about them in the slightest. Cheaper easier and tastier to make those at home.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "take-3qZha6sUWVj87GHjg"
  },
  "82NqDbnqsIkLf4066XLcyw": {
    "date": "11/20/2008",
    "text": "Food was nothing really special. It was a nice place to eat but there is a predominant blue hair crowd. I had a nice meal but I wouldn't say that it was really memorable.  If you need a cheap bite to eat and don't want fast food then this would be the place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4j6l2Coex7-IzmeKOHeTA"
  },
  "zGFyEKVFSMlDmjKCam8tpQ": {
    "date": "10/5/2013",
    "text": "I guess sometimes it's not wise to return as a repeat offender. That being said I don't think I will eat at crown point family restaurant for a long time if ever again for that matter.  My family ordered food, so I decided to as well, first rule of thumb when making a salad you don't pre-dress a salad if it's  going to be picked up and taken out of the restaurant.  However I personally think that no one should put dressing on your salad unless you tell them to.  It makes the lettuce, croutons and other things soggy.  Secondly it's ok not to be lazy and actually cut up the chicken.  When a Caesar salad is ordered you expect well let's say I expect to get romaine lettuce, warm grilled chicken cut into pieces not chicken strips.  With nice  hard croutons not soaked with the dressing where they then become super soft and nasty.   Parmesan cheese, and Caesar dressing, I paid 8 dollars for one of the nastiest  versions of a Caesar salad.  Never ever ever again. Ewwwwwww",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QyPcC88XQlXruvh5UBmkYw"
  },
  "cAw6TPbPGGloFkJB-n_-1g": {
    "date": "12/27/2014",
    "text": "Wow, is all I can say! Had a few vacation days and hubby asks where I'd like to go. I had seen the squash sign forever and as fried squash is one of my favorite foods (done right) we decided to check it out. Drove past my former favorite Charlotte Greek restaurant, Sir Gus, and man - I am so glad we did. Went inside and the contrast inside to outside is tremendous. Beautiful wood, meticulously clean, and the Christmas decorations were gorgeous. NOTHING was dusty anywhere. We ordered the fried squash as an appetizer - hubby got the stuffed chicken breast with side salad and greens, and I got fried chicken livers with banana pudding and fried okra. Very, very seldom do we find everything we ordered delicious, but it was - as well as obviously homemade - no pre-prepped frozen food zapped up here! Greens were nice and leafy, so you could tell they weren't frozen. The chicken livers were the best I've ever had - no veins, not under or over cooked, but just tender and perfect. Lettuce for the salad was fresh, banana pudding tasted from scratch pudding, and even the fried okra looked hand battered - not sure but very, very good. The wait staff was quick to respond, though it wasn't a busy day shortly after Christmas. The owner herself went and brought me a to-go container, as the proportions were huge and I didn't want to lose a bite. You will rarely see me say straight 5's on food, service, and atmosphere, but this takes the cake. And as another reviewer noted, the seats - and even seating areas - are all set apart so you have a feeling of privacy. We will definitely be back again. Thanks guys!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sBytk6sVuRNTci3HiXSBdg"
  },
  "TeMfIPFZOixO08Nh-A_LHQ": {
    "date": "11/22/2016",
    "text": "This is one of the last few \"meat & 3\" blue plate type restaurants in town. The decor isn't much to look at but you're going for the food. It's a great place that has good southern cooking. Their fried squash is every bit as good as their sign claims. Crispy, thick slices of squash with a side of homemade ranch for dipping. I love their Greek style chicken and potatoes. You won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JMTawnbIv1j58tRlTpgygw"
  },
  "G77n1xf6eyBia-bQXSPqGQ": {
    "date": "8/22/2017",
    "text": "The Crown Point restaurant is the worst place I've eaten in a long time. We stopped by for lunch it was 12:50pm on a Wednesday which is prime lunch time and there were 5 tables total the place was like a ghost town. We were the only person in our waitresses section party of 3. We were given the menus and drink order was given. The menu is massive they offer everything from soft pretzels to Italian dishes, they have daily specials, there are about 6 of these offered every day and they boast about their fried squash. My parents both ordered the hamburger steak special with squash okra and a salad. I ordered the chicken strips fries and mac and cheese. The salad came out for my parents and they were dripping wet, so after you put the dressing on it became like soup, I don't understand how you get a salad wet but it was. When the meals were brought I looked at my plate and was very disappointed. The mac and cheese were sitting in a pile of oil or grease I don't know which but nasty, The fries were cold and my chicken strips were bland I mean no flavor. My parents hamburger steak was good they both enjoyed it, however the world famous squash was cold and dried up as was the okra in fact, it was so hard it was like little stones hitting the plate. $35 later completely unsatisfied we will not be back and I understand why no one else was there at lunch time either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "oBgTGtFAJBjRcc_zXDxIKA",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Cold bland Chicken tenders and fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oBgTGtFAJBjRcc_zXDxIKA/o.jpg"
      },
      {
        "img_id": "dlpy-OfaDPvd9ivFczBJTA",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Mac and cheese sitting in grease",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dlpy-OfaDPvd9ivFczBJTA/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "jI1Ws1LMECJjjL_Nzx_vOQ": {
    "date": "1/31/2018",
    "text": "An older place with excellent service! Comfort foods and the fried squash was amazing! Daily specials!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfXbqCcI324coLFm9Z1JwA"
  },
  "MKgdBepIg8OQZW-M5NbnEA": {
    "date": "4/6/2016",
    "text": "It's owned and run by Greeks. Why do I say that up front, it's because it seems that most of the best restaurants in Charlotte are run by Greeks. And I hope the trend continues. It's to bad they only do breakfast on Saturdays as they are great. All the food is very good and the portions are generous and the price and low.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0cI78odeq_GKqLzk8sIrw"
  },
  "sTSmZSA4BmDVs4Ac35ZImg": {
    "date": "7/28/2016",
    "text": "This place was recently voted the 3rd  Best Restaurant for Comfort Food in Charlotte. We've been going there for years now, at least once a week and every Saturday for breakfast. This is one of the few places you can get authentic \"home-cooked\" meals that are excellent!!! Great Greek family --friendly and make you feel at home.  Prices are incredible and portions are huge.  See you there.    Update in 7/27/16:    Crown Point Family Restaurant (I call it \"The Crown\") remains our favorite \"go-to\" restaurant for a consistently good experience. The food is ALWAYS excellent and the value of what you get is the best of any restaurant in the Matthews-Charlotte area.  In this day where restaurants leverage profits against quality, the Crown Point Restaurant NEVER cuts corners. The meats are of the highest quality and the owners refuse to jack up the prices.  ***The Ribeye steak is better than ANY chain restaurant or chain steakhouse***   Not kidding.   The serving portions are HUGE.  \"The Crown\" is a family-owned restaurant and the family is always on-site making certain you have a top notch experience.  They are delightful and a pleasure to meet. Noula greets you when you arrive enthusiastically, and she genuinely cares about your experience.   Jimmy is the manager and continuously monitors the flow and process to insure that you leave satisfied.   Give \"The Crown\" a chance to impress you.  Bring the family.  You will definitely be back.  Ask for Kristen, Chris, Elainee, Brandon, Kendall or Alex.  My favorite dishes:   Grilled Pork Chops, any of the hamburgers, Baked Chicken, Chicken Parmesan, the Coke slaw, their famous fried squash, Chicken Salad--when you're lucky --they don't have it every day :(  and ANY of the Greek dishes.  Check out the bar.  Cocktails are the cheapest ANYwhere.  Look for me and my wife.   We eat there frequently.  Love the owners.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmJnSePnTopYz1IvKdbKwA"
  },
  "QaHt9ADr8zgqXXJ-7p6EMw": {
    "date": "1/2/2014",
    "text": "Just a classic CLT Greek joint. If you ever ate at Liberty East, Gus' Sir Beef, Athens, or The Amber House, you know what that means.  Wait. You. Don't. Know? OK.  It is lotsa wood and comfortable inside, but tad cheesy in an earnest, homey way. All the entrees are in the $10 range and include two sides (up from $2 back in the 50s, basically the same recipes). There will be sirloin tips, chicken livers, a seafood platter, fish fillet, whole fish (broiled is a little extra for all seafood), pastas with a Greek twist, and some sort of Greek chicken.  I went with the chicken livers, pinto beans, and collard greens. Just completely evil. The sort of guilty, messy stuff you don't want to cook at home but, man, if done right -- can't be beat. The livers had a Greek seasoning bite of earthy herbs and garlic and were clearly fired at a high, smoky temp. Better you than me, my line cook friend.  Happened to hit on a flounder fillet special night, and that went over well with several in the party.  Service was a little overwhelmed by a party of seven and in general the joint seemed understaffed with a slightly laid back, family-staffed \"I can't get fired\" vibe. Had to go annex a water pitcher to keep the table full. No matter.  Fed seven for $85 and heard no complaints. That is a good outing. Stick to the specials and help out the service and you'll do fine.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "blbQ4tvXCDhOYSrSjJz23g"
  },
  "5-1-acZ0J_UhIuS6d_moBw": {
    "date": "1/24/2017",
    "text": "I've eaten at this place for many years. The last few years however, I didnt as I was no longer in the area.  Since I've been back, I have been abusing their menu, and am happy to say, still terrific.  I see they were rated #3 in Charlotte for 'Best Comfort Food'. And for very good reason. They deserve it.  Nice people. Large portions very reasonably priced for such large portions.  All that is great, but it still boils down to 'how is the food'?  Terrific. If I could rate it higher then 5 stars I would. What do I recommend? Well, the menu is very diverse, so it all boils down to what the individual likes. Me personally, I love all food and I can attest that I've pretty much had 90% of everything on their menu and have never been disappointed.  You would never think of ordering a Steak (seafood and other stuff) from a 'diner', but I can say this, their steaks are as good or better then steaks you'll get at an actual 'steakhouse'....  The pork chops are terrific, all the seafood is great, heck even the burgers are great.  Normally white meat chicken is a tough one for me. So few places can make a chicken breast in which every part/bite is plump and juicy. Their White meat is killer (so is the dark). Very large breasts every time. Terrific flavor with every bite tender and juicy.  I've had every veggie they serve. Most are grown on their own farm and you can tell. You can't make a 'bad pick'. They are all great. Heck, while I love all food, we all like some things better then others. I'm no different. With a large list and only able to pick 2, I and most others I assume, go with 'what they personally like better'. What I can say and recommend, is even if you see veggies you like better then others, do yourself a favor and try some that aren't at the top of your list of 'favorites'. There is a very good chance, a few near the bottom of your 'favorite list', will move near the top once you try them from Crown Point.  Again, can't recommend, since everybody is different, but as I've said there is very little I havent eaten from them the past 6 months to a year (and for years going back as far as 20 years ago with a few year gap in between when I wasn't in Charlotte), and I've still yet to be disappointed.  Aside from items I've already mentioned above, the chicken livers are great, lasagna, country fried chicken, Country Style Steak (not on the regular menu but normally is a Monday special until they sell out), Beef Tips, Hamburger steak, Baked chicken, Flounder, Stuffed Flounder (2 or 3 types, all terrific), Chopped Sirloin, Stuffed Chicken Breast, Catfish (I dont even like catfish..theirs was great), Baked Virginia Ham, Crab cakes, salmon and salmon cakes, Grilled chicken tips, Grilled Beef and Chicken Tips, the pork chops, steaks, chicken, all terrific. And one of my personal Fav's, The Roast Beef/Sirloin Roast. Fantastic. Large portion (the size of a large slab of prime rib), So tender you do not need a knife and terrific flavor. Better then any roast my mother made and honestly on par and maybe better then my Grandmothers I ate as a kid.  With that said, that's what Crown Point reminds me of- 'Grandmas terrifically good home cooking'...   And imo, very deserving of being awarded '#3, Best Comfort Foods In Charlotte, NC'.  Lastly, I've read comparisons in reviews of CP and other 'comfort food diners'. While I readily admit and agree with the 'different strokes (opinions) for different folks' slogan, as every individual is different in many areas with different tastes and different expectations, I do agree wholeheartedly, that all are entitled to voice their opinions. I do find comparing CP with a place like Liberty East sort of like comparing an apple to a Volkswagen.    Whether 20 years ago or 2 weeks ago, I've never left Liberty East 'wanting to tell others they are missing out'. It suited its purpose. Not worth telling others about, but not awful...worth a few dollars, you should leave with a full stomach, but imo, no comparison.  I haven't had the chance to visit some diners I used to eat at years ago and loved (some, owned by the same family, I think), so I can't give a fair review/comparison as to how these diners are today vs years ago, but to compare CP to Lib East, is really a joke, imo....  I encourage all to take every review, whether its on the latest new TV or a restaurant, with a large grain of salt and go/buy'try and form your own opinion.  Crown Point is well worth anybody trying and you either like it or you don't.  My guess is most will thoroughly enjoy and if not, no harm, no foul...  Happy eating....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H6UfPPTGEOPs9Fr0AmXGiw"
  },
  "96kYUkmfoSyCeAPrVHXFjA": {
    "date": "9/30/2014",
    "text": "I went to Crown Point Family Restaurant with my family for lunch. We were greeted and immediately seated. The restaurant was laid back during early lunch hours. A server brings complimentary cornbread to your table. The cornbread was bland in my opinion. I prefer more sweet and moist cornbread. There are food specials each day of the week. I ordered a country fried chicken meal with fried okra and French fries. I thought the country fried chicken meal was excellent. The white gravy was flavorful which complimented Crowns chicken very well. Both sides were tasty (okra & French fries). Our server was attentive and very polite (great service). The food was reasonably priced. There's plenty of parking around the restaurant. I give Crown Point Family Restaurant a 3.5 rating.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-NbeVN5tnwdyYAvdNkKMjw"
  },
  "22Z3j_NX3J_qzbyIjcszCw": {
    "date": "12/3/2015",
    "text": "Unexpected!  I've driven past this place many times & never even considered stopping there. Good cooking, good service and a full bar, too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eLfMVp6Z_PesWwue53gnmw",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Quaint little place, very good food at affordable prices, full bar and refreshingly nice service.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eLfMVp6Z_PesWwue53gnmw/o.jpg"
      },
      {
        "img_id": "7OD6JYsMyKH8dsFb-Pj5qw",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. This place has no waiting, and it&amp;#39;s good enough to be slammed!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7OD6JYsMyKH8dsFb-Pj5qw/o.jpg"
      }
    ],
    "user_id": "NN64anv5ruhE8nnWfY7WkA"
  },
  "brOtICPUVuusbE-eUsm0bg": {
    "date": "10/2/2016",
    "text": "Good food for a low price. Service is always great. A wide variety of meals to choose from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oVuT-4V0RZynu_FH3sNTA"
  },
  "6-PyzH01yG7oJUtRz09LSg": {
    "date": "2/27/2016",
    "text": "Found a Groupon offer for this restaurant. Despite its being only ten minutes from our house we had not eaten there. It is family style food at very affordable prices. My wife and I both ordered vegetable plates. She ordered fried squash, fried okra and banana pudding (yes that's a vegetable here - guilt free, eh?). I had a side salad, mashed potatoes and gravy, and black eye peas. My wife loved the squash and okra,thought the banana pudding was not as good as her mother's (is it ever?). My salad tasted very fresh, and the peas were very favorable. The mashed potatoes were a little thin. The portions were large. The service was good and the prices reasonable. This restaurant is certainly not going to compete with $$$ restaurants, but in its niche it's quite good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iQbySy2FTboPhZA7CXiGvA"
  },
  "n87AwJ3fuSDM4zbJUfb4pw": {
    "date": "11/30/2012",
    "text": "I don't recall why I have this restaurant only 4 stars. I have no complaints except the veggies are better on Wednesdays than Thursdays!).  Always a good place to stop for the family to get something to eat.  You can get what your tummy wants and everyone leaves happy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1CzZxKs5Mm6om_cVWF8n-Q",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Club sandwich with fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1CzZxKs5Mm6om_cVWF8n-Q/o.jpg"
      },
      {
        "img_id": "jns2lMVhmovETBY74S0CBQ",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Chocolate Fantasy Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jns2lMVhmovETBY74S0CBQ/o.jpg"
      },
      {
        "img_id": "o0UKHZlqDqKyY8OeJE2qzg",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Luscious chocolate cake!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/o0UKHZlqDqKyY8OeJE2qzg/o.jpg"
      }
    ],
    "user_id": "7PiRdxYF-Uvzn2fHqdtU1Q"
  },
  "oHG-WuoF-ARtccpOcte6dw": {
    "date": "11/9/2013",
    "text": "Great family restaurant with great home cooking. We have always been met with prompt  and courteous service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "zSp0l4VCndo7Q4Icv53kaA"
  },
  "iE0fbCz_70gtIQ35SDrFug": {
    "date": "5/9/2016",
    "text": "I must admit that service is superb. Wings were over seasoned; chicken plate under-seasoned and over cooked; Mac n cheese tastes like egg and unseasoned; and I'll choose to stop there. I simply did not like the food. This could be a result of revenue--- which would explain the 70's ambiance. Oh yeah, the Groupon... read carefully.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1p5KuEmSDdOD9aE0qd7ixg"
  },
  "s1dAVrn_OJ8Sj2UYuK-Wvg": {
    "date": "2/10/2014",
    "text": "My friend and I dined there on Saturday night.  We were immediately seated after we walked into the restaurant.  The booths are very spacious and far apart from other diners.  I feel that the privacy there deserves 5 stars.  The restaurant is very clean and the service is absolutely wonderful!  The staff is very nice and will see to your needs/wants.  She ordered a seafood platter that she really enjoyed.  Her seafood was lightly breaded, but still had a nice crunch to it.    I ordered beef tips on top of rice and gravy.  Unfortunately, I didn't enjoy the beef tips too much.  The meat tasted like it had gone sour.  The rice and gravy was okay.  The fried okra is delicious and the fried squash isn't too tasty. I am a person who does not enjoy extra salt in my food and this place really met that taste.  Their food didn't have a lot of salt in it!  You can always add on more salt to your food, so that made me really happy.  We also ordered a piece of chocolate cake that didn't make a smile.  The cake was dry.  The waiter offered to bring us another dessert, but we declined her offer.  My friend and I decided to play Jenga with the cake instead.    Overall, the restaurant isn't bad for the price and service.  Remember to tip your waiter/waitress well because they run their butts off and your bill won't be expensive!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "1jbAZCXnpbO1GmjhXvO7Ew"
  },
  "qEN6xrAF_aHbW1XnVuKVEA": {
    "date": "3/19/2013",
    "text": "I visit this restaurant every Thursday, so I can say I am a regular. The staff members are always nice, respectful, the food comes quickly and is always great. I love coming to this restaurant and it is something I look forward to every Thursday. I always get a burger with no bread, cheese or mayo and it's great!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "chD0IU0TaBeKzt3ioUfOMA"
  },
  "5gEyWL3OCOy5Ug46f-jaow": {
    "date": "12/28/2015",
    "text": "One of the best family restaurants I've been to. Fresh good food at very good prices. The only complaint I have is that they only do breakfast on Saturdays.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvrXRYVusH-1HR8t1UQ_zg"
  },
  "5YdpWWAVZfIkzohde5yeRw": {
    "date": "9/8/2014",
    "text": "Tried this place out looking for something different.... we got it. There seems to be a shortage of salt and seasoning here. Everything was bland and forgetful. They need bigger glasses also. It's like a kids cup of drink. Over all it was a hot meal, the server was nice and sweet, and the ranch was really good but the food was not everything we had hoped for. We probably won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RzQdx3AIMog7E0DTYqxKNw"
  },
  "grB8BootZvHCtCFmTxTDew": {
    "date": "6/6/2015",
    "text": "This was a random pick but we were very pleased! Fried squash was great and the feta and spinach stuffed chicken was awesome!  Nice to have a large variety to choose from. Yum",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOZmVksce58sxmfxWxTsCw"
  },
  "ua1bAjvO85JKTq1w2Em4WQ": {
    "date": "8/2/2015",
    "text": "We have visited this restaurant for many years and always a good time. The food is good and always a great selection and options. Wait staff is friendly and attentive and prices are reasonable. Try the fried chicken and fried squash!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HmKcFSVNVWSV4pKgF_7XpQ"
  },
  "lxGpUyQjef5VbBCNJnw0Mg": {
    "date": "5/22/2019",
    "text": "This place from the outside doesn't look interesting however once you eat there you are hooked.  Excellent food, service!  Lots of good options and fair prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gFzoXXbQrT_AE9tYZJMztA"
  },
  "sDnCOS2Dy8f4FUs5UK5_Bw": {
    "date": "3/6/2019",
    "text": "I went here one day for lunch with my boyfriend. We pass this place all the time but finally decided to give it a try. The decor in the restaurant is a little out of date but we didn't let that stop us from trying it. The waitress was prompt and came to the table with a friendly smile. I ordered the roast beef with rice and the shrimp and flounder (couldn't decide so I got both) the shrimp and flounder was okay nothing to brag about but it was good. The roast beef was a little dry even with the gravy but the gravy was very good. My boyfriend got the sandwich and the shrimp and flounder dinner also. He said that his food was very good and he enjoyed it. I also orders a liquid marijuana from the bar and it was very good, one of the better ones that o have had! The food was good and the service was great so I will definitely give this place another try in the future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IqAK2-VNyTSB2HnmdtmY7w",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Roast beef with rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IqAK2-VNyTSB2HnmdtmY7w/o.jpg"
      },
      {
        "img_id": "nZmd75chf-TXvQyVqoFpRw",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Shrimp and flounder plate with a side of potato salad and collard greens",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nZmd75chf-TXvQyVqoFpRw/o.jpg"
      }
    ],
    "user_id": "VX7ZafplsYLWKfmQFmU_Jw"
  },
  "iUOQ_svu2lmJiFsTR1F_MQ": {
    "date": "6/6/2018",
    "text": "Came here for dinner and so glad that we did!   Very good comfort food! I hadn't been here in many years.  The restaurant has been remodeled since the last time that I was here.   The booths are newer, clean and very spacious.  This place is very welcoming with the owners greeting you at the door.    I ordered the calamari as my entree even though it was listed on the appetizer category.  I was surprised how large the portion was.  Even better was the fact that there was only calamari (and didn't have any fillers such as fried peppers like a lot if other restaurants these days).  It was fresh calamari and was lightly breaded.  It was served with a dish of marinara sauce.  My only complaint was that the marinara sauce was too sweet.    The owner came by to check on us and we asked about dessert options.  I decided to order a piece of baklava after speaking to him.  The baklava was served warm and was a very decent sized.  After tasting it, I have to say, the baklava one of the BEST that I have ever tasted!  Definitely a must try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hGxeU_zcbKtBUa5lRsIUiw",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Delicious Baklava!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hGxeU_zcbKtBUa5lRsIUiw/o.jpg"
      },
      {
        "img_id": "0MBA7FIQ00yX9I_4O7XCNg",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Bacon cheeseburger with a side of fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0MBA7FIQ00yX9I_4O7XCNg/o.jpg"
      },
      {
        "img_id": "c3HPNTHtc0GQl76BsTBkig",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Spaghetti served with mushrooms",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c3HPNTHtc0GQl76BsTBkig/o.jpg"
      }
    ],
    "user_id": "8EVCarfyVLP14hlS4HVk1w"
  },
  "YZfavMEV8eiC5juG7cHEaQ": {
    "date": "5/9/2018",
    "text": "We left a trampoline jumping place for a 9 year old's birthday party.  We were hungry, in strange territory and wanted a respite from the yelling and screaming.  There stood Crown Point, so off we went.  Seemed like a 1950s/60s kind of coffee shop.  Greek run, a plus, large varied menu and experienced wait staff...people who had been doing this for quite some time.  It was clean and there were touches of Greek in the menu and the lady seating us spoke with an accent, so that was another Greek clue.  Margaritas were on special so that was our first engagement as we menu shopped.   Settled on Greek salads for each of us and then a baby back rib special for me and a pasta dish for my wife.  They were OK.  The salad was generous, even though it was a dinner side included. Dressing was heavy on the balsamic, too much for my taste but OK.  Wife liked the pasta.  Their famous fried squash was good, not greasy and not too bready.  My ribs were simply steamed.  We had been warned by the waitress that the kitchen slathered or drowned the ribs in sauce so we asked for the sauce on the side.  Glad we did.  The sauce was extremely strong and sweet.  Overpowering.  I dipped into it and never went back to that dish.  The ribs had been steamed so as to be lean on fat, but they were not very flavorful.  I ate half of my baked potato, which came with sour cream and butter.  Not a positive memory.  It was A-OK and if in the area might come back.  Locals seem to love it.  To me it was a weak 3-stars, but that is based on a solo experience.  We will see as time goes on.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyuDrrG5eEK-TZI867MUPA"
  },
  "WMmXtTUvmHwRNbSYrCl01A": {
    "date": "10/31/2018",
    "text": "Food is always good.  They have a great selection and good servi ce. Prices are reasonable. Their fried squash is the best.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xNVe1zldH_184KeP1G43Og"
  },
  "wJQbD6Ln9QimpxTrBnMtFg": {
    "date": "8/23/2018",
    "text": "When I evaluate restaurants, I take into consideration the entire experience.  The food is the most important thing, but the overall atmosphere and cleanliness and service are important.  The comfort food in this restaurant is outrageous.   I had the grilled chicken and collard greens and corn bread and potatoes and steamed broccoli and banana pudding.  I love that they don't use meat to season their vegetables.   Finally, a bacon free restaurant!   Delicious and it was more than a square meal!  The atmosphere was fine.  The decor is dated, but the restaurant had a good feel.  No bad feelings until I went to the restroom.  Lots of things were amiss.  There was a dirty stench.  The mirror was off the wall.  Used paper towels were all over the sink. Plaster was coming off the wall.  The urinal pipes were pulling away from the wall.  When I returned to the table, my lunch companion went to the ladies restroom.  She came back and fussed about the lock being broken in the stall, the paper towel holder being broken, and the mirror being  off the wall.   Suddenly our impression of this restaurant plummeted!  The owners need to invest in their restrooms and they need to do hourly checks for the cleanliness.   If I return for more yummy comfort food, I will make sure that my bladder is completely emptied before entering the restaurant.   The last thing I want to do is return to that loo.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "UwlORxJdSMLUM5DGjaFk9g",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Pl",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UwlORxJdSMLUM5DGjaFk9g/o.jpg"
      },
      {
        "img_id": "AVGtXeD-4snffhH1HxaBQg",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AVGtXeD-4snffhH1HxaBQg/o.jpg"
      },
      {
        "img_id": "Y7A_XL3g5t2R-Eq9W54GHA",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Bathroom in bad shape.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Y7A_XL3g5t2R-Eq9W54GHA/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "_N6x3U0Yt9oJ4BIn2BVHIA": {
    "date": "4/24/2019",
    "text": "Service from Denise was excellent.  Food was mostly amazing.  Rolls, veal parm, chicken and dumplings, banana pudding, and fried squash were all amazing.  Greens and Mac 'n' cheese were not so great.  But the prices, atmosphere, and service more than made up for those 2 items, I just won't order them again.  Oh, the candied yams were wonderful too. Will definitely be back very soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6fjWBujqWAZgPzU64_Xlw"
  },
  "g2kvG8_GdJSZa7eGYT-GBQ": {
    "date": "11/30/2018",
    "text": "One of our favorite spots for home cooking and Greek style food. Everything is always fresh and cooked to order.  The service here has always been outstanding. I really like the chicken souvlaki. Crown point is known for having awesome fried squash, and it does not disappoint!  Probably my favorite onion rings in or around Charlotte. They are lightly breaded and fried crisp, served with ranch. My wife loves the Mac n cheese here as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U7P0yCQA0Kv1PyHsRL9oaQ",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U7P0yCQA0Kv1PyHsRL9oaQ/o.jpg"
      },
      {
        "img_id": "sBLPrNnnP0nI2YR6rI-WJQ",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sBLPrNnnP0nI2YR6rI-WJQ/o.jpg"
      },
      {
        "img_id": "V8SXaSRXJdHxO8_SjFWVhg",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/V8SXaSRXJdHxO8_SjFWVhg/o.jpg"
      }
    ],
    "user_id": "eN12VACxEYX7OsPRz_yzVA"
  },
  "7jEqPEf0mAK7jdmS-35W5w": {
    "date": "4/25/2019",
    "text": "This restaurant is conviently by my office and have heard co-workers talking about going there. I tried for a co-workers bday lunch. I had the Baked Chicken and it was amazing. Marinated perfectly and the potatoes that came with it was great as well. I tried their famous fried squash. I have to say it was good but I wouldnt consider the best. Great daily meal specials and you get plenty of food. I would go back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZqerHAtRYxsJ2dNOFJLXnw"
  },
  "8W2xh7MPOYhoCulr5OSeQw": {
    "date": "11/8/2017",
    "text": "Crown Point restaurant is the perfect destination for a relaxing family meal of pure comfort food. The staff are super friendly and owners are on-site checking in to ensure that everyone's enjoying their experience. We could tell that this place was filled with regulars - it does have a bit of a Cheers vibe, if Cheers were an unassuming low-key restaurant.  The interior is comfortable and old school; no frills. It's clean and there are big cozy booths that will swallow you up.  The food is great! We truly enjoyed their special fried squash - not too greasy, not too soft, not too crisp - these are just right. Also, the banana pudding is not to be missed - it tastes excellent - layers of thick fluffy house made pudding, Nilla Wafers, and banana slices. And the portion is large, especially for house inexpensive it is.  We sampled about 10 different menu items and they were all very good; fresh, homemade, large portions.  All that plus 2 glasses of wine filled to the brim for under forty bucks - yes please :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "n4tD6axYRFajkX2ESvukMw"
  },
  "1P9IQMojesQz7J0FsR3-hw": {
    "date": "4/15/2019",
    "text": "I enjoyed the atmosphere of Crown Point as it is family run and the service was nice (note I've only done to go) but saw they knew many customers by name. As far as the food I felt that the options I got were bland like the squash and chicken livers. I really enjoyed the Greek chicken and potatoes- by far the best tasting potatoes I've ever had. I will definitely be back to visit to try more of the menu items.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nCOZc5RM6xdgLf2IJv3F0Q"
  },
  "0N_pzQk2HM0qx8ajHwZufA": {
    "date": "9/4/2018",
    "text": "What can I say. Momma always told me if I couldn't say something nice, to keep my mouth shut. I have nothing nice to say about this place. So I won't say anything.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPkKF9itAbxxmK3wu9I7YQ"
  },
  "gKKIET7eVUV88Q7PKAF5FQ": {
    "date": "7/14/2018",
    "text": "Crown Point is one of a few amazing traditional \"greek owned\" diners in the Queen City. Their lasagna is out of this world, and they will not tell you whats in it - secret recipe. They have awesome daily specials and they have an impressive collections of sides like fried squash and banana pudding. This is a comfort food heaven. I can't tell you how much I love this place. You will too if you give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "Z-Te2GWr2zCFJNJRSXWnaw": {
    "date": "3/16/2018",
    "text": "What a great find for an out of Townergreat service and dinner.  Loved the vegetables and fish.  Got right in and sat at the bar very friendly staff will be back next time I'm in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8nJhl-dC6fWZNwxrj1ecw"
  },
  "9XkxkE7EudyKK3A6AIQeZw": {
    "date": "12/2/2017",
    "text": "Ok we have driven by this place for years going up and down 74 so this evening we stopped . We are so glad we did !!! I had baked chicken breast, fried squash and Greek potatoes and slaw. Greg got chicken livers, rice with gravy and Blake eye peas. They brought warm rolls and butter out right after our drink order. The slaw tasted like what my mom taught me to make so yummmm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YdxSPxzuiKXAXfinOB3OJg"
  },
  "1fvSyG7E7eB7u6D4_O_sbw": {
    "date": "1/7/2014",
    "text": "Upon seeing the storefront sign which read...FRIED SQUASH...I had to try this since I've never heard that before. I stopped in the guy who assisted me was friendly and very accommodating. I wanted the fried squash but, was pondering on if a club sandwich would go with it. He gladly said instead of the fries I'll be glad to swope the fries for the fried squash. I was like great, that'll work! I was so anchous to try the fried squash that I tried them right after he brought me my to go order. I was very pleased and surprised that they tasted like zucchini. So, if you like fried zucchini or fried asparagus then you will diff- like the fried squash as well. Service good, clean restaurant and nice quality and quantity food for really reasonable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0sTF4bzlqkLRs-9BHEoJ4Q",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0sTF4bzlqkLRs-9BHEoJ4Q/o.jpg"
      },
      {
        "img_id": "RKUn5Ldk8EUkDN4TnCh7Wg",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Club sandwich w/fried squash",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RKUn5Ldk8EUkDN4TnCh7Wg/o.jpg"
      }
    ],
    "user_id": "crxCoOqJ7hatSTwbRSsDCg"
  },
  "862-i1K-ouBmRZ8kKDZ9_g": {
    "date": "10/11/2016",
    "text": "We took the hotel clerk's recommendation and tried Crown Point.  Don't let the outside of the building deter you as good food and great prices is what we found at this family style restaurant.  I recommend the vegetable plate dinner with cornbread for only $5.99.  Hubby reports that the spaghetti dinner was just okay.  Most diners around us were ordering the fried chicken dinners so that has to be good as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IQrMgY6fRiCsW6wqVT4AyA",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Fried squash is very popular here.  Great value and tasty meal - vegetable dinner plate. Yum - cornbread.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IQrMgY6fRiCsW6wqVT4AyA/o.jpg"
      },
      {
        "img_id": "byjtZLiuq_vQJko31KYENQ",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Spaghetti dinner - just okay",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/byjtZLiuq_vQJko31KYENQ/o.jpg"
      }
    ],
    "user_id": "tQb3Os_ph9glJqGIW-PdHA"
  },
  "gFaraysgVj1Cwb75duTDeQ": {
    "date": "11/21/2017",
    "text": "I really don't know why this place isn't busier, the food is always good and the service is too. I had the chicken Parmesan with spaghetti and it's great. We'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oovnv51Qp8-RKJ402-jHWA"
  },
  "21j33xH_zz-L4JjYR0sc1Q": {
    "date": "6/27/2015",
    "text": "Always find myself aimlessly driving around my area looking for something other than the norm for dinner.  I've seen this restaurant for a few years with their \"Famous Fried Squash\" sign but never I tried.  I wheeled in around 745 on a Sat nite.   It was dead....that is usually not a good sign.  But i decided to try it anyway.  The staff was extremely friendly and the waitress was fantastic.  This place is in line with The Landmark, Liberty East, and Gus Sir Beef.  It appears to be Greek owned.  The menu was varied between Meat and 3 veggie plates, pastas, Salads, Burgers.....there was plenty of variety to choose from.   Pricing was not bad.    The food was middle of the road (except the squash. ...that was incredible).   The food was not bad...and it served it's purpose ...served hot.  But it was nothing stellar either.  It lacked seasoning and salt.  That's easy to remedy though. ...so it was no big deal.  All in all, would I go back for dinner?  Yes.  Is it the best food I've ever had....No.  But it was decent, clean, and great service.   I'll probably add it to my rotation of neighborhood food choices in the future.  Give it a chance....i dont think you will have a bad experience.  Just don't set the bar super high ....and you won't be disappointed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "L96dUzicRLKsUqTC1h1-Ag",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Great Cheeseburgers!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L96dUzicRLKsUqTC1h1-Ag/o.jpg"
      },
      {
        "img_id": "UC1XWSXg7AZkfNtVBiI1ig",
        "caption": "Photo of Crown Point Restaurant - Charlotte, NC, United States. Steak Tips with Broccoli, Fried Squash, Macaroni Salad.....",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UC1XWSXg7AZkfNtVBiI1ig/o.jpg"
      }
    ],
    "user_id": "g_Q6VOqWQDE_ktlHC-LZNw"
  },
  "SALxFqrVRDjgwgSMIO1-CQ": {
    "date": "1/26/2018",
    "text": "Let's begin with the wings my husband is always pleased because they will bake them for him. They come back seasoned to please. I enjoy the simpler side, pretzel sticks fresh baked with mustard and cheese sauce.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wj37L2bn6PCMig0JtEO0HQ"
  }
}