{
  "HIncmSQFHP33Ibxgu6_v_Q": {
    "date": "7/3/2017",
    "text": "I love the food but the Shrimp could stand some work. Everything else is great. I always get that fried lobster tail.....omg!  the best ...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ngELnz87D00NDs2hm_nLNw"
  },
  "r0OTP0S07REKrT2RLir9qg": {
    "date": "8/8/2016",
    "text": "Love this restaurant   Neyda was my waiters name she was amazing she was super nice I recommend you to come to this restaurant",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tsH4qEHVNJJVAj3As55pIA"
  },
  "VlXjfsHSu5M0Iy6W_NootA": {
    "date": "5/1/2017",
    "text": "Since I love spicy food, I wanted to try this place. We went on Saturday for lunch but found out that they were having wedding party. We ordered Dum Birayani, Chicken chowmein and Chicken Momo. Out of 3 dishes only Mo:Mo was good but other 2 dishes were decoratively good but lack the taste. We wanted to give another try next month before we stop going here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Qu3WizFxDPIvFsud1MmQQ"
  },
  "NVnZY-rNnQlJrArwZ72gBg": {
    "date": "12/9/2016",
    "text": "My sister and I stopped in after reading the reviews and decide to do the buffet as we couldn't decide what to try......everything was absolutely delicious. The bread they make was so tasty and it compliments the dishes.  We will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Jzd_sSiBFd4gooPV7mXMEQ"
  },
  "y-YbmJazCOwWc0lgr6ZNRA": {
    "date": "3/11/2017",
    "text": "Food at Seafood Connection is the BEST in Charlotte! The seafood is very fresh & the Chef puts it down everytime. I usually get the Super C Port to share with my husband. It's so much we have leftovers. We definitely get our money worth along with EXCELLENT FOOD.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y0-inO_AgRUjkdRfSiS07A"
  },
  "l8wNZLSsOOO5iiCsNLvsOg": {
    "date": "1/13/2017",
    "text": "Go for the great Indian food and garlic nan.  Picked this based on the name but was pleased on the flavor.  Add this as a must visit when you want good Indian food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pqn7Vo2d01FEbnpiRn1qqA"
  },
  "O_J2wHVyc-Jahi3_vIN5Sw": {
    "date": "3/2/2017",
    "text": "The food is excellent at Seafood Connection! Im from Maryland and now seafood and crabs. I love the addition of sides and grilled items too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZBV26-9ZYYcII44Mq86cw"
  },
  "0due5y2pGlGsBP95j80k4A": {
    "date": "2/2/2017",
    "text": "Food was delicious and service even better. Authentic, freshly made Nepalese/Indian food. Can't wait to get back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YtTFvCTcoPPEcaRF_dnn3g"
  },
  "EiutSMlQbzF0cShEKW5u6w": {
    "date": "1/18/2017",
    "text": "Great food will be going back very soon. I have to try their buffet between 11-3. Great taste very authentic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvVmiwklc1fcjAhy1BEQzw"
  },
  "ZxOfJWIsQ7FPGw6_hEmZIQ": {
    "date": "1/31/2016",
    "text": "Great food in a quirky location. I went with the intention of ordering off menu, but didnt realize Sunday is buffet only. With that said, daal was tasty, lovely mixed veg pakoras, veg biryani, and poppadums were delicious. The mattar paneer was ok, lacked on flavor and mattars.   Staff were not super friendly, and forgot to bring water to our table on several occasions. Even so, Ill still go back because I enjoyed my meal and the price was right. Would be curious to go when they have live music/entertainment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQnboUN0vkkfeBuhJdNf8w"
  },
  "OKEIZpNB0SiXvunzgsbLlQ": {
    "date": "10/13/2016",
    "text": "At first the quality of food and service was spotty at best, however, they seem to be working the kinks out.  The food the past couple of times has been spot on and the service is getting better.  My first lamb dish was tough and almost inedible so I want to try that one again to see if there is any improvement. They still need to pay attention to the heat level so you may need to reiterate your spiciness choices to make sure you get what you want.  I ordered Tandoori chicken a 4 (out of 10) and my Aloogobi a 2.  It was reversed.  I have only tried the Indian selections so far but plan to go back and try some of the Nepalese dishes.  They also deliver so that is a plus for sure.  One more thing, they do NOT close mid-day like a lot of Indian restaurants to that is huge for me as I don't take a lunch until quite late in the day when most Indian restaurants have shut down for siesta.  Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lr6tBafe8YFyxCDT2aFkBg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lr6tBafe8YFyxCDT2aFkBg/o.jpg"
      },
      {
        "img_id": "hyuK8HD_g4WA-fVn1zS18w",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hyuK8HD_g4WA-fVn1zS18w/o.jpg"
      },
      {
        "img_id": "azjrlFc-AqeFaoDlkLt0vQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Aloogobi w/brown rice and full order of Tandoori the 3 legged chicken.  :D",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/azjrlFc-AqeFaoDlkLt0vQ/o.jpg"
      }
    ],
    "user_id": "_12KmDjUPCNzBerm_FzGGQ"
  },
  "HWsmHIOdjyyp9QyUsMfQJg": {
    "date": "2/17/2017",
    "text": "Lunch buffet was great! Chicken curry and chicken tikka masala were my favorites, naan was great too! Get the hot tea on the bar too!  It is tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_wVX-3QLA8gwJCw5L3KMg"
  },
  "_LWG-6sFcNqqReLqXqqPMQ": {
    "date": "7/13/2017",
    "text": "I wish I can rate this place half star. They have no idea what authentic Indian food is and the worst part of all is hygiene. Very disappointed with there cleanliness. 1 guys is doing all doing dishes , serving food , arguing with customers , delaying on serving food I mean horrible and bathroom are filthy with roaches god know what about kitchen if bathrooms are that horrible which are open to public.? Please anyone report them to health department No idea why customers are not speaking out . This was my first and last time . None of there dishes were authentic they have the same taste and the worst part there chicken had a smell and fish was old . Tandoori chicken was dried and bad taste . Tikka masala was all greasy and missing flavor. This is far far away from Indian food shame on you . You must fire the chef or close down till you learn how to cook and find a proper staff and definitely you need a visit by health department so they close you for a month",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bkImJ07YlqNvCNsdztijw"
  },
  "sTT_AmaGNHIb7m15JbWABQ": {
    "date": "11/11/2016",
    "text": "Delightfully surprised by this place!  Wasn't sure what to expect since the description is Nepali/Indian... but from my somewhat limited Indian food expertise- it seemed very authentic, but most of all delicious. Service was very friendly and attentive. Started the meal with two King Fisher beers. We shared the samosa appetizer, which was unique compared to others I have had, the little dough pocket was chopped open and topped with onions cilantro, chick peas and yogurt. Very complex flavors, earthy, with just enough heat (I'm a wimp when it comes to spicy!). I ordered a mild/medium chicken Tikka Masala and my husband had the chicken curry, medium/hot.  They even have popcorn chicken and fries on the kids menu!  Definitely will be our new go to Indian spot. They deliver, have a full bar, and a buffet during the week for lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O0DgWmrk4a1cPlZpARdNXA"
  },
  "6MOekAUtzlYvNTsgF-4_pw": {
    "date": "11/6/2016",
    "text": "This place has great Indian food! Tikka masala or chicken curry are my favorite as well as the garlic naan! But beware if ordering Togo they take forever!! They usually say 20-25 mins if you call on the phone or use the mobile app. That has never been the case for me usually 40 mins!! So order WELL IN ADVANCE!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vug_OWQfEG-uuQQsPCxMVg"
  },
  "MGf6CUZFs5xpr0z1ly3xWg": {
    "date": "1/17/2017",
    "text": "First time trying Indian Cuisine, it was good. The lunch buffet was hot and spicy. My husband loved the curry chicken and vegetables.The waiter was very helpful with questions and serving.  I would have rated a 5 but the choice of music being blasted over the speakers was not a good choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0JHI3XSP4BMgZCQ4n7_iyg"
  },
  "f3tP_xteMTijTWGohUmNPA": {
    "date": "1/15/2017",
    "text": "The hours are kind of wonky, but the food here is amazing. The chicken tiki Marsala is amazing, I go with American mild and it's still pretty heated. The prices are good and the portions easily feed two. Love this place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_8TfoxR0Ithg2lpIra6IkA"
  },
  "r3cZPSoq7h2UAUi6jabFgQ": {
    "date": "11/19/2016",
    "text": "Please excuse the building and the neighborhood. The food is worth it! The curries are delicious and served piping hot. The Makhani is buttery and smooth, like cream. The heat levels are to order and take the servers advice if you want it hot to American tastes. I ordered a 4 and it was just enough toake me sniffle a bit, but not too hot to enjoy. The lamb naan was great. I'd never tried a mango lassi before, what an experience! I wish it was a bit colder but the taste was amazing! I'm addicted. This is overall one of the best, taste wise, Indian restaurants I've ever been to. I hope they can get past their issues and stay in business.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hn1dSryI9tmYKt6HyQqJqQ"
  },
  "8qgsjvjvAIbxOHt_mF-3Ig": {
    "date": "9/25/2016",
    "text": "The experience I had in this restaurant was by far the best I've had in America. It started with the customer service, and then went up from there. The cuisine was so authentic I was really impressed. I had the opportunity while serving in Iraq with some Indian Chefs that would eat late-night with me, and I have to tell you the curry is real  delicious. Thank you guy's, and I appreciate the service I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SBWpo8x97-bUQu7ZdQIgWg"
  },
  "6pCj3AtEsC0Ad7ZZ_co90g": {
    "date": "2/5/2017",
    "text": "Ordered poori chole and it is by far the worst anyone would ever eat! Had a take out once for biryani and it smelled bad! Not going again or referring it to anyone!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6-uldvNs7pwguoVvTo7aOA"
  },
  "vCJL1i6VMVHqZdscghzfWA": {
    "date": "10/29/2016",
    "text": "Words cannot simply describe this place. I'm nearly verklempt. But I'll attempt anyway...  The food is delicious, the curries are rich and creamy with hints of saffron and other elements which show the cook is trained and knows exactly what he is doing. The samosas have a nice spice to them and are stuffed to the brim with potato, chick peas, and green peas with a nice bit of flavours and spices on and within. The rice is fine but not seasoned or flavoured in anyway, I know it's a basmati but not a jeera or with any sort of oils, butter, or ingredients on it. That would be considered a minor low point. All of the naans and other breads are quite good, nice flavour, help to balance the spices along with their rich but with the right amount of mango in their Lassi. The Chai teas are super spicy and are nice and strong, good proper English strength with South Asian spices.   Why only 4 stars after all of the ranting and raving? The service. They have so much turnover and changing staff, they are constantly training them. The owner is very nice but he doesn't seem to know what goes on. I would frankly recommend bringing cash here at all times and keep receipts to check the amounts charged and try your level best NOT to tax anyone with splitting any checks.  The food is excellent, nearing their 18th month in operation I believe, and I really would LOVE to see this place thrive and have more clientele. I have travelled around Europe, Canada, and the US and have had Indian/Nepali/Pakistani/and Bengali food all over the world. This is purely Indian/Nepali and puts the \"HA\" in Halal (according to a server), but they do have some indo chinese dishes and some more or less \"south asian\" items on their menu. I hope they work out their operational issues but the food alone is enough for me to pardon these problems (I also get take away typically - don't order ahead, they don't start it until you arrive...I reiterate the operational issues).   Bon appetit! Eet smaeklich! Chalo khao! Pofta buna!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "dTA4Tb0VN-_dmi8W8uLr-w"
  },
  "Kwt7EoiOYCnFlP9rv_Alog": {
    "date": "8/10/2018",
    "text": "Don't judge a book by it's cover! This place is a delicious hole in the wall. There is an option to pick your level of spice on each order. We dined at the old location and were so happy when it re-opened in a new location. My husband loves the Chicken 65... I love the vegetarian options. Give it a shot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wblNPmWBQzbyzfjzcF_dwQ"
  },
  "voEyn8t4tt5FtN8xQhpC7Q": {
    "date": "7/25/2018",
    "text": "This, to my knowledge, is the best Indian food in Charlotte.  They get everything right from the flavor to the spice. I have never had a bad meal from King of spicy. On top of that they are extremely friendly, and it is always nice to come to their restaurant. The vindaloo is probably my favorite but the Tika masala is no slouch. Make sure to get the garlic naan as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XzIETVH9KjkiBk2eI-t8IA"
  },
  "r2GMSinA1e7vT-RP2CzWAA": {
    "date": "10/26/2016",
    "text": "I liked this place a lot.  Heat levels 1 to 10.  I had 6 and the heat kept building.  I had to take a 10 minute break and then happily resume eating. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5fXj0q8Q6iXWX1v4G7chaw"
  },
  "ETun7dVc6cZay57QCFeKyw": {
    "date": "8/9/2016",
    "text": "Great Indian food and great service.  I recommend the chicken korma or tikka masala. The buffet was fresh and they kept everything full. Dinner is good, prices are fair and service was fast. I'm excited to see this restaurant grow for many years to come.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_VAn_8axoLLEDQGJKIxjog",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. King of spicy korma and tikka masala!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_VAn_8axoLLEDQGJKIxjog/o.jpg"
      }
    ],
    "user_id": "wFPj41tiFVL3wI01gxgE0g"
  },
  "Zp8DpLTpxrONmypQdcmDlw": {
    "date": "7/20/2016",
    "text": "I went to King of spicy twice, once using a groupon and the second time for their buffet. Their food is good, but I don't recommend the buffet. If you wanna give this place a try, do a la carte. Their dishes are about the same price as the buffet per dish and they have better options on their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0uAJMd3F74_6F8fA7jbFIQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0uAJMd3F74_6F8fA7jbFIQ/o.jpg"
      },
      {
        "img_id": "KaU3t8DJUppL67AqnGbY_A",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KaU3t8DJUppL67AqnGbY_A/o.jpg"
      },
      {
        "img_id": "64QeMnDuQzu2roGUZuxGrg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/64QeMnDuQzu2roGUZuxGrg/o.jpg"
      }
    ],
    "user_id": "gN2Kf9f9pdpIfaOt42gWeA"
  },
  "67Nw-epDLStIa-P9y1I-gA": {
    "date": "11/16/2016",
    "text": "I took my food to go so I didn't get the full view but what I did experience I liked. The staff was gracious and asked me if I wanted something to drink as I waited for my food. The food was delicious when I ate it. They allow you the spice range you want from 1-10. If you can't deal stay under 4. Great place to eat and will come again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MRC1BZ9Y0hjm0y2ZbvsN9A",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MRC1BZ9Y0hjm0y2ZbvsN9A/o.jpg"
      },
      {
        "img_id": "zXHYdUVtvEmYQYPiNcU9nA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zXHYdUVtvEmYQYPiNcU9nA/o.jpg"
      },
      {
        "img_id": "v48regmPZeJVl7kb969iFQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/v48regmPZeJVl7kb969iFQ/o.jpg"
      }
    ],
    "user_id": "sVn_rNopTpPik0iL_Xm7ag"
  },
  "Lvi_xIH33rYUz8k0E7D_ww": {
    "date": "11/23/2018",
    "text": "delicious? an understatement. the food here is superb! i get the vindaloo, chow mein, and garlic naan each and every time. but i'm sure you can't go wrong with anything here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_AlooVfwhtW5O4VVMS_aA"
  },
  "-_1JxX_WZ3sWrFAKpepsqA": {
    "date": "9/16/2016",
    "text": "This is not an authentic Nepalese restaurant. It's advertised as Indian and Nepalese restaurant. Maybe the Indian food is good but the Nepalese food we had was horrible. I am a mo:mo: (authentic food) monster however this was the first time I hated this food. It tasted burnt. To add to it, the appetizer we ordered came with 6 small chicken drumsticks fried in oil with zero taste. 3rd dish was some Nepalese noodles, it was just noodles with oil.   Finally service wasn't good. It was a teenage girl serving us, and was in a hurry for us to place the order. I noticed that maybe they didn't have enough menus as well so they were in a hurry to get back the menus. I still tipped 16% even after this experience although my wife suggested not to.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qgjdnA1ldLltGiFIsv8Thw"
  },
  "FPEhn9VsjAEysyVlU8H9sA": {
    "date": "7/13/2016",
    "text": "A great candidate for \"Restaurant Impossible\". Server was clueless, food took forever, don't think the A/C was working properly. Looked like they had only spent about $20 trying to change the decor from Mexican to Indian. Too bad we can't have better restaurant choices in the area. It's not even worth the Groupon.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JiRZzPhGTbcnzTpu-BsyEw"
  },
  "YaAobW7CTR823iu1hPiFJg": {
    "date": "4/26/2018",
    "text": "The food is good but not for the price. For 2 adult \"buffets\" it came out to be $30. Their \"buffet\" is only 5-7 dishes & thats it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gvPgyVPzWr_Vhj7ADPOJow"
  },
  "3subLEVBSlihZ8MBsXMxcg": {
    "date": "8/26/2017",
    "text": "Just really great Tandoori chicken! Seems difficult to find this menu item in Charlotte, and made well at that! Not on our side of town, yet we surely did not regret stopping by for lunch with a craving for Tandoori! Definitely will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vs4-FOAGiGx82Nsu355GHQ"
  },
  "jUjhLxJWCcbH_bWpXLdYGA": {
    "date": "2/16/2016",
    "text": "Firstly, I would be wary of any deals: Groupon, Yelp, whatever. There's a sign on their door that reads that they do not accept Groupons. I got a rather lengthy and confusing story when I asked about this. It was something like they don't get any payments or aren't getting their money back or something. It sounded strange.   We were there already, so we decided to give it a shot. The lunch buffet was sparse, but what was there was quite good. It was also very rich and very filling. The hostess came out with a basket of fresh naan which were super tasty. There was a feeling of, if I were to try and order more naan, they'd get testy with me.   There were a lot of vegetarian dishes. The tofu was especially tasty. I usually don't eat chicken, but I tried a bite of the chicken tikka masala and it was not the best. I would definitely stick to the biryani rice and the chana masala and tofu curry.   Weekdays the lunch buffet is $6.99 and on Saturdays it is $12.99. Hmph. Not accepting Groupon. Hmph. If I do come back, it probably won't be for a long while.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "2hii37dkKL4POcu6vh_6EA"
  },
  "IUjvJ023ae0ULXYtt5uLHw": {
    "date": "4/18/2018",
    "text": "Terrific service, delicious food, good prices. The lunch buffet is a great choice. Their new location on Harris allows for more buffet options.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HHP9kHnjLRrtuPiHzZMDXQ"
  },
  "819kAYpt35Qrbp0P8VDIhg": {
    "date": "2/29/2016",
    "text": "Worst food ever. We group of 10 people went for buffet -lunch on Sunday and had a horrible experience. The restaurant was not at al crowded , just one family apart from us.  Food was cold and old. Soup was cold and spicy , they had chips which had smell in them we had asked them to change it . samosa were not cooked and frozen (peas and potato inside were super cold and hard) rice and biryani was dry . cocunet chutney was completely spoilt . Dal was also not good . we had to ask them to change 3 to 5 items because of smell and bad taste. Ras malai milk was smelling. The person at the cash, said that they don't expect much people on Sunday so they dont cook and we should have called before coming so that they would have cooked the food right.manager was not apologetic. Worst indian food i ever had in charlotte.  Would never go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_U49PSmr6SdxRj7NGK2ww"
  },
  "jPm4yhQx3iCLdYhrR8qhiw": {
    "date": "7/28/2017",
    "text": "Seafood Connection is the best seafood spot in Charlotte. The food is great, service is good. I would recommend this place to my friends and family. The wait can be long but they have been getting much better. The wait is worth it too. I love to support black businesses.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YQWmYKO8Sgsj__f-mcF90g"
  },
  "3w9K76gN3iSQUXv-DJuyuw": {
    "date": "7/15/2017",
    "text": "My delivery order was accurate and delivered on time, but I was disappointed with the flavor of the food. The samosas were very bland and the chicken tikka masala sauce was heavy and too creamy. The garlic naan was very good, but overall I thought the food did not taste very authentic compared to other Indian meals I've tried.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N33DAPvk0twXdJLloP85Kw"
  },
  "Gzd-EWS2FOZRm5eb0IEyvg": {
    "date": "2/28/2017",
    "text": "I was very excited to try this place, just moved to the area and had read good things.  Went in for the lunch buffet today, it was a joke!  Very limited selection only two dishes of chicken, no other proteins.  The tikka masala was supposed to have chicken in it but there was none to be found.  An employee later came out and added new chicken to the old sauce.  Everything tasted like it had been sitting out for some time, and even the fresh naan was doughy and heavy.  The decor is somewhere between dingy and post-apocalyptic.  Service was lacking.  The paneer dish on the buffet was actually good and that's it.... Wish I had more good things to say but apparently no one cares at this place.  Avoid.  Zero stars if possible.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "c6fjWBujqWAZgPzU64_Xlw"
  },
  "pU_xXeh5Yz9Hd-xzyA9QJQ": {
    "date": "4/1/2017",
    "text": "Ordered takeout... one of the worst Indian food I have ever had! Quick delivery. But the food was creamy and tasteless. It is really hard to screw up dal makhni but they managed to make it inedible. Samosa chaat was equally bad. White rice was the best part of the meal! Overall, not recommended...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x1Y6Rkef0gtFvfPUVQaktg"
  },
  "v8ox0vbOoXH381wVoxIIhQ": {
    "date": "3/15/2017",
    "text": "So so food, i ordered lot of items.. chicken65 was raw inside, curries did not have very good taste.. did not like it at all",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mTOqdfpabVOYcuAiV5FmDw"
  },
  "vO2iHfGPcZVHXPtcg3oQaA": {
    "date": "8/6/2016",
    "text": "Don't freak out at the weird interior. The wine pour was huge per glass. My GF and I went and split the veggie thali and the goat curry (be sure to order this with a high heat level. We ordered a 9). The naan is the real thing and was hot and crispy. The goat curry was excellent with lots of meat, fat and bones... Super good. The thali gave a good selection of options most of which were tasty but a little bland if that was all we had. However since we had the nuclear goat curry we remained in the Burn Zone. As a mid week hole in the wall place this is fun and not as expensive as uptown. Service was friendly. Don't expect the Ritz.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GVBOqqk71_4n3XHTK_Fppw"
  },
  "SstXpalFnMH4XMS4xAvi4g": {
    "date": "8/22/2016",
    "text": "Our friends heard about this place, and told me and my husband about it; the four of us decided to try it out-we all love Indian food, spicy stuff, and trying new restaurants.  It was incredibly delicious, all of it....we split several appetizers and entrees.  I ordered the chicken tikka, tandoori style; my husband got some kind of lamb meat, and our friends got Boti kebab.  All of the meat was just perfect-tender, flavorful, spicy.  One of the apps we shared was cauliflower cooked in spices and sauce (gobi)-I was skeptical, not being a veggie type of gal, but it was delicious.  I mean really, really fantastic.  Our server, Kenya, was helpful and patient, and did a great job.  My only critique would be that the establishment is very dark, with an empty stage and no music for ambience; if they had some nice Indian music playing, or perhaps a performer on the stage with a sitar or hand drum, it would be a perfect setting.  But for the quality of the food and the great service, I highly recommend King of Spicy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vw1RA8URwpxRVT41sTbLAg"
  },
  "jqelkKjXzJ-P7L38-Wbf7g": {
    "date": "4/29/2018",
    "text": "This is probably the best spicy food in town. I love going there with my family.    If you are new in town and don't know where to go or not sure this is the place to go.       Highly recommended this place.    They have awesome food and great prize . Love it .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGX_J7UDPAXKoh9v1SYqqQ"
  },
  "q5YJ-M1SCqIgjehwxbNFmg": {
    "date": "1/21/2016",
    "text": "It's a good thing our dinner group went to King of Spicy with our very own \"in house\" expert on all things hot, Tonya P, aka, Queen of Spicy!! She is an excellent food tour guide and helped us order an enormous feast.  The space for KOS is a bit mysterious and has likely had a previous life as a Mexican restaurant/nightclub or a Bar and Grill. It has been reincarnated into an oddball but entertaining Indian restaurant which also features some Indo Chinese and Nepalese food. Loved the Bollywood dance videos on the big screen - very distracting but in a weird and pleasant, \" I wanna get up in between food bites and bust a move\" kind of way.  The best thing I ate was a special order not on the menu -  Samosa Chaat - damn it was good.  I could eat a 5 gallon bucket of Samosa Chaat at one sitting. The next best item for me was the Gobi 65 - a delicious crispy cauliflower appetizer. Great Dosas! Killer Naan (especially the garlic)! The Chicken Tikka Masala was up to par and the okra dish (Bhindi do piyaza) was a surprise hit. You can custom order your spice level. Don't be offended when they ask you if you want it \"Indian Hot\" or not (and be careful what you wish for)! The beer selection is not very exotic - Coors Lite to Stella Artois, but they will have Indian beer soon.  Great place to go with friends, try some new dishes and get your Bollywood freak on!!",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 21,
      "cool": 11
    },
    "photos": [
      {
        "img_id": "-PD5xfeqcQ1XbdUw4geiSA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-PD5xfeqcQ1XbdUw4geiSA/o.jpg"
      },
      {
        "img_id": "ivLSp2mR226W6KZ6ygOG0Q",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ivLSp2mR226W6KZ6ygOG0Q/o.jpg"
      },
      {
        "img_id": "LdQn17j0t7sCucqxtLPS4Q",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LdQn17j0t7sCucqxtLPS4Q/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "JdT95lMlpTm_RHcjRFlAQA": {
    "date": "1/19/2016",
    "text": "Came here with a group of seven and we ordered a lot of appetizers and some entrees to share.  Got a great sense of what they can do here foodwise.  It is located near the old Eastland mall site, but that should not deter you since they are a stand alone building and have plenty of parking spaces around the building.  Best guess is that the building used to be a mexican restaurant of sorts, but don't be fooled by appearances.  You walk in, there is a rather large dining room, a small stage, and two pool tables!  Definitely got a sense that we were in for a treat even before we sat down.  Behind the \"stage\" there's a wall were a projector was showing youtube indian dance music videos....  Pretty awesome.  Especially when the videos started buffering (maybe when more customers came in to use the wifi).  Super charming anyway.  Now the real star of the place:  the food!  Probably the biggest hit with our table was the cauliflower (gobhi) appetizer... came with two dipping sauces, delicious.  We also ordered dosas (mild and spicy version)... garlic naan (a must)...Chicken Tikka Masala was solid.  The Bhindi-do-piyaza (okra) was pretty darn amazing.  And we had a couple other things, including something that was not on the menu but our resident indian food expert requested it and they obliged.  Overall a great experience and I can't wait to go back to order off the Indo-Chinese part of the menu!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 18,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "V0ytF6u-aJuu15iDLP_6AQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Naan!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/V0ytF6u-aJuu15iDLP_6AQ/o.jpg"
      },
      {
        "img_id": "C99bhUkTmMHrlU6fCnUE4Q",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Okra (left). Chicken tikka masala (right)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C99bhUkTmMHrlU6fCnUE4Q/o.jpg"
      },
      {
        "img_id": "mQs7CKYcx4swTdeZMtxhNw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Dosa!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mQs7CKYcx4swTdeZMtxhNw/o.jpg"
      }
    ],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "9KMB-_tI-43KyIbego-5eA": {
    "date": "4/29/2018",
    "text": "Amazing service, delicious food, wonderful pricing! I cannot say enough good things about King of Spicy!! Their staff is personable, does not rush you as experiences I've had in other Indian restaurants. I am so impressed with the cleanliness and the time it took to receive our food. Again, very impressed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k3XVJClx0Wz4MFOG39Cjtw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k3XVJClx0Wz4MFOG39Cjtw/o.jpg"
      }
    ],
    "user_id": "gMB0_OdKhCFfSjM_occ76g"
  },
  "v8q9v0vrCL5ymmp-44cVfg": {
    "date": "3/23/2019",
    "text": "Wow. Where should I start? The staff was just horrible I even think one of them asked me if I was a street Walker n how much did I charge. Well first of all if I was a hooker n I'm not but if I was I'm pretty sure this broke ass fool working at king of crappy sure as heck couldn't afford it. Second just wash that nasty floor already. Looks like a wild herd of African pygmy goats live n eat there. Nasty as heck. Oh n a few sprays of air freshener might actually make it smell like field of flowers n dog crap n not just dog crap. Good luck if you go there. Bring your imodium n ur adventurous side or death wish which ever you call it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sEQ3pQfS5xymesuNZW5Rgw"
  },
  "afGkFk5MSfMLbUbT0pRPJg": {
    "date": "12/20/2016",
    "text": "I had some extra time today to run down the road and get some take out Indian for lunch. It's Indian and Nepalese.  We went with the vegetable momo which is a nice little dumpling. One order was maybe ten dumplings. Very generous and came with a nice spiced sauce. We also got vegetable curry which at medium spice was perfect. It came white basmati rice. We also went with garlic naan. It really was great and still temperature hot when I got home. Also, the man ringing me up asked if I ate meat and I mentioned I do but didn't feel like it this particular day and he went over to the buffet (they have one for lunch) and got me a small Chinese container of the lentil soup to try for free which was my favorite. I'll go back just for that comforting and velvety soup! It's not easy to miss when driving by as it has a nice big sign.  Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "fXPwu_pvEAQHfY_G8eW4vg"
  },
  "f5ToSVPP9WXjs75Oa-0RAg": {
    "date": "5/19/2018",
    "text": "Really good food and courteous service. Very hygienic and rated 97 on sanitation. They had buffet on the weekend and it was really good. Would visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "G_ua5vRaptlR64si6vGH0g"
  },
  "COij4zwtvpk80z8rKm_iog": {
    "date": "7/28/2018",
    "text": "I'm VERY fond of this place - Got meatballs with Manchurian sauces and Chicken Momo's (dumplings) this time. And the naan.... its thin, light, buttery and VERY crisp, but not overcooked, on the \"tandoor\" side. This place just amazing. You'd never think from the decor or the exterior just how great this place is. Highly recommended",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w-Ypm0JRwaNXiCfRCR0jSw"
  },
  "YRxiNry-ne9Xak0rJbMG7g": {
    "date": "7/11/2018",
    "text": "This restaurant almost blew out my taste buds!! I love it here, the waiters and waitresses were so nice. The costumer service is an 11/10! I would definitely recommend coming here if you would like a great meal and a good price!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_IHucIerTjp7vduslD1zFQ"
  },
  "A6r6YJPsA1Dzr_xrKTesxQ": {
    "date": "5/25/2018",
    "text": "I have been eating here for a while and the food is fantastic!! The service always matches how great the food is! Definitely worth trying out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "402DCJNA1pd2jUarsC8NdQ"
  },
  "925MUiImL8SPokR7CEaJTg": {
    "date": "6/29/2018",
    "text": "The meal was really good and our waiter was really nice. Can't remember the name of this dish I had, but it was sweet with fried chicken balls and garlic naan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nnlL3eggsWe8nJwUByTsKA"
  },
  "LkdehCqAXzUP10Sr2a57VQ": {
    "date": "9/24/2016",
    "text": "Perfect hyderbadi style street noodles, fried rice and veg Manchurian! Should try for every Hyderabadi!  Our order: Veg manchow soup bowl - good for 3 Veg Manchurian dry Chicken tikka - good for two Vegetable fried rice - after all starters this is good for 3 Vegetable chow mein - good for two to three  Special chicken biryani - good for two to three",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FqOGd2XO2dqoH0huSAYr9A",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Vegetable fried rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FqOGd2XO2dqoH0huSAYr9A/o.jpg"
      },
      {
        "img_id": "RG_xJHWRxw1zKLQ69A-dZg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Special chicken biryani",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RG_xJHWRxw1zKLQ69A-dZg/o.jpg"
      },
      {
        "img_id": "TG-6Ibm2VjYWdcbrkG_7Sg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Vegetable chow mein",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TG-6Ibm2VjYWdcbrkG_7Sg/o.jpg"
      }
    ],
    "user_id": "aIPeb6KZBepgOdCsjUuO7w"
  },
  "-NXKR2Jq6OgxBKCbTq26rg": {
    "date": "5/15/2016",
    "text": "This place is a hole!  There was nothing spicy about it and the server was clueless!  She didn't even know what kind of beer they had. She asked me to just name some beers and she would know if she had them or not?!?!?!?  They had neons advertising beers they didn't even sell!  WHAT. ARE. YOU. DOING?  The bar area looked like a dungeon and the bartender was preoccupied taking selfies.    Atmosphere - My high school cafeteria had more Food - Very bland Service - OMG are you kidding me right now? Cleanliness - Questionable  Save yourself some time.  Move along folks.",
    "rating": 1,
    "rated": {
      "funny": 7,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlDYPORxTpNgImmbwIn3Dw"
  },
  "0h37Yvj5ds9XOpgnr_Ugjw": {
    "date": "3/27/2017",
    "text": "They are more of a Nepali restaurant than an Indian restaurant. Getting straight to the point....the food was amazing!! We had the Nepali bhel and momos for appetizers. The bhel was so good albeit a little spicy. You might want to stay close to the lower end of the spice scale when ordering. The momos were also really really good, closest to authentic momos I have had in the US. For entrees we had kadai chicken and a lamb dish. Both were very very good. Just the perfect balance of heat and spices. Even the naan bread was so good, soft and fluffy! Now to the bad part....the place was dirty!! The tables were not clean, the carpets were stained, the decor was shoddy and the whole place seemed so uninviting. I hope they can figure out the cleanliness issues, otherwise it's a little gem of a place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvivYrK-o2dp_Sk5ips8nA"
  },
  "Kz9FYOEIfv6s-lb8weIEGw": {
    "date": "2/9/2016",
    "text": "4.5 stars   First of all, shout out to Chuda for inviting us to try out King of Spicy, I've been expecting good things with the most recent Yelp reviews. Also, our server was wonderful. Very friendly, helpful, and attentive. King of Spicy's decor is reminiscent of a Mexican restaurant and complete with a bar with seating as well as regular table seating. The menu is pretty large considering it covers South Indian, North Indian, Indo-Chinese, and Nepalese foods. It was so hard to decide on food, everything sounds good.   We ended up ordering the Gobi 65 as a starter, really good and flavorful.The crunch factor was perfect, very hard for a majority of Indian restaurants to nail. Nicely done! I also ordered a Mango Lassi, which was refreshing as well and not overly sweet. We then ordered the Bhindi, Kadahi Paneer, and Chicken Tikka masala to share as an entree. I was very pleased to see that naan and rice were included with the curries, great idea. Nobody likes to order expensive naan on the side. And I must say, the garlic naan was phenomenal, very flavorful and not too doughy. It was basically my favorite food item of the night next to the Gobi. The curries, specifically the Bhindi and Shahi Paneer, were very similar to Sri Lankan food. The Chicken Tikka was good as well though it wasn't the best. I had to dock a half a star because our entree curries were very oily though I'm sure you can order the dishes with less oil (I will be doing this from now on).   We will be back, especially to try out the buffet option ($6.99 M-Th) and all the other menu items that sound delicious! There is a weekend buffet as well but it is much more expensive. NOTE: I did notice that there was a sign on the door stating that King of Spicy does NOT accept Groupons anymore despite the fact that it is still an active deal one can purchase! I unfortunately did not get the chance to ask about it. Thanks King of Spicy and Chuda for showing us a great time, we will see you soon. Cheers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "T_l7f_-UM-2v5Dz1cV3uoA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Chicken tikka, beautiful presentation.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T_l7f_-UM-2v5Dz1cV3uoA/o.jpg"
      },
      {
        "img_id": "vW18pGqpJx0GV9CsNMMxZw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Kadai paneer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vW18pGqpJx0GV9CsNMMxZw/o.jpg"
      },
      {
        "img_id": "I4sLRyEdaK2nxC4eyNZuAQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Bhindi",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I4sLRyEdaK2nxC4eyNZuAQ/o.jpg"
      }
    ],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "cUAHqW8bwYJOGxZChf5IyA": {
    "date": "4/8/2018",
    "text": "We fell in love with King of Spicy when it was in the Dollar Tree shopping center. Their lunch buffet is better than any Indian lunch buffet in Charlotte. The naan always comes out fresh and the constants like Tikka Masala and Tandoori chicken always hit the spot. Today they also had goat on the buffet and green pea paneer that was very creamy. Also, best chai tea I have ever had. We've also ordered out at night and it was hands down the best takeout experience as far as food quality I have ever had. LOVE THAT THIS PLACE FOUND ANOTHER LOCATION AND DISNT JUST CLOSE DOWN.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9w4LLECMafsLssGHpn5XFQ"
  },
  "4ER8LbxLos3IXrcTDyBkeA": {
    "date": "1/5/2016",
    "text": "Went for the first time after finding this on Yelp. We split some chicken tikka masala and ordered two appetizers: samosa and Gobi 65, thanks to a review by another Yelper. Not so adventurous, but we were short on time. Splitting our entree was a good idea - the portions are very generous. We split the tikka masala, adding an extra dish of rice (which was unnecessary), and we had enough to take home. Even the Gobi 65 appetizer was a generous portion - we took some of this home too. Check out pictures on Yelp to see what our meal looked like.  Everything was delicious, and I loved seeing familiar Nepalese dishes on the menu. I'd like to try some of their Himalayan dishes next time I visit.  The prices are reasonable, and there's a great deal on Groupon that I'm looking forward to buying soon. The staff was great. Our waitress was very kind and patient. I'm sure she would answer any question you have. She also took the time to talk to us and offered to box and bag our leftovers. The manager came around to our table to see how our meal was, too.   The environment is nice - definitely feels like a hidden treasure. The building's unassuming, and the interior looks like it was used as a Mexican restaurant in a past life. There's a stage in the middle of the restaurant that I'm very curious about.  I'll add more photos the next time I go, which will definitely be soon!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 15,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "gyRHyjLd4joPEYCE1WwIjA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Close up of chicken tikka masala - enough for two of us!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gyRHyjLd4joPEYCE1WwIjA/o.jpg"
      },
      {
        "img_id": "0y5t-6PcAMUTzWBMwgzyyA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Close up of Gobi 65 (appetizer) - delicious!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0y5t-6PcAMUTzWBMwgzyyA/o.jpg"
      }
    ],
    "user_id": "3OdhmL86TwFgkmoDHbcZ4A"
  },
  "hbruAsAMcEWydMzzrIShuw": {
    "date": "2/23/2017",
    "text": "I stopped here for a late lunch early supper and it was delicious! I love that the menu has pictures of all the dishes.  I had a Nepalese rice/noodle mix with chicken and garlic naan. I said id take spice level 5 and it about did me in at the first bite but I was like nooooo I paid for this I gotta eat it and I got accustomed to it after a few more bites.  You would think rice and noodles would be heavy but they were so so so light and fresh and delicious.  They had onion inside and green onion on top, very flavorful. The portion was absolutely enormous. I could only eat a third and I am so excited now to have yummy leftovers tomorrow! The garlic naan was amazing and helped cut the hotness of my meal.  The waiter was very cute and helpful.  I plan to go back at lunch sometime  when they have the buffet!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PMbbfpF57FC-sCuUJSBgtA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Garlic naan...as flavorful as a pizza! Intricately crafted",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PMbbfpF57FC-sCuUJSBgtA/o.jpg"
      },
      {
        "img_id": "QeGD5hWwUHZjT4kwvDOhpg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Chicken with rice and noodles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QeGD5hWwUHZjT4kwvDOhpg/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "QkpXE7LvJq5qmszlNzUfsw": {
    "date": "8/1/2018",
    "text": "We wanted Indian food, this place had the best reviews, so we went. Well hole in the wall is right, And so is steal your heart. This was one of the best most fun dining experiences ever. My companion was new to Indian food so the pictures on the menu were great. The waiter was over the top, excited about the food, bending over backwards to make sure we enjoyed our dinner. When they let you pick your level of spice... be careful. We ordered 4 and it was hot. The servings were generous and the wine? Well let's just say it was a big glass. And the prices are more than reasonable for the quality and the quantity. This is adventure dining at it's finest. If this place were on East Blvd or Ballantyne the prices would be doubled and the servings half the size. I was a founding father of the clean your plate club and I took home enough for TWO more meals. Is it a special occasion place or a first date place, maybe not for everyone. If your looking for a casual place that has no wait with great food that is a bit of an adventure, go there. I am sure this is the place where the Indian Grandmothers go when they don's feel like cooking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p1NYnGlkOOC9lIF70fMbXQ"
  },
  "rdL9cbSE3NRTssg0CnPWIg": {
    "date": "2/5/2017",
    "text": "We used the Yelp app to place the order and payment. They delivered within an hour.  Convenience way to place order for Indian/ Indo-Chinese cuisine.  Food was good. No complains. My family enjoyed !!  We ordered : Chowmen, Paneer Chilli, Chicken 65 and Daal tadka .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "iaQ87xNkWEAp41GFL9IpuA"
  },
  "v_C-C3iXb2MUQIGoz0fsbQ": {
    "date": "3/22/2019",
    "text": "I had attempted there Papri (Chat Papri). Taste great with equalization zest. Ought to have request minimal more flavor then a gentle.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "imSrve3okPHodAWkjcTU2Q"
  },
  "KU6739fQypVhfzrW1uL8ig": {
    "date": "5/24/2017",
    "text": "Updated review: 2.5 stars-after coming here many times I seems to notice there is a little issue with consistency.  I had Indian food last night that blew me away, which put King of Spicy into perspective.  Sometimes I would go and be happy, other times really disappointed.  I have had burnt naan, watery masala, good masala, spicy masala, bland masala....so it's really hit or miss. I just can't have that when spending a pretty penny on a dinner for one, because it's not inexpensive. And the mango lassi-NOT GOOD.   I complained once when I had really bad service and was given a credit to the restaurant.  I asked for my money back, but just got the option of a credit.  I think that I will take a break from here for now as there are many other places with very consistent and delicious food in town. I hope they pull things together!",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "OMK10USlx7X-MbDUrnJb6A": {
    "date": "6/16/2019",
    "text": "Me and my family had good experience. But I feel terrible for the guy who came in wanting just a beer. The manager said he would help him and 30 minutes later the man is still waiting. Terrible service. Hasn't even acknowledged him since.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SZoJ2tNnZoqez0rcGrmg_A"
  },
  "lKQr4VoDP_ogHyR0Cz4zUg": {
    "date": "7/25/2018",
    "text": "We came here last week for the first time and enjoyed it. There weren't a lot of people in the restaurant, but the wait for our food was kind of crazy. However, the staff were SUPER nice about it and apologized multiple times and gave us this free mango lassi. (Which was super yummy!) They gave us tons of extra rice to take home with out leftovers too.  As for the food, it was delicious. My friend got chicken tikka masala and I got paneer makhani. They were both flavorful and creamy and the rice was perfect. I got a 6 which was too spicy for my liking but it was so yummy that I made it work haha.  We tried the samosa chat too. It was good--pretty spicy--but I'm not sure I would get it as an appetizer again. It was delicious, but pretty heavy as an appetizer. I wish I had saved my appetite for my main meal! Maybe I would get it as an app if we had a larger group--it's a lot of food!  The naan was fabulous! We got garlic and chili garlic and loved them both.  The lassi was the dark horse we didn't know we needed!! It's like a creamy mango milk. It cuts the spice and adds acidity. We would definitely order that again.  Would definitely go again! But maybe be prepared to wait a bit for your food :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pc3jbrQpw7kSwHoJ7Z4boQ"
  },
  "Nrdfi9xhmJKnobwaPh274Q": {
    "date": "9/23/2018",
    "text": "Best naan ever!!   Food was good. We had the chicken tikka and the flavor was enhanced by the garlic naan we ordered.  1st time I had Chile garlic naan. When you come here order it with your meal. We ordered 2 servings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xzGvW-bAydS2akekoZrzKQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xzGvW-bAydS2akekoZrzKQ/o.jpg"
      }
    ],
    "user_id": "4pBeGcCdzKJJm5QF-gx74Q"
  },
  "PZefgNnv6EzKnBpqY6SDcw": {
    "date": "3/8/2019",
    "text": "I love that they have channa masala as a buffet option. Love the naan, very tasty and fluffy. The to go box is 6.99/Lb and buffet is 9.99.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Beu_NITok9OX2pqIJYB3cA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. A little bit of rice is all I put and got tons of channa :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Beu_NITok9OX2pqIJYB3cA/o.jpg"
      },
      {
        "img_id": "VkEhOJtUUDPAynK7P7GH-g",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. To go lunch.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VkEhOJtUUDPAynK7P7GH-g/o.jpg"
      }
    ],
    "user_id": "FNAoTRGmwEouNC6thmWCCA"
  },
  "FVIZYSUsgrpLs9bXOhVcHg": {
    "date": "2/24/2019",
    "text": "My wife and I stopped in here one day and the food was great. After several visits, we've tried the buffet and entrees and everything has been delicious. A couple of weeks ago, my wife wanted biryani again but I went to another place a little closer to our house. The wife was not appreciative. So now King of Spicy is the only place I'm allowed to go for Indian food, and that's fine by me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGRaVEYsZEuYpJp8qA4x-g"
  },
  "Va_HfyBVXUEKC_fhQ1Y7ng": {
    "date": "6/23/2018",
    "text": "I placed an order for carry out with the family and was impressed by how nice the guy was. As we waited, we were given Mango Lessi on the House! We ordered a veggie Korma, sag paneer and a chicken masala. All of which were really delicious! I totally recommend this place for Indian on this side of town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1dtplMB1zxNk3pLQk5Zc_w"
  },
  "05oGVar0AJHpAwqzWTMM9Q": {
    "date": "2/19/2019",
    "text": "Nice place and family friendly.    Staffs are very sweet and friendly too.    We come here to eat all the time with family party and personal. Good food and reasonable prize.         I highly recommend this place.      Go and try out this place. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HDy483oAo53mH5rpnXOINA"
  },
  "nOgpL43vGAzdJRR2MfKl_A": {
    "date": "4/1/2018",
    "text": "Definitely love the King of Spicy! The menu was fully explained to us and we got so much food! Ordered the chicken tikkk missala and loved it. The spicyness was perfect and enough to take leftovers home! We also got the manchow soup and it was very spicy but very delicious!   Thank you for letting us try the mango smoothie.   Definitely try this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yt5fNwqb7sn0MIZ4BN_qLQ"
  },
  "vJpxRhoQrCll28_7pm5Evg": {
    "date": "4/18/2018",
    "text": "Great food and great customer service!! Loved this place since a co-worker introduced it to me a year ago at their old location. I do like this new location better. The food is still delicious and the owner/ manager is the nicest. The buffet is wonderful with about 4 meat and 4 vegetarian options.  This is just about my weekly lunch spot!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uoLHLVYtFo62e1oBhT8J5w"
  },
  "dzQZAapaR4W_9_D7Y6OLMg": {
    "date": "5/10/2018",
    "text": "I was in Charlotte, NC for spring break and I was looking on yelp for good Indian restaurants when King of Spicy popped up in my search results. And let me tell you there's a reason it's called King of Spicy! This restaurant IS the king of Indian restaurants. I stopped by for the lunch buffet and totally loved the food and the ambiance. I truly enjoyed the chili chicken and the chicken fried rice. They were both so flavorful and cooked to perfection. Mouthwatering! My only concern right now is that I will want to travel from Los Angeles to Charlotte every two weeks or so to dine at King of Spicy and that won't be good for my credit card bills!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ciIz-2wSMteGcEfP7yAqkw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Chili chicken at buffet",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ciIz-2wSMteGcEfP7yAqkw/o.jpg"
      },
      {
        "img_id": "EA4ZqtKWlDatLXl0NJegzg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Chicken fried rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EA4ZqtKWlDatLXl0NJegzg/o.jpg"
      }
    ],
    "user_id": "P3IxclWJ5gxT7tuXfa8RAQ"
  },
  "vZ6AaU6dtfZaZUXBSHuMYA": {
    "date": "8/3/2016",
    "text": "Mmmm, garlic naan.   I've good things about this placed and saw there were a lot of mixed reviews on here. I got a groupon to get up to $20 worth of food. Me and my husband went last night. The restaurant is really big and very divey. I'm pretty sure it used to be a mexican restaurant. We got sat right away. Server was really nice and friendly.   I got the chicken tikka masala with white rice. My husband got the Chicken Kadai. I got my spice level 8 and he got spice level 7. I got the perfect amount of spice for my masala. My husband tried it and thought it was really spicy. My masala was delicious. Had peppers and onions in it too!! The Kadai had a good flavor to it and chicken was very tender. He got brown rice with his. When I was checking into Yelp I saw a offer for a free Mango Lassi. I asked the girl what it was and she said it was a thick yogurt mango smoothie. I asked if I could redeem this offer even though I have a groupon and she said that was fine. The smoothie was super thick and tasted just like mango. It was very refreshing. Great to drink after eating spicy food!! The garlic naan was amazing!! It was super warm and had great flavor to it. So yummy!!  After we paid, a manger/owner came out and talked to us and asked how we heard about this place and we told him through Yelp. He was really friendly and talked to us a bit.  The place isn't the nicest but sometimes the best places are divey. We sat at a booth and there was a stage next to us. The restaurant is very dark. The only thing new about that place is the \"King of Spicy\" rugs on the floor. I did like that they have hand sanitizer stations everywhere.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 13,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "T0COVxiL7AugO_FpxLdTSg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Korma",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T0COVxiL7AugO_FpxLdTSg/o.jpg"
      },
      {
        "img_id": "tmuPsyOqx44wF0u4U6D5XA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Chicken tikka",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tmuPsyOqx44wF0u4U6D5XA/o.jpg"
      },
      {
        "img_id": "hfPsKOuhL2hQERhGYIy5Gg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Garlic naan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hfPsKOuhL2hQERhGYIy5Gg/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "GjJIjsVu13_DLy4lAUSjIg": {
    "date": "12/18/2018",
    "text": "We love this place!!! The best Paleek Paneer in Charlotte...hands down. The service is good and the garlic been is to die for...real garlic all over. Very affordable and highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfbhWFgPRsppwGkfj9_trw"
  },
  "fb0rmn7xWEycnGlrVmXWYQ": {
    "date": "10/18/2018",
    "text": "Chicken tikka masala is the best. I ordered chicken tikka masala butter naan and samosa. It was really delicious. Service was quick and friendly. See you again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xh485ewF7azKhfyB0rxUpA"
  },
  "j31mLdIBUUZckEDAImpfOg": {
    "date": "4/28/2019",
    "text": "So good! Love the makhani chicken the most. It's become a part of monthly rotation. My son gets the chicken chow mien. Says it's the best chicken in Charlotte. The buffet is also great. I love being able to try a variety of dishes. The chickpea dish is so tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "obxfLUh2BCa9xvqfyb50nw"
  },
  "R_X4-MbgVOLIW7a1KXx9og": {
    "date": "7/11/2016",
    "text": "King of Spicy - I love the name of this restaurant.  It's so absurd - it makes me chuckle every time I say it out loud.  KOS is located in east Charlotte near the old Eastland Mall location in a free standing building near a strip mall.  It looks like an old steak house that now houses some very tasty indian food.  The first thing I noticed upon entering is this space is BIG.  Really big.  There's a large bar, lots of tables/booths, a dance floor (yes!) and pool tables.  Evidently they host karaoke, dancing and networking events here.    We ate here around 6:30 on a Saturday evening.  There was no wait, but there was a steady flow of people coming in and being seated.  As soon as we sat down a server stopped by and asked for our drink order.  The beer/wine selection here is very limited - a few domestics, one indian beer (which they were out of) and a few house wines.  Not a big deal, just be aware.    The menu is a mix of indian and nepalese food - that includes pictures, for those who aren't that familiar with the cuisine.   We started our meal with Mango Palak Chaat - crispy, fried bread-pieces topped with mango chutney, crispy spinach and a yogurt sauce.  This had some great flavor.  For dinner, we ordered Makhani Chicken (also known as butter chicken) and Chicken Kadai.  The spicy level is on a scale of 1 - 10.  I have never encountered such a wide range before, so we went with a 3 and a 5.  The 3 had no discernible spiciness to it - this coming from someone who is very sensitive to spicy heat.  The 5 had a mild kick to it - along the lines of a 2.5 on a 1-5 scale.  We also got 2 orders of garlic naan.    The food was DELICIOUS.  The flavors were intense and the meats were moist and tasty.  If my review was only on the food - I would give this a 5.  The service was not good - which is why I'm giving this place a 4 instead of 5.    The food took a long time to come out.  It was hard to get a follow up drink order and then it took a long time to reach us.  The naan was delivered about 7 minutes after the entrees were delivered.  They seemed really understaffed for a Saturday night.   We'll definitely go back - but it may be for pick-up or delivery.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1Jzy7uCW_It9GAypvOJMoA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1Jzy7uCW_It9GAypvOJMoA/o.jpg"
      },
      {
        "img_id": "_HWnNRkB4xKcxkM8GXorGw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Mango Palak Chaat",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_HWnNRkB4xKcxkM8GXorGw/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "ED-IQcE0_ENLocqySw3zvw": {
    "date": "4/29/2018",
    "text": "This is probably my favorite Spicy food in town.        I am glad, I found this place.       My family and I love this place. I am a  foodie  person and very hard to please...But this place makes me happy. If you are new in town and looking for good food?? This is the place to go. Highly recommended by me .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Pz-sEu3VQzLg74hQxnOKg"
  },
  "80r70KmGTd7bPJnlp6OC1Q": {
    "date": "7/13/2017",
    "text": "Good food. It's big restaurant inside.. decent interior. Service was very quick. We had a buffet. All veg and no veg items were tasty. Chicken appetizer was really good. My husband loved it.  They serve proper salad with onion, lettuce, carrots cucumbers and surprisingly mango.. I liked it and reminded me the home made salad back in India. There tea is delicious. I would love to come again, if ill pass through south blvd area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mZVtzzBsXJLeEEOeHlNH6g",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Loved that they serve mangos in salad..",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mZVtzzBsXJLeEEOeHlNH6g/o.jpg"
      },
      {
        "img_id": "PInC1dClSWAzBK0Y8fPj6w",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Pakora",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PInC1dClSWAzBK0Y8fPj6w/o.jpg"
      }
    ],
    "user_id": "59QH1A8zysr4SN_hX1Q9jg"
  },
  "gtnqeqATkfZKIcv0RKwsBg": {
    "date": "10/2/2018",
    "text": "I love this place because the food is authentic Indian food! Served with class and kindness.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uKLPg9l1CJO_Mr0iVUSq3g"
  },
  "Nb8q5iFW0O4uoxMKKy75aw": {
    "date": "5/28/2019",
    "text": "Manchow soup & tupka came out well. Tasted fresh, served hot. However the chat wasn't what you would expect.  Papdi chat, was just a heap of papdi topped with frozen potato & frozen green chutney.  Place was clean, hygiene. Restroom was good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TZ3rntIkX2j8g4optFiv1Q"
  },
  "UOhXzNbJlb6u_exjBJ9VtQ": {
    "date": "6/30/2019",
    "text": "I'm going to go ahead and admit that this was my first experience with Indian food in Charlotte (I lived in Raleigh, previously, which had many great selections.)   I had my eye on King of Spicy from Yelp recommendations for some time, but never pulled the trigger until one rainy day where I was craving Chicken Tikka Masala for lunch and saw that they deliver on Grubhub.  I knew I had to go for it.  THE ORDER:  Chicken Tikka Masala, Spice level 4 ($14) Garlic Naan ($3)  Total: $17  I'll admit that I was mildly surprised at how expensive the food was (the above figures are before delivery charges) but I understand they do a lunch buffet for significantly cheaper and the food I received was a HUGE quantity, so fair enough.    The Chicken Tikka Masala was absolutely delicious!  A spice level 4 (out of 10, mind you) was still plenty spicy and the cooling provided by the rice made for a delicious combination.  After finishing the protein, I immediately paired the remaining sauce with the Garlic naan which was absolutely delicious.  The meal as a whole was fantastic, and definitely one I'd spring for again.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "HpPn0p2C4fnSbl6Ulw0x-g",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HpPn0p2C4fnSbl6Ulw0x-g/o.jpg"
      }
    ],
    "user_id": "uJftKIM8Cpo9lJhxMQB2_A"
  },
  "NPVKA8mwRenYXtJAqOQABg": {
    "date": "8/26/2019",
    "text": "Food is hit or miss. Used to be a regular but the guy running the place left for a while and the girl that took over has zero customer service skills or simply doesn't care.  For the food itself when it's a good day, is unbeatable. Then you've got days when they can't be bothered to strain their curries and you get mouthfuls of whole spices, unappetizing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EP_N1rfQ40re4kJzADE-Pg"
  },
  "aPsdQrC3rk7yskFexl_nVg": {
    "date": "8/26/2019",
    "text": "Love this place! I come to the buffet every chance I get. The chicken tikka masala and the paneer tikka masala are my faves! Nothing like some delicious Indian food and a freshly made naan. I love the lassi when I'm craving a sweet drink. It's a yogurt based drink and it's really rich and delicious. I have also tried their regular menu items it's delicious. I love that you can pick the spiciness level. I love spicy food but a 5 is perfect for me and my family. Also costumer service has always been great. I really recommend King of Spicy for anyone wanting to try some amazing Indian food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hWMGEj8fNmvY0nSiQUctyA"
  },
  "KmL5fInnA3mkEWyRsGD9ZA": {
    "date": "8/24/2019",
    "text": "The best Indian food ever!!! They have the best Chicken Tiki Marsala(hope I spelled that right) and their take out Buffett price is amazing at $6.99! We go every week! I love this place!!! My happy place! Thank you!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQvH8qh1wDdPkk5gG6OuWA"
  },
  "y4Wn7y2un6d74IIpBf3LKw": {
    "date": "3/5/2019",
    "text": "Food was really great. Very fresh & tasty. Loved it sooo much.  But I'm not that excited with the way they are maintaining the restaurant. They should really think about updating and cleaning the place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ikMgy1MzwyTSA7dwmpVt4A",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ikMgy1MzwyTSA7dwmpVt4A/o.jpg"
      },
      {
        "img_id": "HviH8JN8my1SMoiH6UGKOg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Momos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HviH8JN8my1SMoiH6UGKOg/o.jpg"
      },
      {
        "img_id": "XIudu_GhZUYeu0-el2wmBA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/XIudu_GhZUYeu0-el2wmBA/o.jpg"
      }
    ],
    "user_id": "H5LnpSPHPlN8Lw94_AT-4A"
  },
  "OAOKK5YqQN68VsB4rbei2Q": {
    "date": "8/24/2019",
    "text": "Food was pretty good. They ask you how spicy you want your food on a scale from 1 to 10. I got a 9 and my wife got an 8. It was very spicy but we really like spicy food and managed to finish. Price was fair. Only complaint I have is how long it took to make the food. I called in a carry out order. They asked me to pay over the phone but I informed them I was going to pay in cash once I got there. They told me it would be ready in 30 minutes. We got there in 30 minutes but the food wasn't ready. We waited an additional 30 minutes to finally get our food. Food was good but service was suspect.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wzL_KJdA6PjzLeJ0CybfmQ"
  },
  "Bp52NEoet0mqACiSQ_7GWg": {
    "date": "6/19/2018",
    "text": "Welcome back, King of Spicy!! I've been stalking this reopening for MONTHS and at last, welcome home. King of Spicy used to share their old location on Albemarle with Seafood Connection, but have since sold the space and taken over a new one! Thanks to other yelpers, I realized they're open again.. and I went immediately. Let begin!  I stopped by King of Spicy for lunch today and could not have been more excited! Their new location is smaller, but so much brighter and cleaner. They offer a buffet lunch for $10. I asked if they have a lunch to-go option, and I believe it was the owner that handed me a box and said I could fill it up for $7! What a great deal! He even offered naan and then went to the kitchen to heat up fresh naan for me. Talk about knowing the way to a girl's heart!   If you've never been to King of Spicy, don't let the name deter you. You can choose your spice level from 1-10 and they will accommodate your spice buds!  I don't think I can say it enough, but so glad to have you back in the neighborhood! The new location is literally 5 minutes from the office.. which is both a blessing and a curse on my waistline. Trust me, I'm not really complaining.",
    "rating": 4,
    "rated": {
      "funny": 10,
      "useful": 23,
      "cool": 18
    },
    "photos": [
      {
        "img_id": "q6_d532tUdcvQnY1N0pJoQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Bhel Puri (puffed rice pieces mixed with onions, tomatoes, cilantro, mint, tamarind chutney and lime juice) - spicy, but so so good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q6_d532tUdcvQnY1N0pJoQ/o.jpg"
      },
      {
        "img_id": "CNY1PpDPMjEpXyozXwcyxw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Nepali Bhel (crispy noodles and shredded veggies marinated in Nepali style spices and sauces)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CNY1PpDPMjEpXyozXwcyxw/o.jpg"
      },
      {
        "img_id": "qFzPenSfHhLaykAnhdjB8g",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Vegetable Manchurian",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qFzPenSfHhLaykAnhdjB8g/o.jpg"
      }
    ],
    "user_id": "mgX7RiyezBMCTMIhNhUfaw"
  },
  "d1nA0-1tX5NmdQ0y2N1nUQ": {
    "date": "12/7/2018",
    "text": "FIRST time eating Indian food and this was a GREAT first experience. My husband has been here a few times before and I haven't. He has been wanting to take me here for a while but I wasn't too sure about it. I finally gave in and said let's go to that place you are ALWAYS talking about.   This is a small restaurant. We were greeted and seated very quickly. We came during the evening. I took longer than usual to read over the menu. There were two people working in the dining area. A male and female. The guy was our server and was very sweet to ask what brought us in and to also explain the food and how the spicy levels worked.   We ordered a few things from the menu. My husband ordered a lamb stir fry (spiciness of 5). I ordered the chowmein with egg (spiciness of 6). We also ordered Dal Tadka (spiciness of 6)  as well as Naan. I love spicy food so I was willing to try level 6.   Our food came out pretty quickly. (I loved how they left a pitcher of water at the table). The food was SPICY but it was soooo good. My husband said it was too spicy for him. But I loved it. My eyes were watering and everything! lol. The server came over and asked how we were doing. He said he was more than happy to make a less spicy version of what we were eating. He said by my look in my eyes it was too spicy. (We did not ask and I was very pleased he flat out offered that! I didn't see that coming) I told him my eyes were just showing my excitement! I declined the offer and continued to eat the food while literally drinking the whole pitcher of water.   The staff that works here blew my mind. The young man was incredibly sweet. Gave my husband suggestions as to what to order next time because his food wasn't what he thought it would be. He claims he usually orders a curry and this one was more of a stir fry. He didn't complain though. Just wasn't what he was hoping for. The young man went ABOVE and beyond to show excellent customer service. I have NEVER experienced anything like it before. He wanted to know what we liked and what my husband wasn't too thrilled about with his order. And not only did he listen but he also offered suggestions for the future. Most of the time at restaurants if a waiter comes over and we say we are done they just take the plates. (Even if there is lots of food on the plates, they never ask if everything was ok with the order). That's why this young man surprised me. I wish more restaurants were like this. This young man put us first and it blew MY MIND. I would definitely come back here! I had a great first experience and it's all thanks to the compassionate young gentleman who went out of his way to make our experience top notch. He is amazing at his job. Very impressed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Xy4jfgc19CC2ezZC7HvqUQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Xy4jfgc19CC2ezZC7HvqUQ/o.jpg"
      },
      {
        "img_id": "ZoHhWABoZJkA9edoWzu4fQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZoHhWABoZJkA9edoWzu4fQ/o.jpg"
      },
      {
        "img_id": "XG9QnBqgFh0e3_95WoN5vA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XG9QnBqgFh0e3_95WoN5vA/o.jpg"
      }
    ],
    "user_id": "QRNzgxnW4uVkWZNkt9mH8w"
  },
  "0nopQ1DmdyaN8x47nqYo2Q": {
    "date": "11/30/2018",
    "text": "Visited here on a foodie tour and they prepared the buffet for us. It was OH SO DEE-LISH-US! Yes, spelled just like that. I piled my plate up with all the goodies and was upset I couldn't eat it all. The food was fresh, the owner was very nice and detailed in explaining the items on the buffet. My husband hasn't had Indian food so I plan to take him here for a great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3p0Zy9sRCoqFBoNQMPSe_Q",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3p0Zy9sRCoqFBoNQMPSe_Q/o.jpg"
      }
    ],
    "user_id": "O9WSFQHrHr3qlAtW5emMcg"
  },
  "ULS2roy0c6kypFO9ryp3ow": {
    "date": "6/4/2018",
    "text": "Hole in the wall that stole my heart. Best Indian food I've had in Charlotte! The option to pick your level of spice on each dish is so great.    We were in the area, and my husband had heard this was a good place to go. We went in for an early dinner.   Atmosphere certainly leaves something to be desired. The young man waiting on us was so kind.   We started with the samosa chaat. I've never had this dish before, and I LOVED it! It was delicious!  Then ordered the paneer korma and chicken tikka masala. The portions were of great size! We had plenty of leftovers. We also ordered naan. I loved all the naan options they had! We tried the garlic chili naan and it was fantastic. I hadn't had that option before.  You can pick your level of spice on each dish from 1-10. We ordered a 6. The waiter was a bit nervous at our decision. When the food came we realized we could've probably even handled an 8, but we LOVE spice!  We enjoyed talking to our waiter. At the end of the meal he brought us free mango shakes! So kind. I loved feeling how much they appreciated our business. We will be back!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "trfqWdPY_codn5jAhbo7lw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Garlic chili naan",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/trfqWdPY_codn5jAhbo7lw/o.jpg"
      },
      {
        "img_id": "VfC2GJb5o0zPcMFIvG2nRQ",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Paneer korma and chicken Tikka masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VfC2GJb5o0zPcMFIvG2nRQ/o.jpg"
      },
      {
        "img_id": "c35OWLFqCv1MxygaaqdARA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Samosa chaat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c35OWLFqCv1MxygaaqdARA/o.jpg"
      }
    ],
    "user_id": "sAbHdUgrjMOiQQLNh0H0YQ"
  },
  "adAcyIdOUIUbcJtPTykxVQ": {
    "date": "2/24/2019",
    "text": "Spices are chosen by level, 1 - 10, 10 being hot! The food here was flavored and presented nicely. The chowmein was delicious as well as the curry cauliflower. I bought extra plates just so I can take some home and eat the rest of the week. Food seasoned nicely, very laid back, quiet place to enjoy a meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UkK59nvXVSbgmSG53wuQBg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. This is called momo, vegetable dumplings. They were good.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/UkK59nvXVSbgmSG53wuQBg/o.jpg"
      },
      {
        "img_id": "fIq1h6LdyerfKBGGnBknfg",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Milk based bread type biscuit. Pretty good but not into milk.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fIq1h6LdyerfKBGGnBknfg/o.jpg"
      },
      {
        "img_id": "-XUOPwCwdyoz6oZ2B9Je_A",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Nepal Curry, spicy rating of 7 yummy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-XUOPwCwdyoz6oZ2B9Je_A/o.jpg"
      }
    ],
    "user_id": "GAWvdxEH2PgSiTYoyIj2Gg"
  },
  "z_XmQZp6hQSD-wm1LGJ1rQ": {
    "date": "9/2/2018",
    "text": "Been craving some solid Indian food for a while now and found myself a few miles from the King.  After giving it a shot today maybe they should consider a name change to the Queen of Spicy. Food was only average (as is the case with almost every Indian restaurant in the Queen City).  Not sure why we cant score a GREAT Indian restaurant here but I have yet to find one.  The buffet was pretty limited with 3 meat choices of only chicken, no goat?  More disappointing though was the lack of vegetable options which I find defines a great Indian restaurant.  Today the choices were limited to Chana masala, a paneer with peas, and pakora.  No Dal, no raita, no samosa?    As far as ambiance goes there is none. No pictures no music, no napkins other than cocktail napkins.  Service was fine and price was reasonable at $10.00.    Food: 3 Sporks Service:  3 Sporks Atmosphere: 1 Sporks  Local Beer: 0 Sporks Value: 3 Sporks",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qZuKmM78JxB15KEb_ukj3Q"
  },
  "GHehrfSpRoYptj1Ce_6xIg": {
    "date": "1/6/2019",
    "text": "Indo Nepalese....yum. Gobi manchurian, bhindi masala, chili chicken all the way.   Love this spot but it's a bit out of the way. It's tucked in a strip mall and sort of hidden.   Staff is awesome and this is one place where spicy is spicy. 7 is perfect for me and I am used to thai hot. Dare you go to 10....be prepared! Great stuff and a rare gem in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WuPybEM4dy2FEBCTzlufdw"
  },
  "Pfv5Rz8kGZmb0Bl0bQrEJg": {
    "date": "6/7/2018",
    "text": "First of let me say, this is definitely a hidden gem. Everything about this place was awesome. The person who created made me feel super welcomed he made sure he explained everything to me . I went in there just to get some food to go on my lunch break . The food was delicious and very well seasoned. I will definitely be back EVERYTHING about this place was AWESOME. I will definitely recommend it to anyone !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cwyJ09H7Yucwvl4L28Neww",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cwyJ09H7Yucwvl4L28Neww/o.jpg"
      }
    ],
    "user_id": "IuDFSNCsSdpNnOtrpN8Nuw"
  },
  "uuzRqhpv1o1uuQ_aCX9APw": {
    "date": "11/7/2018",
    "text": "Toni and I went to this Indian Restaurant today for lunch.  It was off the beaten path, on the backside of a shopping center on E WT Harris Blvd.   There were some interesting other shops in this strip center, including a sex shop! No, I didn't pop in there.  I had read about King of Spicy on Yelp and the reviews were very good.   The only option for lunch was the buffet.  I haven't done an Indian lunch buffet in a long time, so this was a treat.   When I did my Yelp check in, I received a FREE Mango drink - Indian style. How nice of them to reward their YELPERS!  The server brought a basket of hot naan to start our lunch.  The buffet had numerous selections of chicken dishes as well as vegetarian options.  I tried to sample a tiny bit of most of it and it was all very tasty.  There was both rice and noodles to accompany the dishes.   Unlike a lot of Indian restaurants, this one had iced tea. They didn't have unsweet, but I splurged and got the sweet tea.  Nothing out of whack here. It was very quiet.   There was a TV on the wall and Trump was having his news conference.  Another patron said to \"turn that thing down\" and the TV was turned down.   That was probably a good thing for my digestion.   I would be curious to go back for dinner, to see how they hold up for people ordering off of the menu.   For what I experienced today, two thumbs up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7Gq1n4zGTjm_OuRwrzjFnA",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7Gq1n4zGTjm_OuRwrzjFnA/o.jpg"
      },
      {
        "img_id": "AP0PdV3lVbXklv-qlya7mw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AP0PdV3lVbXklv-qlya7mw/o.jpg"
      },
      {
        "img_id": "tQZC2iuu3X01E6gFc4SU2w",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tQZC2iuu3X01E6gFc4SU2w/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "AayyuGZLeb1eXYZwxoMdpg": {
    "date": "4/27/2019",
    "text": "Just try it!  It is soo good. We were a little skeptical because of the shopping center and dirty parking lot.  But oh don't let that stop you from some really good food!  We had the butter chicken, chicken tandoori and lamb curry with naan.  The food is outstanding!  The flavor and spices, consistency of the sauce....it's soooo good!  Friendly atmosphere and service.  Can't wait to go back or just get take out!  I found my new Indian spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOhyDyMWN7ckYDNA4C-JDA"
  },
  "62vphY1zhuBz2XSKXyh6VA": {
    "date": "10/24/2018",
    "text": "This is going on my list of favorites.   It was so delicious and the staff was super nice.  Cant wait to be back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UjqdDM4AsltLgRR15RKVNw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Can&amp;#39;t get enough of this place.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UjqdDM4AsltLgRR15RKVNw/o.jpg"
      }
    ],
    "user_id": "jU1aTee0g45_eJuPfp9aHA"
  },
  "z1ecsmTQqA1LHp3s4AN-DA": {
    "date": "1/26/2019",
    "text": "Nice atmosphere. Great service. Quality and quantity of the food is good. The culture is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vXzG0dGwuWkGdYVVyACUfw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States. Great place!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vXzG0dGwuWkGdYVVyACUfw/o.jpg"
      },
      {
        "img_id": "hjrC4zO3Ccy5chpK-jnXsw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hjrC4zO3Ccy5chpK-jnXsw/o.jpg"
      },
      {
        "img_id": "HZTNlmuZiVL17VbiEqvXAw",
        "caption": "Photo of King of Spicy - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HZTNlmuZiVL17VbiEqvXAw/o.jpg"
      }
    ],
    "user_id": "-3I54LIxcqsP2C2IGfr6aQ"
  },
  "6eI_vInGR2FoBhpNedVi2Q": {
    "date": "11/13/2018",
    "text": "Delicious spicy Indian food. I ordered the yellow curry and it's fantastic. Spicy goes from a 1-10 rating the 8 was just right. The area of the restaurant isn't the best but there's lots of parking and the service and food are bomb",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rAzNQSdRHFiva0EYU1zEAA"
  },
  "WD0gGup7-UolexXcvRUAOw": {
    "date": "1/7/2016",
    "text": "EXCELLENT! EXCELLENT! The food is fabulous! Atmosphere is festive. Not your run of the meal Indian restaurant.  There were four of us and we got four different meals.  Each was very tasty and seasoned perfectly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KQYup-QDbO99kvphRDfaeg"
  },
  "SD4UmHfr0v3h3x6twELzEQ": {
    "date": "6/6/2017",
    "text": "This place is on Abermarle near Independence Blvd.  It's a large restaurant with a fountain and its easy to spot.  It's really good.  The food is good.  There's a great buffet with a lot to chose from.  Even salad.  For events the place is great.  It has a huge bar and raised stage.  I can see having a lot of events there. The decor is simple but with the great food and huge bar this place is a great place to have an event.  During the day its mostly the buffet or other dishes.  It's really good.  My husband and I have been there several times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uvEZguYAjEooYgvaXzCEpg"
  },
  "Uk5WDgEfdLcj5Y2WYSrguQ": {
    "date": "1/3/2016",
    "text": "Very tasty food..good quality nd quantity..... \"Must try\".. We are gonna return again........:)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7TxgdD95Ou91FOmf7YQL6g"
  },
  "k1Y0u0j6UTSb5i1WqsCeSA": {
    "date": "10/15/2016",
    "text": "We love this place. I love that they have pictures on their menu so you can take a look at everything to see what you might want! Everything we've had is delicious from the tandoori chicken, coconut curry, naan, samosas ... authentic and reasonably priced",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9JIUfiODt6yulLqPGvEF2Q"
  },
  "NGXzMmMDJ1QH2OEq3zHCwA": {
    "date": "1/6/2016",
    "text": "I would like to say it's one of the worst restaurant I have eaten or been in, should close, the service is just flat out bad, the atmosphere is joke, pool tables, stage in the dinning room showing really bad music videos, the India food at Target is better out of a box,the people that posted 5 stars either work there or are friends with the staff, I'm pretty sure you can not make someone leave a tip or the restaurant will charge you 15%, that shows you how bad service is..... Stay away",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8sNz_pHjV1opvI9H1tfQQ"
  },
  "7uVbiLktNXiODDP41QzEKg": {
    "date": "11/21/2016",
    "text": "Food was very disappointing.  For $40 I would have expected at least one of the dishes we ordered to be edible.  Save your money.  Eat somewhere else!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eH4g0GBISUG4mo-3FL7RaA"
  },
  "XKAznoC0ZRGSkKBEySkcew": {
    "date": "5/25/2017",
    "text": "Incredible Indian food. We've ordered probably 7 or 8 times and it has always been awesome!! Huge portions. We always get the chicken curry ans the tikka masala. The naan is to die for as well! You must try this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vSukz8DiWpacE5xlKiO4PQ"
  },
  "cO4JsOsv17K2wzAnYrVlEg": {
    "date": "2/21/2016",
    "text": "Overpriced and overrated. If you want good service, don't even bother thinking about coming here. Their food isn't great either, but their prices are where the owner wants them to be. Total waste of money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRHFt-Sdq3Xi_J0pZD3Zbg"
  },
  "o4ztLvMZDYlTWlHIGMSvRg": {
    "date": "3/9/2017",
    "text": "Raj is one of the highly professional representative at King of Spicy. His great inter-personal skills makes all the difference. We are in love not only with the delicious food but also with well-behaved, efficient and courteous staff of this restaurant. Thanks King of Spicy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cs_cqRJDex48Gw4vySC0bw"
  },
  "IfjSiHKQd9sTbeOF8VaZTA": {
    "date": "2/19/2016",
    "text": "New restaurant that honestly looks a little sketch from the outside but it's too tasty to not return. The manager came and spoke to us several times. And the food! My girlfriend and I had no idea what to expect and just picked two random things on the menu. As a testament to how great this food was, just let me say that I now try to cook Indian food at home because I was inspired. Weekends here are a lot of fun too. Definitely would recommend this place to anyone. Their naan, their saag paneer, all great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OKQidxl0kpRUEAMgEx3eBA"
  },
  "M566yddx4LcslUP91NVCnw": {
    "date": "8/22/2016",
    "text": "The restaurant is situated on a rather quiet area, parkings are available though i felt its less in number. Service was quick and we were given a table immediately. We ordered momos and chicken biriyani. The chicken momos were really nice and dint really have much spices added which was good. The biriyani was the KOS biriyani and was having some chicken 65 served along and i loved them. the nepalese tea was really good and should be given a try. Also the manchow soup (veg) was worth good. The place also serves indian beer, as i saw some guests having them. The place is not pricey and for the taste it serves, should be paid a visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hyitzfoMjl_G_ud5_ewZQ"
  },
  "ZKyhoTO6LHfzX3vqyXKj9w": {
    "date": "2/1/2016",
    "text": "Went for the first time 3 days ago. It was AMAZING! The waiter was so nice, such a sweetheart! And omg the food was so good I loved it so much. The chicken was cooked so good and the spices on the rice gave the dish a special taste. I went there really late at night, they were about to close, but they still welcome me and served me. I am going there again for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsY8t5ittpZN8vqRrJQMug"
  },
  "GRAs6YtZ1dIMoB5SdH9fow": {
    "date": "1/23/2017",
    "text": "The food here is really top quality. We shared plates of chicken momo, chicken biryani, manchurian meatballs, Nepali bhel (crispy noodles) and plain naan. My wife also had a bowl of sweet corn soup. All the dishes were very flavorful, fresh tasting and well executed. The spice was fine for me but maybe a little on the hot side for my wife, who tempered it all with a mango lassi. If you want to keep the spice level low you should probably order off the traditional Indian menu rather than the Nepali menu. Personally, I loved every dish. Our server was very friendly and informative, if a little slow to come around at times. The Sunday lunch crowd was not that big, though the others there looked to be South Asian, which is always a good sign. I highly recommend this place and look forward to coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9wJr_EWf6c6Qgpj_WW6Jw"
  },
  "pAJy39O1cMuePGxRMmKZSA": {
    "date": "7/23/2016",
    "text": "Started with samosas, then goat curry and chicken biryanis.  Well balanced use of spice and delicious.  Love the goat curry! Ordered the naan too.  Marsala tea to round up the order.  If you like spicy foods, this is the place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-pEisCxCICFfRPS4s9bPxQ"
  },
  "Tsp-Qq2o1Gvf5ymHvXsIeQ": {
    "date": "12/20/2015",
    "text": "Great food. Very authentic and spicy. We showed up at 3 and didn't realize they close the buffet at 3 so the food was cold and we weren't offered naan. After speaking with the staff about this they gave us 50% off for the cold food and no naan. Even cold though the food was good. I believe if we got there on time it would have been phenomenal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gG501s0NGJ-RrDK_XsO3Q"
  },
  "76YUWm3e3lNfWjiAAPA1Dg": {
    "date": "1/14/2016",
    "text": "Finally an indo Chinese menu that fulfills all your cravings! 5 star !! Love it and already been here twice this week",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRanNgcTGPT3QPNUL6Slew"
  },
  "_MGK8ta0GMU7Np1TVuTTjA": {
    "date": "1/7/2016",
    "text": "This Indian/Nepali Restaurant is very good. That was my first experience eating Indian food, and I must say its one of my favorites now. The place is obviously been owned by other cultures so obviously there is some changes that still could be made. I only seen 2 people working and they are there everyday, but they made sure everything was good. They checked on us frequently. While I waited for my food I got a chance to play pool and have a drink. I Recommend the chicken 65 as a warm up, it's amazing! The naan bread is also wonderful. My favorite it the Chili Chicken with White Rice. To finish up the owner and manager made sure I enjoyed my visit I will definitely come back and bring my friends. Don't let a negative comment from a angry person make you pass on this Great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JrSBXJ4D0Chst7bXNDYKxA"
  },
  "UgJCY62N3u7gAq-Vc-e6vA": {
    "date": "1/4/2016",
    "text": "My favorite indian and nepali restaurant. I love chicken chow mein. Grate costumer servics love it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZXjNEeRIK_Sl5iSIq-e1Q"
  },
  "TtZk-i24yOw0FtAdXP_cdQ": {
    "date": "4/25/2016",
    "text": "Best Indian food I've had in Charlotte. Everything we ate was delicious. All the meats were cooked very well. Looking forward to coming back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BJruvCUH6tgCXTzkX83U0w"
  },
  "asVeht5XXFA4e6E4qg6q2w": {
    "date": "3/17/2016",
    "text": "It's just ok. Worth trying once. Veggie platter was good.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hfz8JUKEIe2Wv4CGwsLUpQ"
  },
  "9W_AYJDCOTQu9spzlWqN4Q": {
    "date": "8/14/2016",
    "text": "I can't recommend this place enough. King of Spicy has some the best Indian in town! The manager is especially kind, helpful, and accommodating. One tip: If you're looking to order takeout from them, I recommend calling in your order instead of through Yelp. Great place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eb-9nIM-WbAOVlwa0OruOw"
  },
  "80KD4MJWXc3-LUu9k-dWNA": {
    "date": "11/8/2016",
    "text": "I stumbled upon this place while visiting Charlotte last week, I ordered some type of Masala Fish which had a spicy paste made of chilies, tamarind, and garlic (amongst other spices) and rubbed onto the whole fish which are then fried.  I truly got satisfied my seafood craving and spice craving all at once. I will definitely stop by again to eat here when I visit Charlotte again next month. In NYC I go at least once a month for Indian food in Queens, NY by that Dinner in Jackson Heights; to find Indian food while visiting this neighborhood in Charlotte, was amazing and the quality and flavor of the food it's unbelievable - Whoever manages this place is doing a good job...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXFsGWOGnsgpo-cIVUEikg"
  },
  "j9rRGK2a45TxlZYqHSpH9A": {
    "date": "5/17/2017",
    "text": "Excited to try Indian food for 1st time. Decided on lunch buffet as to not pay a great deal of money for a dinner that I may not like. Service was attentive with the one server for the lunch crowd. We'll, not a crowd exactly, there were two other ppl there when my party of 2 arrived. We ate from the buffet and everything just tasted strange. Lots of curried dishes with all dark meat chicken. Naan bread was good but blandish with no salt whatsoever added to the flour!! Ordered a garlic naan to go. Mild garlic flavor but still no salt again. We kinda just picked around our plates trying to find something appetizing. Unsuccessful!!. The rice was good tho. Will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Q8T988A7PPOheV9vDkzMg"
  },
  "tPcz_9YTxs8ExD4lxce7Ew": {
    "date": "3/18/2016",
    "text": "Just turn and go back!!!  Take this piece of advise from an Indian!! WORST food ever! Stale food in the lunch buffet and absolutely horrible taste.  I just hope I don't fall sick after today's lunch buffet!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "hEDOHC6m8VdraHf6ucF0-Q"
  },
  "2QXbe_TT_8aIZuX8MBkK9Q": {
    "date": "1/18/2016",
    "text": "Ok the food is amazing but please update your hours!!! I've had trouble TWICE ordering food because the kitchen is closed from 2:30pm-5pm which is fine but if I call ahead on Saturday at 2 and ask if you are serving food and you tell me yes, only to get there at 2:15 to be informed I have to eat what's leftover on the buffet and you won't be bringing anything else out because your kitchen is closed! For $13 a person? No thank you. You couldn't have warned me about that over the phone? It's kind of an important detail. That being said the food is too amazing for me to even want to give them less stars, but sheesh people.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhKG0jWCmTM5ZWd5C-Xm1w"
  },
  "ZaTH1cGlXhzZFO0rZaCp9Q": {
    "date": "2/7/2016",
    "text": "I really wanted this place to shine. Ever since Woodlands was sold years ago, their recipes and quality have remained at a level that does not give me a desire to visit. KOS is even closer to me and I wanted to try them and at the same time try the Yelp Eat24 system which collects the order and payment and sends it to the restaurant for the customer.  Service at Eat24 was spectacular. It went quickly, there were no problems, and I will use their service again. Their site presents the same quirky hipster attitude as Yelp itself. At the restaurant, the cashier was confused, but polite. She had never heard of Eat24 and didn't know how the take-out order had been paid without her taking the money. She left for the kitchen and came back educated. Then, everything went smoothly. Now, on the food from KOS. (Is that not a strange name for a restaurant?)  The Samosa came 3 for $4.99, a bit high but clearly made at the site. The crust was uneven but tasty; obviously, the thicker parts were not done at the same level as the remainder. The filling was milder than I expected and had flavors that did not come from a mix; I think they should work on the taste, though, as it was on the edge of bland. The mint chutney had heat and made a nice contrast with it. The tamarind was quite sweet and didn't have the stronger tamarind flavor I prefer when I make it myself.  I do not recommend the Mixed Vegetable Pakoras for $5.99. These are not individual items but a ground vegetable mixture covered with potato slivers and fried. The coating was too heavy and the taste of the fritters was not distinctive. I recommend they use the traditional when possible but the ground vegetable mix is just not a winner in this case.  The next dish was Chettinadu curry and was the single meat item of the order. Something broke down here. I ordered Lamb, spicy. The lamb cost $2 additional, making this item $14.99. The container had written in legible black magic maker, \"Chettinadu Chicken.\" Many restaurants offer labels that are nearly illegible and this was excellent. The container was dark, so that didn't seem like chicken. Besides, who wants the Chet with chicken anyway? I opened it and it smelled great. There were many chunks of meat and not too many potatoes -- another good sign. First taste ... beef. This tastes like beef. Look at the lid again ... chicken. Taste again ... beef. But beef is not listed as an option for the Chet. Oh well, I don't cook beef Indian curries for obvious reasons, but OK, I'll press on. The texture is OK for lamb, but the taste is still beef. But there is no beef on their menu at all. This is not a \"pure vegetarian\" restaurant like Woodlands and I assume that cookware is shared between meat and vegetarian dishes, but they don't offer beef anywhere on the menu! This was odd. I saved some in order to give to a friend to blind taste to see what they taste. Anyway, I liked the fresh curry leaves, but I can make a lamb curry that tastes better and spicier, though I do not label mine at all!  After the one meat dish, we went back to vegetarian, the strong backbone of the many cooking styles across India, though not Himalaya, their other specialty. Aloo Gobhi, $9.99, was nice. The onions were very thinly sliced which makes me think that they use a machine to create bowls of onion slivers to use in several recipes. The slivers become hair-like and limp, creating an odd texture to contrast with the potatoes an cauliflower. I love the cut of the cauliflower but the potatoes were the same small size as found in the \"Chicken\"/Lamb/Beef curry above. They were not overdone. Again, my request of \"spicy\" was toned down; they did use some heat but it was one-dimensional. I think they do that for everyone to avoid complaints. I recommend for this dish a combination of the dried Sambol pepper and the fresh Serrano or Thai Bird's Eye to create a couple levels of heat and flavor. This was probably the most successful dish of the order.  Last was the Daal Makhani, at $9.99. Why was the daal so high at nearly $10? Well, it seems that every \"entree\" dish comes with white rice and a piece of naan. This is a mistake. This meant that my order came with three containers of white rice (not my favorite and not particularly well cooked) and three pieces of naan. Uh, that's a lot of starch. I know the idea behind what they're doing; item price must not fall below a certain point. But, they should offer side items that can added to an order without including more starch. Anyway, it had good texture and good taste. I ordered it medium and it came mild. I take it that the cooks or the owner did not live in Southern India. If you are used to spicy food, you will be disappointed. There is no way in the Eat24 menu to choose anything \"spicier\"; you might try adding a special comment to the order. I'll try that next time.  To read the full review, visit <a href=\"/redir?url=https%3A%2F%2Fwww.facebook.com%2Fmichaelsmusicservice&s=6e3e64d6ce490f40b730f1eeb5fd7b42ec1a85fa12c3bd4dd28df439f5722ddf\" target=\"_blank\" rel=\"nofollow\">facebook.com/michaelsmus...</a>.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "mT-WWI_Kfo8JPgrK3y-BkA"
  },
  "VacLT4OEukIQY2l5NgBMEg": {
    "date": "12/16/2015",
    "text": "Oh my gosh, I'm SO excited for the first Nepali/ Indian restaurant in Charlotte. King of Spicy is so good and the staff is very friendly! They have a huge vegetarian selection and many meat options. The veggie momo (like dumplings) is delicious! At my table we had the Chicken Biryani, Bhibdu-Do-Piaza, Aloo Gobi, and Vindaloo Lamb, everyone loved their meal! Also with each meal you get to pick your level of spice so even if you don't like spicy food you can get something delicious but if you like super hot, they'll melt your face off! So good I will definitely be back! Long live the King!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "qw402RL09AtrWUJmxqHVIA"
  },
  "zr1MV2bUhRt7WUxavbyE4g": {
    "date": "6/25/2016",
    "text": "I have been to King Of Spice now numerous times. Good quality food and the manager or owner always nice and attentive. Not the best looking dinning atmosphere but hey I go there to eat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fjPKSFoDZhk3lg59N35Jbw"
  },
  "Hyod58x5tyilhqXMzlJ0OA": {
    "date": "12/16/2015",
    "text": "Me and my buddies found this gem coincidentally. The staff here is friendly and helpful, they would explain dishes that you have no clue about. The food here is fantastic and delicious. Indian food is known to be spicy but they always ask you how spicy you want it to match your tastebuds. Highly recommend this place if you're looking to try some Indian cuisine or if you already enjoy it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "fw3A_XKizewlr-1ZQSxWoQ"
  },
  "ZIEPeNx6jt7JAXPZPsGBOQ": {
    "date": "1/2/2016",
    "text": "A new place in town with amazing Indo - Chinese food. Very nice ambience, spread over a wide area, includes bar, dj area, pool/snooker. Very nice staff. Loved thupka, soups , momos  n all other things .  Large portions served..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYXs0SarJTzWKglYmtx8tg"
  },
  "2xrpvKkWJ6SBxBLrV55APw": {
    "date": "2/18/2016",
    "text": "The food was very disappointing!!! I was craving for Indian Chinese and thus ordered Darjeeling noodles. What I got was a plate full of vegetables and semi cooked noodles with no flavor. Simply no taste. It was a total disaster. If you are new to Charlotte and are looking for Indian food then this place is not the answer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "d2mjWg0euCJYfkeWd7dckg"
  },
  "UiKh5mNfSemtwALJsg-60w": {
    "date": "1/3/2016",
    "text": "No way on earth it could have one star. Horrible Indian food. Half of the dishes from Menu are not available. Can't go if you are expecting Indian food here. We had horrible soup, pakoras as starter and had taken their signature fried rice with King of spicy ingredients. Turned them into to-go after testing it. You could get next steps.  Can't go ever again.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFrt9oraw82tdt2Eta6fCQ"
  },
  "eY5kxwBVjM1sq_xlNjcFlg": {
    "date": "12/12/2015",
    "text": "My husband and I had lunch today and enjoyed the buffet they had for $12. The buffet had a good selection. Good flavors. You will NOT be disappointed. We highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "tsqrqT_Rg_H4kNoGjZna4w"
  },
  "4NIAu9zfmiLQU6ir-vufBg": {
    "date": "12/24/2015",
    "text": "The food has got to have been cooked to order because it came out fresh and piping hot!! The prices are great and really really good!!! Their bar is farrrrr from being \"watered down\" - and they serve it up right. The atmosphere is good - state of the art Karaoke, Deejay with all the latest and 2 Pool Tables. We will be coming here often - you won't be disappointed, get down here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "fW-7tGvCJ-GD4-9JoRsozw"
  },
  "RfAvtGsuq-Qt0pXza0PTVw": {
    "date": "10/13/2016",
    "text": "The food is great!! The service sometimes could use a little work but all in all have had pretty great experiences the times I have been. Keep up the good work King Of Spicy!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KZMm4CGaHViEg3qgXBeK-A"
  },
  "omDxXzkrSKw3MJOWavWetA": {
    "date": "2/27/2016",
    "text": "The Vegetarian Platter and Greasy Uncooked Okra dish were unsatisfying for the price. Both the samosas and naan bread were especially doughy (almost donut like). There are many other Indian restaurants better than this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLcqTVBdsCXFv0-sksSmAA"
  },
  "oeZWSDhfJKJs-z0N7hveVQ": {
    "date": "1/4/2016",
    "text": "Amazing food! The only place in Charlotte that serves indo Chinese food like you get in India. Also, their traditional Indian dishes are fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2AnCjb5FaYmdFN2ru79MwQ"
  },
  "0hnt0OTE2bbOZ8hv7PUFFw": {
    "date": "8/17/2016",
    "text": "Delicious Indian food with good service. We had the Manchurian Dry Chicken appetizer. It was great very tender and incredibly flavorful. We ordered spicy level 7, which it definitely the top of my spice limit. We had chicken tikka spicy level 7, as well, and 2 orders of garlic naan. Jamie was really nice and very helpful when making suggestions about what to order. Glad they deliver, too! The restaurant is kinda dark but clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QKBYFHcVVrW6XgDk6aX_yg"
  },
  "LPhOIDLVw4y7aqyLX1EJdA": {
    "date": "2/12/2016",
    "text": "Loved the food. We all shared and sampled. A huge bonus is karaoke on Friday nights. Karaoke + Indian food =  Service a little slow when obtaining checks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cu25yhy4GQ1Cbe5IEyEviQ"
  },
  "8uKUtlQ-QbIqJpjHJriPFg": {
    "date": "7/10/2017",
    "text": "Only thing I don't like is that I can't make it up there as often as I like.   But the Seafood Connection crew don't change one thing about anything you guys do.  Keep on doing what you do.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6t60g41_uWNGD_f5iYxdZQ"
  }
}