{
  "uKNomgKhNrm--A5uVd-w4Q": {
    "date": "10/10/2013",
    "text": "I took a friend here for her birthday on a Tuesday night. Our server was very nice, well informed, but very scripted. As for the buffet, I had two delicious side salads and as far as I could tell, all the salad were fresh and yummy. Their special for the evening on the buffet was sesame chicken, which was leftover from lunch (I think; Chinese Day at lunch time) and it was rock hard and the bottom of the barrel. We were brought a plate of random little fried breads as an appetizer and I can't say any of them were very good. When dinner came, pork loin for me and salmon for her, the potatoes were delicious and the Pinot Grigo was half off and very good as well. The loin was juicy and had great flavor but the parmesan crust was very salty. I ate thin slices so I could only have a small portion of the crust at a time. Then when it came time for dessert I told her to order a birthday dessert, while the waiter stood there and listened, and she ordered the NY cheesecake. He brought out her \"complimentary\" birthday Flan plus what she had ordered! HA! Seriously? Why wouldn't he have told us she was already getting dessert. Either way, it wasn't bad but I'm not eager to return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "upGO0mC1eW6B2ivk0r0djA"
  },
  "Q6gfofBOk3et7m1VuZmggw": {
    "date": "12/31/2015",
    "text": "My husband and I went here for New Years Eve, and we expected it to be a higher-class restaurant. It was much more laid back than we anticipated- most people were wearing tennis shoes and t-shirts, so that was weird. The only reason I gave it two stars instead of one is because of the service. The meat carvers and waitresses were extremely attentive and polite, and they validate your parking if you park in the lower sections of The Greene Parking Garage. However, the food was extremely overpriced and not palatable at all! The \"buffet\" had strange items- marinated veggies/salads/deviled eggs/rice/Alfredo/tomato soup/turnip greens; but none of it was actually good. Then the meats- the sausage was gamey and inedible. None of the meats were seasoned, most were charred horribly, and the steak was nothing but fat. We were so sad to have celebrated our NYE in a \"cheaper-than-a-Chinese-buffet\" spot in Charlotte. We also couldn't believe they've actually won awards for their food. Don't waste your time- there are so many other amazing spots in the Queen City!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4mGbn3pP_qXP2NA3FIMNbw"
  },
  "zb1uF6AEy4arhvRQwT6nWQ": {
    "date": "7/2/2013",
    "text": "Great place, service is excellent and food is second to none",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q576ZOeWjukm9iwqkSe2ZQ"
  },
  "4efJAf8pwkmEQwaKK-sXSg": {
    "date": "11/4/2015",
    "text": "Very disappointed!!!!! Went here for lunch at 12:40 and stood in line for over 25 min to be seated. I noticed there was no hostess, yet there was a full hostess desk up front. I could see that one waiter was not only the waiter for an entire section, but also was the hostess, as well as the busser. How could a Restaurant like this with such a \"lunch rush\" have no Hostess, and have one person on the floor? As well, out of 7 selections from the hot buffet, 3 were completely empty, all veggies. The carving station was abandoned, no one was there, I wasn't sure if I should just carve myself. Then a gentleman came out to stock dinner rolls and I asked him if there was someone to carve he replied \"i'll do it\", I'm like but are you supposed to???? Overall the food I was able to scrounge up was good quality,I went on an Italian Wednesday. Not impressed overall, but for a $12 lunch it's actually worth the money, but not worth the wait. I expect that Dinner should be much more of a selection as well as properly staffed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zXlvaUsDwAHEDjWlSb8TUg"
  },
  "98O4oZKzHasIaHOUFnfcwg": {
    "date": "4/16/2012",
    "text": "i have been on a buffet kick this past couple of weeks. the service was great and so was the quality of the meat. if you want a buffet of light meats such and the top round, pork loin, and turkey breast this is your place. i have to say the turkey was the best and i hate turkey. it was so juicy and flavorful. the salad bar had many different salads...i dont know what else to say, i dont eat salad haha. the top round was good, i didnt see any steak sauces but it could had used some. the pork loin wasnt bad. i wish i could say i ate other sides but all i ate was deviled eggs (good), roasted potatoes (good) and cucumber salad (good)....check it out for lunch if youre in a carnivorous mood.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "FfGSskrEu9jHlPy4sM8VBg"
  },
  "Fa8qq8EMAoI2l2MAi40OLg": {
    "date": "6/28/2012",
    "text": "selection is limited and the lamb was unreasonably overcooked.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BTHj0Dn64b7yl5OlvPteeg"
  },
  "_eU8Az2mCBZ0FWrsio4pSw": {
    "date": "7/25/2012",
    "text": "I went here tonight for restaurant week and I was very, very disappointed.  I had a reservation and waited 30 minutes to get a table.  I was understanding because it is a busy time to come during restaurant week, however, I should have known then that it wasn't going to turn out well.  Our server barely explained the Brazilian style and being that this was my first time in a restaurant like this, I expected a little more information.  The food was ok, not bad but nothing special either.  We didn't even wait for the dessert because once we had our server's attention, we knew it was our only chance to get the check and get out.  I read other's reviews right before we left for dinner tonight and although there were several negative, there were a few positive and I figured why not try it.....NEVER AGAIN!  The only two positive things I would say about Brazz is 1) they have great chimichurri and 2) they validate parking from the green lot.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UZCPkbUBJbGWTwaxFTxkA"
  },
  "JSyjcnsn7GaHwHTFS1M3Gw": {
    "date": "7/11/2014",
    "text": "Went to this spot based off of the reviews and it wasn't as great as I thought.  To me it was the flavor of everything.  My first plate was actually delicious. Enjoyed the asparagus and pasta. The chicken soup was fresh and I loved that.  Was on the salty. I order the chicken marinated which came with mashed potatoes, green beans, and a fresh spinach salad with balsamic dressing. I was not fond at all of anything but the salad. There was something about those mashed potatoes I couldn't put my finger on and the same with chicken.  The food wasn't my cup if tea. 4 stars for customer service, everyone was helpful and great!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JFj32F2rZWBIVcjxP2qd8g",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JFj32F2rZWBIVcjxP2qd8g/o.jpg"
      },
      {
        "img_id": "RGRVENIscT2KsT8SMtpb2Q",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RGRVENIscT2KsT8SMtpb2Q/o.jpg"
      },
      {
        "img_id": "C6a30wduIyXLuMdufga2ZQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/C6a30wduIyXLuMdufga2ZQ/o.jpg"
      }
    ],
    "user_id": "AIi5FESQqCFPd07WJa2knw"
  },
  "Lcgp202U1dYBHIjMdcZ2vw": {
    "date": "12/13/2015",
    "text": "I wish I could leave a 3.5. My husband and I went to dinner at Brazz last night. The only reason I would give it less than a 4 is because we have been to some truly amazing Brazilian Steakhouses so Brazz had a lot to live up too.   We were able to get a table within seconds despite not having a reservation. So that was a good start however, once were seated it took 10 minutes of watching servers go back and forth past our table before anyone even brought us water much less took our order.   The buffet leaves a LOT to be desired. There was an abundance of overly mayonnaised salads and plenty of sad piles of greens. Nothing from the hot bar looked appealing other than the plantains. But hey, we don't go to a Brazilian steakhouse for ziti and rice so that wasn't a huge deal. I do wish the cold bar had had more options like cheeses, maybe some shrimp etc.   The meats really were the stars of the show. They had the best chicken that we have ever had at any Brazilian steakhouse. I usually skip the chicken but theirs was delicious. The scallops were great. Gator wasn't chewy. And, all of the meats were literally sizzling as they put them on your plate. When we ordered she asked us how we like our meat cooked and we said medium rare to rare. The very first piece of sirloin I was given was practically grey because it was so overlooked for my liking. So that was a bummer but, it all went uphill from there. The flank steak was our favorite. It was bloody, tender and delicious.   They really tried to hard sell us on dessert even though we told them we were so full we could barely move.   Overall it is worth it if you have a Groupon. But, if you're looking to impress someone, stick with Chima.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0DMRdNIxJMQD5zkyvMzv1A"
  },
  "GrrS0OGPQIPt2HzdGk7UoA": {
    "date": "3/27/2017",
    "text": "I came here for a work dinner. The food was absolutely delicious, and rather inexpensive. I wouldn't suggest this place for date night though. It's more of a family restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i0Ax29PVTid8hFDbH4fbAQ"
  },
  "8dCAKupxfcKDUu5lwOVc5g": {
    "date": "3/18/2017",
    "text": "Not a fan. Service was great!  The wait staff and management try extremely hard to please their guest. Unfortunately the food just isn't very good. The meats are very bland with hardly any flavor at all. This was our first experience with a Brazilian steakhouse and it was rather disappointing. Especially for $100+ for two people. The food was sub 1 star!  Sorry",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d_A89gNgnnj0fRkG0j19lQ"
  },
  "cFU9qCc0hDv_VIb36p_VHg": {
    "date": "6/17/2013",
    "text": "Review for Lunch Buffet only --    It is everything you want in a lunch time buffet.  Carving stations, cold and hot sections, daily themes (asian, country, Cajun, etc), and a helpful friendly staff.    Located right next to Fuel pizza and across from Matt's Hot Dog shop, Brazz is a little hidden but very much worth the search.  Don't go in expecting Chima or anything but they try to rep as a Brazilian Steakhouse.  And a lot cheaper!  $12.95 for endless lunch...Yes sir!   Make sure you go to the gym first and then maybe you won't feel that bad eating like a beast.  Carving stations are Top Sirloin, Turkey, and Pork Tenderloin.  If you make through the meat, salad bar, and themed bar... Then you have to get yourself some rice pudding. Trust me!   Enjoy!  Ian M.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7UzvTow4f1XqrX-yrwouxA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Top Sirloin is goooood!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7UzvTow4f1XqrX-yrwouxA/o.jpg"
      },
      {
        "img_id": "6AJgtdiKFSpfMCLEkm2x0A",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Entry way.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/6AJgtdiKFSpfMCLEkm2x0A/o.jpg"
      }
    ],
    "user_id": "KsK2VrCDys9hzpT5JMkkNw"
  },
  "VYeMpCiw9VpmLWWk3SdO2w": {
    "date": "1/18/2015",
    "text": "Finally revisit them for dinner last week, armed with a LivingSocial deal I purchased over the holidays. It's tough to justify the cost ($38.95 per person) without the deal. With the deal our bill for 2 came to be $59 (with tips on the original amount and a glass of wine)   Not to be obvious, this is not a place for non-meat lovers. They offer many rounds of food (they did not have the bacon wrapped scallops unfortunately that night). The ones I can remember: ribs (saucy), parmesan crusted porkloin (ok, meat was a little tough), fried gator bites (amazingly tasty), grilled chicken (good seasoning), bacon wrapped chicken (not my favorite, even with the bacon), sausage (tasty, with a nice cripsy casing), filet (not my favorite cut of meat, but it was nice and tender), sirloin (their best beef offering, with just a nice amount of fat on the outside with great seasoning), flank (another good one), lamb.  The place was virtually empty on a Monday night. I was afraid that on a slow night, our food would be of lower quality and limited. The reality was the opposite. The \"gaucho\" kept bringing out freshly grilled meat cooked to our temperature preference (medium rare). And since we were the only table, he was very generous with the portion. The salad & hot bar were available, but quite honestly I didn't have room to eat anything else. I did have a cup of their tomato soup (good) and several slices of smoked salmon (also good). OH, I almost forgot, but the fried polenta they offered as part of the \"bread plate\" was FABULOUS.  Overall both the food quality & service exceeded my expectations. I may even say they were better than the other uptown joint (which is more expensive and nicer setting).   The only complaint I have was that they did not properly honor my OpenTable reservation (which would have earn bonus points on Mondays). When I called them regarding the cancellation they keyed in, they did not correct it at all and gave me an unacceptable reason (unacceptable as in OpenTable does not have any such policy). i don't know if it costs restaurants to give out points, but bottomline is I did my part and showed up on time, they should do their part and properly check me in the system. I ended up having to spend time working with OpenTable to earn my points. It did impact my overall rating (minus 1 star).",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "YD8Ivs6GloB3T0pKV-k2wA": {
    "date": "1/29/2017",
    "text": "The food was good but not the best Brazilian Steakhouse. The service was terrible, we got the appetizer at the end of the meal. Bottom line, if you're going to spend your money do it at Chima.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hdcBKGb8nX7VSj7vRpdZGQ"
  },
  "_979k7kTP0aC3KAqkXZR4A": {
    "date": "1/25/2017",
    "text": "Braz is fantastic. My wife and and I have been here several times and always come away highly pleased. We went last on a Sunday night and were seated almost immediately. The salad/hot food bar was, as usual, out of this world. From hearts of palm, to smoked salmon, to baked salmon and chicken salad it was heavenly. Then the skewers came out. The beef and pork was done to perfection and was sizzling hot, right off the grill. The lamb was succulent and carried an ever so slight mint taste which was wonderful. The chicken was a little dry so we opted to stay away from that but on other nights it too was delicious. All in all you can't go wrong with a meal and good times at Brazz. We will return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dLsfhUFyh4W8X-2u-pTcHQ"
  },
  "nx29jAoYmaaWbLA56-7AhA": {
    "date": "11/25/2017",
    "text": "Review is long overdue, came here back in March but i've been super busy. The manager was so super nice to my wife and I. The food was great, and we were treated exceptionally by all staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_QPf475LpOH6naoCipBvA"
  },
  "yLF__hqM7ydtBaiVZZPLQQ": {
    "date": "11/12/2017",
    "text": "Visiting Charlotte for a conference and my boyfriend and I decided to try this for dinner.  We've been to other Brazilian Steakhouses so we are familiar with what to expect.  We were very underwhelmed.  The soups were chicken vegetable and tomato.  I tried the tomato and was surprised that it tasted just like I make at home and it was lukewarm.  The salad bar offered a number of things but the only thing I found tasty was the shrimp.  The hot bar included potatoes, beans, plantains, etc.  None looked too appetizing but I chose the plantains.  They tasted tough and were not hot.  It tasted like they had been there for hours.  An appetizer of corn bread and cheese bread was brought to the table.  The cheese bread was ok but the corn bread was so bad I had to spit it out.  It was tough and had a strange taste.  The meat is what gave this restaurant 2 stars.  The meat was plentiful and tasty.  I did not think that this meal was worth $45.  Other Brazilian steakhouses we have been to have been a thousand times better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAJJll3KGgjj8oh_EH6WdQ"
  },
  "z4XV93Rcz3qAiuHL-_i9zg": {
    "date": "10/14/2017",
    "text": "Had an exceptional experience here celebrating my husband's birthday. Food was delicious and service was truly amazing!!! Thank you Miller, Tyler, Rodrigo, and Siri for making my family's first experience with a Brazilian steakhouse a memorable one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GYt3ZTKeIj0pRyNfbX9yqA"
  },
  "ZkBoItu242s6wGqQSu2BeA": {
    "date": "1/24/2015",
    "text": "I went here during restaurant week with my husband and loved it! All our meats were cooked to perfection. Tender and juicy, with the right amount of seasoning. When it comes to meat I am intensely picky but they really did a great job, I even ate the lamb (which is beyond rare) it was excellent. One of the chefs was testing out a new bbq sauce for the ribs that night and he asked us to let him know if we liked it, not only was it quite good, it was nice to know the restaurant actually engages its customers and includes them in helping shape the restaurant selections. Service was great as well. My husband and I were skeptical at first after reading certain reviews, but in the end we were glad we went here instead of Chima (who was very rude when we called to ask about reservations earlier that day!!!) We will for sure be going back there. I will also be sure to tell people about how fun it was.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "NdvqZ_X3xh5wnyP2QsGoFQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. My pretty looking cheese cake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NdvqZ_X3xh5wnyP2QsGoFQ/o.jpg"
      }
    ],
    "user_id": "sBkFofI9P0_u4Zh6ksyJnA"
  },
  "1nCIK8QchE2KRF3m0VX0cQ": {
    "date": "6/10/2012",
    "text": "3.5 stars.  I have to admit...Chima is one of my favorite places to eat in Charlotte.  As much as I wanted to love this place, Brazz just doesn't compare.  Brazz is located in a small location near Fuel Pizza on The Green in Uptown.  (I think a Mexican restaurant used to be there - was it called Jolene's?)  Let's start with the good: 1) Service is extremely good, and you never want for anything.  2) They will ask you at what temperature you prefer your meat, and do their best to accommodate your wishes. 3) They offer fried alligator - it's slightly chewy and has an interesting flavor. 4) They have these delicious bacon-wrapped scallops as their seafood option. 5) They are cheaper than Chima.  However, and I say this sadly, there are a few things that just don't compare to Chima: 1) The atmosphere isn't as nice -- or as upscale-- as Chima. 2) While they do cook the meat the way you like it, I didn't think the meat was as flavorful.   3) Where are the chewy cheese rolls that I've come to expect at every churrascaria I've visited?  I recommend you give them a try to form your own opinion, but I think I'll stick to Chima when I'm in the mood for a meat-fest.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "ZQXW2IQTKJKDJORffNmlSQ": {
    "date": "6/22/2016",
    "text": "I brought my son here for dinner after attending the Heroes Con at the Convention Center. This was my first time at a Brazilian Steakhouse! I cannot speak highly enough of this place. Brazz was AWESOME! We were greeted by several people apon arriving and made very welcome. It was well laid out and nicely decorated. We were seated and told of the choices. We decided to go with the Dinner Rodizio. So glad we did! We started off with the salad and hot bar. They had over 10 different salad choices(pasta, cucumber, bean, Greek, seafood, & several more) which was explained that all were homemade. I really enjoyed their Caesar salad dressing. It's the best I have ever had! I tried about 4 different salads and a couple of items off the soup & hot bar, wanting to save room for the main treat of meat.  We had two great waiters who never let our drinks get halfway empty.  Then we were explained how to flip over our medallion to yes if we wanted the meat to be served. I kept mine on yes. I wanted to try everything. BTW, they had at least 12 meat choices come around(sausage, ny strip, bbq ribs, garlic sirloin, bacon wrapped chicken, lamb, bacon wrapped scallop, filet mignon, &fried alligator). The managers and chef visited our table several times to see if we were okay or needed anything. My son asked the chef for more ribs even though it was out of rotation and he gladly brought him some more. I cannot speak highly enough of how great ALL the meat tasted and was seasoned(the garlic sirloin was my favorite). After all that great selection that they brought around, they then brought by this delicious fire grilled pineapple. You must save room for that! The only complaint I would have is that I brought my son instead of my wife, but I will be bringing her here for a romantic date night soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q3CM_nEot7ldBuZbG60SvA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Dining at Brazz with my son after attending the Heroes Convention!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Q3CM_nEot7ldBuZbG60SvA/o.jpg"
      }
    ],
    "user_id": "6xOAAoUuswSYJ7VAjjEsIQ"
  },
  "od40rBnkiwkiBA78TA-CHA": {
    "date": "4/14/2016",
    "text": "Not a first timer to the Brazilian steakhouse restaurants but this was my first time at Brazz.Purchased a Groupon so decided I might as well check it out. I had an appt but was over 15m, I called and they were able to still accommodate my late arrival since they weren't busy. Not as fancy as I expected in regards to their decor. They have an interesting buffet for their hot items, salads, and soup. The night I went all I ate was the ziti (it was spicy) and the shrimp cocktail. While they had a decent selection not much really interested me. The meat selection was decent. I didn't like any of the bacon wrapped items they served. I tried the lamb it was ok. I even tried the fried gator (where someone gets gator in charlotte I don't know). The gator does taste like chicken but a bit too chewy for my liking. I did enjoy the read meats they served, and that's about it. The staff is friendly but nothing about this place makes me say I must go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ulpzjODcKmyUlE_Id4itqg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ulpzjODcKmyUlE_Id4itqg/o.jpg"
      }
    ],
    "user_id": "9VsUfMdfdATg7Pzf_Ypk3w"
  },
  "-esPSr1kjSxx-8u4wU3e_Q": {
    "date": "6/30/2014",
    "text": "WOW! How did I NOT discover this place earlier! At the Taste of Charlotte, this place ALWAYS has the longest lines....now I know why. The food is really tasty! Went here for a lunch on Monday.....I did NOT know that each day features a special ethnic flavor....Monday is Indian Food...one of my very faves!  So I had ther Chicken Tikki Massala, and it was OUTSTANDING! I didn't think it would be THAT good....all the creamy and rich goodness that CTM has. Very flavorful....I thought I was in a classic Indian restaurant! And the Vegetable Korma...with coconut milk? Oh my! All over Sweet Basmati rice....YUMMY!  I haven't even gotten to the MEAT yet! Before I do, let me tell you that they have a nice assortment of side \"salad\" dishes, like Pasta, Tuna, Potato, etc. And of course regular salads (including Caesar). For lunch they offer Sirloin, Turkey and Pork Loin....all VERY good! Lots of flavor and tender!  All this for $11.95...which includes a drink. Lots of places will charge you an extra $3 for the drink so to have it included is really great! Not a cheap lunch but a very good one for the money. My only objection is that this place for lunch does NOT promote whatever diet you're on....so save it for that \"cheat\" day or when you know you won't be having a big dinner.  Definitely have to return for dinner. Overall outstanding!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "29ryr7VC8WifRhU4-oR2uw": {
    "date": "2/13/2016",
    "text": "Couldn't tell you about the food because our reservation was never seated. Party of 6 is apparently too much to ask for. Checked in at least ten minutes prior (with the manager) were told \"ok great give me one minute\" and finally walked out after 40minutes past our reservation time. Received even more bad attitude when we asked if it was going to be much longer (since so many other tables had gotten seated well ahead of us). Only gave one star because I had to. Not at all a good representation of we were told to expect. And even more disappointing that the manager didn't care.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JMFg3BIK_a_BMai_COTVmQ"
  },
  "H_qe1IJJXruShPl3SVkUfg": {
    "date": "10/7/2014",
    "text": "I enjoyed this buffet style of American (majority) and Indian food menu offerings.  As mentioned in other review, the chicken tikka masala was very good.  Likely the best I've had.  Very creamy, very tender chicken.   There are plenty of salad and healthy choices.   There is a carving station with sirloin, pork loin and turkey, which I liked in that order.  The turkey was obviously brined to keep it moist and it was moist, but also quite salty. The sirloin was nice.   Banana pudding for dessert on the buffet.  Like I said, it's a mix of offerings, and banana pudding is a southern staple.   All for $15.  I'll return for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J89jeH9Et-hL3EpeMRoPAg"
  },
  "ucipxNoF0ditnpg9x-mVFg": {
    "date": "1/31/2016",
    "text": "I have only been to two Brazilian Steakhouses, Chima and Brazz and I have to say for the money I think Brazz is the better value.   The sirloin and filet is just as good and I like the atmosphere of Brazz so much better.  The Top Sirloin was amazing.  It is a smaller restaurant, feels more intimate and is such a great price for all the food you get. At the other place I felt like I had to chase the waiters down to make sure I got whatever it was I was waiting on.  Not here!  I liked their salad bar and hot sides bar, although for the amount of meat you get I am not sure if any of that is necessary but it's good to mix it up!  If you are a fan of Brazilian steakhouses it is definitely worth checking out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EKnwNfsBcTK9l8h0ZVQH5A"
  },
  "kmu0KKp7cbQVS475OXaLPw": {
    "date": "8/8/2016",
    "text": "The service was exceptional but that's where it ends. The salad bar was good,HUGE chilled shrimp but sadly slightly overcooked. My husband and I both got the rodizio. The flank steak being the best part. The lamb was way overcooked and not very tasty. The scallops so very dried out that they were rubber like.The fried alligator was hideous,ok I realize we are in Charlotte and far away from gators but this stuff tastes like rotten fish.Thankfully I had a groupon or we'd have paid close to $100 for way below average food.Too bad as the wait staff was so exceptional..will not be going back.Unless you have a groupon,save your money and go elsewhere.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uGx45ftZtBf2s1ZwFw0kow"
  },
  "p6VsfT0zqSR7F1-odI-7ow": {
    "date": "12/2/2017",
    "text": "Excellent food and service. Very cozy and romantic - perfect for a date night. The atmosphere is better than Chima's in my opinion!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fco3hlkv10ZA0hFcX5JrIQ"
  },
  "bl1w5rYBuCnzfcxY9gOAyw": {
    "date": "7/19/2016",
    "text": "Just ok- I've been to two other Brazilian Steakhouses in the area and this one was my least favorite. The salad bar didn't have anything that really excited me. The meats were salty and kind of all tasted alike. It's not bad, it's just nothing special.   The wait staff was excellent, very attentive and polite, they get 5 stars.  If a group of friends wanted to go here again I wouldn't have a problem with it but on my own I probably wouldn't return. Saving grace was the groupon, without it I would have been out over $100 for just an ok meal.   If you want the experience I would suggest spending just a few bucks more and heading down the street.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "gbnFbO6qXa9JplClYCM-QA": {
    "date": "6/1/2018",
    "text": "Wonderful place for a nice casual dinner!  Go Hungry!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kv2zKkWt4GwxTSg8JDv3-g"
  },
  "1NRWe_TG7NDZV7HQuYmS8w": {
    "date": "4/15/2017",
    "text": "My boyfriend and I and our friend came here for dinner yesterday. It wasn't a lot of people in here when we came. Our waiter was very nice and attentive. We ordered the all Rodizio. We noticed the meat took a while to come out. We asked another waiter when it will be coming out.  She checked for us and said it would be a couple more minutes.  Whole we waited we got some sides from the salad bar. Mac n cheese wad good and the beans we very flavorful. Once the meat came out,  it was game over. We all really enjoyed our meal and the food was amazing!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VrOnOhc7vavGLl5waYG4JQ"
  },
  "hcSILbVDSM6naeWKYsfHLA": {
    "date": "7/17/2016",
    "text": "The wife and I stumbled upon this place and must say it's one of the better Brazilian Steakhouse's we've been to. All the meats were brought out in a timely matter they don't overwhelm you like other Brazilian Steakhouse's do. And they all taste great! Even their salad bar was great! Service was excellent as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xTw9dbHa5bqHgdDo9jjoUA"
  },
  "_Q_4eCj7LJSx0a6iAZylQA": {
    "date": "1/20/2017",
    "text": "Wow, very impressed with Brazz!  My wife and I go to Chima quite often and it doesn't compare.  Brazz salad/appetizer bar was amazing, I would be satisfied with it alone.  And then the meat?!  9 different meats all cooked to perfection and unlike Chima I got to try them all!! Every time I eat at Chima it seems like only a few of the selection ever makes it to the floor.  I'm about to be a Brazz regular!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1b0gghgJ1qgZYLDF4kemXA"
  },
  "vwyMGVTUDxpdbQz2aeOR1g": {
    "date": "5/18/2018",
    "text": "I have been to this place many times and I plan on going many more, the atmosphere is great and the food is amazing. The rodizio meal is well worth the money and the salad bar is fresh and very diverse. The staff is very friendly and helpful. Hands down my favorite steakhouse around. Highly recommend to people of all ages.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ffySLdTMylylfhdFFINqg"
  },
  "pscJ5Gx0wNsLIib-juhdhg": {
    "date": "5/8/2017",
    "text": "Two members in my party did the dinner rodizio, but I wasn't so hungry, so I just stuck with the hot and cold buffet. On this occasion, there was a teriyaki glazed salmon, which is right up my alley, so it was quite enjoyable. The buffet has a vast selection of items (mostly mixed salads e.g. Chicken salad, seafood salad), and some large shrimp for a shrimp cocktail. The tomato soup was a bit rich, but delicious. But, the best thing about this experience was the service. Perhaps because they weren't too busy, but their attentiveness was impeccable. If you're looking to try lots of meats that are well-seasoned, then this is a great place to go. If you just want a buffet, then it could be hit or miss for you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gYdgY9NEFkfilUqScKYxlA"
  },
  "8JOXCZNHitIm7WPF6Rn-_A": {
    "date": "7/20/2015",
    "text": "A co-worker of my husband told us to visit this place to try some awesome Brazilian barbecue. I was not into eating meat, so I opted for the buffet salad bar ($20). Just like previous reviews, the choices in their salad bar are limited so if you're vegan and really choosy of your veggies then this place may not be for you. But if you're like me who just needs a break from meat and craves veggies (yep, its that time of the month) then this is something you might want to try.   My husband got the additional meat buffet for $30. They deliver the meat to you! Fresh off the grill. My husband was not impressed with the barbecue. For desert, I got the Flan. It was good!! Rich custard with caramel on top. Yum!!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6Z1Jd0ar2SxXPQdGatvhVA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Flan. A rich custard dessert with a soft caramel top.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Z1Jd0ar2SxXPQdGatvhVA/o.jpg"
      },
      {
        "img_id": "4bidoh2n61UTYs9LfCHe2g",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Dinner Meats",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4bidoh2n61UTYs9LfCHe2g/o.jpg"
      },
      {
        "img_id": "4Ib1DWZ40O-SXzikRU0mwg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Dessert List",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4Ib1DWZ40O-SXzikRU0mwg/o.jpg"
      }
    ],
    "user_id": "837p5UPRBaxEvnTQ5fB7fA"
  },
  "Go1a0Xpe75vallAnmZoGHQ": {
    "date": "9/18/2017",
    "text": "We went to this steakhouse and it was phenomenal!!  Perry was our carver and he was the BEST server we have had ever!!! He made the whole experience fun, he was funny, and made us laugh with his silly jokes!  We really enjoyed every meat that was offered and we will definitely go back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgFn7JadPQJ8aYdwIRi8aA"
  },
  "UONspSDldEFTizrCvxj2nA": {
    "date": "8/10/2017",
    "text": "All of the meat tastes the same !!!  No flavor to the meat  the cold salad bar was great . Tomato soup and  roasted vegetables a must. Other  than that  don't come for the meat .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oBhQVeYF5DAWMWNRICyyw"
  },
  "aDZf3zkMmHjaplK_U7YbuA": {
    "date": "5/27/2017",
    "text": "Wow! Just Wow! In town to visit my son and he suggested this for dinner. We made reservations easily on the website and I think for a Friday or Saturday it would be advisable.  The restaurant itself is clean and not cluttered. The staff was very attentive and kept our glasses full.  My son and fiance had the Rodizio and I had the Filet. The Tomato Soup had a nice taste. The salad bar is more sophisticated than a typical steak place, included smoked salmon, spring mixed greens, a nice white & sweet potato salad, etc.  The Hot Bar offerings included roasted veggies, roast potatoes, plantains, Teriyaki glazed salmon, rice ... The star of the menu is meat. My Filet was perfectly cooked for me and really a generous thick cut. The Rodizio did not disappoint my guys. They agreed the Garlic Steak was excellent and the Flank Steak too.  Bacon wrapped scallops were delicious. They ate everything from Alligator to Sausage and had no complaints!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g5HeBhYfFnIXmWWD5T5S3g",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Filet and Hot Bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/g5HeBhYfFnIXmWWD5T5S3g/o.jpg"
      }
    ],
    "user_id": "f__12gMtzy-4qEJ3wgU_fw"
  },
  "JcnLeZ8RfEd-KByZwc32nA": {
    "date": "7/23/2017",
    "text": "Best dinner ever per my 10 year old meat eater! Staff was exceptional and treated my son awesome for his birthday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wIgdEh6Z07l7GA-5mNdoiw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Best 10th birthday ever!  Thanks Brazz you are awesome",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wIgdEh6Z07l7GA-5mNdoiw/o.jpg"
      }
    ],
    "user_id": "l_wVX-3QLA8gwJCw5L3KMg"
  },
  "e-NT5-Lydkgxehz81wvFRQ": {
    "date": "7/23/2014",
    "text": "One of my favorite resturants in all of Charlotte. The service is very friendly and attentive. We barely had to wait at all and when we wanted a special cut of meat they made sure we got it and kept checking on us asking if we would like more.  The salad bar is unbelievable with all different kinds of veggies, cold cuts of meat, cheeses, soups, ect. The meat blew me away it was all so good loated with tons of flavor, great seasoning, and very tender and juicy.  I can not wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "h6EI4BfNvc_vJUH3O8vNBA"
  },
  "lOGeZUjPvp04a-a_TwezPQ": {
    "date": "5/28/2017",
    "text": "Solid restaurant. I loved the meat, and the unlimited salad bar only makes you feel full faster. Great dinner date place",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWasKhLmD81RNpKA4ezz-w"
  },
  "ASFvY4tFaKH2aBdn8cuJVg": {
    "date": "12/6/2015",
    "text": "So sad to see the low star reviews here. We got a groupon and came to try it anyway and so glad you did. All the food was fresh and delicious, the waitstaff was wonderful, the gouchos were generous and two of my unexpected favorites were the rice and tomato soup!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AG12vF4hFHg49ackpQz9Ww",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AG12vF4hFHg49ackpQz9Ww/o.jpg"
      },
      {
        "img_id": "ej-JmMlAVpMFwWIrok0jxQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ej-JmMlAVpMFwWIrok0jxQ/o.jpg"
      },
      {
        "img_id": "RmNJ8uEcrhtN76w-fIN-xA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RmNJ8uEcrhtN76w-fIN-xA/o.jpg"
      }
    ],
    "user_id": "65x9iJk_V8vJwW5tualmpw"
  },
  "6b0GhG5HYG48ubnYOnrKYw": {
    "date": "1/27/2016",
    "text": "My girlsfriends and I tried this place out last night as a part of Charlotte's Queen's Feast restaurant week. It was delicious and so filling! I'm not a steak person -- usually sticking to fish and chicken so when they suggested this restaurant as a setting for our girl's night I was a little hesitant. Stepping out of my comfort zone, I sampled every meat that came around and was pleasantly surprised. Juicy and flavorful, the garlic steak hit the spot. Also, the salad bar had so many options. There was definitely something for everybody. Plus, the wine was flowing and the desert was delectable.  We each decided to get a different desert and share. The strawberry shortcake was light and fluffy and so yummy.  I hear they've got a pretty banging week-day lunch buffet special so if I'm ever lunching uptown I know where I'll go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "35_9iPFYBIKUcl33HiqlrQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. We say YES to Steak and Wine at Brazz! #QueensFeast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/35_9iPFYBIKUcl33HiqlrQ/o.jpg"
      }
    ],
    "user_id": "87ESOpbAdmDGzyjOkFg7Mw"
  },
  "OAwX6K-ztZuiUzs285g3CA": {
    "date": "2/6/2016",
    "text": "We even tried the alligator!  Jordan our server was awesome! We ate until we couldn't anymore!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tBEpXEbfp9TRbOuzB56tvA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Here comes the sirloin / salmon. Yummy!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tBEpXEbfp9TRbOuzB56tvA/o.jpg"
      }
    ],
    "user_id": "ZHdAr25jmDNvQJsWZ_r93w"
  },
  "SkIUYC7WJlkojsahuIwkHQ": {
    "date": "10/9/2016",
    "text": "First class service to go along with great tasting and well prepared food. My family and I indulged in Brazz's tempting array of meats and veggies. I will say I am not normally a fan of lamb, however the lamb here is the BEST I have ever tasted - melted in my mouth so tender you could cut it with a spoon. The bacon wrapped scallops were cooked perfectly! I could go on and go but the point is yes the food is amazing and the service is first class.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9z3kujoqDfjOHUxcjG_s3g"
  },
  "aSA0k9IB5BOMIbW56kZKaA": {
    "date": "1/22/2017",
    "text": "My girlfriend and I love this place! We have been a few times and they always remember us and take very good care of us. The food is amazing and the service is absolutely exceptional! The servers, cooks, and owner are always friendly and willing to do whatever it takes to make your visit special! Brazz is our go to date night dinner spot! We even drive 40 minutes to get there because it's so good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "eqQcfbsMJiS0emtVnHu-hQ"
  },
  "45UxREwMYkqC6JlIbzDDow": {
    "date": "12/1/2014",
    "text": "This is a GREAT date place. I've taken my girlfriend here twice for various occasions and neither time has disappointed. The steaks are cooked to desired temperature and they keep it flowing the whole night at a good pace. For all the UNCC students it's a little price but well worth it if you have a little extra money to impress someone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y_6qWprBqzezlYjdLCncRg"
  },
  "HXh2M0PWxjRiioupPDMi8Q": {
    "date": "4/7/2017",
    "text": "Can't even put into words how disgusted I am. I was here for 1/2 hour with my boyfriend. We made reservations for a Friday night and when we got there at 7:00 there was 1 table in the entire restaurant. I guess it's my fault that this wasn't a sign to leave immediately. We both ordered the $42 rodizio dinner. Not only did all of the meats taste the same, but after the 5th meat (of 10) reached our table, my boyfriend started to sweat and feel sick to his stomach. He immediately left and went outside while I waited for the check. We were both very excited for the brazilian steakhouse all day and after eating only a few bites of meat, we had to leave. Overpriced drinks (no alcohol), mediocre salad/hot bar, and terrible meat. At one point, we looked at each other and laughed out loud at how much the lamb tasted like wintergreen gum. I would not recommend this restaurant and quite frankly, I'm surprised they are even in business. The salad bar items were clearly sitting out for hours and definitely not kept at the appropriate temperatures. The only guest I would ever take here again is someone I want dead. It's that unbearable. And it only gets one star because there is no lesser option.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcVY07HOhJbDY6D-TA8UUQ"
  },
  "Tahj3iNfSPQnqyvaeco8sA": {
    "date": "3/3/2016",
    "text": "very bad experience. first no parking cost $20 to park.could you tell us this when making reservation.  meat portions very small and sat us in a back corner either out by the time they got to us or cold.. all the meat taste the same. alligator finally brought out but gave us very little. a $100 meal with no drinks involved should be a delicious meal.. very disappointing  one good thing staff very friendly",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WU6DKRtslAK1fk1WrQuR2Q"
  },
  "blkyREzg9x9KlCvt0f-KWQ": {
    "date": "1/21/2015",
    "text": "Do NOT go here for dinner. The food was ok. Service was nothing to talk about. The server disappeared on many occasions. It was an average experience at best at this point and I probably would not have written any type of review had it ended here. However, since I am writing, you can guess there is more. The server brought us our bill, we gave our card, he charged us and we put tip on and signed. About 5 minute later he comes back and asks if we were charged correctly. We said we thought we had been it showed to meals two desserts. He takes our receipts from us and says he would be right back because he didn't charged us correctly. He returns with voided receipts and a new bill for a higher charge. He states he is sorry for the inconvenience. I ask why we are being recharged for his mistake. He explains that he charged us wrong. I asked to see the original receipt to compare to the old one and was refused. I asked why I could not see my original ticket and was told because it was charged wrong. I explain that I understand this but I don't understand how this is my fault especially since I can't compare the two receipts. I asked to speak to a manger. The manager asked what the problem was. I explained the situation. The manager stated that we owed more money because we weren't charged correctly. I again asked how this was our fault. He simply stated that I owed more and need to be recharged. He then walked away. As a former server, I would not have even alerted my table that I had made the mistake if I had already charged them. As a manager I would not have made the customers pay the up charge due to the server's mistake. So aggravated. Again, food and service NOT worth the price...and that was during Restaurant Week!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVNRwOA01OPTXZm9c0Gqog"
  },
  "0p59-fj6P5KeUzcu-gX-cw": {
    "date": "1/30/2016",
    "text": "I went here with a friend for Restaurant Week and we had a great experience. The staff was very friendly and we were seated shortly after arriving. They stayed engaged with us and constantly brought/removed plates. The Restaurant Week meal came with a drink, apps, salad/hot bar & select meats. I picked Moscato and my friend had Copper beer. Both were really good. I was not a fan of the apps. The bread was ok, but I did not like the texture of the polenta. The salad and hot bar had many wonderful options. There were lots of pasta salads, but some had too much mayo for my tastes. My favorite was the crab. The shrimp was huge and very fresh. The lettuce was also green and fresh. There was salmon on both hot and cold bars. Both were really good. I liked the plantains and rice as well. I tried all 9 meats and they were delicious. The top sirloin and lamb were my favorites. All of the meats were tender and savory with great coloring. It was great that the restaurant validates parking after 5!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HWJ4f8M7ZWIpPELbL7hBtA"
  },
  "rY4e4LW5VjRWyKMVV-dGwA": {
    "date": "1/12/2013",
    "text": "My wife and I went to Brazz on a Groupon discount. After reading some of the reviews I was a little afraid that we would be disappointed. That was not the case. We were given perfect service by our waiter Clinton and the others. The salad bar was very fresh and enticing. Each of the meat items were prepared as requested, and these servers were very efficient. We will be repeat customers!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSDA8Fi0JYzWUWlX5zAbsg"
  },
  "jJVOFx9_FzYyWuBngMseEQ": {
    "date": "1/12/2013",
    "text": "Lunch here is fantastic from the service to what is offered on the rodizio bar. The pricing in comparison to Chima makes this a fantastic bargain.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xqUn2yqxQRq5MrthbRb-7Q"
  },
  "r3bs8f6JqcBsNPYMQLAmvQ": {
    "date": "7/9/2012",
    "text": "Would not recommend.  After we flipped our card over the cook came out to ask us temp for our meat. We told him med rare to med. and then we waited.  Once he brought out some meat it was all overcooked flavorless and tasted old. I had to request two times for alligator and pineapple. The alligator that was brought out was 4 small pieces that where way over cooked and greesy.  The pineapple was never brought to our table. Then we waited again for over 15 minutes for any other meat to be offered to us but once anything was offered to us it was clearly cooked done.  We really wanted to like our diner but it was a True let down. We will NEVER go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 1
    },
    "photos": [],
    "user_id": "1Fa-gnePMXHOkCvXrhK4Cw"
  },
  "z-6gAUVxzzW8URmKslX-eg": {
    "date": "11/18/2012",
    "text": "Review for dinner - Let start by saying that the lunch here is incredible and a great deal, and I have been here half a dozen times and was never disappointed. So back to dinner, I decided to give it a second try and I was completely amazed at the difference. Prompt, friendly and delicious. This was everything I had expected from this establishment the first time. Meat choices were varied and wonderful, and when a cut was too rare for my liking, they brought me another cooked to perfection. At the end of the meal I was surprised with a serving of roasted pineapple and cinnamon, what an unexpected pleasure.   Before I left I spoke with the staff about my last experience, and I think we all agreed that I suffered the curse of restaurant week on my prior visit. Over packed and under staffed.  I will definitely be heading back again and again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "skyjs2lSknMjVP9BGY1wKg"
  },
  "_BQs80DNlTAzYaRX0IzMkA": {
    "date": "3/19/2014",
    "text": "This my family's all time favorite place to eat! The staff and owners are the best! I haven't gotten to be there as much as I would like since it's 3 hours from home. I think the family and I will drive down sometime soon. We miss chi and Clinton and everyone else there. I've got a bad craving for some pork tenderloin and pineapple!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DtHiSHjW6-nPs8_42VZAFw"
  },
  "Q2J95FUvcidZniCvX-xCAQ": {
    "date": "8/31/2012",
    "text": "Great lunch today. The carving station offered Sirloin, Turkey and Pork Loin. All were very good. The flavors really brought out the flavor. And the buffet was great, with my favorite being the crab salad. I will come back soon for dinner.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ktrjGQ8hS90OO3bB_Y1ltw"
  },
  "YOILe3hRJf_kgJOxMgy5SQ": {
    "date": "1/26/2012",
    "text": "Solid lunch spot for the uptown crowd.  Gets a 5 star from me because it's a GREAT option if you're eating paleo or primal.  Meat tasted yummy, tons of selection in the salad bar (try the tiny shrimp salad, it won't disappoint!).  Not your usual iceburg lettuce and ranch dressing salad bar.  A bit pricey for lunch, but you get more than what you pay for.  Try to go right when they open to get the freshest stuff and avoid the crowds (11:15-11:30 is a perfect time).  MEAT IS AWESOME.  That is all, thank you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "8Sx-NgLzyCBBWT-IKBt9Fw"
  },
  "6YOi4MrqBh1oIdDG6pqIag": {
    "date": "4/10/2012",
    "text": "Fantastic. This is the best lunch uptown. The wait staff was attentive and knowledgeable without being overbearing. The food exceeded my expectations by a long shot. I will become a regular here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oMt6luUR1UXKpurIkTTxw"
  },
  "nWBDdqcYLTug13B_cRZypg": {
    "date": "1/22/2012",
    "text": "Very very very disappointing!  Took forever for the wait staff to come around with the meat.  I don't think I ever got a decent cut that was medium rare.. the vegetable medley was just broccoli and cauliflower covered in some flavorless white paste .. the meat that wasn't over cooked was under seasoned ..   ... don't think I'll try this place again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "ezJ6d76sgFi5cOC_y2yg1Q"
  },
  "QCJiFqC_WpOZMx0S9ujoPg": {
    "date": "1/27/2015",
    "text": "The salad bar was a bit lacking but the service was good and the meat was terrific. It was a Tuesday so it was pretty quiet but the changed our plates for the Rodizio regularly and kept the drinks coming.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H4LQYRmE7Q-3ZV37eKzwiw"
  },
  "3IqpbKY2FmHQmHEHQ1YJTA": {
    "date": "7/3/2012",
    "text": "Excellent food and our server was awesome! A little less fancy that some other Brazilian steakhouses I've been to but that only made the experience better for me. My only complaint was that sometimes we waited a little too long for the next meat. I will chalk this up to the fact that it was a Monday night and there was an unexpected Shriner's convention that took over the restaurant.  I will definitely go again for the the Picanha alone!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yNRIPudmMIGRqHlYVItbxg"
  },
  "0sfpmBLxpj87yIDbSS547A": {
    "date": "3/23/2015",
    "text": "Staff was kind but this isn't an authentic Brazilian steakhouse.  The salad bar was okay, maybe a 3 instead of a 2, but the meat was at best a 2. It's like it was cooked in the kitchen and then served on a skewer.  The steak was dried out and tasteless. The chicken however was quite good. Lamb was terrible. If you're expecting a fogo experience go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6gRf04tncTrsekFwqOGUrA"
  },
  "gkV8mn-CZQYFK9YLMBMxjg": {
    "date": "6/3/2014",
    "text": "First time here.  Husband b-day lunch buffet .  Salad bar was good.  Hot food as far the vegetables was ok.  3 meats offer was good.  I enjoyed the rice pudding.  Service was excellent.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZW-XoteNlRuuK-19q1spmw"
  },
  "FDPEze8BEExyldkf22pE4A": {
    "date": "1/9/2012",
    "text": "Yummy lunch buffet today on way to convention center.  Carvery.   Come hungry.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJesPcMaviZZQgjBn-Z4eg"
  },
  "xm-dHsZYRq6zZjBpfUEx5Q": {
    "date": "2/9/2014",
    "text": "I was attending a business workshop today and decided to stop in here for lunch.  Pros: The servers were great.  They offered a different variety of vegetable options.  However, the meat selections were limited.  I was also looking for some desserts which is common in most places like this; unfortunately, there were any.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "deVz7CbX6fUp12x690FQNw"
  },
  "5LC487CzqxIRQD_NALx3hg": {
    "date": "12/18/2018",
    "text": "I don't recommend this place at all. The husband and wife are the owners and they're rude to patrons. They also have the same cold sides every day and the meat on the grill is always undercooked and partially raw. I will never eat there again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxN0IbL5ug2xqX40H0LzKw"
  },
  "xe0rp0rFSfKGAnP7nYMKDA": {
    "date": "6/14/2017",
    "text": "Good price and quality meat. I've eaten here once for dinner with a large group (10+) and once for lunch. I also had a bite of their bacon wrapped scallops at Taste of Charlotte. Overall, it's a very nice Brazilian Steakhouse with a large buffet of cold options. Personally, this isn't how I love to eat. I find the stop/go meat ordering a little overwhelming (servers come by and offer you meat if you indicate with a token that \"yes,\" you'd like more, until you turn the token over to say \"no\". You can flip as many times as you'd like.) However, this place is great for large groups especially if you're feeding people with restrictions.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-srZqmR83vjSfR6PSUyVUA"
  },
  "ubsSF2GiLgZHLGObzG6Llg": {
    "date": "6/16/2018",
    "text": "I had a good Dinner at this restaurant but they ran out of Rolls that was awful.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ug1h1qPEsMNFQWB8FuTABw"
  },
  "K3J5wPcwLV-01DGNFClW0g": {
    "date": "3/12/2015",
    "text": "I wish I could leave to separate reviews ... one for lunch and one for dinner, because they are a NIGHT&DAY difference.  Basically, lunch is great, I'd highly recommend. Dinner was AWFUL with TERRIBLE service to boot. Based on other reviews I've read, that seems like a dinner trend.   I don't generally \"name drop\" in reviews, but I'd recommend ANYONE to spend $6 more and walk a couple blocks down to Chima Brazillian Steakhouse. Much better food, much better atmosphere, and more importantly ... MUCH BETTER SERVICE!  Lunch Buffet: $12.99 M-F, and every day they have a different \"theme\" of food on the hot buffet. They offer 3-4 kinds of meat during lunch as opposed to the 10 at dinner. Both times I've been for lunch the meats have been flavorful and delicious. The hot buffet is usually great, which about 6 or 7 choices. The salad bar is a good size (it's the same for dinner), AND they give you dessert with lunch. It's never packed for lunch, so your able to get in and out basically as quickly as you can eat. 4/5 STARS for lunch.  Dinner Buffet: $38.95/pp. 45 minute wait for table ... a little crazy (even for a Saturday night) considering we got there at 8:30. This place is tiny inside, so there aren't many tables. After waiting that long and finally getting seated, we sat at our table for 10 minutes while servers walked past us and ignored us. We finally just got up and went to help our selves at the salad bar, only to find much of the salad bar was empty. I was able to track someone down and ask them to refill the Cesar salad ... this \"refill\" was literally a bag of romaine lettuce dumped out on a place. No cheese, croutons, anything.  The hot buffet items were totally unappealing to me. The rodizio style meats (once they were finally brought out) were very good ... the only saving grace for this place. 2/5 STARS for dinner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pCMSp1ua5RcFN5CXxEDFWg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Very Berry Caipirinha",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pCMSp1ua5RcFN5CXxEDFWg/o.jpg"
      }
    ],
    "user_id": "4-Oh0TN8-b9gj12_VUZmAw"
  },
  "7lEh6UkhRLPc08oKGeJPoQ": {
    "date": "6/5/2018",
    "text": "Brazz is amazing! Food and service is always perfect! My girlfriend and I go here whenever we get a chance!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AzusS-N1ey7CmyR0d5Jf4A"
  },
  "fpUPEGWjo9DmyKiRtF8CVg": {
    "date": "4/10/2017",
    "text": "I love meat so this place is perfect for me!   I'll start the review by saying that you should park in THE GREEN parking lot. Brazz will validate your parking if you do! Also Brazz is kind of hidden so if you spot Fuel, Brazz is right next to it.   Onto the food! To get the full experience, definitely try the Rodizio! It's expensive at ~42 a person so I recommend getting a Groupon (with 20% or 30% off coupon if you can find one). This should help with costs. The chefs who bring out your food on stakes are the ones who prepare the food so make sure to let them know how you like the food/if you really enjoy the dish!   Meats I won't go into detail about each one but here's a ranking of must tries.  1. Top Sirloin... signature Brazilian steakhouse dish! a little salty so make sure to pair with the chimichurri sauce! It's sliced thinly and is delicious!  2. Lamb... I generally don't like lamb as a lot of people make it gamey but the lamb here is excellent! a lovely seasoning that brings out that proper lamb taste.  3. Garlic Steak... my top favorite beef dish. Perry, the Chef, makes an awesome marinade that's simple and delicious. no need to dip with anything. it's flavorful and delicious on its own.  4. Pork Tenderloin... pork is hard to get right as it can be dry a lot of times. but this pork is so so so juicy. the Parmesan makes a nice crust and adds such a nice flavor. another must try!  These 4 dishes are a must try at Brazz in my opinion. I get multiples of these while eating. PS. The Chef recommended only really  dipping the top sirloin in the chimichurri but I dipped everything as I love the chimichurri.   I also really really enjoyed the bacon wrapped scallops, and the sausage. I also liked the filet but it wasn't my favorite as I enjoy a filet that cuts like butter. they made it a little differently than what in used to! you should still try it anyways!    It's all you can eat so I still recommend sampling the chicken, the bacon wrapped chicken, and the Flank steak (a little fatty piece)   Salad Bar You're really here for the meat so I try not to eat too much at the bar but definitely build a small sampler plate cause why not. I recommend against piling on like at a real buffet. Food worth sampling include the pasta salad (rotinis and shell pasta), broccoli salad. I definitely would get the cocktail shrimp cause it's good and generally expensive. (Trying to get the most bang for your buck) Definitely try the Teriyaki Salmon because it's juicy and flavorful and also goooood goood good.   Grab some roast potatoes and some roast veggies to complement your meats as well!   As a side note, they bring cheese bread puffs and another bread to your table. DON'T MISS OUT ON THE CHEESEPUFFS. THEY'RE OP. Crispy on the outside. amazing on the inside. don't miss out. seriously.   If you're lucky, they'll bring out some roasted pineapple which is ridiculously good. it's fantastic and great for your digestion supposedly!   Wine House Merlot was good. A little sour and a little dry but a nice complement to the meats!  Overall I had a wonderful wonderful experience at Brazz from the food to the service! I'll be coming back again soon and I can't wait!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PnZM0A1h_LpFKYGhsAeOHg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PnZM0A1h_LpFKYGhsAeOHg/o.jpg"
      }
    ],
    "user_id": "0vY5rb0Ylajp-bhvo9Xxow"
  },
  "1irhI4cRQU8qHw87borIKg": {
    "date": "7/16/2017",
    "text": "Fantastic food and service! All 11 meats were so insanely tender. Filet mignon, bacon wrapped chicken, flank steak.. I don't know which one I love more. All the sides and salads and soups you could want. Each individual that came to our table was extremely pleasant. Great date night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qbny7M6ygXpZFTSUP_-BOQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Qbny7M6ygXpZFTSUP_-BOQ/o.jpg"
      }
    ],
    "user_id": "qp6mMPejabkk0MdQvZHmOw"
  },
  "KA8ezxgYRIJ5mUX7LMDqoA": {
    "date": "3/25/2018",
    "text": "My husband and I came here for the first time tonight. Cute interior, not overly stuffy-feeling. Meat selection was great and cooked perfectly. Attentive staff, the female server was very engaging, asked us what our favorite meat selection was and gave us dessert recommendations, winch was very nice. My favorite part of our dinner was when I ordered a mojito, I was told they didn't have mint, but the server recommended this amazing specialty beverage they serve, (it began with the letter \"C\" and I can't remember the name) - it was better than a mojito. It was delicious! I appreciate the honesty from the server instead of saying yes to a mojito and making a subpar version of a mojito without the mint. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gdzLCCzh-P11FPicIL9vIg"
  },
  "bjUxnW8u6mdqxgRXRYBZQw": {
    "date": "2/22/2018",
    "text": "The food was pretty good.  The service was not so good.  We made a reservation for 20 and they were not ready for us.  Fumbled to take care of us all night.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qm_cSxjyo21NLJNAAbsbVA"
  },
  "qkHBcOGMFiOifGrEl5yOgQ": {
    "date": "1/8/2017",
    "text": "When i walked in,  i was initially dissapointed.  I've been to several other Brazilian steakhouses  (steakhomes?) In other cities (including Rio de Janeiro) that have all been pretty consistent-specifically in regards to the overall look and the size of the \"salad bar\" options. When you walk in here, it lacks the grandeur that the ones in bigger cities have, and the salad bar options do not compare. Other than that,  it's great,  (you will be full) and the service is spectacular.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gRp0yXgbrZS17bSiExEYcg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Sooooooo much meat....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gRp0yXgbrZS17bSiExEYcg/o.jpg"
      },
      {
        "img_id": "HvXe23iNTpgM4PjwZETDeg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Yesss  pleasssse",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HvXe23iNTpgM4PjwZETDeg/o.jpg"
      }
    ],
    "user_id": "QxrmO9IKZc68E2npuN9p8w"
  },
  "yFFxLM-KktVVbeBB7iFM-Q": {
    "date": "10/4/2018",
    "text": "Delicious. It's a little pricey, but super reasonable for a Brazillian Steakhouse. I honestly prefer Brazz to Chima as it's a little more down to earth feeling, I like some of the cuts of meat better, and I do not feel rushed at Brazz like I have at Chima. The waitstaff is always very nice and knowledgeable. The servers do a great job of figuring out what you do and don't like and will always take requests for particular types or cuts of meat. The food is great quality and I always wish I had more room for more food. It's a great place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjlydMsmBgUwIF7BweA0WQ"
  },
  "DIhnGVCgn6e_a09H2bxPnQ": {
    "date": "9/22/2018",
    "text": "This place is amazing!! Great meat selections that come to the table. The Chef even entertained and checked on us to make sure we had what we wanted. Definitely will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7xzOiPFk5Z2D_qxjntuLw"
  },
  "78j4GlGK2bsWq-3vj0GHLQ": {
    "date": "9/12/2018",
    "text": "The meats where delicious and served piping hot. The salad was great and the service very good. The selections kept coming and coming and each one was excellent. I went with a friend and we finally had to \"tap out\" because we just could not eat another thing.. The top sirloin and fillet were both terrific.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HeF1MV5YFL9-WCE9n6IN6w"
  },
  "yx_vLHmSms9TXqs-NhMXbg": {
    "date": "11/4/2016",
    "text": "I took my husband to eat here for his birthday... fabulous service (between the owner, the kitchen staff, and Nicole, above and beyond service) great ambiance, and oh my... the meats! We did the rodizio and were served 11 meats, cooked perfectly! A good robust red wine is highly recommended! After a fantastic meal, we had some grilled Brazilian pineapple... one of the best things I've ever eaten, it was amazing!  We look forward to another great date night!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MpM0gAw6bhc79l2pdK8w9g"
  },
  "EmFi4NeE_v6UK3xADLDPzA": {
    "date": "12/28/2017",
    "text": "I loved the atmosphere! It was so dark, but beautiful dim lights. The all you can eat option had about 6 meats on Christmas night; sausage, chicken, filet, scallop wrapped with bacon, and another meat. I didn't like the garlic steak as it was fatty and the garlic seasoning was not successful. I loved the filet  pieces sausage. The salad/hot/soup bar was nice. The cucumber salad was too tart and acidic and the other salad options were okay. I wish it was more lettuce and veggies to make your own. The plantains were the best! My experience was good and I would go again. I can't say it was really $45 worthy, but if you can eat a lot it would be. Oh yeah they had great salmon. Where were the soup bowls?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCMHMRBTv1MJkODyzgSh2w"
  },
  "FwlTJkms3Q16JFygpKxBFQ": {
    "date": "2/18/2018",
    "text": "Very disappointed! When we first walked in we stood there waiting to be sat! The person that sat us brought our drinks and that was the last we saw of her until she brought our check! The steak had a refrigerator taste and chicken was burnt! Scallops were really salty, tough, and fishy! We LOVE steak houses but this is one we won't be back to!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yyIK07h3LOn7ewJUskZOzw"
  },
  "PnDSIYOWoiyaGb5tEzmcYw": {
    "date": "7/7/2018",
    "text": "Love this place! Great service and great food. They pay really good attention to their customers and never let you have to wait for the meats. Salad bar is amazing and also includes other side items. Never too crowded for a large group. Parking is validated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o9ohwusxi53b8Sp4PBTZsg"
  },
  "Z-YgzbkB3bqvQGwUFreIXg": {
    "date": "11/18/2015",
    "text": "I have been to this place twice and I would definitely go back. They validate parking too! Service is always nice. Great atmosphere with large windows. My favorite is the flank steak. The bacon wrapped scallops are so delicious and tender. They literally melt in your mouth. Ribs are awesome. The churri sauce is great with the steak. It has a slight kick to it. The salad bar is everything you can think of! They also have soup and a buffet of side items. I highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nEFSrodZUCRrsj_XiuUzEw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Salad bar. Jumbo cocktail shrimp, crab salad, chicken salad and pasta salad!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nEFSrodZUCRrsj_XiuUzEw/o.jpg"
      },
      {
        "img_id": "GXflLvjGcrwOfJbPjGoqcw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Churri appetizer",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GXflLvjGcrwOfJbPjGoqcw/o.jpg"
      },
      {
        "img_id": "30J7AyAyJOfSvdcAlWu5PA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Bacon wrapped scallops. Little bites of heaven.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/30J7AyAyJOfSvdcAlWu5PA/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "RYpPUxTlrqnWws9cWeDqLA": {
    "date": "1/12/2017",
    "text": "Had dinner here tonight for the first time and loved it. I've been to all the other Brazilian steak houses in Charlotte and Matthews and Brazz was awesome. Not as fancy as Chima but the food was just as good if not better and the service was superb. Chef Barry and our server Andrew were truly spectacular and super attentive. Best service hands down I've had at any restaurant in a long time and I go out often. They were always there to check on us and went the extra mile with everything. You can really tell they enjoy what they do. All the meat was super tasty Cooked just how I liked and very flavorful. That's where this place beats Chima as the meat at Chima isn't as flavorful and bland. I'd highly recommend this place and I'll definitely be back to see chef Barry and server Andrew!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_NYvYuc4qZWGioztESNn5w",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_NYvYuc4qZWGioztESNn5w/o.jpg"
      },
      {
        "img_id": "nGR1Fy2nSorpdT92yD9ALw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nGR1Fy2nSorpdT92yD9ALw/o.jpg"
      }
    ],
    "user_id": "wpQc45QpeKwe_sDyaM0Vzw"
  },
  "Iq_lGOlpIyoQfEIukz8Erg": {
    "date": "7/16/2018",
    "text": "I love this place.  Their customer service is always on point and the servers are excellent.  I usually get the salad bar because everything on the salad bar is delicious.  I love the chicken salad, smoked salmon and the roasted vegetables.  The staff always recognizes my family as returning customers.  There are two Brazilian Steakhouses in Charlotte.  I prefer the Brazz based on their customer service, salad selections and parking.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-GZRiQfrjgxrYHH4y9f8w"
  },
  "-NlwkwlrjxmuNUVwT2BEyQ": {
    "date": "2/2/2019",
    "text": "Where should I begin. First and foremost we had reservations on Feb 1st 2019 my wife's birthday. To my amazement we didn't need reservations because it wasn't as packed as I thought it would and should be. We were greeted warmly upon entering the restaurant. We were seated & our waitress was from Brazil and she was Awesome. Her friendly smile, warm demeanor, and caring attitude. This made the evening even better. My wife and I & two of her girl friends enjoyed ourselves from every perspective of the establishment. We have eaten at several restaurants, this was by far one of our faves. Keep improving, we definitely recommend this place and we will be back.  Don't allow those not so good ratings deter you. Experience the experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PuMZkPTRhWfCqIFXfIfzXw"
  },
  "wh0iaNqdtnVAlqbe12i19g": {
    "date": "2/2/2019",
    "text": "I make it a point to eat there whenever I'm in Charlotte for the weekend. People are nice and have great service. Salad bar, food food bar is delicious. I am fond of the tomato soup they have also. They bring all the meats to your table that you can possibly eat. My favorite is the top sirlion. I use the light rail and there's a station right across the street so I don't have to deal with parking. It's right at The Green.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WpGQiK4dQqnk1WN1OmofpQ"
  },
  "OCbbYVf6nBXVXKzNnJGTfA": {
    "date": "5/15/2018",
    "text": "Still amazing!!   I'll be back in the area and I can't wait to get off plane and head here to eat!!! Yes .... it's THAT good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QI1xMxs8yL0XN0nCeu1V8Q",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QI1xMxs8yL0XN0nCeu1V8Q/o.jpg"
      }
    ],
    "user_id": "dufoZUrTVwPGqa3VmCl3ug"
  },
  "FzQhLsDq2H77AbjLJl8S4Q": {
    "date": "12/28/2018",
    "text": "Brazz have truly mastered the art of fine meats, however, the service can use a little work. Not a lot of attention and care was served.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1OHXuyC6xorSDchcwKRJnQ"
  },
  "EyhSbsLFGpjfnhhDLORTGg": {
    "date": "12/11/2018",
    "text": "Went to Charlotte for my fiance birthday this past weekend and we had a blast! This was our first time dining here so we were excited for the experience. We made a reservation on open table which I highly suggest doing because they get a little busy after 6pm. If you dine here, make sure you are pretty much starving because from the moment we sat down, we were literally treated like royalty with meat that was just pulled of the roaster. Each item was seasoned perfectly. We both ordered the  Dinner Rodizio- 10    meats (including bacon wrapped scallops which were cooked to perfection and made your mouth water), access to the hot and cold bar. Don't fill up on the salads or soups available, the meat is the main event. At the end of our meal, the chef came out with a happy birthday plate with grilled pineapple. We will definitely be back and make sure our stomachs are empty. Worth the money!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-UIBOVSiQAN-SOWSCjAocQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-UIBOVSiQAN-SOWSCjAocQ/o.jpg"
      }
    ],
    "user_id": "7Lq4vNhDI08wO_N7QDEEyA"
  },
  "BHj-Y95EraHa2_FORGQtPw": {
    "date": "12/31/2018",
    "text": "Maybe it was an off night, but a very disappointing experience. The ambiance was stark, the sides - popovers (undercooked in the middle) and polenta (gummy), were offered once. The salad bar consisted mostly of ready to eat, premade salad, few fresh vegetables. The meats were under seasoned, and while hot, just underwhelming.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3MdpJ9ky0wRKDZ7S6qIY-g"
  },
  "lfM2t5YjSKp3fApY4Gqk2w": {
    "date": "3/23/2018",
    "text": "I've been to a few Brazilian steak houses and this was worth the money. The cuts of meat were good and seasoned to my liking. The side foods could have been more plentiful but what was there was really good. If you are a serious carnivore and in the area then I recommend trying this restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3imWTeKPmaRDvRpjBEiYFA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. meat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3imWTeKPmaRDvRpjBEiYFA/o.jpg"
      },
      {
        "img_id": "CJ_JGIDcbf3aDMj5YZ_7-A",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. meat",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CJ_JGIDcbf3aDMj5YZ_7-A/o.jpg"
      },
      {
        "img_id": "u3h2cKbkVIWLJItldBAWeQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. meat",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u3h2cKbkVIWLJItldBAWeQ/o.jpg"
      }
    ],
    "user_id": "wB-R_Q9nC45hmHYxjjaLNw"
  },
  "DjAuBRcGSABNj3rkQwVQVQ": {
    "date": "7/6/2017",
    "text": "I've been here twice on non-consecutive years. The first time was okay. The hot bar and salad bar was decently stocked and made a decent meal until your meat is ready. The steak the first year was decent. I can't say it was worth the money though. I was really expecting a taste explosion for the price, but it was acceptable.  My second visit, they must have forgotten to season the steak, because it was the blandest piece of meat I have ever received at a restaurant. That was the point I said, I am done coming here. Since we went here on vacation, a little expense isn't a deal breaker. But the food just wasn't very good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c0T2_aZq99QSIDcQjPtrNg"
  },
  "WHa6ocpuHOTi49c15W3l9Q": {
    "date": "1/30/2017",
    "text": "I'd like to give them slack because it was restaurant week, but I just can't. We had a reservation for a party of 6 at 8:15. We were all there by 8pm, but we were not sat until almost 9pm. If the restaurant was full, I would have understood, but there were a good deal of empty tables throughout the entire duration of the meal. Once we were sat, our drink order was promptly taken and the meats started coming.   The meat....the sausage was delicious! Reminded me of the old Portuguese part of town I grew up in. The lamb, also delicious, on the verge of too minty, but both my pieces were perfect. The filet...my first piece, perfectly medium rare, buttery, couldn't wait for another piece. The second piece, well everyone at the table agreed, all our filets should have stayed on the fire. It was raw inside. Not rare, more like never even felt the flame. Both the chicken and ribs were overcooked and consequently dry, that even the sauce on the table couldn't help. The garlic sirloin was another item that was overdone, to the point that we heard another diner call it \"flavored shoe leather\".   The gauchos come by often with meat, but our server was no where to be found. We all had empty glasses and were ready for additional beverages, but no one came by, even after we asked a gaucho if he knew where our server was.   Again, I understand it was restaurant week, but you go to a restaurant like this for the experience, and there was none to be found. We all left there disappointed with the meal and wished we had made a better dining choice.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "aNFVX7NZpprqSYNsOld59g": {
    "date": "4/3/2019",
    "text": "Does not taste or look like authentic Brazilian cuisine! Makes me wonder if the owners and chefs are even Brazilians. I was very disappointed! They should take Brazilian from their name and just leave steak house.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7p3MYNkO36780YaPcBRJQ"
  },
  "1Vmzesm-BPImmtiH-XwHpA": {
    "date": "1/17/2019",
    "text": "Such restaurants unlike small ones must not just deliver on food, but also on ambience and service. While food is mediocre to just good, service is terrible. We waited more than 20min at times between 2 servings and it just killed the experience. It's almost as if their strategy is to make us eat less food by taking too long to serve food. And it worked, but what didn't work for them is - None of us will ever go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECPeEV_TnTfUJDw1dVRcFQ"
  },
  "7ZEICm7Ns6QBtVYb5ou5lw": {
    "date": "1/23/2019",
    "text": "Service was very slow, often times had to wait up to 15 minutes for a single cut of meat.  They would have 1 person, sometimes 2, walking around with meat and they would often run out before making it to your table.  Instead of leaving because I was full, I left because I didn't want to wait another 15 minutes to get a piece of meat. I would avoid Brazz and pay the extra to go to Chima.  They have much better service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jVS5Nw3my-L4JkNrPFiWyQ"
  },
  "j4KRoyooNUoMq97_XOqT-A": {
    "date": "7/30/2018",
    "text": "The meats were alright but the salad buffet and hot entree selection had a lot to be desired, food was bland. Service was good. The BBQ pork ribs and pork loin were dry but the top sirloin and filet were good. The chicken was surprisingly good as was the tomato bisque soup. They ran out of hot bread and didn't refill it. Glad I went for Taste of Charlotte at $35/person plus tax and tip, otherwise, I would've been severely disappointed if I had paid full price. Chima was much better.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yYsivsdGU6Pkg-w7oE51HQ"
  },
  "I11o1mtJ3Z7CBgDkMr7E4A": {
    "date": "8/8/2018",
    "text": "The best and affordable Brazilian steakhouse in town. You go for the basics: the excellent service and the divinely cooked meats; forget the other glitzy and expensive rodizios, this is the place to go! Feels like family when I dine here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mj9ydV0mUcSwBy9SGGwc0w"
  },
  "7MQUlH_5_mBVKtCme-Oipw": {
    "date": "2/17/2019",
    "text": "Perhaps we caught you guys on an off night. However, my boyfriend and I were extremely dissatisfied with the quality of the food. It seemed as if the seasoning was either non existent or dumped on to the meats as well as the food from the hot bar. With the high price that comes with what we ordered we expected top quality. I think that the food could be amazing however, it was very much short of that. I would tell people who are looking to get their moneys worth to go to another place that will offer you what you want especially if it's a special night for you and your partner. I would like to commended the staff that was working who catered to our table as being very pleasant and informative. If it was for their pleasant service the entire experience would have worse.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Oxao_k3msGElqHQL-HeptA"
  },
  "G0hC1Cd2rbXF8R6VbC7BQw": {
    "date": "8/17/2015",
    "text": "Brazz Brazz Brazz... What happened? I am actually surprised I had not reviewed this restaurant before. We go pretty much every time they post a coupon on Groupon because it is usually a pretty good deal after the discount is taken into consideration.  The reason I am giving my last visit a 3 instead of a 2 is because of my favorite part of experience which is the bacon wrapped scallops and fried alligator. Both are amazing and they were still on point! They will keep bringing them as long as you ask for them. Brazz is very consistent in asking at the end of the meal if you want any additional or particular meats again. There is also a great server who gives extra meat and scrounged up some cinnamon pineapple after we asked for it last visit. He is super friendly and always makes our visit a good experience.   Now to the cons - there was no asparagus at the salad bar. Asparagus is one of my favorite vegetables so I was sad for the loss. I need light vegetables at all you can eat steakhouses because just sitting down to devour a bunch of beef and nothing more is too heavy for me. There were some other vegetables so it wasn't a huge deal.  The major problem with this last visit was the temperature of the meats. We ordered medium cook on our meats but as they came out it was progressively less cooked. By the time the garlic sirloin came out it looked like it had been seared briefly on each side and was definitely rare in the middle. No problem I asked to update my preferred cook to medium well. At this point everything that came for me was well done with no pink. I felt like there was no middle ground and I was just wasting a lot of food.  Maybe it is because we went on a weekend and had previously only been during the week? We will wait a bit for returning and keep our fingers crossed our Friday night out was just a blip.  FYI if you have not been there before they will validate up to two hours of parking in the green parking garage just past the restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "2nOdIBLRRxeOil5_Hhvg8g": {
    "date": "11/15/2017",
    "text": "This review is for the lunch buffet only.  3.5 stars.    Food quality and taste = 5 stars.   If you're super hungry?  = 5 stars. customer service = 4 stars (guy at carvery station is a statue...no movement, no words, no facial expressions.) meat portions at carvery = 2 stars. bang for your buck = 3 stars (priciest lunch in town, but worth it if you're starving)  Summary - I really like their everyday salad items, fresh veggies, and soups.  I like some of their daily specials, particularly love the Cajun food.  There are some days where the daily specials are pretty heavy and pedestrian, not noteworthy.  The meats at the carvery are fantastic but the guy giving it to you seems a bit off.  Overall, if you missed breakfast and don't have a lunch budget, this place is perfect.  Otherwise, this is more of a luxury than a necessity.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iShOjmJxkLO-z9Y2HU8evg"
  },
  "JcsdaYTTNY14wM3xPh7-zw": {
    "date": "7/26/2018",
    "text": "Had a delicious Birthday dinner here tonight. It is similar to Chimas, however it has a more laid back atmosphere. In my opinion the food tasted better and there was more variety. Wish this place was closer I would eat here once a week",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6yYR--HAVgdt2xz_WMqeHw"
  },
  "fOcOIIWSq-TLqhTkKe_XnA": {
    "date": "10/5/2017",
    "text": "One word: IMPRESSED  **For the meats review scroll down**  Price for rodizio $48 with taxes  I came on a Wednesday evening at 6:00. I came here because Chima was closed for a \"private event.\" I was a little skeptical because it looked small and there wasn't a lot of people i can see through the window. I still went inside looked at the menu and gave it a chance and chose the rodizio. There was two other tables and each praising how good it was and how stuff they were. I sat down and was given an iced water(i chose no alcohol because i wanted to fill up on food and not drinks). I went for the cold and hot items and got just a few items knowing i came for the meats. The fried plantain was definitely a winner. They also had rice, beans, salmon, cocktail shrimp and a variety of salads and pasta.  Right away i was brought pork loin which was delicious and then some chicken, super tasty as well. After 10 minutes i was the only customer left in the restaurant and i was being catered to, which was awesome. I guess restaurant starts filling up after 7.  For the meats: Pork Loin - very well seasoned and juicy-probably one of my favorites Chicken - very well seasoned and juicy but i came for the real meat Pichana - my favorite. Perfectly seasoned, juicy, tender and loved! The fat layer  Alligator - tasted like chicken with a hint of fish, but tasted good Fillet-very juicy but not very seasoned Flank-very beefy, juicy and under seasoned, still good and loved the fat on it Garlic beef - didnt taste garlic but juicy and fatty Bacon scallops - pretty good but not much to it Bacon chicken - tasty and juicy  I feel im forgetting something but as you can see alot of meat. Plus i got served more pichana at the end which was awesome. I definitely recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8WE7H_NvgM7V6IA7Ro3Prg"
  },
  "Okqo2D-Rk_-YfLs6kxNGvQ": {
    "date": "5/19/2018",
    "text": "Gross. Save your money. Way overpriced for the quality of food. The buffet was horrible and the meats were nothing to be desired.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cblhZlNsFdyv6UuKJvBUwA"
  },
  "puKu71THniUG2crGvVeyGA": {
    "date": "9/14/2019",
    "text": "This place is so good! I've dined with a group of about 10 as well as with just my husband. Service was excellent both times. Super good drinks. Fresh salad bar with so many options (the second time we went I just got the salad bar because its so big)! Recently visited Chima in Charlotte so we could compare the two. Brazz wins all day long! We can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AZ22WQRVsLl253-sz4_RYA"
  },
  "sMa3IWptoNoTPhlDtR8TbQ": {
    "date": "1/22/2019",
    "text": "Dined at Brazz Carvery as part of Queen's Feast (Jan 2019). I'd never heard of Brazz before and, as a Brazilian steakhouse newbie, I had no idea what to expect. Brazz is located right on the Green in Uptown and is right next to Fuel pizza.   A NOTE ABOUT PARKING:  Park in the attached Green parking garage and Brazz will validate your parking. Easy peasy.  Our group of five (ended up being four) had reservations at 5:00 right when they opened and we were promptly seated upon arrival. The restaurant was empty when we arrived but quickly filled up as the night progressed. Our waiter, Kevin, explained the Queen's Feast menu to us and let us know we could hit the hot food/salad bar whenever we were ready. For their Queen's Feast menu, you had choice of wine/beer or mango or passion fruit juice, hot foods bar and various carved meats. Dessert was an additional $5 charge as well as their specialty drinks such as the caipirinha.  The hot foods/salad bar had various cold pasta salads, Caesar/Greek salads, tabbouleh, quinoa salad, teriyaki salmon, rice (which was dry), fried plantains (my favorite of the bunch), roasted veggies, potatoes, shrimp cocktail, beets, artichoke hearts, and so on. The meat carving service soon began and we got our fill of bacon wrapped chicken, roasted chicken, sirloin, filet mignon, pork ribs, lamb, sausage, and something else. The standouts for me were the filet and two chicken options. Both were well seasoned and delicious.  I have to say the service wasn't great and ended up being quite spotty as the restaurant got busier. We had a hard time flagging down our waiter for drink refills and, eventually, our checks. Once we got our checks, we cashed out via a handheld machine which is something you'd find at a Chili's or Applebee's. I thought that was odd but not a big deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "o0gMstV6U1DjFKBiuJS04Q",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. My plate of meats",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o0gMstV6U1DjFKBiuJS04Q/o.jpg"
      },
      {
        "img_id": "fniKfY6I214KuILnedbnxA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. One section of the dining area",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fniKfY6I214KuILnedbnxA/o.jpg"
      },
      {
        "img_id": "3u1dWZikj4LztSnIbAowcw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Part of their hot foods/salad bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3u1dWZikj4LztSnIbAowcw/o.jpg"
      }
    ],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "FfEX-ChD_zi-6D1VnW4oig": {
    "date": "1/21/2019",
    "text": "Just dined for Restaurant Week and it was a bust.   1.star deducted for the hard cheese breads, repeated ask even after it was clear they were the desires item tonight but especially the card payment being taken at the table while our server stood over us.   I abhor systems that calculate tips with the tax when it is supposed to be pretax amount. Either way, beware .. the girl didn't give us privacy but I noticed the guy gave his tables privacy.    The gauchos were super attentive to the medium well preference of our table and made sure we were accommodated without any additional asks for such.   Heinz 57 at the bar next to the soups.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "wSRvpYaFiX6e3jMqKbaCbA": {
    "date": "1/31/2019",
    "text": "Came here for restaurant week because they had such a good deal. For $35 you get a cocktail (you can sub for a fountain drink), appetizers, cold bar sides, hot bar sides and they come to your table and you can choose from 8 different meats.  The appetizers were cheese bread and polenta. The cheese bread I didn't really care for. The cheese in the middle of the bread was an interesting texture. I was expecting the cheese to be solid but it was somewhat of a loose, soft cheese. I didn't eat the polenta because I don't really care for polenta.  The hot bar has plenty of options, teriyaki glazed salmon, rice, plantains, roasted veggies, rice, etc. The cold bar has assorted pasta salads, salads, shrimp cocktail, cold veggies, pickled veggies.  The meats you can choose from are sirloin, filet mignon, pork loin, ribs, chicken breast wrapped in bacon, pork sausage, boneless chicken and lamb. My top faves were the filet mignon, ribs and the bacon wrapped chicken. The filet mignon, ribs and bacon wrapped chicken all had great flavor. All of the meats and chicken were very tender. They serve the red meats on the medium rare to medium side. When they come around to your table, you can turn your coaster over the the \"Yes\" side if you want the meat or to the \"No\" side if you don't want the meat.  Needless to say, I was very full after I left. I think the restaurant week is well worth the $35.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cOGNv3HKrBgQoQDvEXPBpA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cOGNv3HKrBgQoQDvEXPBpA/o.jpg"
      },
      {
        "img_id": "Zd0cB9TU5X1LrG4e_g4-iw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Zd0cB9TU5X1LrG4e_g4-iw/o.jpg"
      },
      {
        "img_id": "9Kr7WjvwE7zMIYCFflQPNg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9Kr7WjvwE7zMIYCFflQPNg/o.jpg"
      }
    ],
    "user_id": "yiKkxcuQdB04PVUW7OgtNw"
  },
  "E4OBzlbPgmbaoaJM-BclAA": {
    "date": "11/21/2018",
    "text": "Saturday night was a special day for a number of reasons. For starters it was my first time visiting Brazz. I'd heard good things about them but hadn't had the chance to visit. On top of that the reason for our dinner here was my best friends Chris and Krissy had just gotten married the night before and we were going out to celebrate. Lastly I had quite literally just finished running a 14 mile Spartan Race in SC that afternoon, went home for a shower, then drove straight here. Needless to say I was hungry and had plenty of calories to spare. BRING ON THE MEATS!  We arrive at 6:30 and are quickly seated (reservations help). Despite our massive party of twenty people the servers seemed undaunted. Everyone had drinks almost immediately and our \"main\" waitress explained how everything would work. We could immediately start trying what was on the salad bar and hot foods bar and the other servers would be out shortly with the majority of the proteins. The little Yes/No card system for the traveling waiters becomes important, because at some point your eyes are going to betray you and your going to have too many delicious things on your plate at once. A good problem to have!  The Good:  White rice and roasted potatoes on the hot bar. Not as exciting as some of the other dishes but you have to give them credit for being perfectly cooked, and that's half the battle. Fresh mozzarella slices on the salad bar. Simple and wonderful. The filet mignon. Like everything else we ate that night it was perfectly cooked, but the one piece I got didn't seem to be seasoned quite as well as the other dishes.   The Great:   Frango Con Bacon. Tender cuts of chicken wrapped in bacon and roasted. I know some people say chicken breast is boring but this was juicy and wonderful. Linguica. Brazillian sausages with just the right amount of spice. Great flavor. The drink whose name escapes me. It consisted of muddled mixed berries, lime, rum and grenadine I think. Light and refreshing.   The Excellent:  My top picks are miles above the others in my opinion. From the hot bar you have the Glazed Salmon. I have both eaten and cooked many a salmon filet in my time and this is top two all time. Perfectly cooked, warm flaky flesh, a savory yet slightly sweet glaze. It's hard to describe just how good this is. The best of the best of the travelling meats. Picahna, The Top Sirloin. I'm told its their signature dish and I can see why. Imagine the perfect bite of the best steak you've ever tasted, now imagine if every bite was that perfect bite. The way it's served and sliced you almost always get an outside edge so you get a perfect medium rare interior with a caramelized sear on the outside. Every single bite was as good as the last, and the next. If I came back to visit, and they told me they scrapped the entire menu save for the Salmon and the Picahna, i would still stay and just eat that. These are the star dishes. These two proteins are why you should visit Brazz.    The staff here take care of you. We never had an empty drink the entire night and the food was constantly travelling by our table. This was my first real trip to a Brazilian style steakhouse and it was so much fun. If the occasion arises for a fancy dinner, I think I've found a new favorite.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "cEUM160Ro3hvv7VKEXaxrg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Wedding Dinner Celebration For Chris and Krissy!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cEUM160Ro3hvv7VKEXaxrg/o.jpg"
      }
    ],
    "user_id": "fieG_NMe33z9yW-5jYoK5g"
  },
  "eGWGWtGLIFOuxXARkCV2Rw": {
    "date": "9/7/2019",
    "text": "Extremely over priced. Service was decent and food subpar at best. Dinner  for 2-one glass of wine and one jack Daniels drink was $136. Will not be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bh3iVqnCiA-qHPcLNmSXaQ"
  },
  "HZIDV27mHTU4exES9fn0zw": {
    "date": "7/12/2019",
    "text": "We were at a conference in Charlotte and we happened to find this place. All I can say is you must come hungry. The food is amazing and there is so much of it. The friendly staff will take excellent care of you. If you have never been here, you must give it a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U9gjefvz7lJ7aHkfZHTIbg"
  },
  "oqDwtd453jM-LzXJPC8rTQ": {
    "date": "11/11/2017",
    "text": "There are really only two Brazilian steakhouses in the Charlotte area to choose from, and more than likely if you're reading reviews about this one then you're comparing it to the 'other' one. Well now that I've been to both many times, I can tell you that you're going to have a better experience at Brazz!  Located in the Green Park off College and across from the Convention Center, Brazz is a bit more intimate than most of the highlight restaurants in Uptown. The bar is a real statement piece, very clean and we were immediately greeted by the bartender who was playing host as well. After getting the rundown (they explain how things work, I had one in our party who had never been), we made our way to the salad bar.  Now, the first thing I love about this place is that most Brazilian steakhouses are real skimpy with the fish offerings and they're typically thrown into the Rodizio rotation (where the carvers come through with it, being the least brought out meat). Brazz just includes the Salmon right on the buffet style salad bar! Another winner for me with Brazilian cuisine is plantains, also on the buffet, yes please!!  While I could rant and rave all day about the salad/hot bar, you really need to save your space for the meats. As soon as you flip your indicator card over to YES, your table is going to be bombarded by server after server, wielding around massive haunches of meat. Feel free to flip your card back over to NO if your plate or your stomach is overwhelmed and you need a break.  So as far as a favorite, I gotta go with the Picanha. I've had this cut at Brazz and Chima several times and I gotta say, Brazz does this cut so much justice. It's got a perfect texture, perfect medium-rare, perfect seasoning, I could just take a whole plate of this. The flank steak was spot on with flavor as well. I'm not much of a fan of Pork but theirs is seasoned with parmesan AND it wasn't dry, OK it's pretty good.  I wasn't a big fan of the chimichurri sauce, and I believe that the Rodizio typically comes with a small plate of fried starters (along with other things) that our table didn't get. Not a big deal as it's mostly there to fill you up with carbs!  If the price for dinner is a bit much for you, make sure to check out their lunch specials on their website. Very reasonable with the top sirloin available at the carving station. Look for me there in the corner with a plate piled mile high!",
    "rating": 4,
    "rated": {
      "funny": 8,
      "useful": 13,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "SCXZnG6hPYyIC9hqb7_ZOQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Flank Steak was unbelievable!! =D",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SCXZnG6hPYyIC9hqb7_ZOQ/o.jpg"
      },
      {
        "img_id": "8IaYAC-swlpqrCgp9EOnOw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. First plate of meats!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8IaYAC-swlpqrCgp9EOnOw/o.jpg"
      },
      {
        "img_id": "lTI3URHqfum0UvAkfQ9RTg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Salad bar plate.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lTI3URHqfum0UvAkfQ9RTg/o.jpg"
      }
    ],
    "user_id": "dpzAqLprtex54rXlCU-OTA"
  },
  "RcOLLbGwY_N41y8eT9q0NA": {
    "date": "1/18/2019",
    "text": "If I could give this place negative stars I would.  First of all if you are thinking of going to the place STOP, turn around and spend the extra $ and go to Chima.  The service was one of the worst I have experienced, our table of 5 people waited between 15-20 minutes with empty plates for any meats as the services walked by a majority of the tables only serving 3 people (and there were only 10 people max in the restaurant). When the servers finally came to our table the pork & lamb were both rare and could not be eaten along with the steak was over cooked and chewy.    Stay away at all cost as you will be better off walking next door and grabbing a pizza slice from Fuel and save yourself a few dollars in the process.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcTZsvhqoYdSY9YbAwv9cQ"
  },
  "EVdontkdHgjbwu-zIPd3bw": {
    "date": "2/3/2019",
    "text": "My family and I went via Queens Feast and boy were we glad. The food meat options were phenomenal and the sides were also. The service was amazing and everyone was nice and accomadating. We've ate at Chima before and between the two Brazz is our favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hT_om-nME8mV2cpxr7e37Q"
  },
  "UA4DSViL4Icl6hc2Af7yzg": {
    "date": "1/28/2019",
    "text": "This was my 4-5th time at Brazz. BEWARE OF SLICK FLOORS. This time we came for Queens Feast (Jan 2019). And yes, every time I come I SLIP, LOL!! We got there maybe 5 min late because parking normally in The Green isn't as bad as it was this Sunday. We walk in and the lady at the front is going back and forth with a family about the wait for a table. We finally are seated and we sat and sat, tried not to get antsy because we were the ones late. But this guy who I believe is the owner finally came and at least gave us some water after a good 10 minutes. So I'm taking it as it's our fault, we were late, lol silly me because we didn't even get the starter bread that's just downright rude! I was mad about that. Our waitress was okay she just seemed busy we didn't need much.  With Queens Feast you get a drink (beer or wine), 8 meats, and the Buffett bar. We always upgrade our wine to a bottle. I love the salad, roasted veggies, and my fiance loves that crab salad!! I would come on a regular day just not during restaurant week honestly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMN5ThRdC7B7ascj4KbpQw"
  },
  "Op7oCIsfV27pX5gPKXSH6A": {
    "date": "10/3/2018",
    "text": "I have traveled and gone to many Brazilian places but I have never felt more disappointed then I did going to Brazz. I came in and was the only person in the entire restaurant and likely for good reason.  I wanted to eat primarily the cut Picanha (it's a beef cut). It's extremely tender and juicy (usually) and slow cooked on fire on a skewer with three or four total pieces usually and thick salt.   I wish It was half of what I just described.   When I ordered, I went to the salad bar which was half empty and half sitting there for most of the day.  I tried the roasted potatoes and got a few slices of tomato. Then patiently waited for the protein to come out.  It did not come out \"Brazilian/Charassco style on a skewer but came out pan fried smothered in oil and vegetables? What?? Stick to your menu?!!!  I looked online and couldn't find a single picture of what was served to me. I also am allergic to green pepper and I wish they asked before modifying the food. I tried to communicate this to my server but I was in an empty restaurant without service.   When the waiter finally came out to me I pointed out to him that the meat was still completely blue inside. Believe me, I love a rare or medium rare steak, but this was not cooked all the way.   So he took it back to the kitchen where the \"owner\" was cooking. He passive aggressively over cooked the steak to the point where It was completely charred black and grey on the inside. Really? What did I do? Come and be your only customer? The meat was so rough my steak knife could barely cut through It. I couldn't eat it.   I asked for my check and the waiter comped me $10 off ($40 ....) for what??!   I did not want to argue so I paid the bill and left hungry. I ended up going directly next door to \"Fuel Pizza\" and got a slice of pizza. Which was actually very good and tasty.  I don't recommend this restaurant and truly don't know how they manage to stay in business.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "sm-2kfSnUsJWnCKWo1MuxQ"
  },
  "syMLpsxZ-_63PtKXbUCC8w": {
    "date": "7/30/2017",
    "text": "This place is a decent, classic, Brazilian Steakhouse but nothing extraordinary. I came here  for Queen's Feast with my coworkers. They served us a beverage ( wine, beer or juice), delicious Brazilian cheese bread & Polenta, and 8 succulent grilled meats carved table side. Great service, and delicious salad choices from the self-serve salad bar and hot bar.  - Dinner Rodizio (10 different cuts of meat) - $44.95 - Unlimited servings from the salad, soup and hot bar - $24.95 - Lunch Carvery: Each day features different theme and roasted vegetables, sweet potato casserole and mashed potato. In addition to three roasted meats. $12.95 Mondays- Indian: Chicken Tikka Masala, Vegetable Korma & Basmati Rice. Tuesdays- Chinese: Sesame Chicken, Fried Rice and Broccoli in Sweet Chili Sauce. Wednesdays- Italian: Chicken Alfredo, Backed Ziti & Steamed Vegetables. Thursdays- Soul: Fried Chicken, Okra and Tomatoes & Jambalaya. Casual Fridays: Mac and Cheese, Roasted Potatoes & Steamed Vegeables Saturday and Sunday: Buffet Favorites.  Daily Specials:  Monday Domestic Bottled Beer $3 Tuesday 1/2 Price Bottled Wine Wednesday OMB Draft beer $3 Thursday House Liqour $5 Friday Xingu and Palma Louca (Brazilian Beers) $3 Saturday Caipirinha (Brazilian Cocktail) $7 Sunday Absolute Bloody Marys and Mimosas $5  Three and Three Quarter Yelps",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "5OLNC7guAGU3Q4yNJwwE8g",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5OLNC7guAGU3Q4yNJwwE8g/o.jpg"
      },
      {
        "img_id": "b_bgo0gcT-ha1JC1Zjrcqw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/b_bgo0gcT-ha1JC1Zjrcqw/o.jpg"
      }
    ],
    "user_id": "N9hqTPQu2bmI8c2Pj8F1ww"
  },
  "ySbh124iwoqBi_bwH_xSBA": {
    "date": "9/10/2018",
    "text": "Wasn't impressed. Came for lunch. First thing I noticed the floor was super sticky around all around my table.  The food was ok. I don't know what the Mac &cheese or jumbalaya was but it wasn't Mac & cheese and  jumbalaya. Granted my expectations maybe shouldn't  be high of a steakhouse but  they offer daily lunch special so at the very least I  thought it would be ' alright' There were very limited actaula green salad options. Had a lot of cold salad options. Only 1 fruit option: honeydew .  I mean everything really was average or under. It's surprising because it's a bit more expensive. I wouldnt recommend at least not for lunch maybe the din ner is better I don't know I don't really want to find out. For $15 I was expecting a better quality of food.  I gave 3 stars because the customer service was great attentive from the moment I walked  in the door. Otherwise it would be a 2 star review I did like the brownie though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7gg29jxOEulX5m6f1mWaqA"
  },
  "jtes2ZW4l9KL8YQ1XhIkVA": {
    "date": "3/3/2019",
    "text": "Brazilian steak house in downtown Charlotte. I've always liked this category. Unlimited freshly prepared meat just appeals to me. Brazz is on the smaller side compared to others in this segment. The price point is pretty decent. The buffet was a bit lackluster compared to what I've seen in both selection and flavor. As far as the meats went the red meat options were excellent, very well seasoned and perfectly cooked. They asked us when we came in how I liked my red meats cooked and they pulled it off well. On the down side if it wasn't beef it generally wasn't very good. The ribs were way over cooked and saturated in sauce, the pork was dry, and the chicken not seasoned well. The one exception was the bacon wrapped scallops which were probably the best I've ever had. One of the more interesting options was the alligator. When it arrived they were served as small fried bites. They were very chewy and basically tasted like bad sausage. This was quite unfortunate as I was looking forward to trying this menu item the most. The service was ok, I saw a lot of the meats two or three times before I was offered some menu items even once. They get two stars with the only high points being the price point and preparation of the beef based menu items.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x-Uzdd8Ti9OvKl0_XvT3Yg"
  },
  "KeRrm6gFEMK_2zUm4g00mQ": {
    "date": "1/24/2018",
    "text": "I went with a group last Sunday for restaurant week. This felt like a more casual Brazilian steakhouse than you might expect. But for restaurant week, this was probably the best bang for our buck we could find. The deal included a glass or wine or beer, an appetizer, a salad bar, 7 or 8 meats on rotation, and dessert for an extra $5.   Appetizer was a cheese bread and a polenta. With 6 of us, they only brought out two appetizer plates with 2 cheese breads and 2 polentas so 2 of us didn't get any. But no worries, saved room for salad bar and meat.   Salad bar had some solid choices. The crab salad was excellent!!!! So was the tomato bisque.   Meat was pretty yummy too. I prefer more rare beef than the rest of my table, but that aside, it was all yummy. Ribs were just so-so but the chicken, tenderloin, etc. was great.   Definitely check it out for a more casual approach to Brazilian steakhouse dining!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "uCAOZSm9uOs7iT1uPIHJug"
  },
  "zJIUkuiGGVXH1g64l2XjDg": {
    "date": "3/9/2019",
    "text": "A little disappointing.  We've eaten Rodizio several times and know the routine. What was served was good. The problem here -- they don't serve what they advertise and what they do serve is very sporadic in their timing to offering. Yes, there are plenty of opportunities to enjoy the variety of beef, chicken and scallop offerings, but ask for a second on lamb -- and you'll wait 30 minutes (which I did), pork loin -- non existent, fried alligator... no where to be found.  Saw a brief appearance of grilled pineapple offered to few tables before it was whisked back to the kitchen. There was one server/hostess bussing, serving drinks, taking orders and cashing out -- on a Saturday evening -- seriously?  At this price point, I'll think twice before returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fv5Nd08YSJV-pvUOB_hOsA"
  },
  "qIjgcokZwiz8yw2zKkKiAQ": {
    "date": "6/16/2019",
    "text": "Every time we come to Charlotte, this is a must.  I'm not a huge beef eater, so I get the Pork Loin meal with salad bar.  My husband and son, love their meats.  They have the all eat and salad bar.  If you go early, from open until 6ish, easy seating.  Service is great, because it isn't a huge place, so they can be more attentive.  When I say salad bar/buffet, it is more of pasta salads, potato salad and such, Shrimp cocktail, rice, blk beans, plantains, soups.  I highly recommend this restaurant for dates, business, birthdays, or just nice but causal meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpPt4BYbhrFARgSqkoqY0w"
  },
  "D6jzwRZ42YK_IG4ZUiz_dg": {
    "date": "1/18/2018",
    "text": "Great experience. Did the rodizio. Lost count of what we are. Don't fill up on the veggie and soup section. Chef told us there were chicken nuggets, it was alligator. Didn't care that it was alligator but could be trouble if someone had an allergy. Overall though the pork loin was to die for. Chef was extremely nice. He brought out roasted sweet pineapples to celebrate a birthday. They were delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uDfYHckNIiHCGJsSrBGGNg",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uDfYHckNIiHCGJsSrBGGNg/o.jpg"
      },
      {
        "img_id": "-IlzqCs8sNttiLWk-jJDBQ",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/-IlzqCs8sNttiLWk-jJDBQ/o.jpg"
      }
    ],
    "user_id": "FyikYazQbNoOumDooOQyyA"
  },
  "eX2bVkTYIiB4zGiH9cJ-pA": {
    "date": "8/4/2018",
    "text": "Nice ambiance and steaks/meats were tasty! My favorite was the top sirloin. Please make sure you are HUNGRY before coming here to be able to enjoy a little bit if everything. However, I will have to agree with other yelpers about the sides found on the buffet bar. They do require more seasoning. The rice I got was white & with no flavor at all whatsoever. I am not sure if that is how rice in Brazil is made and if so I apologize. I just wish it had a little more seasoning. The plantains & smoked salmon were good. Overall, it was a nice experience. It is pricey, so bring a good amount of cash. Average is from $85-$100 for 2 people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xNMACzsb9dF2ePAsLVw5Aw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xNMACzsb9dF2ePAsLVw5Aw/o.jpg"
      },
      {
        "img_id": "2nVQ6ehpdBdYwMjXc1QaoA",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2nVQ6ehpdBdYwMjXc1QaoA/o.jpg"
      },
      {
        "img_id": "Hr9LOgh0Li5vTr7ZwHvYag",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Hr9LOgh0Li5vTr7ZwHvYag/o.jpg"
      }
    ],
    "user_id": "rhXHkX9QFGbD2UZRU40Qjw"
  },
  "dQZfSA841aaUW0ZR-Si6gg": {
    "date": "3/16/2015",
    "text": "Service was good, meat was not that good and poor choices of side dishes, very limited. Had a groupon, but I wouldn't go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VE3xm5QcEYGQG_zBAg4e1w"
  },
  "nES_fVUosSisKmMIFZ6ZVQ": {
    "date": "4/6/2015",
    "text": "Went to lunch with the family - no at all what I had expected.  The waitress had an attitude and the buffet was a joke. a few mayo filled salads, three carving stations and a whopping dessert choice of banana pudding and rice pudding. There were a few broken cookies as well. I wouldn't go back, the meat was fatty and fish still had skin on it. There are other restaurants in the area I would certainly choose than this one!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q4vEr43pvFDEvK2sFkKOAA"
  },
  "5Pf9dD9p3VMk3DjvAegGNA": {
    "date": "5/19/2012",
    "text": "I was dreaming of endless plates of meat after my delish meal at Brazz. Don't be fooled by the endless salad bar, it is a trick!  You can fill up all your want on the different breads, salads and sides, but you must remember the real food star of this restaurant . Walking to Brazz on a slow Tuesday night, the bright walls and modern decor caught my eye.  The meat options of steak, lamb, veal, duck, more steak come to your table without stopping, make sure you flip over your little coaster when you need a break from your beef indulgence. For something different and a fun date night check out Brazz.  The service was attentive, the food was delish  and the grilled pineapple topped the night off perfectly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "7jev9oqE9jawRKXAb7Vq_g"
  },
  "sDn09sBBPSGUMtLftFd2Ng": {
    "date": "10/19/2015",
    "text": "Servicer - Ricole - was terrific (nice, professional, helpful). Food was inconsistent - many items were ice cold and/or tough Management was not available and I was overcharged $24.00 I told them I would write this review and they said, \"I do not care\") Atmosphere lacks any elegance or niceness Prices very high (great quantity - that's it) Restroom not in the restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oxdOFmY0YWW4gFq5jJr-hg"
  },
  "boT0JqTQkdAXPmLGyIG3ew": {
    "date": "5/16/2015",
    "text": "Not even close to Chimas. For the $$$- not a good value. Dinner for two w 2 sodas came to $90, ugh!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fZopvAZ5-QgJEbR-M4U_g"
  },
  "MuJn9PJSMEm4bqvMkjD4SA": {
    "date": "6/28/2015",
    "text": "Not Impressed  I have been to a couple of Brazilian grills before and this one was not that great!   Let's start with the Caipirinha, the limes were old mixed with fresh lime, you could clearly see the color difference, fresh lime is a bright color green, not grayish.  The presence of Cachaca was non existence, I did not taste any sugar and there was no crushed ice in this drink at all, it tasted like warm lemonade and not a very good warm lemonade.    The salad bar was sparse, with no variety at all, the black beans were not favorable and the rice was some yellow rice that had no flavor, the collard greens ...really, they were not cooked, Brazilian collard greens are different from southern collard greens.      The plantains (sweet bananas) were good but everything else was not so appetizing, and there was not a lot to choose from.   The meat, most of it was good but not enough variety, they were very generous with the meat, but I think that was because it was already cooked and so as not to waste it they gave you more. The filet mignon was overcooked and tough, the lamb, sausage, bacon wrapped chicken was good, they had gator but that was rubbery and not good. Honestly next time I will try Chima , at least  I will have gone to all of the Brazilian grills in Charlotte.  On a Saturday, this place should have been crowded and it wasn't,  besides our party of four there were only 3 other groups there, so I'm sure they were cutting back on the food they put out and it showed with the sparse salad bar  One other thing , there was a cleaning bucket near where we were eating, all I could see was the orange cleaning bucket, not  a nice look!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TBIA9THHRn3GdH1mUfoTnw"
  },
  "oVtqbQJzH-DqzxFMGT2deQ": {
    "date": "7/22/2014",
    "text": "Became a fan right away at the taste of Charlotte after having their steak and scallop wrap. Went there last Friday which was the first day of restaurant week. They offer 10 meat Brazilian buffet and nice wine. Only $30/person. Their strawberry cheesecake was great too. Excellent environment and location, a lovely park right outside the restaurant and an underground parking lot right there. I had a really good night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bK4Y_GZUoAUTXIrmeEUGYw"
  },
  "uFAznnWemC5sCTGv8CopWg": {
    "date": "3/5/2012",
    "text": "LOVED the personal attention. Felt like rockstars all night. The food was awesome. Roasted pineapple was amazing. Favorite meats were scallops wrapped in bacon and Parmesan crusted pork loin. Staff readily complied when I requested more scallops and pineapple. Really enjoyed it and went back a second time the next night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "oEp5ArN_aZWpMT0T-lrwww"
  },
  "bKyisokBfrveq0o6-G4Jbw": {
    "date": "2/6/2014",
    "text": "I've only gone for lunch. There is a lot of variety, the food is always fresh, and I've yet to be disappointed. I think they do daily specials in addition to the regular top sirloin, pork, and turkey... I still have to figure out which specials they put out for each day. I will say, though, that their fried chicken is in my top 3 best fried chicken I've ever eaten, no joke. I hope the next time I go, it'll be fried chicken day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDTTw-hoi5A9Gr884FpyQg"
  },
  "EjKAxxBHyfVknzh-6kjOSw": {
    "date": "5/1/2015",
    "text": "My husband  and I  went here for  our anniversary. It was the first  time  that we have ever been  to  this  restaurant. The customer service  was amazing! And the food was also amazing. The wait staff  explained  the different  kinds  of  meats and side dishes. Make sure  you  have  an empty  stomach  before  you go because  you will definitely  be full when you leave. We will definitely  be  be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v7oU_NQf_JOMwRjUZPAEQ"
  },
  "CsPOvMLa35CAtXGenBc-KQ": {
    "date": "1/19/2014",
    "text": "Falls short of authentic Brazilian rodisio - no feijoada, macachera (yucca), farrofa, or chicken hearts - staples of Brazilian cuisine. Wait staff claimed that the restaurant used to serve the delicious Brazilian cuisines, but too much of it was going to waste, as the Americans were not eating these things, so they stopped serving it. My high expectations were pretty disappointed, having previously lived my childhood in Brazil. However the staff was a joy, and the caipirinhas we're fabulous!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xd7-I2WdAqGSuSsNm82u3Q"
  },
  "M76RdRnj8ZsJN7ZypQWpcA": {
    "date": "4/16/2016",
    "text": "Here for my 22nd Birthday. Had an amazing evening at Brazz. The experience was impressive by the service. I have been to Chima before. I enjoyed the cold buffet here at Brazz much more. I vivisted using a Groupon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Qb85svvwMN_gkS0x3zbBw"
  },
  "wUokANEi3Rbrw86RxexCPA": {
    "date": "4/9/2015",
    "text": "My wife and I went to an early dinner here (5:30p) on a Wed, so probably a little different experience than later in the evening, but we were impressed.  The buffet line of side dishes is presented well and everything we tried was great.  The chef that kept bringing out different meats was very nice and seemed to really take pride in his work and made sure we were pleased with everything.  The different meats were all excellent and cooked perfectly.  Just be sure you skip a meal before you go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_HEARLV--RHV_geUnkX6RQ"
  },
  "OeEeWP91-rw0dr-pL4ZH9g": {
    "date": "6/21/2016",
    "text": "The worst \"Brazilian steakhouse\" we've had. The meats were the only thing good here. But if I'm paying nearly $50/pp I'm going to Chima next time.  Who doesn't have potatoes as a side, only plain white rice avail on their \"hot bar\" Def not worth that price. Didn't even have desserts out. They're on point with filling your water/soda though for that price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "szHUN2QBPeh_ebVFISrCuA"
  },
  "C1ufkGE6zKmBP8kOiMjP-Q": {
    "date": "4/7/2016",
    "text": "Don't be afraid to try great experience , buffet style , very nice bartender , delivery different meats to your table on skewer . Would come again and recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nj5KsXIy2fk5V4Ag1pOtww"
  },
  "ABATRuBGYjKNEp7M8RSiYg": {
    "date": "1/24/2015",
    "text": "Had a wonderful time with my girlfriends during Restaurant Week.  The meat was very flavorful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YfO3gZeuS7iAZ5OpFidYCg"
  },
  "uFSG-oXlCage5_BH39AfJA": {
    "date": "1/20/2014",
    "text": "Best Brazilian restaurant in Charlotte! We have been plenty of times before and decided to go tonight for restaurant week and we were NOT disappointed! The staff is always excellent, super nice, accommodating, and friendly. The salad bar you can make a meal off itself and the meats are always juicy and tasty. They never let you sit for long without bringing meat by and to eat a lot you know not waiting is essential. I love this restaurant and definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dbauyN1i-7eOoJjLoopDPA"
  },
  "gTU1i7WTRstvZI1D65pCnQ": {
    "date": "5/13/2016",
    "text": "Just finished lunch. In town on business. Wow. Very enjoyed with the 3 important things. Price: affordable (12.95 for lunch), service: great! My checkout said my servers name was team work. Not sure why but he was great and so was the busser, the carver, and everyone else. Food: very good. For the price your wouldn't expect much but I was pleasantly surprised. Good food and the carvery meats are cooked perfectly. I absolutely will be back. Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YBH-AhUZROC9zbQCde97Ug"
  },
  "-hemA_wA84ep-y5SxwCVqQ": {
    "date": "8/22/2013",
    "text": "Meat cooked well, seasoning eh. Service was excellent . I had the 10 meats dinner . I dont know if its worth the price . The pork lion, pineapple was delicious. Some of the meats was over seasoned with garlic. The salad bar ehh. Get a better salad Bar. I went on a Wednesday night. Brazillian sausage not for me.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "EkUOdHnL_-60VGfW0LDbiA"
  },
  "TjLWSL-j3RD842xnDmMJBA": {
    "date": "10/31/2015",
    "text": "I got a groupon for this place and it was surely a dissapointment, The food came out so slow and the meat wasnt cooked the way me and my husband ordered it .. I think the manager on duty was scared to even say hello but he went to every other table around us to ask how they were doing.  I will stick to Chimas for here on out.. please dont waste your money and plus the salad bar items was old and the bread they gave up was cold.. we spent $60 for nothing .  I would give them no stars if I could.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "MyQWB2CmVzTnrChEw_lLHw"
  },
  "332F9FdKHLzunaw2Rd2KzQ": {
    "date": "5/10/2016",
    "text": "Went to Brazz for a buddy's birthday.  I only had Chima to compare it to.  The salad bar/hot bar didn't come close to Chima's, but as everyone says, you're not going there for the salad or soups.  All the meats were good.  The sirloin was the best.  The gator, the worst.  I'm not a scallops fan, so saying they were bad wouldn't be fair.  Between here and Chima, I'd give the edge to Chima b/c the prices are basically the same, but you get more options at Chima, and it feels a bit more upscale.  Bottom line, you're looking at $60/per person night.  Would I go back, yes, if someone was paying for me.  Otherwise, I'd go to Chima.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4llocUmzxlU01-clKCeTsw"
  },
  "HqWYYfHNiU5e3EFrsOfl0A": {
    "date": "1/1/2016",
    "text": "Brazz was really disappointing. I was excited for the salad bar thinking it would be similar to Chima and Texas de Brazil. Instead it was worse than Ruby Tuesday. One of the dishes was a half piece of salami with a piece of cheese that looked like a Kraft single that was an inch by an inch. The service was slow and they never brought the chimichurri sauce or bread to our table. The decor is really out dated and just feels like a cheap chain restaurant.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "J2yA2I8Ax3dmmH-EJ9euyg"
  },
  "SjgTiBguwq2cfsa9I6kSLg": {
    "date": "2/14/2017",
    "text": "Big disappointment. Even though we used a Groupon, this place is overpriced and underwhelming. The decor is typical of an inexpensive Chinese restaurant. The setup is not much different from an all you can golden coral. Even though there are a variety of meats to choose from, they are all grossly overpriced, low quality, and dried out. If you must go, only select the salad bar buffet option and don't eat off the menu. At the buffet, all the items seem to be well prepared. Try the shrimp, salmon, and the tomato soup.  But bottom line, there must be better places to try the Brazilian style of dining.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HQGSmrd0bT16hDnEd1DJUg"
  },
  "T3XS5HUmdKC5-IZT0BO-_g": {
    "date": "2/3/2015",
    "text": "Horrible service - OK food - Small Selection Pay the extra couple of dollars and go to Chima.  I have never had worse customer service anywhere.   When my wife asked for well done meat several times, she was given medium rare cuts.  When I finally complained , the guy was rude and said \"Yes it is burnt\" when I asked him if this was well done.  When I asked my waitress if they were going to start serving meat again after I had waited 15 minutes since seeing the meat server; she said they have know you're out here and laughed.  I will not go to this place ever again ,with or without a Groupon.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Rg0VbvWcqkwdcezJGt4xMg"
  },
  "8yEjP2rHBM1Mk97yXOyolA": {
    "date": "4/29/2017",
    "text": "This was by far one of the worst restaurant experiences I've had in my life. My boyfriend and I went last night for a date, which quickly went down hill based on the horrible service and poor food quality. My biggest issue of the night was the fact that the waiter took our drink orders (wine, Pellegrino, and a cocktail) and it took over 30 minutes for me to get my drink in an empty restaurant. The waiter brought my boyfriend's cocktail to the table, but did not bring my wine or Pellegrino. After waiting 30 minutes (I know because I received a text when my BF got his drink, so I had a time to judge by) I walked to the bar to ask for my drinks. I found the waiter behind the bar laughing and joking with his friend. The waiter told me he \"forgot\" and brought my drinks about 10 minutes later, but brought the wrong wine. We also never received plates for the rodizio - this meant we couldn't have the meat we ordered. The carver actually brought out meat before we had plates, eventually realized our waiter wasn't bringing plates and brought them himself. After this fiasco, I asked to speak with the manager. The manager was rude and made it excessively clear that she didn't give a $#!% about our experience. I wasn't asking for anything from her other than to send our waiter to do his job. By the end of the meal we had to hunt down the waiter and ask for the bill, so we could leave this horrible establishment. The meat sucked - it was tough and very over seasoned. Also, the menu said that the rodizio comes with 10 different cuts of meat - it doesn't. We were offered the same meet 3-4 times, but there was almost no variety. I think in total we were offered 6 or 7 types of meat, but when the menu says 10, I expect 10. I've been to several Brazilian steakhouses before and this was by far the worst. Our meal cost us $140 for two people (only one round of drinks) and it was one of the worst meals of my life. Also, THEY DONT HAVE BATHROOMS INSIDE THE RESTAURANT, you have to go out into the hall of the building and use the public restrooms that service the entire building. Needless to say, I won't be back and I wouldn't recommend it to friends.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zjHOilJ7otI2DXaUrn993g"
  },
  "B_vGR_yPT-HptdbQXM1-Uw": {
    "date": "4/13/2016",
    "text": "I loved the atmosphere and the waitress I had was great. Their salad bar had a little bit of everything which I liked and even tried some alligator tonight.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZmNfQALymIuHj4_w2xs5Ng"
  },
  "yuRiDud8S-KdosRqb08ljQ": {
    "date": "5/24/2013",
    "text": "This review is specifically for their $11 lunch buffet.  I generally dislike buffets.  Unless they are fairly upscale (I had an excellent meal at The Biltmore, for instance), I generally find that the food lacks seasoning, certainly lacks freshness, and also lacks service.  When my husband suggested meeting at Brazz, I was reticent, but since I have not indulged his buffet cravings recently, I decided to give it a shot.  I was really quite pleasantly surprised.  Some of the items I especially enjoyed included the spice-crusted pork loin,  (they have a carving station that offers sirloin, pork loin, and turkey breast), top sirloin (found this to be very tender and juicy), the garlic mashed potatoes (I really like it when they are chunky, with some red skin in them), the hearts of palm salad, and the pasta salad.  Deviled eggs were a fun touch, since I never see them outside of a potluck, lol.    Service and table settings seemed on point with the elevated level of the buffet that they were going for.  Remember to get your parking validated!  I did not, and it ran me about 7 bucks.  :(",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "dsgCJFtZvPM19JniUitLuQ"
  },
  "26ivT5dVN_arvI3KQYWgGw": {
    "date": "4/17/2013",
    "text": "I'm giving Brazz four stars for its ~$11 All-You-Can-Eat Lunch!!   Sometimes you just need that in-between of a \"sit down\" lunch combined with convenience,  \"better\" quality food and great service at a price that won't force you to eat canned tuna the next day to make up for it ;)  Brazz takes on a different spin to the traditional Brazilian style carvery - it's similar to Fogo and Chima - but rather than having a green light, red light style service, at lunch, the restaurant lets you come up to the carving stations to have your perfectly standardized slices of meat cut before you. Sort of reminds you of the \"ham\" station at a buffet.   You get three choices of meat to choose from during lunch: 1) A deliciously fatty, medium-rare cut of sirloin 2) A lightly seasoned hunk of roasted turkey 3) A nicely spice-crusted pork loin  The sirloin is by far the best, followed by the Cumin-tasting pork. You can leave out the turkey. It's not too bad, but isn't nearly as juicy as the other two. Maybe the turkeys are leaner?  And you can just keep coming back for more. How awesome.  Along with these fine meats, is a robust salad bar. Not even close to the same quality as your more expensive Brazilian steakhouse counterparts, but you'll definitely be spoiled for choice. I always go for the cucumber and feta salad. Nice vinaigrette!   On the far side are your hot sides. These are also great, because they tend to be the more starchier foods that you would eat at Thanksgiving dinner like sweet potatoes, mashed potatoes, roasted veggies and such.  If you combine all of the above-mentioned goodies, you find yourself with a pretty ballin' lunch for $11 + tip! I would pay that any day.  There's also some slices of strawberry shortcake that you can have at the end - tastes ok, but it's kinda like the store-bought version.   I'll definitely keep coming back here. The waiting staff is super friendly and they keep their eyes peeled for dirty plates to replace as you get up for your fourth helping!!  Simple pleasures in life  4/5",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "rD6xc7qevQ7_dGzk4hkoHA"
  },
  "kjcVkctE3sZD3nAQBbIJYA": {
    "date": "2/28/2016",
    "text": "I was expecting more authentic Brazilian food when I went to Brazz. The warm salad bar in scarce, not to many options. The meat cuts are not that well done. The staff is very friendly and attentive. A recommendation for them would be to also include some authentic Brazilian dishes like yuca fries/steamed, also add the grilled pineapple. Conclusion is, the staff is very nice, the food is too blend.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O_U6mDH9xmj4QYKlRSfGjw"
  },
  "vIYhAkq-tNMStf8OeneFtw": {
    "date": "3/4/2014",
    "text": "We went to this place for my birthday, earlier this year.  Although none of the servers was actually from Brazil, this is a legit carvery! The previous reviews are correct, the salad bar is just regular.  However, their service was efficient & friendly, all the meat was very fresh & flavorful and dessert was excellent!  Recommend it!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nVqMleABE7N0veECwuM1kg"
  },
  "5xxOdSonpsUMrc8rP1J3ig": {
    "date": "11/3/2015",
    "text": "Very good food for lunch or dinner. plenty of large selections and the staff are great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xiTyrDUdGnvttFwB241SyQ"
  },
  "9Q2U0svJFfnDZjReBpoEiQ": {
    "date": "6/11/2013",
    "text": "I will give this place a 4, mainly for the lunch. The lunch buffet is excellent and the price is right. The protein options are excellent, cooked perfectly and full of flavor. We went on a Monday where they buffet option was indian and I was blown away by the flavor of the food. I would highly recommend this place for lunch.  I am back in Charlotte again this week and wanted to do lunch again but did not get to, but I did get to try this last night for dinner for the Rodizio and I would give it a 2.5 - 3 stars. When we went in, it was not very busy, a few people at the bar and two other tables. The waiter and the others who work there are very friendly and helpful, and asked the temp we like our meat and they did a good job with some meat temps but not good on others. The Sirloin was a little under cooked, ( asked for medium) but still very tasty. The alligator, being a little chewy had really nice flavor, as did the pork and chicken. The other beef options that we got ( they seemed to love parmesan as the flavor for the beef. After we got the first sirloin cooked close to temp, all the others were midwell to well done, the meat had a steamed flavor as it was bunched together and did not get a chance to crust the outside of the meet to give it a full flavor profile. If the meat would have come out Medium then I think it would have been fine, but being over cooked and the meat bunched together like this, it was not overly impressive.   It took a while for them to start brining the meat out and because the place was slow, they were slow at cooking the meat and bringing them around. As for the buffet section of the dinner, for items such as Calamari ( which was good) they did not cook much, so could not get a lot.  The other small issue we had was the Sangria ( it was amazingly good) they asked us of we wanted a glass or a pitcher, Staying at  a hotel down the street we opted for the pitcher and the two of us drank the entire pitcher. When we got the pitcher and glass, we could see the glass half full with red wine, maybe to give your first glass a little extra kick, and the mixed the fruit and wine in the pitcher in front of us. Again it was very good, but they did not tell us how much a pitcher cost. I twas $30. Which for the amount we drank the price is not terrible I dont think, I dont drink sangria much, but if we knew the pitcher was $30 we would have opted for another drink.  I dont know if/when I will be back to Charlotte, if I ever get the opportunity to Charlotte again, I definitely would come back for lunch, but not too sure about dinner. Maybe if it was a friday night or another night that the restaurant was busier.   Highly recommend for lunch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0sM8R-aFNx0jNfo47Y7hQ"
  },
  "yN-q29W_fQPZCLGAhrKkag": {
    "date": "1/28/2014",
    "text": "A-OK on Charlottes restaurant week: The food was very tasty, but not as good as it could be. Some of the choices of  meat were dry, where as others were not, maybe an off day! They do bring you a lot of meat and its not a long wait before another server comes with more meat for your plate!  I wouldn't say this place is very authentic and my impression is of an American-Style Brazilian-Spiced Restaurant.    I would go back and try something on their everyday menu and give this place another chance to show out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBXcUJV4j4VV7ZuOyxP8Yg"
  },
  "IBTXLW40LjbAFeZN3OLhVg": {
    "date": "9/24/2014",
    "text": "Absolutely NOT a Brazilian steakhouse. Do not be fooled! I have been here in two occasions and on both of them were completely disappointing. The owner is not even Brazilian and clearly has no idea what a Brazilian steakhouse is. The food itself is not terrible but it is served cold in a buffet style and the barbecued meat is brought only once and sliced wrong. As Brazilian and authentic gaucho myself I would never return and never call this place a Brazilian steakhouse.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "qiz4Ri_cMSsoH3ccN19eAw"
  },
  "4TjnLRWnrFYZpfE6QsuBcw": {
    "date": "6/24/2015",
    "text": "If you want to eat at a great Brazilian steakhouse this is the place for you. Better than Chima and a lot better experience. The chefs and waitresses are way more personable than Chima. Their salad bar is also comparable to Chima's but Brazz still has the edge over Chima with their themed nights. And don't let me forget. Their cinnamon roasted pineapple is like heaven on earth.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ms55GoeJGd6ijRblWYALTQ"
  },
  "DjhZbQMe1OPk-jzEzhkMIw": {
    "date": "7/18/2012",
    "text": "If I needed to describe my experience in 1 word, it would be scary.   I think it's important to point out the good points of a place before the bad, 1st,they validate your parking for the green lot, 2nd the cheese bread was good, but don't ask for more, you will never receive it   Now the bad, although my 1st bad point is above, when I asked for more of the only good thing offered, they never brought it. But let me go to the beginning. The salad bar is not vast and extensive as described. The hot items are luke warm (if your lucky) and the cold items are luke cold. Beware the Mayo based items, you don't want to get sick. The next bad thing is the meat. These people either have no idea what medium rare is, or they just don't care to give you what you request. On top of that, if you ask if the item is medium rare, the answer is always yes. The next bad item is that the meat was old and rancid. In particular, the lamb was AWFUL! I had to spit mine out, I needed to be at work the next day. It is also important to point out the place is dirty, look at the windowsill when you sit down.   When I asked to speak to a manager, she came over and when I explained my issues she looked at me like I should have known the food and service was bad. She clearly knows it is.   I think I am an intelligent person who should read the reviews on yelp and foresquare before going going somewhere, and i did. Shame on me for still going. But I had a groupon that expired today and I felt I should use it regardless of the reviews. I learned my lesson.   I also learned these are the same owners of brazzas on independence, which I believe closed and had awful reviews also.   I hope this review helps those thinking of going and they do not waste their money.   Note: the below questions ask \"good for?\" the answer is Noone!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLSCskAcd_1XravTm-QX2w"
  },
  "VTrXigztFBi_kj0y_--GJg": {
    "date": "1/24/2015",
    "text": "The waiter called my friend a \"chocolate bunny!\" I don't know what the hell he was thinking, but it was NOT cute and made for an extremely uncomfortable dinner. Poor service aside, the food was decent; I still prefer Chima (better atmosphere and service).",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "zx2mMtOoJTULgj2gTMiJZA"
  },
  "FEy2tMCmDkV-cgiZoCGd_Q": {
    "date": "7/2/2012",
    "text": "My wife and I dined and your restaurant this past Sunday, July 1st after purchasing a Groupon voucher.  After the experience, I will have to be honest, I wasn't that impressed.  My wife is not a red meat eater and the options of for chicken and fish varieties were disappointing at best.  The price was ABSOLUTELY A rip-off.  $25 for a salad bar buffet.  One of the owners did allow my wife to try some of the chicken & fish variety, but she enjoyed neither.  If I come back, it will only be for a SUPER special pricing.  I would NEVER pay regular price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 0
    },
    "photos": [],
    "user_id": "jODa1qtYw7AsrgAWosU-Jw"
  },
  "_ZBAYeIdT0ZcUOoC99yuTQ": {
    "date": "7/16/2012",
    "text": "I was not overly impressed with Brass Carvery. Yes, you do get to try a lot of different cuts of meat. And it is all you can eat. And there is an extensive salad bar and soup included in the price.  But what good is this when the meat you do receive is over cooked, over seasoned or full of tough, fatty areas?   For the price I would much rather go to a regular steakhouse where I can order exactly what I like. Brass will let you request more of a specific cut of meat, but as a first time visitor that does not know how the different cuts taste...  The restaurant is nicely designed, the decor is tasteful and the music is not overly loud. The park/green space right outside is great for spending time before or after eating, but in the end that is not why you came.  Overall the food isn't bad, but it isn't anything special either. There are better places to eat in Charlotte.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rAME7vQCOOL_yczYnv0HHw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Salad bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rAME7vQCOOL_yczYnv0HHw/o.jpg"
      },
      {
        "img_id": "BcCIyR1ivf0WVkABmCj3Mw",
        "caption": "Photo of Brazz Carvery &amp; Brazilian Steakhouse - Charlotte, NC, United States. Outside view",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BcCIyR1ivf0WVkABmCj3Mw/o.jpg"
      }
    ],
    "user_id": "8x-lBENayDizUL8wXlTyOg"
  },
  "lC-7UEkr6X2J0rYmlo-4Ig": {
    "date": "7/27/2014",
    "text": "So I was excited to try this place. I've never been to a Brazilian steak house and a group of us were looking for a fun restaurant during restaurant week and a few of our party had been here and gave great reviews. This however is not one of those great reviews....  Now the host staff was great. I made reservations a few days in advance for a party of 4 and the day of went from a party of 4 to 6 and they were more then accommodating even given that it was restaurant week and they were booked.   Another big star was the food! I've never had quite a dining experience like this! The chefs brought as much food as we could want to our table and everything was delicious! The sides they offered at the shared buffet were also hot and appetizing and kept fresh! Not sure how much it is when it's not restaurant week but we all got our money's worth!  Now the not so great..... As much as the food and hostess were well above par I will not be returning.   Our server Clinton made the experience annoying and unfulfilled. This being a fine dining experience I believe Clintons talents would be better served at a Waffle House. He was the worst sort of server. Showed up at the beginning and end of the meal only. He did not seem to enjoy his job at all. The drinks were brought by another server. Our plates were cleared by SA's. All extra adult beverages were ordered by a girl server (who largely took care of our party of 6). I don't know her name but she was beyond helpful stopping whenever we were looking around for Clinton. She even over heard our party singing a quiet Happy Birthday and without asking brought the birthday girl a candle lit dessert to celebrate. She was beyond amazing and having her as a server would have changed a large chunk of this review. When Clinton finally came over to explain desserts that are clearly displayed next to the buffet he was shocked and surprised to already see an empty Flan plate with no knowledge or care that there was a birthday at the table. Something he would have caught if he interacted with his guests in any way.   Now while my dismal service experience can be over looked with the attentiveness of the server who didn't get the added 18% grat on our 6 top this final chapter cannot be overlooked.   A young man who worked there stood at an opening on and off during the night and almost every time I saw him he was visibly eating. He mouth full munching on something. The he went as far as licking his fingers after!!! Multiple times! Then while licking his fingers brought us our boxes up desserts!! The level of health code violations were too much to handle! Just eww. Just glad no one got sick after eating there. Next time I'm sticking to Chima's I hear their better anyway.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "LXYJpQ6oFHagurJC-LM5qA"
  }
}