{
  "Cs_BkSMUYmoFy3xFOnoGbA": {
    "date": "4/20/2018",
    "text": "One of my favorite places to take the family for Sunday brunch the French Toast is amazing and won't disappoint! See Nick for top notch service and One of the best Bloody Mary's around!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgnyqpaR2VyG8g4NzzezVA"
  },
  "BrcxoK-obW0x_5NGA3sQNg": {
    "date": "8/3/2017",
    "text": "Overall the service is spectacular. If you wanted to be catered too, this is the place to be.  Food comes out pretty fast so if you want an enjoyable night wait to order the entree. The chef is still adjusting his recipes so it's not quite consistent yet but advice from the patrons goes a long way so say something. I had the shrimp and grits. It was amazing but packs the heat . The yeast rolls are to die for!  Take a chance on the meat of the day. Great cauliflower mash. Squash casserole wasn't memorable. Cucumber cooler was so refreshing!  You have to try this place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "32mKuGcYhdwtrB_SHnErZQ"
  },
  "SWqaRv1cPLYoAFgcvn-3rQ": {
    "date": "2/26/2018",
    "text": "First for safety reasons: be careful if you wear heels.  The floor is like an ice rink and I almost fell entering and leaving.  Had to tip toe. Secondly if you get chicken and waffles ask for sauce on side.  Mine was swimming in sauce and chicken was over cooked.  The Bloody Mary was good but I didn't like the fact that ice was the priority when making it.  The table next to us and us too had to ask for tea/water refills.   For $60 for 3 this just wasn't worth it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_uJ-s02qANFD9aq0WyLrg"
  },
  "yLDROhkbatUgQNialqUooQ": {
    "date": "10/9/2017",
    "text": "Ate here for the first time last week. Had an amazing experience! My waitress Amanda was so helpful and recommended the chicken pot pie. I recommend it to everyone as well! I will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7vsv_dK9JreY9Xm6X4VKiw"
  },
  "zeCookbn9bkq_SFQEGINSw": {
    "date": "9/10/2017",
    "text": "Drink menu is great, food great, but our service started poorly with being ignored at the hostess stand. Our appetizers came out before my cocktail which barely arrived before our meal. I ordered the ham & yam which was tasty but missing a key ingredient. I asked for it and since my husband nearly finished his meal before our waiter returned to tell me he couldn't find it...I just ate it. Our waiter never offered to make things right. I'd like to give this place another try but a little skeptical.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mttwOK0A2n1cP12E5yyI1w"
  },
  "Ke8QRoEgxk_f9ZPQaxWt5A": {
    "date": "8/9/2017",
    "text": "Dinner: I had the \"meat & 2\" which comes with a daily meat special or chefs choice. Special was pot roast, with good seasoning and it was very tender. My side picks were squash casserole and Brussel slaw (like southern coleslaw but less tangy and a little drier; uses Brussels sprouts instead of cabbage). The Brussel slaw was nice to try, made well and something creative on the menu but not sure I'll crave it. Squash was very good - creamy but not so much that you lose the veggies in the cheese and breading. I would get that again. My fiance had the pulled BBQ chicken sandwich with Brussel slaw and a side salad. Side salad is a generous portion. I tried a bite of her sandwich and it was pretty good. I would probably venture other places in Charlotte for BBQ but this isn't a bad sandwich. She requested extra BBQ sauce and that seemed to enhance the flavor a little bit. Drink selection was good and you can't go wrong with the oatmeal creme pies for dessert! One is big enough to share unless you are planning to fill up on dessert.  Service was great. Easy parking in the garage (attached). Decor/ambiance in the dining room was nice. We'll be back to eat on the front patio and try the bar area too! The only thing I could find as constructive criticism: the side dining area could have used dimmer lights for evening service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "otKipF_UBgjVHq6wMSj7Qg"
  },
  "SNAUYLD5HJdb9JIdAfua-A": {
    "date": "7/30/2017",
    "text": "This place is great. Awesome location with easy and free parking. The stuffed pepper with a side of Mac and cheese - side salad was excellent. We will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-EXcVk-gcUkFmM9J_Zd58w"
  },
  "iKf1Nd4FW2zUsBoysOkM6A": {
    "date": "8/28/2017",
    "text": "While browsing yelp the Packhouse caught my attention.  The menu looked good and I liked the theme of the restaurant.  It was Saturday night and I reluctantly chose to try something new rather than one of my always dependable restaurant choices. When we arrived at approximately 8pm my enthusiasm quickly diminished as soon as the hostess opened her mouth.  After the standard welcome, how many in your party, she stated that they were operating on a wait, and it may look odd that there is a wait with open tables, they overloaded the servers and the kitchen and needed to catch back up before seating anyone.  It will be a 35 min wait and asked if i wanted to wait.  Sure, ill go to the bar and have a drink, then  I got a confirmation text at 8:07 for the 35 min wait.  As I am ordering a drink, I get a text(8:12pm) that I am ready to be seated.  I start to get slightly annoyed since I was told it was a 35 min wait, they weren't seating anyone, to be told 5 mins later they are ready to seat me.  Off to the table we go.  After being seated for a while and having the complimentary bread and butter brought out, the waiter saw that I had drinks from the bar and seemed to lose interest in offering anything else. He took the wine glasses off of the table and disappeared for a while, never asking if we wanted an appetizer or had any questions. I had plenty of time to read the back of the menu and discuss before asking if we were ready to order.  Finally, at around 8:30 we get asked if we are ready to order.  I get the fried chicken and the lady got the burger.  The theme continues, we wait, and wait and wait.  At this point, its a little after 9 pm and still no food, at least 30 mins after ordering.  We did get more drinks while waiting, but at this point I want food.  The server walks by and sees us waiting and says hes sorry for the wait, and will go check with the manager to see what the hold up is and what can be done.  A few mins later, he appears with our food.  No other mention of what took so long or any apology from management.  The food is good, its what i expected but its certainly not worth the wait or the price.   When deciding if i want to go back, I always think if i could stop by for lunch and be in and out in a reasonable amount of time and I get zero confidence on the Packhouse being able to deliver in that area.    It seems like I am not alone in my opinion on the service or food based on the reviews.  I just didn't walk away with many positives or desires to go back and i likely wont.  I really wanted to like it, but this seems to be a case of mismanagement.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0cyB71Qdc1-pWm88RnNfzQ"
  },
  "dAfSmRGTWsGjuvIC40RQPg": {
    "date": "7/20/2017",
    "text": "This place is adorable! The \"southern tobacco field vibe\" is original and innovative. Our dinner service was slow but they have only been open for a few weeks so I understand. The oatmeal cookie dessert is to DIE FOR so if you have room, I HIGHLY recommend it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qlt6uc1jxCuih3VpHG3mpg"
  },
  "m7u1gYRuZlK8RmD87EL0Pg": {
    "date": "3/12/2018",
    "text": "I brought my family there for Sunday brunch. Both the Chicken & Waffles meal and French Toast meal were served in a pool of syrup- both plates had a puddle of syrup covering the entire plate that the French toast breakfast and waffles were 100% soggy and covered in syrup, both meals were awful.  The description for both meals should have read that maple syrup would be soaking the meal when served, rather than being served on the side like it should have been. Both entrees were literally dripping in syrup.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OlbS14FNS-oCIrza3g5wYQ"
  },
  "13WeQZj8lb2RPvm3byrR8A": {
    "date": "8/21/2017",
    "text": "Tonight was our third time visiting The Packhouse in the past month. We were visiting from MN and just had to come back.  This time we tried dinner for the first time and we sat outside.  I cannot rave about this place enough. The staff is always so kind and always accommodating.  They know the menu well and always have recommendations.  The patio i loved!  Beautiful rocking chairs and picnic tables and it is dog friendly. The bread and butter is mouth watering. This was my second time ordering the special which was ribs. The meat just falls off the bone and is so tender. My spouse got the pork shoulder and it was just amazing. So moist and the pepper gravy on top just got the spot.  I can't wait for a our next trip from Charlotte to come back and eat here again.  Katie was our waitress and she was absolutely spectacular. Alex is awesome as well. He was our first waiter we had our first time at The Packhouse.  If your looking for a good place to eat seriously go here!  You won't be disappointed.  Also get yourself a creme pie they too are amazing.  Thanks again to everyone at the packhouse for another amazing meal and time while visiting.   Nicky",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "S_Fx5TDKEfnf24Pu6_IToA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/S_Fx5TDKEfnf24Pu6_IToA/o.jpg"
      }
    ],
    "user_id": "tVZ0Vqj6vFE2eHAeNQ9_dw"
  },
  "VaJ5OfJpmlI5yksobeyxdg": {
    "date": "2/25/2018",
    "text": "Horrrible service. Still tipped 20% because that is me. But really bad service. Who puts a clean spoon directly on a table?!  Very sub par food. Grits dry, breakfast potatoes just frozen out of a bag. Bad coffee. Very disappointed especially since we are huge fans of sister concept Josh and Nosh. Save time and go there. Packhouse should pack it up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mLlSeHVPq4JhK18229hfCg"
  },
  "kOpwYJbI2ESv-VQPPx_T3Q": {
    "date": "11/9/2017",
    "text": "This was my first visit to the Packhouse and I'll definitely be back. My friends and I had a variety of food--a meat-based casserole, a veggie plate, a salad with a grilled filet of fish...all very good, fresh, well-seasoned, lovingly presented. And affordable. The staff was friendly, smart and accommodating; we didn't like the first table they  offered us, and they were very kind about re-seating us at a great table. Looking forward to my next visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iR7CYJS4NS1hk_RU-ErvJQ"
  },
  "ceGqFNf2kKI66c0Hs2P3NQ": {
    "date": "8/8/2017",
    "text": "Only been once, by we had an amazing time.  We sat outside in the rocking chairs for drinks so I can speak for the food (except desert, which we did get).  The drinks are great and the staff was so nice.  Service was prompt with a moderately busy restaurant.  The pie of the day was lemon chess and the cake was red velvet.  We got both.  I've had a thousand red velvet cakes in my life and this one was easily the best. I can't wait to go back. Best place within walking distance of our house.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hroKyUPgVoDacHyQ-vqfdA"
  },
  "IZWyb5XbHHauS1Ii94uJ2w": {
    "date": "7/11/2017",
    "text": "Just want to start by saying that I am the first person to review this restaurant and I am truly honored. Let's start with the atmosphere. Even though it is a new restaurant, the place was poppin. Very rustic decor, yet very chic. I felt like I was at one of those farmhouse weddings. Almost everything was made of wood and it felt very cozy but also sophisticated. Great drink selection, however I can't say if the drinks were any good due to the fact I am underage. However members of my party highly recommend the gin and tonic. Two more would have gotten the job done that's for sure. Now let's move onto the food: the pre-dinner rolls were very tasty, almost a little sweet, and were a hit with the table. All of the food was delicious as well. Many people at my table got the fried chicken and collared mac and cheese and thought it was scrumptious. The burger was also great, as were the stuffed bell pepper and strawberry spinach salad. I think everyone in the party ate every bit of their meal. That being said, the portions could have been a little bigger. I left the meal feeling satisfied but the servings were a bit small, especially for Southern food. Overall, though, the food was amazing. Lastly, our waiter was very friendly and made jokes throughout the night. Most were funny except for the one about colored people. Haha I guess? Anyway, great restaurant and I will definitely be back here!! Just what the Dilworth area needed!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rgxs1rv2UH-XzdP6HL6-XQ"
  },
  "Jis0bsVx7GltIfDDmDo9HA": {
    "date": "7/14/2017",
    "text": "Complete disappointment.  Voicemail states the hours then does not specify that they only serve apps from 4-5.  We were seated and ordered THEN we're told after the waiter left and came back 5-10 minutes later that what we ordered we could not have bc the kitchen was switching to dinner service.....the items we ordered were on the lunch and dinner menu by the way...asked for the delicious sounding bread they brag about on the menu......never came, asked twice and never got it, was told \"It's free anyway\" lol. Server was nowhere to be found most of the time, we had two separate different servers refill our drinks.  When I mentioned that no one informed us about the inability to order food the reaction was one of \"oh well\" ..... rude to keep it short.  Horrible first impression and I am in the service industry and completely understand that in the beginning it's rough BUT there is no excuse for rude, inattentive servers and staff.  This is upper management and ownerships responsibility especially this early in operation.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dAiFpN4JZ1iHtFzXT6TLrA"
  },
  "tSJYNTTJJf5aEUT2_c7FmA": {
    "date": "6/14/2018",
    "text": "Worst food experience I have had in a long time. I started off with an order of the fried veggies, which I waited on for a good twenty five minutes. Once they arrived to my table they were awful looking and almost burnt! I have heard and seen the bad reviews but I wanted to give them a try anyway, bad mistake on my end. I also ordered the tomato pie because it was highly suggested to me but that was a huge miss! The top layer which consisted of cheese and crust was BURNT and the inside was cold and greasy! I would be very embarrassed if I was the owner of The Packhouse, enough that I would make a lot of changes! The restaurant was so empty and gloomy feeling that I did not feel comfortable staying for my entree. They clearly have it all wrong at this establishment. Maybe better management should be a huge focus for this restaurant because I do not see how they are still open. A disappointment to South End!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2W-6mrCbatnV1fmx5eNOqw"
  },
  "ozHXb0TmdC1t8ki0N-zj8A": {
    "date": "5/8/2018",
    "text": "We have been wanting to try this place since it opened and finally went Saturday evening.  We sat on the patio and had some delicious cocktails.  We eventually went in and sat at a table for dinner.  The chicken and waffle appetizer was delicious.  For entrees we ordered the shrimp and grits and the steak.  Everything was delicious except for that the cook could not get my steak right.  They tried three times to achieve medium rare but just couldn't get it right.  Fortunately, for me our waitress who was fabulous was more upset about it than I was.  She would take it back to the kitchen even before I had the opportunity to complain.  The manager stopped by and was so apologetic and gave us a gift card to come back.  Even though I would probably never order the steak again, we will definitely be back for the ambience, the drinks, the other yummy food, but most of all for the EXCELLENT customer service that is so rare to find these days.  Well done Trey!  Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6eL7PJm1bGtTYxEdk_gvQ"
  },
  "jkehUOks0uCIPqd_jNpfHw": {
    "date": "10/2/2017",
    "text": "My wife and I have been here twice over the past two months, once with friends and once with family visiting from out of town. I know that The Packhouse is still relatively new, so I understand that they may be working some kinks out, but we experienced friendly and timely service on both visits, much better than what has been reflected on these reviews. We were seated and greeted quickly (both visits were on busier Saturday nights) and received our drinks and meals within reasonable time periods. I found the staff to be personable and friendly. In fact, the waitress on the second visit gave us the name of a hostess at Fahrenheit to help us get a good table and to check out the views of downtown with my family after we finished our meal. On both visits my wife and I ordered cocktails - I'm partial to bourbon and they make a good Old Fashion (they use the large ice cubes which is a nice touch).  I found the food to stay True to it's southern style theme. My wife loves the fried green tomatoes (the goat cheese balances well with the sweeter pepper jelly) and I thought the dixie picnic basket was a cool way to present a shareable appetizer, however I think some of the portions were a little small. For the entrees, on one visit I went with your standard pulled pork, my preference to judge a southern restaurant. Overall it was good - the bread was fresh and the slaw was a nice complement to pork that was both flavorful and wasn't dried out. On my other visit, I had the shrimp and grits and this entree was fantastic. I like my food a little spicy and these had a nice kick. I would definitely order it again. We ended our meal, as anyone should, with dessert - we had the oatmeal cream pie and it definitely reminded me of my childhood and in my opinion is a must to conclude your meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UmQRJBK0GtvEOU3dkYsfaw"
  },
  "OuYnkPqNbks091YNYKuUqA": {
    "date": "7/15/2017",
    "text": "The decor and idea of recreating a packhouse is cool, but this place needs to focus on the basics if they want to stay around. The hostess was the most attentive and professional person working. She's the one who refilled our water although we were our server's only table. He never gave his name. There were a total of 4 tables when we arrived. 1 server was walking through the restaurant drinking his coffee & chatting with other employees. I ordered the chicken basket & the tenders were over cooked. Our food took a bit to come out considering the small amount of diners in the restaurant. Our server said, \"I don't know what's taking the food so long\". I just expect better for a new restaurant and $33 for a lunch for 2. The oatmeal cream pie was PHENOMENAL though & is the only reason that I would give this place another chance. I would suggest the servers spend some time at the owner's other restaurant, The Mayo Bird, and learn about attentive service.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1Xi4jVfrXy4H-G4WTsvQOQ"
  },
  "4qdvU_69BU85joizuTeNPg": {
    "date": "10/20/2018",
    "text": "Amazing spot for brunch. The food is outstanding although somewhat limited on options, this is because the menu is very chef/culturally driven. Super friendly staff. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-tJ8LifMWRtJXJnIbMM3sQ"
  },
  "u50d8ABn5h2r3Qkg81fRCQ": {
    "date": "2/20/2018",
    "text": "We were easily able to make a brunch reservation on a Sunday! The food was good and reasonably priced. I had the Southern Breakfast with eggs, toast, home fries and bacon for $13 and had no complaints. The french toast and the chicken and waffles looked fantastic! They have lots of seasonal items and $5 mimosas. Not the best brunch spot in town but I'd go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cqbj1nmZG7NBsSDF2rojLQ"
  },
  "aY4DXqeL0l9R4yFjs4v9sw": {
    "date": "8/12/2017",
    "text": "Inaccurate wait time and my drink was priced like I was in NY...and they got it wrong...seriously how hard is a neat whiskey. You just pour it. Lol  Oh well.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgFqF4i6r-MvNWHHccKYbQ"
  },
  "iTrmtLEvW2oqsNwc9DvKBw": {
    "date": "1/27/2018",
    "text": "Food and cocktails were great but I don't see why they make the staff wear hard wooden bowties. Seems kinda disrespectful to me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWb7P7Fa71mONKHkH-xjjQ"
  },
  "4qqld6kPjNfrCBdHFQBrGw": {
    "date": "11/19/2017",
    "text": "The food was very mediocre. I wanted to like it, the southern vibe and concept is neat but the food just was t great.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "El8rbjuKI-aA95lek8Qc1Q"
  },
  "NVmxdE53yv1a4Op2YkynHg": {
    "date": "8/17/2018",
    "text": "Great food! I've never been letdown. The bar manager is great, as well as all of the bartenders. Try the managers special \"fig\" flavored whiskey! They did have a seafood pasta that was AMAZING, but the shrimp & grits and fried chicken are awesome as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "egekwlGXPxTFwxO-dHtC-Q"
  },
  "uynQ4o50C7nMCE8xb-rcVg": {
    "date": "5/12/2018",
    "text": "Went to The Packhouse tonight for the second time and received what was by far the worst service of any restaurant I have ever been to. The only reason I'm giving two stars is because the food here is phenomenal. We arrived right on time for our reservation and we were seated by the hostess. We waited for 15 minutes before someone came to fill our water glasses. This person had to go get our waitress for us. When she finally came to our table, she never took our drink order. All she said was \"let me know if you need anything\". I then said we were ready to order appetizers. We weren't able to order drinks until she brought our appetizers and I asked for a tea. This went on the entire meal. No refills unless requested, had to ask to order our food and so on. I noticed that other tables around us were having the same issues with this particular server. Very disappointed. Will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfbP0AkGrrRbD4JHNwxAcg"
  },
  "08oXs4XD6IwbSNbPWJwPww": {
    "date": "7/29/2018",
    "text": "Had a great meal and a very cool setting near uptown Charlotte. Service was fantastic prices were very reasonable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mk4o7Kc2j-Z9Vd6bnTalCg"
  },
  "y8Qx4k57wqKowC1X81Az8A": {
    "date": "7/22/2018",
    "text": "Went for brunch and had the southern breakfast. Potatoes were a little overdone but nothing to send back or not return. Service was great, $5 mimosas.  Waffle was also super tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mp5LaPykvX7moaSnBQ9e0A"
  },
  "H7LZMpRtHIcBr0IHQJ0_Vg": {
    "date": "7/21/2018",
    "text": "Thanks , Trey , for a delightful anniversary lunch.  The chicken brined in tea was so tasty, eggs Benedict superb and bruschetta will make us come back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXDCrNHfoAa5J8yG2NGFVQ"
  },
  "qmnOPSq42Z7Jubakka10Gg": {
    "date": "1/12/2019",
    "text": "I had went to The Packhouse for the first time they appeared closed. I walked in with my fiance and it took about five minutes to be seated because the host and servers were in the kitchen. So they came and seated us and got our drinks. I took us nearly 30 minutes to get our food. Yo remind you it was only one table there besides us that should've been the red flag especially on a Friday night. I had received my meal which I ordered a steak medium, the steak was cooked well done with no seasoning it tasted very plane. The steak was served with potatoes, mushrooms, and a red wine sauce. Do to say the red potatoes were very burnt and hard and the sauce tasted disgusting. My fiance ordered the shrimp and grits and it was really like soup she also said the shrimp was a little under. All the food we received was horrible I guess they were having a bad day or something. The food took forever to come and it wasn't even hot when we received it that's the bad thing. I wouldn't recommend this restaurant to anyone I know because of the pour service and pour food. I should've chosen another place when I realized that they had no guest on a Friday night in uptown Charlotte.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXf9KtLI1yWB8W08yAmPHA"
  },
  "XXiZXq_wKGNxuUv58UKcNQ": {
    "date": "4/21/2018",
    "text": "By far one of the best places in charlotte for the southern food that everyone loves. To start the decor is beyond amazing! As soon as I walked in I was immediately treated by the host graciously opening the door for me. There were 6 of us and we did not have a reservation however she directed us to the bar which is the most beautiful room in the restaurant to have a cocktail for a few minutes while she got our table ready! They were busy however the service was right on point. I had the blackberry French 75 which had a little prosecco  in it to get me going and put a smile right on my face!! It has fun but do not be scared if your not a fan the blackberry's give the drink the taste! Casey awesome job!!! Once we sat for dinner we had a very large comfortable booth that had a great view of the city sky line! The doors were open to the patio  which just added to the ambiance as you could see the fire pits as well! The bruschetta is a must have!!! A little goat cheese spread on a cristini with prosciutto and a sweet delicious pepper jelly sauce that made the whole set up! Right on you guys! Next I had the salmon which was pared with a delicious coconut rice and spring veggies hat were perfectly seared. Normally salmon is over cooked and dry but this truly was right on point. Last but not least the ICE CREAM DREAM CAKE!!! No one should leave without trying this!!! The server mentioned to save room for this at the end and so thankfully we did!!! It's layers of ice cream cake and chocolate chip ice cream and the a perfect amount of whip cream on top!! Lastly drizzled Heath bar and chocolate sauce!!! Holy cow perfect !!! The Packhouse has it all! Service, food, and a comfortable place to be to enjoy your time with friends and family! Thanks for the experience I will be back especially to sit next to the fire pit in the rocking chairs to have hat dessert again!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ID4jhLXtPgGBuv1ewQnSHg"
  },
  "WWMRm0JVPRWZYFKaLfuddg": {
    "date": "7/10/2017",
    "text": "Not a good first impression attempting to dine at the bar. I asked the server about the \"Rabbit Plate - choice of 3 sides\" which is a menu item just above the restaurant's side items which range from $3 to $6. I asked if there was a a special price for the Rabbit Plate or if the price is based on the prices of the individual sides, since the price of the Rabbit Plate was not on the menu. She then went to the register to look it up and turned around and said \"it's the same thing, $12.99.\"  For clarification I asked \"oh, so it's $12.99 no matter which 3 I choose?\"  She responded, \"I told you it was $12.99, she said something to another server and then said\"I told him it was $12.99.\"  I then sat at the bar for ten minutes and the server refused to make eye contact and my order was never taken. It was not busy and people on both sides of me were asked they needed anything.  When it became clear that I wasn't going to be served, I got up and left.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "A9yuzu1FAjf5l-tOEhDPZg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The tobacco leaf bar was pretty cool.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/A9yuzu1FAjf5l-tOEhDPZg/o.jpg"
      }
    ],
    "user_id": "6QtBOZMXHUurbev82nUcOg"
  },
  "XEtdnRkSi7h6S-evOzKdcw": {
    "date": "6/27/2018",
    "text": "Nice decor. Very nice ambience. Wait staff extremely friendly. Visited for brunch with my daughter. Light crowd, but there are a ton of new restaurants in Charlotte. My daughter loved her eggs and bacon. The chicken and waffles were good, but I wish I could say they were great. Leroy Fox's were much better. I have a close friend in the restaurant business so I know how tough it can be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b3TN3rxCAYJXbith8Tuwtg"
  },
  "eeIGywqN7e0MJN4bryKtCw": {
    "date": "10/4/2017",
    "text": "I really wanted to like it....  I really like Packhouse's sister restaurant, The Summit Room.  So my hopes were high for The Packhouse.    The atmosphere is really cool with a rustic modern sort of vibe.  I love the seamlessness of the transition between indoor and outdoor.   We ordered three drinks, none of which were good.  Two of them were overly sweet.  One had loose rosemary leaves in it which will get in your mouth if you don't use the straw.  That's just bad drink execution.    Started with the fried green tomatoes.  Very nice.   The burger was pretty good. The brussel slaw that we got with it was devoid of flavor.  The watermelon salad was so so.  The fried chicken was cooked nicely and flavorful.  But the chicken must have been a runt as there was a lot of bone and very little meat.  The pasta that came with it was forgettable. The succotash was decent.   After waiting for our bill we had to go ask for it.  A couple at the next table over got up and left after waiting for 40 minutes to order.  The service needs work.    Overall I wouldn't call it bad.  But it was just ok.  This place is still new and has a few kinks to workout.  Perhaps it will improve over time.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjTG24J-UT3vs2fuwTJ9vw"
  },
  "63xw7PYdIaiFSF7M_M4XKw": {
    "date": "7/12/2017",
    "text": "THIS PLACE IS INCREDIBLE OMG!!! Oh what's that? You like shrimp and grits? Well look no further because THIS is your place! The bar has cool tobacco leaves on it and there is also a sweet North Carolina flag (gotta love the hometown support). If you don't like shrimp and grits then get the pork shoulder and you will be delighted at the symphony of flavors playing in your mouth as you munch down on this delightful piece of culinary excellence. Go eat here and you can thank me later",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "9YDMUKG5_dkJK-rJGC2MXQ"
  },
  "L7vMhuxbDGH3uUld84QFqA": {
    "date": "7/14/2017",
    "text": "I came in last night (7/13/17) with some friends for dinner, I like the concept and see some good things in the works but there is a lot of kinks they need to work out.  We ordered the pick nick basket as a starter - the items were all good but at $14 its not worth it, serving sizes are too small.  Here is feedback on each of the mail courses we ordered: 1) Shrimp and Grits - AMAZING flavor.  I would come back for these.  The presentation wasn't great.  They come in a crock, which is cute, but that crock needs to be on a plate. There isn't anywhere to rest your cutlery if you want to set it down.  2) Braised Pork Shoulder - Good - a little dry for braising, could be tweaked a bit and be a great. The cauliflower mash and gravy were excellent and the green beans were tasty (some at my table thought they were too salty, but there were perfect for me) 3) Stuffed pepper - very tasty but the portion size was way too small.  Looked sad and lonely on the plate.  You only get half the pepper stuffed.  They need to serve both halves!  4) Bone in pork chop (was on special) - way over cooked and the result was that it was dry and tough. Worst sin when cooking pork. 5) Ordered the oatmeal cream cookie to share as dessert - very good.  Not mind blowing but good!  Service - very slow, took 20+ minutes to get a drink served.  Our main server was nice but did not seem confident or knowledgeable, kind of like didn't know if he wanted to be there or not.   I will wait a few weeks for them to sort out some of this and then give them another try.  Will update my review and star rating if there is an improvement!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "jyhFIDkB7uJWfH6NOZriLA"
  },
  "eASLEhCtW30YBlNrfn6U1A": {
    "date": "6/17/2018",
    "text": "Best chicken and waffles I've ever had in my life. Service was great, we sat outside and had our waters refilled probably like 10 times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8KlnHBeVnr7A1axw4oq7A"
  },
  "_2gsy4Yuharsul8KAGMJ3A": {
    "date": "8/14/2017",
    "text": "The tomato pie and pimento sandwich were so delicious!! I am not sure why the reviews for the place are so low but I had excellent service from the wait staff--he recommended really yummy lunch options and we didn't even have to ask for refills when our drinks were getting low, he brought it to us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "NCEpy7D-9LLkPr1dL7zSbg"
  },
  "8Hl6s41X90Vh96Xfhkp6tA": {
    "date": "9/6/2017",
    "text": "Dee Dee Mills has out done herself again.  The personal touch of everything she lives as a child along with a stuff pepper that is out of this world made my night.  Please don't forget the cinnamon bun cheese cake...ridiculously good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPKkFPHjQ4R6jGRh1n35Cw"
  },
  "TAxtcdCgTjf6r9j6TKSxUw": {
    "date": "7/24/2018",
    "text": "This place is excellent! Came in with a large group of 18. We tried basically the entire menu and everything was hands down amazing. The staff was friendly, and the service was great. The Mac and cheese is out of this world!!! OUT OF THIS WORLD. I had the salmon salad. Perfectly cooked. PERFECTLY and the dressing was amazing home made and no dairy. Everyone was very happy with their food and drink choices. 10/10 would come back here time and time again. Oh and the atmosphere- the bathroom was even gorgeous. Round of applause for the owners and the chef. One of the best meals this year.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jssGt3rjYXBMiW_iV4ipQw"
  },
  "hMiMn0Kr10e9TytNpuPs1g": {
    "date": "7/21/2017",
    "text": "Love this place and the decor. Not sure how or why the ratings are not higher. Only open 2 weeks but I think it's going to be an awesome place to eat and hang out. Very fresh and delicious food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "n5URouOVQfzv0ttIhYPmnw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n5URouOVQfzv0ttIhYPmnw/o.jpg"
      },
      {
        "img_id": "y4o8yZFzRRKXbu5_onaooQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/y4o8yZFzRRKXbu5_onaooQ/o.jpg"
      }
    ],
    "user_id": "ah1CKPgZLO18US9StIg6Gg"
  },
  "cpJWw7Jb5xzFl5MIBC16ZQ": {
    "date": "8/18/2018",
    "text": "Really impressed! Came here for brunch when it first opened and wasn't blown away. Came back for dinner tonight and had wonderful service from Cesar. Such a nice guy! Had the hush puppies, steak flatbread and burger. Hush puppies were a little oily, flatbread was a little bland, but the burger was INCREDIBLE. Everything went together perfectly. Just delicious. Would recommend! Ask for Cesar :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-iercfaFg8Wc3XZfSKmTw"
  },
  "vd9x5euVqQDzO3JAr07RgQ": {
    "date": "7/13/2017",
    "text": "Stopped by for the first time for lunch today and was super impressed! This place knows how to do it. Our server, Brittany, was ridiculously nice, speedy, and gave great recommendations. We opted for some Carolina Cheer cocktails (mmm), the Dixie picnic basket (yum), shrimp po boy (double yum), herb roasted turkey sandwich (triple yum), and fried chicken basket (out of this world yum). Everything lived up to our expectations!  The restaurant also has great decor, based around tobacco, of course (Packhouse ... get it? :)  If you don't have room for dessert, be sure to get an oatmeal cream pie to go!   5/5 from my crew!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HDTdbkDa20nldH3-ks2muw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Carolina Cheer",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HDTdbkDa20nldH3-ks2muw/o.jpg"
      },
      {
        "img_id": "Q8c0-jlIQ8jIUNhm_u7k3g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Q8c0-jlIQ8jIUNhm_u7k3g/o.jpg"
      },
      {
        "img_id": "22zUsnpK_QvRJfA_TFTGMg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/22zUsnpK_QvRJfA_TFTGMg/o.jpg"
      }
    ],
    "user_id": "3KKGSj3uahcMNf-yzx9grw"
  },
  "3BRIj0hAiKn7TtJmP16B5g": {
    "date": "2/24/2018",
    "text": "I love this place. I take everyone visiting there. The fried chicken is beyond good. Everyone I have had visit with me loves it. Ribs were tasty but don't fall off the bone. Surf was good but I am not a turf person. Cocktails   and love the rocking chairs by the fire outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0WT_feRpdav6M5no-4MqZQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0WT_feRpdav6M5no-4MqZQ/o.jpg"
      },
      {
        "img_id": "Sgw7PEyOlvnRWI8y9LU0cA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Sgw7PEyOlvnRWI8y9LU0cA/o.jpg"
      },
      {
        "img_id": "Fp98rwKVtgPh2_RAYg1AbA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fp98rwKVtgPh2_RAYg1AbA/o.jpg"
      }
    ],
    "user_id": "m62APm7P1cmcibpv9XRTNg"
  },
  "OFPUOqAMDF_fNSEiQaCljw": {
    "date": "9/9/2018",
    "text": "So... We went to Packhouse with the intention of being blown away by the food. The website was impressive.  Unfortunately that wasn't the case. Upon arrival, we were very impressed with the decor and cool atmosphere. The staff was excellent . But for a Saturday night it was not busy which was surprising. We sat, 6 of us, ordered deviled eggs ( no flavor) hush puppies, excellent, shrimp sliders. Pretty decent. . My wife got the filet with asparagus ( pic attached )  the most expensive thing on the menu. Had no flavor either and the 3 asparagus which was the side dish we're shriveled and cooked beyond recognition. 3 of us got the chicken. Over cooked,  shriveled up, very salty. , all in all disappointing. It's too bad because this place has alot of promise but the kitchen needs to up their game and watch what's going out of their kitchen.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6LFsR84ckg_7exeIcnY6Kg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6LFsR84ckg_7exeIcnY6Kg/o.jpg"
      }
    ],
    "user_id": "xxDGk6BjGS1WwUf0EeSNGQ"
  },
  "o4-gisD-1_YH0FIv1bB1kw": {
    "date": "3/8/2018",
    "text": "We went to brunch here last Sunday with a group of girls. The food was really good (definitely recommend the ham & yam, and the breakfast sandwich!). The service was a little slow & was disappointed they were out of Triscuits so we couldn't try the Packhouse Supper Club Dip. Very easy to access and the parking on site is fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "j-uHPtMVcEm52rr7jBUG5g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The Packhouse Breakfast Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/j-uHPtMVcEm52rr7jBUG5g/o.jpg"
      }
    ],
    "user_id": "H7B2_k6AcPI3i7JT0uHsbA"
  },
  "YtY-zAbqdReIdLZN7nkXpg": {
    "date": "6/29/2018",
    "text": "5 star service. They always get the door, work hard to make your drink how you want it and awesome rocking chairs outside!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQYshw3N4iP6mUNrZvjuIw"
  },
  "DBYiFrCLFZkMvFwC8AJ9nQ": {
    "date": "9/1/2018",
    "text": "We truly enjoyed our dinner here. The decor is old tobacco barn tools/baskets. The meals are delicious and served on charming old china or in Corningware. We had the shrimp sliders (amazing!), hush puppies, chicken bacon ranch casserole, the burger, chicken and waffles, and the tomato pie. All were very good. There are also TVs in the bar if you're wanting to watch a game.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hNFbT3jn-T6Nl8wsxZPgRw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hNFbT3jn-T6Nl8wsxZPgRw/o.jpg"
      }
    ],
    "user_id": "py4C4y_QgLczJGEXW4F3Cw"
  },
  "xeoU5j3WoXi_6Bp-P1x3Ag": {
    "date": "6/21/2018",
    "text": "I come here for the rocking chairs and it never disappoints. I have a glass of wine and just relax after a long day. I highly recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1w8_BuG93ROZ1MOHeohX1g"
  },
  "P2P6ntbjx_3sPs7n_Djhaw": {
    "date": "6/8/2018",
    "text": "Enjoyed a nice dinner in this open air restaurant. Inventive cocktails were on special for $7 and they had some interesting wines by the glass. Nice selection of small plates. Server was very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TI2A-iXJSSwmUY-3u3dOVQ"
  },
  "7p9aXMlKpChQq-AcK_x_ug": {
    "date": "4/5/2018",
    "text": "My friend and I visited The Packhouse one weeknight for dinner and drinks. The food was good/ waiting service was pretty sub-par, and the \"bang for your buck\" was a little off-base. Cool place, and good food, maybe just not my cup of tea when it comes to price vs value.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nOuMbeRARNH3tPtsCnQECQ"
  },
  "G-mtUmgiuTbi5XfEku-Hxw": {
    "date": "3/23/2018",
    "text": "Arrived around 645pm Friday evening, plenty of seats. Filled up around 8pm, lights lowered nice ambiance. Isaiah was great, attentive, respectful with good recommendations. Had the shrimp and grits, kind of a first timer, but they were great and flavorful! Will be back. Thanks Isaiah!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M_wjPLcIY2LcCLMLLwT7Og"
  },
  "FrF4zm1W9H4di7zRdXbNww": {
    "date": "1/3/2018",
    "text": "The service is great. We had a group of 19 at brunch and Princess did a wonderful job. She was friendly and made she all of our questions were answered. The cocktails were awesome! My boyfriend had the chicken and rice appetizer and he said it was pretty good, I loved it though. I had the eggs Benedict. I am very picky that the eggs need to be hard poached and restaurants only get it right 1of 5 times. They were great! I don't really care for ham, but I enjoyed the ham that came with it. My friend ordered 2 eggs whites only. It was a huge helping and they were very fluffy. The portions were good all around. Looking forward to going back for dinner! Two couples that came with us have tried dinner and they said it was good and they shared everything. Oh, they have a parking garage, yay!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "spMO5ZLFLAsZnXXu9P9e4g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/spMO5ZLFLAsZnXXu9P9e4g/o.jpg"
      },
      {
        "img_id": "mOHoVTJzeejVE2RZA3hSIQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The picture doesn&amp;#39;t do it justice. Delicious cocktail, Country Thyme. Great if you like thyme and not too sweet.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mOHoVTJzeejVE2RZA3hSIQ/o.jpg"
      },
      {
        "img_id": "3T5-rQol5K3b3Lsm3574zA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Chicken and rice special, with a chicken finger garnish drizzled with ranch! Yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3T5-rQol5K3b3Lsm3574zA/o.jpg"
      }
    ],
    "user_id": "ZL-hFOZzn0vJVoFGsbz68A"
  },
  "89hH_MDTYs-OJ8n4NEkLcA": {
    "date": "11/4/2018",
    "text": "First trip to the Packhouse today. As an Eastern NC kid I can attest to the authenticity of the atmosphere, food and even the dishes. Heck, even the faucets in the bathroom remind me of home and a time when Life was simpler.  All that said, we visited for brunch prior to the Panthers game and it was a little chaotic. After a couple of table snafus outside we got seated with some drink specials and blankets.  The food took awhile after getting lost in the kitchen but the manager and server owned it and made amends.  The food was truly fantastic which included eggs Benedict, kale and squash salad, and the (in)famous chicken and waffle.   Even with the  delays we still made the game and hopefully a Panther victory.  We'll definitely be back to the Packhouse, but next time for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8F4ZkxrY0IsOZHn6T9BD-w"
  },
  "-OZbuupt2G1S0CsbOKQdfQ": {
    "date": "12/21/2017",
    "text": "This place is fabulous. My friend and I went on a Wednesday for 1/2 price bottles of wine and dinner.   We ordered the stuffed peppers and chicken bacon ranch casserole to share and everything was amazing from start to finish! I got a caesar salad and she got the Packhouse salad to start and they were both delicious...the grilled romaine in my caesar was just perfect. The stuffed peppers came with two and the chicken bacon ranch casserole was topped with two big fried chicken tenders. We noticed how everything came out super hot and was super fresh. The potatoes au gratin were perfect as well.   We each got a slice of the peppermint cheesecake and it was to die for, and we ended up making a delicious pairing with the Cava we were drinking (highly recommend the two together).  The service was just as wonderful, with our wine glasses constantly being filled. The manager was very nice and definitely made our visit as enjoyable as possible. This is going to become a new go-to spot and we can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8nSjkbcF5uRBz6HPA4_qeQ"
  },
  "Y9IAGv8beG_U4L7a25N-Cg": {
    "date": "7/15/2017",
    "text": "We wanted to try this place out since it is new. The inside decor is really cool and has an interesting story behind it. Unfortunately, I failed to listen to what others had posted in their reviews. Our waiter was not very attentive. He disappeared for long periods of time and never offered to refill our empty water glasses. Thankfully, the hostess was attentive and offered, all the while other wait staff had disappeared or were in the back corner talking and drinking their coffee. I can understand if this place was busy, but at the time, there were only 6 filled tables in the restaurant.   The food was okay, just not anything to write home about. I will say that I am so glad we got an oatmeal cream pie to go, as it was very good! I will probably not be back unless it's to grab one of those oatmeal cream pies to go.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAVm-Rjjusv_BRZLVlrh0A"
  },
  "9o51NX-FgqVzHeHcMA2_Vw": {
    "date": "7/17/2017",
    "text": "I come here with 5 co-workers. We had stuffed pepper, chicken pie, fried chicken and salads. The food are all very good. The side salads are delicious. The portion of the food is small considering the price.   We waited about 30 minutes after we ordered the food. The waiter come over saying because the kitchen is still trying to figure out how to prepare for rush hour, all the food we ordered are on the house! We are very pleased for the service.  In all, a good choice for the people who work on E. Morehead street. We may come back again for happy hour.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mJzXM0WbRRBViXFyxxfcnQ"
  },
  "0p8NkxR8ojOFqnJTMOC1Zg": {
    "date": "10/8/2018",
    "text": "I went to this place for the first time on 10-6-18 for brunch, I'm only giving one star because the service I received from Tiffany was terrible. It is very VERY rare that I do not leave a tip, but in her case, the tip was not warranted in any way. Not only did she not introduce herself when walking to my table down, she simply put the menu down and stood there until I asked for a drink. I didn't know about any 5.00 mimosas or bloody Mary's until I heard her tell the next table over once they were seated. Anything extra I needed, she wasn't the one to bring to me. She literally sat my plate down and walked away. She asked from the next table over if I needed anything? Excuse me? How about actually stopping by the table? The gentlemen who was pouring the water and the waitress for another table handled any need that I had. Now, I get my credit card statement and they at the Packhouse added a tip to my my solo bill. I DID NOT TIP THIS WAITRESS, and I am contacting the manager and whoever else I need to to get my money back. Every cent that was overcharged, I want it back and will raise holy hell until I do. I despise bad customer service, and despise writing bad reviews, but in this case it was warranted. I do not live far from this place at all and if I cannot get a satisfactory response from the manager via phone, I will go up there until every cent of my money that I DID NOT TIP HER is refunded to me. She did not deserve a tip, sorry, and I really hate doing that because MOST servers work hard and are attentive, but this person just flat out didn't care and it showed. Packhouse, you will make this right, I am writing this review on every platform that I can until this is rectified.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lTCEPMF2d_ybn27Mr9KhvA"
  },
  "DO6HfX_Q-E6m7_nlBm_GsQ": {
    "date": "2/24/2018",
    "text": "Noon on a Saturday dropped in as I just spotted it driving by.  Good crowd but seats available so grabbed one at the bar.  Greeted quickly and friendlily, got an Irish coffee which was great.  Ordered the quiche w extra side of country sausage.  The quiche was terrific and a healthy portion; eggs, cheese and bacon and the crust was flaky and perfect.  Side crispy potatoes were great, very crispy.  The sausage was the highlight for me as I grew up with great whole hog german sausage in Kansas, this stuff is lean and from good quality cuts!  Great experience, service, staff and food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rozGL4hLXo4TWAW_sWu8Nw"
  },
  "Mq_YGFKtrGY8VpY9wamN5w": {
    "date": "10/8/2017",
    "text": "Came here for brunch as soon as they opened on on a Saturday morning.  As far as service it was great. Waiter was super friendly and they wear the cutest bow ties! Drinks were good. They offer bottomless mimosa for $25, which is fair, however places in charlotte have it much cheaper. Food was delicious. I had the breakfast sandwich. The piminto cheese and hot sauce in the sandwich really made it stand  out.  Can't wait to come back here to try the lunch and dinner menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5hg3WQu292i7J0Fwj8t7og",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The Shrimp and grits! It was very flavorful! Must try!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5hg3WQu292i7J0Fwj8t7og/o.jpg"
      },
      {
        "img_id": "ZWpyh_HjsflJyDQqH3LIEw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZWpyh_HjsflJyDQqH3LIEw/o.jpg"
      }
    ],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "lLDyGjAkDfv9Gn1U8UAZ-A": {
    "date": "10/8/2018",
    "text": "We LOVED this spot for a warm, sunny brunch on the patio! They brought water out for our dog and the service was spot on. The menu has classics with a classy twist on brunch favorites. Will surely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "l7sTNagn28tEebf7A0HAGg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l7sTNagn28tEebf7A0HAGg/o.jpg"
      }
    ],
    "user_id": "HOAZt4J39xKyh0WFHmGW0Q"
  },
  "hJFmwNZeb9RA-ZK5qgYclw": {
    "date": "1/13/2018",
    "text": "We came here for a team dinner during a recent trip to Charlottte.  There were ten of us seated at a large table and given the size of our group and our varied needs, the service was spot on and everyone made sure we were served properly and promptly.  The ambiance is rustic farmhouse and the menu follows suit.  Cocktails were fantastic - I had the Tobacco Road (2 of them actually) and we started with apps (deviled eggs, picnic basket, crab cakes) and everything was really tasty.    My main course was the shrimp and grits - at first I wasn't sure about the pickled peppers in the dish but all the flavors blended and complimented well so I would recommend no changes.  The grits were wonderful - and they're high on my list of rating criteria for southern restaurants.    I think we ordered dessert but I don't remember it.  Overall, our meal and service were great and I would consider The Packhouse to be on my top 5 list for Charlotte restaurants.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "13OKPuRbi9ihsxh3D3FOhA"
  },
  "7NhwhVFoTrvyD86NQRs4jg": {
    "date": "1/16/2018",
    "text": "I made reservations for The Packhouse on OpenTable for a Saturday evening.  We were easily able to park for free in the attached parking garage behind the building.  We checked in at the host stand and were immediately seated.  The ambiance inside the restaurant was well thought out.  It felt very cozy and somewhat rustic.  Our server was also very friendly.  As a starter, she brought us two dinner rolls and a side of butter.  The rolls were delicious and sweet.  I could have probably eaten another one, but I guess since we were only given one each, they're being rationed out.    We ordered a glass of Malbec and the Fried Green Tomato appetizer.  Good thing there were only two of us because there turned out to be only two slices of tomato on the appetizer.  For $12.  Hrrmm.  I guess they justify that by sprinkling some crab meat and goat cheese to the stack, but...two?  I think I'd rather see just fried green tomatoes...and more of them for $12.  So they were good, but not $12 good.  Next came the entrees.  I ordered the Airline Fried Chicken.  My partner ordered the Packhouse Burger.  Both of us chose the squash casserole as our one side.  The coating on the chicken was very tasty, not greasy, and there was (surprisingly) only one small bone.  It even came with a somewhat spicy jalapeno honey sauce for dipping.  The squash casserole was disappointing, though.  It was pretty dry for a casserole, and it was the only thing on the plate besides the fried chicken.  It was plenty of food for me, but for $21?  It felt like it needed another small side or some garnish or something.  My partner said the burger was good, not great.  Again, especially for the price of $15.  For less, we can get a bison burger at other restaurants.    I'm torn between giving Packhouse 3 or 4 stars here.  I love the atmosphere, but I can get similar, better, and cheaper food at restaurants like Leroy Fox.  I think Packhouse needs to lower their prices or step up their game to meet the expectations of those higher prices.  The next day, I got an email from OpenTable that the restaurant had canceled my reservation so I wouldn't receive any points for dining there.  What?",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "yeKcjN9ucIUQX5NDeECa1w": {
    "date": "1/12/2019",
    "text": "This place appears to be closed for renovations, but there's nothing to tell you that unless you go there. I made reservations online, and then got a message saying my reservation couldn't be confirmed so to call. I called and got their voicemail but nothing on the voicemail said they were closed. There was no notice on their website. We had to drive out there and discover this at 7pm on a Friday and then scramble to find other plans. Pretty unprofessional.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVDQ6pDVH43ZyoSOhXt3-w"
  },
  "Zi9S2dQOBcSu1OkkhgGQQQ": {
    "date": "12/3/2017",
    "text": "Great brunch spot!   Simple, appetizing, great presentation! They serve on old-school dishes that make you feel like you're at someone's house for a home cooked meal. Very cozy and great service!  Best tip about this place: the front door is the only entrance - there is a patio door, but only for people to go out, not in.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H9zB8oa0A9W-2NFGipcSCA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. front entry",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H9zB8oa0A9W-2NFGipcSCA/o.jpg"
      },
      {
        "img_id": "FYKH5pOGlZfOlUimtDGXfw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. French Toast - HUGE!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FYKH5pOGlZfOlUimtDGXfw/o.jpg"
      },
      {
        "img_id": "3OHtO6RfO2KwcmAItAp_IA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Eggs Benedict with Bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3OHtO6RfO2KwcmAItAp_IA/o.jpg"
      }
    ],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "Hu9vopHM11L3KDVMHk1UiQ": {
    "date": "3/11/2019",
    "text": "Everyone we go there is a note on the door about why they are closed this time. Won't make that mistake again. It says renovations coming yet all the tables are set and ready. Thinking they are headed out. The food was good the one time we found it open.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "88VAY0Y7RZNcKeeN9inWbQ"
  },
  "dBrZ5TVxjkQcoW7l3X_WHA": {
    "date": "5/13/2018",
    "text": "Nice spot. Good breakfast options. We came for Sunday brunch. Not too busy.   The atmosphere is cool. It's got a country/artistic feel.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UL1cN7493ro-VmsJC9jkqw"
  },
  "p5_2nIggt9lVIFzQ0cXpCw": {
    "date": "9/8/2017",
    "text": "Super disappointing. Two of my girlfriends and I went here recently for dinner. The decor is amazing. Impeccable. We sat on the patio with the large door open. The entire vibe is perfect. The chairs weren't comfortable but the look was amazing. But that's about where it ends. We all ordered drinks - I didn't love mine at first and our server offered to swap it out. I got a blackberry mixed drink instead. Don't remember the name but it was pretty good. My friend asked about the bread - our server said he'd bring them out. So we waited. We ordered.   My friends ordered burgers and mac and cheese. I ordered the meat special - crab cake with the two sides the server recommended, squash casserole and mac and cheese. Our food came out (we had to ask about the bread again and it was brought out with our meal) and it was a major disappointment. Both of my friends ordered their burgers a certain temp (neither of which was well done) and both were served well done. My one friend ordered her burger with no tomato jam but there was tomato jam on it. She bit into it and within minutes had an allergic reaction. They apologized, redid the burgers and comped their meal, so the customer service was good. The second round of burgers had the right ingredients but were still well done. As for my crab cake? Meh. It was kinda wet and soggy inside. I ended up mainly eating the outside of it and leaving the soggy part on the plate. The sides weren't great to me. I only ate a few bites of the mac because I limit dairy. I brought the remainder home to fiance to eat and he described them as \"just okay\".   For the inconvenience of having to redo the meals, they offered us dessert. We shared the oatmeal cookie and hummingbird cake. They were the best part of the meal.   Overall - it was a major disappointment. I won't be back.  Update: a few hours after eating here, I had the worst stomach ache and got sick twice throughout the night. The next morning I see a text from one of my girlfriends who ate with me the night before at Packhouse and she reports the same!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Y-U_pZ-iD-QEwdq0e9hZTw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Crab Cake, squash casserole and macaroni and cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y-U_pZ-iD-QEwdq0e9hZTw/o.jpg"
      }
    ],
    "user_id": "QGKOTCbS-gpAMWPADGmf0w"
  },
  "IbO7KVF1RAmEbLDRn37ESw": {
    "date": "1/9/2018",
    "text": "Visited the Packhouse for the first time and we had a great time. Food is Southern cuisine and our table ordered the shrimp and grits 10/10, Crab cakes 8/10, fried chicken 8/10 and stuffed peppers - a low score. The staff went above and beyond the call of duty in keeping our table well stocked and refreshed. Wine selection is good along with full bar. Atmosphere is rustic with a tin roof and rough cut wood tables. The bar area is great for mingling and the TV's have the big game on.  I plan on coming back soon - a great time for all!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qIBDEhit6L_-dUg9y5Fbfg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Hanging out with overlook crowd. Pre New Years dinner at the Packhouse in Charlotte NC.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qIBDEhit6L_-dUg9y5Fbfg/o.jpg"
      }
    ],
    "user_id": "IShj-0kRciMiy9ukhT8b_g"
  },
  "CQAb_aYTU3-1fyyqGnwxjA": {
    "date": "10/9/2017",
    "text": "Interesting new restaurant on Morehead near Dilworth Neighborhood grill.  Tasty Southern cuisine from the same group that runs \"Summit Room\" and \"Mayobird\"  They start you out with my favorite soft yeast rolls and Honey butter that melts in your mouth!  For my entree i got the Pimento Cheeseburger with a side of squash casserole.  The burger was really solid and the mix of Pimento, Tomato Jam and mustard blended nicely.  I would definitely recommend the casserole as a side.  A few others i look forward to trying.    My only beef was we ordered the picnic basket appetizer that comes with pimento cheese. peanuts, deviled eggs, pickled vegetables and crackers. Full disclosure, everything it it was good (especially the deviled eggs. A little spicier, maybe a hint of horseradish ) , but not sure it was worth the $14 price.  Last but not least, you have to try their homemade cream oatmeal cookie.  Nice light desert!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_z5viKtYc1-6pJESF4srYQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Yeast rolls and honey butter",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_z5viKtYc1-6pJESF4srYQ/o.jpg"
      },
      {
        "img_id": "rWhCKkEW8pxhgMtl6qKeCg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Picnic Basket: pimento cheese, deviled eggs, cheese crackers, peanuts from a county that specializes in peanuts and pickled vegetables.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rWhCKkEW8pxhgMtl6qKeCg/o.jpg"
      },
      {
        "img_id": "IVxwSuYy0t5jtvOPya7IIw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IVxwSuYy0t5jtvOPya7IIw/o.jpg"
      }
    ],
    "user_id": "nap5CM2nZvaFodByvUL75w"
  },
  "_SQm_A2X-qnfgRNGz7xzsg": {
    "date": "9/10/2017",
    "text": "I don't normally give a two-star rating, but this place deserves it. We visited for brunch on Sunday and got there a few minutes after they opened; there was only one other group in the restaurant.  The hostess seated us, got us water, and told us our server would be right over. We waited and waited. Finally the very nice hostess came over to take our drink order. Then we waited and waited. I had to call the hostess over to take our food order. They were out of sausage. They were out of fruit. Then we waited FORTY minutes for our food. During this time, the hostess, our actual server, and the maybe 24 year-old hipster manager came over to each tell us a different reason why our food was taking so long - the manager said a breaker had blown, the server said they didn't have enough help in the kitchen so she had to jump in, and the hostess said she didn't know what was going on. They all apologized, but it was a disaster of epic proportions.  Once we finally got our food (more than an hour after we were seated), my eggs were wrong (scrambled instead of over-hard), and the fella's burger was well-done instead of medium. They refilled my father-in-law's coffee with cold coffee. To their credit, they brought all of us coffee from Joe & Nosh next door (what happened to The Packhouse's coffee?) and they kindly found me some fruit even though they said they were out.  The only saving grace to this whole disaster was that they comped our meal. This was our second time visiting, but the first time wasn't great either. We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "4zj5W88vCAXMd2bbgguKUg": {
    "date": "10/25/2017",
    "text": "What a great surprise. Atmosphere and decor is great. The staff was friendly . Service was good. Love the outdoor seating with the rocking chairs.  I had the packhouse salad. I'm in love with the stuffed pepperdew peppers  in the salad. I could just order an appetizer of these things and be a happy girl. I also had the cream of  cauliflower soup that was smooth, creamy and tastey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7FPbIZHZHDV5RRWkVIMzGQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7FPbIZHZHDV5RRWkVIMzGQ/o.jpg"
      },
      {
        "img_id": "KKT-_V6YpsrvwTFLb78r6Q",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/KKT-_V6YpsrvwTFLb78r6Q/o.jpg"
      }
    ],
    "user_id": "QzpSerZEkQnMZPXCph0TQQ"
  },
  "ZrFMGQAP2Y5e7YdyWXm_9g": {
    "date": "8/19/2017",
    "text": "I went to The Packhouse for the first time last night with my boyfriend and another couple. We were excited to try it out, especially because it's so close to my house. We got there at 6:45 on a Friday night and there was only a 20 minute wait, which I think is very reasonable. The decor was interesting. I'm not 100% a fan of it, though. It's in this modern office building, but had all these baskets hanging from the ceiling and basically troughs in the bathrooms for sinks. The waiters were all wearing wooden bowties. I think it was a bit too gimmicky. But, I'm there for the food.  We get seated in less than 20 minutes and our hostess and waitress were very friendly. My friend got yummy cocktails, but there was so much muddled fruit in them that it made it difficult to drink through a straw. The extra wait staff was very attentive. They kept refilling our water glasses and taking away dirty plates. We ordered food and they immediately got us some plates. We assumed it was for the yeast rolls that all the tables had received. But we received no rolls. We waited. Our waitress did not come back to the table to check on us. We waited some more. Baskets of yeast rolls walked past our table. We didn't get any. Finally after our appetizers, we asked for them from another waited. Almost 10 minutes later we got some. They were quite delicious, but it was as if our waitress forgot we were there.  As for the food. I felt the prices were a bit much for what we got. My shrimp and grits were quite delicious, except the huge ball of tobacco butter on top made it too greasy. And the grits were a bit thin and difficult to eat with a fork. Thankfully I got to steal my boyfriend's spoon to eat the last few bites. The taste was delicious and there were a good amount of shrimp in there, although the shrimp was overcooked. My boyfriend got the bbq sandwich and Brunswick stew. They were both okay...nothing special. My friends got the fried chicken and the pork shoulder. They were both decent. The winner was the squash casserole. Amazing!! So good.   For dessert we ordered one large oatmeal cream pie to share. It was taking forever to get to us, and the waitress came back with a complementary slice of key lime pie since they had to make more cream for the pie. The key lime was okay. We didn't finish it. Here comes the oatmeal cream pie. It looked amazing. We all took a bite and were overwhelmed with how boozy it tasted. Nowhere in the menu did it say there was alcohol in it. We asked the waitress and she said there was rum in the cream. It was so full of alcohol we couldn't eat it (and we all love us some alcohol). The waitress also did not charge us for it because we couldn't eat it.  So, overall, the food was decent. The prices were a bit high. The service was slow. The concept is a bit too gimmicky. I'm not sure I would go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "arpCCzzvqXjzlCEqgniP0g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Fried chicken and squash casserole",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/arpCCzzvqXjzlCEqgniP0g/o.jpg"
      },
      {
        "img_id": "_f0sFABkmJQPkq_r56EOQg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. BBQ sandwich and Brunswick stew",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_f0sFABkmJQPkq_r56EOQg/o.jpg"
      },
      {
        "img_id": "gAypkwClg0TgqrBCFLGmfg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Shrimp and grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gAypkwClg0TgqrBCFLGmfg/o.jpg"
      }
    ],
    "user_id": "f5yKkwvCp4z1kEcdTBI5FQ"
  },
  "dQYb4NdxO-q6IiyMcHsZHw": {
    "date": "1/6/2019",
    "text": "Overpriced home cooking in small portions. Staff is slow and inattentive. Only reason to come here is for the decor and cocktails.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VMQ0gzW-FHdwbFNbWV94Bw"
  },
  "MXPPUHWQw6lCkaSvBYI2dQ": {
    "date": "10/9/2017",
    "text": "Came here for the first time Saturday for brunch with some friends and I must say it was really good. I'm not quite sure how long it's been opened but a believe only a couple of months. Our waiter was very knowledgeable and helpful. I ordered The Packhouse Peach Mule start and it was delicious! For my meal I ordered The Packhouse Breakfast Sandwich & it was very good. Everyone else enjoyed their meals as well. I will definitely be back to try their lunch and/or dinner menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T6XtDLeDo0k91E24nhA_ww",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The Packhouse Breakfast Sandwich with homefries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/T6XtDLeDo0k91E24nhA_ww/o.jpg"
      },
      {
        "img_id": "NW8oDlQA_NlfkCWSHNWLYQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NW8oDlQA_NlfkCWSHNWLYQ/o.jpg"
      }
    ],
    "user_id": "O3cItff0mKAfXtl5VmbW2w"
  },
  "rMYTWLn-lTEFZu0gONNvXg": {
    "date": "11/2/2018",
    "text": "I've been to this place twice, always wanting to give a second try.    Not much changed the second time.  Service was poor, slow and inattentive.   Food was meh, mediocre at best and wasn't worth the price. Decor and atmosphere was nice, I really want to like this place but with so many other choices way pay for overpriced poor service?  Lots of 5 stars here (on Yelp)make me think they're paid for the review?  Very few places are 5 star worthy and yet this list is full of them.  It's an  average at best establishment, on their best day.   Food for thought.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8l4eP3dShLJlE-BEJUwHtQ"
  },
  "WwZANvnCzASVIe43Y1ikdw": {
    "date": "7/24/2017",
    "text": "We were in town from Minnesota and told ourselves we wanted to always try somewhere new each day, but loved this place had to go twice, so here is our review:  Southern hospitality? Well dont look any further Fidel will fill your drink within two sips. Waiting staff is very helpful, and attentive as well. The interior decor has an amazing look just make sure to read the story about it on the back of the menu (check out the bathroom even if you dont need to go)... Not gonna give it away here have to read for yourself. Just dont forget to try the NABS! and the Oatmeal cream pie (think Little Debbie, but WAY better). That is just the desserts, but the entrees are amazing and hit the spot on getting a taste of southern comfort food. If in Charlotte its a place to try with free parking in the attached parking garage. Inner city food without the inner city price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dDV0na6_1VrEg8jSIsodYQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dDV0na6_1VrEg8jSIsodYQ/o.jpg"
      }
    ],
    "user_id": "VXXEoj6bgmGnILb_jkprSA"
  },
  "p5EgEBVSgwuHOuXzPc7-iw": {
    "date": "10/18/2018",
    "text": "I've worked in the service industry before...but the service was awful...it could've been just a bad night, but the waiter spilled water all over me, charged us 4x as much as he said the appetizer would be, couldn't give me one check (made me sign two for a drink and an appetizer??), and gave us receipts with ink all over them because his pen exploded. Needless to say, never going back. Even if the food was good it sincerely can't make up for horrible service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FR9BCo-uMdLQMnFIK2-6yg"
  },
  "tzTiYq3iqIK25jEHunEKGw": {
    "date": "7/21/2018",
    "text": "Omg!! This place was the absolute best! The service was top-notch! The view is spectacular and the food is AMAZING! I really enjoyed my time there! I wish I could go every Saturday!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nlTjnladuXlatNxykc-wGQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Southern Breakfast! Yassss laaawwd! I love being from the South!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nlTjnladuXlatNxykc-wGQ/o.jpg"
      },
      {
        "img_id": "dHKWVhrLLR-mqHhg1F8Xkw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Pineapple mimosa and muscadine mimosa! They were only $5!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dHKWVhrLLR-mqHhg1F8Xkw/o.jpg"
      }
    ],
    "user_id": "B1iJM9s9yfb_U7vhCl1N0w"
  },
  "p9m6pNbIZjTwXW4ItXNaYQ": {
    "date": "11/8/2018",
    "text": "My first visit {11/3/2018} at The Packhouse deserves all 5 stars that I'm giving! I must say I had no knowledge of what to expect when walking in but was certainly blown away. My friend had shared with me via text, \"oh you will love this place when you get here\" so I knew it had to be amazing!  Entrance Walking into The Packhouse from the parking garage you immediately notice the details. The wheel barrel as a flower bed on the curb, and the door handle that was created from an old bypass looper. I loved it but what I loved, even more, was the extra large baskets hanging from the ceiling! I was told they were the Tabacco baskets they would use to pick tobacco. How cool!  Decor The details in this restaurant did not stop at the baskets, you notice the country/southern touch throughout. In the ladies restroom, they had a rustic antique weigh machine and the original wood boards that flowed along the walls. My friend showed me photos of the men's restroom which my in opinion was better than the women's with the decor. But they have a beautiful oak vanity and super cool hats hanging over the mirror. My friend shared with me that the hats looked to be old tobacco farming hats. Outside on the patio, is perfect for fall days and chilly nights. You can sit by one of the two firepits with the coziest blankets, they also provide these blankets at the picnic tables as well.   Food Where does one begin with the food, the menu is smaller than most brunch menus which in my opinion is ok. I see it as the restaurant providing excellent quality over quantity. Focusing on signature dishes that perfecting them with greatness. My shrimp and grits were cooked to perfection! By far the best shrimp and grits I've had in a LONG TIME in Charlotte. If anyone would like to argue differently please let me know. There was a lot of flavor in every bite and seasoned to perfection. This is why I state that quality to The Packhouse is much more important. You could taste the love and time they put into this dish. My friend's dish that he selected was good, but it certainly doesn't compare to mine lol. {totally being biased lol}  Staff Haley was so welcoming, I felt like I had known her for years! We talked, laughed and she showed us around the beautiful restaurant. Sam our server was on point, ensuring we had all that we needed and well taken care of.   We really enjoyed our time at The Packhouse and will certainly be back soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EOL-hduY4rtqioNyhGzWNQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EOL-hduY4rtqioNyhGzWNQ/o.jpg"
      },
      {
        "img_id": "zm2xZyQHt6uLyYWCKDfZVQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zm2xZyQHt6uLyYWCKDfZVQ/o.jpg"
      },
      {
        "img_id": "6MMVjAib5BHuLyUtXcuKvg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6MMVjAib5BHuLyUtXcuKvg/o.jpg"
      }
    ],
    "user_id": "bEs1d3_QBUoQB_AjTP-28w"
  },
  "XJzS9yV0lj74TIv4dFwXoQ": {
    "date": "9/9/2018",
    "text": "This is an awesome new spot.   Decor-adorable, rustic and intimate! Great date spot or if you have a group. They can accommodate both.   Food-southern and they hold True to that. Not many healthy options, but all incredibly flavorful and tasty! Had chicken and waffles and was blown away by the flavors. The bruschetta was also mouth watering.   Drink-they have half off wine glasses and bottles on Wednesday's! Yes please! Sparking included. They have an awesome drink menu, so even stopping by as an in between spot at night-we'll worth it. Bar area is spacious if you don't want to be in the dining room.   Staff-awesome. Our waitress was attentive and really nice. She answered all my many questions, always a plus.   The sad thing is on the weekdays it's empty! Great for my friend and I because we sat right now and had the place to ourselves, but I want them to make it so make sure you check it out!! It won't disappoint!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "PKpLh8gmXNT_m5j5zG0AAQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Chicken and waffles were AMAZING",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PKpLh8gmXNT_m5j5zG0AAQ/o.jpg"
      }
    ],
    "user_id": "ljk1DxDWC-iP9nUBaE_2FQ"
  },
  "IbrtOXB0IHU_YR8Hpwj_lg": {
    "date": "10/26/2018",
    "text": "Nothing bad to say about the Packhouse. It's a lovely, uniquely designed restaurant. The brunch menu is seasonal, nothing mind blowing , but tasty.   I had the fried chicken and waffles. The chicken was fried chicken tenders, and the waffle came with little bowl of maybe 4 ounces of a spicy syrup. The syrup wasn't good and wasn't bad .   You can tell they want to give you a quirky- old country store feel ( but definitely not Cracker Barrel ) . I enjoyed the ambiance . I also had coffee , and it was served in a tea cup, and got cold very quickly. The water is served in mason jars.   The grits were okay, a little bit too tough.  The service was great, no complaints whatsoever . You can park in a garage for free behind the restaurant. They have patio seating, dining room seating , a bar , and another area with doors that can be used for large parties .",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HEFqLK9W2nhZpiNf5CGQIQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HEFqLK9W2nhZpiNf5CGQIQ/o.jpg"
      },
      {
        "img_id": "auXQlJ6s4bvrl-3j7mvH6g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/auXQlJ6s4bvrl-3j7mvH6g/o.jpg"
      },
      {
        "img_id": "hgeApBj7auseGe2rl47lfA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hgeApBj7auseGe2rl47lfA/o.jpg"
      }
    ],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "UTYcM-YRrA3IwuNuFfEBCg": {
    "date": "11/6/2018",
    "text": "Recently at the Yelp Goes Gatsby event a gracious young lady approached my friend and I and gave us business card for restaurant that she managed. One of the cards was Packhouse a place that I have been wanting to go to since they opened. The business card also offered a discount on my meal. So that morning I decided I would try them out and brought my best friend and fellow Yelper with me to check them out. Once I arrived at the restaurant I really was taken back by the decor. The restaurant pays homage to the owners Eastern Carolina roots, where he once work on a tobacco farm. I quickly learned that's where they stored the tobacco was called the packhouse. There are traces of tobacco farming throughout the restaurant from the tobacco billboards, tobacco farmer hats that hang in the bathroom wall, a huge portrait of a tobacco field or the tobacco baskets that hang from the ceiling. The ambiance really makes you feel that you are in big old country farm house. They have a great patio with great views of the uptown skyline. They have fire pits surrounded by rocking chairs draped in tartan throws from Italy.  Simon was my waiter and he was excellent he even gave us a tour of the restaurant and showed us the private room that has a tin roof just like a barn. He was very knowledgeable about the items on the drink and food answered all our questions and you can tell he takes pleasure in working there.  I ordered the Skillet Hash, which came with potatoes cheddar, house made  sausage that have a sweet hint of maple and were so good. I ordered my eggs scrambled, I really was pleased with this skillet it was so flavorful and filling. I even had enough to take some home with me. My friend had the shrimp and grits. She also was very pleased with her meal and I was so glad that she shared with me. The shrimp and grits were seasoned to perfection and they have country ham and even okra in them they are definitely a must. They have 5 dollar mimosas and they even have a muscadine mimosa talk about when in North Carolina do what the North Carolina's do! While there I saw who the lovely lady that gave me the business card the night before. I introduced myself and told her that she was so kind and genuine when we met her last night we had to come and visit her restaurant. She told me her name was Haley and she was gracious that we came. I noticed that all the staff wears a wooden bowties. She told me that they were handmade and named Backwood Bowties and they are made by a 90 year old man from South Carolina. She also showed us the candied figs she had just maxed that she would be using for one of their handcrafted drinks. I really admire her attention to detail and how hands on she is with the restaurant.  This is a great place for a date or even to take people visiting from out of town. I can't wait to go back for dinner and definitely will be back for brunch. Those looking for a great brunch please make this the top of your list!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "EgfMz05ZsgTuWm81ojab1A",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/EgfMz05ZsgTuWm81ojab1A/o.jpg"
      },
      {
        "img_id": "bHl4iDY80rf7FRQukZJoxQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bHl4iDY80rf7FRQukZJoxQ/o.jpg"
      },
      {
        "img_id": "wcDtU7-WEMyzcA_6QE0FHg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wcDtU7-WEMyzcA_6QE0FHg/o.jpg"
      }
    ],
    "user_id": "pPH3sWKrc8ajeXz-eg_XAg"
  },
  "dUi-DcP1gmQ6ybSlhrUSQA": {
    "date": "1/1/2019",
    "text": "I'm really sad the packhouse changed their menu! They seem to be focusing more on large plates/dinner v apps and lunch, but I was really disappointed to see the shrimp burgers and hush puppies no longer there. Food and service are still fine, but I don't find myself craving anything on the menu, especially with all the options in Charlotte",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XH3ul4v6NU7EfHuVyZeeWA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The hushpuppies are delicious",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XH3ul4v6NU7EfHuVyZeeWA/o.jpg"
      }
    ],
    "user_id": "3lMq5W6Npf_cur5XqxmklQ"
  },
  "rhI86c_7w6FFGNACioH1ng": {
    "date": "10/12/2018",
    "text": "Cute little restaurant with ample parking in the garage behind it! Came here two times for brunch and have not been disappointed. The menu isn't too big, but the few options they have are classic southern staples and are really flavorful, and good sized for the prices! Be sure to make a reservation online beforehand-quick and easy. The shrimp and grits were my latest entree and they didn't disappoint!   Pro tip: if you eat here on gamedays, you can park in the garage for free! Short walk up moorehead to the stadium, too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vfTIxfgR3PA0_e871ILWyg"
  },
  "TVEZoIBtoPaKFJZtWoq1VQ": {
    "date": "9/22/2018",
    "text": "We went to the Packhouse for brunch and it was delicious! We got the southern breakfast (with eggs, bacon, cheesy grits, and toast), blueberry pancakes, and a waffle. The food and service was great. Our waters and coffee never got passed half empty. They have options for indoor or a nice outdoor patio. We also like that you can make reservations on Open Table.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Hbt9mDCSCl6pTKwhHFuNBQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Blueberry pancakes",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Hbt9mDCSCl6pTKwhHFuNBQ/o.jpg"
      },
      {
        "img_id": "Lu7qQ4mY7a8E0QGWfhtXOQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Waffle",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lu7qQ4mY7a8E0QGWfhtXOQ/o.jpg"
      },
      {
        "img_id": "_0Hd9TFqosMPYRo7cJkMhQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Southern breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_0Hd9TFqosMPYRo7cJkMhQ/o.jpg"
      }
    ],
    "user_id": "2NKOI38yFcoAWkDEBZDq1w"
  },
  "4vV1uWLT3Y9mD2urOCFg7Q": {
    "date": "3/3/2018",
    "text": "This place had my attention when I saw that it was refined southern food! I was eager to try it out and secured a reservation for a double date night with some friends!   The restaurant is just over the bridge to Southend and actually has a nice view of the city but they score points for offering parking! That's always a win when you are close to the city.   We entered the restaurant and the hostess opened he door for us with a warm greeting. We were offered a large comfortable booth and our server approached the table quickly to be introduced by the hostess.   The servers wear paper bow ties and full button down shirts... weird. The atmosphere is of course very rustic and they have a story of an old tobacco house on the back of the menu. It's very dark in the restaurant, mostly lit by candles. They have nice fire pits outside but it was a little too chill for us to venture out there.   We ordered a bottle of wine for the table. Our server turned the bottle presentation over to a different sever and she broke the cork. They panicked and ran form the table to the bar. I think this flustered her but during a wine presentation you present the cork to the host (or taster) ESPECIALLY when the cork breaks. She didn't do this and I requested to see the cork prior to her pouring. The bottle was fine and we did enjoy it but our server needs to learn to open bottles for her own table.. I'll give her the benefit of the doubt and assume she was new.  We showed interest in the Fried Green Tomato app and asked the server about it. She told us it was 2 tomatoes and said it wasn't a great choice to share for our group of 4 but we moved ahead with it anyway. First of all I think all apps should be served with enough for 4 ppl to have a taste. Let's be real that's kind of the point, to share with a group. It was small but it actually had 3 tomatoes and it was topped with crab so we all got about 1-2 bites. The flavor was really nice and the dish arrived promptly.   We placed our order, 2 people ordered the fried chicken and 2 ordered the shrimp and grits. Our table also ordered sides of fries and Mac and cheese. The food was served in a timely manner. The shrimp and grits was presented nicely and reviewed very high from our friends. I was a bit disappointed in my friend chicken. First of all the dish is $21 dollars and it comes with one side of creamed corn. The portion is way to small for the money. I think that it should be a two piece dinner. Also the chicken was very crispy which was nice but it was very dry. I HAD to use the dipping sauce because it was so dry. The dipping sauce that comes with it is a jalapeno honey sauce which is ok but the bright green color was a little off putting. The Mac and cheese was really quite delicious, very creamy.  They do bring bread to the table and the bread was really great and was served with honey butter! Make sure you try this!   Overall the menu is a little bit limited so I may give this place another try but they are trying to be a little more fine dining than they are. Your food has to stand up to the price tag and the atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "v8wd4Xjv5WIpBClNuJDfNw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/v8wd4Xjv5WIpBClNuJDfNw/o.jpg"
      },
      {
        "img_id": "yq4UWCPjny3Ym5ql-s0kLw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yq4UWCPjny3Ym5ql-s0kLw/o.jpg"
      },
      {
        "img_id": "kaZQfdlpXPk72A9ls_U2rw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kaZQfdlpXPk72A9ls_U2rw/o.jpg"
      }
    ],
    "user_id": "uy4oHzC_4zqEAn95Kv27Ag"
  },
  "k3kSFI7p-_BKdzw9t6wANQ": {
    "date": "10/9/2018",
    "text": "This is by far my absolutely favorite brunch restaurant. I come here almost every weekend. The food is delicious, they have mimosas specials on the weekend as well. I have brought several friends here ans everyone loves the good. My favorite is the chicken and waffles but their casserole is also amazing  I'm giving my favorite brunch restaurant a 4 start due to the average service. It usually takes them a while to bring the food or to even order your drinks. This is because they are usually under staffed and they can't keep up with the clients. If you come here know or may be a little bit of a wait but the food will make up for it. They have parking on the garage for free even during football games! Enjoy and be patient!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RSMAh8KMMtPk7hG7El8bgA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Chicken and waffles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RSMAh8KMMtPk7hG7El8bgA/o.jpg"
      },
      {
        "img_id": "lBl2-NFKCS-fCpzYLYSXVQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lBl2-NFKCS-fCpzYLYSXVQ/o.jpg"
      },
      {
        "img_id": "RpLs7MZ5r4WzYYgE8ynCyw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Eggs Benedict",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RpLs7MZ5r4WzYYgE8ynCyw/o.jpg"
      }
    ],
    "user_id": "bCEuJQEl2vIySs46oc3vDA"
  },
  "zW7Mb_QyVDyIhuMihJ8oHg": {
    "date": "8/19/2018",
    "text": "Could not say enough good things about this place. Every drink we ordered was amazing. All of the food we ordered was delicious and the service was incredible! It was my friends birthday and they surprised her with a free ice cream sandwich cake. Yum. We came for brunch and ordered the southern bruschetta, chicken and waffles, shrimp and grits and the breakfast sandwich. It was all amazing. Our service was sooo so sweet and very attentive, always keeping our glasses of champagne full! Will be back for dinner to try the chicken and waffle sliders. So happy we came here for birthday brunch!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "rmhbB1LIfcZjxhUZ1E0BYQ"
  },
  "f3Un107MCXoGH4m5xFE-sA": {
    "date": "3/14/2018",
    "text": "We went here for a team lunch today and everyone really enjoyed it.   We had a large group and we're seated right away. There were a lot of good looking things on the menu. Due to diet restrictions, I got the Packhouse Burger with no bun. My only issue was that I got the burger cooked medium rare and it came out medium well. I'm was still delicious though so I can only imagine how much better it would have been if it were cooked right. The toppings were really good. The pimento cheese was sweet which was a little weird. I got green beans as my side which were pretty good.   I was able to sample someone else's chicken tenders which were really good and I heard the casserole of the day was very good as well.   The service wasn't great. I couldn't get a refill of water and it took a long time for us to get our checks and pay.   The decor is very rustic and southern inspired with a lot of wood. They have a lot of beautiful and unique elements.   The food was really good and I would definitely come back again! I'd be interested in trying their brunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lD9Ih3Gl5jo2oUu2-hzoMA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lD9Ih3Gl5jo2oUu2-hzoMA/o.jpg"
      },
      {
        "img_id": "xqo9vE6NgkexlJsJXq9eNA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Packhouse Burger with no bun and green beans",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xqo9vE6NgkexlJsJXq9eNA/o.jpg"
      },
      {
        "img_id": "g28VfGEmK_viO4KiNBZLtg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g28VfGEmK_viO4KiNBZLtg/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "K3PVb1f5sttNgeCEUEYvVw": {
    "date": "2/8/2018",
    "text": "Just another restaurant I wish was open when I lived in South End! This place is to die for and is decorated exactly how I would want to decorate a restaurant if I opened it up, with the southern barn yard feel - bathrooms are pretty cool too (make sure you check them out - and nice and clean! Thank goodness.)  There was 6 of us, and yup! We all got the same exact thing, Chicken and Waffles with mimosa's of various flavors. To. Die. For.  The chicken was nice and tender and waffles weren't too overbearing.  The only thing most of us needed more of was, syrup which they gladly gave to us.  Also note, many people worry about parking when coming to South End but this place has a covered garage with ample space - so no need to be concerned.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "PB1UFmAvU0zPeGRQB2gfYw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PB1UFmAvU0zPeGRQB2gfYw/o.jpg"
      }
    ],
    "user_id": "jDuI1ZfBxcL5iWEJOWK89w"
  },
  "sVJLxDm9pRHPgCjWXxJwyg": {
    "date": "12/11/2017",
    "text": "Since this was a relatively new restaurant my friend suggested to visit for brunch.  It was so easy to drive pass by this place on E. Morehead Street. We had to make a U-Turn and go back to find this place. Here is a better description. When you see Joe's Nosh and there are rocking chairs outside. Get ready to turn into a parking lot. Packhouse is on the right hand side as you are heading towards the parking lot.   Packhouse was not packed at all for a Sunday afternoon like 1:30 PM. Guess everyone at the football game. There were three people at another table. Relative empty here.  Had a good waitress for she was very attentive. All of our friends arrived at different time frames and waitress came back to check in on us.   Can not beat the $5 Mimosas. Tried the Cranberry and the Cannon's Shine and they were good. Bloody Mary's were $10.  One of my friends wanted to order the Tomato Skillet but they did not have that. Maybe seasonal? So she ordered the Chef's Casserole of the day. My other gal pal ordered the Southern Breakfast. Waitress mentioned they were out of something which I kind of found odd. You do not have tons of folks here and you already do not have a certain item. Guess, they only work with what they got at the kitchen?  All three meals came out, however my friend that ordered the Southern Breakfast noticed it was not what she ordered when the entree came out. The bacon was burnt, the grits was not what it should be. Waitress was accommodating and asked if she wanted another one or order something else.   I also ordered the Chef's Casserole, no way to mess this up. It was good.  I would come back for the casserole and try their Packhouse dishes. As for breakfast entrees- you are better off at Cracker Barrel, Denny's or even IHOP.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 14,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "YXZiPMHjMcGhwC_xz676gA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YXZiPMHjMcGhwC_xz676gA/o.jpg"
      },
      {
        "img_id": "2uQEafhIAV_xYDSWeU0iJQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Cranberry Mimosa",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2uQEafhIAV_xYDSWeU0iJQ/o.jpg"
      }
    ],
    "user_id": "Aciq1ddPC6jeQHLB0vZKVA"
  },
  "RIln24ytfe7dspp0a_AQYg": {
    "date": "8/28/2018",
    "text": "Went here for a Sunday Brunch and loved it! We went around 1pm and it was not busy. It has a great environment inside. We tried 3 different cocktails and each one was amazing! Our server was super sweet. I had the breakfast sandwich, my friend had the chicken and waffles, and my other friend had the shrimp and grits. They were sooo good. I had cheese grits as my side and loved them. The chicken and waffles were sweet and crispy. The shrimp and grits had the perfect flavor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "415GXSqMDMOcoPBtw0dnIA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. 3 of our cocktails.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/415GXSqMDMOcoPBtw0dnIA/o.jpg"
      },
      {
        "img_id": "zr_kR2WH2tA-U8ow-lWXmw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Breakfast sandwich with cheese grits",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zr_kR2WH2tA-U8ow-lWXmw/o.jpg"
      }
    ],
    "user_id": "9eiqEQzRrhPjvMDoGRq20Q"
  },
  "xxVQ_7G0_CaMzav3kiBd-g": {
    "date": "4/20/2018",
    "text": "Great ambience! A rustic feel for a menu of Southern comfort food classics. The decor is absolutely a treat. Check out the table at the bar. Beautiful!!!   5 stars - Jalapeno hush puppies. The best hush puppies I've ever had. Crispy exterior and melt in your mouth cornbread interior. It was better without the sauce that accompanied it. Didn't need it!  4 stars - Iced tea. Ordered unsweetened. They are so good at refilling them. I loved the deep tea flavor. And once during my stream of refills I got the sweetened ice tea by accident and i wasn't mad because it wasn't overwhelmingly sweet like I thought it would be. Real good!  3 stars - Fried vegetable appetizer. Squash, zucchini, pickles all fried and served with a green goddess dipping sauce. I loved the dill in that sauce. Otherwise it's just what it's called. Fried veggies. Nothing special.  2 stars - Black bean burger. It's a patty with black beans and rice. The rice and black beans are left more whole than mashed to form a patty. Because of this the burger fell apart. It was bland and the spicy mayo sauce pretty much needs to be dressed over that veggie patty otherwise there is no taste. The brioche bun and the avocado in it semi-saved this one for me.   Overall, I would have loved to see a better vegetarian option if they have only one real offering. Lastly, the service was great. Attentive and friendly all around. Please get the food to the level of WOW that I get from the ambience and the service. I would consider coming back... especially for those hush puppies.",
    "rating": 3,
    "rated": {
      "funny": 14,
      "useful": 20,
      "cool": 18
    },
    "photos": [],
    "user_id": "WVWknTDLYl11kiWIJI456g"
  },
  "X3mno8zvyar6bPkd8oyJTg": {
    "date": "4/3/2018",
    "text": "While getting a mobile Detail in the basement of this building my husband, toddler and I headed upstairs to have brunch here.  They don't offer any Vegan items so I was a bit disappointed however they did have something I was able to then Vegan however it was super tiny and unfulfilling. My husband and toddler both were okay with the menu and each did well with their meal choices. My husband had the chicken and waffles and out toddler had the same. While we  waited they brought out some warm biscuits with butter and honey on the side which I put together for my toddler to munch on while we waited.  I had the homefries only which were yummy. My husband said his chicken is as dry and the waffle was a bit overcooked. He didn't send it back as it was the day before New Year Eve and he didn't want to make a fuss. He sucked it up and ate it, same for our toddler. He ate it since I was clear that I wasn't going anywhere else but home :-)",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mgTuh557LKNi9r5kaZbRWA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Bathroom View (Women) 3",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mgTuh557LKNi9r5kaZbRWA/o.jpg"
      },
      {
        "img_id": "7P9et_po-cZIwaag0g1dDg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Bathroom View (Women) 2",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7P9et_po-cZIwaag0g1dDg/o.jpg"
      },
      {
        "img_id": "ww1F5585-Qy2kDnDWNyZAg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Bathroom View (Women)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ww1F5585-Qy2kDnDWNyZAg/o.jpg"
      }
    ],
    "user_id": "XUwYlVRuyoImgtaw8Cjztg"
  },
  "uj_VC-5WsRa9fhD0j6PYyw": {
    "date": "9/8/2017",
    "text": "I can see why The Packhouse is not a packed house. (See what I did there?)  I already wasn't really thrilled about coming to this joint. I checked the reviews, they weren't really poppin. I looked at pics, weren't enough of them. And the menu looked... okay.  But I'm always down for something new and different and my homie was eager to check this place out, so why not?  Welp, it wasn't good my friend.   I ordered the Packhouse burger; because, if you can't do a burger right, then something is seriously wrong. And it was ALL wrong. Not once but twice.  My other homie decides to get the same thing. She didn't want the tomato jam (she's allergic to tomatoes) and she wanted hers cooked medium well. I wanted the tomato jam and my meat to be cooked medium. You following so far?   We both asked for the Mac and cheese as a side. Side note: why do they not have fries???!!! Not even sweet potato fries???!! Like forreal tho. Anyway, they bring out my homies burger and my other friends dish. They bring out my food last. There's a TON of mustard on my burger. Literally all I can taste is mustard. They killed my meat. Like if the cow wasn't dead before they cooked it, they made sure they killed it when they grilled it. And after a few bites I noticed I didn't have any tomato jam. Come to find out they switched me and my homies Burgers. Although her meat was well done and dry as well. My homie is breaking out (tomato allergy) and I'm just over the burger.   They were nice enough to comp our burgers and asked if we wanted new ones. We were good with that. They also said they would give us free dessert. OKAAAAY!!!  New Burgers come out, they get the toppings right and the chef wasn't as enthusiastic with the mustard the second go round. HOWEVER! My meat was still dry and over cooked. {sigh}.... whatever. I couldn't finish the burger. Like the meat was a choking hazard.   The Mac and cheese was aight. I love Gouda, but it wasn't hittin it. Ah well.  My other homie said her crab cake was too juicy. I didn't get much else from her meal but she did say this place was 2 star worthy as well.   Also we get the complimentary bread and butter AFTER we get our food. The homie has to ask for the bread and butter. Strange and not needed at that point.   The desserts (forgot to take pics) were actually really good. The hummingbird cake was moist and not too sweet. I don't like nuts but I had several bites anyway cause the flavor was really good.   The oatmeal cream pie cookie joint was pretty good but again I'm not a fan of nuts and thick creamy icing. But anyone who is down for this, would love it!   So there you have it.   The service was top notch. I gave more than 20% of what my bill would have been because I can't fault the staff, but I'm sorry guys, the food needs some work.   The location and setup is dope. The vibe is chill and everyone is really attentive and nice. If they work on the food, I can see this place getting packed with the quickness.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sndm1wKJ1aEx-cehY8TrVA",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. The Packhouse Burger with Mac and Cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sndm1wKJ1aEx-cehY8TrVA/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "be9DsIkbIOK4hVFoaANIBQ": {
    "date": "4/3/2018",
    "text": "Located uptown off or Moorehead but you may miss the sign. The freat news is they have a free parking garage which is rare uptown (kudos for that) The decor was a combo or rustic and vintage with tealight candles, mis-match dishes with mason jars. The background story of the owner and how the Packhouse got its name on the back of the menu.   Our waiter Isaiah was great, he was patient with our party of 12 and very knowledgeable of the menu.I ordered the meatloaf stuff bell peppers with mac & cheese. The stuffed bell peppers with nothing special at all. It seemed like the meatloaf was cooked then stuffed into a pepper, added cheese then baked again. Not impressive at all. The mac & cheese sauce was not thick enough. I order the mash potatoes which were good.   I left feeling hungary and disappointed. I will not be back here anytime soon",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w40abDfMmerETiI2Wy9w7w",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Mash potatoes",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w40abDfMmerETiI2Wy9w7w/o.jpg"
      },
      {
        "img_id": "O-8Ox23saS3lHo_ctXM2Dw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Meatloaf stuffed bell peppers and mac &amp;amp; cheese",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/O-8Ox23saS3lHo_ctXM2Dw/o.jpg"
      },
      {
        "img_id": "o2ZAgey0y_PIiwL_2VRcKQ",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Meatloaf stuffed bell peppers with mac&amp;amp;cheese and mash potatoes",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/o2ZAgey0y_PIiwL_2VRcKQ/o.jpg"
      }
    ],
    "user_id": "V6RofYXUats4xTwJnU_qpg"
  },
  "COtM7KNOo876QDJ7jV46QQ": {
    "date": "8/4/2018",
    "text": "It took me about a week to review this place only because I was trying to think of all the great things to say about it. This is a five star in my opinion!!!! It's very rare that everyone in your party thoroughly enjoy their meal. Welp in this case that's exactly what happened. We came in about an hour before closing on a Friday, the staff was quick and amazing even though they probably were ready to get off. The atmosphere is great and it can be great for a romantic date, girls night, hanging with family. Whatever this place gives it all. And our server gave me a great Wine suggestion. I didn't drink anything besides water but that was good as well. Lol. So I can't comment on the drinks but I'm gonna just guess that they are amazing as well. This is a must go place. I just wish it wasn't in the cuts of Dilworth/Southend/Uptown/Downtown because I think it would get more traffic. But since word of mouth goes a long way...I'll keep spreading the word about this place.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 9,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "jZB-3cbb4isxXNraLJsLVg",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/jZB-3cbb4isxXNraLJsLVg/o.jpg"
      },
      {
        "img_id": "L3gGxCwoeUR9JiuOnKZZ7g",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L3gGxCwoeUR9JiuOnKZZ7g/o.jpg"
      },
      {
        "img_id": "suegFfmvqE3ISSF5qxqayw",
        "caption": "Photo of The Packhouse - Charlotte, NC, United States. Antique scale in the women&amp;#39;s bathroom",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/suegFfmvqE3ISSF5qxqayw/o.jpg"
      }
    ],
    "user_id": "vBxT4_bjFrbZEarWz6vsCQ"
  },
  "qy4sfZUPA3AbjPqqL9pzag": {
    "date": "2/22/2018",
    "text": "YUM! Talk about good southern food.  We made a reservation for Sunday brunch for 10 people the night before and they were happy to accommodate us! Service was phenomenal. Drinks were reasonably priced. Food was really good. They offered a lot of specials with a wide variety of options (French toast with strawberry cream cheese, breakfast sandwiches, etc). Only complaint would be the grits.. they were hard and flavorless.  Restrooms are really cool - be sure to check those out before you leave. Parking is available in a garage behind the restaurant. There were plenty of open spots when we arrived.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "146udnwO4772RFXD1i5ruQ"
  },
  "aEXlyF_GA3k8JqlH0bR-kQ": {
    "date": "7/22/2017",
    "text": "Four of us went here on a Friday night, and it was great! The cocktails are awesome (I had the Tobacco Road) and the decor and ambience is on point too. Our server was very professional, yet down to earth. We had several non dinner related conversations with him and enjoyed his company. The foot was delicious! I had the shrimp and grits. The shrimp were perfection - perfectly seasoned and large! We also had the ribs, fried chicken, and stuffed pepper and all of it was delicious. I will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZ9BNtr1e3vEvfeG4edljg"
  },
  "rLggSZpPHRoQQGCwY7nHgw": {
    "date": "9/23/2017",
    "text": "I am giving this a one for decor only, we got there and were seated at 1255 no one even spoke to us until 120 and they were not that busy! No one smiled not one person, when we finally were approached it was by the bartender who also seemed like he could careless to be there, I use to wait and bartender if you don't want to be there please do everyone a favor and work somewhere else, after that we were hoping the food would be good we were wrong, it ok not great the only thing that was good were the nachos, bad Brunswick stew I would call it vegetable soup, catfish poor boy eh mac n cheese so so don't waste your money. Location is great drinks were good but that's it",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvAm2iES7OxbG2Uc-bKYqg"
  },
  "n0vmiCrQfK7yvEyfybCxUA": {
    "date": "8/2/2017",
    "text": "We had a great time at The Packhouse last night. We visited after being turned away from Dot Dot Dot at Park Road Shopping Center because I was wearing shorts ... IN THE SUMMER? I posted a review of Dot Dot Dot as well, but now I get to brag on The Packhouse. The weather was perfect yesterday afternoon/evening, so we sat out on their \"front porch.\"  Parking was FREE and very convenient. The decor on the interior of the restaurant all has a tobacco barn theme; cool wood walls, these tobacco leave baskets hanging fron the ceiling, and even a resin bar that is made out of tobacco leaves.  Very casual and comfortable vibe. We ordered cocktails at the bar. Everyone enjoyed their drinks. I was there with 5 other coworkers. My only comment would be that I feel like restaurants are overly trying to accomodate people who like sweet drinks.  I opted for Larceny bourbon instead.  I did notice they had a very nice wine collection going on the wall.  As a group we ordered just about every appetizer they had going to give stuff a shot.  We started with a charcuterie place; couple of cheeses, country ham (avoid in my opinion as it was raw and underwhelming), the picnic basket which was a cool concept that had cheese straws, pimento cheese, pickled veggies and some more fun items.  We also ordered their $3 bar bites; nabs (like the lance crackers but homemade), maple glazed bacon, and cracker jacks). I ended up staying for dinner with one of my colleagues and ordered the fried chicken.  Best in Charlotte in my opinion.  Nice rich batter.  Pepadew pepper mac and cheese ... just ok.  And succotash, one of my favorite sides!  I think they are going to need to add a few appetizer items and adjust the menu a little as they go, but I was very please with the service and food.  Thumbs up, guys!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QBN2nZejXXJ0craYVae27w"
  },
  "Vp3fzxG_bI1J40I8UQmw9Q": {
    "date": "7/17/2017",
    "text": "We went for late night drinks after dinner at home and had a wonderful time! Z at the bar was wonderful and Ford gave great recommendations. The specialized drinks were perfectly tasty. Love the decor. We will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkXthukt7AF9cyDK5hgdAg"
  },
  "aILYZiSxtm4k2jtNRH7hXg": {
    "date": "7/16/2017",
    "text": "This seems to be the hot, new place, but my experience was solidly mediocre. The decor is great and it might be worth going strictly for the ambiance (check out the bathrooms! The old wooden doors might be the best part of the whole restaurant). I tried the peach mule as a cocktail and it was good, though I wanted to love it and didn't. The food was just meh. I ordered the rabbit plate, which is three sides, and they gave me one incorrect side (succotash instead of sweet potato casserole). From reading other reviews here, it seems that inattentive service is common.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tlVxFoP6KmMHPdXCQ5ttdg"
  },
  "6uVLObkrE-h5OI4t6MroCQ": {
    "date": "8/17/2017",
    "text": "Amazing food but even better service.  Trey is fabulous, best server we have ever had in any city.  We have loved it all...shrimp and grits, tomato skillet pie, salmon, pork, special meatloaf, strawberry salad...etc.   The restaurant you want on your repeat list for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JSVtphFRLj4_uljZqPgfkQ"
  }
}