{
  "2ZPAZbPhuQBpQzvQvA3ldg": {
    "date": "11/4/2017",
    "text": "We had a great experience! We were worried for other bad reviews but we had a gift card, so we decided to try either way. Wait time was accurate (15 min on Sat night). Our service could have not being better (thanks Dakota) and the food was A+ (steak and tuna salad). We will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z9kCG91eKigtQGGtb3uN1g",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/z9kCG91eKigtQGGtb3uN1g/o.jpg"
      }
    ],
    "user_id": "rexuneu_1-9zpTIjwCOY5Q"
  },
  "6nzvd9mvKJuv48D3DqdKbg": {
    "date": "11/3/2017",
    "text": "Very clean, parking is great. We got seated right away with 7 people. Server was friendly. Food was great. I was starving and was very short with staff because i was so hungry, like even when my burger came out wrong i didnt care because i was starving. The waiter was apologizing and was so kind. My burger was amazing and they were just trying to keep me happy by being attentative.Very good service, we will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDYlJP7htJ6humd4_mq_lw"
  },
  "P688nJoQxLtKVTNK0NwMyQ": {
    "date": "4/7/2018",
    "text": "Had some issues when they first opened. New manager, Roy and the staff have gotten it together. Local best kept secret. Locals should give it another chance as I did!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vPHhQs0sHpSLnCALT7aEOA"
  },
  "f-oCoxEbZ4nzVituiA-joA": {
    "date": "12/10/2017",
    "text": "Went yesterday with a group of ladies for an ornament exchange and the wait for everything is ridiculous. After getting our drinks, it was about a 20 minute wait to finally order off the menu because our waitress disappeared. After ordering, our waitress disappeared again for a while and everyone needed refills. Finally after about an hour of waiting on our food (which was a ridiculous amount of time considering it wasn't busy AT ALL), everyone received their food except for me. Which normally waiting about 5 minutes for your food to come out after everyone else has theirs is no big deal but I sat there for 20 MINUTES waiting on my food. Everyone was done eating by the time I finally got mine. Great atmosphere and good food but TERRIBLE SERVICE!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FlICpsDZGtCxMoeq3FVpmQ"
  },
  "1o_Q2mo9X8MwZK65O5CjOQ": {
    "date": "1/14/2018",
    "text": "It's just OK. Beautiful new place, service OK, food disappointing other than their house salad. They should hire an actual chef to come up with a real menu then teach the line cooks how to do it.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuAHWfMT86wUtkFJLWGwvw"
  },
  "q2bkskhHeTiJCo8ubOLPOA": {
    "date": "3/23/2018",
    "text": "We ate with friends and I had a smokehouse burger. I ordered medium rare. The burger was very well done. I ordered another one. It took an extended time for the replacement. The three other people had finished their food quite awhile before the burger arrived. It was medium well. My friend was disspointed with her tuna. The staff was very slow to respond to my burger problem. I well spend my money somewhere else. Lot's of choices.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5e4wVaD1Blxq97Y-4yZYYA"
  },
  "znjkBWgAaz1fQqRAWeFrxw": {
    "date": "9/17/2017",
    "text": "I realize this restaurant has been open for approximately four weeks, but we have tried this location three times now to disappointment with each visit. The absolute best advice I have is for the staff to search for new jobs quickly as this location will not make it at the current performance.  The one good, redeeming thing about Char Bar in Mint Hill is the beer list, and considering there are other great spots for beer and wine enthusiasts within walking distance (notably, Vintner's Hill), this is not enough to warrant a visit to this location.  Their best food is on par with what a single guy-cooking novice may slap together on a weeknight. The chicken nachos are horribly arranged, stale, and include approximately a tablespoon of actual chicken scattered on top of the nachos. The chips and guacamole includes the runniest, least flavorful guacamole to ever be served and yet again, about a dozen stale tortilla chips with no offer to refill the chips. I'm not sure how they have had stale chips with every visit when chips stay fresher in my own home longer than this location has been open.  On our final visit, we placed an order for wings, which, to our dismay was futile since the kitchen  was out of wings but failed to notify our waitress until time to serve our food. No worries, we ordered a burger instead, as it is understandable that a restaurant could be out of wings. Unfortunately, they were out of ground beef too and were unable to accomodate burger orders. At this point, it was clear that the restaurant was out of over half of the menu options at a reasonable dinner hour on a Sunday evening.   If this were a one-off restaurant owned by a family or small group of investors entering the restaurateur business for the first time, I would be disappointed, but more understanding. However, this is a fairly successful local chain of restaurants that has completely failed to open an even moderately-managed restaurant. I would keep the hostesses, and quickly replace all of the kitchen staff and management before this place loses an absolute fortune. They have had their opportunity at this location, and it has gotten worse since first opening.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TmzqHDH2yZFaIAns_5wQ_Q"
  },
  "R9igS-tk0pqn8S5YtfPG7A": {
    "date": "9/4/2017",
    "text": "Service was excellent, food was good still working out the kinks, stick to the tacos,  nachos and Asian salad. Beer selection is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kj6Q9uIQZl3TNEI-HMjMgg"
  },
  "ieJ8ZLhmAdYhwyHXRSs4DQ": {
    "date": "3/7/2018",
    "text": "Officially gave up on this place last night.  I was excited when it first opened in Mint Hill because we needed a slightly upscale place to dine.  The first few times we ate there it was just okay and the service was bad but I just figured it was \"opening\" jitters and gave them some more time and came back later.  Later was no better.  I had the best chicken tenders ever at the Char Bar in Matthews so I asked if they could replicate them at the Mint Hill store.  Easy enough right?  WRONG!  I asked if they breaded them to order and she said \"sure.\"  So I ordered them, they came back like I'd asked for DOUBLE breading.  Sent them back and explained what I wanted again.  Came back with even more breading, I gave up and they took them off the check.  Came back about a month later to basically a new staff so I tried again.  Same thing, Groundhog Day.  Gave up, they took them off the check again.  Came back about a month later to yet another staff.  This time I asked if they could lightly bread fish for the fish and chips.  Same thing, double breading, sent it back, they tried again, same result, took it off the check and apologized.  So last night, I got the wings, I like the wings usually.  They came out soft, I asked the server if they could just drop them in for a minute and crisp them up, knowing that the fry cook is obviously \"challenged\" I took a chance.  15 minutes later, they came out black, so overdone that the waitress was apologizing as she sat them in front of me.  Took a bite, they sucked, told her to take them off the check and she did.  No apology.    We spend a lot of money when we go, always a bottle or two of wine and cocktails.  Average check for 3 is about $130 AFTER they take my entree off the check.  Make no mistake, this place flat out sucks EVERY TIME.  I wanted it to be good so bad because it's so close to my home at Olde Sycamore that I kept coming back and back, hoping and hoping.  The burger was decent once but that's pretty hard to screw up even for them.  But that's it..  Nope we'll make the drive to Waverly, Matthews, Ballantyne, Southpark ect..  Just to avoid this place.  \"The Hill\" has fabulous food but no wine selections, otherwise we would be eating there.  Best part about this place, it's \"pet friendly\" on the patio.  Worst part about this place, it serves food.  ABSOLUTELY TERRIBLE.  NO STARS..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6VHJYsbMqUhdkC3eQhj3A"
  },
  "WXbvHDYkzxMIjK_otM0b1Q": {
    "date": "8/27/2017",
    "text": "Went this weekend . Absolutely awful service. Waited over 30 minutes to get drinks. Manager very hateful. I sure hope they get it together. Not worth the wait or the money.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ol4IVc7OuxlpcWgufNZQYg"
  },
  "8C7MpRL-q3xnJ5mSytSpjg": {
    "date": "8/26/2017",
    "text": "Love this place! Service is better than expected with only few days open. Great beer selection. Had the ahi tuna and it was great. Plenty of seating options. Can't wait to sit outdoors next to the fire pit this Fall.!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CfYlciQOQT63DPeu7eBdrw"
  },
  "zobjU7mi9SAMYr7y6-pu6A": {
    "date": "2/17/2018",
    "text": "The food here is pretty good. The atmosphere not bad...very loud even when there are not a ton of people...too many tvs with volume up at once plus music so people talking over it. The food often comes a little over cooked...I get it \"char\" bar...its more then just the outside char though...burgers end up a little dry...and tots at all levels of cooked...but they are incredibly attentive and if something isn't perfect they will bend over backwards to see that you are happy. They have a decent beer selection and apps not bad...didn't love the pretzels though, very dry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0apDfgUq_MyAllXng_RCw"
  },
  "N-W_K5eDA4XHY25SrwpvKg": {
    "date": "2/11/2018",
    "text": "Good food but poor service. Why would your drinks come out after your app. Why would you not check back before meal delivered or after to see if you need anything? Very slow and not busy, but again, the food was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-PlKABheI8Jp4yQ_LyMKDw"
  },
  "hyST7hDke4TETKUxlCsjDA": {
    "date": "9/21/2017",
    "text": "Finally stopped in since we've seen it so busy over the past few weeks. Figured we would give it a try. The service was good, waiter was very attentive. The food on the other hand was honestly mediocre. We ordered the chicken nachos and I kid you not, they only put a few small pieces of chicken on them. Loaded the cheese though. Why call them chicken nachos if you're going to put virtually no chicken? Totally put us off. Fries are decent (they remind me of the fries Dunwellz serves down the road) and the burgers are decent as well. Not sure if I'll be back though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsTd10th5dZYLQdeP11c6A"
  },
  "wakJF8ucOmWqzfSMWV6rFg": {
    "date": "1/2/2018",
    "text": "I love the bartender on Tuesday's and the girls on Friday nights! It's very nice. Great beer selection with lots of local craft beer on draft. Beautiful ambiance with great service it doesn't get any better then that!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3VuVGNaRZq5qvL2QsesLA"
  },
  "jKVCd--yGj0xCvir4mSm8Q": {
    "date": "11/8/2017",
    "text": "The food was delicious the service was excellent. The outdoor seating area is beautiful with the fireplace. Great addition to the Mint Hill area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qEmnrtoApkLrtLVm22muuA"
  },
  "GWoMnxDIqn_3SzNJEL1f1Q": {
    "date": "9/5/2017",
    "text": "The food was good. We have been to the Matthews location a couple of times and had good experiences. We wanted to wait a couple weeks to see how well they could replicate this experience before making a judgment. Unfortunately, they have a long way to go.  We went twice to the new CharBar7 in MInt Hill after looking forward to it and viewing the construction process. Seems like it should be a good addition to MInt Hill.   The primary issue we had was the NOISE !  If this is a sports and loud music bar, they should label it as such. We never had the loud and constant noise levels we did on both of our visits. To be fair, the noise on Saturday was more bearable than Monday (Labor Day). Since they had football games on the TV and some had the sound up, the music was apparently turned off. This was a blessing. But still quite loud, but bearable. Monday we went early, around 4:15 pm on the holiday. It was not as crowded and we were seated quickly. Then we waited over ten minutes before anyone even bothered to offer us water or welcome us. Obviously they have some work to do in training the wait staff. A lady manager or someone who looked like a manager walks around trying to look busy but just basically walks around and does nothing. Finally my wife got up and asked if someone could wait on us. So someone did. But as we sat there, we realized that the noise levels coming from the music were simply unbearable. Got an app for the Iphone and dB levels were in the 85-90 range. This is simply too high to have a conversation among normal people without yelling. And as a matter of fact, the manager who came over when we complained had to ask us several times what we said because she could not hear us over the noise. Noise levels in that range will hurt the workers ears, studies have shown when prolonged exposure is present.   Anyway, we asked to take our food home which we did, and enjoyed. Every time we have been, the food quality has been first rate. And while the prices are not low end, we do not mind paying for good food AND good atmosphere. Turn down the noise level by 10 decibels and we will back many times. Leave it where it is and we will not return....  and while you are at it, get a phone number. !!  who can imagine a restaurant, open for business, without a phone ?  I think they tried to rush the opening. If it was a test opening, then say that..invite feedback as you work into the real thing. Since there are 7-8 other locations, this should have been easy....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lMajqer3PBzsbU9suw9dvw"
  },
  "3-Rkr_uXigFLwDuEHJtncQ": {
    "date": "9/3/2017",
    "text": "We have gone to the Matthews location as well as the one in Carmel Commons for years. Absolutely one of our favorites and we're ecstatic that it was coming to Mint Hill. The management has failed miserably as we have now tried it 3x in Mint Hill and will not go back. That's not True, we will still go to the other locations as it is an amazing restaurant, just not the Mint Hill location. My suggestion would be to have the leadership over for a few months from the other locations to build the consistency consumers I used to.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qk5UC57QcrnQuQg48yfJzg"
  },
  "YKosCVA3FO30d30s3GV75Q": {
    "date": "11/3/2017",
    "text": "Wait times longer than stated. Seated on noisy patio without being offered a table inside. Will reserve judgement based on remainder of Service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q3baqeHjpiD9lcP8GrDNCg"
  },
  "JK8ArweV2_ETH-0TPk_oKQ": {
    "date": "10/31/2017",
    "text": "Too bad this place is a let down ...food consistently comes out cold ...we've been now 3 times ..such a loss ...Idk if it's the kitchen or management ..two months later all new faces , same terrible food production and way less business than I would have expected for a much needed place in mint hill. Good luck guys , you need it ! Will not be fooled a 4th time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BHbQVQv99VXGpOsG-sGaVw"
  },
  "Fk9jPXu9J6D0nV-eZItWdQ": {
    "date": "8/23/2017",
    "text": "Until now, you had to leave Mint Hill to get this level of great, upscale food and drinks in a wonderfully cozy, energetic, casual, cleverly-designed, contemporary atmosphere with a sports bar overtone. That pretty much covers it but for details, keep reading.   For our first visit on opening day, we expected some operational hiccups but it was really good. Service was friendly and prompt. Food was hot and delicious for three out of three entrees. Wait staff was in control and management was always visible and mingling.   This place has done a masterful job of integrating the indoor/outdoor bar and dining experience with large, open glass garage doors that lead out to a hard-covered roof/patio.   There are three large fireplaces in a single stone chimney wall surrounded by a large casual seating area. On either side of that, there are outdoor, candle-lit dining areas. This side of the building faces Matthews Mint Hill Road so there's a really nice energy out there. There are TVs scattered throughout the space but it's done tastefully and doesn't look like Buffalo Wild Wings collided with the NASA control center.  Sound level - If you're a little more conservative and tend to be somewhat of a stick in the mud, the noise level might be a little high for you. That said, it was easy to have conversation at our table despite the infectiously eclectic background music and crowd noise.   Personally, I thought it was wonderfully appropriate.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Frnpxs-NktWVdG4o3Yb3OA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Looking out the open glass, garage door toward the front, covered patio seating.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Frnpxs-NktWVdG4o3Yb3OA/o.jpg"
      },
      {
        "img_id": "Wp86bzZPO5Jkq3oSm0DR_w",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Seating cove in back",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Wp86bzZPO5Jkq3oSm0DR_w/o.jpg"
      },
      {
        "img_id": "sEauYcMzesO38TFRsbsX3A",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. View toward the bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sEauYcMzesO38TFRsbsX3A/o.jpg"
      }
    ],
    "user_id": "t4NZjA11bX4kq1WJY0uMLQ"
  },
  "gObttWTYttS6uIEvX-myIg": {
    "date": "10/15/2018",
    "text": "Nice restaurant but service this evening was lacking. Had tough time getting waitress to refill drinks without having to chase her down. Then to get ice tea with no ice....really. I then had to ask for ice. I didn't realize there was an ice shortage. Food good, atmosphere good just  crummy service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9qVAkd89Qk5L8FPPYgcPEw"
  },
  "kuO5WNvqY6OIO3489at8MQ": {
    "date": "10/12/2018",
    "text": "We frequently come to this and the Mattews location. We enjoy the food. Wait staff is generally always helpful and attentive. Not interested in a live concert where the volume is so loud that you can't hear the person at your table. Won't return as long as the atmosphere is a concert instead of a restaurant.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ifxYB7wwNkiys02j0wqQw"
  },
  "LN3NmL5KjbQABLFrXOS7tQ": {
    "date": "12/27/2017",
    "text": "This was our 3rd attempt for this place.  Its so convenient  and there aren't alot of choices in Mint Hill,   but again, we waited to sit, we waited longer for food, we even waited to pay.  Seems to be more of a management  issue.  Agree with the other reviewer,  staff are slow, but question if its kitchen staff or wait staff.   None-the-less if you don't have time to wait and wait and wait, might want to choose somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4qawplYO2kKgdIotajkfag"
  },
  "2_YZqJ6EyJ28dynK_hc7oA": {
    "date": "11/17/2017",
    "text": "Worst experience ever. Horrible service. Horrible attitudes, awful food, especially the fries. They tasted like they were cooked a couple days ago.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "UfBjXEucoaDIanOMgvN86Q"
  },
  "8zhV7MbtsruC80w85ufYJQ": {
    "date": "11/29/2017",
    "text": "My first and last visit was terrible...long wait for waitress to come to our table. She had to return multiple times to verify our order. Then forgot to put it in the system. While we waited for our food a group of people had a puppy at the bar! It was walking around the seating area and climbing on the couch. Then 2 waitress came by and played with and petted the dog before grabbing a tray and picking up drinks. All this and the overpriced food wasn't all that good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4vNRVUJf0bFl3L4oVf8JGg"
  },
  "QXdJTJqQY4FH7QyNIRQ_FA": {
    "date": "9/6/2017",
    "text": "Will definitely be going back here!  Met a couple girlfriends for drinks/appetizers and it was wonderful.  It's new, so the inside is nice and clean and the atmosphere was great.  Service was fabulous and the food was good.  Sometimes these places are hit and miss with appetizers, but definitely no complaints!  One thing to look out for is the lack of parking, just FYI.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Kk0hkh6JxwEfG_uXFDzYg"
  },
  "6DQZWshq2AwdnnXWOzzn2A": {
    "date": "10/15/2017",
    "text": "Nice, new restaurant in Mint Hill.  Location and parking are good, friendly staff and pretty good menu.  Large draft selection with plenty of local choices.  Food is pretty good, but a little pricey compared to nearby competition (items about $2-3 higher than expectations).  Atmosphere mixed.  Nicer upscale/casual decor, but too many TVs cheapens the look.  Definitely worth a try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "n8k2JJbuIDDFbwfMk-GP1A"
  },
  "NQG0FqgvOuRNGrlP5rqFGg": {
    "date": "12/28/2017",
    "text": "Great service. The food was good. The drinks were so so. But the service was so good I'd would so go back. We ordered the southern burger and bean burger. Bean burger was huge and you can tell or it seemed very natural yet hearty. Nothing like normal vegan foods. The southern burger was typical but well made. The signature drinks on the other hand need some work. More of a selection and maybe lighter or better balance of the booze would be better. Overall 5++ outta 5 for outstanding service. 3.5 for the food and 3 for the drinks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6fm0h_nPcIOgiFSrpv9wjg"
  },
  "1TdGYmLJCO3jISIjJFJvag": {
    "date": "2/8/2018",
    "text": "We went on a Monday evening, just 2 of us.  The restaurant was 3/4 empty, more wait staff than customers.  It took over 45 minutes to get 2 hamburgers, which were not that good.  One was made with the wrong toppings and had to be re-fired.  Both burgers were overdone.  Server was excellent, she kept coming by to apologize for the kitchen.  She gave us a free appetizer.  There are much better places around, we will not go back to this one.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OYT85xcaEzWR572LvQI7IQ"
  },
  "Zvcmb1sa6qOsHZdZto7xdQ": {
    "date": "9/25/2017",
    "text": "Nice patio and good food, friendly fast service too. Good beer selection and desserts are delicious. I had the ahi tuna salad and the fish was nice quality, the salad itself was a bit oily but tasty. Steaks seemed over cooked but salmon and sides done well. Worst thing is the acoustics are very bad and it's incredibly loud. The porch is great but your right on the road so lots of traffic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "LbWO58B30J_Lb8ugFIBaSw": {
    "date": "8/31/2017",
    "text": "Food was very good as was the service  Noise level too high for civil conversation  Wish they would serve meals and not just drinks & apps outside",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "-CCxmSRddBNGA2s4Xgk3aw"
  },
  "NlBxcam9jGZsHis-kURDAw": {
    "date": "8/30/2017",
    "text": "Went first time . Had to wait 30 minutes and they set us on deck which is nice but only can get appetizers and drinks outside. Would have been nice to be able to eat out there. But issue is they text you. They bring drinks and then we get texted which unfortunately did not see immediately. So asked waitress how I pay for drinks and she said have to wait. So did and then went up to get table and they said too long over 10 minutes. Need a better process this is terrible. Daughter went Day before and food was ok steak ask for rare and came well done. It took so long to get they just ate it. Need to work out kinks quick.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "FDznGpFGibOgks7Cxz3f4A"
  },
  "wnj4zT-hVWU5Y1ZrZHSrVw": {
    "date": "7/7/2018",
    "text": "Excellant service at the Mint Hill location - thank you to our waitress Stephanie! Best baked potatoe with all the fixings you will find anywhere. Tried the side order of fettuccini alfredo, it was also great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R6VOqWBqDNlhZROCzm6pSQ"
  },
  "AEyZjDRG4h5hPsrOU7JiuQ": {
    "date": "8/27/2017",
    "text": "Brook our waitress was awesome. Food an atmosphere great.  FINALLY Mint Hill has a great restaurant.  The wings are awesome & the burgers an 3 dip chips. Quesa cheese dip, pica, Guacamole",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "218UwmxL0OGC3we3CZAcwg"
  },
  "1qw5FzJIKzf85iz9_-qHmw": {
    "date": "12/9/2017",
    "text": "One of our goto places with great burgers and amazing appetizers.  They also have very laid back live music on Friday nights. You can sit on the couch with a cold beverage and some apps. We have our favorite servers, Clint and Cam but 90% of them are great. It is always hopping after 6 so get there early or prepare for a little bit of a wait, especially on weekends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0RMsaFSR7F0WiDn94CXwhg"
  },
  "284SLCCsTwQkE_vce_c_aw": {
    "date": "6/5/2018",
    "text": "Decided to give Char Bar another try.  I had a grilled chicken salad.  I now understand what \"rubber chicken\" dinner means.  2 bites and I didn't touch the rest of it.  Never tasted anything like it. No one asked how is dinner?  Our server did not notice that most of the meat was still on the plate.  I think the restaurant is so busy that do not need to take any pride in their work.  Managements obvious lack of concern about quality speaks.  Their is such little competition in Mint Hill that there seems to be room for an attractive building with lousy food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fk0FhycV3A26Dxx1yT38dg"
  },
  "cDKFGukULIQK4_SaKmOOOA": {
    "date": "11/14/2017",
    "text": "Last night was my 5th visit the CharBar7, and up until then, I would have given this place 5 stars. Although our waitress was nice, everything else fell short compared to our other visits: -the usually soft pretzels were ROCK HARD, and beer cheese was stiff and solid -the burger was EXTRA salty.  -we were sitting on the screened in/heated patio, employees decided to socialize and smoke right outside the patio door, and prop it open with a chair, letting all of the cold air and smoke in. -kitchen staff was sitting in booths in the aprons talking on the phone and taking what looked like a break.  There was not a manager in sight. We left the restaurant to finish watching the football game somewhere else. We will give them another chance, but it looked like a free for all that evening.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqxT0m98S_SSmA9zGNWyFA"
  },
  "sU287GrH2jR9swGYhXfdjg": {
    "date": "9/3/2017",
    "text": "Great atmosphere and nice staff. The food is ok but nothing special. Wifes steak was tough and overcooked. Bar is too small and for some reason you can't order a meal at the outside patio.  Hopefully it gets better!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ThdOkhzcGLykfhbWKCyT0w"
  },
  "0MkbBvN7t-jwYCFo7mowmg": {
    "date": "8/22/2017",
    "text": "We made it for the first public dinner tonight. We went early and was greated very warmly and shown to a table right away. The table was near the front door and stayed busy with foot traffic during the entire meal. The waitstaff seemed overwelmed. We had long waits for drinks, food, dessert, the check and cashng out. Did not expect the Cigar City Florida Cracker beer to be a draft and it tasted a lot like  Blue Moon and since when is  Moscow Mule a \" charbar7 signature drink\" ? The appetizer was served barely above room temperature. The ribeye was nothing special, cooked as ordered, but I've  had better quality steaks at a lesser price. The smother me naked burger was not as advertised. There was no sizzling skillet and the field greens salad never arrived. Overall a big letdown from the newest place in Mint Hill.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WeOXN4Rt68agVxnAYn-9eg"
  },
  "ZTeCwl15mX2Ptr8T7O-mvw": {
    "date": "2/14/2018",
    "text": "I came here for lunch on Valentine's Day the ambience is beautiful, very clean. Servers are friendly and nice. I ordered the Mahi Mahi tacos they are fantastic with mushroom risotto it is out of this world delicious. I would come back here and bring my hubby and recommend everyone to try this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HTD9RtYHw3m7F_GfwiQf1A",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HTD9RtYHw3m7F_GfwiQf1A/o.jpg"
      },
      {
        "img_id": "7RP7FOy1_i4hk78dAELxDA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7RP7FOy1_i4hk78dAELxDA/o.jpg"
      }
    ],
    "user_id": "Rm0PKpq0cTolfatZKaQBug"
  },
  "lG4HQ6G0vSifRghj_jSqZg": {
    "date": "10/14/2017",
    "text": "Went with a large group we tried to call ahead but were told when we called that you could only do that two or more hours ahead. So we did not get put on the wait list till we got there. Got there close to 9 pm and the wait was 30 -40 mins , not too bad considering we had a group.  Inside the decor was nice but it was way too loud. We had to speak very loudly just to be heard across a 2.5 foot wide table. Which was one of those high tables which I find uncomfortable.  When ordering I ordered from a section called PLATED (see pic). Under the section's title it says ( Served with one side) with a list of sides under the section.  Each item in the section is listed in bold with a discrimination of the dish under the name of the item.  One would think that you get the described dish and you get to pick one of the sides listed. If you thought that you would be wrong. I ordered the Fish AND Chips. Well when I said what side I wanted I was told the chips part of the (Fish AND Chips) was my side. Again see pic. One of the items description said served with a mixed green salad. I guess that was the side for that one. And I guess the chicken finger plate the side is honey mustard dipping sauce.  So for two small pieces of cod and some potato chips with a sweet tea (notice in the pic the glass was empty, that happened a lot which is a sin in the hot south) the cost was just over $20 before tip.  Overall it was just ok. And plan to bring your phone because that's how they let you know your table is ready (you have to give your phone number) plus you will need your phone to text the people at the table with you cause you can't hear what they are saying.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "cs88BtOxjU0kU5Hob8ZxYg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/cs88BtOxjU0kU5Hob8ZxYg/o.jpg"
      }
    ],
    "user_id": "tPxfbLKh-Z3wRiaS52bwsg"
  },
  "Y6yrF_FVB0dojqfK6WBDQQ": {
    "date": "10/5/2017",
    "text": "I was excited for a new place in Mint Hill but unfortunately never got to try them out and will likely not come back until they get a new manager and better staff.   Manager was very rude to husband so we had to leave and he refuses to go back. On different occasion was extremely rude to friends of ours and they will not go back. Same thing with another set of friends. Who hired this man? He has unfortunately pissed off a group of people that know a lot of people and spend a lot of money going out. This could have been one of those places but we will not support a business that does not respect our presence and money.   So we will continue to support out favorites this way, Hawthorne's, The Hill, Vintners, Dunwellz.   Oh and another bar only open until 11pm? NEXT",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "Jn83ongLzjIWx668iV5eqg"
  },
  "yl-cM1_cZ0urAviwkQPKzw": {
    "date": "5/1/2018",
    "text": "Wound up here because DunWellz had a wait. There's a reason this place did not. Our waitress, Haley, was great. Our food was not. Hubby's medium burger was very pink inside. Fries cold. Bleh. My gluten free bun was wet from the red meat juices and fell completely apart. Bleh. My side of broccoli was cold. Bleh. It was so loud, we had to shout to hear one another. Not relaxing at all. Both of us felt heavy and bloated after eating here.  Next time we will fire up the grill ourselves.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jq-QdONgPAc_CMmNDlVvRQ"
  },
  "c5k1Zk0FqfgHNOtRJtgpZw": {
    "date": "7/15/2018",
    "text": "We recently moved to the Mint Hill/Matthews area.  I am always looking for vegan friendly restaurants. Char Bar #7 offers only one option, but it is a good one.  The Black Bean Burger can be made vegan by requesting no cheese slice on top.  The burger was big and flavorful.  In the best of all worlds, the burger would have a non-dairy cheese option and more vegan (plant-based) sides.  More people are looking for plant-based options. I will return for another bean burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u-9gVE-7uemB-VBTbb3b3Q"
  },
  "OxWTD037jX0T9OX9Soui_Q": {
    "date": "5/5/2018",
    "text": "Went to Char Bar No 7 in Mint Hill last night with a few friends.  I have been maybe 3 times previously and was always mostly pleased.  This time the experience was absolutely wonderful.  The staff was on point for everything, and the gentleman that I assumed to be the GM gave us extra care.  The food was great and our drinks were kept full as we needed.  We sat later in the fireplace area and listened to a singer play and sing songs.  Had a really wonderful time there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJguBxPlnTW29tRTAF0nkQ"
  },
  "wDnoDS3dshKh-uEcrdk1XA": {
    "date": "10/2/2017",
    "text": "there is no ZERO stars  Say something good, it's good it is far enough away I will not be tempted to return. Perhaps the world needed another TV Sports Bar, probably not! So that covers the atmosphere. Noise, well like all the rest, they think their customers are all deaf.  So drinks, ask for a tea ice tea with lemon, sorry out of lemons. And the tea was very weak, most likely as it appeared to be poured about 30 min prior, the ice (what was not melted) was little pieces of smooth ice floating on top. Limp wilty lettuce in the salads. The Quesada was cold and had almost returned to solid cheese, a few chips large enough to dip and the rest crumbs.   But to finish it off, first the chicken wings (flavorless and were closer to the size of Robin wings) were still pink inside and then there was the one that still had feathers on it. I AM SERIOUS, feathers covered with batter and fried. When the manager arrived at the table, a man with the personality of a snail, who simply told us \" we buy our wings from an outside producer and have no control, we try to catch stuff like the feathers before we cook them but sometimes they get missed, I will take them off your bill\" and with that walked away.   Service, well, they have to start someplace. It took 5 minuets to find a waitress who would make eye-contact to get them to the table.   This was our first experience with any of these Char grill places. Everyone in our party of 4 left most of the food on the plate. We had a variety of menu items, beef, chicken, salmon and most of it was left, no one wanted a to go box.  If you are hankering for a few wings to watch a game with, suggest, stay home, you can turn the TV to a volume that is not painful, and order some wings from any number of places, they will be better and you can have fresh ice in your drinks.  NEVER AGAIN",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "bHkbTwZwix1r9tqz4siOgg"
  },
  "R44t3YRZ33du3wr6y-5LEg": {
    "date": "9/15/2017",
    "text": "Not crazy about it at first  1st I tried to order wings to go over the phone and they don't do that ! Really . They want you  come in and sit and wait. Ridiculous. I got wings somewhere else .  Now we went in to eat  The floor is greasy or some Residue ... my chair slides  if I lean.  We waited an hour not too bad for Friday night we were warned .  The manager was dry and condescending.  The waitress took a while .. she then took a napkin off then table to write down our order. That was odd.  The garlic wings were really good . The beer selection is very good . Kids menu options also very good .. they have steak on it !  The atmosphere is good  They only opened 2 weeks i would Like to think it will get better .. I would go probably back .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "miT3fh21VMk9H5CTkTozIA"
  },
  "JknmdqbD_4lKy5MV78OfjQ": {
    "date": "12/31/2018",
    "text": "Unreal showed up at 3:30pm today and sat at the bar and waited and waited while watching a sever put her makeup on.  Waited forever on service from the bar tender.  First and last time going there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QlEShS2mviytW7LC_jrNxw"
  },
  "WahnDr9MuZqI46unrVeAqg": {
    "date": "11/16/2018",
    "text": "Very good food, friendly staff and very nice atmosphere!  Need more restaurants like this in Mint Hill. The outside area is awesome and the open air bar makes you feel like your on vacation.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NXRYUISRrLEFOKvT9TAjEA"
  },
  "DaJl5t4Ggh5TnG9Z0qTWFw": {
    "date": "12/17/2018",
    "text": "Visited a few times with family. Dine in experience is much better than ordering to-go. Long holds on the phone and the food is never ready when they say it will be. Placed an order over an hour ago and I'm still sitting here waiting. Wasn't greeted when I came in and haven't been checked on after I paid. They say the kitchen is backed up however, I've seen people be seated and have food brought to their table since I've been waiting here. How long does it take to prepare chicken wings and French fries?",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RR-09CwVb_TxNMYwVxRh8A"
  },
  "Yp-NL3hfid6GkOG5IlTOgA": {
    "date": "4/25/2018",
    "text": "Came one night for drinks... came back a Second night because we loved the outdoor patio and menu looked good! Food was great. We got a small order of Chicken Nachos, and French dip and Cali-Turkey for entrees. Sweet Potato tots are delicious",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ctZc0fomkWwH_b_gR3F-Ew"
  },
  "GFRuamCsVNIOYCdaKbKmpQ": {
    "date": "9/23/2017",
    "text": "We had the fried pickles as an appetizer, they are cut in spears and not round chips which was different. Breaking was crispy and good and so was the sauce. I had a wedge salad and at first I thought there was no dressing but most of it was underneath.  It was good! Husband got a burger and the fries were great. Very loud, went there for late lunch.  Huge place. Open patio.  A wonderful addition to mint hill!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W6reSzwNzkiap6or1OOBMA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Burger and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W6reSzwNzkiap6or1OOBMA/o.jpg"
      },
      {
        "img_id": "XzbcF8OHOhBCq8NbpGjxrg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Wedge salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XzbcF8OHOhBCq8NbpGjxrg/o.jpg"
      },
      {
        "img_id": "z7P8WsIfN4WRjJfgoERD6Q",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Fried pickles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z7P8WsIfN4WRjJfgoERD6Q/o.jpg"
      }
    ],
    "user_id": "pOAOkXP-_TEOj6v0Z0BBew"
  },
  "aGkwutfomI_bMpZR3SUouA": {
    "date": "9/3/2017",
    "text": "Was told 30 min wait after an hour we went to check and we're still #7 to be seated so dicided to sit outside and have a drink  and wait. after another hour waiting decided to go check again and our reservation was gone??? Never got text that we where next, nothing. Open tables sat for 10-15 min before being turned???? Losing money mint-hill... New store so hope they will get there act together... kinda disappointed Oh ya apparently you can bring your dogs, and not service dogs?????",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O-OH_OTcmQhAQ-xeR2qh2g"
  },
  "Jp1piR3WWIPbF29x9pIoCA": {
    "date": "2/7/2018",
    "text": "We literally just walked out after sitting at our table over 10 minutes without a single glance from a server. There were no less than four servers standing around at a single table talking to each other. When we finally got up and left, there were another two just hanging out watching out the front window and another two hanging out at the hostess station. This happened about 5:20. For the prices they're asking, you would think they'd at least throw some water your direction when you sit down.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2lBMdsTVHV6_kCF_v0irhg"
  },
  "1xK0kvc5qvaJjLXRws6VMQ": {
    "date": "5/28/2018",
    "text": "Glad to have them in Mint Hill! Great food and the covered patio offers some great ambiance to the dining experience. My little family loves going here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Sc7wATsuzJk7QaJMP0uVg"
  },
  "Zq0DAAttXds6TC2eEy_FAA": {
    "date": "8/23/2017",
    "text": "I am SO excited we have a new restaurant in Mint Hill. I'm a fan of the CharBar in Matthews so I figured this would be just as good. The decor in here is amazing. They did an awesome job with the design and I love how the doors open onto the patio. It just gives it a cool feel.   I expected some issues since it was opening night, but everything went smooth. Our server was very friendly and fast. Our beers took a little long to come out, but I believe it was due to the fact there was a very needy table who wouldn't let our waitress go get the beers. Our food came out fast and fresh and at the correct temperature. I had the pretzels and my husband had a burger and tater tots.   We will definitely be regulars here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FXLgZKEUeseWqJuijJC06g"
  },
  "WEFpRpHJun_ZmQ_3dIlsQg": {
    "date": "3/29/2018",
    "text": "Insanely slow service for a burger? Don't see a point in this place. I might wait for a special culinary feast this sure wasn't it. The ambience is pleasant the burgers are burgers and the service crawls we won't bother coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QC9loxQg0yw_jMWwAjkwbQ"
  },
  "YiHFwLUlRGPAjF-AGHNb-w": {
    "date": "11/17/2018",
    "text": "Despite the somewhat bad ratings, we went here for dinner and had a great meal. Good service, burger & salad was good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTf6mRolwf5cK_QnUz0uYQ"
  },
  "JyrYLNnnpYrayP7D8p0N6g": {
    "date": "3/31/2018",
    "text": "This place is okay. Really crowded and definitely overpriced. But, since there are not really any better food options in Mint Hill I think they are a good choice if you don't mind spending a little more than what you get is worth. I wouldn't recommend the steaks, though. Pricier item on the menu and not worth it. Stick to burgers and salads.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8E8B8MkTgwX2mTUqNeKUjQ"
  },
  "9YzhZ72UXhgzm8lRmPJzCw": {
    "date": "7/4/2019",
    "text": "This restaurant is definitely a \"hit or miss\". The only things that are consistently great about this location are the bar tenders and cheesecake. The bar tenders are fantastic, along with the deserts! The food is great on some occasions and not very good on other occasions. Service outside of the bartenders is not great.. the manager was observed on her cell phone, behind the bar for nearly half an hour. Meanwhile, customers are patiently waiting on their food to be served (we noticed a customer waiting for nearly an hour for their food). This place has great potential as the atmosphere is fantastic, but definitely needs better management/cooks and servers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "14Xq7864pmlcsLN8_JXonA"
  },
  "ldPc0CPDUcX9sVkGlegtdA": {
    "date": "7/31/2018",
    "text": "This was our first visit. We stopped in after watching a soccer game one Saturday evening. It was close to 10:00 PM and the restaurant was fairly empty. We sat at the bar top and the service was just okay. We asked the bartender for recommendations and wound up ordering a burger he said was good. It was just ok. The onion straws were under the cheese and by the time the burger came to us they were soggy and kind of a mass of melted cheese/onion straws/bacon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "25ybmmDAk7wQFGbHahLvNw",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/25ybmmDAk7wQFGbHahLvNw/o.jpg"
      }
    ],
    "user_id": "V-vHgpadQSrsRE4ReGhEPQ"
  },
  "sqrsTeZrTmZOrSQKsueZsg": {
    "date": "7/17/2018",
    "text": "This place is better than I expected, Apparently they have new managers. Our food was very good for the price.   My Caesar salad was the way I like it. Heavy on the dressing and heavy on the cheese. Maybe a it's not to everyone's taste, but I loved it! And it was $4.   The floor was very greasy around the bathrooms, they really need to work on that.  However the reason I am giving it 5 stars was because it was very economical. Great value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RV082U9cEOf2fwmThBMxBA"
  },
  "M-N9SXUJBQqJDWu6zbC2pw": {
    "date": "10/23/2017",
    "text": "EDIT: I hate to say this, because the soft opening set the restaurant up for so much potential and I wanted this to be a great new spot in Mint Hill.   I've gone back three times since my initial review, each time hoping it was just an \"off day\" for the Char Bar staff. Unfortunately, it seems pretty consistent. It's almost as if the restaurant is functioning in slow motion. Each time I've gone since the soft opening, we are seated and it's a 15 minute wait until a drink is placed in front of you. This has been a mixture of not having staff attend to the table quickly and putting in a drink order that takes an extremely long time. I've never been on a night where it was overly busy by any means, so I can't figure out what the issue is. The service doesn't improve after that though, last night we weren't served our entrees for 45 minutes after ordering...they were both salads. One had grilled chicken and one was a salmon patty (the salad was served with grilled salmon making it an even longer wait on top of that for the correct protein), but it should not have taken that long.  Something is just not coming together at this location. I'm not sure if the staff needs to be better trained, the manager needs to be more involved or the communication needs to improve between front and back of house...but something needs to change. Glancing through the other reviews it seems like this is pretty consistent. I would love to see it turn around!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehqxXKlMjg0H3FkxCySXiA"
  },
  "JtPnof1RvDBKflPKm-PTcA": {
    "date": "2/22/2019",
    "text": "Great having a nice restaurant/ bar in the area! Reasonable price drinks and great food. The menu has great variety without being loaded down with unnecessary options. We started with wings with a nice char. Smoky, sweet, and slightly spicy , the wings were a great appetizer. My husband enjoyed the black bean burger, broccoli and Brussels. Generous portions and cooked to perfection. I enjoyed the Brussel salad with grilled chicken, candied walnuts, bleu cheese crumbles and vinaigrette dressing. Friday night had live music which added to the festive environment. Definitely recommend for a nice night out with friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WxEENKbcHsmiHk7QH_VTQg"
  },
  "ZtJROvjhqdvD7WGSQuVb8w": {
    "date": "9/29/2017",
    "text": "Had a pleasant experience at Char Bar. Drinks and apps were great- there's knowledgeable staff who are very engaging.   Unfortunately the food is not quite up to par with the service. I ordered a salad with steak cooked med, and it came well done. And my dining partner ordered chicken with mac & cheese. Now I'm not an expert. But I'm pretty sure it was from the blue box of kraft that they were serving. I don't know if this is a one time occasion or if this is always the version of the dish served. Just because it was served in cast iron...  But (while the blue box was cooked exactly to package directions and tasted fine) there was a higher expectation from our table. We did have a good laugh, though.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hiq2gQPL8eU7ibF3PY7N4Q",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. I&amp;#39;m sure you can see what kind of mac&amp;amp;cheese this is. Might have been a one time thing. But there was a higher expectation from our table.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hiq2gQPL8eU7ibF3PY7N4Q/o.jpg"
      }
    ],
    "user_id": "Kj1a-BIOa0vYCoyk0-Dw5A"
  },
  "IC0xhU5KejRHHwtLeXCUww": {
    "date": "8/29/2017",
    "text": "Where do I start...it was a Monday night and my wifey and kiddo went to this fine establishment for dinner.  We have been to the Char Bar in Matthews several times and have always been pleased however, tonight wasn't as pleasing.  We were quickly seated and given menus, then we waited...and waited...and waited.  Approximately 10-15 minutes with not even being acknowledged before the manager made her rounds to check on everyone although, several staff members walked right by us seemingly trying to not look our way.  Great that she did, note to self, if I ever open a restaurant execute the manager making rounds strategy.  I told her we had not been helped or even acknowledged.  She quickly took our drink orders and was back in a couple of minutes with our server.  Our server was nice and responsive, he did forget a couple of things but not a deal breaker.  He was nice and attentive.  The interesting thing was the ratio of wait staff to tables was close to 1:1.  Odd that there were that many servers to tables but once you saw them catch up on all of there chatter you realized they needed to beef up the help to allow everyone to chat.  Exactly 40 minutes, thats right FORTY minutes after we were seated our food arrived.  Nothing complicated, chicken, kids steak and a salad.  It was all very well cooked but dang, after 40 minutes I could have screwed it all up five times and had plenty of time to fix it.  I pointed out our wait time to the server and the manager quickly came over and both apologized.  They reduced the bill and continued to apologize so I was okay with that.  It was their first week being open so I give them credit on their recovery and would recommend giving them a shot...I will.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "81to8rjAxlcpI65EWRtaVQ"
  },
  "oUkx00wUizVPRtpv_yR2Vg": {
    "date": "12/7/2018",
    "text": "Had never been to one of the locations before Mint Hill but A little disappointing. Food was average for the price and parking is very limited.  There are a couple locally owned establishments with better burgers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "11L_LlThnXPKdSLNevXERQ"
  },
  "fee9psewtCpTL4uPGsKZmg": {
    "date": "1/10/2019",
    "text": "One of my favorite restaurants, the service is great every time. All the food is wonderful. It is always a good place to go when you are in Mint Hill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ahrjCeMF3XN5DwQm7bFyMQ"
  },
  "zJqIhDAegBpoPlkaR88hBg": {
    "date": "12/31/2018",
    "text": "I've been here a few times. I wasn't a fan last time. The nachos were overloaded with cheese where they became soggy. It is conveniently located and there's plenty of parking. Prices are about average and not very pricey which is a great night if you want to get out for dinner with he family.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p27QlOgvs7Fqq-Fq1F14tA"
  },
  "wGVnELSGKkqwtGJXWUAuWA": {
    "date": "4/20/2018",
    "text": "The pork belly tacos are fantastic, very spicy and hot. I come here at least once a month, the food is always good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JR7iCGNqxQabeRLiSUQ-Zg"
  },
  "V_60g2O1lrXAftpAelfDPA": {
    "date": "2/3/2018",
    "text": "1st time here and so far so good. The ambiance is beautiful and the staff is nice. I can't stop picturing the layout, that fireplace, the service and everything. A must visit. Food was spectacular. Thanks Alex/Steve our waiter......",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sFDG30Hn6DCueOkQOnscHg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sFDG30Hn6DCueOkQOnscHg/o.jpg"
      },
      {
        "img_id": "SyoXDvvN7wfBEF7V8DBk0g",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SyoXDvvN7wfBEF7V8DBk0g/o.jpg"
      }
    ],
    "user_id": "ged1bTxekQpD6TwJ-3568A"
  },
  "ZAIoZg9WYp0-TbsQ4Yny5g": {
    "date": "9/6/2017",
    "text": "Just had dinner here for the first time. They are brand dandy new so any so called \"negative observations\" - are only because they are new....it should not be held against them in any way. Most places take a few months to find their rhythm if they are a chain. Which CharBar 7 is...  So....I gave them a five star for food delivery speed, quality of food prep/presentation and flavor as well as server personality and pleasantness.   I had the 12oz ribeye, side salad and sauteed spinach with a slice of garlic/Texas toast. Amazing!!! Cooked Medium and delivered as such. Wonderful seasoning.   Suggestions for the chef...serve a slice of fresh lemon to put over the spinach to give it a nice flavorful zing. It breaks up the spinachs ability to put a chalky feel on the back of your teeth. A bit oily/buttery so to a little lighter. Otherwise really good!!  Their house Merlot is very good, fruity and smooth. Desserts were great. Glad the menu wasn't huge, they definitely focused on the right mix.  I had to ask for extra napkins, I had to ask for A1, I counted apx 14 servers and bar staff and while seated quickly and with a smile, took almost ten minutes to get someone to take my order. For a drink but I was ready with my food too :D  Having said that...folks that's just normal growing pains and training which CharBar did in spades tonight! Great job, every waitress I saw had someone shadowing them. It was quiet when I got here before 5.  The staff were amazingly pleasant and attentive once served. Which is why I said the five star is for what counts.... everything was what I'd expect and want in a new place to eat out. You shouldn't and can't write a review bashing what amounts to training.   Time will tell, wait six months and write another review but from what I saw tonight? Great new place!! Can't wait to come back again. Just go during the week and before 530pm to avoid crowds.   Oh, they close for the afternoon so plan to arrive by 4pm on a week day to beat the crush.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ytLbHVOvBtCYkzdkVoNEPg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Citrus Vinegrette dressing was very good!!! Next time I&amp;#39;m going to try the wedge.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ytLbHVOvBtCYkzdkVoNEPg/o.jpg"
      }
    ],
    "user_id": "dGpvCBDP_LH6GWmDDN6r5g"
  },
  "QtXZ_KxdEL97vBUGetn5Ag": {
    "date": "9/25/2018",
    "text": "The decor is nice and the staff was friendly. That being said the food was over cooked and wasn't appetizing. For a nice restaurant in the area you would expect more. This place should be the hot spot but Instead I will drive an additional 10 minutes to find another place to eat. Bring in someone who can manage the line cooks. The fish smelt old and not pleasant. The chicken was over cooked and tasted like frozen chicken. I will always support our local establishments but they need to step it up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHiFWbXmqQ1e78GM8178Ew"
  },
  "lHxFwMx5lPsfdcUrWIaR-g": {
    "date": "11/14/2018",
    "text": "Went tonight (11/14/18) for Friends Birthday.  We waited with a party of six.  20 minutes. No biggie except they kept sitting parties of four. We counted 11 empty tables. But they were for four. Anyway got seated. Took another 15 minutes for water. We got the three choice appetizer which is always good.  I had ask could they change the tv to music awards.  No. Has to be on sports. 8 other TVs in this area. We were only table near this tv.  After a hour of no food.  We got up spoke to lady. Told her we couldn't wait anymore.  We got there at 6:45. We didn't have any food at 8:30.   I went to get car. My daughter came out with big bag.  They had comped the food because of their own slowness.  When I got home. I was happy to find they had remembered the horseradish sauce for my fries and hamburger was delicious. I took one little bite and it will be my lunch tomorrow.  I guess they need more help in the kitchen.   Hope they get it. We don't have a lot of restaurants in Mint Hill.  Horseradish sauce was delish.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Nh7uMWGc6ysTgZLhZv6kQQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Nh7uMWGc6ysTgZLhZv6kQQ/o.jpg"
      },
      {
        "img_id": "_jUIynCm3M7o9UjTSIw7SQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_jUIynCm3M7o9UjTSIw7SQ/o.jpg"
      }
    ],
    "user_id": "g1kxNqjFWe67NcxWGdjeFQ"
  },
  "HVpqVpLdscvvra7zT6a1QQ": {
    "date": "12/13/2017",
    "text": "Came here for lunch, i decided on the prime rib french dip which was awesome. I got a side of baked potato, which was huge. My wife got the smokehouse burger which was good along with tater tots.   I gave them 4 because the food was great. However, make sure you have time to wait because the staff works on the slow side.   All in all, the place is awesome and clean. Great place to watch the game, get a brew amd relax. Next time, I wanna try the outdoor patio with fireplace.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxcN4e5SKNhZ4wfEUbAMRA"
  },
  "_k3Bv5hCOTUHBAAPqqSI4w": {
    "date": "2/17/2019",
    "text": "Although a chain, what an incredible place to have in Mint Hill! Clint is top-drawer as are bartenders. Stephanie rocks! Although the menu is limited, I've never been disappointed. The live music on Wednesdays and Fridays is nice and so many of them are amazing! Warm and professional atmosphere. My friends and I enjoy a girls night out and I enjoy going to the bar one in awhile after a long work day for a good meal (plenty of \"elbow room\")! The patio is wonderful year-round.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9g8ss0jq8uzPT9sI5yeq9A"
  },
  "aD6XYTL9l6Glmy_B7v2erg": {
    "date": "6/8/2018",
    "text": "We went to Char Bar 7 Mint Hill today for lunch, first let me say this is the first time I have had issues as I have been to location several times. We arrived around 1:45 pm there were very few tables of customers, however we stood at the front door and waited to be seated for 10 minutes. While we were standing there a lady I assume was the manager ran by us a few times and never said a word. We finally got seated and got our waitress and ordered, my niece got Seared Ahi Tuna and I got Smoked Turkey Sandwich with tater tots and a side of fettuccine Alfredo. We waited 30 minutes for our food to arrive our waitress apparently knew the people at the table beside us she stood there talking while we had empty glasses and no lunch. When the food finally came the sandwich was delicious the tater tots were nasty they were overcooked and cold and the fettuccine was flavorless it was like it was missing the cheese all butter. The waitress did bring me fries for the tater tots, but nothing else was addressed and even that seemed like a problem. I am very disappointed as the Char Bar is one of the nicest restaurants we have in Mint Hill it is also expensive, especially when the food isn't up to standard and the service is lacking.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "amzyjiLF_qu3v2ESDb34sw",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Mushroom Risotto",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/amzyjiLF_qu3v2ESDb34sw/o.jpg"
      },
      {
        "img_id": "jdv5w5N-LurSW9EokPTS3g",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Smoked Turkey Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jdv5w5N-LurSW9EokPTS3g/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "sybs27WuA6mLkw-7ikMJnQ": {
    "date": "8/4/2018",
    "text": "Well it took ten minutes for the waitress to even greet us, and when she did, she said, \"what do you want to drink?\"  We Just brushed that off thinking, maybe she was busy; however, the appetizer and dinner was the same exact short questions.  After dinner was served, she disappeared, and I mean disappeared.  Three tables of people were attempting to get help.  Finally, I began waiving my hand and a manager came over to assist, only it was obvious that he did not want to assist us either. He did not even apologize for the poor service.  On the plus side the salad and fried pickles were tasty.  With that said, if you don't care about quality customer service then you will enjoy this restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k8C-FB_wq-H4FiUwKBb8Ow"
  },
  "oaCWYQpjFAemEufjXcNvEQ": {
    "date": "2/21/2019",
    "text": "I tried this place a couple of times just after they opened with less than a great food experience. They have now kicked it up a notch with great food and great atmosphere I highly recommend for a nice evening out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0XEeGU-SODWP8PiLYcu5g"
  },
  "nRf-qDDDETeXek9ITzTMqA": {
    "date": "7/19/2019",
    "text": "Charlotte burger week lead us here. The restaurant was not too busy so we were immediately seated upon arriving.   We obviously got the burger week special. The smokehouse burger came with onion straws, bacon, tomato, lettuce, and their special Cb7 sauce. The burger was juicy and the onion straws gave it a nice crunch. The service was extremely fast, no joke the food was out in less than five minutes after we placed the order.  Fast service, friendly staff, and solid burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HyKAa-OHF6D39tKf8Uz9qQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Smokehouse burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HyKAa-OHF6D39tKf8Uz9qQ/o.jpg"
      },
      {
        "img_id": "sFK89mUm9vLyqvfibgR8nA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Sign",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sFK89mUm9vLyqvfibgR8nA/o.jpg"
      }
    ],
    "user_id": "CgG6X3k3DGSL2RR3ekzfsA"
  },
  "IVh0Pbr74AmdIXsXEzfSVw": {
    "date": "7/12/2019",
    "text": "Arrived at Charbar in Mint Hill and gave our name to the hostess. She told us the wait would be about 20 or 25 minutes.   After a few minutes, I got bored and wandered around. I came back to the hostess station and said, \"Are you guys shorthanded tonight? I see four tables available on this side and four tables available on the other side.\" She told me that they had gotten busy earlier and had to give the kitchen a break. I told her I understood and we went back to waiting.   For 45 minutes we stood within 5 feet of the hostess station and watched them eat an appetizer or something from the kitchen. During this time they never even acknowledge us or apologized for the additional wait. In the meantime, we watched several groups come in, give the hostess a hug and get seated immediately. Obviously the trick to getting seated in a timely fashion at Charbar is to be friends with one of the hostesses.  We finally left and went next-door to Hawthornes, which was also busy but, in a very reasonable amount of time, we were seated and taken care of. They even apologized for the very brief wait that we had to endure.  We will never return to Charbar.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "WWM9vHydm0eSSHyG-Je5vA"
  },
  "1xkMUuiEU_gKcaYaeDnAUQ": {
    "date": "3/31/2019",
    "text": "Went to char bar for a quick lunch with friends.  This was my first time ever going because we just moved to mint hill!  We were seated right away and had amazing service.  I ordered the Brussel sprout salad and it was huge and delicious!  We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "LXQhHe5vqvbOv1Bkey2w_A",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LXQhHe5vqvbOv1Bkey2w_A/o.jpg"
      },
      {
        "img_id": "eunitDZ56iejh9j40622FA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eunitDZ56iejh9j40622FA/o.jpg"
      },
      {
        "img_id": "4QMlafjgXikRzJqjF0zONw",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4QMlafjgXikRzJqjF0zONw/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "q3QD1ULPIEhq0pWnA7ncHQ": {
    "date": "5/27/2019",
    "text": "Met my friend, Ginny, for lunch.  I thought the food was just fine here.  I had the salmon with broccoli.  We had a nice visit, despite the fact that the server would not leave us alone.  We made it clear that we were not in a hurry to order, yet she kept coming back.  I think we finally exasperated her, because another server took over for her!  Overall, it was a good experience.  A little more noisy than the Matthews CHAR BAR, but not prohibitive to have conversation.   I wish they would put a CHAR BAR in Blakeney.  We would go!  Why are there only three in the Charlotte area?  This needs to be a chain that expands.  It is good all the way around!  And does not seem like a chain.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GlU2rKAqOf1KLDEainuhpA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GlU2rKAqOf1KLDEainuhpA/o.jpg"
      },
      {
        "img_id": "wCrdXe0ub0FPchZr9A6NAg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wCrdXe0ub0FPchZr9A6NAg/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "k-TT59R8mQyEKwehaF1B1g": {
    "date": "3/3/2019",
    "text": "We had the opportunity to check out Char Bar No 7 this past Friday evening.  We have been wanting to try it, and it finally fit in our schedule!  We did the yelp wait list in order to not have to wait.  We were running a little behind but our table was ready upon arrival!  That was nice, because with a 2.5 year old we try to only go places where we can sit down pretty quickly.  We were seated in the patio area which had a great vibe!  A little chilly, but the overhead heat lamps definitely helped.  The live music was out there, which was just awesome!  Not too loud, and the girls were great to listen to.  Wonderful acoustic music.  Out server was great and right on it.  Drinks came fast... but then things sloooooowed down.  One star taken away was due to kitchen speed.  We had to wait at least 30 minutes from ordering for our food, including my salad which I asked for ahead of time.  The management came over after our server realized it was taking longer than it should- and she is who ended up delivering our meal.  I will say, all employees we had any interaction with was friendly and all made an effort to speak to our son too.    Once the food got there it tasted good!  Though, my salmon was luke warm while my potato was steaming hot- I didn't want to mention it to have to wait longer.  The salmon tasted good and was seasoned well- just was cold.  My husband loved his salad, and my son seemed to enjoy his kids burger.  We did enjoy our visit, and it would make a fun date night or girls night when the live music is playing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SxO0FQ0xNTRs9MZr7o4j4g",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Wedge salad with extra chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SxO0FQ0xNTRs9MZr7o4j4g/o.jpg"
      },
      {
        "img_id": "eArLVZrDa7ieB0YrzaUAuQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. CB7 salad (small size)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eArLVZrDa7ieB0YrzaUAuQ/o.jpg"
      },
      {
        "img_id": "5UlB2D5bKneqTmaJ0FPG1w",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Salmon + huge baked potato",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5UlB2D5bKneqTmaJ0FPG1w/o.jpg"
      }
    ],
    "user_id": "HZc-l7hEkl0SIqCH8swQtw"
  },
  "p3NB437JlkyFfm7Kx_OHSQ": {
    "date": "8/18/2019",
    "text": "Service is the best around and food is always tasty! Best atmosphere for a restaurant in Mint Hill especially with the outdoor patio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B1vr6JtwRLoBzkuKzI1Q_Q"
  },
  "77FCwtqVEqvlI8DFXBoSsw": {
    "date": "6/24/2019",
    "text": "Mint Hill is definitely in need of more eating establishments. This is a fact most locals can agree on. Char Bar No 7 has become a pillar of the foodie community in Mint Hill. They have drink specials every day of the week, even the weekends! $5 House Margaritas and $3 Miller Lite drafts on Fridays? Say what?! The low lighting of the interior dining space makes this a great date night spot and the covered outdoor space makes it a great family spot as well. There's something for everyone here, from gourmet salads, hand crafted cocktails, to delicious sandwiches and perfectly  grilled cuts of meat. Their menu isn't too large that it reduces the quality of taste and presentation. The hostesses and servers are pleasant, helpful, and attentive. Expect to spend more than the average restaurant in Mint Hill but it's worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ovFBhEt28yMjW6hBBHp_gA"
  },
  "284gUaatRkfqB6oquqYSyw": {
    "date": "7/8/2019",
    "text": "Have been here 5 times and will continue to go back. Have only tried the turkey burger, AMAZING, and the shaved Brussels salad, OH MY GOD! I want to try the rest of their menu but can't help but order that salad. With blackened chicken it's even better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ZLlPgooNbdQtCpDeo3SgA"
  },
  "FydQz-phn2_67I2-0OZHag": {
    "date": "10/10/2018",
    "text": "My husband and I enjoy getting the chance to go out and enjoy a great meal together. We decided to give this restaurant a try. I'm so glad I suggested it. This place was wonderful. The staff was very attentive and welcoming. We were seated right away. Our drinks were brought out in a flash. (If you LOVE sweet tea... order it!) I don't even think we waited longer than 10 minutes before our food was brought out. Super great service. As an appetizer we tried the pretzels with cheese dip. I ordered the black bean burger with sweet potato tater tots. My husband ordered the French onion steak dip hoagie with a side of shaved brussel sprouts and bacon. The food was AMAZING. The atmosphere was awesome. Definitely plan on coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Rq5Z4M1_KsGNYN8DNW60zQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Rq5Z4M1_KsGNYN8DNW60zQ/o.jpg"
      },
      {
        "img_id": "iUv8CPL_ffsKW62tJ927Jg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iUv8CPL_ffsKW62tJ927Jg/o.jpg"
      },
      {
        "img_id": "84xYZEZO-X2dvhMYm3MpsA",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/84xYZEZO-X2dvhMYm3MpsA/o.jpg"
      }
    ],
    "user_id": "QRNzgxnW4uVkWZNkt9mH8w"
  },
  "-HtAWlMoXx20pQHsP5P2Hw": {
    "date": "6/9/2019",
    "text": "I have been here 3 times now and figured I would share my experience. On my last venture here on Friday 6-7-2019 my buddy and I had a very good evening. Got there around 730 and it was about 20 minutes until we got to sit down (it always seems busy which is a good sign it's good food). Immediately we got a waiter named Cody and he was a cool dude. Honestly was hoping to get one of the attractive waitresses, however he was pretty good and seemed like a chill guy. My buddy had fish and chips and said it was great meanwhile I had a quesadilla which was pretty good as well. Had a few kamikazes and chatted it up with our waiter and a few waitresses that were chatty as well. Overall every time I go there it is a good time weather I have a drink or not. The food is always good and comes out in a reasonable time. I will repeat.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDVTfIgXHwLMHibHMgI0OQ"
  },
  "yZhIxyWmwc4Ho18jWEEyBQ": {
    "date": "6/14/2019",
    "text": "I have been staying in Mint Hill for a few weeks now, waiting for my new apt to become available. Not having many choices here in Mint Hill, I decided to try Char Bar.  What a great decision!  I felt so at home even after my first visit.  Service, Value, Atmosphere, Food, TV situation are fantastic!  The patio side (covered) of the bar is so open and comfortable.  The quality and price of the food is very reasonable.  It's the staff that tops the experience off!  Some great personalities in this place!  Thank you Tim, Stephanie, Alex, Missy and Morgan for the excellent service!  Keep it up ladies and gents!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wJZASOG3FpM2dsvnckrQKg"
  },
  "QwTtjSPUYdXqx6-y0SiNYQ": {
    "date": "7/16/2019",
    "text": "Went during Charlotte Burger and had the CB7 burger. Glad I only paid $6 for it. It was over cooked and dry all the way through. Not the impression you want to make during a promo week. We like the place and they are quite busy but that's my last burger here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DFYdTQJ32VkQvmd_no3l2w"
  },
  "_4z59uOZxCEpRHFrHwLT7w": {
    "date": "6/10/2018",
    "text": "Very modern up town feel. It's very loud so not recommended if you're looking to have a conversation with those at your table. It looked like they had some type of outdoor covered seating but it's right on a busy street, even sitting toward the back of the restaurant we were drowned out by the sounds of traffic.  The menu was a ok albeit a little on the pricy side. General consensus was a one and done.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NHNPT0FZS8le66KO-0pzxw",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. Lunch menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NHNPT0FZS8le66KO-0pzxw/o.jpg"
      }
    ],
    "user_id": "hL6kZ7aW5wKz_9WnhRE6gQ"
  },
  "OM3u13fhCZW-vz6qro_JFg": {
    "date": "6/8/2019",
    "text": "No waitress cNe till we asked.   They removed dirty plates from table but never cleaned it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKCHgVEvpVzWBhUglNwJIQ"
  },
  "1DBfO4TC-J7w8TSbk6VoUg": {
    "date": "1/11/2019",
    "text": "Service was fast and accurate. Cali burger tasted good. My mother had a salad and enjoyed it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "yHviLI2QEJB9Pxo9iyH21g": {
    "date": "3/2/2019",
    "text": "Great place to hangout and grab a bite to eat with the kids.  The menu looks reasonable and tasty",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "z5LfLI-0u-miNODY3K9iFg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/z5LfLI-0u-miNODY3K9iFg/o.jpg"
      },
      {
        "img_id": "Zq0BPGs1aHvAUugL1RLwnQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. The menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zq0BPGs1aHvAUugL1RLwnQ/o.jpg"
      },
      {
        "img_id": "o7ui4_7F8I30mWmiW-T2Mg",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States. The menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o7ui4_7F8I30mWmiW-T2Mg/o.jpg"
      }
    ],
    "user_id": "yUnyMIYQTn22LXnNrEkBow"
  },
  "T8OMn36wt_drdZKfM7S1gQ": {
    "date": "12/13/2017",
    "text": "Ate lunch here and focused on the Smokehouse Burger and fries!  Burger was tasty, it had bacon and onion straws on it.   The fries had seasoning on them that I didn't care for.  Interior was nice and comfortable, and my server was nice too.  My bill for entree and iced tea was a little over $15 before tip, so I felt like that was a little high.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FktZscFcmTbfMpZIKtFtBQ",
        "caption": "Photo of Char Bar No 7 - Mint Hill, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FktZscFcmTbfMpZIKtFtBQ/o.jpg"
      }
    ],
    "user_id": "u8HPA-jU1njsPPAI_anMgA"
  },
  "togfkqgRgT_msevMBnLKpA": {
    "date": "4/24/2019",
    "text": "I have been to this location a couple of times for a few drinks and or food. It is really close to our home so we have been trying to support it. The drinks are always good but the food is hit or miss. I don't know what the deal is but it just is not consistent. The space is really nice as they have an outside area that is really cool, I just wish they would open up the garage doors more often. One thing that the area does not have a lot of is great outdoor seating. The bartenders are always friendly and are great to talk to so we will be back for drinks again for sure.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "DQ52KN24c_sJdDPTedq_5A": {
    "date": "11/11/2018",
    "text": "Good local chain. This particular location has gotten better since opening. This hands down has one of the black bean burgers. I don't normally eat black bean burgers either. We have also have had the fish and chips and fish tacos which were also delicious. Our family has come and no one has complained. They have a variety of options that I think the whole family can enjoy. I am glad the service here has gotten better since opening. It's definitely one of our regulars in town to eat at.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJ5rIrvfv4gsPLK-OBC3_A"
  },
  "dLwhiFz2BRbeWH5V3v97Lg": {
    "date": "5/12/2019",
    "text": "We had a wonderful experience last night. Everyone was so nice and helpful. I ordered something I ended up not liking. The manger immediately took it back and brought a different meal in no time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "seQCgUIJ9ZYDuVTGiYW1Zw"
  },
  "PA9KPhUftPQYuDEwe--0hA": {
    "date": "10/15/2017",
    "text": "We received a gift card for our anniversary. Since we live in Mint Hill, we were excited to try out this new restaurant. We  arrived around 8:00 pm and had to wait about 50 minutes. Once we were seated, we got our drinks pretty quickly. We had a hard time hearing each other, it was loud in there. We also ordered an appetizer......chips with guacamole and queso. The queso was cold, the consistency of glue and didn't have a lot of flavor. The guacamole was plain and mostly tasted like lime juice. Chipotle does a much better job with their quac. Our chips weren't that great either. I ordered the Southwestern burger and a small Caesar Salad. The salad was good and it tasted fresh. My burger came and the bun was dry....meaning no mayo or anything on it. Once I started eating it I realized it wasn't a Southwestern. The cheese on the burger appeared to be some type on spread. I believe they are using mostly pre-made food they heat up. It tastes like there is no love or real cooking behind it. The burger wasn't good. I'd like to think I know burgers. Bad Daddy's Burgers, amazing burgers! The CharBar.....completely unimpressed. I believe this is suppose to be their speciality. My husband ordered the black bean burger, it was kinda dry. Nothing really special. He also got the Fettuccine Alfredo as a side. It was plain and needed seasoning. Hopefully the Owners and Management check on these reviews...I think you guys need to make some changes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eS8t-hZu8kPyKBsqIj0tmA"
  }
}