{
  "HdSdAMTUe1ejqHNvz9HnQw": {
    "date": "3/25/2016",
    "text": "The place was aesthetically pleasing and it had a nice wine selection. However, when we asked for a specific bottle we were told it should be \"over there\". My friend and I could not find it so we waited at the front desk for a few moments. No one even approached us.  So after not finding it we sat down and asked the waitress for a manger. The waitress never asked if we were ever there before and if we knew of their concept or layout. It was never explained. The manager came over and never apologized or offered to help us find the bottle we wanted. She just said I'll never be able to please you.... I did get a glass of reisling but I swear it was Chardonnay. Not even a dry reisling tastes like this did. Oh and there was someone floating in the glass.... There are much better places that I've been to who are educated on wine and have excellent service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir77-O6t7-PBrBi2UrfslQ"
  },
  "w3UUO--L6p5aOqDHMHn1fA": {
    "date": "7/7/2016",
    "text": "Amazing place.  The food is awesome, wine list is A+, and the staff is super attentive.  Get the donuts & margherita flatbread.. worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dnOP1NB2kdU7CXFnhY7N8Q"
  },
  "wBOyoBu-Nvm9pg2bU7MfBw": {
    "date": "9/12/2016",
    "text": "I clearly was not as wowed by this place as others appear to have been. It's waaaaay overpriced, in my opinion. The pour fee on a bottle of wine I am buying from your establishment seems ridiculous to me. I could see the fee if it were a bottle I brought in off the street! The food was ok. Pricey, but nothing really to write home about. The place itself is gorgeous and there is an extensive wine collection (but remember to add the pour fee to the bottle prices), just be prepared to spend a pretty penny.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "klnVA1ImEKcAjyuzVcvoLQ"
  },
  "Ci43l7NuoGIUo9AcNQ7z0Q": {
    "date": "8/17/2016",
    "text": "Awesome food and service. Creative dishes that are a culinary dream ! The donuts are a must for dessert . Will go back for sure !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0zs88AcWvRcva0XJH1gGMA"
  },
  "VZnt_148udc2uUPLIde_zQ": {
    "date": "5/22/2017",
    "text": "We had great time sampled half menu and had some wine based off waiters recommendations all great! Staff outstanding will be going back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJfwkUfcTfjLO_KWP94j8w"
  },
  "5gwd4qRJsc0EZgBunpnHlA": {
    "date": "1/21/2016",
    "text": "The decor is awesome! It's almost like your in a cabin without the cheesy decor! Wonderful wine selections! Nice food selections truffle fries may rival Soul Gastrolounge!  Brussel sprouts were awesome and I am NOT a fav of this veggie. There could be more seating and a fireplace as people tend to lounge when drinking wine. They could also turn their patio into a year round patio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DK1OnHJMtWVAsXr1Ut7row"
  },
  "3GFIRPcAjcYmqBlxN_zJNg": {
    "date": "12/9/2016",
    "text": "Everything about this place is great. I love the fact that you can go in, pick your wine off the wall (great selections by the way), and have it opened at your table. You can also get great wine while you eat small plate dinners without paying a ridiculous restaurant markup. You can get much better wine here for the price that you would pay for a low-caliber wine at restaurant. It also has a great vibe, with both indoor and outdoor space. Overall great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sd0fON7VJTORtoLfRo079g"
  },
  "_IDAEmJ897MAvUle1O-4yA": {
    "date": "3/10/2016",
    "text": "So impressed with this new location of Foxcroft.  The wine selection is obviously one of the best in town, and I love that they don't have an unreasonable surcharge on their wines.  The Alysian Pinot was out of this world and at a very comfortable price point.  Great atmosphere!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXbZWQWUR8vH9prX-XwAPg"
  },
  "atjPi3vWwW8qwFD6R93r5A": {
    "date": "2/25/2016",
    "text": "One of the best wine bars I've been to in Charlotte! The staff was very excellent in helping us pick out the perfect bottle! We had an app and it was absolutely delicious! Will definitely be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96WxSQhyFwJd0o0Sp17oBQ"
  },
  "SF5BOgcf3HJxlBg2VZ6Yrw": {
    "date": "1/8/2016",
    "text": "I am a fan of the Foxcroft Wine Co on Fairview and an even bigger fan of the new location in Dilworth just wish it was a little bigger, but I get it, it's about having the space.  I have visited twice since they opened and enjoyed both times.  Outside of wine if your a beer drinker they have some great favorites on tap and in the coolers in can.  The food is always great and the tapas style meals are perfect in size.  Love the Brussels and the sliders not to mention friends that were with me loved the Scallops.  The decor is so quaint and a nice touch for Dilworth, I will certainly be back to enjoy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n58lJhFaqFkfP3em6LLD-Q"
  },
  "JAZZ1yPKOj2PrOni80dXIQ": {
    "date": "3/6/2016",
    "text": "Great new location in Dilworth on East Blvd. What a perfect addition to the shopping center and area! Great wine selection by the glass, and so many more by the bottle. The menu includes Brussel sprouts, a cheese plate, even truffle fries, and many other additional choices. The interior entices you to browse or sit, and the patio is definitely inviting. Shelly, behind the bar, is the best for wine questions or suggestions! Try to get there early, this is a busy spot quite often. The bar is first come, first serve if you can grab a seat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UR4hlDK7I4vi0vdekYskdg"
  },
  "qoiTIp7pSGU4odhoIAg9Ew": {
    "date": "2/16/2016",
    "text": "I was excited to try this for the first time but would visit other wine bars over this the next time after my visit. Our waiter was not the issue at all. After I asked another employee what time they closed she turned and said \"Were you not listening to what I just told the table next to you?\" No actually, I was enjoying my own conversation. She really made things unpleasant as she continued the conversation. I would recommend anyone who can be overwhelmed with wine to ask them for suggestions because they don't really offer or highlight any. It's simply there's the imported wine and domestic wine. Food was great but again I'd rather visit elsewhere after the one lady's attitude. PS they close at 10:30.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAF0_lRs46lwQ2HQmtiz8A"
  },
  "rio2_lDRVfi8zQ86NEmmdQ": {
    "date": "1/7/2016",
    "text": "This was such a pleasent surprise to have this pop up on east blvd. I loved the atmosphere, tapas were great and of course, the wine was top notch. Definitely check it out! I will be going back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEnu5KkQ70FEGDiEmioO6Q"
  },
  "bKtv_BaT5jDjj9tJ0_Z42g": {
    "date": "6/10/2016",
    "text": "Okay your posted hours say you are open until 11pm but when we arrive at 1030pm on a Friday night we are turned away because \"last call\" was already given. Are you kidding me?  Do the owners know about this practice?  Why don't you change your hours so that they match your advertisement.  And not even an apology from your staff at the door.  Friday June 10th. <a href=\"mailto:Jturner208@ail.com\">Jturner208@ail.com</a>.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WaBbJgklb6k1pKsAm5uxXQ"
  },
  "JIA7ECsPCllsaXUohEDnbA": {
    "date": "10/11/2016",
    "text": "Time after time Foxcroft delivers divine cuisine, a relaxed atmosphere and wonderful wine selection.  This is certainly a go to spot!  I absolutely LOVE their grilled okra- it is a must get item and enjoy the sliders with onion jam.  Look forward to this place each visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Bb1VwI5j5t6Wl1kXceb0Q"
  },
  "t0oKg9mLNbKLrHDJvpT7Ww": {
    "date": "1/31/2016",
    "text": "Good wine selection and a good ambiance.  But TERRIBLE service from the bar.  I was flagging first downs trying to get the bartenders attention.  Instead, the bartender spent five minutes stocking bottles of wine on the back of the bar while not paying attention to the line of people backed up trying to order..",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "j5-f4NXA06Np1Iqaj8-S3w"
  },
  "5cDILtKvogPZBvtsAXq3iA": {
    "date": "7/12/2016",
    "text": "Love this place. Awesome oysters!!! Beautifully decorated and designed!!! Wine everywhere!! There at 5pm on a Thursday and almost did not get a seat. Get there early. I will be back again!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3jQuJcuCuuvGvSUpyeRpFg"
  },
  "fgZ_ECICai-vlqMIZ-b4WQ": {
    "date": "10/15/2016",
    "text": "did a girls night out at winecroft for the first time and we'll be coming back for more! loved the atmosphere and the customer service. given we had a few dietary restrictions, the staff was accommodating to what we could eat and couldn't eat. unfortunately the fries and the polenta are fried in the same oil as the fritters which contain seafood. the Brussels sprouts were made without the soy glaze to keep them gluten free. the ricotta was so delicious and paired well with the Fortnight red wine.  I also ordered the spinach and tomato flatbread, which was good but I'd recommend for the chef to dice them up rather than putting them on thickslices. also I ordered the flatbread with cheddar cheese and not the parmesan and mozzarella.  this is a great wine bar for a date, girls night, group event or to drop in solo. a few changes to their menu and it's a 5 out of 5 stars for me. will be back !!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfECTGBYb6IarwwNMm6zUA"
  },
  "8gJGBjhawwuWbiSJdEUOrA": {
    "date": "9/7/2016",
    "text": "the grilled okra is to. die. for!!!!!!!!!!! please, please, please add it to the regular/permanent menu! I've spoken with several people who also got the okra (we didn't go together) and we all agreed it was the dish that would keep us coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pW-6D28yzMlslVM4UqCgAA"
  },
  "iPMxMLXQxO2UOohxMGmiXg": {
    "date": "9/7/2017",
    "text": "Loved our experience here! This is walking distance from our apartment on East blvd & I think this will become a regular go-to for wine and dinner. Blaize was our server and she is an impressive wine enthusiast. We had a bottle of tempranillo here and we loved her recommendation so so much that we asked her to pick out another bottle of any wine that she likes for us to take home. 100% recommend the lamb sliders and the truffle parmesan fries as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U8GTYCZFfRJqJnZYJ5DHSA"
  },
  "Qbrltxha_DblzBjd_PspRw": {
    "date": "7/7/2016",
    "text": "I've been by this place a million times and never realized it was there. Now it totally makes sense why that parking lot is always crazy!  I'd say the seating is about 50/50. Actually, there may be a little more seating outdoors which has to be nice during the late spring/summer and early fall times of the year.  It was very nicely decorated with a little modern flair and there were ample seats at the bar.  The bar stools or chairs that sit at the high tops are pretty hard to hang your purse on, ladies. I'd recommend bringing a purse hanger or leaving it in the car unless you have a small clutch.  As far as the wine goes, I was pretty impressed with their selection! I tried a Viognier blend and I was very happy with it.  The service/servers were really friendly and attentive, but there was a considerable delay in our food times. I ordered the salami flatbread and it was absolutely amazing. The balsamic drizzle over the top was the best part. The husband and I shared an order of the truffle fries which were piping hot and very tasty. The problem was the burger. The husband ordered the Foxcroft burger and our food came out in this order: salami flatbread/wait/fries/wait/wait/burger. We ordered them all as one meal, so I'm not sure what happened in the kitchen. In our servers defense, he did go check on it for us, but it was pretty lame. I tried to wait for his burger to arrive, but my flatbread would have been cold by the time it arrived. The fries were still warm when the burger arrived, but it would have been much more enjoyable to have everything all at once.  I enjoyed my visit, but the husband wasn't that impressed. I think it's a nice place for a hangout and apparently, they have doughnuts, so I'll head back and update on those soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "KV7oIoeG90HCnOs8fGDhoA": {
    "date": "2/3/2016",
    "text": "I couldn't be more thrilled having this gem added to the Dilworth neighborhood!  My bride and I have now visited twice.  We received excellent service and phenomenal food and wine each time!  I absolutely love the flatbreads, the charcuterie, the lamb sliders, and the abundant options in wine!  The ambiance is a very warm and home feel.  It's nice yet casual!  Perfection!  This is also a wonderful place to drop in to grab a couple bottles to go!  But it's always fun to stay for a bite and a drink!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "zvFeFboNMXqes2x5yqxpYw"
  },
  "jlVSx9SFqikAV-GXebD-Hw": {
    "date": "3/30/2016",
    "text": "Wall to wall vino from around the world. This was my first time coming here. I've passed by it tons of times but never stopped in. Some friends and I decided to stop in here and grab a glass of wine after eating dinner at another restaurant in the area. I wanted dessert too, so I was pleasantly surprised when I saw they had a food menu with a few dessert options. The hostess was very nice and pleasant, she greeted us as soon as we walked in. There was a small wait and we sat at the bar until a table was ready for us. The hostess came and got us from the bar and sat us at our table. Our server was very knowledgeable about different wines. We settled on a white and spilt two bottles between the 4 of us. One friend had the sliders and she said they were amazing. And she's a trained chef, so for her to say they were amazing, they were definitely amazing! I had the doughnuts which were good. I wasn't a big fan of the cinnamon and sugar doughnuts. I also would have preferred the dipping chocolate and salted caramel to be warmer. Overall good experience, nice atmosphere and a great place to grab a glass of wine.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1OuxWXlPJ6lYdr7ZSrpWMA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Their signature chocolate with cherries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1OuxWXlPJ6lYdr7ZSrpWMA/o.jpg"
      },
      {
        "img_id": "L7mI_GMByGAowS8I0Tt71w",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. The doughnuts paired with a chocolate ganache dipping sauce and a salted caramel dipping sauce.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/L7mI_GMByGAowS8I0Tt71w/o.jpg"
      }
    ],
    "user_id": "yiKkxcuQdB04PVUW7OgtNw"
  },
  "g_tP5AqDtaUVRxt0a_3JIw": {
    "date": "2/3/2016",
    "text": "I had the pleasure of dining at the Dilworth location this evening. My first impression of the inside was WOW! The decor is beautiful and the vibe was very comfortable. Great job! We sat at a table and enjoyed a few apps and a delicious bottle of wine recommended by our server Ali.   She gave us great recommendations on wine to pair with the food we wanted to order which is A+ in my book. She was very knowledgeable about the menu and answered all of our questions. She was professional yet personable. Seems like management did a terrific job choosing the staff here as I have been to the South Park location and felt the same way about the service.   Overall my experience was extremely memorable. From service to food the night had a good flow and we never felt rushed nor neglected. I will absolutely be back and will be telling all my friends to check out the new location and to ask for Ali of course!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "LU3TP3mUCJOfIdXa7vLBYw"
  },
  "-AH5oTTFvxN9XRZC7gmb0Q": {
    "date": "8/10/2017",
    "text": "Great date night area in Dilworth. I was only there briefly but enjoyed my wine and the ambiance. I'll check it out again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQzhajphhdS1vMxbr9OJ8A"
  },
  "30P_jCAE3JT89HEa56T_Jg": {
    "date": "7/8/2017",
    "text": "Enjoyed the location, the service and the food was very good. Interesting flavors combined with great wine. Our server, Matthew, was a great help in navigating the wine selection and suggestions from the menu. Would go back, but as more of a \"local\" place get there early since they do not take reservations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Da-e2S47A6UdDfvwKmXzeQ"
  },
  "2yjdMVxVq05_tSulAZopYA": {
    "date": "3/18/2017",
    "text": "First time at this place, the wine was really good. Buttt sat at the bar and at closing time watched the women bartender wipe the front of the whole case (glass the bottles are kept behind) where the wine is kept with one rag. With the same rag continued to wipe under the bottles, all the glass, the counter tops, wipe down ithe dispensing taps that the wine comes out of, and for the final touch I was appalled when she pulled the tube out of the bottle that was finished and cleaned it with the same rag she used for the counters. The same rag to clean everything was used to clean the tubing that goes inside the bottle you are about to drink. Will not be coming back this is repulsive, wish I could of taken video. Me and my three friends were appalled.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3wQh4ZR2PHEKdMpBGkeB0Q"
  },
  "5YBx0JzGZghTyCWU1GUnHA": {
    "date": "3/16/2016",
    "text": "What a great little spot.  Fun environment to come to with the ladies and grab some wine, and bites to eat - they have quite the variety.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jDuI1ZfBxcL5iWEJOWK89w"
  },
  "xJctmzUtxbfhsdnrUWSL7A": {
    "date": "3/21/2017",
    "text": "This is a great spot to meet with a group of friends for wine and small plates. I prefer it when with a group who is willing to order together and share, the menu seems designed for that. The truffle fries with aioli are amazing, definitely a must. The sliders are good, though I found them very rich and a bit greasy. Brussels sprouts are well cooked and have a ton of flavor. The roasted tomato flatbread I snagged a bite of and that was great too plus the presentation was lovely. This last time there I had the salmon salad, it was enough for an entree portion but overall lacking in flavor and the salmon smelled a bit fishy. For $18 I wasn't impressed with a not so tasty salad. I will go back for their great wine selection, those fries, and maybe even the donuts (which are surprisingly large!) with dipping sauces.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "TQ9rQF4qXymbL3bg_OyjjA": {
    "date": "7/20/2017",
    "text": "This place is a hidden Gem! Great wine & great food and our server Caitlin was awesome. Despite being located in a shopping plaza the place has personality and a great vibe.  Tried the Beaujolais Caitlin recommended & LOVED IT!   Brussels sprout salad, ricotta bruschetta. lamb sliders & heirloom salad have my blessing!  Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8GE0bgBVrTHEOuBnx8j5FQ"
  },
  "zGdqC2TK9_pFUeAnzNZC0g": {
    "date": "2/16/2016",
    "text": "Went to this place last Saturday for the first time and it was packed. We waited for our table at the bar and had a glass of wine to pass the time. I got a malbec and it was delicious!  The guys we were with weren't wine drinkers so I'm glad they offer a selection of beer, too.  We got sat at a cute little table by the window in no time and decided to order tapas for the table to share. One of us is gluten free so we tried to stick to like-options for the most part.  They had a number of dishes she could eat so we were all happy about that. I got the bruchetta (not gluten free) and it wasn't exactly what I expected -- served with onions instead of the traditional tomato mixture. Still yummy though! I'll definitely be back!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "87ESOpbAdmDGzyjOkFg7Mw"
  },
  "oVuo54DPTHP_v2J5UMEoMA": {
    "date": "12/21/2015",
    "text": "When it comes to wine bars, you EXPECT the wine to be good, but you never know what you'll get when it comes to the food.  Foxcraft is the best of both worlds...a glass of delicious with a side order of amazing.  Since this Dilworth location opened recently, I've been here three times and have eaten through half the menu.  So far, I haven't had a bad dish.  The decor has a modern/rustic look.  From the outside, you almost can't even tell if it's a wine shop or a restaurant.  They have a ton of wine bottles on shelves that act as wall dividers in between rooms.  Wine is apparently for purchase and not just for show, but it makes for great decor!  There are also a few sections where you can sit.  If you just want to have a glass of wine with a friend or a date, you can head over to the bar area.  It's not huge and crowded, so go early or late.  Otherwise, there are a few high-top tables.  You can also sit in one of the main rooms and have dinner at a regular table.  I also noticed a large community table in the front when you walk in.  Great for a group of girls or couples looking for a fun place to do a dinner.  The downside is that it could get a little loud at the bar during popular times, so sit in the dining room if you want to have a more intimate date.  Really fun place if you want a lively, more upscale (not stuffy) atmosphere.  The wine is very diverse.  They have a nice wine-by-the-glass selection from a whole slew of regions, and the wait staff can provide good descriptions and recommendations if you're not familiar with the wines.  Despite how busy the restaurant is, it's not hard to flag someone down if you need something.  Food was outstanding.  Both taste and presentation.  Tapas is definitely the way to go at this place.  The sliders were great.  Salad, cheese, donuts, everything.  I can't say I have a favorite yet because everything was good.  So Welcome to the Neighborhood, Foxcraft!  I'll be seeing you soon and often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "-RiKXM-S-3RhAbBhkNQ3Nw": {
    "date": "8/13/2016",
    "text": "This is my happy place. They take good care of you, yes they do. If it's your first time make sure to try all kinds of wines by ordering the 3oz portions. Their fried are amazing, red pepper oysters were great. And their house made chocolates were outstanding! Nice place for a date too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wl2UKfXcam32XCFGIp5NSA"
  },
  "7iEsKCNvHtcTAV3gjBS3bg": {
    "date": "10/14/2017",
    "text": "Every single thing is delicious! Great place to meet with a client for a glass of Wine, or perfect date night spot. You guys: I'm not even a wine drinker. Never liked a single wine. THESE GUYS DID IT! Knowledgeable staff and awesome ambiance. Loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LlCsrGSgxx-3x3QW4aYN0w"
  },
  "v-LKlhvPay6_zv0LF5_3ZA": {
    "date": "7/16/2016",
    "text": "Went to Foxcroft last night and had a less than stellar experience. There was a wait so we headed to the bar for a glass of wine. It took the bartender 5 minutes to ask for our order, after she had tended to people who had gotten there after we did. We finally got a table and ordered the grilled okra and scallops after the waitresses recommendation. The scallops were ok, but the grilled okra had an entire bottle of salt dumped on top. The space is cute and cozy, but they threw big TVs up, totally killing the ambiance. I really want to like this place, but it's just missing the mark.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "z2nqUYX4WeBu60Eo1HF5-w"
  },
  "-2764timE9RHRK0jMjMXlw": {
    "date": "1/18/2017",
    "text": "So far one of the best wine shop in Charlotte. Their collection is amazing. The atmosphere make you feel like you are in NY city. It is a first come, first serve place. Their truffle fries are amazing.lol",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4_0ekbTag2m085DYY2VJfg"
  },
  "dfUTm3LnrNbbP571VZZD0w": {
    "date": "11/13/2016",
    "text": "Great place to hang out and have some decent wines. Ordered the lamb sliders and crab cakes, which were perfect bites while sipping on Vino and conversation with some newfound friends. Definitely recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3BKhDY-ku-2gwBnjTTTGJQ"
  },
  "aPopuviAPHb2cI_hoMblYQ": {
    "date": "10/14/2016",
    "text": "I stopped in today, Oct. 14, to pick up a bottle of wine to take home. The staff was incredibly nice and helpful. They helped me pick out an excellent Cabernet. They were knowledgeable without being pretentious, and I definitely will be back, and will be recommending this establishment to my friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKuNBhfnKJ1NJMOeK4Fhvw"
  },
  "-9vqiqUsfRaVtEPLDYEAYQ": {
    "date": "12/15/2015",
    "text": "I felt a little like Goldilocks in this place. I'd long been searching for a good wine bar close to Uptown, but The Wine Loft was too dark and food/wine was underwhelming and the Vin Master is too bright and empty. Enter Foxcroft with their perfect lighting and stellar execution. I had long heard about how great their original location is with a great selection of wines and stellar food. In fact Tonya P used to waitress there and said it was the <a href=\"/redir?url=http%3A%2F%2Fbomb.com&s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" target=\"_blank\" rel=\"nofollow\">bomb.com</a> (her words, not mine). Because it was outside of my 4 mile radius it was never destined to be a regular spot of mine but their new Dilworth location on East is perfect!   You may miss that they are situated at the endcap of Kenilworth Commons facing East because they don't have signage yet, but follow the happy sound of revelers inside (parking can be tough sometimes). Inside their modern clean interiors features a bar, tons of walls of wines (and some craft brews) as well as some small and community tables. During good weather, there are plenty of tables outside under the bistro lights. On a Saturday night it already gets packed with the prep set and is hard to get a spot. Even on a Monday night it gets fairly noisy with the music and din from the crowd.  But the nuts... (TWSS!) Their food is outstanding and I only tried a couple things. If you just need an accompaniment to their fantastic wine, their smoked nuts are a solid choice for $6. Their order of Spanish olives is large so be prepared to bring home leftovers. Tonya stands by the burger so I look forward to trying it and some of the other things on the menu. My friends loved the sliders.  Bottom line - if you want a wine bar with sensational servers/sommeliers, food and just the right ambiance close to Dilworth/Sedgefield/Myers Park, head here.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 7
    },
    "photos": [],
    "user_id": "oInNoiunuDYWakwmvDiVVg"
  },
  "bP7X5EScK2qqqoRYr5rEJQ": {
    "date": "5/27/2018",
    "text": "This place totally lived up to the hype and reviews. My partner and I were in Charlotte for the weekend and we were looking for a nice local place for dinner. I found out about Foxworth through Yelp and the reviews were glowing about the atmosphere, the food and the servers. We were very pleased and relieved to find out that these were all True. Thank you for a wonderful experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qNbiVo38iFtirVBCyrzawQ"
  },
  "3jTmjbQBPPTavOHTu9G4QA": {
    "date": "3/24/2018",
    "text": "Had a great time at Foxcroft! Wine and beer selection is fantastic! Food is delish! The staff is knowledgeable and attentive...give this spot a whirl, you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WVU3Nbr28vj_hPkU5zNS6Q"
  },
  "WKvDhloCxZVUxXoBMaY0KA": {
    "date": "11/14/2016",
    "text": "Very swanky, sexy, vibrant and full of character - those are the descriptors that came to mind as I entered Foxcroft Wine Company on Friday night. Ever have that Friday craving to venture out of the same ole' wine shops to find something new, at least buy it from someone new and listen to recommendations of another wine enthusiast?  Yup, that's where I was... Foxcroft answered my needs.   Customer friendly, I had 3 wines I was looking for, they had all three and some. They made a good recommendation for me on Ripasso, Amarones and Cabs. Fantastic selection of some of my favorites and plenty that I have not enjoyed as of yet.  Do yourself a favor, walk around and take it in.   Yes, I'd go on a date here... if a new boo wanted to go wine sipping'..he'd get points for taking me here.   Yes, I'd bring my clients here, it's classy yet relaxed, already told one about this place.   No, you will not find cheap wines in here, think medium to full bodied budget, but we come here for the quality of wines, not for the quick pick up.   Food: No experience on dining in but the menu stuffed in my wine bag has me intrigued.   Valet parking - complimentary, comes in handy as parking is a beast at night.  Sexy well lit patio.   I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mnS9A3YMxNw-Ia4wLRtCgQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Baby Blue....",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mnS9A3YMxNw-Ia4wLRtCgQ/o.jpg"
      }
    ],
    "user_id": "XrgcHURVAe_wys_jdweKLw"
  },
  "Q6GMotptmrxW2fVc0wqggA": {
    "date": "5/4/2018",
    "text": "In town for a conference and found this gem! Great wine selection and food! The homemade donuts are amazing!!!! It was a beautiful evening to sit on the the patio. The service was excellent and the servers were so knowledgeable of wine with excellent recommendations.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "POK-dpxWkw2eYtfk0d-LVA"
  },
  "25R6qfCDqSV0fdPL88rQeQ": {
    "date": "4/25/2018",
    "text": "One of my favorite places for a glass (or bottle) of wine and a great meat and cheese tray!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "suaWoFIpL5PMGO8lHnC5zQ"
  },
  "5skjU-TUQhjNZ5u5_mVrTQ": {
    "date": "6/3/2018",
    "text": "One of my favorite spots in Charlotte - until they started charging a $10 flat corkage fees for any wine bought under $30. Also, if you want beer is $2 to \"pop the top\".  Mind you wine bought at their restaurant, drank with their food and tips paid on the $$$. I have never been to a restaurant that taxed their own wine bottles. Most whites and roses are under $30. It is anywhere from a 35% - 50% additional tax.  Go knowing you're forced to spend a minimum $30 on a bottle (if you buy 2 $27 bottles you'll be charged $20 in corkage fees). Quick math you'd be better off buying 2 $30 bottles. Backwards policy. Especially from a wine bar to charge a corkage fee on THEIR own bottles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92LhzNfx3DkGJ8Jfld0aVw"
  },
  "3-daWD1z_5ZujU0hT7zisA": {
    "date": "5/15/2016",
    "text": "Maybe it's just me, but I'm not really sure I get the hype behind this place.  Perhaps it has something to do with the time of day/year I went, but I just wasn't feeling it.  Because of the time of year, it was still daylight when I went for dinner.  Had I opted to take advantage of the patio seating, I may have enjoyed my experience a little more.  Having not, I was inside in a very bright setting with little to no ambiance.  I found it loud and the waitstaff dressed in a manner that would make casual Friday jealous.  Cargo shorts and an untucked polo?  Try again.  Not really the image I think you should portray in this type of establishment.  The patrons were better dressed than the employees.  The wine was excellent, as it should be.  The food left a lot to be desired.  It wasn't horrible, but I certainly wasn't wowed either.  I found the menu minimal and the crackers that accompanied the charcuterie plate were atrocious.  Bleh!    I've yet to experience the original location, but I'm led to believe it's relatively the same.  I cannot say that I'd never go back, but I would change the intent of the evening for sure.  To me, this is more the place to enjoy wine socially with friends, and not so much as an intimate dinner setting.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZlDYPORxTpNgImmbwIn3Dw"
  },
  "huXkiCvvNggUDCiHc-u6fQ": {
    "date": "4/14/2018",
    "text": "We LOVE Foxcroft!!! My husband and I go quite often! The truffle fries, sliders, and Brussels sprouts are a must try!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Td_BI_ylaG2rrvuZLLm6fA"
  },
  "yw8unAXLSPH3CaHNM_h5tw": {
    "date": "2/13/2017",
    "text": "What an amazing wine bar!  With 70 degree temperatures in Charlotte, what better way to spend a Saturday evening then enjoying some good wine and food on the patio of Foxcroft Wine Bar.    We arrived shortly after 6:30pm and was able to get one of the last open tables outside on the patio.  White lights, heaters, what more could ask you for. Well, wine, food and great service.  Everything did not disappoint. We ordered a few bottles of wine, red, white and a rose, and ordered a variety of food. We started with the mixed nuts and fries. After a while we decided to order some entrees to share. We chose the Three Cheese Flatbread and the sliders with the Brussel Sprouts. The flatbread was cooked perfectly and the added touch of the balsamic glaze paired so well with the cheeses. As for the sliders, my favorite bite. Three sliders cooked to perfection. Note: Nothing fancy, just a slider with cheese, but the perfect bite. And, we topped the night off with a variety of cinnamon sugar and powered donuts, served with chocolate sauce and a caramel sauce, heaven! From the service to the food and to the extensive wine list, this is my go to spot for a night out with friends. Also, for those who aren't wine drinkers, they do offer a variety of craft beers. Definitely cannot wait to get back!",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 16,
      "cool": 12
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "TntEq_bA69nVKI0Rmjvcfg": {
    "date": "5/21/2016",
    "text": "This place is great! I am so glad I decided to try it.  It is gorgeous inside with a huge selection of wine, of course.  They staff is super friendly and helpful.  They were welcoming and the service was quick.  I can't wait to come back and try the snacks.  They looked so good!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FLJ2fKyrilzJTNVgqHcbOA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FLJ2fKyrilzJTNVgqHcbOA/o.jpg"
      },
      {
        "img_id": "tUZNevE2-JjyPVApX2UF_w",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/tUZNevE2-JjyPVApX2UF_w/o.jpg"
      },
      {
        "img_id": "uKidasWLu3oDxDeER0b1RQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uKidasWLu3oDxDeER0b1RQ/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "Q_BhNJaRqTNJvng9rQEM1Q": {
    "date": "5/20/2016",
    "text": "My friend loved the wine selection!  I was hoping they would have liquor, but they don't. They also don't have any vegetarian foods, after having asked the waiter. Cheese and nuts is not a meal.  So, I sat and watched my friend drink.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "U5dFSnnuK3eZyPXdGiQLvQ": {
    "date": "2/15/2016",
    "text": "I will officially note this as one of my new favorite places!!! Amwzing atmosphere, very rustic with soft lightening. The wine selection is unbelievable and with VERY LITTLE MARK UP! We also enjoyed a charcuterie board that was quite tasty and had a beautiful presentation. I did look around at our neighbors food which was short ribs, tuna and brussel sprouts and all of it made my mouth water! Our experience was made even better by our server Beth! Can't wait to return for another relaxing evening :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "epTYjdvT1pxGyj7hBSJITw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Foxcroft Wine",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/epTYjdvT1pxGyj7hBSJITw/o.jpg"
      }
    ],
    "user_id": "uy4oHzC_4zqEAn95Kv27Ag"
  },
  "1E1rei_COWUFID78H5Cc0w": {
    "date": "7/21/2017",
    "text": "Love this spot for a great glass of wine, and the food is delicious, too! There is an extensive selection to choose from and be sure to ask Shelly behind the bar which ones are her fave. The girl knows her wine  and she is always super helpful and attentive. Also be sure to check out the retail side, their prices are great as are the choices. Try to get here early, the place will for sure fill up...no matter the day of the week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CMicnwE0l7roRcNMnvyJXg"
  },
  "sB9-hYRtRHfPK77KPWPNrA": {
    "date": "12/7/2017",
    "text": "Would give another 1/2 star if that was a thing. The food was great, but not out of this world amazing or it would get the full 5. Staff was awesome. Perfect blend of always attended to but not overly bothered. All staff was knowledgeable about wine selections and food recommendations. We will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PcEsjw4yZT61UdbEMJZz2A"
  },
  "7Otx-sjxe2S_Vq0KCZ1LmQ": {
    "date": "4/9/2017",
    "text": "The perfect spot for a girls night out! I've also come here on many occasions with my boyfriend and we always love it! The service was impeccable and the waiter took time to explain and suggest wines to pair to our tastes. He suggested a lovely red that I will definitely order again!  The food was just as amazing as the wine. We started off with the ricotta and crostini platter, and the presentation was almost as wonderful as the taste! We then moved to the brussels (with soy glaze? YUM!) and the special of the day which we're fried oysters. A great meal with wonderful wine and superb company! I will 100% be back in the near future.   Last night was a bit too chilly to sit out on the patio, but I suggest finding a seat out there once the weather gets a bit warmer!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XycJQy50-yePXFN16TRRJA"
  },
  "iAhVeD0D6UF6AvLlPJFeQQ": {
    "date": "9/27/2017",
    "text": "If you are looking to purchase some great wine this is the place to go! We just moved to Charlotte and had some concerns as to where we could find our treats. If they don't have it they will order it. Very accommodating!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fTMEfe--m2Yy-B1JK_DZIg"
  },
  "Q2zSm267XO6bZLJt7CeQ_w": {
    "date": "8/30/2016",
    "text": "This is a hidden gem. Went here for appetizers and some wine after work with a friend. A bit of a drive for me, but worth it! Dilworth is a cute area. This place is in a strip mall, so parking was ample which is nice.  Super modern and clean atmosphere when you walk in. Low music and great for conversation. Tight seating so wouldn't be great for a big group, but awesome for catching up with a friend or date night. We sat at the bar with Mark, who was there on a slower Monday night. We started off with the charcuterie plate, and the truffle fries with lemon aioli. Guys, my mouth is watering just writing this review. GET THE TRUFFLE fries. I had a glass of a buttery Chardonnay that I think was called Tate? It was delicious, but $14 a glass. This place is more on the pricey side. We also shared the margarita flat bread, and mini burgers with bacon jam. Everything was honestly amazing. I was stuffing my face. Margarita was perfectly cooked and the bacon jam and the mini burgers was heaven. Everything is small plate like, so good for sharing. They have also a large, standard size burger as well.  They have a huge wine selection, with some rarer finds. And the staff really know what they're talking about so feel free to ask questions and try something new. As a treat, they brought out their famous house made donuts, on the house! Now these...indescribable! With a vanilla butter and chocolate dipping sauce...melt in your mouth. Mark was again a fantastic bartender, attentive and helpful, without being obtrusive or making us feel rushed. All in all, a great wine selection, fantastic food choices, and friendly and helpful staff. Check it out, you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "99J3dcPIHeB4wGn4MKec2A"
  },
  "i0vWYJFmjXCm1wAxSEvY3A": {
    "date": "7/15/2016",
    "text": "Things that you should try: okra, truffle fries, foxcroft burger. A must: donuts as a desert... they are phenomenal  People to talk to: Sharron. She is amazing!!  Get a bottle, retail price",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WkEUE8U26NQlzIgoikWyFQ"
  },
  "GiqaGPq0byVoairXaHc9cA": {
    "date": "7/31/2016",
    "text": "Haven't had an opportunity to check out Foxcroft until yesterday evening. The wine selection was very nice, love the option to pick up a bottle and sit wherever to enjoy it. A friend and I happily split a bottle of wine and just enjoyed our evening which started out well and unfortunately went slightly downhill from there.   Half way through our bottle of wine we decided to order the Foxcroft chocolates, peanut butter was the flavor this evening. The chocolates were okay. The filling was a little strange- thin and grainy peanut butter flavoring, not exactly what I expected. Wasn't terrible, wasn't great but I understand they just may not be for me. What was disappointing was the fact that no napkins were brought with them, no napkins were ever offered.   At first our server was very nice and attentive, I think unfortunately she became over seated on the patio and was the only one providing service. As a result it was difficult to get her attention to order something else (after our bill had been brought out, not at our request). She graciously brought me another glass of wine, however she approached another table and picked up their dirty dishes and silverware, put my glass of wine down on their table to reposition the dirty dishes and silverware, before picking the glass up and carrying it with the dirty items to me.   Clearly the better route would have been to drop off my glass of wine instead of touching dirty utensils and putting my glass of wine on a strangers table out of my line of sight, then go clear their table. As I stated before I think she was a little overwhelmed and probably tired, however that whole transaction was off putting.   Overall I'd go back, I don't think this interaction is indicative of their service, I think it was just an off night.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7krueUWzxG59b4w3XAK4g"
  },
  "RxDi1Q1fmhNUMLP-_dXRAQ": {
    "date": "3/16/2017",
    "text": "If there was a way to review the wine dinner for cakebread separate from Foxcroft I would give Foxcroft 5 stars.  However, there is not. We thoroughly enjoyed Foxcroft itself and will definitely be back.    The wine dinner though was lacking in some areas given the price.  The wine was wonderful and the portions of wine were great. The main issue was the lack of food.  The portion sizes were very small to the point that we were still hungry after 5 courses.  We have been to a few different wine dinners and never had this issue.  For example 1 course includes some pork belly (delicious!) but it was a small piece and only came with a single carrot.  Couldn't they have splurged for a few carrots? I understand the quality and quantity of wine we got was great, but it's a pretty big problem if I leave hungry after a wine dinner.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGgwzRVIwCT8HVsv2BIFWg"
  },
  "jo6SbDQ3-rTKtJCIAlaImQ": {
    "date": "8/25/2018",
    "text": "Centrally located in Dilworth. In the shopping center with Harris Teeter. The place had a good selection of apps and wine/beer by the glass. You can also choose a bottle to open. There is no mark-up on the bottles but there is a $10 cork fee for bottles under $30. Nice outdoor patio for sipping. Doesn't feel like you are drinking in a strip mall parking lot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OcyF-6jZo5SNR3_4IgFd6Q",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OcyF-6jZo5SNR3_4IgFd6Q/o.jpg"
      },
      {
        "img_id": "FFgRATkC7pdEcHLfJV29Lg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FFgRATkC7pdEcHLfJV29Lg/o.jpg"
      }
    ],
    "user_id": "SnaWgAUFtrlbmqd9Y3Su5g"
  },
  "dVu9L8e09U8w4nqfrmM3zw": {
    "date": "5/18/2019",
    "text": "One of the best places in Charlotte for wine and food. Service is great, good selection, good prices, all around great place for wine and a good time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6oHGK9_oORG5bsBL1WHHOw"
  },
  "wejqI9qMOddsG9qe2ErA_A": {
    "date": "7/7/2017",
    "text": "Foxcroft is a pretty damn good restaurant, and an even more impressive wine bar. Two birds with one stone right there. That's why The Lady and I chose it for our date night the other night.  Pro tip: They use the No Wait app, so you can see if you can trot right in. Chances are, you'll be able to, but it's good to check to be sure :)   The patio is romantic, there's no other word for it. Covered with trees, strung with lights, and fully separated from the parking lot. We sat down and were immediately taken care, and our waitress asked if we'd like a glass. We chose to opt for a bottle, and I asked for assistance in picking it. I told her what we liked, and we took a stroll inside to their expansive selection, and she picked out the PERFECT bottle for me.  Another Pro Tip: If the price of the bottle is more than $29.99 (I think that's right...), they waive the corkage fee. Do that. You'll get better wine and no for $32 instead of buying a $27 and adding $5 for a corkage fee.   Anyways, we started off with the brussel sprouts, which were chopped up and sauteed with other summer vegetables and just made an incredible starter. We also had the mushroom flatbread which was rich and wonderful, and the Chef's Bruschetta, which changes! (check the board!).  A storm was coming through, so we paid and then moved ourselves and our glasses of wine inside and just walked around. While we were there, we saw the other board special, they have handcrafted chocolates. Sea Salt and Honey Caramel ones, to be exact. So we didn't have a choice but to order them. (An order is 6 pcs). Intense and insanely delicious. One of the best caramels I've had.  Overall, Foxcroft is one of my favorite spots for a nice night out that has wine. We've had meetings here as well as dates, and it's just perfect. Can't wait to come back :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "fRbFslYiOXrSQqby3gXsLA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Shelf of wine!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fRbFslYiOXrSQqby3gXsLA/o.jpg"
      },
      {
        "img_id": "W1KQ5RoHCxgcRPlbB4jI8g",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Cremini flat bread!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/W1KQ5RoHCxgcRPlbB4jI8g/o.jpg"
      },
      {
        "img_id": "KSAD1Agm1GAizsUTs1KCCA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussel sprouts mixed with a little awesome and some kick-ass.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KSAD1Agm1GAizsUTs1KCCA/o.jpg"
      }
    ],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "DgCGfvwd62fjS5oQP3rb2A": {
    "date": "4/5/2018",
    "text": "Great spot for date night or girls night out. The hubby and I met a group of friends here on one of the first warm spring Thursday nights and we opted to sit outside and enjoy the pleasant ambiance of the outdoor patio scene.   Hubby and I both ordered the Foxcroft Wine Co. burger and shared the truffle fries. Both were INCREDIBLE. I admittedly don't eat red meat very often, but this \"splurge\" (literally and figuratively - the burger by itself cost $14) was well worth it. The truffle fries are a must-have and are definitely shareable.   Our table split the \"famous doughnuts\" to wrap up our indulgent meal and they were the perfect amount for a bite of sweetness for our group of 5. You'll receive a half-and-half batch of cinnamon-sugar doughnuts and powdered sugar doughnuts with sides of a velvety chocolate sauce and a salted caramel sauce to dip.   Overall, loved our experience here, though it's definitely on the pricey side. We won't come here often because of that, but were very happy with the quality of food we received for the higher price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kkdNZ7XhSf8lEdKA3EqGkg"
  },
  "zoFRqvrSkRkD0c2elCC-ZA": {
    "date": "1/30/2018",
    "text": "This place is super cute if you're looking for a wine night with the ladies or a date night. The small dining area gives it an intimate feel, but the place has a good energy and is usually pretty popular even on weeknights.   The wines here will run you $10-$25 per glass but they are quality picks. Alternatively you can buy a bottle and anything over $30 will waive the corking fee. It's a little pricey to me though, so I will likely choose here for more special occasions.   As for the food, my friend and I got two appetizers to share: the cheese flatbread and the Fritto Misto, which is tempura fried veggies. The cheese flatbread had a yummy balsamic glaze and some greens on top. I just wish that the greens had been chopped more as there were a lot of long stems that weren't cut where the flatbread was cut. The tempura veggies were a great serving size and had a good variety of veggies, but they were pretty oily.   Service was attentive and our server made some good suggestions on wines.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "FoqOZWfeIkBUKX3hRnrZow": {
    "date": "3/11/2017",
    "text": "Foxcroft is in the Harris Teeter plaza in Dilworth, and it's kind of a mix between a wine/beer store and restaurant.  It's got the full hipster retro look you see if so many wine and cocktail bars, and tons of booze to choose from.  When you sit and wait you can browse the bottles of wine and beer, and drink while you wait.    The cool feature of Foxcroft is the somewhat retail prices of the bottles of wine.  So when you go here, order a bottle of wine (above $29.99 to avoid $10 fee) and save some money on the booze.    The space is kind of narrow and the tables are a little bit cramped, but it's not like cheesecake factory or Soul where you're eating off your neighbor's plate.  Sharing bench seating and table space knocks down restaurant enjoyment by at least 50%.  And places that usually have crammed seating are charging you premium prices to enjoy their high faluten take on pork belly.....anyway...  The food we had at Foxcroft was pretty solid.  I highly recommend the 3 cheese flatbread.  The brussels sprouts and beef sliders were good, but the 3 cheese flatbread stole the show.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "rhWBf3K8OsuR4-lTyYWd1g",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. 3 cheese flatbread is great",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rhWBf3K8OsuR4-lTyYWd1g/o.jpg"
      },
      {
        "img_id": "R8yg1VObk9vtii5N0dKMTg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Beef sliders",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/R8yg1VObk9vtii5N0dKMTg/o.jpg"
      },
      {
        "img_id": "yrcSe5ZT4QxTbUozhqIqpQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussels Sprouts with bacon, squash, onion, cashews",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yrcSe5ZT4QxTbUozhqIqpQ/o.jpg"
      }
    ],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "pg3igR8_ZBAuCb_Tl-0Wkg": {
    "date": "4/8/2017",
    "text": "After an amazing massage at zen we walked over to foxcroft.  We have driven by this place so many times and have never been.  First of all the ambiance is EVERYTHING!  It's so romantic and cozy in there.    We were seated quickly and had an awesome waitress.  We ordered her recommended bottle of wine.    The wine was delicious.  There is a $10 corkage fee on all of their wines under $30, some people have complained about this on previous reviews.  Foxcroft sells wine at cost, so they charge this fee for that reason.  The bottle of wine we got was $20 so we paid $30 for it.  We ordered the truffle fries (see picture).  These were crispy delicious and fresh.  The portion was huge!!!!!  They were the best truffle fries I've ever had.    We split the sliders.  The waitress suggested that we add a forth for splitting.  I thought this was thoughtful.  They were melt in your mouth good.    For dessert we got the chocolate.  It was basically fudge.  The fudge was tasty and the perfect end to our meal.    I haven't found a tapas style place that I would want to visit again until foxcroft.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CmLLM4gAb-DzCc_jHvLNJA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Truffle fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CmLLM4gAb-DzCc_jHvLNJA/o.jpg"
      },
      {
        "img_id": "7B58V9jC6cw5EJkFHOjmmw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Lunch menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7B58V9jC6cw5EJkFHOjmmw/o.jpg"
      },
      {
        "img_id": "sc5wUqRxSRNTlEmym1TDnA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Sliders!  Two of four.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sc5wUqRxSRNTlEmym1TDnA/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "aDVen0mD45cR0dD1hT6H5g": {
    "date": "5/8/2018",
    "text": "My friend and I went here for small plates and wine and it was decent. This was my second time here and unless I'm invited for an event, I probably won't be back. There's nothing wrong with the place, very friendly staff, flavorful food and an extensive wine list. Nice indoor and outdoor seating options and is right in the heart of dilworth. It's just very pricey for what you get. I'm also not a wine connoisseur so I could just be cheap! But $13 for a glass of Riesling is too much for me. If you want to splurge on wine and small plates, I would recommend this place.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "M1iMJ-j8utBDWNgpTfqBzA"
  },
  "0xD54D4qHkRQUERT7iV7Tg": {
    "date": "11/4/2017",
    "text": "I was searching for wine bars in Charlotte and came across Foxcroft on Yelp and decided to stop in. The ambiance is cozy and great for a gathering with some close friends or a date night. It looked like they had space if you're looking to host a bridal shower or other larger event. We sat indoors but the patio is adorable. They have lights strung all around to add a fun, romantic flare. It looks like a decent size that can accommodate a variety of different sized groups. There were even a few dogs out there.  The entire staff was courteous and made an inviting experience. Our sommelier was excellent. He helped us pick out a flavorful red cabernet from Italy based on our preferred flavors at the price point we requested.   The food menu looked outstanding! We didn't end up getting any of the food offerings but I plan to go back and check it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EJszEuYW8Iphw4b88SwWHw"
  },
  "u97TnslkuSVqStrVCD_W5A": {
    "date": "1/25/2019",
    "text": "This place is ADORABLE! Great for a date night or GNO. The staff is wonderful. You will be very well taken care of. You will not lift a finger, as soon as your wine/water glass is low they are there filling it up. The amount of food you get is extremely small for what you pay for. I would advise only wine and appetizers/(extremely small plates) NOT for dinner",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i7p2KCzzgwZoi-Yg8GCOuw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/i7p2KCzzgwZoi-Yg8GCOuw/o.jpg"
      },
      {
        "img_id": "kLb5miIohmLbCGW5V7fNxA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kLb5miIohmLbCGW5V7fNxA/o.jpg"
      },
      {
        "img_id": "CbR2wx9T59OXE22j7jaMVg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Salmon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/CbR2wx9T59OXE22j7jaMVg/o.jpg"
      }
    ],
    "user_id": "fdImvORMxa6ZuyXqs56_ww"
  },
  "4OexJBbq3MveIQ_Za39MFQ": {
    "date": "12/2/2018",
    "text": "Fantastic date night spot!  Wife and I sat at the bar - had great food, wine and met nice people. Loved the fact that bottles of wine are not marked up - you pay same as what it would cost at Total Wine.  Brussels and truffles with Aioli were amazing.  Hamburger sliders with bacon game was jamming!!  Sweet with salty . For dessert- we had the chocolate with our wine. Amazing way to finish a great meal out. Our bartender Ryan was very helpful with wine suggestions.  So glad we went.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-g0euqUjlkSM9NDM1C9uxQ"
  },
  "xAlMIZ6X-m8EOoznLsuTvA": {
    "date": "12/15/2018",
    "text": "Fantastic spot! The venue is cozy with a great bar area. Exactly what you're looking for. Perfectly chilled reds by the glass (unique and should not be). Service is top notch- people get it (special shout out to Ryan and Liz). I also love beer and they have a nice selection of craft beer(cold/not flat! Pet peeve when otherwise!) for those of us who want to mix it up. Went to one of their wine tasting events recently and it was top notch all around!  Attention to detail, fun, informative, etc. timing was great, food was perfect. Guys on microphone explaining the wines so everyone could hear- but never over the top. Kudos Foxcroft and keep up the great work! People notice things!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1HRca3LLguV7hWYImKcewg"
  },
  "E1uIe4eaOeswJ8kmmCPARQ": {
    "date": "9/8/2017",
    "text": "Love coming here for date nights! It is intimate and has a wonderful patio area for when the weather is just perfect. Wonderful selection of wines including by the glass and bottles. The truffle fries are to die for. They are so delicious and the Aioli is fantastic. The three cheese flatbread is very good, love the balsamic on it. The burger is one of the best in Charlotte, the meat is fantastic. Go here if you haven't been and take a date!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NqTlaOLJT7NkDrPDLNXqyA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Three cheese flatbread and truffle fries",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NqTlaOLJT7NkDrPDLNXqyA/o.jpg"
      }
    ],
    "user_id": "dp1XMUV1Laq6-EBiSXj_1Q"
  },
  "NwpuEOJwOM2QH-qX90w_8Q": {
    "date": "5/24/2018",
    "text": "I hosted a bridal shower in their private dining room and it was absolutely a perfect space for our event. The private dining area was a great for for our group of  16. The wood tones and wine displays where a perfect backdrop. At the suggestion of Liz ( the private dining manager) we selected a few bottles and did a light menu with sliders, flatbreads and a few other items. I received so many compliments on the venue and the food (the brussel sprouts where fantastic!). Would definitely recommend this venue for anyone looking for a location for a special celebration.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MLw5kAvyTOvH8fnw6YB7vg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Private dining area.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MLw5kAvyTOvH8fnw6YB7vg/o.jpg"
      }
    ],
    "user_id": "H7B2_k6AcPI3i7JT0uHsbA"
  },
  "Df-LTpZ8NkSIAdVZdpbhXg": {
    "date": "3/14/2016",
    "text": "I now understand why I haven't been able to get into this place bc it's always so packed! We finally got in on a Monday and everything was incredible, just as everyone described. We had a lovely girls night!   I shared a bottle of cab with a friend, and all 4 of us split food. We had the Brussel sprouts, sweet potato flatbread, truffle fries, and the salmon salad. All the dishes were equally amazing and delicious. I was really impressed.  Our waiter was great, and the atmosphere was just what we wanted. I will be back!!!",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 14,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "tyEYLKkzrHIast1iIqnwuQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Salmon salad, truffle fries, the remains of a sweet potato flatbread, and a dish of decimated brussel sprouts.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tyEYLKkzrHIast1iIqnwuQ/o.jpg"
      }
    ],
    "user_id": "sAbHdUgrjMOiQQLNh0H0YQ"
  },
  "qSuzkungZxZTlH49nC66sQ": {
    "date": "2/23/2016",
    "text": "WINE GALORE!!! This is a great establishment with great service. Let's get the negative out of the way..... It's always awkward when you walk in and the hostess doesn't say anything. While he was a little preoccupied shuffling menus or something, I ultimately addressed him first, asking whether we could seat ourselves in the bar area. My friend felt that he deliberately ignored us. This is the only reason why this place doesn't get five stars.   After sitting at the bar in the back, which was full, but had enough movement that it didn't take long to get a seat, everything was great. Our bartender was knowledgable about wines and made recommendations that were followed. Being a fake wine enthusiasts (\"Please give me your sweetest white wine\") I appreciate when the bartender makes my decision easier.   Also worth noting that the other patrons were quite pleasant. The bar area is quite cozy, so you'll likely rub elbows with your neighbor on a busy night. It's also conducive to striking up conversations with those nearby or flirting. I don't mind being hit on by the salt and pepper haired variety. It's all in good fun.  Despite going to Cabo Fish Taco before I went here, one lady had scallops that looked So good, I had to try them. At $18, they were worth it. Delicious, great texture, not overcooked, simply amazing! You MUST get the scallops. Must.  Large pours, good food, nice guest, and great service.Foxcroft Wine Co. is here to stay. I cannot wait to return. Good date night spot if you're looking for one. Also relaxed dress code. Very cabin in the woods flavor. Lots of plaid shirts and bubble vest with .5 carat earrings and a designer purse crowd. Highly recommended!",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 14,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "vxuVUoT9aPBuG4nbWyrOSg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Scallops",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vxuVUoT9aPBuG4nbWyrOSg/o.jpg"
      },
      {
        "img_id": "OvXgSXNf29F0BI7xELQJrg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Look closely and you&amp;#39;ll see the wine dispenses from above the bottles, reducing the need to open the chilling area. Neat contraption!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OvXgSXNf29F0BI7xELQJrg/o.jpg"
      },
      {
        "img_id": "1w5YLr4hxWcJZ8MCr2ootg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Menu 2/19/16",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1w5YLr4hxWcJZ8MCr2ootg/o.jpg"
      }
    ],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "IrzjeiyAYKedkUlgZWLEqA": {
    "date": "1/29/2019",
    "text": "A small group of us gathered in the \"private\" dining room to enjoy delicious wines, and such treats as olives, flatbread with cheese and herbs, a vegetable dish, and hamburger sliders.   A lovely experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-jUHM8H7NJPvhe2xFG7SbA"
  },
  "bdBaWU8JJj-jwxpJQL3DRg": {
    "date": "3/8/2019",
    "text": "This is a perfect spot for the Dilworth limousine liberals that like to pay for $15 glasses of wine while discussing income inequality. Go to Persuasion instead for much better bang for your buck without the pretentiousness.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kk1c8LI6GGggxTSVTVfxLA"
  },
  "9SZWpcs9IyoH3dXrioW61w": {
    "date": "11/21/2016",
    "text": "This place ticks all my boxes for a great wine bar and shop, and has quickly become one of my favorite places to drop in for a glass of wine (or more).   1) The wine: bottles from all over the world (and at a variety of price points) lining the walls, as well as a diverse list of wines by the glass.   2) The ambiance: welcoming interior with a casual elegance, plus a cute little patio. Relaxing music you can have a conversation over. Great spot for a girls night, laid back date, or happy hour.   3) The staff: super personable and helpful. I've gotten some excellent recommendations from talking with staff here.   4) The food: solid assortment of quality small plates. I'm particularly partial to the smoked nuts and olives.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "DM94XTJAjWR92kljgzwH4Q"
  },
  "6gUTWOHAGb23ccjb6LOAVQ": {
    "date": "9/6/2016",
    "text": "Perfect place to take a date or grab a couple glasses of wine and charcuterie with some girlfriends! The inside is fairly loud on a Friday or Saturday night, if it's nice weather I recommend sitting in the patio area.   They have tons of wine selections and the servers are pretty knowledgeable and can give great recommendations. We ordered the charcuterie board and veggie flatbread with zucchini. Sounded bland but was surprisingly delicious and healthy! Big ups to our server (wish I remembered her name). She was very attentive, genuine, and amusing to chat with!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "hWmi9CYRDAmkXkjg1x2Tfw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Charcuterie and flatbread!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hWmi9CYRDAmkXkjg1x2Tfw/o.jpg"
      }
    ],
    "user_id": "1fyzWwIyoGcjWEIeXwxjsA"
  },
  "7GTdRO_Kf7fuJQkDWpbG1Q": {
    "date": "8/17/2019",
    "text": "This little place is amazing. First, my waitress, Casey, was Fantastic. Leah also took great care of me.  In fact, I felt a little like royalty in that they took such good care of me.   Second, I ordered the Truffle Fries appetizer.  OMG!  They are sinfully delicious.  I ate the whole thing ... and there's a lot. Two people could easily share ... though I'm not sure they will want to.   Third, I ordered the Grilled Chicken.  (Sorry ... I can't remember the exact name.)  It was moist and delicious.  Just the right amount of spices and yummies to go with it. (Curious? Order it and you'll see!)  Finally, I was very picky about my wine and Casey made sure I had exactly the right wine and that my glass was always full.   I will definitely be back ... again and again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hGeMKM4H0j68EZjtCRmsvw"
  },
  "-GmpIiVaEEprXW6BKCwuTw": {
    "date": "6/26/2019",
    "text": "Get the donuts.   I could stop my review right there. They are heavenly! They cook them up fresh each other and they arrive to the table nice and hot. They are worth the wait and the dipping sauces and a perfect compliment.   This is such a cute spot to grab a drink and some snacks. The cheese board offers a good variety and leaves you enough room to get donuts! However, there are several other items I'm looking forward to trying...include the Parmesan truffle fries  So grab a bottle of wine and a seat outside and just enjoy yourself!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "pIHpYy4t_gAIad7w_VL3Sg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pIHpYy4t_gAIad7w_VL3Sg/o.jpg"
      },
      {
        "img_id": "9Zxn_GQfhTstB684Q8iRWw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Cheese flatbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Zxn_GQfhTstB684Q8iRWw/o.jpg"
      },
      {
        "img_id": "qh0mCh5oIY1PlZYc5KKmKA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Donuts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qh0mCh5oIY1PlZYc5KKmKA/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "JeJKDxGa46eKSxBH8dWu0w": {
    "date": "6/14/2019",
    "text": "Holy cow! This is my go to date night spot! Everything about this place is phenomenal. I can literally think of no negatives about this spot. The food is to die for. Mussels, flatbreads, charcuterie.  The outdoor patio is amazing, perfect for a nice day or night outdoor dining experience. So much space, so many tables, and a beautiful view. I promise you, this spot will not dissapoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W28S8vPDB_PcWcp3dqFwrA"
  },
  "QxfsWRHXdEy81MKuzSqwSw": {
    "date": "8/11/2019",
    "text": "I've been here numerous occasions for different reasons and every time I enjoy my experience. To start, as soon as you walk by/in, the outdoor patio and interior atmosphere are inviting, comfortable, and well done. The staff is always friendly and happy to assist whether you're looking for just a glass or something from their selection of bottles. Their knowledge has been great and I appreciate that they're great at finding a colleague that may know an answer rather than fib just to make a sale. The wine selections I have had have been pretty solid. The food menu is pretty tasty too. One of my favorite starters is the ricotta with toast points and you can never go wrong with one of their flatbreads. For a nice place to sit down and enjoy a glass or a bottle with a friend, they do an excellent job and I never cringe when a friend mentions this as a suggestion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "yg1EM98UssYX6bBJZ9K6TA": {
    "date": "3/2/2019",
    "text": "I was looking for a new place to try in the South End/Dilworth area. Somehow I've tried so many of the restaurants in the area, but not this one so we decided last night was the night to try it.   I've heard great things about the food here. We went with another couple and shared everything. We got the Brussels sprouts, the truffle fries, the three cheese flat bread, the roasted mushroom flat bread, the beef sliders, and the burger.   We loved everything. The Brussels sprouts were very unique with great flavor. The flat breads were perfectly crispy. The truffle fries were awesome. The burger was one of the best I've had in Charlotte. The sliders were equally delicious.   I've noticed a trend recently that some of the best burgers are not from burger places, and I love discovering an under the radar burger (check out the Crunkleton too).   We finished off with the donuts for dessert. They are cinnamon sugar and powdered sugar with caramel and dark chocolate dipping sauces. I was shocked that you got four of each. They're donut hole style but they're really big. Both were amazing. I was surprised that I actually liked the powdered sugar a little more since I'm not usually a big fan of powdered sugar donuts.   The only thing I didn't like a whole lot was the space. It was very crowded and loud. They have wine everywhere, but there isn't room to browse without being on top of someone's table and there isn't much room to walk by. It felt like deciding to make this a restaurant was an after thought in that regard.   It's definitely on the upscale side, but not as much as some of the other wine bars. We definitely didn't fit in with the rest of the clientele. The good news is, the prices are still very reasonable (at least the food, we didn't have wine).   It's also a pretty popular place to go. At 8 on a Friday night, there was about a 15 minute wait for a table of 4.   All in all, I definitely think this is a restaurant worth trying!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "3rFhTH0ptSPZ_PHq5Olz-g",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Roasted mushroom flat bread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3rFhTH0ptSPZ_PHq5Olz-g/o.jpg"
      },
      {
        "img_id": "WW_UdANAinM4AVAdGC21jg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussels sprouts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/WW_UdANAinM4AVAdGC21jg/o.jpg"
      },
      {
        "img_id": "KFXgO2-vWE_pSOzRRWTDgg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Donuts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KFXgO2-vWE_pSOzRRWTDgg/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "AGp2Znpe_q4iWLDvW4MSdw": {
    "date": "3/24/2019",
    "text": "Has cute outdoor seating, which I enjoyed the most.   Going inside to get seated didn't feel very smooth due to the layout and how packed the place was. People were standing everywhere and it took a while for the hostess to get to us.   The place has an casual atmosphere. Menu is more small, shareable plates. Everything I got was ok. Brussel Sprouts - too saucy, the Brussels were soggy - I like that crunch! It was a large plate, definitely shareable. (I was disappointed, I saw Fox Croft on the list for best Brussel Sprouts in Charlotte.)  The truffle fries were also soggy - not the best.   Pickled veggies - beautifully plated but okay. Nothing amazing food wise for me here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WtGqYYqL2X_DdnyWdQNEFg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussel Sprouts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WtGqYYqL2X_DdnyWdQNEFg/o.jpg"
      },
      {
        "img_id": "7_EzIOXmygFEdH-rASMqBg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7_EzIOXmygFEdH-rASMqBg/o.jpg"
      },
      {
        "img_id": "V5s_arkOMC0erueMcxKbxQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Truffle Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/V5s_arkOMC0erueMcxKbxQ/o.jpg"
      }
    ],
    "user_id": "UGVVAh8mhdPP-M4ik3jvBg"
  },
  "VcRFdbfeYRTV2iUHWBQGtA": {
    "date": "8/24/2019",
    "text": "Had dinner here tonight. The service was exceptional so that's always a great start. I had the burger and it was above average probably better than most places. My wife had the salmon and she liked it a lot. Also above average. The wine list is great and plenty of local beers for non wine drinker. The 5 star winner of the night were the donuts.  A must if you like pastry. The only reason we did not give it 5 stars is because it is little pricey. Not crazy though. We will be back for sure. A great date night place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "shHA_otnhFuT-N28xQivcA"
  },
  "xDI2bbDQIDatTPUeKEGQOw": {
    "date": "3/1/2019",
    "text": "If you're looking for a place with great shareable options then Foxcroft is a good place to go. The layout is a little unusual and clunky but the food is really great. The mushroom and three cheese flatbreads were great to have for everyone at the table. The beef sliders were very flavorful and the bacon jam that came on them helped give an added subtle sweetness that made it even better. I enjoyed the Brussel sprouts a lot more than I would have anticipated and they were just about my favorite thing on the menu. The addition of butternut squash and cashews were a neat combination and the soy chili glaze gave it a nice zing. We got a decent amount of food for a really great price as well. Definitely would recommend as a place to go for a later night out and would enjoy coming back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z2Qvr9mTukj0tP-OWZACDQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Doughnuts",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z2Qvr9mTukj0tP-OWZACDQ/o.jpg"
      },
      {
        "img_id": "ByptczDUolkjgJy1r8gkcg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Mushroom flatbread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ByptczDUolkjgJy1r8gkcg/o.jpg"
      },
      {
        "img_id": "x5o6VhIY7VKzC7MQsShkhw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussel sprouts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/x5o6VhIY7VKzC7MQsShkhw/o.jpg"
      }
    ],
    "user_id": "mGdMAkgnqW8omQuRbsOAPw"
  },
  "36VKbloDKBqCBpDMyRw9LA": {
    "date": "3/1/2019",
    "text": "The only reason I give this place 4 stars is because while we had to wait for a table to open up, there was really no designated waiting area. They have shelves upon shelves of wine bottles which made a small space seem even smaller. So anywhere we stood we were in the way of either someone looking at wine or people coming in the door. However the food was amazing. We shared the brussel sprouts and fries as a table of 4 and split 4 entrees which was the perfect amount of food. We finished the meal off with an order of doughnuts which came with 4 powdered sugar doughnut holes and 4 cinnamon sugar doughnut holes accompanied with a dark chocolate dipping sauce and a caramel dipping sauce. I wouldn't mind going back but would probably come earlier so it's not quite so busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B1wpUGiwE3vQuNccBUtW8A",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Beef Burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/B1wpUGiwE3vQuNccBUtW8A/o.jpg"
      },
      {
        "img_id": "mDkaclzBE5ocF70yHcvIaA",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Doughnuts",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mDkaclzBE5ocF70yHcvIaA/o.jpg"
      },
      {
        "img_id": "qtZEaky9WJ-XRG-lrWcjQw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Roasted Mushroom Flatbread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qtZEaky9WJ-XRG-lrWcjQw/o.jpg"
      }
    ],
    "user_id": "ttmv_T2Zy8YwGpAsSvlDfw"
  },
  "N7-GBasKvbRNXjdQT4_FqQ": {
    "date": "3/1/2019",
    "text": "TLDR:  The food is mostly small plates. The vibe is upscale. The burger is low-key one of the best house burgers in Charlotte. I love their flatbreads. Try the donuts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6kzK6KpV1olm5FizSNaeHQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Donuts",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6kzK6KpV1olm5FizSNaeHQ/o.jpg"
      },
      {
        "img_id": "hdWFPcl56jLMcINKqQTRGQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Brussels",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hdWFPcl56jLMcINKqQTRGQ/o.jpg"
      },
      {
        "img_id": "LHmfMJA-ViNvSpn_cOZCrw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Mushroom Flatbread",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LHmfMJA-ViNvSpn_cOZCrw/o.jpg"
      }
    ],
    "user_id": "pBeNjksmGLPlBTaujOqiLQ"
  },
  "SvxbwDAcEe7GMfXIBoLrhg": {
    "date": "8/16/2018",
    "text": "I was in the Dilworth area looking for a place to stop and do some quick work on the computer this Saturday.  I thought I would just stop in and see if I could grab a glass of wine, a lite bite...and wrap-up.   This place was GREAT!!!  Although the \"hot\" food wouldn't start until 5, I ordered spicy almonds and a a separate order of ricotta and toasted bread!  FANTASTIC bites and a great wine selection!!!  Definitely a great way to do a little paperwork...noodle through the day and ease into the evening to wind down.   However, little did I know that during my visit a MONTHLY wine tasting Event was about to begin.  Spanish wines were the Regional selection and the selection was good--and the attendance to the Event well attended.   There are other Events(dinners and tastings) planned throughout the month and the staff is very polite and attentive.  What a great find and a place that I will absolutely visit again.    If you are looking for a great wine selection where you can sit, eat, and relax...I hate to give away the secret;)!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_rMI1X-EveEqFmtwBLUoVw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_rMI1X-EveEqFmtwBLUoVw/o.jpg"
      },
      {
        "img_id": "ytYM9bBmhUNEMMn71EuDSQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ytYM9bBmhUNEMMn71EuDSQ/o.jpg"
      }
    ],
    "user_id": "IfA2cfoDU5DUBtrqkdlJoQ"
  },
  "vdxV4y2_tESYziqaHDhWEA": {
    "date": "8/2/2019",
    "text": "Wine was fresh. Very busy on Friday night. Friendly staff. Always enjoyable.  Desserts were yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2CK-iIzGV4x6653DWl0lNw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Desserts. Donuts and chocolates were very good, tasted incredible fresh.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2CK-iIzGV4x6653DWl0lNw/o.jpg"
      }
    ],
    "user_id": "jtHEJ9wGpH3JziJMIwdJHw"
  },
  "Ty3mh2P9RfE1k2BEKwDsKg": {
    "date": "7/28/2019",
    "text": "We hosted my daughters Bridal Shower on Saturday July 27 at this location.  Everything and everyone at Foxcroft Wine Dilworth was amazing.   When I started my search for the perfect venue, I made contact with Erin.  She couldn't have been more easy to work with.  From planing the food and wine selection, the room set up and answering my calls and emails, she was alway there willing to help.   Day of event, we were helped by Lea and Liz.  We received the same excited enthusiasm as we arrived with.  Excited and willing to go above and beyond to make our event special and perfect!   The Chef prepared our selected menus and served them with great presentation.   Our guest had a great time and my daughter couldn't have been happier with her shower!   Thank you Foxcroft Wine, Erin, Liz, Lea and all Of the Foxcroft staff.  You were amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AkWT5fqel9kqs_7wD5QAVA"
  },
  "3uHTJu1aC6ulqFV6XSeWDA": {
    "date": "6/19/2018",
    "text": "Very nice and helpful staff.  Very busy right after work.  Lots of wine selections.  Rustic industrial decor which is in line with a lot (a lot) of places recently.  Specific comment about their chocolates of the day.  A raspberry and honey cashew butter in dark chocolate...  The flavor is delicious, but...   They were pretty much frozen, so I couldn't eat them - for a while, and I needed a knife to crack them open.  The bartender offered me a sharpen knife ...  I don't know if you can tell from the picture but I actually scraped off the filling to show how much chocolate makes up the bottom of it...  Waaaay too much of that and basically so hard that I was a little nervous about cracking my tooth trying to bite into it.  So, yes it's a nice place, great wine... Everyone's savory selections looked and smelled good...  Buyer beware on the chocolates though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Qb6eF06woJII5bq5lkqoFQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Scraped off the filling.about half is solid, hard (frozen) dark chocolate.  Hard/impossible to eat, but the top half was good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Qb6eF06woJII5bq5lkqoFQ/o.jpg"
      },
      {
        "img_id": "UEGwLdhIsSi9-iE7pvfgzQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Merlot with delish chocolate!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UEGwLdhIsSi9-iE7pvfgzQ/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "Nutzs2tG2b0WGN2KzF6YRA": {
    "date": "9/15/2018",
    "text": "There's a lot of great wine bars in Charlotte but Foxcroft has become one of my favorites. It's really a beautiful space with high quality wine, but it's also casual. I love it for nights where I want a nice glass of red but don't want to have to get all done up. Their patio is fantastic and is really charming with the lights on at night. The staff has always been incredibly friendly and helpful when I'm deciding between wines. I've had a bunch of great reds here, most recently a delicious zinfandel. I ended up buying a bottle of it to take home. I find their glass and bottle prices to be reasonable for the quality.  Recently my husband and I had a full dinner here and were so impressed by the food. We started with the ricotta. I had the sliders and he got the scallops. The ricotta was delicious and was presented so nicely on a cheese board. It was light and fresh and I loved the lemon flavor. My sliders were tasty and the bacon jam added a really nice sweet element. The scallops were a real standout, though. They were cooked perfectly and came atop a great farro mix. The portion of this was also very generous for seafood. Foxcroft is also great if you want a bottle of wine on the way home from work-you can stop in and find something. There's no pretentiousness here, either, so it's easy to have a conversation about wine and find something that works for you.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "qopA1DLwDjDSIxsfCo9Zyg"
  },
  "ZmXZ41yYHfK1oK38aVLCSg": {
    "date": "1/29/2018",
    "text": "Sometimes it's good to stick with what you know, specially for first dates. I mean a little dinner, a little music and a whole lotta wine goes a long way.  Foxcroft Wine Co is truly a hidden gem, tucked away in Dilworth's Kenilworth Commons shopping center. It is a fabulous wine place with 40 wines by the glass (from every region of the world), 12 taps for beer lovers, and low-key vibe.  Try the roasted mushroom flatbread and truffle fries are dangerously addictive.  Four solid Yelps.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "iUCAko5Kk8STIOLSKUau4Q",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/iUCAko5Kk8STIOLSKUau4Q/o.jpg"
      },
      {
        "img_id": "1WnzXENtcQjXze7JWRWJpQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1WnzXENtcQjXze7JWRWJpQ/o.jpg"
      }
    ],
    "user_id": "N9hqTPQu2bmI8c2Pj8F1ww"
  },
  "kdb-Nv-MTaq9KhZ7hqrPpg": {
    "date": "6/16/2019",
    "text": "Great atmosphere and great food! This restaurant always has a selection of good food and wine. We like sitting outside on the patio.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rWQ7UraNkAkRp7VwdD1TBw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Octopus appetizer. Great flavor and presentation!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rWQ7UraNkAkRp7VwdD1TBw/o.jpg"
      },
      {
        "img_id": "8UmIEF_J0_8dYfgpgUyobw",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States. Powdered sugar donuts and cinnamon sugar dusted donuts. Very yummy!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8UmIEF_J0_8dYfgpgUyobw/o.jpg"
      }
    ],
    "user_id": "unSpOW9juFrhxKzBxzptOQ"
  },
  "h3IJWcN77xJZbURPcio5lQ": {
    "date": "6/2/2019",
    "text": "This is one of our favorite restaurants in Charlotte. Service is friendly and smart with consistently good food. You should have the doughnuts with warm caramel and chocolate sauces. Nice patio that is great for dogs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ScUX8L5It9BA3BRYrWNXsw"
  },
  "-lyUH006lKKp1ZZMAVqZvQ": {
    "date": "3/1/2019",
    "text": "I've been here multiple times and the food, wine and atmosphere are always top notch. From the Brussels to the pizza to the AMAZING donuts with dipping sauce, I've never had a bad meal here. Being able to pick out a bottle of wine (no corkage fee for $30+ bottles) and walk home with the extra if it's not finished is so nice. As a bonus, pups are allowed on the porch now! Love having this place in the neighborhood",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3lMq5W6Npf_cur5XqxmklQ"
  },
  "VuI74P-uCBYE-aoNa98CEw": {
    "date": "2/18/2018",
    "text": "Wine. Casual. Informative. Tapas.   Friday's after work you can find me at one of the Foxcroft locations. It's the perfect place to wine down before dinner or bed after a long week.   You don't feel pressure to drink and dash, the staff is accommodating and very informed on their wine menu, and the best part, they know you are there to chit-chat and not rush!  The Brussels and the flat breads pair well with almost any beverage you select. If you aren't into wine they have a fair amount of beer too. If you aren't sure what you would like to drink, ask for a sample.   Foxcroft has ample seating outside. Indoors you feel like your in a wine cellar, all that's missing is the views of the rolling hills covered in grape vines.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "t9bll1Pd0H8w0eE523CdAg",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/t9bll1Pd0H8w0eE523CdAg/o.jpg"
      },
      {
        "img_id": "XOi29PQL-YZ-LtdxcOs_wQ",
        "caption": "Photo of Foxcroft Wine Co - Dilworth - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XOi29PQL-YZ-LtdxcOs_wQ/o.jpg"
      }
    ],
    "user_id": "S_CeIOGlUspN3FIP028CcA"
  }
}