{
  "iG-xIA_TnkjfzHH9-lXYhQ": {
    "date": "6/27/2016",
    "text": "Needed a quick eggs and grits breakfast on a busy Sunday morning and got it! Service was great and the atmosphere was all families and friends. Every table and booth was full when I left at 9:30am. Coffee was hot and strong, grits were perfect and I was able to make it to my grandson's baptism on time. Noise level was a bit on the \"loud background\" level due to a large turned-on TV mounted at ceiling height about 15 ft. from my table but since I was dining alone it didn't matter. I'll be back for lunch and breakfast whenever I'm in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eMJDIrlLLsTjmxIDj5Q2Zw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. View from the booth.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eMJDIrlLLsTjmxIDj5Q2Zw/o.jpg"
      },
      {
        "img_id": "n2zEM31M-aDibEZ-jVwn3Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Bar area and open seating",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/n2zEM31M-aDibEZ-jVwn3Q/o.jpg"
      }
    ],
    "user_id": "h4PzmX1DvnzbahotswNLVA"
  },
  "Ai94Z8XUcwKo2XkInrFyIw": {
    "date": "8/12/2012",
    "text": "Thanks to Yelp, we came across this place for breakfast and had to give a try. It truly didn't disappoint at all. The service was quick, the food was adequate without being overly large. Great family place and seems very popular with the locals. I think when we come back to the area, we will go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tYxn5q75k-mnLFC_4QPzxg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Smoked sausage and cheddar omelet with cheese grits",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tYxn5q75k-mnLFC_4QPzxg/o.jpg"
      },
      {
        "img_id": "l5Kj4TPbiUryTF_FrY9quw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken florentine omelet special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/l5Kj4TPbiUryTF_FrY9quw/o.jpg"
      }
    ],
    "user_id": "6Nk8WX1STMTEuKjmRlrh6A"
  },
  "v1n9T1I7efCLHfzkLrUtcA": {
    "date": "3/26/2018",
    "text": "Had a great prime rib dinner last week. Miss Julia was an awesome bartender and a great conversationalist.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lr2p-n_Tvaj_vbI_WDoBPw"
  },
  "BZHB96B1HovVnaa7rxTifg": {
    "date": "1/15/2017",
    "text": "I totally get it!  This is a charlotte staple and I see why.... we'll I'm not sure if it is a staple( made that up)  but eddies place most certainly should be!   I came for brunch with friends and stayed for the drinks.   At 12pm sharp the crowd started cheering.  Let the drink service begin!  It was a Bloody Mary kind of day and I'm so glad it was... their bloody Mary's are perfectly spicy salty and strong! The food. MMMMMM! Fried chicken biscuit and gravy!!! Yes a thousand times yes! And that's all you really need to know about the food! Well ok a lot of other great things on the menu.  My hubs had the chicken and waffles which were all type of perfection and our friend had the chicken fried prime rib and breakfast burritos which I didn't try. The ambiance isn't anything fancy but it ways I can't explain, adds to the charm.  The sassy hostess was adorable and the service was great!  Price points aren't too bad  So much for my new year resolution diet!  But Eddies Place was worth it!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "_0LwemzCLchggFtEWHERDA"
  },
  "GBLo61zr71BY5qc71yOrEg": {
    "date": "7/9/2016",
    "text": "Saturday brunch is the best!! Awesome service and excellent food. You'll probably have to wait to be seated but it is worth the wait.  Guys get a Man-mosa. Invented here and excellent way to get your Saturday going.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X9NuOzjlYhGY86SYIAaCCw"
  },
  "1GgvuTq-_STenQB4dTSXGQ": {
    "date": "12/18/2016",
    "text": "This is a very nice place to eat. It is very popular so expect a wait. We had a late breakfast or early lunch. The food is delicious.  I met a regular diner and she told me the best items on the menu...I must confess she said everything was great. I plan to return to this restaurant. I now know the secret to getting a good seat at the bar.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "c3eGYUk1lm3ChCJohJQHwA"
  },
  "_zVbcXWD65j3EQGmB6lrSQ": {
    "date": "6/17/2017",
    "text": "The wife and I love going here. Breakfast is always good and the lunch items are tasty as well. Service is good. You can always tell a good place to eat when there is almost always a wait. They serve lunch and breakfast all day as well keeping everyone happy. You have got to try the biscuit and gravy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fn7QupFXqWPheord2aWbSg"
  },
  "xGBvaj6RQDH234pUUSyz6Q": {
    "date": "4/22/2017",
    "text": "I took Virginia's recommendation with the chicken fried breakfast.  Great place for breakfast and when I come back for lunch or dinner I will update this. I don't think you can go wrong with anything you order the couple next to me are regulars and showed me everything that is good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jz1N0-VT0Tb06-8Rd5qqVg"
  },
  "1bRSy_DNnK3lAdTLNoFTdg": {
    "date": "10/12/2014",
    "text": "One of the best breakfast spots in Charlotte!   Omelets are perfect and the hash browns are great.  Coffee is just ok, but the good will get your mind off of that.  Make sure to get the creole sauce on the side with your omelet, delicious addition!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "csicUThXA8vSc5zWvyMRtw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/csicUThXA8vSc5zWvyMRtw/o.jpg"
      }
    ],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "r_3vhvuF2ZzREydretOHZw": {
    "date": "4/28/2017",
    "text": "This place is always amazing a staple restaurant that I have visited for thirty years. The burgers, and the Parmesan grits are my favorite items on the menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kgTG5jT32bABw5-ljVU9rw"
  },
  "QHNFfuA7ZBu_1VkLaMKtig": {
    "date": "2/27/2017",
    "text": "Found this place on Yelp and decided to check it out since the reviews were good.  I went on a Sunday and this place was packed.  Be prepared to wait.  Since I was by myself the hostess recommended I put my name on the list at the bar.  My bartender Ben was a really nice guy and very personable.  He recommended one of the specials and I'm so glad he did.  It was delicious!  I ordered the Chilaquiles (traditional Mexican dish) with a side of liver mush.  I really enjoyed it and recommend everyone to try it! Now for the negative stuff.  Management needs to staff another person behind the bar during breakfast/brunch hours.  I waited about 15 minutes to even get a cup of coffee and then he gave me a menu.  Another 15 minutes go by for him to get my order.  So a total of 30 minutes from the time I sat down and finally ordered.  With the wait you guys had, you should have been flipping my seat ASAP.  It's not Ben's fault that he had no help, management is the one to blame.  The bartender does spend a little too much time talking to guest during a rush, but could you blame him as he has been neglecting tables?  He handled the whole bar, cashed out servers, ran food, took to-go orders, etc....I felt bad for the poor guy. I'll give it another try in a few months.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkIHGdNJKTMaEYTX53BQgw"
  },
  "tBLDocjsNVJhWJ3xaTs2fg": {
    "date": "8/20/2016",
    "text": "First time here & family enjoyed the breakfast. Service was quick and waitress extremely helpful. Fiance wasn't a fan of Parmesan grits, but waitress promptly noticed & provided him with regular grits. P.S. My daughter loved the Parmesan grits! Will return again for lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qt0N-a6NQdN28VDBnoM9hQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Loving those grits",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qt0N-a6NQdN28VDBnoM9hQ/o.jpg"
      }
    ],
    "user_id": "hdzWRRlaFczc1UFuUAdpbg"
  },
  "eHGPk41HIIJLhmpSEFQMug": {
    "date": "2/20/2016",
    "text": "If I lived in Charlotte, this would be one of my go-to spots. It's a perfect place for Happy Hour or even weekend brunch. It does get crowded though so there may be a little bit of a wait. Fortunately, the bar was open when I went. The staff is pretty awesome, and they were accommodating when my friend and I changed our orders last minute after seeing someone else get their waffle chicken sandwiches. There needs to be more places like this in the world!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HHYTuRcyFRLRE08OrkQHqA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HHYTuRcyFRLRE08OrkQHqA/o.jpg"
      },
      {
        "img_id": "IWx5h8n93ZfV_9I6mODPrQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. That waffle chicken sandwich though..",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IWx5h8n93ZfV_9I6mODPrQ/o.jpg"
      }
    ],
    "user_id": "7fq2wfncGEjmJrC_YvgrTQ"
  },
  "hmnB78Ct9Hloma4n9cX_XA": {
    "date": "4/23/2016",
    "text": "Chicken and waffles are a must, and don't forget to order their Mac and cheese (insanely good). AND!! don't miss first call on Sunday at 12pm... The bartender (Ben) is a character in the best way possible and is very attentive. You're lucky if you get a seat at the bar! And the mimosas! They pour an entire mini bottle of champagne in the glass, add a splash of OJ, and then drop in a cherry.  If you want great service and delicious food, go to Eddie's.   PS - They serve breakfast all day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cM6JivjC33jIGfx8lYlfzQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Blackened chicken omelette",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cM6JivjC33jIGfx8lYlfzQ/o.jpg"
      }
    ],
    "user_id": "vF0g-NjE6OH8F0aQpR5fXg"
  },
  "CzbZd9BdkIAZt3w_Nqgfug": {
    "date": "4/15/2017",
    "text": "My husband and I checked out Eddie's place for breakfast on our short weekend trip to Charlotte. We had no wait which was awesome. The Ciabbata French toast was good, the pancakes were excellent and the Chicken and Waffles were the best we've ever had. The Bloody Mary was pretty delicious as well. Our waitress, Ginger, was attentive and incredibly helpful in providing us with recommendations for places to check out in Charlotte. We definitely recommend this as a brunch location!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YZxY2-PzkXBJqpmSol68ZQ"
  },
  "UW1zGx2lmZfyrXnNhZXp2g": {
    "date": "12/1/2017",
    "text": "The service here is always great. They would keep refill your coffee. Great place for breakfast and they have lunch too. Breakfast is all day. Parking can be tricking. The best time to go is very early or during the late afternoon. I usually get the omlette. You choose the toppings you want on your omlette. Pancakes are good too come with a side and a choice of meat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NN9SThdMsM5xSd58mZ32dQ"
  },
  "lSujwI3Bfe9gy9oyXrtQ8A": {
    "date": "7/17/2016",
    "text": "We got a eggs Benedict which was  amazing  And grits which were pretty average but still good. The service could have been better, we had to ask for coffee multiple times before we actually got it. Seating was comfortable and it had a great brunch/lunch atmosphere. This is a great place to eat and is one of my favorite breakfast places to go to.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l0Pi8usL8rR-lnfJ592aCQ"
  },
  "zTyk8c5Jwn19GsGlMXmd1A": {
    "date": "11/20/2016",
    "text": "Great homely/family environment. They are open till late and serve breakfast all day. Chicken and waffles is definitely my favorite.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvivYrK-o2dp_Sk5ips8nA"
  },
  "ZSeH-DyGayqMdcbTeazIJw": {
    "date": "7/1/2017",
    "text": "Came here for breakfast while in town visiting family. This place was awesome. I had the cibiatta french toast with smoked sausage and the wife had chicken and waffles. Great food and service. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3oSiCXMfF6UFUtk4w-qJ3g"
  },
  "IwaYFzg3tWtoPlzoAj6tqA": {
    "date": "1/4/2014",
    "text": "Love those Boston Clams  The Boston clam chowder is close to the best I have eaten. It has a smokey flavor due to the bacon and is more full of clams than any other to me.   They are proud of their Reuben. It tasted good, but there is way too little beef, just two very thin slices. Because of this I'm dropping a star from my rating.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EtOfq40Zh4Pp6DaZzxRA3w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. I took this shot of a slice of the corned beef used on my Reuben.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EtOfq40Zh4Pp6DaZzxRA3w/o.jpg"
      }
    ],
    "user_id": "d63eAOSBa3E5uNYYzD8yzg"
  },
  "TFD2e31Tt_z_6QrPD2Gl2A": {
    "date": "4/9/2017",
    "text": "Came in Sunday afternoon and had a great meal. Started with She crab soup(excellent).  For the meal, I ordered shrimp scampi with a side caesar salad. The shrimp were tasty cooked perfectly with a smooth sauce over the linguini. We also ordered a burger with cheese and mushrooms and onions. The burger was very juicy and had an excellent outdoor grilled flavor! The service was personable and she offered what I needed before I asked. I will come here again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yQk15KusyoN7HlRZK0Z1EA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Shrimp scampi is very tasty and the noodles fit perfectly in their dish. I loved the smooth flavor.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yQk15KusyoN7HlRZK0Z1EA/o.jpg"
      },
      {
        "img_id": "uAEVaDyeyrUVIWaFmgQ7Pg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Ceasar salad is great! Not too much dressing and not too little dressing, just perfect.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uAEVaDyeyrUVIWaFmgQ7Pg/o.jpg"
      },
      {
        "img_id": "hH24ZzoNz0NZXafRaL4xnw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. She crab soup! If you come here, you MUST get this.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/hH24ZzoNz0NZXafRaL4xnw/o.jpg"
      }
    ],
    "user_id": "r3E0r1_pX4kQIZxQC9XLwQ"
  },
  "U1d288z4C_7l-L4YK0i8Bg": {
    "date": "2/14/2018",
    "text": "I would like to give this place 4 1/2 stars (I very seldom give five stars).  While this is not fine dining it is a place to get good food, at a reasonable price with good service.  If possible get there early as they tend to be busy during the rush times.  It has a clean, unpretentious atmosphere.  The food is fresh and things are done in a timely manner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOZRcZ7ERo2MS8odFBfQwg"
  },
  "WCxiILSAXjW1hZtMb_1tcw": {
    "date": "10/9/2018",
    "text": "Great neighborhood restaurant. Nice menu selection. Food is always good as is service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dU0B77OpONFE_WnEniPOyA"
  },
  "NZg6sTg7SsYOabP6FUTWYA": {
    "date": "6/23/2018",
    "text": "I love the atmosphere in this place. Rustic yet slightly chic with a comfort food menu. I love she crab soup and was told it was the best anywhere. Of course I had to try it. Well maybe I shouldn't have added the splash of sherry because it made the soup taste sweet. To be fair, next time I will try it first minus the sherry to see if that was the culprit. Other than that, everything else we ordered was excellent.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKHn7RY0YYkdICeIJlh-qA"
  },
  "hOG96a7UVxnBur3himJuEQ": {
    "date": "9/29/2018",
    "text": "I stopped in to eat at Eddies Place for lunch with my parents on a Saturday. We waited avout 20 minutes to be seated. Our waiter was super nice. I had the she crab soup for starters. It was fantastic! For my meal I had a cheese burger and fries. It was really good. I cant wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cruvRLnVE8GrvrofL5MbBA"
  },
  "K74tr7Sa8LqOXcAJyY33hA": {
    "date": "9/2/2018",
    "text": "The food was fantastic, but my service was horrible!! Server did not give me water after asking three times. It's unacceptable to not even have the minimum of water for 30 minutes. Many people sat after us, and was served before us. Great food but service...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tj88aXay8ynGwfwrGAWtPA"
  },
  "kwZf-QpcKdC4N4_QoGlC_Q": {
    "date": "11/22/2017",
    "text": "As a native of this city I'm somewhat ashamed to admit I've just now eaten here.  Better late than never though!    What a gem.  Sure, its parking lot can sometimes be a landmine, sure it's not the newest shiniest gemstone of a dining establishment and you know what?  I'm good with all that because I just had probably the best Rueben I've ever had alongside some of the best hand cut fries.    Top off the delicious food with a dose of pleasant table side manner and viola!  Achievement unlocked!    It might be called Eddie's Place but now it's My Place.  That's right My Place (I'll concede my naming rights with a handshake from Eddie himself only).",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "HJ28gT4Z9jouvQTLVOTjhQ": {
    "date": "8/17/2018",
    "text": "In a town with great sports bars, Eddies is a quality establishment. Friendly service, clean and not overly expensive. Breakfast Burrito very good. Don't love the location inside a row of stores with decent but not great parking. Will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ChZfGasEOvRzvzZePBGMAQ"
  },
  "pw1XLXPcuiy4hjpWSWKNjQ": {
    "date": "8/14/2018",
    "text": "My favorite neighborhood spot. Best wings and burger and she crab soup in town! Very family oriented and relaxed.  Been going there for almost 20 years!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cwRaBOyy8kzJBtd7BsCR8w"
  },
  "We7TAEw3x9ubj1LGMvVD3A": {
    "date": "6/14/2018",
    "text": "I was lucky enough to be in Charlotte for Tuesday night prime rib!!! My family had to roll me out of there! The service was so wonderful. We had a family of nine. They seated us right away and took the time to walk us through our desires to try nearly everything. The prime rib was PERFECTION. The shrimp and grits absolutely killed it. Kids and adults were super happy. Everyone left happy, full and still talking about our wonderful meals!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pTZyOzR_UtAfZw-9GYNOlQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pTZyOzR_UtAfZw-9GYNOlQ/o.jpg"
      }
    ],
    "user_id": "kiAcuzKbmxKvPfI2ZaZvNw"
  },
  "fkLD7u1MbW7-mZwvuA2Kjw": {
    "date": "12/26/2018",
    "text": "Hands down the best chicken parm I've ever had! I once got pancakes which was delicious but the chicken parm blew me away!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "15JsdTtooXFQ2k-Mwr4rpw"
  },
  "DLNPC_BRNA7ucLRm-cm_2w": {
    "date": "1/28/2018",
    "text": "The wait was pretty long at lunch time for Sunday brunch, but it was a party of 8 with 3 children. They also sat us about 20 min less than they initially said. Wait for a party of 2 was only about 30 minutes. The noise wasn't too bad, and the service was great. The server gave us wonderful suggestions and even took a photo for the table! The fried pickles were a perfect starter and their house ranch is amazing!! Chicken gumbo had fried okra with a thin/smooth roux and so good, but had a little spice to it. The bread it came with had a salted crust which was the right compliment. Smoked Gouda and Bacon Mac is the greatest creation! We all enjoyed our entrees. Definitely a perfect go-to for brunch or just great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H0VVCLKdVa2KAa1rl2vaFQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Shrimp Po Boy on Ciabatta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/H0VVCLKdVa2KAa1rl2vaFQ/o.jpg"
      },
      {
        "img_id": "WnkwZXJbYorJ6PDpbFSCIw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Creole",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WnkwZXJbYorJ6PDpbFSCIw/o.jpg"
      },
      {
        "img_id": "IALRv3UMF5H6x0wnQjlPlA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken &amp;amp; Waffle with cinnamon honey butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IALRv3UMF5H6x0wnQjlPlA/o.jpg"
      }
    ],
    "user_id": "_XChEgNfUxvkeF7Uzle7mQ"
  },
  "_0jUY2eG9u5ti_z21_HKnQ": {
    "date": "3/2/2019",
    "text": "The she crab soup is wonderful and the red beans and rice was very good this is a do over.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BkEGF_BOh0q85Ei_yRwx7A"
  },
  "-RfUR1MH0DsZONc32P0YEA": {
    "date": "7/13/2018",
    "text": "The food is great. Service is good, too.  However, it's difficult to enjoy any meal when the air conditioner is set to what feels like 40 degrees. The thermostat should be set for the diners, not the employees.  This is not an isolated incident.  Our group may not be returning, in spite of the good food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dwsx4n_h4wbXn8hIN6EjqQ"
  },
  "kQj_XclIoW3y1QvjPPNM_A": {
    "date": "12/16/2016",
    "text": "I just love this place, it warms my soul! The fried chicken breakfast is my personal favorite thing on the menu although the SheCrab soup is something to drive out of your way for! Make sure to stop in here, it's kinda a locals spot. My only negative is that the parking is rough because the lot is shared with so many businesses and it's small. Eddies does have daily Specials that they change up monthly as well!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MKAP0BGeWWhsF8RGaKV3_Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Amazing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MKAP0BGeWWhsF8RGaKV3_Q/o.jpg"
      }
    ],
    "user_id": "uy4oHzC_4zqEAn95Kv27Ag"
  },
  "nf0OyaOAcUdSfylERWPDfQ": {
    "date": "1/26/2018",
    "text": "Ordered the flounder po' boy. I got a huge piece of delicious fried flounder. I think there was some bread somewhere on the plate but I don't remember. Smoked gouda bacon mac n cheese was my side cuz  I make good life choices.   Had to try the She Crab soup too. Very tasty. Highly recommend taking full advantage of the sherry dispenser they give you. For some reason it takes that soup to the next level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mY-d9gVP15oFVaBDt3Jz8w"
  },
  "CByM7snsiwXgGX55_F-SqA": {
    "date": "2/14/2019",
    "text": "This is my going place whenever I go brunch with my boyfriend, they have the best French toast in town. I have been come to Eddie for more then 4 years and enjoy my very visit. Appreciate they offer new speciality!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F20mDmgVlZSJ7X64bJRmkw"
  },
  "ctCp-uK3BdSyZ2-QG61PmQ": {
    "date": "1/28/2017",
    "text": "People need to stop finding out about this place. We used to come here all the time when we lived in the area and came back on Saturday morning around 8:30 and it was already packed. We usually prefer to sit at the bar because the bartender is awesome. If you have the chance, sit there! We were seated in the only open spot which was right behind the hostess table. First off it was freeeezing. The service was painfully slow. I never saw our waitress and the place looked understaffed. The hostess was not very organized and a bunch of old guys stood awkwardly close to us waiting for their tables and kept telling the hostess about empty tables. The coffee is always good, and my hash browns this time were very undercooked. This experience was 1-2 stars but for old time's sake I'm leaving 3.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gU-zbIqnbMrDZf5x3K7E9g",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Biscuits are amazing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gU-zbIqnbMrDZf5x3K7E9g/o.jpg"
      },
      {
        "img_id": "yLWtIe561WAlZQFFcl5e2A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Butts right next to our table",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yLWtIe561WAlZQFFcl5e2A/o.jpg"
      }
    ],
    "user_id": "HfmoZIuNSWlN0J9-AgVWRA"
  },
  "QvPgtILn8kVDrwlhKX8PVw": {
    "date": "8/10/2018",
    "text": "My absolute favorite place in Charlotte. I bring all of my out of town guests here. The she crab soup is the best thing in the world!!! Their Reuben is amazing. But let me tell you about those shrimp and grits. Oh. My. God. Delicious, simple, and fulfilling! I also really enjoy their potato salad, it's not a mustard based potato and it is just super delicious.  I love this place so much that I send so many people here. I work down the street and whenever I'm asked where people should go grab some food, I ALWAYS say Eddies Place. They have specials as well, and ALCOHOL. them so much.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4h5Hy87x9olJq65T9AFKBg"
  },
  "IUlikUzd-MTbL5A8El69hA": {
    "date": "8/21/2018",
    "text": "The service here was amazing! I loved their brunch menu and I'm so glad they offer It all day! Highly recommend their ciabatta French toast and mimosas. Perfect brunch place, get there early before the rush on Sunday mornings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F68sNPEVsUNv0oRzm_OHoQ"
  },
  "VkGquVzwlWmEok7NlheQmw": {
    "date": "10/1/2011",
    "text": "Yep, I'm giving Eddie's one more star! My mother and I were out shopping yesterday and I was craving soup and remembered Eddie's having an awarding winning she-crab soup.   We ordered two cups of soups and a pulled pork Cuban sandwich, sweet tea and I went for a PBR.   The soup came out first and let me tell you -- we were so happy at the fresh crab meat and savory thick broth... it was amazing. They also bring you some sherry wine to drizzle over it.. DE-LISH. I of course had to put some Tabasco in it... That will be a cold day/night go too!   Thank goodness we shared the sandwich, as it was HUGE. It was really good. The bread, pork, ham, cheese, pickle... yum a great version of a classic Cubano sandwich.   We ordered a bowl to go and had them wrap up our left over sandwich and made sure to feed my father! ha!   My mother stated she really preferred this establishment over Briggs as the ambiance is refreshing and casual and not sterile like Briggs...   So Eddie's it is again. Thank you for the yummy food and great prices! My mom laughed that my PBR was cheaper than her sweet tea. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "BrXyeo4I2QZ_vOjk3LvT1A": {
    "date": "9/6/2009",
    "text": "Picture this, you are sipping on a hot cup of coffee reading the morning paper and you are eating a delicious plate of pancakes. Well, that is exactly what you can experience at Eddie's.  Eddie's serves just what you want from a casual restaurant for breakfast. The best part about it is it's not a greasy spoon. (They also serve lunch and dinner.) You can be in and out within an hour, or you can take your time and read the paper front to back...either way, we haven't felt rushed.  The hashbrowns are okay (little squares of potato), the grits are good, the bacon is crisp, the coffee is bottomless, and the pancakes are delicious. The servings are plentiful, the service is fast, and everyone I see leaves happy and full!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "EWFZp3TZkmsCP8mcX-8OtA": {
    "date": "10/21/2011",
    "text": "Came on a busy Sunday morning.  It's a nice little diner style place - casual, not quite dive-y - with delicious French toast and surprisingly tasty hash browns.  I say surprisingly because when they come out, they're these funky little cubes that look like they might have come out of a bag but then they surprise you with how tasty they are - they're cooked with some onions and they're good.  Bacon was also yummy.  The low point would be the coffee - hot enough but it tasted a bit weak and as though it had been on the burner for a bit too long.  Granted I got decaf so it might have been the brand, but still.  Before we got the check, I'd have given the place three stars. But then there's the fact that this place is SO CHEAP.  Seriously, when you can fill up a pregnant woman and a grown man for under twenty bucks, you've got it going on.  X-tra star for X-treme value!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "htzxDWzRt4Xd7UGy4t0yAw"
  },
  "XM-Gdz9p4D4sQ6k_vzjf2w": {
    "date": "2/13/2015",
    "text": "Excellent place for an omelet.  Whether you order off the menu, or make your own, you will not be disappointed. The servers can help you craft a perfect omelet, always cooked to your specs. My favorite is the veggie omelet with feta, but hold the olives please.  For those of us that hate the chain/franchise restaurants, Eddie's is the place to go for a solid breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-fWa5Y-rUGXEtQSKkclDAg"
  },
  "fYSpg2ffya9x3mW_5Qm5gA": {
    "date": "6/25/2011",
    "text": "Just simply a good place for unpretentious brunch ( and lunch and dinner too... but I eat mostly brunch here)  The menu isn't fancy, but the food is prepared well, and they usually have some interesting specials.  The Steak and Eggs is fantastic as is their Shrimp and Grits. Decent Bloody Mary's - which is a must IMHO.  Can get very busy, although I've never had to wait more than 15 minutes.  My only complaint is their coffee. It's awful. I can usually suck down a couple of cups if I need it, but I'm never happy about it.  It simply confounds me when a perfectly good breakfast joint doesn't have the wherewithal to serve decent coffee.  Doesn't stop me from eating here, though!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ezkykzr3SjmUy4z4h1Hp6w"
  },
  "X0srvvQVi2ORS7L1kSQVAA": {
    "date": "10/31/2011",
    "text": "My wife and I were looking for a place to have breakfast one morning and when we saw the number of cars in the parking lot around Eddie's we knew that this had to be a place to check out.  The place was crowded, everyone seemed happy and we headed to the bar which was a first come first serve section.  I had the French toast, side of bacon and hash browns which were pretty fantastic and my wife had an omelet which not only came out perfectly but made us want to come back here again.  One of the best parts of this experience was however, the breakfast and a show.  There was a little boy two seats down, maybe 7 or 8 who was having breakfast with his dad.  He also had the french toast but quickly cut it up into bite sized pieces, arranged them neatly around the edges of his oval shaped plate and then poured a pool of syrup in the middle.  One by one those pieces dove off the edge until the plate was finished, the little boy full and my wife and I completely entertained.  Now I can't promise he will be there every time you go to Eddie's but I can promise that breakfast will be good!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "LP9j1YqgWPJGw1zY_LRuzg"
  },
  "f4LJqw-LD-Nnksej23K9_A": {
    "date": "8/4/2014",
    "text": "My husband and I moved to Charlotte about three months ago. We've been searching for a good breakfast/brunch place for some time (we had a favorite in Northern Virginia that we really miss). With that said, we finally found it - Eddie's Place!  The outside looks like a dive but don't let that fool you. The inside is actually really trendy and, while there's usually a wait for a table, you can typically go straight up to the bar.   The bartender was attentive, helpful with the menu items, friendly and a big part of the reason why we're giving them 5-stars.  I had a basic egg sandwich but they have a lot of options to make it \"your own\" and it was delicious. My husband had an omelet which was perfectly cooked and full of flavor. He also had a mimosa and they aren't skimpy with the champagne!  For sides, I had cheese grits and my husband had the hashbrown casserole. GET THE HASHBROWN CASSEROLE!!! Seriously, it is amazing!  I can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1aSk0hKF7xNC2ESuiG77dw"
  },
  "iL4ewnpLdzNpM4fpAb6Tvg": {
    "date": "10/16/2013",
    "text": "Gouda Mac and Cheese with chili. Delicious but ruined my diet for the day!! It's always nice to chat with the regulars as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yR5z-ike4Bz63YQP9AXgzg"
  },
  "XtxArb0DrecyyZTpnV1lSQ": {
    "date": "3/1/2014",
    "text": "Friendly staff, delicious down home breakfast!  Biscuits- heavenly. French toast- spectacular. Coffee-hot, good and plentiful. Love to find locally owned places to spend my dining out dollars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fizUUWHaY5iiHTfaBmKCKQ"
  },
  "Rc9T0wwC94TD1-LArX9F7w": {
    "date": "11/23/2015",
    "text": "Order 3 egg omelet, French toast, waffle turkey sausage. Everything was great for tourist. The service was outstanding",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fkqbOMERmLstV4zRJgBWJA"
  },
  "PMusDZTwlNAhBpQX3qQXdg": {
    "date": "3/26/2012",
    "text": "Good, reasonable food. (beer too!)   $3 copper on draft? $7.75 wings? giddy-up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PTDhXN8nxW1DmDFFsDqSIg"
  },
  "YfLklWpqISbKW8HCzXuWlA": {
    "date": "12/3/2011",
    "text": "As long as you know what you're signing up for, this place is great.  It's not fancy by any means but offers delicious food and pleasant service.    The She Crab soup is terrific and the bread that comes with it is incredible - it's served warm and is soft inside with the perfect amount of lightly crispy crust!  The Po Boys are served on the same bread (I suggest asking for a side of mayo and mixing the mayo with Tabasco and then adding it to your Po Boy).  Also notable are the pancakes - which are perfect - fluffy and tasty! Just make sure you don't miss the soup!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJoIYfBgl-wbtdehNiU7PQ"
  },
  "_zdpzAjMfT44Wm-8DHgM5Q": {
    "date": "1/30/2013",
    "text": "I've been to Eddie's a few times and feel like I can't give them an honest four stars until I try their bloody mary... I've had brunch at Eddies 3 times now, service has always been great, and food has always been pretty standard (good, but not remarkable). If you are an early riser, you can get in and out of Eddie's in a snap, but don't wait until noon on a Sunday and expect not to have a 20-45 minute wait. I really think Eddie's is deserving of a 3.5, but I vow to give their bloody mary a try... depending on how that goes, I may up my rating to 4 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "_siniUb8CoN9of4mhAtj_g"
  },
  "tU1I5sBwyIY9ikF5kyCSOg": {
    "date": "9/3/2014",
    "text": "Let's be real. I visited Eddie's Place because it had a great name.  Eddie's also has awesome food. I got a breakfast sandwich with smoked sausage & cheddar cheese which was DIVINE.  You'll definitely want to get a side dish if you get the breakfast sandwich (I got grits) - but the food is really good portions. A breakfast sandwich + grits + OJ was the perfect meal for me.  Put it this way - I joined Yelp just so I could give this place a good review. You should go there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2uyYch19uiu9Cu5PUuzWeg"
  },
  "NEUGxGMQj9AO5B5nQ5itKg": {
    "date": "1/7/2016",
    "text": "Eddie's Place is my favorite neighborhood place. For breakfast I love the omelette. For dinner burger or red beans & rice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rITV0jp-ZUNuPnQDZF3iPw"
  },
  "bpjIEU4uYOm0GY-os5wccQ": {
    "date": "3/22/2011",
    "text": "I grew up eating at this restaurant, formerly known as \"Eddie's Place, Danny's Too\", ever since I was about 10 years old when I would take piano lessons next door. Even though I moved out of Charlotte a couple of years ago, whenever I come back home to visit my folks, I have to make a trip to Eddie's Place for a hotdog, pasta salad, gumbo, and fries.   Hot Dog - juicy & big. what more can you ask for?  Pasta Salad - tangy and garlicky. i've tried all sorts of pasta salads around the country, and even dining in Los Angeles or NY where the world's most renowned eating establishments are, I have not found a more perfect pasta salad than the one at Eddie's Place. Yes - it's THAT good.  Gumbo - this is a great cajun gumbo with a nice kick to it. the rice and the sausages are cooked to perfection, in addition to the soft and tender okra that soaks up all the flavor of the soup. must try!  Fries - I live on the West Coast now, and I still think about Eddie's Place fries from time to time. They are crisp, salted just right, and sprinkled with fresh black pepper. As a kid, my dad would let me get an order of fries after every piano lesson, and many times I couldn't wait until after my lesson so I would convince my dad to buy me some beforehand...  I hope this place stays in business for a very long time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wumKqYJlKLXYmZgN-aPxLA"
  },
  "T46bOF8FiAav-ZPnwkRSTQ": {
    "date": "1/19/2014",
    "text": "My wife and I have been to Eddie's Place a few times for breakfast and we have never been disappointed. Service is great and very friendly. The specials are a great way to really enjoy breakfast at Eddies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "aDCbB5idtF5zcqfsdFzLcw": {
    "date": "8/15/2014",
    "text": "Excellent.  Simply put. Fresh homemade everything. Staff is incredibly kind and efficient. Lunch menus are wide ranging with daily specials. Their wings are the best in town. Cobb salad is always crisp. Habanero ranch dressing is the best. Highly rwcommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VJVY746_3K4VZtL5dBk8zQ"
  },
  "pAOjWCVNjRZCm-AzvgJw6w": {
    "date": "9/29/2010",
    "text": "Came for a later breakfast last Saturday w/my sister and one of our nephews.  We had a very brief wait, no more than 5 minutes.  Our 6 y/o dining companion LOVED his kids menu featuring his favorite cartoon character, Spongebob.  He did a great job coloring it and was very excited to hang it up on the wall.  Our server was really nice, as was everyone else who approached the table.  Food came out really fast, which is always great when you've got kids with you.  I got a bacon, egg and cheese on a bagel and we all split a side order of pancakes.  Nephew got kids french toast and bacon, sister got same as me.  We enjoyed all of it, and the growing boy who had already eaten earlier in the day, cleaned his plate then started on the pancakes and claimed they were his favorite part of the meal as he scarfed them down.  Prices were great here and the menu looked like it had a lot of other things I'd be interested in trying.  Oh and the mimosas being served look delish!  Will def be back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Szle_N5FSs4Q7odfyd4P7Q"
  },
  "yx7E-3ZJZzKlR7FrCncCwQ": {
    "date": "7/8/2013",
    "text": "This place has been around for as long as I can remember....well, as long as I have been in Charlotte...15+ years.  Great breakfast food - which is served ALL DAY!  The staff is super friendly.  I have never had a bad server there.  I went in recently for the first time in a year or so and it looks like they have updated the interior.  Very nice!  They could use a few more big TVs.  But, a great little neighborhood bar with yummy breakfast food anytime!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKoECqqh4Q07gP_arEtMAw"
  },
  "z4eF3NHLIbjg5zP7h2cMaw": {
    "date": "3/15/2015",
    "text": "Ben the bartender is awesome! Chicken and waffle with honey butter is to die for. Best I've ever had. Everyone is so nice there and it really has a great Charlotte local vibe. Best hangover food around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sTuLTsr-U1VZnQzbddLSyA"
  },
  "iC1uY9KHEM-xeUX6FfFJmA": {
    "date": "4/19/2015",
    "text": "They got my order completely wrong. The food wasn't anything special. At the price you might be better off going to one of the larger chains.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XU3TUGl0gDKADlcj5zEw7w"
  },
  "l3yVrieE_Med-chLyOsQ9A": {
    "date": "5/30/2015",
    "text": "Ate at eddie's after a night of drinking after an intense biscuits and gravy craving. Quaint little place, plenty of parking, very friendly host and waitress. We ordered chicken fried steak, with eggs, biscuits and gravy. It was perfect, steak was seasoned and fried to perfection. Their white gravy is just right, and biscuits fluffy like they should be. Great food, and friendly staff. Can't go wrong.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IY0p4npjyYRogoY9H_OkAQ"
  },
  "Wva5cG2KkCWULUQJ-2--6A": {
    "date": "1/17/2010",
    "text": "Open on Sundays and serving breakfast every day of the week!  Full bar!  We went for brunch and the omelettes are great, bacon is crispy and my diet Pepsi remained filled.  The hashbrowns are the homefry style which I'm not really a fan of but next time I'll just get grits instead.  This is a family friendly place with regulars that have been coming here for years.  I'm happy to say I'll be coming back pretty regularly now too.    Plus Rebel Base Comics & Toys is right next door so I can kill two birds with one stone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "eIi5ueFjV_VYIBU6Kp6NOg": {
    "date": "4/14/2010",
    "text": "This place serves breakfast all day and great southern food.  I've been here a few times and gotten a steak sandwich marinated in coffee and brown sugar, a reueben and also french toast bignets.  All three were very tasty.   Good food, and good service.  I wish the TVs were a little bigger, they still have old school CRTs, but they have specials on beers every once in a while.  This week they are doing $1 PBR, $1.50 bud light/ miller lite.  Can't really go wrong with that. It's one of those great places where you know what you want, but at the same time, everything else still looks good so you have to kinda force yourself to stay with the first choice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pznDHVHsO1ZbsG7f4TaNRA"
  },
  "tlpeaYXtQJ8Fs8iFEtoX_Q": {
    "date": "1/5/2012",
    "text": "\"Oh look honey, it's a dinah!\" I mean, what do you give a diner in the realm of stars? A diner is a diner- a greasy spoon to be precise.  I love Eddie's because it's a diner: clink-clank goes the dishes with the occasional football game or jukebox run in the background and a bustlin atmosphere.   The soup is what's up.  There is always a special running and the slight shift in ambience as the day progresses makes it a coffee-to-bloody mary-to-beer kind of joint.  Pop in, pop out, be fed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "nealEwQh0T3Upjbo2j0qzQ"
  },
  "do1uK4-Ni4wUkMamGF2nnQ": {
    "date": "6/22/2016",
    "text": "Used to go there years ago and it was always good...but think it has even gotten better. Went the other day with my girlfriend sat at the bar and ordered the bartender was great. They forgot to put the ham on the ham and grilled cheese when we informed the bartender she went straight back to the kitchen. Thought she was going to take the cooks head off. The food was great and one of the best parts about I is you can order a half order of anything. 20 years ago I could have eaten full portions but they serve so much food it's hard for me to eat it all. The service it's great and another great thing is some off the long term staff they have you don't see that in many restaurants. They ask about your kids and friends I used to go in with.  Go ther for the food but the service is a big plus",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QhSXf1qEKxR8okeSTk5mqQ"
  },
  "2gkICsmO3IuapOj0KQBu_Q": {
    "date": "7/23/2015",
    "text": "I had chicken and waffles It was my first time trying it. I really liked it, the Belgian waffle was good with some sort of flavored butter it is served with. I really loved the coating on the chicken, I believe it was some sort of pecan crusted chicken and it was really yummy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iG_uVESJAcIJOP7R9-Zb2A"
  },
  "WVF9gt2TGUThtOFC_8BfAQ": {
    "date": "6/18/2016",
    "text": "Food was ok but we had to wait 35 minutes after ordering the breakfast specials to be served. Tables seated after us on each side of us were served ate and paid before we got our food When we asked about the wait we were told they were not too busy and had adequate staff and the wait wasn't that long. Won't be coming back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J59l8qvN1t_5MupVkCBlTw"
  },
  "Ez8DxhYe74lsWbJRZr0gdg": {
    "date": "2/4/2012",
    "text": "Amazing French Toast! Stopped in on a weekend trip to Charlotte due to positive Yelp! reviews, and it did not disappoint. They serve breakfast all day in this local spot and it was delicious. Everything that came out around us looked great. The hash browns were simple, but tasty, the bacon was quality and the french toast could have been the best I've had.  I overheard the bar tender talking about their lobster dinners that they do a few times a month, and I really wish we had time to come back and try it. I believe he said $22 for a recently live (They kill to order), Maine lobster with roasted potatoes and corn on the cob. We might have to plan our trip around that next time.   The decor is nothing special, but definitely feels local and cozy. The staff were very attentive and not overbearing and the meal came out very quick.   Definitely give it a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "pMNu2fVP62TgQED3LtBRCQ"
  },
  "r5AyjmGDLD8vSBH6xvr2pQ": {
    "date": "6/12/2016",
    "text": "I had breakfast with my little toddler. We ordered hash browns, French toast, and sausage. Everything hit the spot. This will become one of our regulars for a quick and easy breakfast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G9K-8ynikB7wa2EbysA1QA"
  },
  "vyWODUcb97WtFPrxxNIsaQ": {
    "date": "9/21/2014",
    "text": "Another tucked away breakfast spot in the suburbs of Charlotte.  We have been here a couple of times and their breakfast is yummy yummy.  I recommend making an omelet!  Or the eggs Benedict is really tasty.  Everything tastes very fresh, their waitstaff are very polite and prompt.  There is a long wait on the weekends unless you get their at the right time, timing is everything with breakfast in Charlotte it seems.  Pretty good prices, a bit higher than say IHOP or Cracker Barrel but it is a local business so I'd rather put my money their.  Try it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRqonwQma9vA6mifQG0ccg"
  },
  "oSNiXzM4SR70Cxmi_4k9dg": {
    "date": "2/22/2015",
    "text": "My sunny side up eggs came out picture perfect and the eggs Benedict was scrumptious!! Food came very quickly and the staff worked together well to make everything run smoothly",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2zOXDbwt-1cPOBA9kvKyfA"
  },
  "NXxNScLgYPB0UinfvwBlKQ": {
    "date": "2/14/2015",
    "text": "When my buddies come into town and want to hit a good burger joint, this is where I take em. It's a nice little place, and the food is excellent, they serve all types of things and all of them I hear are great. Everything I've tried has been top notch. I recommend the fried pickles and some type of burger. They have a good selection of beer too if you're into that kinda thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UJdV27tvroF63sIKvaKmTQ"
  },
  "K_btEkDs4Ib0tz1PjT9CKQ": {
    "date": "2/11/2015",
    "text": "If you want a classic neighborhood traditional breakfast with a Cajun twist, Eddies is the place to go.  If you don't want spicy and just want the basics, they have that also.   My favorite is the vegetarian omelette with feta and Cajun salsa.   I had a waiter recommended it over a month ago and I keep going back for it.   I love their biscuits but don't get them grilled.   Don't expect the fastest or best service in town but that's part of the experience also.  Enjoy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBWVFM1-pROdC9QEoU3hMQ"
  },
  "9vA66x_qWFuOtVY4iCU16Q": {
    "date": "7/10/2016",
    "text": "You'd never know by the outside that this the best brunch in Charlotte. The chicken and waffles are amazingly delicious, cheese grits needed salt but are fabulous. $5 mimosas and bloodies hit the spot. Not bad of a wait, definitely worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aG8pmLzTWYStAvMtaf1bcA"
  },
  "O-ujgFB3VkYBwdlEgh24jQ": {
    "date": "6/18/2012",
    "text": "Fell in love with Eddie's Place for breakfast. They have the best bacon, egg and cheese sandwich I have been able to find since moving from NYC. Also a huge fan of the fries here. Have I ever mentioned that I love eating fries with breakfast?   We decided to go for dinner one night when we couldn't think of anything else so we decided to give this place a try for dinner. What a good choice it was! First, it was $2 bottled beer night and there were some good choices! I went with the grilled chicken sandwich on cibatta and it was the best chicken sandwich I have had in a really long time. The husband had the chicken parm and also said that it was delicious.   The service is always good and for some reason we always end up seated at the same booth which I like- now I don't think I want to sit anywhere else. it's so nice to have a place like this near the house. This is def a great spot, especially for those nights when we can't agree on anything else!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-MSmR4gObTkdKiW-lp96A"
  },
  "BCox6aQufyXrP8wv5EU6Vg": {
    "date": "9/30/2009",
    "text": "I have eaten at both locations of Eddie's many times. The service is typically good (especially at the Cotswald location) and the food is generally very good. They have many great specials -often with sort of a low-country or New Orleans flair - and they do fish dishes really well. However, I am happy many times with just a bowl of the she-crab soup... it is fabulous!   They often have fish dishes as a daily or weekly special and these are usually served with a nice accompaniment of veggies and/or pilaf.   When you are in the mood for a good sandwich and french fries, they also have many options in this direction.  I used to love their breakfast anytime - but the last couple of times I chose b-fast, the  omelets were sort of bland.   The Ballantyne location is usually pretty crowded for breakfast/brunch on weekends, so expect a bit of a wait there. But, they have complimentary coffee while you wait so that helps!   Overall, its a good place to go for comfort food.  2011 UPDATE: The Ballantyne location is now closed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "ntrq_Cr8GgTx7JCt_sKiqA": {
    "date": "5/10/2015",
    "text": "Simply the best value, best food and best atmosphere ever!  I have been going to this restaurant for over 15 years, and it just seems to keep on improving.  The dinner specials are amazing -- where else can you find FRESH grilled fish with 2 vegetables and a salad for under $20.  Want an awesome omelette for dinner, or pancakes, no problem.  The staff is laid back yet really attentive to what's important.  Don't be surprised to see the same people there over and over again.....it is truly a community gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "si98aJ_kDAt0_f3rA8512w"
  },
  "UsekpacX9obWkEPHsXT6lQ": {
    "date": "3/31/2015",
    "text": "This is our neighborhood spot that we love and hold dear to our hearts.  We've become acquainted with many of the staff and other customer's that frequent the restaurant.  It's almost like like going to \"Cheers\" for us.  And hey - the food is awesome too!  The country friend breakfast is one of my favorites if you don't choose to go with one of their awesome weekend breakfast specials.  I also love the mushroom swiss burger and fries (you got to try the fries).  The gumbo and muffuletta (warmed) rock too!!  Only bad thing is there's sometimes a wait on the weekends for breakfast, but isn't that a good sign for a restaurant??? just sayin!  Enjoy!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FLFpCUb-q51JBfYf4owutw"
  },
  "vIj4DO3OZUcxaKATk--qow": {
    "date": "1/31/2017",
    "text": "In a few words, the food was worth the wait.  I came here for brunch this weekend.  It was a 20-25min wait around 10:00am.  They don't do call-aheads, so you just have to wait it out.  Our name was called...time to eat!  We sat down and were immediately greeted by our waiter.  We were in the very back of the restaurant at the end of the bar near the kitchen, where it was surprising quiet.  With Food Network playing in the back and people watching in the front, there was plenty of great views from that area.  There is nothing special or fancy about this place...just your standard restaurant decor.  Service was super slow, from getting coffee refills to actually getting our food.  They were busy, so I wasn't expecting service to fly.  The food finally came and it was pretty darn good.  I got a basic breakfast.  Scrambled eggs, ham, hashbrowns and a biscuit.  Everything tasted as you would expect.  We also got the country breakfast with fried chicken/gravy on top of a biscuit.  If I wasn't trying to watch my diet, I would literally order that meal every day.  Gravy: A+.  Fried Chicken: A.  Biscuit: A.  Mimosas and Bloody Mary's are $5 each and come in a wine glass and pint glass.  Tip: They won't seat you until your full party is there!  Also, the bar is first-come, first-serve in case the wait for a table is too long.  Overall, great brunch food.  I feel like I finally found my brunch fix in Charlotte.  I look forward to eating through the brunch menu because it just looked that good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wKMghGb_0aP3meeFJxt5nQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Nice basic breakfast of champions. Two eggs scrambled with lots of sides",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wKMghGb_0aP3meeFJxt5nQ/o.jpg"
      }
    ],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "GTUpjVQkW-j4cb289AOVhQ": {
    "date": "3/23/2018",
    "text": "My wife and I had a nice brunch.  I had the Rueben sandwich with the coleslaw and it was fantastic!  Nice waitress also very polite and very professional.  My wife had a breakfast with some delicious hash browns and a sweet tea.  Overall a very pleasant experience.  Come during the week.  It is very busy on the weekends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "K-du8AZLu47-rVpUXXrNEw"
  },
  "c36kxLI2cq7TzSMi8uyPCw": {
    "date": "8/2/2018",
    "text": "This place is fantastic!!! I went with my grandfather and fiance and they told us that there was a 25 minute wait, but a server caught us as we were walking outside and said there were 3 seats at the bar and we'd ordered in no time! The food came out quickly and was delicious, and the service was great. Will be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1g4I5ZgiJXzduiZxbuYa1w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1g4I5ZgiJXzduiZxbuYa1w/o.jpg"
      }
    ],
    "user_id": "AAsmGNR0T4nlzSbZ6HAnsQ"
  },
  "73Hml7U-ulrIIGp0XEvgAw": {
    "date": "4/8/2018",
    "text": "Went for Sunday morning breakfast.  Got the crab cake benedict special.  Honestly the crab cakes were just ok; had a little shell in it.  It was served on a biscuit, but I think I prefer an English Muffin.  The parmesan cheese grits were the best part of the meal . . . very rich & savory.  SERVICE (1 star): Regarding my waitress, once she brought out my food, she never checked on me again.  Didn't ask how the food was, didn't check on my drinks, etc.  When she returned my credit card slip to pay, she said \"Here you go.\"  I replied \"thank you\" and she didn't say anything else.  I've been in customer service industries my entire career.  I thought you thanked the CUSTOMER for their business . . . otherwise, you wouldn't have a job or any business.  Needless to say, disappointed with the service here!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Us89R9LDgSqF_riZRy4_w"
  },
  "BVRBGXXiNl4humqtW8MmBg": {
    "date": "7/22/2018",
    "text": "So we kept hearing how great this place is for brunch and I would say that I wasn't a fan. We ordered a couple mimosas, the French toast (which comes on Ciabatta bread), pancakes with a side of eggs, Turkey sausage, and hash browns (with cheese and jalapenos mixed in). The French toast and pancakes were nothing to write home about (Cracker barrel pancakes still hold the number one spot in my book, until another establishment shows up and out). The eggs, sausage, mimosas and hash browns were good/standard, again nothing special. They do have other items on their menu that I heard was good and I'd be willing to give this place another chance ONLY because of the customer service we received. Oh and I heard their waffles were good so yeah I'll be back to try other things, just wasn't impressed with the pancakes and waffles.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bxr4Zbse-F_ZP_O2KMJ9Pw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Just brunchin&amp;#39; around! $5 mimosas (mine with a splash of grenadine)",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bxr4Zbse-F_ZP_O2KMJ9Pw/o.jpg"
      }
    ],
    "user_id": "7DWlt0bmmZ9oj-jnrBCMvw"
  },
  "o9bLdjNXvkiv73hRGRP4YA": {
    "date": "4/19/2018",
    "text": "Great for a diner-type breakfast. I've never had anything but. Good coffee. Great pancakes. Nothing fancy. Consistent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pli7LcquUlzXGDnqIlZqYA"
  },
  "rBzJanotbtKEHEF5OGBHMw": {
    "date": "8/19/2017",
    "text": "I LOVED Eddie's. We happened upon here by accident on a Saturday morning and man were we glad about it. We showed up around 10:30 and waited for less than 10 minutes to be seated. They are very busy so you should expect some sort of a wait. They are a no-frills traditional breakfast joint. They don't even serve iced coffee! Which is fine, there are enough brunch places in CLT, sometimes old school is better.  I got a veggie omelet with hash browns and a side of pancakes, boyfriend got chicken and waffles. We were both very pleased but he was FLOORED by the chicken and waffles. It looked delicious even to me as a vegetarian. The cinnamon sugar butter was freaking unreal.  Eddie's definitely has a local neighborhood feel. The waitstaff is very friendly. I look forward to returning and trying more of the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "T8fSuI8CXWOYZfgfm4QshQ"
  },
  "Hoaff-Ib7HV9S1SgJUfJlA": {
    "date": "6/30/2018",
    "text": "If you are in Charlotte, you have to try this place. Nice place to hangout with friends. My favorite and recommend items - She crab soup, rib special Tuesday, Country fried breakfast, sea food platter, shrimp and grits (this one might be little heavy, but a worth try) Party with drinks and food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOt5FvAK-iOQAUGvueBr5Q"
  },
  "z-7cmHbq4MT4yg-u2I0UBA": {
    "date": "11/28/2018",
    "text": "Our new go-to breakfast place!  A little cramped, but super delicious!  Everything was hot and cooked perfectly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XjC2e2R78vr7SyU6yXg9rw"
  },
  "Jm-s2l2zCAMrvZoDqeKFlA": {
    "date": "4/21/2018",
    "text": "My son had the ciabatta french toast sticks and I had the chicken and waffles. The chicken is pecan crusted and the honey butter that come with it compliments it well...just a bit too sweet for me. But it was good. Loved the butter on th waffle...no syrup needed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qilsnzg-7MGfcKcffKkHAg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qilsnzg-7MGfcKcffKkHAg/o.jpg"
      },
      {
        "img_id": "eAflogbl3i6q-ZEr_hLFww",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eAflogbl3i6q-ZEr_hLFww/o.jpg"
      }
    ],
    "user_id": "cQtB7dSeM2oay3LzOjewgQ"
  },
  "119xd4J13p13HCAb6ASkZw": {
    "date": "5/27/2018",
    "text": "Food is as advertised, GOOD!!! Love the bacon, my girlfriend was enthralled by the \"She Crab Soup\" coming back for the Reuben.  The service was great and the nap I took afterwards was even greater!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NQ9kP4cjNpop_GMS4ZXpIQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NQ9kP4cjNpop_GMS4ZXpIQ/o.jpg"
      },
      {
        "img_id": "kuLi7cng1moKy8jdyn4NTQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/kuLi7cng1moKy8jdyn4NTQ/o.jpg"
      }
    ],
    "user_id": "4C91Ei7SWubppfBQ9OKQGQ"
  },
  "bOOnafz3SV-g1dlMuNOwAw": {
    "date": "11/3/2018",
    "text": "I love this place. Where else can you go and debate between chili dogs, country fried breakfast, or cajun pasta. Food always hits the spot, and the staff is insanely friendly and attentive, which is a dying breed with the new wave of restaurants. A True staple for me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qv_1PT9xVia7cqi7ZZc25g"
  },
  "hFmpQl030QUvxrxQYfrP1w": {
    "date": "6/19/2018",
    "text": "Pancakes and Syrup! Pancakes and Syrup!  This place is easy and laid back. Breakfast all day!! Great for the kiddies and bar foods pretty darn good. Beers and Cocktails are flowing nicely too. There's a good bit of TVs to catch most big games and events and there service is prompt. I do enjoy this local place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "80mdMttj6H0Wdd_1PfwDKA"
  },
  "2Sr3lJbfR3qrzLoe2YyE0Q": {
    "date": "9/8/2018",
    "text": "I don't know what it is about this place that just feels so right. I used to live in this neighborhood years ago and coming here for a late night snack or to go food... night cap just feels so right. Friendly staff, great staff actually and food is always what I want. Great place. Chill and honestly home away from home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "feTakdJt-j3vu6gWPDHt0w"
  },
  "e4FoJTuFTXxORxX6FG8Wlg": {
    "date": "2/22/2019",
    "text": "Food was on point and cost was reasonable. The service was beyond excellent. Our server (Waffle the Physicist) was so thoughtful and engaging! This may be my new after the game spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHFuFvxtvxSyUyk3WrTuiw"
  },
  "gadwFAo9zPzCg7Bl6CZHPA": {
    "date": "5/1/2016",
    "text": "Went here this Sunday morning around 9am.  I was stunned at how crowded this place was on a rainy, Sunday morning at 9am, but I guess this place has a loyal following in the area.    As you can see from my pics, I ordered the breakfast burrito.  It came with red beans and rice, salsa, and sour cream.  Because I was feeling a little hungry, I also got a side of hashbrowns and side of bacon.  To be honest, I didn't find any of the items I ordered to be anything special.  I'd say the bacon was good - crispy but not burnt.  Otherwise, I'd say the hashbrowns and breakfast burrito were just OK at best.  My issue with the breakfast burrito is that it was somewhat small, lacked seasoning, and the salsa def wasn't made in house.  Go to Toast for a better breakfast burrito.  The hashbrowns as I said, were just ok as well.  Its not that they were bad, I've just had waaay better at many other establishments.    The best part of my dining experience was the unbelievable and friendly service I received from the gentleman running the bar this morning.  He was quick and efficient, and got me in and out quickly given how crowded it was.  Although the food was just ok, I saw many other entrees being served that looked very appetizing - perhaps I just ordered the wrong thing.  I'd def like to go back and try a few other menu offerings such as the create-your-own omelet, steak and eggs or chicken and waffle.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "16aRB2IPUS6Bm0YaqBdkWw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Side of hashbrowns and side of bacon",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/16aRB2IPUS6Bm0YaqBdkWw/o.jpg"
      },
      {
        "img_id": "M-20Nkm1kGRtDT-RmovAew",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Breakfast burrito w/chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M-20Nkm1kGRtDT-RmovAew/o.jpg"
      },
      {
        "img_id": "Bkay-S0yQyZ89iSeMek7Bg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Breakfast burrito w/red beans and rice, salsa and sour cream",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Bkay-S0yQyZ89iSeMek7Bg/o.jpg"
      }
    ],
    "user_id": "R_wlZO-jKFGEVJnSfWISqQ"
  },
  "HEKePC_SUmWtwu93NkW8AQ": {
    "date": "10/9/2018",
    "text": "Stopped on my way to chorus rehearsal. From the outside it looked like a dive, so I didn't know what to expect. So I was more than pleasantly surprised when I got inside, and then even more by the food. I live 50 miles north, in Statesville, but will definitely stop in next time I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VxtB3kNnYxV1-HlAjwgudA"
  },
  "UygnjNFDCFrNEz9w_8lE0g": {
    "date": "12/23/2017",
    "text": "I am so confused! I attempted to make a to go order at 11:33pm and was told they don't do to go orders after 10pm. I am not sure how this business practice makes any sense. You have to cook the food if I eat it here or if I take it to go. If I eat it here and don't finish it, it will then be to go. I am just confused!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "ZqHYQMn2zwtZgMZYxygU-w"
  },
  "HGJ23zAc3ezZPKQ6PI1VPg": {
    "date": "5/1/2016",
    "text": "This is a nice little place for the locals to enjoy. I was seated as soon as I walked in the door. Our server (Chad) was very personable and attentive. As for the food.... It's love in the form of food! :-)   The Chicken and Waffles were wonderful and paired with some cheddar cheese grits, you're in for a food coma. The infamous \"Ciabatta\" French Toast was my poison. You can pick two or four, but trust me two is enough.  Did I mention, they serve breakfast ALL DAY! I encourage anyone that hasn't tried this place yet, to swing by and try it out... You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w-C44ZvGb7M6fg2iCvKl_Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Creole dish with Smoked Sausage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w-C44ZvGb7M6fg2iCvKl_Q/o.jpg"
      },
      {
        "img_id": "YRWQzr8hbx6EjjPtoxT4bA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Red Beans and Rice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YRWQzr8hbx6EjjPtoxT4bA/o.jpg"
      },
      {
        "img_id": "wLOupr2tOXCJQBY_nKmbCA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken and Waffles with side of Cheddar Cheese grits.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wLOupr2tOXCJQBY_nKmbCA/o.jpg"
      }
    ],
    "user_id": "cuHp8luhexZ8XP97885d8g"
  },
  "WZIsBRn0aV2JVKHJZyAOag": {
    "date": "3/10/2016",
    "text": "So this review is really on the food because our waitress was just ...awkward. But considering the guy that greeted us when we first sat down was so friendly and seemingly good at his job, I'm not going to downgrade this place for hiring an awkward but cute girl maybe less suitable for the gig than her predecessor.   Skipping straight to the food then...I was feeling soup and salad that day and my babe was craving breakfast food so this seemed like the perfect spot for the both of us to try. He got the chicken and waffles and I nabbed a bowl of the she crab soup everyone has been talking about and a side salad with ranch. As I think we can all agree the chicken and waffles were pretty dang delicious. The waffle had the perfect texture, the chicken delightfully crispy and the flavored butter on it was the perfect touch. The soup also proved to be a good choice. I tend to like a little more sherry flavor in my she crab but considering we are inland this was rather impressive tasting. The side salad was a little brown in places and was missing the spinach that the menu had promised but I cared a lot less about that once it was slathered in their scrumptious ranch.  Bookend this trip with another couple awkward encounters with our waitress to get our check paid and we STILL left the place satisfied.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "OWQrsPp0vrQdmkyRVP56fw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Bowl of she crab was great, bread was a bit of a throw-away though",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OWQrsPp0vrQdmkyRVP56fw/o.jpg"
      },
      {
        "img_id": "yms7K0TaWxrFvLrEst75sA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. House salad missing spinach and a touch brown but that ranch more than made up for it",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yms7K0TaWxrFvLrEst75sA/o.jpg"
      },
      {
        "img_id": "XRacl-TA_2h-gOCPiW-l3Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Bowl of She Crab and a house salad with ranch",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/XRacl-TA_2h-gOCPiW-l3Q/o.jpg"
      }
    ],
    "user_id": "Gs2sRbzk3mX-hgkDwlbK-g"
  },
  "LLURsdMMo2jeA73_JtQh5A": {
    "date": "4/6/2011",
    "text": "We were just stopping through and had the best lunch ever! The food was fresh (wifey had fried oysters).The server was accommodating that checked from which coast came the oysters and even had the cook fry just one to be sure she liked it. Also told us the best way we could travel with the she-crab soup (you must have this!) because we have to take some with us! Well done Eddie!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6hg_JwgIBM3vbQ4WYk3mBQ"
  },
  "3THMS07vP6yO58NISLfkDA": {
    "date": "8/27/2010",
    "text": "Great varieties of beer!! The staff makes you feel like a regular, even on your first visit! Unpretentious food that delivers on great flavors. With the prices affordable enough to visit frequently.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3mbVGWElG0MJyWUnO-Gk4g"
  },
  "lIgwLuXe0cVXIB1TTcfNtQ": {
    "date": "1/21/2013",
    "text": "After all the good reviews, I had high hopes for Eddie's Place. Most of the breakfast was ok. Nothing to write home about. If you like grits, I don't recommend ordering them. I was looking forward to them because it's something I only get when I go out to eat breakfast (which is rare). They were very watery. I took two bites and gave up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "XD47aiFeNtAB_al-9n7CKw": {
    "date": "10/7/2010",
    "text": "Breakfast is always good. Homefries lack. Friendly service and atmosphere.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9rwg40BvOrQqt-82OJfIGQ"
  },
  "LsQcuZn0ramfjU3fJirtyQ": {
    "date": "4/1/2008",
    "text": "I like this place, it kind of looks like a dive from the outside and inside but the food is really good. I like the Shrimp Boy and She Crab Soup. Their french fries are home made and delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5c2xCKHFj78I27dz0r9aQ"
  },
  "zOh28LKX7uQbaD9pOuQM8A": {
    "date": "12/3/2006",
    "text": "This place is good for every meal, plus they serve breakfast all day long.  The menu offers breakfast, sandwiches, and for dinner they have several different entrees.  The menu has a loose New Orleans theme (they sell muffalettas and poboys) that is decent, but I would def reccomend the poboys over the muff.  At night this place turns into a pretty cool bar.  Be careful when you go because the crowds can be crazy, especially for breakfast/brunch on the weekends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TQXtrSpsUyvHMriX8hvNWQ"
  },
  "DyFFAta2mdwU9q4bTDmonA": {
    "date": "4/5/2008",
    "text": "Eddie's Place  is a great place to grab a good breakfast, especially a Sunday Brunch.  The omelets here are really good and you have a lot of choices as far as what you want to go in them.  The chicken wings are also great, as are the hash browns...umm the has browns are really good.  I have to admit one of my favorite dishes here are the frog legs, similar to chicken wings but bigger, a little stringier, and way juicier, with a slightly different texture and a different bend to the drumsticks (you'll see what I mean), but the flavoring is superb.  Oh the Muffaletta's are very good here as well.  Check it out, Eddie's Place a  great place for Breakfast, Brunch and Lunch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrwyI3WLDjaBhtNqDXlwzQ"
  },
  "hz8LRKL2xaunX7boLQdaPw": {
    "date": "4/16/2011",
    "text": "Another entry in the best burger bracket in the Observer.  I stopped here on Saturday for lunch.  The restaurant was busy with several groups people waiting.  I managed to grab a spot at the bar.  Ben, the bartender was very friendly and took good care of me.  I order the burger which comes with one side.  I was going to get fries and then a side of onion rings.  Ben said they could do 1/2 fries & 1/2 onion rings as a side.  It took a long time to get my food, but the kitchen was doing a good job of keeping orders flowing.  When I got my burger the people sitting next to me at the bar said I should take a picture of it. It did look very good.  The burger is fresh not frozen and had the standard setup, lettuce, tomato, onions.  Ben let me know when I ordered that they could cook my burger any way I wanted.  I ordered medium rare and the burger was closer to rare, but that didn't matter.  it was juicy and tasty.  Both the fries and onion rings were fresh not frozen.  The onion rings were awesome.  At $11 for burger, frings (fries & onion rings) and a beer the price was right.  I'm definitely going to have to go there again as they have some nice breakfast items which they serve anytime.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "423UZPCxeDxzv0h_wkulvA"
  },
  "buDIMHaEYko_4W3w2lzxiA": {
    "date": "5/9/2007",
    "text": "This place is great.  It's a locally owned and opperated buisiness, which I love, and everything you order comes out better than you'd expect.  I love their breakfasts, but the she crab soup is worth ordering.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sMwyMgcorONU-VLwryw8rw"
  },
  "atOTJ2SH8pr8dIU__zzUKA": {
    "date": "3/8/2010",
    "text": "Recently went to Charlotte for a weekend shopping trip and was excited about the prospects of eating at some new places. Before heading out to the Ikea on Sunday we decided to find a breakfast/brunch place so we dialed up our Yelp. The reviews seemed pretty favorable for Eddie's Place so the sig-o and I decided to hit it up. We got there around noon and only had to wait about 15 minutes for a table. The place is pretty small and probably not that amenable to large groups. We were immediately escorted to a table near the front of the restaurant in a little nook with several booths and tables. It didn't take long after we were seated to realize that we were near the most raucous group of people outside of an Ozzfest concert. Although I am in my late 20s I immediately had a glimpse of what a 70 year old woman feels like while admonishing a group of teenagers. But I digress. The table was fully stocked for just about anything you needed for breakfast (jams, butter, creamers, syrup, hot sauce, ketchup). We ordered coffee which was just OK. I ordered the breakfast crepes which were stuffed with eggs and bacon and covered in a jalapeno cheese sauce. The bacon was very salty and I had to mask this with some syrup. The crepe itself was average. I have had much better crepes at a Vegas fast food joint. The hash browns with the crepes were also a bit overcooked. I also tasted the sig-o's french toast which was decent but nothing spectacular.  You really can't mess up french toast anyway unless you burn the hell out of it. The waitress was very attentive and friendly so service was definitely not an issue. Nothing during my experience here was terrible but nothing was extraordinary either. Really can't comment on their lunch/dinner menu but breakfast was very average. With so many other places to try in Charlotte I doubt I will be headed back here anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "r5K1LjRm6HDh-BS6gjUbkA"
  },
  "PzZQEdPL5-dLnzImpyoyyA": {
    "date": "8/11/2010",
    "text": "Greatfood in a casual setting. The only drawback would be the wait on a Sunday morning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zlac-kp_ZW3bUxZdHJTYMA"
  },
  "NtAobAfGOXr9k4lD5ODC6Q": {
    "date": "7/25/2007",
    "text": "Great breakfast place. Expect it to be busy on the weekends. I've had varying success with service. All of the food is good, no tremendous standouts but nothing subpar either. It has character which is something not a lot of places around Charlotte have so that's certainly a plus!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VnSDkHzvWQpu6P2ehqIU3A"
  },
  "WUIpz3X0SvRsF2-sQqPJ0g": {
    "date": "11/21/2016",
    "text": "It's a very long wait to get a table, especially on the weekend. You can find yourself waiting for over 30 minutes. The sitting is very tight and cramped. I ordered the steak (MW) and eggs scrambled. However, steak came out bloody and it took the server 10 minutes to circle back to our table to get me a new steak. I had a friend with me that had the same order issue, she however just ate her steak.  Service poor, food okay. Probably won't be going back in a while.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zvhqVkhs0kWDtufyP90sXw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zvhqVkhs0kWDtufyP90sXw/o.jpg"
      },
      {
        "img_id": "BA0VKhkCEb2Wkw1Dq-gbDQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BA0VKhkCEb2Wkw1Dq-gbDQ/o.jpg"
      }
    ],
    "user_id": "sVn_rNopTpPik0iL_Xm7ag"
  },
  "0qCikrT7qsF8Xg-p-XKwOA": {
    "date": "4/27/2015",
    "text": "As some others have said, where have I been? After reading some reviews I decided to head to Eddie's this past Saturday for breakfast.  I arrived shortly after 11:00 and there was a line outside, which is always a good sign. I put my name in at the door, but was told if I wanted to sit at the counter I could put my name in their too, depending on what comes available first.  The counter was packed, but only one person ahead of me.  Within 10 minutes a spot came availbale and and Ben called me over.   The counter reminded me like Cheers, all usuals and Ben remembers everyone. He provided me with a menu, took my drink order and brought me a water.  I chose the Bloody Mary which was great and I proceeded to enjoy two! As for the food I ordered a three egg omelett, which allows for unlimited options.  I chose ham, peppers, onions, mushrooms and swiss which a side of parmesan cheese grits, hash browns and a biscuit.  The omelett was huge, but mainly egg, not a lot of veggies inside.  The hash browns were awesome with a nice crisp top and soft in the middle. As for the biscuit, not your typical biscuit, but served fresh, hot and to my liking.  I enjoyed the company at the counter and the service, as I said Ben and the staff are on top of things, and will definitely be back. I also though the April specials looked great so I might have to check out their dinners too!  Make sure your plan for a wait or be willing to jump in at the counter if a seat of two opens up, which I thought was the way to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "YJ0WCNmoWs6ncVQuq0joKA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Three Egg Omelet, Parmesan Grits and a Biscuit!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YJ0WCNmoWs6ncVQuq0joKA/o.jpg"
      },
      {
        "img_id": "7ciX_b_4oDrwnpHO42GfAQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. April 2015 Specials Board",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7ciX_b_4oDrwnpHO42GfAQ/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "lX11j6lCa3xYD2nhw34EwQ": {
    "date": "11/26/2017",
    "text": "I've gone plenty times and I have not been disappointed once. I would recommend going early for brunch to avoid an at best 15-20min wait. The oysters are love. The burgers are amazing. The Chicken & Waffles and French toast are bananas! The menu overall is very well priced. Certainly a Charlotte trademark.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vXN4tckyhoU9nj_ONzssjQ"
  },
  "2AZ0Hr45W21wl4JBncietg": {
    "date": "6/21/2018",
    "text": "This is the go-to spot for my husband and I. Great salads and great breakfast! I don't really try too much other. I've had some delicious pasta once. And my best friend loves the chicken sandwich. I absolutely love this place. Friendly staff! Great service! Inexpensive. And you can order online!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7nnxymCSkQvuyIpJyl5tg"
  },
  "4Xp_SMruV-RvMnXNko_X6w": {
    "date": "7/1/2018",
    "text": "Eddie's has the perfect American breakfast. It's my favorite breakfast place in Charlotte, and there are so many menu items I wanna try. Unfortunately, I'm hooked on the chocolate chip pancakes (which I highly recommend) and so I haven't yet tried many other items! Definitely check out this place--it's simple, yet amazing, and try those pancakes!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KRrqqChh1sIUf_b2qv6sAQ"
  },
  "wDoTrkfeurRzxJvu51oGTA": {
    "date": "11/15/2017",
    "text": "Stumbled on this restaurant by accident, but returned multiple times because of the great food and service! The first night I had the Cajun Chicken and my friend had the Seafood Combination. On the first bite, all we could say was yum. We found out they had breakfast and returned for the Eggs Benedict and Bloody Mary. The cheese grits were phenomenal and the livermush, a southern favorite was nice and crispy. While we were there we chatted with the regulars and found out it was a neighborhood hang out. I think their neighborhood just got larger because I will have to go back many more times!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9uibIVQ20p2KSNpYjFvdpA"
  },
  "Bc0yYJGhVrTDsIoHo1ukUw": {
    "date": "8/8/2017",
    "text": "Have been here before, great food. Went there this morning and was told there was a 20 minute wait, 30 minutes in a realized people that got there less than 10 minutes ago were being seated. I went inside and asked where we were in line and they told me I was next. Then three groups were seated after this. I left after this.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2X8ObxPAb6MslyN8L8_EFw"
  },
  "Wf-WtmkV6Ag0uoDKd3g1Fw": {
    "date": "12/6/2012",
    "text": "\"Tom, you gotta go to Eddie's place!  OMG, Tom, it's awesome!\"  I heard this non stop from not only my sister, but from my mother.  \"We need to go soon, before there is an hour wait!!\"  OK!  Shit!!!    After our Black Friday shopping was done, we decided to go to Eddie's (as I would be leaving to go to Wilmington shortly after) for brunch.  It seems like everyone must have still been shopping, because when we got there, we were able to be seated immediately.    One thing I noticed- I was shocked at how this place is a bar and a breakfast place as well.  And it has been open for 15 years.  They must be doing something right (as you sometimes hear about a lot of places that go out of business due to the fact they have an identity crisis, and lose tons of $$$)!    They had a normal menu, and a special brunch menu.  I can't even remember what I had, except I do remember dousing hot sauce on some hash browns.  I know I posted photos- and I am sure you will be able to tell which one I ate (it's clearly the unhealthiest out of the 3 pics).    I remember the food being seasoned well and coming out fairly quickly, considering it started to get busier as the day progressed.  I was saddened though they did serve PEPSI (yuck).    This place is definitely a solid place for breakfast, and after seeing the prices on some of their beers, I would have to come back and see what that's all about!",
    "rating": 4,
    "rated": {
      "funny": 7,
      "useful": 6,
      "cool": 6
    },
    "photos": [],
    "user_id": "g8j2ci2FcvmocszcO6ypNw"
  },
  "eqjhF2kW8w9UkxkpVQxnCg": {
    "date": "10/11/2017",
    "text": "Went around 4:30 on a Saturday, was relatively busy but we were seated immediately. The decor was beautiful and fit the ambience of the place. The staff was friendly and spoke to us when we entered the establishment and left. Our waiter was amazing and had great recommendations for our taste. Can't wait to return to get another batch of the shrimp and grits! It was decadent!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d9JYRM34LBFOMeO0x2IiKg"
  },
  "b3TH31IxwEvAW7U9X3G1CA": {
    "date": "4/15/2016",
    "text": "I love this place, but the review is honest. If my peniis got better with time, so can you guy's menu.  ==== FOOD =====  SHE-CRAB  For me the food is only \"ok\" at best. I tried the \"she-crab\" soup everyone rants & raves about and is on the menu's \"Gotta try\" list. Eh...wasn't memorable to me. Was fishy & came across way too many shell fragments. I am a seafood lover. I married a blowfish, for-crying-out-loud. What guy wouldn't?  SHRIMP -N GRITS  You're killing me guys. This is a simple dish. This is down South. If you can't cook good grits, leave them alone. The 'plain old good grits' factor is completely missing from this dish. The shrimp.....ugghh. ..come on guys...sauteing shrimp is not complicated business. Lightly season, marinate 30 minutes, pat that shit completely dry and toss in a hot oiled pan. Five minutes later, magic  What the hell is that red greasy crap you put in my grits? Chorizo? You guys really pissed me off with this dish, that's super simple to cook. Yall need one white or black Southern person cooking the local dishes. We ain't gotta wash 'em though! Hoo ahhh!  MAC 'N CHEESE W/ BACON   Sounds appetizing as hell right? Nope they dicked this up too. Possibly the greatest American comfort food, just ruined. Is it edible? Yep and that's it.  RUEBEN SANDWICH W/PASTA SALAD  Um...freaking delicious. Not the best I've had. I'm not used to it being served on square loaf bread but hey, it was pretty on point and the pasta salad with cubed veggies in a sweet/sour base was the perfect compliment. Recommended by Jesse. Thank you very much.  WINGS  Fried crispy without having to ask. Sauces? Pretty decent. Can't go wrong with the wings. A bar favorite and mine.  DRESSINGS   OMG. THEIR HOMEMADE DRESSINGS ARE SPECTACULAR. The first time I tried the blue cheese I accidentally punched this old broad off her stool. Not poop but seat.  FRIED PICKLES  Grrrrr...they're chips not spears. Grrrrr...Everyone knows spears are better. I mean, have you seen Britany's boobs? Balloontastic.  BREAKFAST   Never had it. Have heard everyone there brag about it. I asked Jesse what'd they serve. He said, 'Oh, regular breakfast stuff.' Lol. I believe they serve breakfast all day.  ======= DRINKS  AND PEOPLE =======  Why I come here. Ask Jesse to recommend you something. You won't regret it. What? The freaking  bartender stupid. God I really dig the people here, the way the bar is laid out. Always love outside seating of course. Jesse's a good guy. If you don't sit at the bar, you'll miss why people become regulars here. I'm really gonna miss this place when I leave Charlotte. Dammit.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "zLHuyC2Gwpm8OwIKHKl6AA"
  },
  "WRXV16JIvgtV-J0igqAofg": {
    "date": "5/10/2016",
    "text": "My mom actually found this place, I don't think I would have even spotted Eddie's place from the road. We've been here a few times now and always enjoyed it. I've only had the breakfast and it's good. Nothing too fancy, but they have a lot of options, simple eggs and bacon and even more fancy daily specials. After seeing a few of these reviews, I think I need to go try the Ruben soon.  The only issues to point out are, this place gets really busy on the weekend mornings. It's busy and not the most relaxing place. With that aside, this is a great little spot, good food and kind, speedy service.  I don't know of a similar type of restaurant close by. Definitely give it a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7jev9oqE9jawRKXAb7Vq_g"
  },
  "lU2Yo-Vr2YkRw80r2jwRqg": {
    "date": "4/24/2018",
    "text": "This used to be one of my favorite hangouts but it's not the same Eddies Place anymore. Sad",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yigqXwTbItwCNDmVJWJogw"
  },
  "qREhDVjNow7rAlgS2ZA-AQ": {
    "date": "9/11/2016",
    "text": "I was told about this place and decided to check it out. Glad I did! With only a 15min wait for a table (I could've Sat at the bar for faster service) but I have a good book and wanted to stretch my legs. Anyhoo, the waffle with homemade cinnamon butter was awesome. My belly is swollen with yummy goodness! Eggs scrambled with cheddar cheese, bacon and a side of hash browns w/onion. Mmm mmm good! The service was fast and efficient and my good was hot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMHegQYtabf092wc3FOqXA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Waffle Breakfast with a side of hash browns!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gMHegQYtabf092wc3FOqXA/o.jpg"
      }
    ],
    "user_id": "scYZEU32MUrxr0CxMHaAJA"
  },
  "9hBq9UzbhvGTYU3rwlzYQg": {
    "date": "9/17/2016",
    "text": "Stopped here for breakfast around 9. There were 2 in our party and we were seated right away. The menu offers fairly simple breakfast items, but everything comes out quick and fresh. My eggs were cooked to order, the toast was of good quality. The home-fries were good, but could have stood more seasoning.   Overall, it's a very nice spot for a reasonable, well cooked breakfast. Friendly staff and warm atmosphere too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U7od9hL6P-Jm2zo5yO2EeA"
  },
  "sSiSuVxezvujzDf6KDADLw": {
    "date": "5/27/2017",
    "text": "I got the fluffy pancakes and hashbrowns and cheese grits as my two sides. It was okay - food arrived quickly and the service was good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IEpLv-OdPcFwJC5CGnVE9g"
  },
  "dFvkjYxUfMpd84F9o2L4NQ": {
    "date": "9/2/2017",
    "text": "We have come here twice now and every experience has been the same. Friendly staff, quick seating (15 to 20 at the most), good food and decent prices. They give you a wonderful neighborhood feel and their wait staff treats you like they know you. You can not ask for anything better.  We love this place and they are our new breakfast spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPq7N3Y2_-EGbl4JA8EylQ"
  },
  "RPp4Fp7FkJ44mBu7OjL5uQ": {
    "date": "5/27/2017",
    "text": "If you want a typical American breakfast, then this is the place for you! Everything tastes good in its most basic form. The reason why I gave it 4 stars is because I really enjoy trying different things. If you want something traditional then go here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ioToIUNvNHzFnBLMXpqyww"
  },
  "rJyI6ez07GMMamxI3ynHvw": {
    "date": "10/29/2017",
    "text": "The Prime Rib on Tuesdays is amazing.  High quality food in a casual environment.  Great menu with a touch of creole.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ee5na79yJ8epHC2IaWdcvA"
  },
  "40PkK9_NJ8m1nOuxZCmXxg": {
    "date": "6/21/2014",
    "text": "Apparently I've been living under a rock because I had NO IDEA Eddie's Place existed or that they have $1 per oz Prime Rib Tuesdays! With a minimum of 6 oz, you get green beans, mash potatoes a side of au jus and bread with your meal. I always get medium rare and the meat is so tender, flavorful and just melts right in. I mean honestly, where can you find such a delicious dinner for this price? If you're gonna have about 10oz or more, just get two 6oz dinners, that way you'll have double the sides!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "mgX7RiyezBMCTMIhNhUfaw"
  },
  "jm3eNdRL_aii2bNw9b2arA": {
    "date": "2/23/2017",
    "text": "Came in for a late lunch, not sure what to expect. Bartender (Jessie?) was awesome. Super friendly, with great knowledge of the menu and beer selection. Food came out relatively fast and the Muffalata sandwich was excellent.   Warning! The Muffalata is a MASSIVE sandwich. When given the option to get half or whole, get the half. I guarantee you wont even start the second half. But it is delicious, so dont be afraid to get it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8CBpwgwzcp-pIIyoFmygqA"
  },
  "FD04VghDEIRLsndu2WnhFw": {
    "date": "6/6/2017",
    "text": "6/6/17 Brought my daughter here after her graduation. The salmon special was excellent. My husband's steak was cooked as he wanted. My daughter's cajun pasta was delicious. The cup of clam chowder was on point. Our server was attentive the whole time. Everything was cooked very well. It has been a while since the food has come out with no issues.   9/26/16 I have a love-hate dining relationship with this place.   5 months ago Visited on a Saturday around noon for a late breakfast. Seems like there are new waitresses. Ours was a aloof and never asked to refill my coffee. That is a first. Service here is usually excellent. And no, it was not busy at all.  I ordered the steak and eggs. My daughter had the waffles. My son had a basic egg and bacon breakfast. Everything we usually order when we visit.   The steak was absolute rubber...throw in the slimy fat and it was just horrible. Country potatoes were like pebbles. Biscuit was dry. My daughter said the waffles tasted different...lacking that buttermilk fluff with slight crisp taste. My son barely ate his food just because he is difficult like that...but he always eats the bacon. Not this time.  He said it was too salty and soft. I tried a piece and it was.  We usually leave here very satisfied but this visit left me disappointed and hungry. New cooks? Lower quality of food? New management? Who knows!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "oOqSz9YU0mrSyacdmOnZ9g",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oOqSz9YU0mrSyacdmOnZ9g/o.jpg"
      },
      {
        "img_id": "3pqirdd4rOHGJd5gRYD9yw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3pqirdd4rOHGJd5gRYD9yw/o.jpg"
      },
      {
        "img_id": "KEge5zWRxDBjf011cZB9yw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/KEge5zWRxDBjf011cZB9yw/o.jpg"
      }
    ],
    "user_id": "eBoyunRiJb-QzwQbv1-1bw"
  },
  "EADn0djMtRAU9YBmmat_3g": {
    "date": "9/4/2018",
    "text": "Your basic breakfast in a fine but not breakfast-y atmosphere.  Good basic food.  The biscuit was light & fluffy.  The service was kind & helpful.  A solid breakfast choice in Cotswold area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wklmU8CM7czQQBuhOC4k9A"
  },
  "H6lBAKZCyPUWh9JARAOfRA": {
    "date": "4/17/2019",
    "text": "Haven't been in way too long. Gotta love the she crab and gouda mac n cheese.  Johnathon was a superb server...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IRYUi3LqOfWJFzoRTFl5UA"
  },
  "YsQFydX6uIV_EZHY3TLxZA": {
    "date": "3/23/2019",
    "text": "Ya can't beat this place for a great brunch, solid Bloody Marie's, excellent service and interesting menu. Weekend go to.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Se-kX_vbtFZQfAnRW6Bnyg"
  },
  "AkeqC1rM7buXVPphbZErGA": {
    "date": "7/20/2019",
    "text": "Woke up this morning (more noonish really) in hopes of getting a good breakfast nearby. My boyfriend and best friend were both ready to eat here. We were excited and hungry, considering she had been in the past and said the food was very good. We walk up and see people sitting outside, not surprised there was a wait on a Saturday morning. It was busy and very hot outside, but we put our name in at the front stand. There was a young man that stood beside an older bald one and they were taking names and giving wait times. The man was very short and rude as my boyfriend asked if we could give our phone number so we could wait in the car, the seats outside were full and everyone was sweating because it's 108 degrees. The guy is giving us attitude and acting like we're asking him to take off his right hand or something,  but he takes our number and says \"ok\". I didn't like the way he treated us considering we were first time customers, but the reason I was driven to write this review was because as were walking out the front door the man makes a smart ass very rude remark about my boyfriend and and soon as the door shut behind me, I decided we were not coming back. I work as a waitress and I know people are frustrating but if you want customers and a good reputation then clearly you have to learn good customer service and to bite your tongue, very disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qR07XqLCOXxoJNGE8fRkgA"
  },
  "SGS5QkCL8T6fUaJ_PbKDhA": {
    "date": "2/27/2017",
    "text": "3.5: I came to Eddie's this past Sunday for breakfast because I needed a break from my typical breakfast spots (Toast/Flying Biscuit). I saw a lot of Yelpers check Eddie's out so I thought I would give it a try.My husband and I arrived around 10am on Sunday and had a 25-30 minute wait. No biggie. Once we were seated we were greeted right away. I started with a water and coffee. Aside from their daily menu, they also had 3 breakfast specials for the day. I'm not sure if they rotate them weekly, but they did look good.  I decided to go with the breakfast burrito with chicken - $8.95. Instead of getting the rice and beans (which it comes with) I was able to substitute them for the hashbrowns and no additional uncharge. My husband got the chicken and waffles. Service was fast and they were continuously filling my coffee and water. Our food came out fast and hot. The breakfast burrito was good- served with salsa and sour cream, but the outside of the shell was pretty dry. I still throughly enjoyed it and the hashbrowns were yummy. My husband's chicken and waffles were very good, but we noticed the breading on the chicken fell off easily so it made it hard to eat.  Overall, we had a good experience and the prices were a good value ($7-$10 per plate). I would be back, but I would try an omelet next time. Their 3-egg omelets come with unlimited toppings, a side and a biscuit for only $8.95... pretty good deal in my eyes. The burrito was nothing to leave me wanting more....   I also noticed from browsing their dinner menu that they are Cajun inspired. I will have to come back for dinner and get the Cajun pasta! It sounded delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "3w3ys4wF0TsrC3K0LS0uvg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Breakfast burrito, $8.95. You can substitute the rice and beans for any side. I got the hashbrowns.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3w3ys4wF0TsrC3K0LS0uvg/o.jpg"
      }
    ],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "1TvllwxwZgO1jupMVeUbYA": {
    "date": "3/28/2019",
    "text": "Our favorite spot for weekend breakfast!! Everything is always great tasting and we love all the staff- they know my daughter and what she orders every week!! Dinner and lunch menu items are just as good- but I'm sorry it's always amazing when you can get breakfast all day long!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x358ytGIxpn0hmXwXsRV_g"
  },
  "IRRYLYmfMHbpFL3ZONyHnA": {
    "date": "3/14/2017",
    "text": "I found this place on Yelp reviews.  We are not at all familiar with the Charlotte area and we were looking for a non-chain breakfast place to meet up with our son who was driving up from South Carolina.  This place did not disappointment.  The food was delicious and had a flare that was different from your traditional diner breakfast fare.  For example, their french toast is prepared with Ciabatta bread as opposed to regular white bread.  One of my son's ordered the chicken and waffles and the portion was huge - in addition, you get to pick a side.  The portions were generous, the quality was delish and the price was reasonable.  Most important our server was attentive even though the place was busy with a line out the door.  Our food was served promptly and we didn't feel rushed to leave our table.  Will definitely use this as a regular meeting point in Charlotte.    PS. - if you are up late at night - they are open until 2pm and still serving a limited food menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "9vlmvHjTGuxpHQn1G8OzeQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Brunch specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9vlmvHjTGuxpHQn1G8OzeQ/o.jpg"
      }
    ],
    "user_id": "WtkIID_N-5DZv2AnsMJ2Hw"
  },
  "iN1fVto47U12qys3Fd6XEw": {
    "date": "6/16/2018",
    "text": "REVIEW SOLEY BASED ON PICK UP: You would have to pay me to eat here. Mediocre food. First of all, corn beef hash in a can taste 10xs better than what they serve. My \"old fashion hash browns\" had store bought cheap cheese on top, how do I know? Cause I can see the squares of the Kraft cheese (bet it's not even kraft brand), guess not so old fashioned. Nachos are a miss for sure. AGAIN STORE BOUGHT salsa, definitely Tostitos brand. Red bean was bland. Only good review was tomaria and lettuce on nachos were good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rq4udT-7qWEeIpzRe1XSSw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Tostitos salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rq4udT-7qWEeIpzRe1XSSw/o.jpg"
      },
      {
        "img_id": "TUTPHb5n8YsbpyGP6U_a5A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Store bought square cheese on top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TUTPHb5n8YsbpyGP6U_a5A/o.jpg"
      },
      {
        "img_id": "Juv7T4ikR5upqAMjpEmqnA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Juv7T4ikR5upqAMjpEmqnA/o.jpg"
      }
    ],
    "user_id": "KWXIVMbT-8UqS1_piND4Iw"
  },
  "sQD-WXVJoGvlcihhgcqLdw": {
    "date": "12/23/2016",
    "text": "I had a pretty standard breakfast and it was okay. Eggs, hash browns (fried potato cubes), ham and a lot of great rye toast. It's three stars because they were too busy for the amount of staff. Sitting at the bar and facing the kitchen, I saw quite a few plates sitting up there ready to go to tables for way too long. Including my own that was up for a good four minutes.  When they had time, the service was friendly and good but they needed at least one more person working the line this morning.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "nJsH_ku2tqS7C-81A_aXxQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Breakfast at Eddie&amp;#39;s Place",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nJsH_ku2tqS7C-81A_aXxQ/o.jpg"
      },
      {
        "img_id": "5NGIerhz53eXtWRQXh6MOA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Eddie&amp;#39;s Place in Charlotte NC",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5NGIerhz53eXtWRQXh6MOA/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "X26SUv0lnGRzDNE5jWZdoA": {
    "date": "8/10/2018",
    "text": "If not for Yelp I wouldn't have known about this cozy gem. We arrived 7:30 pm on a Friday night and you know what? With the music playing and the tables full, you could still have a conversation without yelling! The staff was pleasant and attentive coming by often to check on us. I ordered the breakfast burrito with chicken. For my side I had red beans & rice. The burrito was cheesy with crunchy veges and at a great temperature. Nom nom! The red beans sadly, had no flavor. I'm not one to re-season food but I had to this time. My husband had fried chicken and biscuits and he was smiling the entire time he ate them. We'll certainly go back a second time. The atmosphere is easy and there is no real reason to dress for this place. Casual nights for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qcTcULWgOB9LBWsQqVLWzA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Quite the welcoming bar!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qcTcULWgOB9LBWsQqVLWzA/o.jpg"
      },
      {
        "img_id": "U6gnjmxj-z9FsPeY8zw_1w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Try the breakfast burrito with chicken but getva different side than the beans &amp;amp; rice though.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/U6gnjmxj-z9FsPeY8zw_1w/o.jpg"
      },
      {
        "img_id": "EOliyUCYAID-i3PsjGPNlg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken and gravy biscuits are delish!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EOliyUCYAID-i3PsjGPNlg/o.jpg"
      }
    ],
    "user_id": "g-9-aR1KEWt0QyrxL5CYUA"
  },
  "afDLkKI7fPy2LjRIeXVFQg": {
    "date": "12/2/2018",
    "text": "Love this place. It's locally owned. The fries are hand cut. They may be my favorite thing on the menu but then I would be forgetting about the She Crap Soup which is totally the best in Charlotte. They have a great breakfast selection and really good burgers too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCzAnHHDMLZmeNPHAdiF4w"
  },
  "1xK_-0HcrgE04ZSF_4rrXw": {
    "date": "6/6/2018",
    "text": "I just drove like over 20 minutes to come here to find out they close at 10pm.  Like really this is probably the worst experience I probably could have had.  I'm probably not going to ever visit this place again based off this one experience.  I'm so glad that everyone else had a stellar experience and that's what I hoped to experience but that just wasn't in the cards.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h0TO1TaQfdaEwcHne4EGpA"
  },
  "l28M8Rvod6WF80XHAPseQA": {
    "date": "2/23/2018",
    "text": "The next stop on my Reuben adventure took me to Eddie's Place, somewhere I didn't even know existed until I found them on yelp searching for Reubens. The place was a decent spot and the service was good.   The Reuben was fairly average - standard ingredients well proportioned with a very good amount of tasty Swiss. But nothing else about the Reuben stood out - average corned beef, buttery rye bread, and sour kraut from a can (or bag). Which doesn't mean it's a bad reuben, just didn't stand out from the many others I've had around the city. Overall it was an enjoyable sandwich and I'd have no issue eating another, but it's not a place I'd plan a trip for specifically for a Reuben.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_Cpd3EoG7m7EERjKOicA7Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Fairly average Reuben from Eddie&amp;#39;s Place - no major complaints",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_Cpd3EoG7m7EERjKOicA7Q/o.jpg"
      }
    ],
    "user_id": "cEnN_26ZLSXtHIwVfiDMqg"
  },
  "K-5lR7gYktMwQUp2SxGfWg": {
    "date": "1/9/2017",
    "text": "Did a check in while I was there. But they def deserve a full review.   First time here. Absolutely loved it. I'm known for hardly eating my food. I always have to take a box to go. But not this time, I ate it all. It was a lunch portion but it was quite a bit of food. I got the chicken parm and it was so good. I also had their salad before my meal and that was good too.   Surprised I never saw this place or heard about it before. A fellow nurse brought me here on our way to South Park and I'm so glad she did.   The service was great and the restaurant decor was decent(causal dining). It was very cold inside(maybe because we were seated by the window) but other than that no complaints. The booth was pretty large.   Parked right out front. Food came out in about 15-20 minutes. Server came to check on us quite frequently until it was time to pay lol. He was very busy though. We went to the register to pay.   Def will go back. Next time I'll try something different. My friend got country fried something and grits I think. She wanted something else but they told her it was only served on special occasions or a certain day(not sure). However, she enjoyed what she ordered as well. Def would go back if I'm in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t18JcS-urv-iyflbaQaUAQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken parm was delish.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t18JcS-urv-iyflbaQaUAQ/o.jpg"
      },
      {
        "img_id": "Al0bxXBQNpPo4wfx9iSrTQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Menu.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Al0bxXBQNpPo4wfx9iSrTQ/o.jpg"
      }
    ],
    "user_id": "fxUh4h9t3xltCTinzrjqPw"
  },
  "3XhClnyxGIIFmGzfFuF6EA": {
    "date": "2/12/2019",
    "text": "Eddies is great for breakfast and very family friendly. We went tonight for prime rib night. I was surprised with how good their prime rib was for dinner. The horseradish sauce may be the best in town.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQibo71KA0Vi9F6zDmCHuA"
  },
  "xN50USwCOL6_dhq8WYMqXA": {
    "date": "2/9/2019",
    "text": "Solid diner-style establishment. Great food, affordable prices, and a wait staff that has their act together. Couldn't ask for anything else.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wt4-ZkAnkIp_ajNSXsjj0Q"
  },
  "MbdDhl1LxJxMp8GDcouJJg": {
    "date": "2/5/2019",
    "text": "I would describe the atmosphere was set up like a old timey sports bar (I guess). The service was great. My husband and I ordered breakfast which was ok if you don't care for flavor in your food. We noticed a lot seniors in the restaurant which might explain why there was no seasoning in the food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LFUdaM_5H9Hdn7wpSOhfxg"
  },
  "Kr4O7Piie9MxLrw37V-JpQ": {
    "date": "6/1/2018",
    "text": "This is simple. Very good food. Good service. And you have to have the She Crab soup. You must. It has to be one of the very best I've had anywhere. And I've had some over the years. And while I don't really like Ranch dressing theirs is the best. Questions?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0cI78odeq_GKqLzk8sIrw"
  },
  "Gcqcf7-6ToVPjQ-YWe5ahQ": {
    "date": "11/8/2018",
    "text": "When you go to a restaurant, both the food *and* the service have to be excellent for one to recommend it and go back again. *In the case of Eddie's Place, the food was good and the service was lousy. I love how they have heaters outside the restaurant for those cool mornings like today. If it's a nice enough day, you can sit outside. Limited choice menu, especially for breakfast. Lots of al a carte choices. Once I got seated, it took a long time for me to get my drink ordered. Big NoNo for most people. When he finally poured my first refill, he spilled coffee so that it got all over the cup and pooled around it ba I had to snag my server as he took the order of two people who were seated after me to get him to take my order. He said he thought I was waiting for someone, even though I didn't tell anyone that. He assumed and did not asked. Another Big NoNo. I had to snag him again to get refills on my coffee. He started clearing the table before I was even ready to go. Overall, I would recommend this place during the week when it's not busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qjc_IaApvcCtu0sZmv2CiA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/qjc_IaApvcCtu0sZmv2CiA/o.jpg"
      },
      {
        "img_id": "VopZricQ1NgGaAUx5kCcFg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/VopZricQ1NgGaAUx5kCcFg/o.jpg"
      },
      {
        "img_id": "QHKpw4h5qgUm_oD-ucg27Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QHKpw4h5qgUm_oD-ucg27Q/o.jpg"
      }
    ],
    "user_id": "sDyp3bQDV8kwMLjZnsCEBw"
  },
  "rmzyxh1Kl8epLCghYguI8Q": {
    "date": "5/8/2013",
    "text": "Alright, I know this place is a local legend. I want to give it a higher rating, I really do. But Eddie's place was a big \"meh\" in my book.  First of all, it's trying to accomplish wayyyyy to much. Is it a southern comfort place? A breakfast place? Eclectic American? Bar food? Deli? And why the shit are there potstickers on the menu?  As for the food, I ordered the shrimp and cheese grits, which were very good. Possibly the mildest grits I'd ever had. It came with a salad that was substantial and included bacon. So far, so good. Some friends ordered the she-crab soup, which was tasty, especially with a bit of sherry.  However, a friend ordered the potato skins, which were completely lacking for flavor. Couldn't taste cheese, potato, or even sour cream. Just grease and carbs. Another friend ordered the reuben. It did not look good: greasy, with far too little meat.  The service was friendly, but bumbling. First, the potato skins came out as potstickers. Strike one. Then they added $1.50 to my tab because I asked for spinach in my salad. Seriously? First of all, spinach is not that fucking expensive. And secondly, you couldn't even put that in the fucking menu? Or explain to me that it cost extra? I call bullshit. Bullshit x1000.  Prices were high for the food they were serving. Needed to be about 20% less.  The place loaded up with people as we finished our meal, so we got out of there quickly to make way for the next party. I wanted to shake some of them on the way out and shout, \"Why are you wasting your money here?! Go someplace where you can get consistent food with competent waitstaff!\"  So, I dunno. Not my cup of tea. Maybe if you can stand dumb servers and you can distinguish between what is good and what isn't on the menu, you'll have a better time.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DYt0HZUjMKkYgxBL7xUNSw"
  },
  "oft4FAZfLaV3GQHNreDK-g": {
    "date": "2/5/2016",
    "text": "Muffletta. I stopped by last night to do some shopping in the area and ordered the Muffletta with fries, it was sooo good! My waiter was insanely friendly and helpful and the peach cobbler for dessert was amazing! It's a great little spot, it was busy because it was a Friday night, but not overly so. My food came out quickly and fresh and hot. I will be coming back for more!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YhKG0jWCmTM5ZWd5C-Xm1w"
  },
  "-gvuX3E3WL2pZP6V0OYhnw": {
    "date": "1/25/2016",
    "text": "Fantastic red beans and rice and my wife loved the shrimp and grits. Great prices. Very reasonable and clean. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XIedlJ583jbGFNiF7BGaKg"
  },
  "oJSkFRXm1YkYCA74tRnb2w": {
    "date": "4/13/2011",
    "text": "Came by here after work for a few beers, stayed for more than a few and enjoyed fried pickles and onion rings for the first time...the fried pickles that is.  It is a very nice spot - on an Wednesday night, it was an older crowd but worked out great because I came to talk bizniz and it wasn't all crazy or nothing.  The bartender/waitress were friendly and checked on us a few times.  I hadn't been to a True local bar, so it was my first time in one in Charlotte.  Everything about it was quite nice without anything overly awesome nor anything near bad at all.  Had fried pickles for the first time, didn't think they were particularly awesome, but went well with beer.  The onion rings however were perfect - enough onion to know you're eating it and the fried portion was simply splendid.  It stayed on the ring, wasn't too soft or brittle.  Definitely will want to make it out here again sometime soon.  dmo out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oJBUXpkWLEQMwRWi4XQnxA"
  },
  "NA5AtuNtqBQyrZLhb9n7Zw": {
    "date": "12/28/2015",
    "text": "My son and I went there for a late breakfast the Wednesday before Christmas. The restaurant was crowded and bustling, but there were tables available. We were seated immediately, and a waiter was there to take our drink order within minutes. The eggs were over medium, as requested. The bacon was crispy, and the grilled biscuit was perfect. The staff is even attentive with refills on the coffee. As usual with Eddie's, it was a good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9S_waBHaCsr7e_YZJUmxPQ"
  },
  "yB7RTwFdDvmH1WypoT7DQA": {
    "date": "12/26/2015",
    "text": "Had a friend take me here for brunch and you can tell it's a neighborhood favorite, be prepared to wait! We managed to get a seat at the bar after about 5 min and had good service and I enjoy the 'cheers' feel to the place. I had an egg sandwich and mimosa for brunch. Food took forever! Not sure if just backed up or if that's usual. And brunch wasn't bad, but nothing above average. But I plan to go again to try other items on the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nC_DTTSNlt2CBbjktdxM_g"
  },
  "z-vsnuUJ5ZIexv4MjM7LuA": {
    "date": "1/31/2016",
    "text": "The food is always very good, but the restaurant itself is really in need of a re-do.  The kitchen/bar/bathroom areas are really dirty and the recent lighting changes are far too bright.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rRUhZvjg0cYM73WUELnRVw"
  },
  "e4ZItswhpOWRPiPsVNbYBA": {
    "date": "3/13/2015",
    "text": "I will suggest the parmesean cheese grits.. Its not.on the menu but it will BLOW YOUR MIND... as will everything else on the menu.. A Charlottean classic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O5Jtc_TdP8gSWAl0zRrJpw"
  },
  "sLKUNdDL6isLZTrxnEQ2YA": {
    "date": "8/27/2015",
    "text": "Very friendly staff and great service! The food was also good. I had the chicken and waffles and the chicken was pecan breaded which added something special to the dish. The biscuits were also a favorite. The only negative was the coffee wasn't very good and we are huge coffee people, so that was a little disappointing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dhXQerWPh0ywRH4GCgaQyQ"
  },
  "iFojCIQefoM0irleHBgQQg": {
    "date": "8/31/2014",
    "text": "After sitting outside waiting patiently for a half hour and watching a slew of people who arrived far after us get seated, we asked how much longer for our party of two.  The hostess was extremely rude and unapologetic about skipping over us.  We left without even eating.  I don't care how good your food is if you have service that bad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "hp1vqaxow0CrucyTAs-CpQ"
  },
  "IA0-D72AzLievHM6R2dN9w": {
    "date": "9/6/2012",
    "text": "Mid-morning get together.... Lunch was starting to be served but I wanted a breakfast.... No Problem.... Comfort food every day and they are glad to see you....nice place to be  PS the food is great too!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "VetUMePnhvAffjp_ykoIxQ"
  },
  "gnRSXsi_qQcLdTVd0-uW2w": {
    "date": "8/14/2012",
    "text": "Waking up on a Sunday morning with not a whole lot of nothing to do produces one result: late breakfast. Oh, what a joy it is to be starvacious in the morning hours and to fire up a Yelp search on the old iPhone and up pops Eddie's. A a breakfastular force to be reckoned with. Rumblin' tummies beware. Your hunger won't plague citizens for long!  It's a quaint spot on Sharon Amity with humble outdoor seating, bar seating, booths and tables inside. No cockamamie and kitschy decorations either. Just plain old diner fare.   Seated quickly. Every table was packed, but we managed to score a booth only after 10 minutes. Not too shabby.   The Southern Scramble is a deep-fried force of culinary nature. Two large chicken breasts, fried, atop crispy biscuits and a smattering salty, porky, and thick gravy. Throw in a handful of handcut fries and the morning just turned into a snooze fest. Such an incredible meal. I felt like I was hit with a tranq dart afterward. My wife had the french toast. Thick cut and packed with spices. Amazing.   You could say I'm a fan. I'll definitely be back for breakfast on weekend mornings that can only be spent at a booth, snarfing on a Southern Scramble. Viva Eddie's!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "qKdsFvvMkBkrHKWMIcuOZg": {
    "date": "11/10/2014",
    "text": "2e recently moved to Charlotte and were in the area. I trusted Yelp and it was just as great as the reviews were. We had breakfast. I had the Waffle Breakfast! What ever you do say Yes to the Apple Cinnamon Butter with it! It was so good. My bf had the steak and eggs! Steak was a tad bit dry but would try it again! Service was great and on top of things. Host even open the door for us on the way out. They also have a full bar. Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6elRmpafpKF0fq7_2mL3Sw"
  },
  "jqg1P8RD8U5PLwDXVKKkBA": {
    "date": "12/19/2015",
    "text": "Great food and great service. Jesse and Ben are two of the best servers/bartenders in Charlotte, they know the menu inside and out, are efficient, and have a pleasant demeanor. Ben always remembers my order even though I only visit once or twice a month. Sit at the bar for the best service. You know it's good service when there is a wait to sit at the bar for breakfast. Amazing cheese grits. A great place to go for breakfast but arrive early as there is always a wait on the weekends. Excellent prime rib special on Tuesdays as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bmw3NH--eOchz86bB_bwTA"
  },
  "JNuEi6Xl9QDrLocsvxkyLw": {
    "date": "12/3/2016",
    "text": "This place is delicious, but be prepared to be completely overlooked by the bartender if you're not a \"regular.\" Waited for 10 minutes to get a seat at the bar only to have the bartender seat someone he knew who had just walked up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TEC3NbGE_L7gubWoY5LUYA"
  },
  "YEbxhGpECw0Bnqt2pH6p8A": {
    "date": "6/21/2015",
    "text": "Great food.. Must try their weekly specials..  Grilled grouper dinner, ribs and beef stew have been my favs. Servers are sweet and charming. Nice chill out environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2pJ278LdrTwBRjIgKIJ-Vw"
  },
  "oq-wQ8kCn_xtwrYBNj5K9Q": {
    "date": "11/16/2014",
    "text": "Went here on a Sunday morning and parking is terrible. There were people waiting but turnover was quick. Selection was good but taste was mediocre maybe a bit more. Portions were good. I would eat here again in pinch but for a couple of dollars more Cafe Monte is a much better pick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ntl7I9ZPGpsFtII_MdF3Lw"
  },
  "xERJjN_hZrnGOyPaUR5wGw": {
    "date": "2/16/2014",
    "text": "We moved into the Cotswold neighborhood in 2000 and tried Eddie's Place soon after.  Over the years we continued to hear how many people enjoyed Eddie's as an independently-owned neighborhood restaurant.  We didn't go back until a few months ago and now we are semi-regulars for Sunday breakfast.   The restaurant hasn't changed much but our perception of Eddie's Place has.  As more and more shopping centers prefer to attract chain restaurants and stores it is good to know that there are independents still able to survive and thrive.  Their breakfast specials add variety to their regular menu.  Eddie's is a great asset to the community.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FPZtU6eI9EM_DK2RerytDA"
  },
  "WIP09wrZtrw6iYBNn7mOMQ": {
    "date": "9/16/2012",
    "text": "REALLY??  The brunch here is awful!  so basic that I can't even believe what they charge...  when you choose ham as your meat, you get 1/2 of a slice of ham??!??  JEEZE!!  I ordered scrambled eggs with cheese...  there was zero cheese in there so I got plain scrambled eggs, 1/2 piece of ham, dry toast and over ripe tomatoes for $9.00?    My friend had never been there before and was super pissed to get a $16 bill for the uber-salty country fried chicken with biscuits and sausage gravy.  He asked for extra gravy and was outraged when he found an additional charge for it on his bill.  I was actually embarrassed to have suggested Eddie's to him, and trust me...  I won't make that mistake again...  I simply won't be back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "8XHSW-zojUvIOne7E6pHrw": {
    "date": "5/1/2016",
    "text": "This is our go to place for brunch on the weekends. Food is always exceptional. Service is always a problem. Rude all the way around.... Such a shame that such a great atmosphere and such great food is paired with undesirable service. We try very hard to get past it but if management doesn't do something about this soon we will have to go elsewhere. Many of our friends feel the same way.....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "V3pjfi9nbVN4nURM4xzHVg"
  },
  "DSSte6CoutvJfFo3VdcjLg": {
    "date": "7/27/2014",
    "text": "For my first visit, this place was great!  I had the waffle breakfast and it was served with a honey-cinnamon butter that's made on site. Very delicious and affordable!  The service was fantastic and everyone was very friendly.  This place has become my new spot for breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "TL0OWhU118ON4Yby3IOELQ"
  },
  "NJmUmgaQog6EhTHqBB38Jw": {
    "date": "5/8/2016",
    "text": "Pulled Pork Hash was tasty with large biscuit. Others at our table got Chicken and Waffles-large portion, good chicken-and Ciabatta French Toast. Tried every dish and no-brainer favorite was the French Toast. Side of Parmesan Grits was unique and very good, but $3 for 2 slices of fatty bacon was not worth it and is my only gripe.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8Bxw0c2lSFkOCMPLxif3bw"
  },
  "ZYnXc_IJ1XolMJmJe4Wf1g": {
    "date": "8/1/2017",
    "text": "Came here for brunch with a few friends on a Saturday. They said the wait would be 45 mins to an hour. It ended up only being a half hour which was great. They seem to get people in and out pretty efficiently. Everyone I was with thoroughly enjoyed their meal from start to finish. I had a waffle with 2 eggs, and cheese grits and I loved it. 2 of my friends got the Country Breakfast and said it was the best breakfast they had in a long time. Will definitely frequent Eddie's from now on, even with a wait, the food is so worth it. Servers were all friendly and cleared plates throughout your meal since the tables can get a little bit crowded, but they were not overbearing to the point of it being annoying. Eddie's is my new go-to on weekends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NcVY07HOhJbDY6D-TA8UUQ"
  },
  "isATIoVnXDtiwGZNFdjJuw": {
    "date": "6/16/2015",
    "text": "Outstanding food and service.  Out server Jarrett was too notch.  My parents were in from IN and took great care of them.  Eddie's Place is there new favorite place to eat in Charlotte NC.  Nice work Guys!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7tjNTG_78_CXc07ucBq6Zw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Local Musician  &amp;amp; Radio Talk Show Host on WSUR &amp;#34;THE HIVE.&amp;#34;",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7tjNTG_78_CXc07ucBq6Zw/o.jpg"
      }
    ],
    "user_id": "vN22BZNcp5DX75MIOhbEFA"
  },
  "03VrLuDoq7SKzte05anmGg": {
    "date": "12/31/2015",
    "text": "Nice service.   We sat at the bar.   Drinks ordered and came immediately.  Food came out quick, gumbo is FANTASTIC. And they have \"not your fathers\" rootbeer.  Definitely a great stop for lunch.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "llQEqAXI3D2txHglBrsm-g"
  },
  "3nFK-SDonbrKoxcIboiphA": {
    "date": "4/13/2017",
    "text": "Tried the she crab soup, pot stickers and Cajun chicken pasta. Pot stickers were average, they were what they were which was fine. The pasta was average, the chicken that accompanied it was slightly above average, not a ton of flavor on the sauce. The she crab soup stole the show, def will return to try the much raved about breakfast and take 2 bowls of soup to go.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SFeRRbtkF3Z35-mE346p_g"
  },
  "WSLhDvIhNHw7D6H6rbj1lg": {
    "date": "9/13/2014",
    "text": "The food and service is great at Eddies Place!!! If you in the area this is a nice place to stop even if your on a budget.   I had the chicken and waffles with grits.  Everybody in my party had something different and loved their meals.  My server Kent was friendly and very helpful on the food choices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_9u8J7Az5Vl1iCQJ6qKibA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_9u8J7Az5Vl1iCQJ6qKibA/o.jpg"
      },
      {
        "img_id": "JIrigKi0LrMjOb9YDoG8mg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JIrigKi0LrMjOb9YDoG8mg/o.jpg"
      },
      {
        "img_id": "hca9UDkvnbUBs_mfsNayag",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. The food is very good and the cost was just as good!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hca9UDkvnbUBs_mfsNayag/o.jpg"
      }
    ],
    "user_id": "WP9uQp-M3iLc0DAh2b7I6g"
  },
  "F8pzEQwN7zjMfj0gQsU-_g": {
    "date": "5/15/2016",
    "text": "Great neighborhood spot. Been here for years. Good food and a friendly staff. Good place for breakfast or lunch. Always busy and food is fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gwecnmscaT388TahwQAWIQ"
  },
  "XSTZVzG0qrrWgylrPZGDlw": {
    "date": "5/22/2012",
    "text": "Been wanting to try this little spot for a while & we finally made it a few weeks ago.  Won't be the last visit, that's for sure!  It was lunch time & they weren't very crowded (especially considering the area), but that turned out to be no indication of what to expect as I first thought.   The atmosphere is cool n local, with tons of photos,  memorabilia from schools, local sports teams & the like on the walls, and multiple large screens, each playing something different (no sound though).  The waiters/waitresses all have a very laid back, go-with-the-flow vibe about them which is great (laid back, but not lackadaisical).    The food was spot on, plentiful and tickled the taste buds.  And breakfast is always available! I ordered the turkey burger w/fries.  Loved it.  At first I was turned off by the appearance of a mass-produced pre-formed patty, but was a convert at first bite. Yum!  Toppings were plentiful and condiments were offered on the side, which I always love (I'm the world's pickiest picky person & like to control the amounts of mayo & such).  The fries were my only sticking point, but weren't awful by any stretch.  Just a little too oily & thick for my taste. The other half ordered a make-your-own omelet w/grits and toast.  Mmm mmm.  Sausage was cooked well and very flavorful, cheese was just gooey enough but not too much so, and the grits were the perfect consistency.  All-in-all Eddie's is a great little spot for any meal.  I do think they're a tad pricier than they should be for what they offer, but not so much so it prevents me from going back on a whim.  I already have a running list of things to try next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UI-buhQ8XFapy6GF51PXzA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Exterior (obviously!) with &amp;#39;sunroom&amp;#39; area to the left.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UI-buhQ8XFapy6GF51PXzA/o.jpg"
      },
      {
        "img_id": "iE77jzFgjJxeKqY5hcESUQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Turkey burger.  Actual taste belies its just-average appearance.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/iE77jzFgjJxeKqY5hcESUQ/o.jpg"
      },
      {
        "img_id": "lMPU55eRycAyxDhG86VKrw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Make-your-own omelet w/grits &amp;amp; toast (breakfast avail anytime).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/lMPU55eRycAyxDhG86VKrw/o.jpg"
      }
    ],
    "user_id": "hI-HUA-vrbZjso7N3W42vg"
  },
  "4rSeHVrno8BKQQc17NQPVw": {
    "date": "8/6/2013",
    "text": "I'm a fan - YAY!    With a nearby doctor's appointment looming that I was killing time waiting on, I decided to stop at Eddie's Place for a quick lunch.  And a quick lunch it was.  The specials board over the bar let me know that Chili Cheese Dogs were the Monday special for August.  Yes, please.  And since I am going to the doctor next, I will only have one.  My waiter was super fast, though at 2:30 on a Monday, there really wasn't much of a crowd, but all of the tables that were seated seemed to be his.  He zipped my water to me and in no time, I had a lovely chili cheese dog with a side of pasta salad before me.    The dog, I believe, was boiled, which isn't my favorite way, I prefer a snappy dog with a char on it, but it was good, good flavor.  The bun was a standard dog bun, fresh and warmed.  The chili was nothing special, but it just had a good flavor to it, and instead of chunks of cheese on the top that the chili never seems to melt and I end up with shredded cheese down the front of my shirt, the cheese was melted under the chili.  There was no part of this hot dog that screamed YES, THIS IS THE BEST HOT DOG EVER, but everything about it worked.  I inhaled it, along with my pasta salad that was big pieces of penne (?) with olives, red onions and other finely chopped veggies in an italian dressing.  I battled ordering another one, luckily my server appeared seconds after I was done with my check.  Final damage - $5.36 for a delicious chili cheese dog and flavorful pasta salad.  Please, sir, may I have another.  YUM!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "t5oAG-zAnVXBQVkM_HDGdQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chili cheese dog with pasta salad.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/t5oAG-zAnVXBQVkM_HDGdQ/o.jpg"
      }
    ],
    "user_id": "zsZBYWYEmLLs81_f-HHM8w"
  },
  "ZCEclhZ5YjyPCuO0qAuA4g": {
    "date": "3/7/2017",
    "text": "Wait was a bit long for Sunday lunch (~30 minutes for 4 people) and they don't take call ahead, fyi. But once we were seated, the food was really good - no one disliked anything they got. As others have pointed out the Gouda Bacon Mac & Cheese is truly very \"watery\" (almost like soup consistency) but still tasty. And you can change things out or add or substitute pretty much anything, so that's great too. Shrimp & Grits were awesome, the Reuben was good but really greasy and needed more sauerkraut, the Breakfast Burrito was good, and the burger was just very average. We did have to flag down the hostess at one point to get some refills on water because our server was MIA for a little while during the meal. We were there for brunch, but they have weeknight dinner specials on the board over the bar, and a lot of them sounded really good. Bottom line, as long as you're not in a hurry this is a great little local gem, and we'll definitely be back to sample more items on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRfMtCMCzdJ28wzc6wJCcQ"
  },
  "EO16f5gZmJQkkIfedLe49Q": {
    "date": "11/4/2008",
    "text": "Eddie's Place is one of the few restaurants in Charlotte where you can find an early sit-down breakfast on Sundays.  The menu is average for breakfast, but sometimes you can catch an awesome special of the day.  My favorite has been the breakfast potato skins.  The eggs are on top of the tasty skins.  YUM!  The Cotswold Eddie's resembles a family-owned restaurant.  There's no theme and nothing chainish about it.  There are just tables and a counter with TVs.  In fact, it looks a little old or dated inside.    Sundays can usually get crazy there, so get there early (before the church crowd!) if you don't like waiting for a seat.  We've sat at the counter several times (to cut down waiting time) and gotten excellent service and quick drink refills, being so accessible to the servers there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IWjvkAtrqQTdZyQ0Sdll7Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IWjvkAtrqQTdZyQ0Sdll7Q/o.jpg"
      },
      {
        "img_id": "cNbaTr30uuiumvyNdkG8uA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/cNbaTr30uuiumvyNdkG8uA/o.jpg"
      },
      {
        "img_id": "ssBnGbYhzzbTAlQhZNrSqA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ssBnGbYhzzbTAlQhZNrSqA/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "7IufSx_mRN-3_i1lZPhHoA": {
    "date": "7/23/2013",
    "text": "I've been coming here for over 10 years. I have never had a disappointing meal or experience here.   She-crab soup, bacon cheese fries and their whole breakfast menu are what I find myself ordering the most.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PS4YPJLRQ4z5KUvNGC1UEg"
  },
  "cCerAtTbMc5MT454MQsISg": {
    "date": "4/9/2016",
    "text": "I don't often give 5 stars as I am pretty hard to please according to my family but this place deserves it. The she crab soup is excellent with lots of crab per soup full. The salads are huge and breakfast is great. I'll keep coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AF-0o3BwFSer4xVdD5dOIw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AF-0o3BwFSer4xVdD5dOIw/o.jpg"
      }
    ],
    "user_id": "y6_fthbJHzZekf-XKK8ZSg"
  },
  "T313dALCJF1KeMpaj06ptw": {
    "date": "2/6/2017",
    "text": "I had the pancakes, bacon and eggs. I didn't go too exotic but what I had was good. The bartender was excellent. It was very crowded. Not a bad place to stop into if you're in the area. It lacks a star because I wouldn't say it's anything super special.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V7xGYbkgpGT6GkLN2oAiYw"
  },
  "QHw26YbpaYqiiAScbhsT5g": {
    "date": "6/12/2014",
    "text": "Went for Breakfast and had the French Toast! Any place that flies the American  Flag is ok by me.  coffee good as well as service............early AM is great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Y7QivLeKXZ5URLcVQ00-w"
  },
  "Xy0N-812EcEflrgbXIB4gA": {
    "date": "4/27/2013",
    "text": "Love this place! First off, any place that serves breakfast all day every day is tops in my book. My fave breakfast dish is their french toast. The restaurant also does a great job on the hash browns. Eddie's serves a solid cup of coffee too. For late night, you can't beat their fried pickles. Next up, I want to try their eggs benedict.   I like that you can enjoy a good meal during the day and get a drink at night (or whenever!).  I often eat at Eddie's on weekday mornings after I've finished with an appointment. It's is a great place for locals. I feel more connected to the community each time I dine here. It's perfect for a short, casual meeting with one or two associates, to enjoy the company of a couple friends or family members, or to just catch a meal by yourself.  Service is excellent. Every time I go, I'm treated very well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yeBcdHTf7mYrCRsKiQNZ_A"
  },
  "j3VpAKx0DJPCX0U7sRkRtg": {
    "date": "9/10/2015",
    "text": "This is one of my wife and I's favorite spots for date night. The prime rib is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iqfl3EYKmfnKhZSVlxcMHg"
  },
  "2sXy-tv-9Isoo4C3tnDkoA": {
    "date": "1/22/2014",
    "text": "I have been going to Eddie's since 2006 when I was wondering what it was. Well I am glad I did. They have some of the best breakfast in Charlotte. I love most of the nightly specials they do. They get great desserts from a local bakery (forgot the name) I love how it is in a great location.  Parking can be kinda tricky with Leroy Fox next door though.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSb7Z66aPhixg6X3YuhM9g"
  },
  "3l0AEInLbvl-N1yH712Bnw": {
    "date": "10/30/2016",
    "text": "Finally made it in for breakfast at about 11 on a Sunday morning. We had to wait about 20 minutes and there was some confusion with our table but we were promptly served once seated. This is a quintessential family joint, nothing fancy but simple and traditional American food. This is not a fancy Sunday brunch place, but sometimes just a breakfast is exactly what you need. I enjoyed a three egg omelet with feta, mushrooms, peppers, and onions, with hash browns and toast on the side. I liked that there wasn't a limit to ingredients for the choose-your-own omelet. My husband ordered the breakfast burrito with beef. He was initially disappointed that it wasn't that big (clearly he is used to giant burritos) but was very satisfied at the end of the meal and had eaten plenty. We were both impressed with the hash browns, they were nice and crispy on top but soft and well cooked underneath. We enjoyed our meal and it was exactly what we were looking for.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "YRSSIUnkVPLxC3bqucIM2Q": {
    "date": "2/21/2019",
    "text": "A Cotswold classic! Eddie's place has a little bit of everything for everyone.  If you're looking for an amazing breakfast or brunch they have you covered.  Maybe lunch or dinner is your style, their classic menu will not disappoint.  Lastly, if you are a night owl. The bar is open till 2 AM as well!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "x8e1Cc1lh835Q1CpHAD0RQ"
  },
  "PnitavmRH2-nT7fSLalmPQ": {
    "date": "8/19/2018",
    "text": "Everyone raves about this place and I can see why!! Ended up here for brunch with the family one Sunday. I can't believe I've lived 5 minutes down the street for almost a year and never been here! Well I'm kicking myself now... but now and i know and I'll be back... SOON!  My experience here was a really good one!  There are always people waiting outside of this place so I assumed there would be some kind of wait and there was... 30-45 minutes and we were seated in 40. The hostess was very nice and when I went to check on the wait time around 30 minutes she wasn't rude and was happy to tell me that our large booth to sit 5 was opening as we spoke and they'd be getting it ready for us shorty. Sometimes hostess aren't very nice when you come back to ask \"how much longer\"... however, this was not the case. In addition, our waiter was very nice and attentive. He refilled drinks before we could even ask, he gave us time to look over the menu, but not to much so he could get our order in quickly. Overall the staff definitely deserved thier 5 star rating.  As far as the food, which was phenomenal, I decided to try an array of items and then of course my family let me try a few bites of thiers, as they know I love to YELP and share the love when the food is great (and this was the case)! I went with a Gravy Biscuit, the Smoked Gouda & Bacon Mac & Cheese and an egg over hard. I know very random, but I wanted a little taste of everything. The egg was good and you always get two thumbs up in my book when it comes out exactly how you order it, as that doesn't always happen. The Gravy Biscuit was something to write home about! It almost seemed like the biscuit was cooked and then browned on each side (maybe in the frying pan?), which gave it a crisp crunch in each bite. The sausage gravy was delicious... enough flavor without it being a KICK of spice... perfect amount and size of sausage throughout... and the best part is that it was thicker and not that sissy gravy with water consistency that makes the bottom of your biscuit soggy.  YUM! Finally for my meal was the Mac & Cheese... I decided to save this for last because I had a bite at the beginning and it was definitely the best item I had! Not only do I like to save the best things for last, but it was the best \"take home\" item that I had and I knew if I didn't finish it, I'd be just as happy eating it tomorrow as I did today! It was perfectly creamy, not too thick and not too runny. There were some extra spices/flavor that I couldn't put my finger on and it was AMAZING! I need to go back and  have it a time or two more before I make the \"this is one of my top 5 Macs\"... but I have a feeling it's already made it's way there!  The extra food items I got to try included, the waffle and fresh toast. The waffle was good. Unfortunately, I'm not a HUGE waffle fan and if I'm being honest, I'd rather just go down to the Waffle House. All in all though, it was just as it should taste and was golden brown with just the right bounce. Now the Ciabatta Fresh Toast... WOW! I think I'm still drooling over that. Golden to perfection, slightly crispy around the edges and soft and fluffy throughout. After I tried it, it made perfect sense why 3 of the 5 of us got it! I almost regretted my discussion in food and know what I'm getting next time I go back!  I'm not sure about the more \"lunch\" type food, but if it's any caliber close to the breakfast/brunch, I'm sure it's on point! Same with the drinks. It says a lot when I come to a restaurant and solely want to talk about the food, but this place was so good perfectly concocted drinks would just be extra icing on the cake! Not to mention the price is great!  If you're looking for a new brunch spot or just hungry for food... THIS IS YOUR PLACE! Try it out next time you're in the Cotswold area of town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YWZe0amKNxYn_GDizeKXrg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Smoked Gouda &amp;amp; Bacon Mac",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YWZe0amKNxYn_GDizeKXrg/o.jpg"
      }
    ],
    "user_id": "ZaTw1ebM8cbcWSQN6-ynew"
  },
  "zMJO4g2dZQAvnp8DV0_nWg": {
    "date": "2/28/2018",
    "text": "What a gem! I picked up my dry cleaning in this shopping center and I've heard of old friends talking about this place, but I called ahead and ordered a breakfast sandwich with turkey sausage, cheese, and egg on a biscuit and hash browns. They have those tasty shredded hash browns, too. This breakfast sandwich was huge, and it had two turkey sausage patties on it, I was very impressed.   The lady with the pink hair was very nice and helpful. I highly recommend this place if you're in the neighborhood for a quick bite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vWmU9O_N7pg60nehgO5aUw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vWmU9O_N7pg60nehgO5aUw/o.jpg"
      }
    ],
    "user_id": "I8flth7ZMjES03pgNRK3nA"
  },
  "Xfcp4O96vO0rLoxmoWFPWA": {
    "date": "6/20/2019",
    "text": "God this place is good. Hadn't had the breakfast here before. Perfect is the word I'm looking for. Cheese grits were mad cheesy, omelet was fluffy, and that toast is THICC!  I've had dinner and it is amazing as well- red beans and rice ftw!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "grmC0x7VX57-3eFXU4Xj1Q"
  },
  "dM_smd-2IaEU9L3DkrBUxQ": {
    "date": "7/5/2019",
    "text": "Went here on lunch with coworkers. Took so long for food to come out we didn't even get to eat, had to take it to go.   Shrimp and flounder po-boy was great though. The bread is amazing! I can eat it alone all day! Salad was very a bit sad looking. Gumbo was a tad too salty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cf7DaI1_9nChFW26ZUZbww"
  },
  "BlWkKqzIVpCXUEbd-hE2ZQ": {
    "date": "7/25/2018",
    "text": "I have always overlooked this place because it's not fancy on the outside and it's tucked away in the corner, but I will definitely be a repeat customer. I ordered lunch for pick up and they said 20 minutes, but it really only took 15. The place was packed when I went to pick up my food. It's a very casual place and cool inside.   I ordered the Cali turkey pita with pasta salad and my friend ordered a house salad with fried oysters and habanero ranch dressing. Both were full of toppings and goodies and both were filling. Great tasting too! I'd love to try other stuff on the menu and will be ordering here again. Forewarning: the parking lot is crazy because Leroy Fox shares the lot and they're both good places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1iMJ-j8utBDWNgpTfqBzA"
  },
  "2dRZo06GvxnBFsX80p-2bg": {
    "date": "7/4/2019",
    "text": "My husband and I came here after reading good reviews on yelp and we will definitely be back! The prices were reasonable and the mimosas were very tasty! My husband ordered French toast and I ordered an omelet. We loved both!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "67NTKY2q74WsLCtXPTrMgg"
  },
  "t3mCJuJr_tqXavik8dz6vQ": {
    "date": "2/22/2019",
    "text": "Nice cozy little place to come eat. I got the 3 egg omelet with all veggies, a biscuit and sliced tomatoes. The food lacked seasoning but I really enjoyed the atmosphere and the concept of drinking at a bar and ordering breakfast lol. Staff was nice and working together.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_qymWuWpf5jOvzMpCGNGkA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. 3 egg omelet with veggies, sliced tomatoes and biscuit.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_qymWuWpf5jOvzMpCGNGkA/o.jpg"
      },
      {
        "img_id": "OA9n_PNifycnT2eTlo-8UA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. 4 egg omelet with veggies, grits and biscuit.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OA9n_PNifycnT2eTlo-8UA/o.jpg"
      },
      {
        "img_id": "28ScsKAkDvLwaiomjf3-3w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Front of building",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/28ScsKAkDvLwaiomjf3-3w/o.jpg"
      }
    ],
    "user_id": "GAWvdxEH2PgSiTYoyIj2Gg"
  },
  "d0uRsYoPhlkKB0CT9LF_wg": {
    "date": "2/7/2018",
    "text": "Eddie's place is a great example of no-frills, good cooking here in Charlotte. On the weekends you can expect a wait, but it moves quickly and you'll be happy you waited.   On this trip, I finally decided to try their she crab soup that everyone raves about. This, for me, was good, but at the same time, with every bite I was fishing out a shell. This isn't my first time with crab, and I know their shells can be difficult to find and peel, but I honestly just wasn't expecting to have to dig out a chunk of shell or two with every bite. As my mother would say, at least you know it's real crab, but at $6 a cup, I wanted to enjoy it rather than work for it.   I also got the Ruben sandwich, which was very tasty. It was traditional Ruben with the fixings, and the balance in each bite was delicious. I went with the veggies as my side, and they were a miss. Way too big of cuts, and had a freezer bag taste to them. My husband always gets their muffelata, and that is a large sandwich (you only need the half) and it's very tasty! Their olive spread they put on their might be the best salty/sour/olive bite you can have.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "1jDB02rnDYezFp2uyVK6VQ": {
    "date": "1/17/2018",
    "text": "My husband and I came here for brunch on abuts Saturday. We waited thirty minutes to be seated but were happy to stand under the electric heartens outdoors prior to being seated inside.   I ordered a mimosa because my husband had and his was mostly champagne with a splash of orange juice. I was a little saddened to see that mine had a more generous pour of orange juice, but I'm guessing a different bartender may have made my drink.   I had a bowl of the she-crab soup for the first time and wow!! So delicious, rich and creamy. I want more just thinking about it. I also ordered a make your own three egg omelette but was disappointed because I paid an upcharge to have avocado in it and it was served on top and had browned. I know how quickly avocado can brown, however paying $2 for a few slices I expect it to be in prime shape.   The omelette was fine and the bacon was alright too. A little undercooked maybe and maybe a bit more salty than usual, but served quickly and generous portions which tasted good.   My husband ordered the fried chicken and biscuits with sausage gravy. He devoured the whole meal and said it was excellent. I tried a bite and thought the chicken was cooked perfectly.   We will definitely be back! One star off for avocado omelette issues. Hopefully we go at a non-peak time for our next visit and these flaws will be fixed.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jBQTKfIsSsJNc7i6p7beeQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. A bowl of Eddie &amp;#39;s She Crab Soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jBQTKfIsSsJNc7i6p7beeQ/o.jpg"
      }
    ],
    "user_id": "_NpSl8OWMrQH45mfqia9zQ"
  },
  "fqGLKCHYGPnKZ57_XZ3CeA": {
    "date": "6/10/2019",
    "text": "My family and I tried this place for lunch. There was a small wait, which was totally worth it! I had the fried flounder po boy, my husband had the cheeseburger, and my son had the fried shrimp and everything was delicious! The wait staff was friendly and worked together to keep the customers happy. Next time we visit Charlotte we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QsQmxI0HHf62hDfCiKY60w"
  },
  "f2TIaj9tf6ERlfCO5_3m2g": {
    "date": "11/5/2018",
    "text": "Eddies Place is a great go to place for dinner or lunch or Breakfast all day ! This is my second visit there and I was very pleased with everything I had! Started out with the She Crab Soup! Nice and had a lot of crab in it ! Then the Chicken Wings, spicy and good ! Then I ordered a Hot Muffuletta Sandwich ! It was great, stuffed with meats and wonderful olive tapenade ! But the absolute star of the whole evening were the Hashbrowns.  Possibly the best I have had in years !! Crispy and delicious ! I am dreaming about a double order next time ! Service was very good and friendly also !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "n2VXy4jAsHsNji7EbbEYbA": {
    "date": "12/16/2018",
    "text": "This local joint is the best and closest thing one can find as a local diner in Charlotte. The food is quickly served, the value is good, and the service is friendly. Don't expect anything gourmet, but the food is still tasty. I mostly go on the weekends for brunch - $5 bloody mary's and $3? Mimosas. Be prepared to wait on the weekends, but turnover is fast and you can get a beverage at the bar while waiting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "aCM50CfNxOOref4PAe-eYw": {
    "date": "4/12/2019",
    "text": "The best she crab soup in town. The bread they serve with it and the sherry alongside is just amazing. The oyster po boy and Parmesan cheese grits are also tasty. Haven't had a bad experience here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yz3ISCd-S51-sc2fmcKISg"
  },
  "o5CvtudFm3r13H8n0JbKkw": {
    "date": "7/30/2019",
    "text": "Chicken and waffles are amazing! We also loved the cheesy grits. We definitely want to go back and try their dinner items!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UTdfjRPgaFd9h5oe8BHi2g"
  },
  "EiugtcOnrQadZCUl2oGq0Q": {
    "date": "4/18/2018",
    "text": "I absolutely LOVE this place!! It's very \"Home\" feeling as the servers are all casual and seem to care how you're actually doing. There's ways a line out of the door, but they seem to cycle people in and out fast enough where you don't feel like you're waiting for an eternity. My favorite is the chicken and waffles with a side item choice of Parmesan grits. Omg! I didn't grow up eating grits but these are savory, creamy and pack a great cheesy flavor. The boneless pecan fried chicken breast pairs so well with the warm waffle and honey cinnamon butter. Go and get yours!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YkM29GuJQk_eN9CHfL542A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YkM29GuJQk_eN9CHfL542A/o.jpg"
      }
    ],
    "user_id": "ma1F-ZhIkbtfZUAstcGsqQ"
  },
  "vbpuf3E7epeXxRHK6oKLXA": {
    "date": "3/29/2019",
    "text": "Wasn't as good as it was last Friday (under seasoned steak, would it kill you to salt and pepper a steak)but service is really good. Mac n cheese very disappointing. All you can taste is buttery noodles even though it is very cheesy and bacony lol. It's ok at least my dogs love mac n cheese.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qL08VKlLuTStr_z4kSJx1Q"
  },
  "PgNdMcxfrs1o8QLszyR7cw": {
    "date": "10/8/2017",
    "text": "Came on a Sunday around 3pm and there was no wait and very few people inside. For starters, we got the fried pickles which were the BEST fried pickles I have ever had. Honestly, I would go back just to get fried pickles and going to this restaurant is quite the drive for me. It was the perfect amount of crispy and the ranch was amazing!!   I got the chicken and waffles as the main dish with hash browns. The portions were huge and the butter was the best part! The hash browns were a little too crispy for me but the chicken and waffles were good! The chicken could have been seasoned a little more but I'm still a fan! I would definitely go back because I heard the grits were really good and of course for the pickles.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "6k-E3w3D4HDciPmDtL1Z9w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Game changer. Can I give a 5 star review just for the pickles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6k-E3w3D4HDciPmDtL1Z9w/o.jpg"
      }
    ],
    "user_id": "wSDw2p_pxCCWjpJ7yya36w"
  },
  "iV7KbQxOyK1m5irqH5WRVg": {
    "date": "4/2/2018",
    "text": "Classic diner staples done very well, presented in a locals-only vibe.   You won't find many weekend-trippers here. Somewhat off the beaten path, Eddie's is tucked away in a quaint, obscure strip mall/shopping complex in one of the nicest areas of CLT. It will be filled with great patrons that equally match the greatness of the staff. They want you to know that their only interest is serving up damn good food, that's both familiar and comfortable, in a laid back environment. This is your classic neighborhood grill.  You will find a lot of familiar things on the menu that are done really well. Their breakfast items are excellent. Everything taste as if it's been cooked the same way for 30+ years. You will notice that 90% of the photos for this place are their signature pecan-crusted chicken and waffles and that's not by accident. You're gonna want to try it. I recently got their version of a breakfast hash with a Southern emphasis (chopped potatoes with peppers and onions sauteed in garlic butter, with sausage gravy, fried chicken, topped with two eggs and a biscuit).   Make sure to bring your appetite because you will absolutely need it. Eddie's is no frills, but there is a simple-elegance with their food that you will appreciate. One final note on the food...do yourself a favor and get the gouda and bacon mac n' cheese.  Service and pricing: Eddie's is no stranger to great service, having been in the business for many years. Their pricing reflects this as well. They have dialed it in enough to offer awesome price-to-portion ratios, which includes alcohol as well ($3 OMB Copper for starters). The service was fast and friendly, with average wait time for food arrival. Two very well proportioned meals, two mimosas, one beer, and a side of their gouda bacon mac n' cheese was $30...I call that a win.   Just like any other place, I'm sure they lack in some areas and have their \"off\" days, but I have yet to see any shortcomings. If you're looking for a very solid brunch spot or just a casual spot for a really good sandwich, definitely give Eddie's Place a shot. For right now, I'm going with a True 4.25/5.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "0KGCdp9W8jz9KJRsABb66g"
  },
  "17Q5U2sAn8viiFaW9XIDqQ": {
    "date": "9/26/2017",
    "text": "This is a casual, classic charlotte restaurant that is consistently good!  They have breakfast all day, awesome specials during the week (umm prime rib Tuesdays), and salads that are so tasty and pretty that you actually want to finish the whole thing.  The dressings are homemade which is an added bonus.  My go-to is the Cobb salad.  Brunch here is really popular so expect to wait, but I promise ya it's worth it!  You can always get a drink at the bar while waiting.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bK7vrwvteocRPOP45phqXw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Cobb salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bK7vrwvteocRPOP45phqXw/o.jpg"
      },
      {
        "img_id": "NIH4jMDEHlKAsDflZrmE6A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Prime rib special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/NIH4jMDEHlKAsDflZrmE6A/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "Ci04WlMYvMJGxmHMrYtj3w": {
    "date": "8/24/2016",
    "text": "I regret not coming inn here sooner. I frequent the gallery next door. The food was amazing (especially the chicken & waffles) and the service was also. I'm excited to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g2prozZ3UHPGZ18MYFF1Fg"
  },
  "r6CMUOiJ8YQH85cUtgkx7g": {
    "date": "1/21/2017",
    "text": "It's a Charlotte favorite but it does have its problems, the staff can really be moody, got our food at quarter till closing,it was so so but what got us, is they guit servicing alcohol right at closing, we still had food, we were confused considered some of the staff set down to have a beer, so the bar tender was still serving but not to paying customers, so don't go to late",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z8sNz_pHjV1opvI9H1tfQQ"
  },
  "BsiWaZDmGZ6w1I0EqZXC2Q": {
    "date": "9/30/2014",
    "text": "I haven't dined in yet, but I ordered the She Crab Soup to go. I love She Crab so when I had a taste for it I did EXTENSIVE research on where I should go.  I googled and yelped \"best She Crab soup charlotte, NC\" and finally came to a series of reviews for Eddie's Place. Needless to say, I was sold. I ordered TWO bowls to go and drove 20 minutes to get them.  It is by far some of the best I have had in NC! (SC has some great ones of course) it was creamy with nice-sized chunks of crab meat and without a super fishy smell. Well worth the price and drive!  Side note: the staff was very welcoming and friendly!  You're welcome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4jnXdfbF6P8bq-fQJJzug"
  },
  "lhRS875b3_ELqHE_kvDVUw": {
    "date": "8/6/2014",
    "text": "I wish we could remember what we ordered. I just remember the food was delicious.   The reason why I can't remember anything is because there was a cockroach on the wall and when we pointed it out to our waiter he lied to us (trying to make us feel better probably) saying it was a june bug. At that moment it flew at all our heads and we all squealed. The waiter had the bus boy kill it.   Kinda ruined our first visit. But again, food was good. Not sure if we'll be back; esp. since the husband detests cockroaches. =",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "et4Xxm1W93ta5dv2e2KFwQ"
  },
  "5gWSCbhPdPMReQsCs0Tulw": {
    "date": "12/13/2016",
    "text": "The country friend breakfast is borderline the best breakfast I've ever had..the eggs Benedict is a close second, you will leave full and happy! Service is always amazing, the place is always pretty busy so I try to go on slower days. However? I must say it's worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlNYVs-nepmxCML0dknUMQ"
  },
  "iIMzntoNtHfqGMNksgEfsQ": {
    "date": "7/23/2013",
    "text": "Fabulous! That's all I can say, even for the one-time I've been to this restaurant. My sister insisted I go, knowing I'm a fan of BBQ, for the baby back rib special on Fridays. I was not disappointed. The ribs were perfectly, fall-off-the-bone, tender. The sauce was sweet with a little heat.   The kicker was the shrimp and grits! I entered not knowing what kind of restaurant it was, but when I learned about the all-day breakfast, I was torn between the ribs and shrimp and grits. My loving wife ordered the latter and gave me a taste. They were fantastic! Savory, tender shrimp, ham, just a flavor bonanza!  I cannot over-recommend this place! Definitely going here next time I'm back in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zgvRUxnIBwJhEDE19AHagw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. A full rack of baby back ribs w/ a side of grits. Dee-lish!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zgvRUxnIBwJhEDE19AHagw/o.jpg"
      }
    ],
    "user_id": "k7pZgkfv2Fc-YwmsSGcEaQ"
  },
  "EBLwFl_J6i4091AFXib9yg": {
    "date": "12/6/2016",
    "text": "The worst prime rib I have ever had in my life. It was sent back twice still was raw. I usually never write any reviews ever although this is a public service message Don't eat the prime rib..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dWVahYC4jGiX-4eXXIg3jw"
  },
  "sBcoSHn182umuUV45m6jeQ": {
    "date": "8/15/2016",
    "text": "Just wish this place was bigger. The food is great, love the staff and the shecrab soup is a must.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxcN4e5SKNhZ4wfEUbAMRA"
  },
  "l7KOFqQDcT805RECBWNwpQ": {
    "date": "4/22/2016",
    "text": "Ok. Checked out a new church and now tried a new place to eat. Wasn't impressed. First, coffee wasn't as bad as other places, but I Still can't find a cup that doesn't taste like piss water. Waitress very nice. Place crowded. It was very cute and cozy, figured the food would be outta this world. Nope. Here's my problem. I ordered the special of Shrimp and grits with Tasso gravy. I asked what Tasso was and was told its like a spicy ham. Ok. I like a little spice. This shit was hawt!! !!  I should've been told that!! I almost Sent it back but I didn't feel like being an asshole after church, so I ate it. It's strange to say, but there was too much  shrimp and I felt bad it went to waste. There wasn't nearly enough cheese grits, which were delicious, btw. The shrimp were nicely fried in what I think was cornmeal. They were fresh and plump, probably 36/40 or smaller. My biscuit was big and fluffy. My friend was trying to eat healthy. So her dumb ass ordered egg white, hash browns  and turkey sausage. Hash browns looked undercooked, turkey overlooked. Egg whites looked fluffy. Overall, it was ok. I've had better. Probably won't be back unless I'm in the area. Nothing stood out for me.  What I had was good, if it wasn't so fuckin hot!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IjAnmx3Lq5s4YCbkj-hLPg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Blech!! Egg whites, hash browns , and turkey sausage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/IjAnmx3Lq5s4YCbkj-hLPg/o.jpg"
      },
      {
        "img_id": "WuFRBk3vCQoUNSFyN8GnKA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Shrimp and grits with Tasso gravy",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WuFRBk3vCQoUNSFyN8GnKA/o.jpg"
      }
    ],
    "user_id": "EDZKP6CGokUIoQfRmkLhdw"
  },
  "8tZ5_25wXoHYDBdzrMronA": {
    "date": "5/28/2016",
    "text": "Chicken and waffles! Chicken and waffles! On a particularly diet busting day, they even switched out the waffles for French Toast for me. This place can get hoppin' but the chicken and waffles are enough reason for 4 stars. As I try more stuff, maybe they will get five stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bSQ1e1SvcLeLeyD367gWqw"
  },
  "JQelTGH636iDEkAvmZyLjg": {
    "date": "3/12/2016",
    "text": "So travelling to charlotte from Michigan and wanted to try the famous chicken and waffle.  Tried Eddies and all I can say is wow.  The chicken was juicy, tender, just the right amount of batter.  The waffle was great and the grits, I felt like it was my first time eating grits.  Service was also great and very friendly.  Must visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dxy02m-Y3i1SEtELe0JHrQ"
  },
  "X6nhvckmaldHak0ffuBazQ": {
    "date": "9/23/2017",
    "text": "Their breakfast is great, but dinner was only decent. Still worth a visit for sure. The seafood platter wasn't overly fried, but I had a lot of oysters with a good chunk of shell attached. The Parmesan grits were great! Nothing special.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQHDm6XW24hhuVyB8UEAEQ"
  },
  "3eDobjDYUdjV0G7AXzSebQ": {
    "date": "11/13/2014",
    "text": "Good burger and good onion rings.  nice sized bar. friendly staff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "Sbjpca-DwQZsFk7cIzsHng": {
    "date": "11/3/2014",
    "text": "We have only ever been here for breakfast, but it is always excellent!  The service is always attentive and friendly (Jesse is awesome, BTW) and the food is always delicious! We especially love their Home Fries.  Prices are reasonable, too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vbHlFP0Orx1mM5-uBqzYFg"
  },
  "pkkQrkWx7wmPhR0ED-soeg": {
    "date": "10/21/2016",
    "text": "Yes it's True, 4 stars for a diner!! Probably the best in town. Consistently delicious, good consistent service. Try the ribs. Off menu items available, just ask, they'll make it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbAMJVUD08GJ_gF77g5vHg"
  },
  "mYm2EmHy6R8VqNxOdejUIA": {
    "date": "2/8/2012",
    "text": "Eddie's Place was one of the first restaurants I visited when I first moved to Charlotte (From Louisiana) in 2003.  In less than one week I was back when invited by a small group of friends to eat here again.  Most of my friends have been surprised that I like this place (if it is a Sports Bar PLEASE do NOT tell me) and more surprised what I order.    Though I have had a Soft Shell Crab Dish and She Crab Soup, I usually order the same dishes every time: Pancakes, Gumbo (Chicken and Sausage) and Hash Browns, Extra Hash Browns and Hash Browns on top!!!  These are my favorite Hash Browns: Cubed Potatoes fried on a griddle (I think) with a little Onion ahhhhhhh and if it were not on the table (it always is) I could forget to add a few drops of Tabasco Sauce.  When my server brought FOUR plates to my table (I was alone) the conversation at a nearby table suddenly switched from \"Day Trading\" to hiking the entire Appalachian Trail!  Eddie's Place has a comfortable feel like a Neighborhood Diner or Bar or Both!  Every time I'm there I notice the staff recognizes the regulars and are plenty friendly to everyone else.  Seems like all the staff put me at ease (no easy task) so it must be required that all potential employees be very friendly, have a calm demeanor, a laid-back attitude and still wait on ten tables at a time!  If you want to see my yelp rating for the food I had for Breakfast today:  Hash Browns with Extra Hash Browns and Hash Browns on Top, 5 yelp stars  Chicken and Sausage Gumbo (Big Bowl) 5 yelp stars  Big Biscuit very good close to 4 stars  Big Pancakes (I do not know what they are called on the menu) 4.5 stars  Gumbo for Breakfast???  I alsomost ordered Fried Pickles three times this morning!  Almost also did, I alsomost did not today!  Please keep it a Secret from me if this place is a Sports Bar, that would ruin it for me!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "__irL9TtRmpRXxlZNQJ_IA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. The conversation (at another table) switched from Day Trading to Hiking the entire Appalachian Trail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/__irL9TtRmpRXxlZNQJ_IA/o.jpg"
      },
      {
        "img_id": "i5OfUPGTSuantYtqI3Tosw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Gumbo with other Bread",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i5OfUPGTSuantYtqI3Tosw/o.jpg"
      },
      {
        "img_id": "IiRnSX9XumUhUqtiTfxRnw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Double Butter",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IiRnSX9XumUhUqtiTfxRnw/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "ECzllVBNsUBdLaYGbKvyYA": {
    "date": "3/2/2012",
    "text": "I just wasn't overly impressed with this place.  I searched high and low for a great brunch place and Eddie's Place consistently popped up on the various lists.  I like the fact that it is older and a little hole in the wall type place.  That makes me feel like it is authentic and bound to be yummy!    We were there for brunch...I ordered the eggs benedict...I know a safe choice.  My friend ordered an omlet with hashbrowns.  The bacon in her omlet was chewy, not crispy.  The eggs were overcooked.  The hashbrowns were old school style, which were honestly a little bland.  The service was just so-so.  I know we didn't get overly creative with our orders but I guess that is part of why I only give this restaurant 3 stars.  I didn't find the menu to be that innovative.  I was hoping to see some great brunch/lunch items that would be unique to this place only.  NOT so much!  They had french toast but with cream cheese but even their specials for the day were not-so-special.    I don't know...maybe I am missing something.  Let me know what I should try next time to really be impressed and I will update my review.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "Ep7xqEIh7Y9-a7fqpwkvJw": {
    "date": "5/27/2016",
    "text": "Service was friendly, the cost was good, the atmosphere was eh, and the food was decent.  We had breakfast, a hamburger, and a Reuben.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xshvBO5towaItOCGRG7sXA"
  },
  "yJ86hobXQ98pzQV3mDfCmw": {
    "date": "12/15/2014",
    "text": "I've been eating at this establishment for years - and I've never really had anything to write about. It's just your normal, run-of-the-mill, neighborhood restaurant/bar. Nothing fancy, nothing nasty - just...that place. Until we dined there for brunch last weekend.  I am taking away stars for service. Drives me crazy when a server walks away before I've finished ordering. I know they're crazy busy (and...quite frankly, a little understaffed), but interrupting me mid-sentence and then walking away before I'm done is...well - just rude. And someone should really train the hostesses that getting people seated is a priority, but double and triple seating their staff does nobody any good, and just creates the perfect storm of crazy for an already slammed server.  But, enough about that...let's talk about FOOD!! (My favorite!) Eddie's, as I've mentioned, has always been that mediocre place. The last place we think of for dinner. Lately, however, things have shifted. The food isn't so mediocre anymore. In fact, they've got some parmesan cheese grits that I might have an addiction to. They really seemed to have stepped up the quality. They've added variety, flavor and...seems like, freshness.   I'm impressed Eddies! We will be stopping by for dinner soon. And...you know what? I'm looking forward to it. Love it when great things happen in my hood!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L4PfS8-gdGyAn7S3F-sJrw"
  },
  "R1ocuLGFDA-WEPBV0Qf6Ng": {
    "date": "8/21/2016",
    "text": "From when you come in the restaurant you fell at home , the presentation and to taste to your pallet He is going to be in \"Awe\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9iQ3039dNd_4vX7Zln3caA"
  },
  "-5r7eSzzvi3DrpN_8itH3w": {
    "date": "8/11/2019",
    "text": "The perfect no frills dinner feel. Where the food speaks for itself. Ben was a great bartender who knew the regulars and made the first comers experience nothing less than extraordinary.   We ate the pancakes (two is MORE than enough) cheesy grits and the Ciabatta bread French toast. We will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SeE6sW_MoL31QSvQaHvGvQ"
  },
  "-rOSpKm42cvDs3YA21Lp_A": {
    "date": "7/17/2019",
    "text": "I hate that this experience wasn't as great of some of my others but I will not based my review simply off this one time. I had great service in the past, good chicken and waffles and my family members and friends enjoyed it. This time the waiter was very.... silent.... to say the least.   Upon walking in one guy greeted us but then was immediately interrupted by another (to whom ended up being our waiter) . He interrupted him greeting us to tell him how there were no clean tables. Both gentlemen left the host stand and begin cleaning tables. Neither one said excuse me or we'll be right with you . I think the first guy was just as caught off guard as we were . We stood there just a little confused like \"what just happened?\" That's when another man came over, greeted us and got menus to seat us. The man who did seat us gave us some suggestions and welcomed us . Our waiter took our orders, brought our food and that was pretty much the last we talked to him. When he brought our food he sat a bottle on the table close to my friend who ordered the chicken and waffles . I asked \"is that syrup?\" We had no idea. She poured it on her food and she's like \"no, I'm not sure what this is.\" Eventually the guy who sat us came back over and we asked about this strange bottle. He tells us that it's was Cheer Wine for my \"She Crab Soup.\" It was just odd that our waiter didn't tell us what it was and it was placed beside her chicken and waffles so we had no idea it was for my meal. My friend really enjoyed her chicken and waffles , it was her first time ever having it as a meal.  Overall, I'll come back. I was just a little disappointed with the service this time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7n3E1tWpANHJKeeaC0TIBA"
  },
  "Zgx4EiYAc59B0TtFaNu77g": {
    "date": "2/6/2019",
    "text": "Review update: My mom really likes this place and so I told her we could come back and try it again. This time around I had good service. The waitress that waited on us was really nice. It seemed like she had been working there awhile and had a nice flow going.   They didn't have the lunch specials yet because we came in a half an hour too early, but I noticed today's special was spaghetti and meatballs, which I would be curious to try next time.   I had the she crab soup and egg sandwich. They were both good. My mom loved her steak and eggs. We shared the pound cake which comes with ice cream and whipped cream and is served warm.   This place is good. I hope the service isn't again like it had been a few times in the past. They seem to have a great team going now and hopefully the other was just a fluke.   I will come back to try the spaghetti!! And maybe one of the lobster dinner nights, if I can catch it. I always seem to miss out on it.   This restaurant cares a lot about its customers and you can tell that in the staff that has been with them the longest.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "eIjCkUjA_g4kkhR3V_ZVtQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eIjCkUjA_g4kkhR3V_ZVtQ/o.jpg"
      },
      {
        "img_id": "7DOlMhs7ip_rFad1Lj98BQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Caesar salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7DOlMhs7ip_rFad1Lj98BQ/o.jpg"
      },
      {
        "img_id": "d1OR-kfnM8QTg0NBGBpLLQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken &amp;amp; waffle sandwich",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d1OR-kfnM8QTg0NBGBpLLQ/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "5h1kCTPR_dk9D2ihmcxGuw": {
    "date": "6/2/2019",
    "text": "Eddie's never disappoints!  Favorite place to go for breakfast, lunch and dinner.  Tonight I specially went to cure my craving for a bacon cheddar cheeseburger and salad with blue cheese dressing.  Their dressings are made fresh in house .... sooooooo good.  We also enjoyed the blackberry cobbler with vanilla ice cream.  Their desserts change daily and are also soooo good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rwEZPeKEHWQcujVWVLdvDw"
  },
  "jihXFpmRSmQ_1mQPGzmBPQ": {
    "date": "8/4/2019",
    "text": "Charlotte agenda rated Eddies as one of the best brunch spots in town and boy were they right! Eddies is a simple restaurant that reminds you a lot of home and offers all the classics! I ordered the French toast which comes with a choice of meat and side. I did eggs and hash browns! All of that was only $7.95 and the french toast became my new favorite meal from there! Only thing I would change with my order is asking for the hash browns to be extra crispy. My friend ordered the eggs Benedict and said it was really good! Next time we're trying the waffles, everyone around us ordered them and they looked amazing! If you're looking for a simple brunch spot that offers delicious brunch food for cheap then this is the place to check out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aQ2l2MUOR9SqQkQlMJlz7A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Hashbrowns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aQ2l2MUOR9SqQkQlMJlz7A/o.jpg"
      },
      {
        "img_id": "k2ZuiFh5xF21rtz3Aw0khQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Ciabatta French Toast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/k2ZuiFh5xF21rtz3Aw0khQ/o.jpg"
      },
      {
        "img_id": "SMHo7bSPnl5X0e3BcDw_3Q",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Egg Eddie &amp;#39;s Traditional Benedict",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SMHo7bSPnl5X0e3BcDw_3Q/o.jpg"
      }
    ],
    "user_id": "uLFhZGrA8BbSP2Ufhe7XSQ"
  },
  "u8_LiiYVEa88fj31-t90LA": {
    "date": "7/27/2019",
    "text": "Best packages ever! Light and fluffy, never greasy. We waited maybe 5-6 minutes for our table and just as about as long for our food. Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wEJi99RG2xfeelwHzAHleg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Mimosas",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wEJi99RG2xfeelwHzAHleg/o.jpg"
      },
      {
        "img_id": "SgMvZOQSl9DUEzIt0dPQ7w",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Peanut Butter Pancakes and Three Eggs Your Way with grits and turkey sausage",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SgMvZOQSl9DUEzIt0dPQ7w/o.jpg"
      }
    ],
    "user_id": "84cLbmKtr_vkFL_xDAjU9w"
  },
  "FZ2lNkFROKANz1-kRSBczQ": {
    "date": "8/22/2019",
    "text": "Good food most of the time  Can't complain and if I did it would be to them being so busy alllll the time but that is a good thing :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GjaFaT2rQjUqSozkZxaGRA"
  },
  "EtF7a0xz6Vk14xqsxVG8JA": {
    "date": "8/23/2019",
    "text": "Solid place for breakfast and dinner, kids or no kids you really can't beat it. And they have 3 dollar craft beer special on Thursday which is a rarity in charlotte these days.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TnJx-QF7tVZzzFRwVq6zHg"
  },
  "pTmXtA8zn-DDhWqvy1Ub_A": {
    "date": "6/22/2019",
    "text": "Great breakfast place, veggie eggs were super good, homemade biscuits. Waffles and grits are delicious. Excelent service, very friendly, parking lot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QFho0PXt3-_QL8bKbA9AjQ"
  },
  "4jz48Li7llVeJx2xI6jBNA": {
    "date": "2/11/2019",
    "text": "Go for the she crab soup, that is all I have to say!   They do have other good food options, but this is the best.  And they will usually have a wait in the evenings, so be prepared. Not a lot of space to wait either, but you can grab one of their variety of beers on tap while you wait!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRMlt2TBsH5_efNSJLGD7w"
  },
  "Wf2Cu-XB4PfzY3dRe5UJ4A": {
    "date": "6/20/2018",
    "text": "First Time Here. Food was pretty good but slow service  My wife had a appointment at Horizon Eye and I ended up going with here in case they had to dilate her eyes.  Fortunately they did not have to but while we were here, we decided to grab lunch at Eddie's.  Nice little neighborhood diner/restaurant/pub that is very comfortable.  Industrial decor inside but several nice TV's all tuned to the World Cup when we were there.  Service is not outstanding so needless to say, we got off to a slow start.  Menu is an interesting collection of Breakfast and heavy on Comfort Foods.   I had joking made a comment about tuna salad the day before and that thought had been running through her mind ever since. Needless to say, she order the Tuna Salad Plate and a Side of Onion Rings.  She always cringes when I mention hot dogs but I went ahead and ordered two dogs all they way, hold the slaw.  Slaw on Dogs is a NC thing and even though I was born here, I'll pass.  In other words, two chili dogs with a side of Fries.  She enjoyed her Tuna Salad and is happy for a while.  Dogs were a bit greasy because of the grease in the Chile and a bit flat on taste.  Fries were excellent.  Never did get a refill on our teas and at the end, we had to track down the server just to get our check.  Not bad for a first visit and will try again and try some other menu items and hopefully the service will be better.",
    "rating": 3,
    "rated": {
      "funny": 17,
      "useful": 35,
      "cool": 23
    },
    "photos": [
      {
        "img_id": "FwpEWMotSvjR4A4wXY9kow",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Sign on Sharon Amity",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FwpEWMotSvjR4A4wXY9kow/o.jpg"
      },
      {
        "img_id": "371owOqgEfJrem6dEFInrQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Tuna Salad with Onion Rings",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/371owOqgEfJrem6dEFInrQ/o.jpg"
      },
      {
        "img_id": "WKaZaip42PJpYT-UbB25UA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Two Chili Dogs with Frids",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WKaZaip42PJpYT-UbB25UA/o.jpg"
      }
    ],
    "user_id": "GGTF7hnQi6D5W77_qiKlqg"
  },
  "IYvOHBIsckTyH_v_KR6nlQ": {
    "date": "7/13/2018",
    "text": "This was a cutesy place to eat that I found out through a recommendation from a fellow foodie. I ordered the chicken and waffle club sandwich with a side of hash browns.   The waffle was very fluffy and the chicken was good. I could have done without the lettuce & tomato. The cheese and onions were surprisingly good on the sandwich tho. Other may enjoy the lettuce and tomato with the chicken & waffle, but personally not me. I took them both off and enjoyed my meal LOL.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vENcVCXAJ4rjp9gfWdkDXA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vENcVCXAJ4rjp9gfWdkDXA/o.jpg"
      },
      {
        "img_id": "7A64t8_7BCXHgWiu6EfZPQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7A64t8_7BCXHgWiu6EfZPQ/o.jpg"
      },
      {
        "img_id": "9rSOcSxhu5gPF60M-Gb0Qg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9rSOcSxhu5gPF60M-Gb0Qg/o.jpg"
      }
    ],
    "user_id": "7bm-w9MDAlLyYcLHgvlieQ"
  },
  "3u4GoH9-OasrPsHQhhWdXw": {
    "date": "8/6/2019",
    "text": "Wanted to try this place out after reading reviews and pictures of different food served. The Chicken and waffle picture looked and sounded so good. I only enjoyed the Waffle part and Cinnamon butter! Crust for chicken had a sickening taste. It kept falling off chicken. My dad had the burger. He enjoyed it. He said it had a nice charcoal taste. My mom had the hotdogs and said they were a bit too salty. We tried some appetizers. My dad had the sausage gumbo soup. He said it was Amazing! My mom had the chicken and cheese quesadilla's. She loved them! I had the Must taste She Crab soup! I found it okay. A few bits of crab in it. Staff very nice and handicap accessible for my mom. Might come back and try Breakfast! I saw some people order it and it looked good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rKS5tdPdhR-xqgTXPVuPZQ"
  },
  "Wewh0VR90SgMFfjtYdduMw": {
    "date": "6/10/2019",
    "text": "I love this place. There is not a lot of things that I eat on the menu because I'm a little picky at times but this place does a great job of feeding my appetite. Everyone is super friendly. I had Ben as my server and he is nothing short of amazing. I highly suggest this restaurant...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p2zkXPc4xhZgJkjjYjlOnw"
  },
  "4ChvfO0JUPxkppDEaO-mfA": {
    "date": "4/15/2018",
    "text": "A couple good things.  A couple average things.  2 bad thing.  Let's start with the good. My meal was by the far the best and would make me come back.  Manhattan Clam Chowder was spicy, yet good.  My Creole with shrimp was fantastic.  5 stars.  The taste was perfect and the size was great.  They were very generous with the shrimp too !  Two people got burgers.  They were average burgers.  Which means they were good, however if you were wanting to go somewhere for just a burger this would not be the place.  The screw up though was the fries.  Over salty and just not good.  Some of the worst fries we have ever had.   I would come back for breakfast though!  And dinner--but recommend the entrees.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "MdsbsWzgyO3VyMvQJrMNug",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Manhattan Clam Chowder",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MdsbsWzgyO3VyMvQJrMNug/o.jpg"
      },
      {
        "img_id": "cykHq25H-lfw26S_CUNBrw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Creole with Shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cykHq25H-lfw26S_CUNBrw/o.jpg"
      },
      {
        "img_id": "ZLw6ShzX6vwE9412iUYUTQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Burger with Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZLw6ShzX6vwE9412iUYUTQ/o.jpg"
      }
    ],
    "user_id": "q_wVhULPqerYHmov0eXbww"
  },
  "adPwkq6uEOdUfPsFZ7hihw": {
    "date": "3/18/2019",
    "text": "Eddies is a great place to eat breakfast there's long waits on weekends. The omelette is a must to order as well. As the pancakes. I'm so glad I found this place I'll be back many times.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "dNYw7o9Wh_UGL46kKYFRAw": {
    "date": "7/6/2019",
    "text": "Never again! I did not enjoy the food here I came for breakfast I got the red white and blue special the pancakes were bland the syrup wasn't sweet the grits were bland and didn't taste home made taste like they were made with water no cream only thing good was the bacon I was dissatisfied",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVWtnR3Z-yKtzl56Ko8qSw"
  },
  "uTM9uoou72edEVGKlnGr7A": {
    "date": "9/9/2018",
    "text": "Me & James went here for Saturday brunch since he had visited here once before and liked it.  Very popular place and easy to see why with such a great selection of excellent food and great prices. It was a very relaxed vibe and seems like a neighborhood joint and draws a lot of locals.  We both had the 3 egg breakfast, with grits, a biscuit, sausage and coffee, wow what a great meal!  Our server said the most popular items are the waffles.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "rv9d5TcnnxuOCX7ole_Clg"
  },
  "LsWUaaMRsdf-grorgluBRg": {
    "date": "8/19/2019",
    "text": "Found this place listed on Google and decided to give it a try as we were passing through Charlotte. It was great! Absolutely no complaints. We ordered the pot stickers, a shrimp po boy, creole over rice, and Mac and cheese. Our service was great and the mimosas were a nice touch to the meal. Would definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AsJjl0h3FbJbM1ayZ-68zQ"
  },
  "GsDb-Mum8WSmg4W4A5XviQ": {
    "date": "7/22/2019",
    "text": "Great food for a decent price and friendly staff. Home town feel and atmosphere. Is a must if in the Charlotte area. We had French toast and the country breakfast. Both were excellent!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "quLwgcDaViEWroH9YDW2HA"
  },
  "lVeQ5DbmTBCmEIxeENCT_A": {
    "date": "12/18/2014",
    "text": "OH. MY. GOODNESS! Breakfast was fantastic. Quick. Friendly. Served exactly the way I ordered it. And tasted wonderful.  What can I say. Ordered 3 egg omelette and it was great, extra well done as I asked for. Hash browns cooked perfectly. Biscuit to die for. I live an hour away but sure hope to be back...and soon! Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JQKaxzS9vJSuhPBjH0t3rA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Sitting at bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JQKaxzS9vJSuhPBjH0t3rA/o.jpg"
      }
    ],
    "user_id": "tj6SGALxWHMB5u2ccjfYNw"
  },
  "fIIKoQgeAiwfNad1iuP5xQ": {
    "date": "10/21/2016",
    "text": "Cheese grits - excellent, pancakes - excellent, eggs - eggcellent.  Love this place, great location, friendly staff, solid greasy spoon eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qHhehmnyBAWgbcZuSlsNLA"
  },
  "xUkuoxpmco9sNgQg4PFSug": {
    "date": "5/29/2016",
    "text": "Ordered the chicken and waffles, overall they were amazing, only downside to eddies place was the wait time, took a while to get a seat, took even longer to get the food but what else do you expect on a Sunday morning...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5X9y7HMulaXut9R60YAJHg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken and waffles",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5X9y7HMulaXut9R60YAJHg/o.jpg"
      }
    ],
    "user_id": "PsrQjxG9Kh70ILKoYTa2JQ"
  },
  "FzxgQRXTr48IhHl72AFrVg": {
    "date": "5/21/2017",
    "text": "Just finished a delicious breakfast at 3pm Sunday. I ordered the omelette (as many toppings as you like) with cheddar cheese grits and a grilled biscuit (must try!).  My husband ordered the chicken and waffles with hasbrowns. I would order everything again except the cheese grits. Our $5 Bloody Mary and Mimosa were good. $32.00 total and Great service. I would recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ao68ZZmvptrFArYPiYQKKQ"
  },
  "8Tub70hbBwoSPVwoMqFUuw": {
    "date": "1/7/2018",
    "text": "Good food great service!  Go to place for our family!  There are few good restaurants in Charlotte that are consistent.  This is the exception.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZyfGmLpOYDQShdz5cwdkwg"
  },
  "u3yvQOH9qXhgCnxCU7LTVg": {
    "date": "6/23/2013",
    "text": "I have been here a couple of times for breakfast and I think Eddie's has some solid breakfast food.  First off, I have to say that I love their bacon.  It's a little frustrating that you only get two slices in an order, but it's reasonably thick and has this amazing smoky flavor.  Still, it's totally worth getting if you like a smokier bacon taste.  The other day, I ordered a special from there of orange and cream pancakes.  Basically, the cakes were covered in marmalade and came with a creamy sauce drizzled over them.  The creamy sauce was delicious, but it would have been nice to get a little more on the cakes.  Still, I really enjoyed it.  My partner absolutely loves their cheese grits.  They have a wonderful cheese flavor and less creamy than some grits you can get here in the QC.  They are not overly salty, which he appreciates.  Finally, their coffee is better than a lot of places.  I assume they don't use Cadillac coffee, which I definitely appreciate.  Eddie's may not have an extensive menu, but they do have some great specials when you come in there.  They also don't have giant portions, but I always think the amount of food is just right.  It is reasonably priced for Charlotte and I always feel like I'm getting good quality food for the price.  One of these days, I will make here to try their dinner menu.    Service has always been pretty good as well.  Our food has always come out very quickly, which I definitely appreciate it.  Last time we came, our server was a little slow to get to us, but she more than made up for that later.  Overall, I can honestly say I'm a fan of Eddie's so far and I look forward to trying out their dinner menu sometime.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "cZeMCY6vrQkFOgcmIbKspw"
  },
  "6HUkV2VIvcVfxZq5kgggLw": {
    "date": "5/31/2017",
    "text": "Coffee was decent. Friendly service and generous portions. Try the breakfast burrito. Keep up the good work! Will definitely go back if I'm in the area again. I was told that it's calmer after 2:00.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GXl_dPbma1RawtuZzzvnaA"
  },
  "_dNqVyvVNqEvXm3xqa1Tjw": {
    "date": "12/22/2017",
    "text": "The she crab soup is absolutely amazing! Fantastic food and food came out fast. First time here and I will be here many more times. Can't wait to try more things they have to offer. Wanted to try the egg nog cake with ice cream but lunch had me stuffed. You will leave very happy with very well priced items and the food is superb and great service",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wrsSZ0VYtoNL-hvstflqXg"
  },
  "NS7QyvD86okSj8NIf70yzQ": {
    "date": "12/22/2017",
    "text": "Went in today for the first time today with my boyfriend, we both LOVED our food! He got the she crab soup (second best only to our fave spot in Charleston--and he has tried many!) and the shrimp Poboy with Mac and cheese. Said it was a 10/10 meal! I got the California Pita with veggies and it was great! We are usually tough critics...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JqLfCmThbt1PcOORz20wVQ"
  },
  "OHqEU_WftRTrPhDombj-Tw": {
    "date": "9/26/2015",
    "text": "Been back for the mac an cheese twice. Not so good. Very dry. Cmon Eddie! Get it back together",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3uzt7kZwFrPrrKuZ2fplJA"
  },
  "7DdPYiP2R9eKjOzoI8Ty1A": {
    "date": "7/14/2015",
    "text": "I have been going to this place on and off for years but have always forgotten to write a review.  Its an unassuming diner type place with great staff and a comfortable full service bar area.  It has a crowd for brunch on Sunday for sure and always an eclectic mix of people. There are many locals who frequent the place and its felt in the vibe of the place. You can go wrong with breakfast there but my favorites are the She Crab soup and if you are in the mood for healthy - the chicken salad platter is awesome.   Give it a try - its cheap, good and the service is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2UvarhsTmzHD3iDDhfafWA"
  },
  "wewOK8ZRQkrsdZdLrnvoRw": {
    "date": "8/9/2016",
    "text": "Finally found our diner. Breakfast is served all day and they have a fair number of fried seafood on the menu. My husband and I came here half crazed with hunger from hiking all day so naturally we ordered the saltiest greasiest thing on the menu. I had the country fried breakfast with hash browns. Now, I suggest looking at the photos of the country fried breakfast and preface this by saying I weigh a buck twenty. It was so good, I ate the whole dang thing! I usually have my meals cut in half but after the first bite gluttony won out. I suggest it hands down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9J609GN4VikydcTWT08g_g"
  },
  "RTpbWpQP13dU24WlNfP0Iw": {
    "date": "7/23/2016",
    "text": "Everything was excellent here! Great customer service and amazing food. A winning combination in my opinion. My wife and I will definitely be back very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "U1yTOJdG9qQqpuHbG4fxYw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Egg white omelette! Yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/U1yTOJdG9qQqpuHbG4fxYw/o.jpg"
      }
    ],
    "user_id": "B8Y6ViRT6AEhXAYD45HWFw"
  },
  "SAsR4ACLPfZphA-UIiBtsg": {
    "date": "4/14/2013",
    "text": "Sunday breakfast is my hands-down favorite meal of the week, and I generally feel like it's a pretty difficult meal to mess up.  Eddie's Place has proved me wrong!  We showed up around 8:45 on a Sunday morning, and there were only 5 or 6 tables full.  We were quickly seated... and then slowly waited on; it had gotten to the point where the fella was starting to count down the minutes til we walked out because no one had been by our table.  Yikes.  Finally, our waitress appeared.  I ordered a basic breakfast - two scrambled egg whites, bacon, hash browns and toast for $7.50 - and the fella ordered one of the specials - a pulled pork benedict with cheese grits and cornbread for $10.  The food came out quickly, and about halfway through our meal, we asked the other how the meal was.  Both of us replied with \"just ok.\"  My bacon was charred, and my hash browns were bland and rubbery.  The toast and eggs were fine.  His grits were a cheesy stew with no grit consistency, and the eggs and corn bread were fine.  Oddly enough, the pulled pork was the worst part of the pulled pork benedict.  There just wasn't much taste or seasoning to anything we ate.  It had been probably 9 years since I'd visited Eddie's Place, and that was for lunch, but I had a much fonder memory of their food and service than what I actually experienced today.  Bummer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QmethzRyAvZXS9m1UNJpdw"
  },
  "M_1W4Yd1qm7f39MVqGPaXw": {
    "date": "7/2/2015",
    "text": "This is my favorite place for Sunday brunch in all of Charlotte (however I've only been to about 4 or 5 places).  It doesn't hurt that it's right across from St. Gabe's and is still serving breakfast food when the 12:30 mass lets out at 1:45.  The wait is reasonable, the service is quick, and the food is great.  I like my eggs scrambled dry, and they always get them right, while by comparison I often have been disappointed by other places.  My worse complaint is that one morning I needed to send my bagel back twice before it was toasted sufficiently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i2rSZVnBtuv70OD4sbOtUg"
  },
  "UQHeadMVrM1SYB3tTTYPPQ": {
    "date": "9/24/2017",
    "text": "Decent breakfast spot, always packed.  I'm not sure we got the right thing off the menu since it didn't knock our socks off like other reviewers. There are places that can do even the basics really, really well and that is what I was hoping for here. We'll try again but at this point not a place I will frequent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CTxfd3Epknto7NKad6Ah6w"
  },
  "IU7f2Fvrbp-htnLwYFUYOg": {
    "date": "12/18/2012",
    "text": "I finally got to try Eddie's Place.  It's a lot less busy on a Sunday night for dinner.  So I'll keep that in mind for next time.  It's a bit dark in here with the red walls and this probably makes it feel smaller than it really is but the chairs and booths are confortable.    The menu has several options with a Louisiana flair but they also serve breakfast all day which is a plus.    I ordered the cajun pasta which came with a side salad.  The salad was a bit disappointing.  It was iceberg lettuce, 2 tomatoes, 2 big slices of carrot.  Iceberg lettuce is just a real turnoff to me.  There are better greens to make a good salad.  The saving point was the habanero ranch dressing which had a wonderful kick to it!  The Cajun pasta was good.  The chicken was nicely spiced and it also came with andouille sausage.  The bread that accompanied the meal tasted like it was homemade.   I think this experience is more of a 3.5 rating but I didn't think they were worth the 4 yet.  I definitely need to come back and try the breakfasts.  I hear they are the bomb here.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "ANvze3neTtGQxOhe2fHNIg": {
    "date": "10/15/2016",
    "text": "Love this place. Garlic Parmesan grits are the bomb. Chicken and waffle is a must. Yumm.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOKYlcYfRc5_3lnijW_yZQ"
  },
  "3d60WviSU9hweKAbysLk2Q": {
    "date": "11/20/2015",
    "text": "Always the best of everything. Sit at the bar and ask for Jesse. Great guy and lots of good cheer. Fantastic cobbler and steak.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hoJJjhWls0TnkHA1QryOeg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Eddie&amp;#39;s always has a great dessert.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/hoJJjhWls0TnkHA1QryOeg/o.jpg"
      }
    ],
    "user_id": "J3cO1XfBcTUTk2BmbMh8IA"
  },
  "3DvNptHSwDJjixDGPzHr6w": {
    "date": "9/26/2015",
    "text": "Wonderful local place.  Great character .   Good daily specials.   Greek omelet special  the food is awesome !!  Breakfast all day!!   Great service !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "34czhOIfXw5-AXu9O2tskQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Greek omelet specials",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/34czhOIfXw5-AXu9O2tskQ/o.jpg"
      },
      {
        "img_id": "mLztoRap4alIasDvG5Eknw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mLztoRap4alIasDvG5Eknw/o.jpg"
      },
      {
        "img_id": "BMp27Xo23Qq1wcp06urfmA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Good morning weekend !!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BMp27Xo23Qq1wcp06urfmA/o.jpg"
      }
    ],
    "user_id": "5aqETc-2F9hsynUxpaWFwg"
  },
  "D7tD_Is8Ty_0y3ErtgSCew": {
    "date": "9/11/2012",
    "text": "Eddies Place has the BEST burger in charlotte... the BEEEEEST. Its a great neighborhood joint... good food, good service and a great place for breakfast served any time of the day. Besides the burger they have excellent wings and the nachos are a must. For breakfast you cannot beat their french toast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "Q-myO_ZtDn6eNPkFFKT9ig": {
    "date": "6/6/2014",
    "text": "Gross food and horrible service. Waited 10 mins for a waitress to ask us what we want to drink. Nothing to eat if you're vegetarian, hell no if you're vegan. Not a single decent bite.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jEAe58PPsheIDHC93Pkqgw"
  },
  "QndmEN0d8wLTygQ089nikw": {
    "date": "8/18/2012",
    "text": "I had a chance to try Eddie's Place when some co-workers decided to stop by for lunch recently.  I will say that I was not too excited about going here based on my one and only breakfast experience there some years ago.  Don't really remember anything being really bad with breakfast, but I was not blown away.  Anyway, lunch on this day was a completely different story.  First of all, I was really impressed with their menu and the variety of New Orleans inspired items.  The muffuletta was calling my name as it has always been one of my favorites.  The sandwich can be ordered hot or cold and is made with imported Genoa Salami, Mortadella, ham, Swiss cheese and Olive Salad on Ciabatta bread.  It also comes in two sizes huge and double huge based on me ordering the smaller size and seeing that it was still substantial.  I finished it all and the side of fries, but 2 people could split it easily, based on how highly stacked the sandwich comes.  There are many other good sandwich options on the menu along with many other entrees, and I will certainly be returning to Eddie's Place sooner rather than later.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "QIB3say05DiRdRF99Pk5kA": {
    "date": "9/20/2012",
    "text": "Some of the best French Toast in town. Lots of other good breakfast food as well.  This was my first visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2v_afk7wHdz_iHsypZYrgA"
  },
  "iWHsjuK0n8152N-TJMcSmg": {
    "date": "12/22/2014",
    "text": "This is, hands down, one of my favorite places to go in Charlotte for breakfast. Every time I have been here I have been beyond pleased about my experience. Food, service, atmosphere, prices are all outstanding. I would recommend this place to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pKWRedssd3Wr6kM_qfMaiA"
  },
  "V8P0Gp03me4L9E0BDyVenQ": {
    "date": "12/12/2008",
    "text": "Solid breakfast experience!  I picked up a breakfast sandwich and a coffee, both of which fully met my expectations   I'm always down with options, and I was able to select the confection which my sandwich was served on (I went with croissant) and the meat (summer sausage there).  The service staff was prompt, enabling you to integrate Eddie's Place into your mourning breakfast plans with minimal disruption.  Like I said, solid breakfast experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "pNRjTAIUDHfqENUI2AapaQ"
  },
  "Sl5peaVZkwKppz9n4zG9aw": {
    "date": "9/9/2011",
    "text": "Met my daughter here for dinner last night. It was pretty crowded but we still were seated right away. We couldn't decide on dinner or breakfast. They serve breakfast all day (A real + in my book). My daughter went with the cheese burger and I fell back on my favorite, french toast. What can I say, I'm a sucker for breakfast. My daughter's cheese burger looked great and must have tasted better because she polished it off along with most of the fries (she'd kill me if she knew I was writing this). The french toast was perfect! 4 thick pieces of french bread, cooked just right, with a little powdered sugar on top along with grits (cheese) and crispy bacon. Yum! Oh and the hostess was in a good mood tonight:)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "zLBJgPyCJ3vewfdEo-r-gA": {
    "date": "12/8/2010",
    "text": "As my daughter said...\"this place is great!\"  The atmosphere is cool. Relaxing. Service was good. Not over-the-top. Just \"get the job done\" kind of service.   It was our first visit to Eddie's Place. So maybe we got lucky. But everything about it was great. The food. The atmosphere (nice and casual).   The Blood Mary was perfect.  Food was really good...better than I expected.   I prefer locally-owned restaurants over chains, but it can be a crap-shoot.  The only thing missing was Eddie. Maybe we'll see him next time we visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aWPkHURxOkKN8sAu3Y6Ebw"
  },
  "TMBkQu4L2KRY6jDg__CpMg": {
    "date": "1/14/2009",
    "text": "I'm good with Eddie's - I got a spot in my heart for anyplace that does breakfast all day long (which ironically I've yet to try!).  And the She Crab Soup is all that and a bag of chips as they say.  [They still say that?]  Eaten here several times and it has been consistently reliable.  My only gripe here is that this location seems like it could use a refresh in the decor, the floors and wall are looking a little long in the tooth to where the vacuum and wipe-down ain't getting the job done.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "enaSpC9aA7u2wq_KH5SXGA"
  },
  "p5IwB7Phg74XW3n6Vz1sjA": {
    "date": "5/29/2011",
    "text": "Great low key Cotswold neighborhood hangout that's been around since 1997.  I enjoy it mostly for breakfast but it's actually a New Orleans style restaurant.  I hear the burgers are great too!  Comfort food, reasonable prices, friendly service and neighborhood atmosphere...can't go wrong with that!  AND...locally owned and operated!!!  :)",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "dk9GzM6Nni61oBdkETDFkA"
  },
  "mW7eyPpO26VumOn8pjyXBw": {
    "date": "5/25/2008",
    "text": "As I have stated before, I love breakfast! So we went over to Eddie's one Sunday afternoon and got a table almost immediately, which surprised me since they seemed busy.   I had the omelette special, which was shrimp and some goat cheese, and spinach, and I made it an egg-white omelette. It was very tasty, even with the lower fat swap-out.  I also had grits, which were excellent, and bacon, which was also great.  A $5 mimosa was also a nice treat.  The service was lacking, probably because it was so busy.  It is certainly a very dated, bordering on dingy establishment, so I wouldn't make this a first-date destination.  But overall, I enjoyed our dining experience, mostly because the food was so good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "spciuHa8YwZB41XjKqTUOQ"
  },
  "dz_TjLyt3_ZhaiCJDykHtQ": {
    "date": "10/11/2012",
    "text": "This place is an old favorite - everything is good here! Great beer, breakfast any time, friend pickles are DANK, crab soup and gumbo is sweet too. I always get a tuna melt on wheat - they'll pretty much make anything you ask for. Staff is chill and friendly and great atmosphere",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "G7Jl2r-5P8yJAtFwD3bcfA"
  },
  "s9CR6T5oV-HtyXRyn9v-lg": {
    "date": "1/3/2012",
    "text": "Excellent turkey reuben and fries. Real fresh turkey and crispy french fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ic9iN1AGx9_phF_DOcn_Zw"
  },
  "gCW01jWGHRGWpcdZFGK2DA": {
    "date": "11/6/2008",
    "text": "We had breakfast here recently and the Governor of North Carolina was eating there, which makes perfect sense: this place is just a good 'ol fashioned Charlotte-style breakfast joint. Nothing fancy, but great nonetheless.   Since it's not much to look at,  I was kinda surprised when I walked in on a Sunday to find Eddie's TOTALLY packed. Make note of that if you're coming here on a weekend.   As for the food itself, it was pretty good. Mostly offering standard breakfast options, Eddie's also has some more southern style foods like grits and biscuits n' gravy, both of which were ordered by my group and were deemed awesome. Great coffee and service, too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bduV2PTTGWKIIcPX6gjPrw"
  },
  "vjskelWckgaqIJ3SjBnmew": {
    "date": "2/8/2009",
    "text": "After reading the reviews here and a few local papers claiming this as the #1 breakfast place, we decided to give it a shot. If this is the best Charlotte has to offer for breakfast out, we'll stay home.  They were very crowded, but we didn't have to wait long at all for our table. The waitress was attentive and friendly. I do agree with other reviewers who've said the decor could use some freshening but that's not a deal breaker for me.  What made us decide this is not a place we'd return to was the food itself. I ordered the chiabata french toast with bacon and grits, while he ordered the Italian Omelet Brunch Special (3 egg omelet with mushrooms, sausage, mozzarella cheese and tomato sauce) with hashbrown and cheese grits.   My bread was soggy in the middle, and the texture felt like the bread had soaked up too much egg and not been thoroughly cooked thru. The bacon was rubbery, and the grits were tasteless and seemed slightly undercooked.   His hash browns were soggy and greasy, while the omelet was watery and rather bland. His cheese grits suffered the same undercooked texture as my plain ones, and while they had an orangey color to them, had no cheese flavor at all.  We hold out hopes of finding a good breakfast place someday, but for us, Eddie's is just not it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y7XuQa2G03PcVQQGmHs3Tg"
  },
  "OcqEcgpnc7DcvrHpEp0PlA": {
    "date": "9/5/2010",
    "text": "Eddie's Place is as homely of a restaurant as you can try.  The no-frills Cotswold location has a wait staff with character and hearty food.  I'm pretty much sold on those points.  I've been a few times and I've had their Greek Cheese steak-it's like a gyro on steroids!  Filled with lamb and beef, this gyro is hard to bet.  I'm not a fan of the fries however-they were \"chipped\" fried potato pieces without much substance.  The other sides are worthwhile however.  The staff are an absolute riot-I got \"jostled\" by my waiter for my indecisiveness.  Still, its a laid-back atmosphere and it certainly appears that the staff enjoy their job.  Our server was out to check on us regularly and we felt much love.    I'm going back to Eddie's at some point. The menu has some interesting treats, like Cajun dishes and really down-home dishes that I haven't seen in restaurants.  The beverage selection is top-notch, he-llo!",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 8,
      "cool": 4
    },
    "photos": [],
    "user_id": "7IZQ06zkYSCLQM4JU9kFvg"
  },
  "ZPzX8cgfALJV39y-EjJO3w": {
    "date": "11/1/2012",
    "text": "It's my go-to brunch place on Sundays.  There is always a line but it moves fast and the servings are big.  My favorite are their specials that deal with french toast.  They make a pretty solid omelet as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DQIt5Uv87fdS54b2oTXBMQ"
  },
  "P5bDRb7abWuZPg7XqDPxBw": {
    "date": "12/13/2011",
    "text": "Please, please, please put the seasoning back on the french fries!!!!  Love the grilled chicken sandwich, tuna melt, burgers.  But put seasoning on the fries.  .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "av-MqA1M70LFeaXFLnnPHQ"
  },
  "2JDzR8__QNYSSaFXidi8Cg": {
    "date": "8/21/2007",
    "text": "I got an omelet here and there was so much butter it was glossy. I didn't know I had to request 'no butter' for an egg omelet....  Over all it's decent. For a much better breakfast I suggest Original Pancake House or IHOP.   The service is also pretty crappy, especially if it's crowded.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4hS3xBc6kt_1dpKqDOsLw"
  },
  "c0mJlOZkAC1mlb70fAJaqA": {
    "date": "9/30/2010",
    "text": "Liver Mush!  Yum Yum. Southern Caviar!  I come all the way from Atlanta to eat real southern at Eddies",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCCqhFUcplDk_rhcaVpE4Q"
  },
  "q0ehcICXWwobe6M20ykpxQ": {
    "date": "4/20/2018",
    "text": "Average from start to finish. Nice people and a well know local establishment. Food is simply ok and ambiance is severely lacking.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LA7b8iSSNlHEuwH3TlRl0w"
  },
  "RMf6b6-OQzPEUPHnKaZG2Q": {
    "date": "7/31/2016",
    "text": "My friend and I came here for dinner on a Friday nigh after seeing the reviews on Yelp. She was particularly excited about the all day breakfast/brunch. There was no wait to be seated at around 6pm.   We ordered the creamy cajun pasta and their famous French toast. The Cajun pasta was ok, but the French toast was the best I've ever had. I would definitely come back just for those.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d9CpYYtN6tO3Obah0CfWDg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. French toast with hash browns and sausage patties",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d9CpYYtN6tO3Obah0CfWDg/o.jpg"
      },
      {
        "img_id": "BItsSWIjxBGkLu_qbPp0fA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Creamy Cajun pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BItsSWIjxBGkLu_qbPp0fA/o.jpg"
      }
    ],
    "user_id": "G6A0QvJDvYzI0hoYqUNobA"
  },
  "wx8zRHPxKyLTjm6aJdT_KQ": {
    "date": "12/14/2015",
    "text": "Solid breakfast spot! The service was quick and efficient! I got the corned beef eggs and hash. The corned beef hash was more like hash browns with corned beef thrown in, it was good but not a favorite by any means. I'm giving them four stars mostly because I couldn't stop eating my breakfast partner's chicken and biscuits. Ummm wow, something I would never think to order, but it was effing delicious. The chicken was seasoned well, the sausage gravy was awesome, and the biscuit was really the perfect icing on the cake so to speak. If I went back I would order that and plan not to eat for the rest of the day!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "xgFnNGS18jUgtId2ewcc_A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Corned Beef Hash",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xgFnNGS18jUgtId2ewcc_A/o.jpg"
      }
    ],
    "user_id": "MmQv7nXo3EKVW6ZbFBZ08A"
  },
  "_xFLRoIx-1NgfvcT8NEmKQ": {
    "date": "3/25/2018",
    "text": "A family favorite ! Every time my parents come in town we always go to Eddies !  My dad and husband love the she crab soup and Cobb salad. My mom and I love the shrimp and grits ... and you can never go wrong with their daily specials ! Always a great meal !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JD-Ju2mzrg5inX52euv9A"
  },
  "pPGXT2XSN3rXMz_JHW5brQ": {
    "date": "1/31/2016",
    "text": "First time ever, the ambiance is chill and casual.  I ordered the Pecan Crusted Chicken and Waffles with a side of Bacon Gouda Mac 'n Cheese. The best in the Queen City!!!  The waiter was attentive and gave great suggestions for a Eddie's Place newbie. Oh don't forget the Mimosa special on Sunday (pictured in the background)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "v0plYNcXcNvQtG1F7_eA9g",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Carrot Pound Cake with awesome Salted caramel ice cream!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v0plYNcXcNvQtG1F7_eA9g/o.jpg"
      },
      {
        "img_id": "_RlVsQa5wstEGJjoET9PEg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. February&amp;#39;s Specials",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_RlVsQa5wstEGJjoET9PEg/o.jpg"
      },
      {
        "img_id": "6IOPeuyv0StacIYNAR4g7g",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Prime Rib (10oz shown), great deal for Tuesday&amp;#39;s specials!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6IOPeuyv0StacIYNAR4g7g/o.jpg"
      }
    ],
    "user_id": "fSxEC8Y6e2j-sxwCKOZ5Rw"
  },
  "YQce23BvAmtoVdxkl40YPw": {
    "date": "12/20/2017",
    "text": "First timer here!! A small group came for a Christmas gift exchange during lunch hours and the place was packed, but service was still very good. Points for that! I love that they offered a breakfast/brunch menu and the regular lunch menu...I like options people! I got the country fried breakfast, which is fried chicken on top of biscuits, smothered in country gravy with 2 eggs...yes. Yes it was as good as it sounds. Next time I'll ask for extra gravy! NOM. The chicken was cooked well, and was not dry (which is difficult), and I got a side of cheese grits that were pretty orange colored...so that was strange but they were fantastic and yes, I ate it all. ALL OF IT. Also got a cup of coffee, and it was good...nothing fantastic but it hit the spot. Other people in our group got the chicken and waffles and I am pretty sure I'm going to have to order that next time. It was HUGE. Also...after my 3rd time around the front parking lot, I discovered there is a back lot to park in (I don't frequent this area enough!).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oDv9HzZUPw1b_uQW0vVCOA"
  },
  "C69gTJnj7XVW0QxBinVjtA": {
    "date": "12/29/2016",
    "text": "I've been here twice.  The first time I enjoyed myself, it was brunch and I had the very good french toast and a side of bacon.  Service was not bad, but didn't make an impression.  Fast forward to earlier this week.  My girlfriend and I went for an early brunch (imagine my surprise and delight that the whole menu was available at 10 am!).  She had the vegetable pasta with a side salad - she enjoyed her meal.  I had the cobb salad with an awesome blue cheese dressing.  The True gem of the meal however was the service.  Ben, our waiter, was beyond awesome.  He was attentive w/o being cloying.  He was just the bomb.  They were clearly busy but he kept things moving and grooving.  He's a gem and made our dinning experience truly fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gZ8VNx7wHuaOd24Bx71saQ"
  },
  "cWDPa_aqTtgIIXNGTeNmiQ": {
    "date": "2/11/2017",
    "text": "I absolutely love Eddie's Place any time of the day, week or year! Everything I've tried has been amazing. Today I tried the chicken and waffles and OMG.. it was all I thought it would be and more. The Parmesan Grits are my favorite side option. But there is something for everyone here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RLfczw3gg-pFXD3SEVz1DQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RLfczw3gg-pFXD3SEVz1DQ/o.jpg"
      }
    ],
    "user_id": "9CBXXi3TbWCK1OlNVTEPWQ"
  },
  "Gl1OHZfO2T7IdkQPXKuKpQ": {
    "date": "10/28/2013",
    "text": "New. Brunch. Place. Excuse me while I do a little happy dance!!!  My friends and I stopped in for brunch after church on Sunday. The place was packed but we didn't have a wait. Score! Everyone here was nice, hostess greeted us, there was a waiter in BACON socks (does it get much better than that) and not to be outdone our waiter was awesome! He was very attentive and full of suggestions after we told him it was our first visit.   Everything on the menu sounded delish but I went with their Omelet...for one main reason: you can ADD as MANY toppings as you like!!!!   Whoa.   You can chose options on and off the menu to pile on your three egg yummy creation so I went crazy....I chose bacon, ham, spinach, jalapenos and feta.  Folks, that thing was delicious! It was prepared as I ordered, came out steaming HOT and add those hash browns and a biscuit ( yep. they are delish too) and plan to leave stuffed and happy.   Totally recommend this place! I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "gP0gFs67wwaw4UjL7v8SPg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. 3 Egg Omelet with hash browns and a biscuit!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gP0gFs67wwaw4UjL7v8SPg/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "enAUt54KflUOAB07xl5Ckg": {
    "date": "7/29/2014",
    "text": "Yes to an amazing Sunday Brunch!  Finally had a chance to experience Eddie Place. The food was Truely amazing. I ordered the Chicken and Waffles with hashbrowns. The chicken was cooked perfectly, juicy and not greasey. The cinnamon honey butter married the dish together. Everything was great. Service was good and the feel of the restaurant felt like home. Very good spot to try. I will have to make a trip back for dinner hours. ~Feliz comiendo~",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Esmxm2FfdmkCcrij5C25Gw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken and Waffles with hashbrowns",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Esmxm2FfdmkCcrij5C25Gw/o.jpg"
      }
    ],
    "user_id": "z2h4FD8zytF4uxjH55dViw"
  },
  "4oHTdgOFfEbAzql-3KLviA": {
    "date": "12/3/2017",
    "text": "Very solid place! We went because my wife was craving soup and I had heard that their \"she crab soup\" was to die for. It did not disappoint! I highly recommend it. Otherwise, we had the lobster dinner special and it was decent. Our waitress/service was great as well. We'll be back. The burgers looked good too, I'll prolly try one of those next time!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V8fqbk6cfLL8ZJ8s4iCkkA"
  },
  "2K1oTGINB2Ew8nt7eCpZ1w": {
    "date": "12/9/2017",
    "text": "One must try the she crab soup at Eddie's place. Coming from Boston, I think it's as heavenly as the best lobster bisque up north. The wait was long, but totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f8KXNMACzqx-VOUD8kjWxQ"
  },
  "gXcl6207z1R91CtziaE-0Q": {
    "date": "3/17/2016",
    "text": "She-Crab soup was really good. Nice amount of shredded crab.  Had a St. Patty's special of Corned Beef & Cabbage. Honestly the best I've ever had. Huge portion, and everything was just delicious.  Meat was incredibly tender and the cabbage was amazing.   All the servers were very friendly. Service was fast. It's a little on the pricey side, but I'm a fan.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BS-UGAhKuLj67AI8F8Yj-A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. St. Patty&amp;#39;s special. Corned Beef &amp;amp; Cabbage. Incredible!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BS-UGAhKuLj67AI8F8Yj-A/o.jpg"
      }
    ],
    "user_id": "YwqzzE1j852e69scVloATQ"
  },
  "1oo3ZpqVsQwsbCw7AF6ioA": {
    "date": "7/3/2017",
    "text": "This place used to be pretty good. A casual neighborhood restaurant sort of place. But the last few times I've been there it's been pretty weak. I ordered a $6 blt about a month ago, and it came with massive bread and two wimpy pieces of bacon. And tonight I ordered a shrimp po boy (because they're usually very good) and they did not include lettuce or tomato or any of the normal sandwich stuff we asked for and that's listed on the menu for that sandwich. We called the store and the manager was not very helpful. Think we will be taking eddies off our restaurant list",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VOiDcAOEiN9YBaI7DJ8uyQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Po boy. Where is the lettuce and tomato? And the tartar sauce?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VOiDcAOEiN9YBaI7DJ8uyQ/o.jpg"
      }
    ],
    "user_id": "5vkL-xUngdMx99Lqs_XbWA"
  },
  "m0hGRnWspECAU7rNjcVgQg": {
    "date": "3/28/2017",
    "text": "I'm in Charlotte visiting family and found Eddie's on yelp. Terrific lunch. I had a cup of gumbo and the lunch special chx enchiladas, both recommended by a very good bartender, who I forgot to get his name, but was really on top of his game. Food was delicious and the prices were very reasonable.  Btw I also took his recommendation for the blonde beer.  Just as good as everything else he suggested.  Great place. I live in NY now and am saying to you locals, don't take a place as good as this for grant  Came to Charlotte for a visit but unfortunately tragedy struck with the death of my father.  Eddie's was so convenient that I brought all of my family here over the last week. 7 meals in 7 days here.  All of them outstanding, and I've lived in NY for the last 30 years, so I know great food when I find it.   Breakfast burrito, all the po boys, chx salad sandwich, taco salad, she crab soup, gumbo, chx sandwich all got rave reviews from us. Time now to go back to our respective homes. My family jokingly said I became Eddies best customer in one week and that they'll miss me. But, you know, I'm going to miss them too",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o25YtjzP6w5Npe61Q4g0pw"
  },
  "FSGzjReMu67YzWBqp6pKwg": {
    "date": "10/19/2016",
    "text": "This is a great local spot with a family atmosphere and the menu to back it up!  Let's start with their signature She-Crab Soup.  This is one of my favorite things to eat in Charlotte! It is absolutely delicious!  Even if you don't like soup...or crab, i guarantee you will like this. (Tip: put a little sprinkle of sherry in the bowl)   The rest of the menu is really solid with Sandwiches, burgers and signature dishes.  I usually go for the Turkey Pita if i want something light and pair it with a small bowl of She-Crab.  Also, they serve breakfast all day!  Tuesday night is $1.50 an ounce Prime Rib night (if you're feeling crazy ask them to deep fry it)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nap5CM2nZvaFodByvUL75w"
  },
  "aXm4U7tZRs92xZIgXjnTBQ": {
    "date": "6/28/2018",
    "text": "On business and not up for the Concierge Lounge breakfast so looked around at Eddie's popped up.  Couldn't have been happier.  Nice fluffy omelette and great service to go with a kinda hip environment.  Prices were reasonable as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ixV_R5ulCPRcqq2hMJoUeg"
  },
  "B4NdckEf7y5WkClqMz3-XA": {
    "date": "4/14/2017",
    "text": "The atmosphere was nice and had a neighborhood cafe feel. The bathroom was VERY clean. Service was good as well. We had the chicken and waffles. They were very good!! The pecan crusted chicken was delicious!! I also ordered the Parmesan grits and I was so surprised at how good they were! Please try them!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I34otCUDW72eXPpwHA-7RA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Turkey burgers with pepperjack cheese and a cup of shecrab soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I34otCUDW72eXPpwHA-7RA/o.jpg"
      },
      {
        "img_id": "jhbbIeHtAR0O04VSSVXqIQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Turkey Burger with pepperjack cheese and shecrab soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jhbbIeHtAR0O04VSSVXqIQ/o.jpg"
      }
    ],
    "user_id": "YHOhTY2yUNhqDWfZgm8uYA"
  },
  "nTA-9KLLNQ1FxkcPYJdq9Q": {
    "date": "12/29/2016",
    "text": "It's a good little neighborhood place, but it is nothing special.  There is nothing wrong with it, and I'm sure if I lived in the area, I would go back frequently.  I went twice with family recently and I will say that they are consistent.  The food is good, not great but better than decent.  I will say that their portioning use a little work as that was not consistent between the two orders I ate (I got the same thing twice because I like that meal).  The service is efficient and what it needs to be.  The place can get pretty busy, and waits during the brunch hours can pretty much be expected.  But it is what it is, and it is good.  And that, is not a bad thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uoeeBfmMk-TppxoH_b1HhA"
  },
  "eKDj8OjUXjDJyLslfMu9Rg": {
    "date": "10/29/2017",
    "text": "Visiting from out of town and we ate here for brunch. Looks pretty simple as far as atmosphere and menu goes, but the food is delicious. Really surprising gem. One of my friends got the chicken and waffles- I think this is the brunch menu item to get! It was amazing. The pecan crust on the chicken paired perfectly with the waffles. All the food was delicious though. Cheap bloody marys too if that's your thing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NOTLz-45YRDvqm_puNLo9Q"
  },
  "FERo-Ps03SXoDQyGG-WoAg": {
    "date": "10/18/2016",
    "text": "We heard really good things about Eddie's and some of the yelp reviews mirrored others sentiments. However we when got here this was not our experience.  We were sat promptly and this was good because it was starting to get crowded at the time that decided to stop in. They have a good selection of items of the menu. So we decided to order the following: A order of french toast, a side of turkey sausage, a side of pancakes and a side of hash browns.  The food came out quickly however just because it is quick does not make it good. I hate to complain now, because i did not complain at the restaurant. Here is what we thought of the food. The hash browns were under cooked and still very soft. Im used to a little crisp on my hash browns. The Pancakes were standard nothing really good or bad. The turkey sausage again was under cooked and very soft. It is hard to explain maybe its a texture thing? It was soft and cold just as the hash browns were. Finally the french toast didn't pair well with the ciabatta bread. It was soggy and not crisp.  I think that the place has a homey type of feel and a lot of regulars stop thru. I didnt too much like the food. It wasnt bad but it wasnt good either.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GNQFSRVkgwVYLj6LyF9Xpg"
  },
  "oDEYTDvMbdZCrQtqwFm-VA": {
    "date": "9/26/2015",
    "text": "Out of the gate they hit the ground running on my visit.  I sat at the bar on an early, rainy and chilly Saturday and was greeted promptly by Ben.  What a pro!  He's worked for Eddie since 2000 and couldn't have been more courteous and efficient.  That alone makes a 2nd visit a slam dunk.  Ben suggested the Greek omelet stuffed with chicken, olives, spinach, onions, and feta topped with homemade cucumber/dill sauce.  A side of cheese grits and pita tips completed the entree.  Very, very good.  Great location, urban vibe, neighborhood feel, and gut satisfying food makes Eddie's Place my kinda place.  They even use cloth napkins.  I'm in all the way!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BN1cmmGjVSkoN2TfoKmhcw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Nice plug today on WBTV celebrating hot soup week.  Mmmmm.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BN1cmmGjVSkoN2TfoKmhcw/o.jpg"
      },
      {
        "img_id": "hHNKusN0gGv7NTTYe4SZmw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Greek omelet with cheese grits.  Mmmm.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hHNKusN0gGv7NTTYe4SZmw/o.jpg"
      }
    ],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "cJYP3hhEnwxQ6rLphFTeJw": {
    "date": "6/12/2018",
    "text": "Definite brunch/breakfast spot. Gotta try their chicken and waffles. Its to die for!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MlhCUi0mqIi--pWlw30iKA"
  },
  "proR3t9JKYl4vfrjx_qaVw": {
    "date": "12/8/2016",
    "text": "Oh Eddies place, how I wish I could like you but unfortunately I just can't.   First, early in the day the line is slim to none to be seated, the hostesses are very sweet and so is the rest of the friendly staff. This is where my one star goes too.   Secondly, Prime Rib special.... Stay away from it. Extremely burnt, had no flavor and almost all of the rib was fatty. Needless to say I ate it all even though I wasn't a big fan and with my luck, got food poisoning.   Third, Prices aren't bad, beers are cheap and they do have good specials, my stomach just wasn't a fan of the Tuesday one. All in all, I could live my life without coming back here but kudos to the friendly staff!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oYf5m0vyL7AOXBicacw5GQ"
  },
  "uX4hx41jcQoZ0aoclGRuXw": {
    "date": "7/9/2018",
    "text": "Awesome food! The chicken and waffles were amazing! The waffle came with apple cinnamon butter and the chicken was pecan crusted. One of the dishes on special for that day was also delicious it was shrimp w/ sausage, roasted tomatoes, garlic potatoes, my boyfriend opted for poached eggs, it also came with a biscuit that was absolutely perfect for soaking up the sauce. It was a Sunday and there was a thirty minute wait but it was worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JIfw1omq7HUGCbWA506uMw"
  },
  "DutExsfNxPu3ZFdp-Y5jVQ": {
    "date": "12/7/2018",
    "text": "Ok i frequent here for lunch and have been holding back. I am leaning towards they have new cooks because my chicken parmesan has been horrible when this used to be my favorite dish with this restaurant.  And sorry but not sorry I don't know this bartender name but he publicly digs up his nose like im not looking right at him smh.  He has done this multiple times while i have been waiting for my order. And just for the record he wasn't my waiter but he disgusts me every time i see him digging for gold",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xBGca5kLN_BtwtCf_DguwQ"
  },
  "mzOaqcJFlf-eWo9WdX6JkQ": {
    "date": "11/13/2018",
    "text": "This is a great place for breakfast/brunch/lunch. Great southern food, very relaxed atmosphere.  Definitely try the cheese grits, they are amazing!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rcEmrPEpCGLZQHotWghwTw"
  },
  "cEFDSJJt2gno_pLxYBKXCA": {
    "date": "9/30/2017",
    "text": "Too loud, apathetic service, and subpar food. I had heard great things about this place for brunch/breakfast, but decided to give it a go for dinner. The waitress got the order wrong (no problem, mistakes happen), then seemed annoyed when kindly asked to fix the problem. The Reuben was too salty, soggy, and barely had any meat in it. Call me picky, but I expect a sandwich to look robust and filling. My dining partner's fries were overcooked with blackened ends. If the food and service wasn't bad enough the place was extremely loud. Literally had to speak loudly to hear each other across the table. Skip this place and go somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TWQ4bxTnfz40cZMFCE2W-g"
  },
  "qIesBqYVrFwFCJSzHm70fQ": {
    "date": "9/14/2016",
    "text": "We have frequented Eddie's Place several times over the last couple of years living in the neighborhood and I'm just now reviewing! Shame on me!  Eddie's is a wonderful spot to come in when you're feeling lazy and don't want to cook, but you want to remain casual with no fuss. The menu is plentiful, there is always a daily special AND (super bonus) there is all day breakfast available. The portions are generous and I've never left hungry. The staff have always been extremely attentive and kind and the restaurant is always clean. It is definitely a neighborhood spot where they know several customers by name and life story but the staff never fails to be warm to first comers as well.   It's silly but one of or favorite things about Eddie's is how crisp the salads always are. Cold plates, chilled lettuce and fresh toppings, and the habanero ranch is an addiction of mine. For those who like to have vegetarian options like myself, don't fret, the red beans and rice dish is one of my favorites here (without any meat added) and they have a black bean burger as well (which you can add avocado on top for just $1 extra).   Overall Eddie's is the perfect neighborhood go to and we have utilized it many times as such. It gets an A in our book with no complaints!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "X86vXWcxSzuCfMJyOnx1UQ"
  },
  "Q9Sfj_BHbQIlBTA23LCPrw": {
    "date": "11/6/2016",
    "text": "I was in town and wanted to eat somewhere I couldn't back home. A friend looked this up and there we were. Must be a popular place. There was a waiting list, about 25-30 minutes. To jump ahead a bit, I'd say the wait was worth it.   I thought I had a large appetite. I ordered the pancakes and added pecans, cranberry, almonds....think that's it. Came with a choice of meat and a side. Had turkey sausage and hash browns. Also ordered a scramble egg white and Mac n cheese off the lunch menu. My friend had their special French toast as well as the chicken sausage soup to go.   I blame the night before but my appetite wasn't what I thought it was. I did taste around the plate. I thought the Gouda Mac n Cheese was going to be runny/\"liquidy\" at first glance. It turned out to be rich in flavor, and was par to my standards. Mac n cheese is always my make or break for an establishment.   I ended up taking the food with me back to VA. The Mac n cheese didn't make it past the NC state line. With everything I ordered, the bill was about $30 or so. There's already been a discussion about what will be ordered next time in town. I see why this place is packed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "EjDt-GOhqEoYSW_F1RlOnA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. French toast. Taste as good as it looks",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EjDt-GOhqEoYSW_F1RlOnA/o.jpg"
      },
      {
        "img_id": "w-myn88MsqfZUZxH2blXTQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Chicken sausage gumbo soup. Might&amp;#39;ve fumbled the dish name. Wasn&amp;#39;t mine.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/w-myn88MsqfZUZxH2blXTQ/o.jpg"
      },
      {
        "img_id": "9NIgWsg88dYh5D4DQmYYNg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States. Pancakes, turkey sausage, scrambled egg whites, hash browns, gouda Mac n cheese. Powdered French toast off in the distance.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9NIgWsg88dYh5D4DQmYYNg/o.jpg"
      }
    ],
    "user_id": "fBFk9D9L_QXawg9Na_w0lQ"
  },
  "0G46uNKymh3TLWs0BJo3EQ": {
    "date": "11/2/2017",
    "text": "First time here, came for the Shea crab soup!! Cozy,  kid friendly and good specials!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "T2CpgG_eTcp3heKwZkjp4A",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T2CpgG_eTcp3heKwZkjp4A/o.jpg"
      }
    ],
    "user_id": "KA7M3PDYtvr8dcMM9cbAkw"
  },
  "40lEz9ANqLAxN8QjF_4p1w": {
    "date": "5/27/2018",
    "text": "I know I have already posted about my exceptional experiences at Eddie's,  but it cant hurt to give it another great review. I have been frequenting Eddie's place a bit more lately and I have to say once again, amazing food, great service as always, and just a comfortable environment, it's a place where everyone knows your name. Branched out on my selections from the menu, and of course, I was very pleased with my new selections and their specials. I can not stress enough how amazing the staff is. I visit many restaraunts but this place is my go to neighborhood spot.  I would recommend this place to anyone that enjoys a laid back diner with all day breakfast as well as a very wide variety of delicious meals, as well as good drink and food specials. Once again, i can not express enough that the servers, bartenders, cooks and management do an absolute amazing job.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3vrsKG5cXuggAS2obv9Ow"
  },
  "9qcw3xq937ZVwfgkmzmyBg": {
    "date": "5/16/2018",
    "text": "While visiting friends of ours in Charlotte we found Eddies nearby and decided to give it a spin.  I agree with the 4.5 review average that they seem to be getting.  They are a straight up honest sandwich and breakfast place with friendly and quirky service.  We enjoyed our first visit and it absolutely earned a second.  My tuna salad exceeded my expectations and the Philly Cheesesteak was acceptable as well.  Wait staff was fast and attentive on both visits and I like local places even if they are small chains versus someplace like Panera.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LhiPNjEaEYwkVHuHcEvLzQ"
  },
  "3n4XmcekbBNGOrrxPh6KTg": {
    "date": "6/11/2017",
    "text": "Found this place on Yelp. Reviews were good thought I'd give it a shot. Plus the wait at midnight diner was ridiculous as usual. The cheese grits are delish and so is the biscuit. Basically coffee and breakfast was awesome and price was decent for the area. Totally coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4Lw_VdgAbIpv8UHs1oPAcQ",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4Lw_VdgAbIpv8UHs1oPAcQ/o.jpg"
      }
    ],
    "user_id": "EVHdguUbXwOrCzQwBs7ISg"
  },
  "6UBBYoUOidN-omGL1Rgouw": {
    "date": "11/5/2017",
    "text": "I have been to this place a lot for late night but this was the first morning I have made it for brunch. It is a very popular brunch spot and now i know why. we had to wait about 30-40 min but it was well worth it and we were able to drink mimosas/coffee/bloody mary's while we waited. i got the eggs Benedict and my boyfriend got the chicken and waffles - both were incredibly tasty and satisfying.  Although slammed, our waitress Michelle did everything she could to give us as much attention as possible while also juggling every other busy table. Her efforts were much appreciated! great place for anytime of the day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mM_PjX97K-1sMGBBdZ7YNg",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mM_PjX97K-1sMGBBdZ7YNg/o.jpg"
      }
    ],
    "user_id": "rMa8gtt_aF39oNCoEEoK2Q"
  },
  "F_l9o3GGPta9hYs6Qie6tg": {
    "date": "2/18/2018",
    "text": "Southern fried breakfast was good. Crispy chicken. Gravy was flavorful. Eggs over easy. They were cooked PERFECTLY! $5 mimosas with a good champagnes orange juice ratio. I will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "usnISSu4sQBjItovM19YiA"
  },
  "sT_vboyZBVh_VaDdv8TRmg": {
    "date": "10/2/2018",
    "text": "This place is ok as long as they are not busy. Seating is kind of clustered. Not ideal if you have a really small children. Food is OK, nothing to write home about. It's OK if you have nowhere else to go. Staff is friendly.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kt3J-u1s6yLgsObSfC68mg"
  },
  "-T-XAXGtKXeA4OckHXkLgA": {
    "date": "4/28/2018",
    "text": "Fantastic food at a great price. Friendly staff, fast service, welcoming atmosphere. Eddies is a go-to for breakfast, lunch, dinner, take out, or drinks at the bar. You just can't go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dg4BGzyl7hAYy9185-yf0g"
  },
  "DYv4-aVxl8PcUzwxygtkqg": {
    "date": "9/16/2016",
    "text": "Can you say scrum de li ish cious without drooling over yourself after eating the salmon over spinach salad lunch special today at Eddie's. .Answer:  Absolutely #NOT. .what a treat what a feat and did I also mention the simply tasty creamy cup of had to be homemade chicken and noodle soup also on the lunch special menu too..If every restaurant had these specials no one would bring their lunch or skip their lunch. .let's just say mmm mmm good!  Just one more thing ok you got me 2 more things..the waiter Jarrett asked me how I wanted my salmon cooked..excuse me come again after I lift my chin off of the table..No Way..some seafood restaurants don't even ask that & for salmon over a salad come on..Very Impressive not to mention the portion size..OMG..winner winner salmon dinner size!!  All under the careful watchful attentive personable & highly accommodating service of the one & only Jarrett",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Fz27ORmZDFenmUli9uaELw",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Fz27ORmZDFenmUli9uaELw/o.jpg"
      }
    ],
    "user_id": "pPKRWw7ADxh8iAot_RVDuA"
  },
  "qGNDsHHmmc4GtfefOEczfQ": {
    "date": "7/14/2017",
    "text": "Chicken and waffles with hash brown. I think I'm in love, \"who is Roscoe's\" is what you'll be saying after you've finished your plate (yes you will eat it all) . If your visiting North Carolina this is a must. Great atmosphere and super friendly staff. Thank you guys",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z_3eolvw1sflILPhJ-FOaA",
        "caption": "Photo of Eddie's Place - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z_3eolvw1sflILPhJ-FOaA/o.jpg"
      }
    ],
    "user_id": "_4IbHM7arE-cBzvJ1_96Xg"
  },
  "HYkkTL3Ofc_NvFpxMXl4fQ": {
    "date": "6/25/2013",
    "text": "Yum, yum, yum!! My favorite meal of the day is breakfast. It's a real treat to go out and get a big breakfast on Saturday morning. eddie's does breakfast right. Service is great and I haven't had anything here that isn't good. Their bloody marys are awesome! Ask for it extra spicy and you won't be disappointed. The blueberry pancakes are my favorite here. They're big and fluffy with lots of blueberries. Expect to wait a while if you come around 10am. There's most always a wait. But it's totally worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wYPwbbIS9q9puGf51Zslyw"
  },
  "0pr_orZwOISS6zvmLHGT2w": {
    "date": "4/13/2011",
    "text": "I'm a huge fan of Mom and Pop places. This one gets a solid 3.5 stars in my book. EXCELLENT and friendly service, homey atmosphere, lots of booths for seating, but the food was mediocre.  I felt a little out of place when I first walked in because this seems like a \"locals-only\" sort of establishment. Once the waitress came up with her super sunshiney attitude, my feelings were dismissed though.  Got the veggie burger with onion rings, things were cooked well but the only buns they had were made from white bread (super ick).  Methinks I'll try breakfast some time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "52BSd0kY8AndWPrybOMMsg"
  },
  "G9MumtwiyeAgIDiEXy8aTw": {
    "date": "11/13/2012",
    "text": "SO DELICIOUS!! and some of the BEST customer service from our waiter Ben. I would highly recommend this place for  breakfast!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "F-TYd6eIvMIyInQrhW6oEA"
  },
  "yI8aGSg4WB5VCfIrJxS21A": {
    "date": "10/2/2015",
    "text": "It's one of my best friend's 30th Birthday today and his favorite restaurant in Charlotte is Eddies. He was so excited to bring 5 of his best friends to eat at a place we had never been, and we were happy to stand outside and wait for a table even though it was chilly and rainy. The host, a tall skinny older man with glasses, took our name, and we waited outside, holding the door for every single patron that entered and exited for the next 30 minutes. At that time, we noticed that there were a much larger number of patrons going in than coming out. We walked in to find that every single party (there were 6 or 8 groups of people that had entered) had been seated and there were no open tables. The host said, \"It doesn't look like things are working out in your favor today,\" and asked us if we had ever been to Leroy Fox, the restaurant next door. The birthday boy restated that it was his birthday and he had really hoped to eat there, and the host surveyed the dining room and pointed and said, \"Well, it's going to be a while,\" and seated the people behind us that we had just held the door for 5 minutes prior. I've worked in the restaurant industry for 5 years and I've seen 16 year old girls do his job better than him, and they could do it while flirting with 30 year old servers and texting under the host stand. Eddies, find a new host/hostess!! We want your food!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TMLroWAiHAxOcYdWzYqsg"
  },
  "OTcjW8QR8FgnnQizkYlQGA": {
    "date": "8/11/2010",
    "text": "excellent breakfasts - you can build your very own fluffy omelet and they don't charge for each item. their breakfast sandwiches are delicious too - i recommend egg, smoked sausage and cheese -mmmmm. The She-Crab soup is truly the BEST i have every had - from coast to coast - utterly divine.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "d2F1gKyvH_cf19ivqysoXQ"
  },
  "g-oHXFgJ4tDnX30cmbLUwA": {
    "date": "12/27/2010",
    "text": "I love this place. This is the picture perfect neighborhood bar with the BEST She Crab Soup I have ever had.  The service is great and the bar tenders are great people to have a conversation with. The beer selection is good and the daily specials are great.  If you are looking for a relaxed atmosphere with great service, look no further.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aTE5NuGeRCTWnwLn8_-sgw"
  },
  "dHD-_KvpFc8LZUywIIhajg": {
    "date": "3/14/2011",
    "text": "Oh how I love a good breakfast place close to my house for those weekend mornings when I just want some delicious food without the hassle of making it and cleaning up. And Eddie's definitely fits that criteria; conveniently located in Cotswold, their breakfast is solid every time. We've been to Eddie's quite a bit, and tend to hit it up at least once on weekends when we have quests in town.   If you're going to try to go during peak breakfast hours on the weekend, be ready for a wait as they offer $4.00 mimosas and bloody mary's (made with zing zang, which is the best bloody mary mix available). The tables turn pretty quickly, but the place just isn't that big. Service is generally very good, and we've never had to ask for drink refills.   Eddie's generally has pretty good breakfast specials, and if you like coffee, it's a-ok. The omelets, french toast and pancakes are all very good. And they offer turkey sausage and great hash browns to round out your breakfast experience.   If you're in the area, give Eddie's a try!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4oSao9GTLxFTurp9NFpE4Q"
  },
  "iPMVD4fdGaSK9jhGXSb3GA": {
    "date": "9/8/2010",
    "text": "This is a solid place for breakfast. I've only had their breakfast items and never ordered anything off of their regular menu since their specials always look fantastic and creative in thought. It's a small place with fast service, strong coffee, reasonable prices and generous portions. I love that they put \"No business meetings\" in between 11A-2P on their menu to prevent people just milling around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "l-tDF960t9BakjyH34XfTA"
  },
  "vxsT6sNzDMVi3SuGcDxUGQ": {
    "date": "9/17/2013",
    "text": "This is a great place for all. Tuesdays--prime rib for $1 per ounce!  Also their shrimp and grits are out of this world.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kl4qWgFHMKuZIKIuWNE6SQ"
  },
  "OBhRHdJclAL_3VvhRFanGA": {
    "date": "9/8/2011",
    "text": "A great local restaurant with good atmosphere, however the food left something to be desired.  Small portion, not the freshest fruit and overcooked fries. But, it could have just been my meal, which is why I'll give it three.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1a0kMc_kMMpugIWCrgGFtg"
  },
  "OrWlIjDej4e3jB9cEXcnZg": {
    "date": "8/22/2012",
    "text": "Always great to be at Eddie's. Never had a bad meal here. Fried Pickles, Chicken Salad, Chef Salad, or even breakfast.... it's always good!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yL9AxnQzSQaEEZ74DnzItQ"
  },
  "63K9WLwcZA_Mg4NXrm0FBQ": {
    "date": "8/21/2012",
    "text": "Well, we were jonesin for some of their delicious french toast and decided to go to Eddie's Pl.  Well, the wait was short, yet it took a good five minutes to be acknowledged. That was a huge negative, but we were craving the french toast and decided to let it slide. French toast was great, but too bad Eddie's gotten cheap and discontinued the homestyle fries-- you now get a 1/2 cup of flavorless and tepid regular ole hashbrowns.They were not even crispy browned. Talk about disa-ppoin-ted.  Eddie's is known for the old hashbrowns, french toast and she-Crab soup!???  Oh well, service was adequate and we could not wait to get the check.  I have never tried lunch, but this visit makes me want to file Eddie's into file 13.  We made a special trip to this side of town, but will only consider going back if we happen to be STARving and in the area. Another one bites the dust...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tlC85J2zsHpnrtHp3qX6Q"
  },
  "Raz7np9-Es0de8IM59C8Kw": {
    "date": "4/7/2013",
    "text": "This is my favorite Restaurant in town!  Great Rueben and the she crab soup is a must.  I always sit at the bar because the bartender Ben is the best at his craft in Charlotte!  Even when he's slammed he greets you and goes ahead and grabs me my usual bud light. He goes above and beyond with his great service.  I just love this place and tell people about it all the time.  You gotta check out Eddie's Place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27lSBbQEK6Ef2-K7cNOEDw"
  },
  "FOo1Sx93mIewfiU8l6aISA": {
    "date": "9/20/2015",
    "text": "Yeah. I tried this place for the first time Saturday and based off the reviews it seemed like it was too good to be True! Well I was wrong. It really is just that good!!! Its a family down to earth restarurant with unsually good food and service! We had Shrimp and Grits, She-crab soup, and The Cajun Chicken Pasta!   Every single item was to die for!! I thoroughly enjoyed it and I got a Shrimp and grits plus another She-crab soup to go !!  If you don't try the she crab soup ,you are SLEEPING!!!!!!  Whilst I was there, a guy beside me in the next booth ordered a bowl of she crab for there , a cup of she crab to go and another bowl of she crab to go. Need I say anymore?? The owner must be from New orleans or something because its not the taste of some restaurant guy who wants to put cajun or creole items on his menu but can't make it taste authentic. It taste like someone that KNOWS what their doing.  MY HAT goes off to the chef(s)!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UK6xVKbsVkRy6U4-1eeLrA"
  },
  "v11JHu66-kHL4X-7N13Y5w": {
    "date": "2/3/2013",
    "text": "I've been for lunch three times.  We had fabulous food every time.  Menu selection is very original. Prime rib sandwich is the best I've ever had. The wait staff is efficient but kinda dry.  Overall this one is a keeper.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUIuiO9wiap0X_Nc0O6P2g"
  },
  "DoiPfTD5OU4zkVxdOamijw": {
    "date": "12/7/2012",
    "text": "Went for the mimosas. The french toast said ciabatta so my friend asked the bartender. He spoke very highly about it so we tried it. To our surprise, that was the best French toast I've ever eaten and the mimosas had a great balance. Great place and I'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dxFFg1uLljJKri8oDIzDzw"
  },
  "m7Vdh2z9jIxpAZPjYh2z_g": {
    "date": "12/27/2012",
    "text": "Good atmosphere.  Have been here a couple of times the food is really good.  For breakfast you can't beat the french toast and I had a burger for lunch which was above average.  Overall reccomended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c4gpWKfHMekz7y6Apio1mA"
  },
  "Bc1zFLutYvHr4zghg4ONxg": {
    "date": "1/6/2013",
    "text": "Great place for French toast with bacon and cheesy grits. Was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "igV-y6sSyJLNglkNg0bcfw"
  },
  "ib0b3pkf-nv2Y8qtLmhEPg": {
    "date": "10/4/2010",
    "text": "The food here was excellent and simply perfect for breakfast.  I would definitely suggest going here to eat some delicious hash browns, pancakes, and eggs.  Good coffee too. I just had a few problems with the environment and service.  I am usually all for alcohol with any meal, but they were being so pushy about having a bloody mary or a mamosa on a Sunday morning.  Eddie's Place is more a bar that happens to serve breakfast.  I just think it works better the other way around.  (See my Egg Heads review).  The price was reasonable and maybe I could give this place 4 stars, but would rate it a 3.9. I still say.. Enjoy and give it a try..  -Ian M.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KsK2VrCDys9hzpT5JMkkNw"
  },
  "wCEE08gXj35O-xKTnpBTRQ": {
    "date": "8/12/2012",
    "text": "I went to Eddie's place for breakfast with my fiance.  The overall execution of the meal was poor which is very important for breakfast in my opinion. The apple juice was cold and delicious. I got a traditional eggs Benedict. The eggs were poached long enough to become hard boiled and the English muffin had no texture. The hollandaise and the ham were both good.  My fiance got the steak and eggs over easy. The steak was cooked just right and delicious. The eggs were undercooked and raw in parts.  The service was adequate but our server did not ask how our food tasted nor did she seem to care that I had two hard balls of yolk left on the plate from the Benedict.  We spent $40 before tip.  I will not be visiting this restaurant a second time.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAzW1iiMS8X0IYilJ2xsKA"
  }
}