{
  "2fvsa56y2lYoTopXp25Ddg": {
    "date": "4/17/2016",
    "text": "Delicious food.(chicken biryani, chilly chicken, lamb korma....)  Friendly staff. Next visit very soon. :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vzR5TRTGMk9lY6iR7iM1ow"
  },
  "eNFX9SAvaShi5HclOyi6Yg": {
    "date": "5/13/2015",
    "text": "Fabulous Indian food and authentic taste. Very helpful staff. Worth traveling all the way from north Charlotte",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kEe2R5eBiETwlRlmCzpy1Q"
  },
  "yEXB_Tu2MtXfwkti5_gAoA": {
    "date": "7/16/2016",
    "text": "I visited this restaurant and the food was fantastic. The kabaabs were really good. Zafran is definitely the place to go to if your looking to eat good kabaabs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2ZMiuy8XG-bDR75zsBeEA"
  },
  "x0fldND0nJ58yvVeS2kdug": {
    "date": "12/22/2016",
    "text": "Amazing experience!  Don't be fooled by the front!!  This place is delicious!! Wait staff very friendly and with an expansive menu, they are very helpful to those of us who are not fluent in Indian/Pakistani foods. Mild or spicy, they will help you find one of many foods to suit your tastes.  We will definitely be back often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQCJsKttJX23pMW4EMc78w"
  },
  "tmr4KHbVtEk99pec4w_LuQ": {
    "date": "12/22/2015",
    "text": "Really tasty authentic hot food you won't be disappointed, with no real decor or ambience, price is not really nominal for dinner...very friendly service give it a try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-P5iAplySALi90QpJi4UQQ"
  },
  "GyAFAK5a2GtAeRZ9gEkRsg": {
    "date": "12/19/2015",
    "text": "\"You don't need a silver fork to eat GOOD food.\"  This quote fits so perfect for this place... I just came for a day in Charlotte.. and searched for Halal restaurants.. based on earlier reviews I made my choice to eat here at Lunch buffet and it was WORTH going here... being in US from past 1 year I have never tasted such a delicious Chicken korma, kheer, biryani, dal tadka... Every dish I had was delicious and awesome. the Chicken Korma reminded me of my home in India.. The place being a small one is kept very clean and tidy... The owner is very welcoming and always wear a smile..  \"A welcome with a Smile is guaranteed\"  overall a good experience and must recommended if you are in Charlotte... :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "841w4rJkx8qK-Lv7KLoo0Q"
  },
  "gzWClLn8lygOL6Xeoo0NQw": {
    "date": "8/14/2016",
    "text": "Phenomenal place- don't let the size fool you- the food is very well prepared, authentic, well priced and incredibly good....thank you for bringing good Indian food to Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fv4DGFDvDCr3N9hcik9R3Q"
  },
  "wy3senPD5sYUdc7jy16w9A": {
    "date": "10/16/2015",
    "text": "Very authentic North Indian flavors. Not toned down but not too spicy either. Naan was fantastic and probably the best I have had in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kxwQtMFeCpy7IsWTE6tKdA"
  },
  "71K4lIKBe34SvOclu85f0w": {
    "date": "8/5/2016",
    "text": "Food was very good but the service was terrible.  We were there for 2 hours.  We asked for the check and it took them 20 mins to bring it to us and when they took the check it took another 20 mins to bring it back to us.  The wait time was ridiculous.  I probably won't go back there for the service alone.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cvUhKRNy3aDpSFFGcIvgYQ"
  },
  "Q0SzMBMBbaAPdJAAoz5-HA": {
    "date": "12/3/2015",
    "text": "Had lamb kabaab, kadhai chicken. Both are very tasty...! Remembered Hyderabadi Spicy food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KSv-Wihg569yFUj1Tvk_AQ"
  },
  "mh9G5vA3FovCJD8wMp9L4A": {
    "date": "5/18/2016",
    "text": "Non-existent service and very greasy food. We called ahead to confirm that we could order from the menu but when we got to the restaurant, we got stuck with the weekend buffet of overcooked vegetables and the previous week's unsold meats repurposed with heavy curry sauce and 3 inches of oil floating on top.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eHf7VBC2ewFLaAb5T9kbBQ"
  },
  "zGsL1H4PSWu70Arac-A81w": {
    "date": "7/3/2016",
    "text": "I thought this food was both different and better than at many of the well known local Indian restaurants.  They certainly use a greater variety of spices.  The saag was very tasty, as was the chicken tikka masala, and the chili chicken.  All in a buffet!  The bhindi (okra) was prepared in a different way than I'd had previously.  I recommend this  restaurant highly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "kstC7AnQ3VCz6-AeQGh4gg"
  },
  "98kZhJbES7Y6go-VsOeRwg": {
    "date": "10/19/2016",
    "text": "Labels items gluten free that are not.  They thought that unbleached wheat flour meant it was gluten free.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hBBrT1J4lL9VUaEACa3mqA"
  },
  "fCj5XePr4KBNpnqWowJAHw": {
    "date": "12/19/2015",
    "text": "Best if you love Indian/Pakistani food  Had been here with few friends...ordered all mutton dishes...and it was just mouth watering.. Not just the non veg..even veg food had unforgettable taste.. We finished with Mango lassi..which was again just yum.. Me n my friends are a fan of this restaurant now and would definitely hop in next time..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "voBxnIkOTyjmIDfXPaNuFw"
  },
  "bKaOT4Fcs9Y93W1meZOkNQ": {
    "date": "12/18/2015",
    "text": "There Buffet is very good..  Its only fair to redo this post.. a The food has improved Dramatically and is fresh..Fragrances are great and food taste really good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Knxyiw3gYvQiFBKClJgRkw"
  },
  "wPRBtVodKgUX1GhKl5JruA": {
    "date": "10/3/2015",
    "text": "I've visited this place twice and I love their food. On one occasion, I ordered from the menu and the other I came on a Friday when they had a buffet. I have to agree with one of the reviewers here that they are consistent in their quality. The food does not necessarily taste like your typical restaurant style food but it tastes a little more like it's cooked at home and that's one of the reasons why I love it.   If you are ordering from the menu, you will realize that they are generous in their servings of meat - you can expect three large pieces. Unlike, many Indian restaurants who just serve one or two. I brought my colleague from work for the buffet and he loved it too. We tried almost everything they had on the buffet. For vegetarians, I'd recommend the aloo gobi and the dal. I'm pretty sure it just appropriately spiced with garlic. Bhindi masala, mix veggie masala were also very flavorful. For meat eaters, I'd recommend the goat biryani. Don't just eat it dry; add some korma curry to it and you would love every morsel you put in your mouth.   I cannot speak for the kababs and that's a shame because the name itself says kabab palace and I haven't tried them here. But I know that I'll be going there again so there is ample opportunity to try their kababs.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDvV6UuRyUKT3DMTOzp62w"
  },
  "wqrIDb3AphT22Mz2xowd-w": {
    "date": "12/5/2015",
    "text": "Amazing and most authentic Pakistani food in the region. Good conversations and clean restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36P2Sy0e4KEKN8WFuomTRw"
  },
  "9jxn34RHDCgwVtnVsX6GrA": {
    "date": "11/2/2016",
    "text": "Excellent Authentic Pakistani Food, the restaurant it self is small and more of a fast food type but it has real deal Lahori food, their kabob and chicken karahi are as good if not better than Ravi Kabob in Arlington VA, just be aware their spicy dishes are really hot. All in all if you want real deal this is it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ePNFlmHzKihOK2a01ZLvA"
  },
  "VjdOUqqp3neq3IJJ32v62A": {
    "date": "8/22/2015",
    "text": "This is a very awesome place. Reminds me of all the food that I enjoyed in Karachi on my visits while I was growing up. This place is a must.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zLJ7smQuzKtXtQUZ6sBxqA"
  },
  "7yOmX_MDjbqR_w9rmICIMQ": {
    "date": "9/26/2015",
    "text": "I have had very little experience with Indian cuisine and this place wad the absolute perfect introduction. I loved that they offered a small buffet option. It was a great opportunity to try a breadth of different foods at one time. It seemed extremely authentic and the owner was extremely personable and helpful. The food was delicious and we will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r2vBXPyVgk0nbnX5OLaxUw"
  },
  "ADT8JjV4ALQyWdGvMPuY6Q": {
    "date": "2/18/2017",
    "text": "We first visited with my dad (who has never had Afghan/Pakistani/Indian food) and he absolutely loved it. He cannot stop talking and raving about the food. It's a bit of a drive but definitely worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_obctikqZbBRBG0iYvYTQ"
  },
  "DtreVJpjZlvoKLDrnfU5Aw": {
    "date": "3/31/2016",
    "text": "I had lunch at this place for the first time and I am impressed. Food (I had the buffet) was amazing, tasty, well presented. I had a little of chicken tikka masala, a little of tandoori BBQ chicken, a little of Afghan rice, salad and naan. Dessert was rice pudding.   The place while small was very clean. I'm coming back for sure to try a pretty wide food offering.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "vr8OlB8sgAS4OutJF7T9QA"
  },
  "hxGfS_dK6yRhA4xnhZysIw": {
    "date": "3/26/2016",
    "text": "First ever Pakistani/north Indian place in Charlotte. Must say, it is good. Took 1 star out because it took more than 45 mins for food to arrive. Service is ok, we had to ask for water etc ourselves after waiting for more than 10 mins at the table.  Now, about food - Tandoori Chicken, Chicken Kabab were very good. Tried Chicken samosa but it disappointed, it was way too oily. Something was terribly wrong with the samosa pastry but the stuffing was indeed good. Kadhai Chicken had some poultry smell, may be because of instant cooking at very high temperature, the sauce was very good. Finally, the naans - Peshavari naan was awesome, garlic naan was better than usual. Mango lassi was good. Salty lassi was light enough to enjoy with rest of the meal without overpowering other flavors.   Overall food here is good, basic spices, nothing too fancy. Liked it.  They can add a couple of kid friendly dishes. Our son did not enjoy kababs as much and there wasnt any other option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "QJKQ0gUJiQOMQQQ3n0-icA"
  },
  "nSM-Srw69WpgKPs1eZqKgg": {
    "date": "7/24/2017",
    "text": "Great food! We ordered take out and they forgot one of the dishes and of course I realized it after I got home. I called the restaurant and told them what happened and they delivered the missed entree to the house...great customer service! Food is legit Indian taste just as good as what's made at home and spicy levels are appropriate! Definitely going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "w_FtiGbXvWK3VcBvKy9g4A",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w_FtiGbXvWK3VcBvKy9g4A/o.jpg"
      }
    ],
    "user_id": "3AXX85RfIUbZJbV6B9UY-w"
  },
  "3mONMCBlVrrWmYa5fI-r_A": {
    "date": "4/29/2016",
    "text": "This place is hidden jewel! I was delighted to stumble upon it. If you are craving seriously authentic Indo/Pakistani spot you should check out this place. It's a family owned business that can deliver on all tastebuds. You can end your meal with soothing chai and it's a great way to close out your meal. They accept all forms of payment.   Whenever I am in the pineville area I stop by to indulge. Please open up another store uptown!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "q0tbmi36X5bFHRLbz6IyrA"
  },
  "4Sybs5Z6zf8VU3OF50KybA": {
    "date": "3/12/2017",
    "text": "Ordered Tandoori, Malai Kabab, Sheek Kabab and Haleem with Peshavari naan. After long wait. . . . Most of item wasn't fresh, stale, dry. Very disappointed after few visit to this location.  Tandoori was cooked earlier time very dry, naan was too cold, malai kabab wasn't proper marinated and use chicken wings meat instead chicken thigh meat. Probably last visit to this location.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PYnzrOLBei72Bn03U7ytEQ"
  },
  "vvetsxudmni5Okvp5Tn5Jg": {
    "date": "5/17/2016",
    "text": "Family run restaurant and it's lovely.  There are images along the wall of you would like to know what your food looks like.  Or you can browse the numerous pictures here on Yelp!  I have never had Pakistan rice or palak paneer before.  Different, but delicious! The naan I ordered came on its own wicker tray which was cute.    Waaaay more food than I could eat on my own.  My server was nice and made sure I was comfortable.  The owner seemed concerned when I didn't finish my food so I know he genuinely cared if I had enjoyed my dinner.  No worries, I loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1OMhlEU4-2z-kC9PMdSnXw"
  },
  "szDL5_aPnW6zDStrWRmx8g": {
    "date": "3/15/2017",
    "text": "Got takeout and this was the best Indian food my husband has said he has had in Charlotte.  I can't wait to try it but he came home raving, and so did his friend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TTqDlTO0VpFaClCOvD6gNw"
  },
  "R2vyIy3RSZd78qdpfUZ34A": {
    "date": "5/20/2017",
    "text": "We loved it!  Amazing service and delicious homemade Indian food made with love.  We over order so we get to enjoy again the next day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUB1Vf-RusAJimS8OfmtEw"
  },
  "3D4XGjL9peH2Trza02hMXw": {
    "date": "5/19/2017",
    "text": "Really bad experience. Ordered chicken biryani for takeout and found a push pin in the biryani.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BlKZRRC3v3utScJGtz8BtA"
  },
  "0jEB9W1geEn9j4bbza2pvw": {
    "date": "3/24/2017",
    "text": "Zafran deserves more than 5 stars for their Kabobs. I generally don't write reviews because of laziness but Zafran's food was amazing. So fresh n so yummy.  Definitely try the mixed grill. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aXkNtVLj5kHY6Aw-6pwCqQ"
  },
  "xVXP-D1YRl-dqhRVQZkqSQ": {
    "date": "12/29/2016",
    "text": "Superb Indian food and wonderful service! Driving in you would not even know it's a restaurant but as you near the door the amazing smells hit you and bring happy feelings to your heart. Soooo yummy! The buffet is incredible. Their use of spices is an art and every time we go to Zafran we are amazed at all the ethnic families eating there. It's really a fun experience. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Xe4T8rsFwZp1PZFhHvfing"
  },
  "x9KPuC4aWTsGNklgxtRLug": {
    "date": "4/19/2017",
    "text": "This is my favorite kabab restaurant in Charlotte. Strongly recommend the Haleem and fluffy Peshawari Naan. Zeeshan is a great host.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKyVc-sUY_l3HkR_9st93g"
  },
  "jPiTbONl0-loFiaR238fDg": {
    "date": "1/20/2017",
    "text": "Best pakistani food in charlotte hands down. Ive had better pakistani food for sure. But these guys are def one of my favorites. Their customer service is also great. Always friendly and professional.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-tlpdLBIMc1_IteY0ft9g"
  },
  "v_ddXa0Nr3yqXG5C_zK_aA": {
    "date": "8/1/2015",
    "text": "This is my second trip to this place and basically consistency in their quality forced me to share a review. Its a small Pakistani cuisine place that if you don't mark it on GPS, you will probably miss the sign.  Food has authentic Pakistani taste!! We ordered chicken korma and Garlic naan during first visit and took buffet during second. Each dish had a distinct taste of its own, unlike other buffet places where they use a common base.  Loved kadhi pakoda- yes Kadhi Pakoda!! and also butter chicken, garlic naan, plane naan, biryani, halwa the most. Beef nahari is also worth mentioning here due to its taste n softness.  Again- 5 stars because this place doesn't claim to be a classy pricey place, its very truly an authentic Pakistani joint and a treat for a north Indian from Lucknow, thats me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OoOzJ3RTKx4VxFVb26VnZA"
  },
  "wF_ncexjVgmEFHlQlyLFng": {
    "date": "7/1/2017",
    "text": "Delicious! Delicious! By far the best indian food I've ever had!! Ordered my food via phone and it was ready within 20 mins. Will be going there more often to try new foods.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1V9aNA-JNGGpMcA4pI4Sw"
  },
  "wh9cK2dVWAJuxw0xTowEdA": {
    "date": "1/3/2016",
    "text": "Awesome food. we have been here several times for dinner and each time the food has been great . Its authentic indian/Pak taste.   We even ordered the food from here for our party and guest loved the food be it veg or non veg.   Free tip : dont forget to have a  great chat with  Uncle and mazzar bhai.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h_U49PSmr6SdxRj7NGK2ww"
  },
  "X6SuFkIuCXIB2CLwZx7cKA": {
    "date": "9/22/2015",
    "text": "Heard good things about this place so decided to try it out. The grilled platter was excellent and so were their beef seekh kababs. The naan were also great. Service was great. Ran by very courteous people who appreciated the business and treated customers like family. Will go back again for sure !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g9i1BBHm468ZIP-DnOKz0w",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Grilled platter. Best thing in CLT",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/g9i1BBHm468ZIP-DnOKz0w/o.jpg"
      }
    ],
    "user_id": "Nhx6ssSxLRdn3cLOh-BPAw"
  },
  "6v8TbnEBE7y92OaZmpy5Pw": {
    "date": "9/18/2015",
    "text": "Truly delicious authentic Pakistani cuisine. I've the nihari, Haleem and kebabs here. Hard to find authentic Pakistani cuisine and this is it.  Be aware even the medium is spicy...more so than most charlotte indian restaurants. But the food is really excellent.   Have not tried the buffet but the menu items are fantastic.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oQ1El_RWDThxlDPaHbz0yg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Dining area",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oQ1El_RWDThxlDPaHbz0yg/o.jpg"
      }
    ],
    "user_id": "oh9jW6gfNYg64CfiSrKgag"
  },
  "9Lp2N-kSqCsNdvuRlcKsJA": {
    "date": "3/11/2016",
    "text": "A very nice and cosy place with friendly people. The food was excellent here .we went for a buffet and the mutton was awesome.completly recommended",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ty3YmQyHb682rcRRg6mjuA"
  },
  "yLo_CMjHVFLkioGJEvcT9A": {
    "date": "7/13/2017",
    "text": "This is a okay place food is okay not great. Kabab are good but dishes all taste funky not authentic taste . All curries taste same . Goat curry only had bones no meat . Biryani was missing flavor and meat same problem. Place looks very shady and bathroom is filthy. I will only go for take out for kababs . Sorry guys u need to improve a lot",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5bkImJ07YlqNvCNsdztijw"
  },
  "8nbvVpr0OnB54cHogAIOOw": {
    "date": "6/25/2017",
    "text": "We loved the buffet here and that's why took the pain of travelling 22 miles just for this. It was dissapoining to see that the food served in buffet was cold, not fresh and most of all not sufficient.very soon items were out of stock. Very dissatisfied",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_arp5dOCWmnsF57cSZvkWg"
  },
  "IHQehUCHJwcAFWDt3SO5zw": {
    "date": "8/6/2017",
    "text": "I walked in as the restaurant opened with my friend who was just passing through for lunch. I just moved to the area and was hoping to find some great places to eat. I was full of hope when a man placing items on the buffet told us to have a seat. I wanted to see a menu and actually place an order. NOPE. I sat there for over 20 minutes talking to my friend. I had to get back to work and because they did not acknowledge our presence in that time span we left. SO sad.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zVVipIky1B0mBySIEHV5xQ"
  },
  "6ZB2_IQ15NFxncx3LE1mGg": {
    "date": "10/8/2017",
    "text": "Delicous food in good quantity. Food tasted fresh. We had tandoori chicken and chicken tikka masala. Both were great. I like their rotis too. They are huge and filling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QUVPyhOhGHVGJkuisNr2ZQ"
  },
  "vdwmyvNyAlYdAIj3_vcRfQ": {
    "date": "6/27/2016",
    "text": "I have to agree with all the positive reviews of this place. We just heard about it recently, and we are fans of Indian food.  This is indian/Pakistani food. The flavours are a little different, but so wonderful.  The buffet is cheap, and everything is great. There are many vegetarian options as there are for those that like to eat meat.  I have to confess, I've never been to India or Pakistan. I'm told by people from these places that this is the real deal.  When I do go there and taste the flavours, I have no doubt it will be like coming to south Charlotte. Truly wonderful. I have a plate of Dal tadka and Chana in front of me right now, and I have not tried better.  Do it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DoIQwK6Ba9q_Hf2LwrXiEw"
  },
  "WoI6kQO1Faplmg1czT1kuQ": {
    "date": "3/26/2016",
    "text": "I have eaten here twice...each time has been the buffet. I have to say that the food is absolutely delicious. Every bite was bursting with flavor. I love the owner. He is very friendly and made us feel welcomed each time we went. I have never tried Indian/Pakistani but one thing is for sure, the food was made with love...because the food was amazing...the use of all the different spices will make your tastebuds sing. This little gem is definitely our new favorite. This place is definitely worth a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vZIf47KS1Mh9TebTVq2JgA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Came on time for their lunch buffet",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vZIf47KS1Mh9TebTVq2JgA/o.jpg"
      }
    ],
    "user_id": "v63K1BrRX2dsJbhGEtOKBQ"
  },
  "sDT74TnzCAl_M0Kai_1CrA": {
    "date": "8/6/2016",
    "text": "WOW again!! I just believe that you can actually transport to Pakistan and India just by eating here. As I saviour the Goat curry, my eyes are closed and I am instantly surrounded by the flavors and smells of food as if I am actually in that country.    How often can you go to a restaurant that the food is SO good, it literally brings you to the origin of the country?  I am not exaggerating when I say this  is a place that needs to be on your bucket list if you want to know that REAL Pakanstani and Indian food should taste and smell like.  For once, you don't have to go to Pakistan or India to experience the food as if you were already there.   Everything here is on spot. I drive 2.5 hours one way just to eat here. IF ANTHONY BOURDAIN should ever come to NC, you must make a stop in here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "z-jOfWRtx1kkzmOdTPuwjA"
  },
  "ODhJUqLfrCby-glsygs0XQ": {
    "date": "8/20/2017",
    "text": "I came for True Indian food, and that is what i got. Their choices of spices used in putting together their chicken tiki masala placed this dish at the top of what almost every other restaurant would serve you. On top of that, their Naan bread made me think i had actually been transported to one of the finer restaurants of New Delhi or Madras.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eJW5ItEXXga3Zk7h7DtQ-w"
  },
  "bNa-XBcxOLI3bl22F0Wn7w": {
    "date": "3/30/2017",
    "text": "Visited Zafran for a Wednesday buffet lunch--first time.  It is in a dingy tiny strip of shops between a car wash and sign printer.    Inside, it had a real 3rd world feel,-- scratched tables and chairs, art was mostly blown up photos of their dishes and an Indian and Pakistani flag.  Just 10 tables.  They only plastic 3-section plates and small paper napkins.  Water was from a jug at the front.  The only visible employee was a smiling fellow minding the cash register in the back.  All of which can be a great sign...or not.  The buffet was smallish, but probably a dozen dishes.    I spent some time in Afghanistan several years ago, and it reminded me of local restaurants in Kabul, and also in Arlington's 'little Kabul' neighborhood.    I joked with my friend, who'd also had 3rd world experience, that if their health rating was over 80, it wouldn't be authentic, and we should go to the American diner across the street instead.    I filled my plate with a spoonful of every dish-- classic East Asian dishes--Biryani, 4-5 curries, tandoori,  naan, samosa, some meat, some veggie, to get a good tasting.  At the first bite, it was like I was whisked back to Kabul.  This was the most authentic East Asian food I'd had in Charlotte--and it was delicious.  This continued with every bite of every dish.  The meats--maybe goat (or lamb), and chicken were juicy, and infused with complex and subtle exotic spices.    The vegetable curries were on par with the meats.  Every dish had a different array of spices,  none over-powering the other.  I looked at my friend, and he gave me the same astonished look I must have had.  This was a True find.  A diamond in the rough.  A place you want to keep all to yourself.  I finished with the rice pudding, which may have been the best I've ever had.  Rich, rich cream base, very chilled to clean the spiced palate, and again subtle spices, that were barely discernable individually, but created a magical taste.    The dishes had a moderate heat level.  Inexperienced souls should stick to the American diner across the street.   There was a heaty mint chutney for the furnace mouths.  The host said they purposely keep it down considering the neighborhood--though we were the only suburbanites in the place (another plus!).  If you need carpet on the floors, cloth table coverings and napkins, go to any of the big name 'me-too' Charlotte restaurants.  This place is all about remarkable East-Asian food.  At $9.95, I was worried that it might be over-priced, but considering the quality--the natural Halal meats, fresh veggies, and the variety, it was well worth it.    It's definitely not a place for people who think of themselves as part of the elite, but if you hanker for an authentic and amazing Pakistani-Afghan-Northern Indian food experience, this is the best of the twenty or so East Asian restaurants I've tried in the Southeast.  By the way, I noticed on the way out that the Health Department rating was a 96.  Glad we stayed, anyway!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "KqrCGy82DjbSB_eWO0qYyg"
  },
  "xEeCApLuNt9LN_QCHYOQgA": {
    "date": "11/22/2017",
    "text": "Kababs are dry and there are no flavours, same goes with biryani as well. The chicken Pcs are so big that it even smells...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "yzqzCii63gXkTB3kV3dvCQ"
  },
  "qn1vZJbDCUseB4AIV1mqtw": {
    "date": "10/25/2017",
    "text": "Thee food here is the best! I would defi recommend their meat entrees! The curries, gravies in most restaurants in the states taste the same. BUT Zafran's food tastes like authentic Indian cuisine I have tasted since my trip to Jaipur, India.   Defi try this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JyM8eFE4cT0AeZc7Hd8eIg"
  },
  "Vf6YuqYwPrijzP_RPlqS0A": {
    "date": "4/3/2017",
    "text": "I have been here twice now. The first time was great and i have no complaints. i ordered the chicken tikka masala and it was really good. went again over the weekend (ordered takeout just like the first time) and when i got home, there was no rice in the bag to go with the tikka masala. called the restaurant to see if i could return to pick some up and was told i would have had to order rice separately? not sure if they misunderstood what i was asking because this made no sense to me. the dish was $13 by itself, and i was supposed to pay more for rice?!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z9QDhlnMjwiu7o9MwRKhgw"
  },
  "N23I3jtwhqCyE5TkAzfJpQ": {
    "date": "3/8/2018",
    "text": "Food quality is decent. However the price and portion size does not correlate with each other. Very expensive for how little food you get.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XEx1A0pYcD-PpJ8BVVeTKA"
  },
  "c9BnB0ni_w7UyhiU3Nwy1w": {
    "date": "8/6/2016",
    "text": "Buffet: we ended up eating the buffet at zafran the secind time around and of course, it requires a review of its own. We were amazed!! Each dish actually tastes different. How many times have you gone to an indian buffet and all the different dishes end up tasting the same? Almoat every time, for me. Well, not this time. Definitely best indian buffet we have had in our lives, hands down. My wife is licking her fingers from the goat curry as we speak. Definitely worth the two hour drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gud1vD76ixJgVerxh3YW5w",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Buffet!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gud1vD76ixJgVerxh3YW5w/o.jpg"
      }
    ],
    "user_id": "31UkXl7q98OjnInz45sN8A"
  },
  "85XAxzFFKYOzZlBoiMoOQA": {
    "date": "2/9/2017",
    "text": "Don't let the name mislead you -- this place has way more than just kabobs. Really diverse selection of authentic Indian and Pakistani dishes -- including a good number with paneer cheese, which is hard to find in my experience. Usually you're lucky if a place just has palak paneer, but here they have options. Everything we had was delicious and the service was fantastic. We are already planning a trip back to sample more of the Pakistani dishes.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2xYSFoRDgR0ZvHON9ENM4w"
  },
  "hn2aesM1oAEFW8D6B-_J9g": {
    "date": "8/28/2017",
    "text": "Delicious food and drinks. Not an inviting sit-down-and-stay-a-while dining room; but, know that going into it. I will be back many times I'm sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8qEvjkiPyO1yi5ksXiIcA"
  },
  "6Zw5OZpgkfHg6TSals378Q": {
    "date": "3/9/2016",
    "text": "Blink and you'll miss this wonderful eatery.  Such amazing Pakistani/Indian food! I had tandoori lamb chops with Afghani rice and it was to die for.  I stole some of my mom's chicken kabab (#18 is the only thing I remember about the name of the dish) and it was melt-in-your-mouth delectable.   The staff is super friendly and our server even recommended a wonderfully refreshing yet slightly spicy green sauce to go with my lamb, which I appreciated that he took the extra time to make sure my meal tasted the best it could.   I'd recommend this to anybody and their mother (mine included. haha).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jLAG4qkpBg3fuwqIWEEI-A"
  },
  "2Ue00_aw-CY8VQY-zL7zMg": {
    "date": "11/5/2017",
    "text": "When my family and I walked inside, the place had people seated but there wasn't a waiter anywhere to be found. The place was filthy, the service was terrible. Even the food was sub-par. Never again.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tmzI6q5bnrON7sApNSEBWQ"
  },
  "DOm-br9Lngmqf-6Smm-s_w": {
    "date": "6/1/2017",
    "text": "Authentic.  that's about the best way to describe it.  Don't go for the atmosphere, don't go for anything other than authentic Indian...  Also, make sure you can handle the spice level.  it's not killer but it's definitely on the higher end, especially for the buffet level around charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3c3aNHGUPDwFZhxCe-p8Ag"
  },
  "6j7fdJheWyo-gU4ye9ylxQ": {
    "date": "3/15/2016",
    "text": "Amazing food! I got take out - lahori channa masala, and afghani rice with chicken kebabs. Also garlic naan with chutney and raita. It's was delicious, especially the channa masala.   The only issue is that I requested chicken biryani and they didn't have any that was \"fresh\". This leads to me believe they really cook everything fresh so I didn't mind. I'll definitely be going again and I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "dM44l_t0nxuge7pxDBpuHA"
  },
  "VPRSJ6EG3crZidKK_X_tcg": {
    "date": "7/5/2015",
    "text": "Here's how's i felt in brief -   * The Best - ( Food )I have tried the kebabs, Garlic Naan, Shahi Paneer, Chicken Tikka, Veg Biryani and Chicken legs. Man i kid you now, some frkn awesome food. From fragrance in Biryani to texture in Tandoori stuff to overwhelming ( in a nice way ) Garlic flavor on the Naans... Dude Man it's what i want to call, \" The Good Stuff\". Priced reasonable. Looking forward to eat my fav Nihari. Guys this is a real place to eat some meat.  * The Good - (Owner). Takes pride in his first initiative. You can tell how passionate he is with the way he explains on how he worked on getting the crew together and how each dish is prepared. How his focus is to make money but priority is super flavorful and delicious food, which he delivers, trust me on that.   * The \"OK\" - (Ambiance) - 3 stars, all for very clean and nice enviorment. Flags and Arabic/Urdu written are intimidating, on your face, loud. Even though i can tell it's with a very noble and harmless intentions.  So far i have nothing to complaint. I promise to keep updating this post if i experience something different, specially something wrong. :}",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r0OJnVlfGFAIB9HXQIXMtw"
  },
  "iQVTIzzgIalBDjTe0phtEg": {
    "date": "3/20/2016",
    "text": "I was looking for an authentic indo/pak restaurant like the Bay area's Shalimar since I moved to Charlotte and this restaurant is as authentic as it gets. I am a frequent visitor here and the Chicken Korma and Chicken Kababs are my favorites. I have taken Catering from here as well and we had a good experience from it as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DvCLTRtKYdPJYC4OW-Ju8A"
  },
  "650yD8e9GX3JYr6EB9tO_g": {
    "date": "7/8/2017",
    "text": "Got chicken tikka and spinach paneer through Postmates. Everything was hot, well spiced and exceptionally delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiAzzcwbtMLlznmeXS63Xw"
  },
  "kuXj7DaRsochYOGX--f8vQ": {
    "date": "3/5/2016",
    "text": "The food is amazing here. Very authentic I tried lamb sheek kabab, lahori chana, naan and lamb haleem. For sure the best kebabs of Charlotte. It's a family owned place and they are very hospitable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YLvEJbJR_-piN9AUzR2RIQ"
  },
  "UA3ftALoFgvNTBfRor-UFA": {
    "date": "7/27/2017",
    "text": "Wast of money and time. I waited more than 30min to get my food. Plus it's like you for two person but get food for one person. There food quantity are way off according to price that taking.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "InXZZAVsimlpp9JyAQQYnw"
  },
  "OmQN2yKMjxuwb-UdDLuUeQ": {
    "date": "6/20/2016",
    "text": "The food was delicious.  Great selection of middle eastern and Indian cuisine.  Delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VGAz2C8JWgZ98B4fXPxs4Q"
  },
  "bBhfe0PuLWRGYZk4WqwMqA": {
    "date": "2/5/2016",
    "text": "Awesome experience. This is a authentic place that should remind you of North Indian menu. If you are looking for a taste of north India come down. The sheesh kebabs are a necessary item to order.  Vegetarian dishes are also awesome. Try the Chana masala.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MGmLygeBjMjxX6pMkRBpqA"
  },
  "Ll109niXFVQbDvLV9BKwiw": {
    "date": "6/3/2016",
    "text": "This is my first time here and i love the food and the customer service. So good food and very clean place. The buffet price is good. Thanks ameer and khan",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsa3SQ3tsEuxV2Ix4cf6ZA"
  },
  "ETit0TBckjCbIC9XPQcBZg": {
    "date": "3/24/2016",
    "text": "This is one of the best by far Pakistan/Indian cuisine I have had in a long time. Great atmosphere, very welcoming, owners are generous, and the food was beyond anything. The food had so much flavor and spices it was very delicious and captivating. This is my third time coming here and I love it. Especially the buffet. Will be coming back for more and having the enjoyment of eating and dining in this fine establishment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "93BXUnv8PsiaFuUjrwYoqw"
  },
  "kQN0hYi6nMbe8oXBQdcnKQ": {
    "date": "3/20/2016",
    "text": "Came here not knowing what to expect. ....  Loved the food.  Super Friendly people with a heart to serve the best home cooked style meals. Their Channa was the best! Kababs were sizzling hot. But the best was their kheer!  (Out of this world) And the owner is the most friendly person you'll ever meet at a restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LureKKxkg9ieae0gAqCO_w",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Kababs!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LureKKxkg9ieae0gAqCO_w/o.jpg"
      }
    ],
    "user_id": "iZ8mM6QI-DzF2zHjbVCaQw"
  },
  "fyVr11dPK-AflGLdfEawHg": {
    "date": "8/25/2015",
    "text": "Not good for dinner. Overly priced for the portions. Unwelcoming ambience. Kabobs tasted good but the curry only had about 2 pieces of meat in it.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WOher7N2oIl0FpByqSoQqQ"
  },
  "QLz-_KAqdGBs-DkZjrdYig": {
    "date": "3/13/2016",
    "text": "I've dined here twice and both times it was great experience. If you've been craving for authentic North Indian food(Veg\\Non-Veg), then you should try Zafran. They have a variety of food at very reasonable price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tTTeQDgc7KDrmFm2C4RI4w"
  },
  "81BwThT1K9qBILcAcyBfmg": {
    "date": "3/12/2016",
    "text": "The buffet is awesome! Love the hospitality from the owners and staff. Tandoori and Mutton Kurma are my favourite. My wife liked chicken Haleem. Peshawari naans are also good. Definitely recommend this place to all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v-ZXdwfVTk-sfzM5Zg7kCw"
  },
  "kpe9dux6mxOEN2yjlVfNeQ": {
    "date": "12/16/2016",
    "text": "This place is wonderful! The food was very tasty, fresh and made to order.  The service was superb and the overall feel of the staff, management/ owners was very warm and welcoming! We ordered the veggie samosas, chicken tikka masala, chicken kababs, garlic naan and plain naan!!! All was amazing!!! Will definitely be going back!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7TTOZtpcvKtPaX2KXn6Ww"
  },
  "DoME9UDN54j8IrT14bmQCw": {
    "date": "2/21/2016",
    "text": "The food is really awesome, its the best food we had eaten in charlotte or i can say NC. Everything here is really delicious... Keep up the good work Zafran and the staff is friendly and nice too.  -Omair",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HX2iCZHcJFZ7BAM-0-mduA"
  },
  "WU28tIQvGJsDvvwldK8Nvw": {
    "date": "7/4/2015",
    "text": "Had a lovely meal with friends while visiting from DC. The kebabs were delicious. We ordered the combo kebab platter, boti kebab, thali, haleem, mutton biryani and chicken 65. Everything was very delicious and quite authentic. The owners were very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ohSVTWfw3hOnlMOVcpHfdw"
  },
  "UBANTvbrnJShPc4RP_twEw": {
    "date": "2/19/2017",
    "text": "We ordered chicken biryani, palak panner and some rotis from new Harrisburg location. Food is low quality and expensive ($32 for 3 items), only one piece of meat and palak panner had no taste. We are not going here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-Ec9gOGOfuMMRwsrnkTLNQ"
  },
  "dbULIPM9GuKO2NWb053wKQ": {
    "date": "8/23/2015",
    "text": "Tiny place. Easy to miss, but unfortunate if you do. Having scouted for good Indian & Pakistani restaurants across Charlotte, for over a year, Zaffran has won first place. They have lunch buffets only on Fri-Sat-Sun. The variety is good and the taste is par excellence. Not too heavy on the spice or oil, the food is delicious. Worthy of mention was the simple goat curry, which was perfectly tender and got over pretty fast. Second to it was the chicken biryani. The aroma was inviting and the chicken literally falling off the bone. Closest to perfection in my opinion. Staff is polite and friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HKbb2728Kz_9BL6OdAW-TA"
  },
  "yETzpbkQ-9Z4pargBTTVUQ": {
    "date": "4/21/2016",
    "text": "Best mutton biryani I have had in the US and chicken kadia and beef kabob were good too. Tip: don't ask for spicy or extra spicy coz we didn't and it ended up being too spicy. Overall very good food and good people and very reasonable prices!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZtM_ln7Tsn075y7RnDTsqQ"
  },
  "4-uJ4Un6cAScoKovep510g": {
    "date": "2/11/2016",
    "text": "Had dinner here, Good food at a very reasonable price. Loved the kebab and the chicken biriyani. Service was prompt and food was served hot. Will definitely go back for more. Would love to try the mutton paya.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hO___8qYy5h_2bY2vHUVcA"
  },
  "N9NxGnavy96RrrUZ6t-P_Q": {
    "date": "3/4/2018",
    "text": "This place serves the best tandoori food I have had. The biryani is to die for. The taste is authentic and I love going to Zafran every time I get a chance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HGvMBICFX6AqgOiocLMjiw"
  },
  "aWngJqYe9ut7OwsMHNcYDg": {
    "date": "1/26/2018",
    "text": "This place is not fancy but the food is tasty. Ordered take out, mixed grill,  which on menu is for two people but it is enough for four people! Generous portions! Spicy and flavorful. It took about 15 minutes on a busy Friday night. Garlic naan was perfectly grilled and covered in garlic. Several people were dining in. Come for the food not a fine dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1bdlfcxV9suUxW5pn9N06Q"
  },
  "x-blHI5Cpmz3D6cmpuChqQ": {
    "date": "4/27/2017",
    "text": "I went in for lunch the other day and ate the buffet. It was fresh, clean, and yummie. Staff is super nice and attentive. All and all pretty good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a_1V82FzpRkYI1tMsBqUiw"
  },
  "df11mKTTWhDGSG1V1r5LVw": {
    "date": "9/29/2016",
    "text": "I've never been to India or Pakistan but I imagine this is what the food would taste like over there. Came here with the family a few days ago, ordered a lot, stuffed myself, went home and devoured the leftovers as well. And I'm glad. I love Indian food. After trying a couple spots in Charlotte that were supposed to be good, I was fast losing hope. And then came Zafran.   So we started with samosas and mirchi pakora. Samosa was good and so was the pakora but my stomach can't handle spice the way it used to. We also ordered chicken kebabs with Afghan rice and I had the kadhai goat and a side of mixed kebabs. All tasted divine. I mean that. Like if they don't serve this stuff in India then they probably do in heaven. A few days have passed since we went and I'm hankering to go again. Oh they'll get tired of my face soon enough.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "_ooWmxUAYxcwJlSbDU86Vw"
  },
  "ryyba5jgJsuPfYQCDOhIrA": {
    "date": "2/10/2017",
    "text": "Came in with a bunch of colleagues at work. They had limited menu and food was okay. The only thing I liked here was the Naan. The other items were okayish. Btw they have a pricey rate for a limited menu buffet. The service was exceptional though.  Verdict: Too pricey for the quality and taste they offer. One time hit",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Tq3I-g_a8AhW-pUUh4OVQ"
  },
  "Vez_n-eytZaNpDQ3NWMKbQ": {
    "date": "8/21/2017",
    "text": "One word for this place.  Disgusting!  Poor customer service and dirty.  Chicken Marsala was not cooked all the way and the naan was burnt.     The floors were so filthy your shoes stick to the bottom of the floor. Cups were dirty, I couldn't even drink the water as there were rings around the glasses.  This place was terrible. 2 people in my group became very sick that night after the food.  Never again will we go back or recommend to anyone!  Nasty!  I wish I could give this place negative stars...",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_n8vjDkzNkFdaI7ExKwR5w"
  },
  "sI62af8bCwQcHG6FOt_bqA": {
    "date": "1/6/2018",
    "text": "Best in Charlotte hands down. The mint cilantro green chili chutney and the Samosa were first-rate. They also offer a lunch buffet which I cannot wait to try! I will definitely be back to Zafran Kabab Palace.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EIaDLanzOyuKj8qONWIwKA"
  },
  "-ZyokFB_Qex6e-jwhHHilQ": {
    "date": "8/15/2016",
    "text": "OMG! Let me tell you I am half Pakistani and this reminds me so much of my childhood!  I am so sorry i forgot to take pictures because I just had to digg in!    I ordered:  - Chicken Tika Masala - ***** (if you are new to this style of food, this is a good starter meal, so good! ) - Zafran Mixed Grill - ***** (this brought it home for me! Good to share dish, you must get this one! ) - White rice - had cloves in it,  if you know Indian food you know this is right!  - Vegetable Biryani - great flavor - Vegetable Samosa - love the crunch - Garlic Naan - this is the real deal  They have a lunch buffet so I will definitely be going too!   This place is legit!  If you haven't been, head out now!   If you want real food this is the place to be!  Tell a friend and heed out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MgnTJOWqpHqLKqZRtLlrCQ"
  },
  "0ycpZsq9sPWzSd9syUbHEQ": {
    "date": "12/2/2016",
    "text": "So delightful! We tried the mixed grill, yum tandoori chicken and the tikka masala chicken. Also tired the mixed vegetables which were so flavorful. Got everything at medium spicy which was so good, but if you don't like spicy def go low. Finally, the two gentleman working were genuinely nice and helpful. Can't wait to try the lunch buffet one day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZYZlTEtSoXL5M5kh1-Fcrw",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Mixed veg",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZYZlTEtSoXL5M5kh1-Fcrw/o.jpg"
      },
      {
        "img_id": "wWSYAdoyCQw5SLo-OfBF1Q",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Mixed grill!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wWSYAdoyCQw5SLo-OfBF1Q/o.jpg"
      }
    ],
    "user_id": "0cTP-u43cMFXaF0WrBWjHQ"
  },
  "476QV-V6xKuNBgLC9SxhxA": {
    "date": "3/6/2017",
    "text": "I am from houston just stop by to have lunch buffet it was amazing and delicious must try",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "plU2NS5h3H0AEHcdVXV2gw",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/plU2NS5h3H0AEHcdVXV2gw/o.jpg"
      }
    ],
    "user_id": "itOPZm43zghmpM0vrfV8EA"
  },
  "9wpN3WGlRZSJHoabUry4CA": {
    "date": "6/29/2017",
    "text": "We tried this place for lunch today.  The food was indeed tasty, but the remainder of our visit left a lot to be desired.  We arrive and walk inside to a mostly empty place and we are not greeted, so we stand there by the door.  I looked around for a sign or something to tell me if I'm to seat myself or wait to be seated = there was no such sign  :-(  There are tables and a small buffet to one side and a cash register with nobody behind it.  It's all old school wooden paneling type decor with large pictures of their food along one wall.  As soon as I begin to walk towards the register seeking some direction on how to proceed I could hear my own shoes sticking to the floor with each step I took... this never makes me feel like things are clean enough because if you're ok with your customers' shoes sticking to the floor in the front of the house, what are you ok with in the back of the house where I can't see?  So we goto the register and a man appears from the back and he seems unsure why we're standing at the counter.  I asked him where do we place our order and he tells us to have a seat and to go ahead and eat from the buffet.  What if I'd wanted to order off the menu?  I guess that wasn't an option?  while standing there we tell him we want cokes to drink and he said he'd bring us one.  Half way through the meal (after I'd already noticed water pitchers tucked away in a corner AND served both myself and my lunch partner) the man brings us each a coke in a glass.  The food here is spicer than usual Charlotte Indian buffets so bringing a drink in the middle is a fail...  we needed that liquid as soon as we began eating so is why I had to find the water myself!  If the water is \"self-serv\", you may want to actually say that to your customers when they place their orders.  I don't go out to eat to end up getting my own food and drinks, if I wanted to serve myself, I'd eat at home and save my money.  The sanitation grade was only a 92, still an \"A\", but not by much considering that if your staff takes a \"sanitation\" class it automatically gives you points on your grade.  The food was pretty good, but not good enough to come back for considering the lack of drinks, sticky floor and zero service.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "zORUQiQiKPneJzuEkvTNng": {
    "date": "6/7/2017",
    "text": "The original location of a now 2 store franchise, this restaurant offers consistently delicious and fresh Pakistani and Indian food at a fair price. Although it's a bit of a hike from where I live, my family and I would make monthly trips to get dinner here before the Harrisburg location opened.   The nihari, chicken 65, and mixed grill platter are my personal favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZlfhsGD1XMi1_S7iBZSmQ"
  },
  "j7GG2jzVosN_yhrKjZIVow": {
    "date": "5/3/2015",
    "text": "This review is for WEEKDAY LUNCH BUFFET ONLY!  Food is Not too spicy. The taste is not like your typical India restaurant curry and biriyani,although it's too oily. Number of dishes in the buffet is too few. The biriyani is to die for, far better than your typical South Indian biriyani. The owner is a very nice and friendly man. The neighborhood is a little shady though. They have only paper plates and plastic silverware to eat with, but some days, they have China and metal silverware instead . The place is really clean though. Worth a try for weekday lunch... Dinner however is a completely different story (in a good way :) ).",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CtqB_yZ2LTOCi-Lfw5g9eg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Veg biriyani",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CtqB_yZ2LTOCi-Lfw5g9eg/o.jpg"
      },
      {
        "img_id": "OU7o4FyocTm_3t1RfWwA2Q",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken karma",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OU7o4FyocTm_3t1RfWwA2Q/o.jpg"
      },
      {
        "img_id": "9Mt9kisKZaLUHCbDCVhhvg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Afghan rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9Mt9kisKZaLUHCbDCVhhvg/o.jpg"
      }
    ],
    "user_id": "seujMdx-wchhPGKYEHNl7g"
  },
  "jz23LrszuQjXXuEgJG42WA": {
    "date": "11/25/2015",
    "text": "This place look decent for dinning and for lunch, Delicious authentic Indian  food that i had after long time, faster service I had mutton biryani with garlic naan Good place for groups if this place is not crowded  Visit visit visit this place your hunger will be satisfied",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "cXg37zYZ9cFkUh7rk9-mnA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken 65",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/cXg37zYZ9cFkUh7rk9-mnA/o.jpg"
      },
      {
        "img_id": "_VhvBXnSMLPE9ZCUOH1apA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Peshwarii naan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_VhvBXnSMLPE9ZCUOH1apA/o.jpg"
      },
      {
        "img_id": "p3e3vwXcfF18GDLF1Y0z6Q",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Peshwarii naan",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/p3e3vwXcfF18GDLF1Y0z6Q/o.jpg"
      }
    ],
    "user_id": "sG-Sm37fmd2U4ArFUsHv-g"
  },
  "a9GXdDImKsQ8iMn4U_TDjw": {
    "date": "7/10/2017",
    "text": "Let me start off by admitting their service isn't the best BUTTTTTTTTTT their food is ON POINTTTTT! Service can be improved but food- that's tough. This place has that figured out. My family originates from the Sindh region of Pakistan and I was sick of the same Hyderabadi South Indian flavored every single indian restaurant in charlotte has. This is super refreshing! I used both my hands and was literally pigging out. If you like damn good food then make your way over here. Just make sure you call before so you can eliminate the wait time or better yet take it to go. Also the owner suggested to come earlier on the weekends, because between 8-9pm it's a mad house on the weekends. The owner was super sweet and knows his food. This has been over due in charlotte, finally we have True diversity. Thank you for sharing your talents with the community!!!!!!!!!!! We will be returning frequently.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uoLGjG1x6MHCn8l1GQJ5fg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Kheer- rice pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uoLGjG1x6MHCn8l1GQJ5fg/o.jpg"
      },
      {
        "img_id": "SdlfSuJZ8Nc9SXBxwzB_hw",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken Tika Masala",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SdlfSuJZ8Nc9SXBxwzB_hw/o.jpg"
      },
      {
        "img_id": "yE0qMFmPXMLjgAVhV6mkhg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken and Lamb Kababs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yE0qMFmPXMLjgAVhV6mkhg/o.jpg"
      }
    ],
    "user_id": "wl2UKfXcam32XCFGIp5NSA"
  },
  "YF3uVJswFKZ3KHoaAvVpVA": {
    "date": "7/23/2016",
    "text": "Very good dinner with my wife and daughter. We had beef kabob with afghani rice, beef nihari and chicken Tikka Masala.   First they were very busy and still provided good and friendly service.   The Tikka Masala and Naan were the stars last night with Nihari next. The sauce was good but just 2 pieces of meat for 12 dollars. The beef kabob and rice were also very good. I asked for spicy but it wasn't spicy enough however I can forgive this when the flavor is good.    I am so thankful for yelp else I would still not know about place.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2_OP4c5pIQcM6u4JhBNlDg"
  },
  "dtEJLopVojrntTlOs3KZUg": {
    "date": "10/29/2016",
    "text": "We love the buffet and my daughter asks to go here every weekend. Nice assorted of rices dishes, curries, deals, and Indian - Pakistani sweets.  Oh, and fresh Indian - Pakistani bread like naan, paratha, and others I don't know the names of.  We brought our friends with us today who thought it was a little spicy but still really tasty.  Quick Tip: The yogurt sauce on the buffet and the mango lassi which you need to request can cool down mouths on fire.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bGyTeVdJhsiD5cyZ5oATjg"
  },
  "DU9bQ8LGRYB282q1qx2gEw": {
    "date": "8/28/2016",
    "text": "My boyfriend and I got tikka masala. He got chicken Tikka masala and I got the paneer tikka masala! Probably the best Indian food place I've been too. We also had the mango lassi which was really good as well it's hard to come across a place with good mango lassi!   The staff was super friendly they even helped me package my leftovers and gave great suggestions. They are awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "U5F2HbCMjsoSvZRpvdTa9Q"
  },
  "45Uo7AundbXEqDiflheCGQ": {
    "date": "4/28/2018",
    "text": "Excellent food!! Perfect spice level and tons of flavor! The staff and the owner are extremely friendly and accommodating!! Love coming to this place. Best Indian/paki food place in charlotte!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KmXKjE-SoW47oWQhI90hDA"
  },
  "CyDJw-KeIBAiItWxUHWFhw": {
    "date": "3/18/2018",
    "text": "Great Indian food! Definitely try the chicken kabob, chicken 65, and aloo paratha! Wish I would have gotten the biryani - next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIvPLjn-K-jyWJF7xd1t8Q"
  },
  "pjJlpn0qUN6QroB5HYArDQ": {
    "date": "8/22/2018",
    "text": "I ordered this restaurant through Post mates, when i received the order there was 2 pieces of very small pieces in each order of my 3 tikki Marsala's, there was no rice in the rice pudding. I was so thankful i ordered extra rice because no rice came with any of the 3, $13.99 tikki Marsala dishes. And then the extra rice I did order wasn't enough for 1 and 1/2 persons. I complained to Postmates and they refunded me only for the rice and delivery fee. I will never order from this restaurant or use Postmates again. I had the worst $88.90 experience with both!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKYA34UBzFpN_l5SnDn9ww"
  },
  "wtiznqvlJiQj8lLmxgJ3OA": {
    "date": "2/24/2017",
    "text": "I seldom give five stars but the food at this place almost warranted it.  We had the buffet and both of us enjoyed it.  The food was fresh, flavorful, with a good selection.  They had some of the best goat  I've had in years.  We went on a Friday and somebody said they had a better selection than during the week The chicken was ok. They had two or three vegetarian offerings. After the Buffet; next to it is a place that has the sauces (yorgurt/green) for your food and also a rice pudding for dessert. There weren't any dishes for the pudding when we were there but the man at register got some bowls.  When you come in there is water pitcher and some glasses for you to get water.  And then just head to the buffet.  I haven't ordered off the menu  perhaps someday I will.    There is one bathroom for both genders.  It was clean and tidy though.    This is a casual place with good food and I am planning to go back someday",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOZRcZ7ERo2MS8odFBfQwg"
  },
  "KscrEHeryKz4bGAPhLpFLQ": {
    "date": "12/25/2017",
    "text": "Best desi food I've ever had and for a great price too! The best thing is how friendly the staff is.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CWgBypx_SG0mbXK9JwENyg"
  },
  "fCWAtnukldJUOtih1pivdQ": {
    "date": "4/21/2018",
    "text": "This was delicious Indian/Pakistan food. The people were super friendly and very accommodating. The service was excellent and the menu was very good. The buffet was a great value. A couple people in our party ordered from the menu and their food was very good too, one dish was ordered spicy and was too mild.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dEqS2JVbxW7s01JdhWzjsQ"
  },
  "cVUvXl0WNHeNgSfPDcGpGw": {
    "date": "5/28/2018",
    "text": "Absolutely awful. The owner was nice enough but the food was disgusting. It was like colored gelatin Indian food. Plus everything was greasy... the Khorma has a layer of brown grease & even the vegetable medley was swimming in oil. Do not waste your money here. Threw out 4 \"meals\" and wasted $47.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y21OnHGL642qh1sEe8spsg"
  },
  "7wYz5cear4mml5NoKwFJ3g": {
    "date": "8/16/2018",
    "text": "Amazing and authentic buffet style restaurant with exceptionally kind staff!! Would recommend to everyone in the area! It's like walking into Pakistan or India! :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGq2MxqeimRcCXzVHpBp7g"
  },
  "UJVj6gqKmtM8k3OO_ao2DQ": {
    "date": "8/12/2016",
    "text": "This place is not for the faint of heart. But for those choosing to open their minds to something that hasn't been dumbed down, this is the place. Just a hole in the wall, don't let the ambiance fool you and remember, it's the food that matters. I was planning on ordering off the menu (kadai fish), but there was enough variety on the buffet, I just got that and I'm glad I did. It's not like every other Indian place where most of the dishes taste the same and have the same profiles. Here every offering shines in its own way. The frontier chicken is loaded with cardamom. The bindhi masala, perfectly cooked and delicate enough to let the okra shine through. But the best part? The goat curry. Large chunks of bone in goat, with tendon cooked down, and a spicy chili curry. One of the ten best things I've ever had in my life.   Again. If you can't stomach new flavors, require attentive service, or will bitch about the amount of ghee used in a dish, this place is not for you. But if you want to get dirty with some of the most authentic (what I assume is most likely closer to Pakistani cuisine than Indian) get down here. I've had Indian all over the world (except for actual Indian) and the US. This place is now firmly at the top of the list.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D980t7M4IuQ0WDbTB1Gy0g",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Goat bones",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D980t7M4IuQ0WDbTB1Gy0g/o.jpg"
      },
      {
        "img_id": "-z_Ev1BeOoCsRsWejw2YaQ",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Bare bones",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-z_Ev1BeOoCsRsWejw2YaQ/o.jpg"
      }
    ],
    "user_id": "OJ0GZT3g_Ihpspw4MUyctg"
  },
  "rLtdbdYEIpu9VixRf22KhA": {
    "date": "10/8/2016",
    "text": "During our sole visit to Zafran, my wife and I were delighted to find this little restaurant full of a diverse crowd comprised of primarily middle eastern families who were seemingly regulars. While that enhanced our overall experience, what first seemed charming evolved into a \"third world feel\" restaurant-wise. Although the sanitary rating was a 91, it had the appearance of being much lower, made more conspicuous by the fact that it had only one very small, dingy unisex restroom near the kitchen. There also seemed to be no air conditioning which is can be quite distracting to us pampered Charlotteans.  Now, the owner was a very welcoming, amiable fellow who obviously had a real love for his craft. Following a 35 minute wait, the food itself arrived freshly prepared and authentic. We had the kabob mixed grill served with onions and peppers but had to order the naan as a side for $4.99. The servers were either too new to offer any advice about the extensive menu that we found quite challenging, or just unable to communicate in English.  Everything was tasty but we have been spoiled by the plethora of other Lebanese/middle eastern restaurants in Charlotte, namely Kabob Je Rotisserie.  It also attracts a diverse following but has also much better bread baked continually in a centrally located stone oven (and included in the price of an entree), much more appealing plating, presentation and atmosphere, and is a much better overall value.  In spite of its obvious popularity, we will not be returning to Zafran. Still, for those seeking an authentic, multi-cultural experience (sans A/C), it is definitely with a try!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "dYhCg4sLQNFa2qY-epq2xQ": {
    "date": "3/11/2018",
    "text": "Would give zero stars if possible. Can't speak to the food because we never got any. My wife and I came in for dinner, no greeting or direction when we came in. Finally directed to sit anywhere, which we did, and then continued to sit for 10 minutes without anyone coming over. There was only one other table in the restaurant, and they arrived after us, and then someone came over to take their order while we still sat there. Not sure if we're supposed to put on a song and dance for service here. Probably won't be coming back, and it's a shame, since the food looks pretty good.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gUCR3z9hXLgVQTqcsRLS_g"
  },
  "j--mXHIKX0fHh1fpIjOpDQ": {
    "date": "1/10/2018",
    "text": "I eat out every 4 days of a week cause I have to travel a lot to different cities.  I have ordered Indian takeout in charlotte throughout the entire week. Today I ordered tandoori chicken, malai tikka, chicken seeks Kabab and chicken biryani from this so called Kabab Palace . Apart from the seek Kabab which was ok, nothing great, I could not eat the rest. The food is Extremely bad, tasteless and the worse thing that the chicken used in malai tikka, tandoori chicken and Biryani was stale and tasted old and yucky.   I am bewildered as to who give this establishment good reviews. These reviews lured me to try this yucky house. If you don't believe me or think I am joking try other restaurants like HBD H at Charlotte before giving this place a try. Try the same dish and you will feel the difference.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eLEJfyzUCWTgEGUPwNyZdg"
  },
  "qc9EuceO1YBTLK3J9ng_pA": {
    "date": "5/7/2016",
    "text": "I really wish I could give this place another star, but it just didn't earn it. The veggie samosa was very flavorful but greasy. The chicken samosa was dry. My chicken boti was really good. The chicken Korma was very nice too. Naan is a separate order. It was cooked correctly. This cost us $28, not including the tip.  As mentioned in other reviews, expect to wait. We were there about an hour. One customer left without getting food after 45 minutes. Another waited 30 minutes for take out after calling in 20 minutes earlier. Both waitresses were new. Ours was good but seemed thrown into the fire. The other maybe never worked before. If Zafran can get food out quicker, lower their prices or increase portions, and train their wait staff, I would go back. Otherwise, no.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "dYXUnKefMPgCdc2t5BgmTQ"
  },
  "d4tASeR7lEOhO2FWy1q6_w": {
    "date": "1/28/2018",
    "text": "Awesome food loving it  Mix grill is awesome  Mutton seekh is awesome  Naan's are best And awesome everything",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sxm93iE17rLEXsMgZTnPbw"
  },
  "Kl9yT_qht7FthcTSxokmcQ": {
    "date": "6/4/2016",
    "text": "What a great little find! This unassuming restaurant in Pineville is about as authentic as it gets here in the Charlotte area. The spices and flavors were so fresh and delicious. And the service was great which sadly is not usually case for other Indian restaurants in the area. The owner and the chef both came out at different times to see how everything was going!  I saw they have a buffet from 12-3 so I will be back soon to check it out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HXV7PMxbfGZv320YDREzLQ",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Lentil soup and lamb kebab.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HXV7PMxbfGZv320YDREzLQ/o.jpg"
      },
      {
        "img_id": "X9_XOtxf76rulMZ6vaR6Eg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken tikka masala and some of the best garlic naan I&amp;#39;ve had",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/X9_XOtxf76rulMZ6vaR6Eg/o.jpg"
      }
    ],
    "user_id": "s5axMW2F8kAJM1CekZ6HVw"
  },
  "giJf5GeEqH267eO7cRKyDg": {
    "date": "4/22/2017",
    "text": "This is the WORST restaurant with WORST customer service. I usually dont leave bad reviews and give each business ample opportunity and benefit of the doubt, but after giving this place three opportunities, I have decided to never go here again.  The Buffet was very cold, the dishes were not being refilled, the naan and puri took 20 minutes to be refilled. Worst experience ever.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ncHjHGCAN3-QwySWy0SNA"
  },
  "zpznvkrh1vPJJe891Fon-g": {
    "date": "4/25/2017",
    "text": "Zafran is officially my new go-to for Indian food. When it comes to Indian, I much prefer the buffet. That way I can get a good try of a spoonful of every item in the line-up. I really enjoy the thorough variety of mostly vegetarian options. If you're tired of eating vegetables the boring American way (raw, crunchy and tiring to chew into a swallowable mass) then Indian food is seriously the way to go.  I've been in numerous times on the weekdays for lunch. On my first visit I made the mistake of not coming hungry and ordered something specific from the menu. It was good, but spicy beyond what I expected. Also, it took a while to get it. All the while I got to stare longingly at the buffet. The next several times I never again made that mistake. On the buffet they always have: chicken biryani rice, chicken tikka masala, pakora, white rice and naan. Plus a few other items. The pakora is usually composed of different vegetables every day - I've seen onions, potatoes and various greens. You can often find palak of some kind with paneer or potatoes for example. Aloo gobi also shows up sometimes which I quite like. At the end of the buffet you can find a \"dessert bar\" with usually three options. I'm not a huge fan of Indian after-dinner items but I at least know that they keep raita there. At the checkout counter they also have the anise stuff you're supposed to chew on after your meal - also not a fan!  The service here is great. The guys are always polite and happy to chat and answer any questions you might have. It's generally a self-serve environment. Grab your own water jug and a cup and just keep it at your table. It's also generally a good idea to clean up after yourself and place used plates in the tray above the trashcan. The price is a bit high I have to admit. It comes to $10 for a lunch buffet during the week or $12 for it on the weekend. I imagine the weekend buffet has more to offer and also more people. The restaurant is almost totally empty during weekday lunchtime which makes for a more chill-out experience. Lastly, they play Indian music and TV for entertainment.  This is absolutely my new favorite Indian restaurant in the area near my new job. I will be a once a week customer for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qjYXOBnladFYhciGBSgAMw"
  },
  "n6vHYFXxew7nUVek9GS2mA": {
    "date": "5/27/2018",
    "text": "They have the worst customer service ever, but solid food though.  I ordered a dish online, they got the order wrong and refused to make it again.  They offered a refund but I had to come back to the restaurant and bring back the incorrect dish as well.  There was no apology or any hint of \"normal\" customer service!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "HFRFQFrx2ZUDmnArN6tBIw"
  },
  "ABsrJKAIt0tnIB8HbUYZ_w": {
    "date": "6/5/2017",
    "text": "The dine in experience has been good but the take out service is bad. Once we ordered chicken tikka masala with peshawari naan and instead of peshawari it was a normal roti.   Next time we ordered haleem and malai boti kebab. The chicken was completely raw.  2 small pieces got cooked and got the char but others were raw.   We don't expect this quality just because its a take out.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P6XDUI6hjSVW0yoC2kpGzw"
  },
  "ODSQuZR0BqCoanKEu4d4rw": {
    "date": "4/3/2017",
    "text": "Lived in CLT for 10 years and never knew this place existed.  I'm back for a work trip and wanted to enjoy some good food and avoid overcrowded options. I'm so glad we gave this place a try. It was DELISH!! We tried several things from the menu and loved them all. The staff took great care of us as well. We are both familiar with this type of cuisine, but they checked in with us a few times to make sure we understood the menu. Give it a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sRqJazR7G4RkFSqpFLx9Dw"
  },
  "UnOool1_xcynoIwSbtOrJA": {
    "date": "1/29/2018",
    "text": "I don't think I ever had worse goat korma in my life. I think they just took it out from the refrigerator and served it. One of the meat was still frozen. I think they accidentally dropped a bag of salt in it. I got the beef nehari and please don't waste you money ordering it. I think it was made couple days ago, it was super slimy. Also got the chicken 65, and it smell so bad as soon as you taste it. It was so hard to chew and tasted like I was eating rubber. If I could give -1 Star I would have. You guys don't deserve to be open.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AJ--8FpwrPnNrkrjxRszCw"
  },
  "RK08bfvUhczrFE3oEuEujw": {
    "date": "4/3/2017",
    "text": "Phenomenal food. And amazing atmosphere. It's clearly and owner/operator family, and they were very concerned we ate well, and kept letting us know when the fresh cooked food was on its way out to the buffet. Even brought us fresh naan.   Love these guys. Can't wait to go again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CsAk2aORYSjhhj1CsUyjlA"
  },
  "xjgulXi-_mUwrGMZ0RUw2g": {
    "date": "5/31/2019",
    "text": "Seriously legitimate flavors and a fantastic variety on the buffet.   This little joint can be found in a small shopping complex that honestly you wouldn't even notice unless you looked for it. The interior is a bit tired and the cafe is small but don't let that detour you because the food is fantastic.   We ventured over for the lunch buffet so we could try different things and there was no serious commitment. Between my husband and I we basically tried everything and all of it was super flavorful. We've found very few places that have stayed True to their roots but I think Zafrans has. The tika masala, aloo gobi, chicken biryani and naan were the top finalists of the buffet. There was also some amazing fried vegetable fritter type things that also carried some unique flavors and the fresh green sauce on the cold side just amplified everything. I wish I could have eaten more.   If you are looking for refined, Americanized, sterile food.... keep it moving this place isn't for your sorry taste buds. By if you want a world of spices blended together with expert skill... stop here and make your world happy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fEovKHxp5sbtsQHSZ3lyxg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Cold options",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fEovKHxp5sbtsQHSZ3lyxg/o.jpg"
      },
      {
        "img_id": "u-HdxiXK4VXoPxlGVz9IgA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Cold options",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u-HdxiXK4VXoPxlGVz9IgA/o.jpg"
      },
      {
        "img_id": "UgnWGiknFUACYEwhuRrbnw",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Buffet!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UgnWGiknFUACYEwhuRrbnw/o.jpg"
      }
    ],
    "user_id": "ST5KHMoxf9d7BDZnfLLsTg"
  },
  "yn_BL4ms0gtG_rBS00RUKg": {
    "date": "2/22/2019",
    "text": "My friend recommended this place for dinner saying they have the best kebabs and tandoori. Three years back I didn't have the best experience so I was skeptical visiting this restaurant but went with it anyway. The restaurant hasn't changed a bit and still the same ambience. Would not recommend a dine in as it is mostly the Regional community and the environment is pretty noisy.  The menu has a lot of interesting tandoori, Kebabs and Roti. Be prepared to wait a lot from the moment you have ordered.  It's budget and the bill came around 38$ for two with appetizers. I would recommend it to my fellow yelpers - try it out!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "u-NbxbNdh7GZGnwxXUitYg"
  },
  "I-NmtJ2VH_DwIbP1WqDMVg": {
    "date": "6/22/2019",
    "text": "Ok food, found everything to be average. Nothing bad but nothing I find myself wanting to return for either. We got the Zafran mixed grill for 2 with some chicken kabobs and beef kabobs all on a bed of afgani rice. Then we also got an order of chicken Tika masala and some naan.  The tika masala was the weakest part of the order imo while the beef kabobs were the best. Maybe if we ever go back here I'll reassess after I try something else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zgz5B0P4LgsUySCqz7jweQ"
  },
  "GjiuFwamzFiCJQxvMp0XSw": {
    "date": "8/5/2019",
    "text": "It seems like Charlotte just doesn't have a lot of genuinely good Indian restaurants for whatever reason. This one is pretty good. Not the best I've ever had but definitely good enough at very reasonable prices. Parking is a definite issue but otherwise, a decent place for Indian cuisine in the Charlotte/Pineville area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qqN02-M7XbSK9T1UhVjQag"
  },
  "jpw4X6t1oGLQtoVN6NukaQ": {
    "date": "7/5/2019",
    "text": "Recommended by a friend , just went there to try the biryani and kabobs. But by now I must say I have tried most of the dishes on the menu. Usually prefer a take out from here. The chicken 65 and chapli is really really good, almost add it to all my orders. Sometimes the wait time is a little more depending on the previous orders may be but otherwise haven't had any issues here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwsZWhs3BCzlOW3dder5aw"
  },
  "1HyZwTJ_4a_i1lO4sqQn5w": {
    "date": "8/7/2019",
    "text": "Loved the food!! Best in Charlotte. We ordered chicken biryani and it was delicious. Would definitely come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ruFnD4H_K75es8j4m3h0dw"
  },
  "NhiORPJHJMER2rqCJtM3zg": {
    "date": "3/22/2019",
    "text": "The most authentic mutton korma I ate in recent times!!! Try there skew Kabab. It's less costlier and testy.. waiting time is high. the food presentation may not be as per expectation.. salad was also not fresh. But the main dishes which we ordered were mouth watering and blowed away all the cons.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m7UlzE9PETia8GAMyZq4qg"
  },
  "6dv51DKhM-WEdqr6OkRG-Q": {
    "date": "8/26/2018",
    "text": "Buffets don't usually have the highest quality food hence I was pleasantly surprised when visiting zafran. Almost everything on their lunch menu was perfect and had a homemade touch to it. Nothing was overly spiced (read Shan masala) yet it was all very good. I loved their daal, okra, chicken tikka masala, chicken karhai and biryani. Will definitely be back next time I'm in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "2QloYxlC6ppRLTfDM4aMYg"
  },
  "4aICrLfQl0buLDvEivcpcg": {
    "date": "9/4/2018",
    "text": "We were looking for a good Indian lunch buffet near our home in Fort Mill and found this gem close to the route to our Drs in Ballantyne. Great selection, well prepared and priced.  Now our go to when we are in the mood for Indian  (which is about once a month). Would go back to order off the menu as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NbW0-kxkoqcjYscAZMTr7g"
  },
  "4U0VmsK0bFdhyC3Xjr-u0g": {
    "date": "10/28/2018",
    "text": "My husband and me drove 2 hours to eat here today 10-28-18, because we have eaten here before and loved the freshness of the food and the hospitality.  When we first came here the food was sizzling and delicious. The last 3 times has been average and today, I am resolved that they are going downhill.   Sadly, we won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZh6IHfSZoWL4yly8HF8Rw"
  },
  "B7gm8atvk7R32MnhYY7qVQ": {
    "date": "10/24/2018",
    "text": "Food is so so good! But they don't always have everything that's on the menu..  They're closed on Tuesdays!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fyn6zEosbK59Vn72YKQlqg"
  },
  "KjMkDlzcgdmQhwLAjhQqwQ": {
    "date": "2/14/2019",
    "text": "I wouldn't recommend this place nor would I eat here again! Absolutely disappointing.. The food on the bar was was never refreshed remaining stagnant. This was such a disappointment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5i-KkuLV7IxsjoJ3nSo32g"
  },
  "duk775fGB8xC-GSFa-QmNw": {
    "date": "11/25/2016",
    "text": "Insanely delicious food ! Seekh kebabs were Delish . Lamb seekh was spicy with lots of green chilli and chicken was kind of mild but still both of them unique in their own ways . Lamb & ckn kebabs were kinda pricey @ $4 and $3 each . Chicken samosa with minced chicken was great but insanely oily .  Kadhai chicken was extremely tasty with chicken cooked to perfection in wonderful spices but it was greasy too . Overall delicious food & great service so I would totally go back .",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "L6-ns9e7Mz77PwY2rZTNXg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Chicken 65",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/L6-ns9e7Mz77PwY2rZTNXg/o.jpg"
      },
      {
        "img_id": "t0DERhhuyejxyoqKfI3ccA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Kadhai chicken",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/t0DERhhuyejxyoqKfI3ccA/o.jpg"
      },
      {
        "img_id": "6xXsaSgeXO1YrcIT9k2CPQ",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Garlic &amp;amp; Chilli Naans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6xXsaSgeXO1YrcIT9k2CPQ/o.jpg"
      }
    ],
    "user_id": "a940ta3ya525SSPApjGuZg"
  },
  "jYxQFzFeve2kdmVyr5TJ6g": {
    "date": "7/1/2018",
    "text": "I love the chicken 65, chicken tikka, tandori... I could go on... And on...!!   I've only had delivery and take out but the order is always correct, on time, and amazing!   The rice pudding has amazing spices I wasn't expecting- so refreshing and all of the naan is a must try!   Rice isn't included, which I always forget, but never need so long as I have the amazing naan!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qolJ3yHjNtQIlI0JD1xyRQ"
  },
  "2CpAWjwP1kfNY6EuxVuWyg": {
    "date": "9/23/2017",
    "text": "First off let me state that this is a PAKISTANI restaurant NOT Indian! There's a big difference between the two cuisines. And chicken tikka masala is neither Indian nor Pakistani! Rant over...... So back to the food, we ordered the mixed grill which has a substantial amount of meat on it! And 4 delicious kebabs. They are so most and flavorful. The chicken pieces were really juicy too! We also ordered the mutton achar, which was good but I didn't get the real achar taste. I'm used to a stronger flavor I guess. The garlic nan's were huge and definitely tasted like garlic! I also ordered the beef keema nan which I have to say, after scouring Pakistani and Indian restaurants across the east coast and mid west is the best I've found! It actually had a decent amount of meat on it. It could have been cooked a tad bit more but was good nonetheless ( nothing beats mum's cooking! ). We finished the meal with the gulab jamun's and the chai. The chai was the best I've ever had in a Desi restaurant, flavored with fennel seeds and not overcooked like in most places!  Will definitely be coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0wbN-ODotYo9_ojk8Y3Mfg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. The masala chai... delicious!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0wbN-ODotYo9_ojk8Y3Mfg/o.jpg"
      },
      {
        "img_id": "2xmw-dXMJTUUR0sVR6VJwA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Gulab jamun&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2xmw-dXMJTUUR0sVR6VJwA/o.jpg"
      },
      {
        "img_id": "m9-hybvv_sV_5OaGj_7h7A",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. The keema/minced beef nan",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/m9-hybvv_sV_5OaGj_7h7A/o.jpg"
      }
    ],
    "user_id": "0wHCDvbS_i4xDr62z8w18w"
  },
  "T_pLZt4tY_LKfSptPzZ37Q": {
    "date": "1/9/2019",
    "text": "They have a wonderful lunch buffet!  They change out the dishes served at lunch so you are not guaranteed to get the same buffet menu on each visit,  which I think is great.  I was able to try a great many dishes and they were all delicious.   There are vegetation and meat options.  The staff is always kind and the restaurant is usually quite. Good spot for a quick and relaxing lunch.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8xjcOKb12wZQ1XPKnW6ITw"
  },
  "9ubbDvYIgsC9w7aWctRP8w": {
    "date": "8/2/2016",
    "text": "I had to update my review for Zafran's after last night's chicken tikka masala takeout. We just ordered a chicken tikka malasa with a Peshwari naan just because we were close and craving Indian food. We got home to find a thick, viscous layer of pure OIL on top of the chicken tikka masala. GROSS....I have eaten a lot of Indian food but, this was the first time I have seen this. I sat there spooning oil out of my curry for a good 5 minutes and even then, I couldn't get it all. BLEH...The chicken tikka itself tasted ok, it was just an illegal amount of oil.   I doubt I'll be back.",
    "rating": 1,
    "rated": {
      "funny": 4,
      "useful": 2,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "4LZQoffb-0IIGpB0g_z_Tg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. The oil I drained from the chicken tikka masala!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4LZQoffb-0IIGpB0g_z_Tg/o.jpg"
      }
    ],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "yiE6XSkHOSBgVn_5rQlPWQ": {
    "date": "4/16/2018",
    "text": "Truly a hidden gem! Everyone was friendly and treated my son and I like family. Plus the food was AMAZING, I ordered the Chicken kebab with afghani rice. It could feed a whole family! I can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "W2lrssaB6zNrTjBuD2AFqQ",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/W2lrssaB6zNrTjBuD2AFqQ/o.jpg"
      }
    ],
    "user_id": "udk0lm4PX8CtXslteS-PDg"
  },
  "dxckAEMaTuZavPXVCw9ceQ": {
    "date": "11/12/2018",
    "text": "I have eaten dinner here once before, which was delicious, and I had their lunch buffet today. The staff is extremely welcoming, the restaurant is clean, and the food is fresh and tasty. It's one of the best prices around, at $10, for an Indian food lunch buffet. I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i6_4cvcGdAAbBZi-bsyqEg"
  },
  "8KzLskOx1luiYPMR6-6JKQ": {
    "date": "3/30/2016",
    "text": "I've passed by here so many times without noticing it. I saw on here that the reviews were awesome and had to try this place out. There is parking up front but also in the back. We had to park in the back. We came on a saturday at lunch time and they were pretty busy. It's a smaller restaurant so it was crowded.   When you walk in, it's chaotic. We didn't know if we seat ourselves or if someone else did. We didn't see anyone that was available to ask. We ended up getting a booth. There is a water station where you get your own cup and water. They do have canned sodas as well. We saw someone at the register and asked if we had to order the buffet or if we could just go and he said we could just go.   They have a smaller selection in the buffet area but everything they had were the popular items so I wasn't disappointed. I usually just eat the chicken tikka masala and the tandoori chicken and they had both. The tikka masala was pretty popular. I had to wait for more to come out because there wasn't any chicken. The tandoori chicken was awesome. It was honestly probably one of the best I've had in charlotte. It was fall off the bone chicken and it was just delicious.   After we got done eating, we paid at the register and went on our way. Overall, pretty pleased with this place. Now that we know the ropes around this place, it won't be as chaotic to us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QYI9IFzDXzbJyFRLAo4qLQ",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QYI9IFzDXzbJyFRLAo4qLQ/o.jpg"
      },
      {
        "img_id": "RWBurVz0tDgEG1aaOEhv1A",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RWBurVz0tDgEG1aaOEhv1A/o.jpg"
      },
      {
        "img_id": "Mrd6_70nFLb7ixaFelJuVA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Okra",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Mrd6_70nFLb7ixaFelJuVA/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "LL7DxpvL3XQNDXcQNuoxvg": {
    "date": "5/1/2015",
    "text": "Must try this new restaurant! Great menu, reasonably priced, very friendly Owner and Staff. Very authentic Pakistani & Indian cuisine!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0S0IsuC3_urkLrBFOleZqw"
  },
  "cRDJD_GtsHwvEXdU60VnXA": {
    "date": "5/5/2016",
    "text": "We came here while we were in town for the Wells Fargo championship with a few players who wanted Indian. One being from Bangalore. The food was amazing. Totally authentic and made fresh to order. Not a fancy setting. The owner was able to speak to us about everything we wanted to try. We started with the lamb kabob and a few different nan breads. Then had the lentil and also a few paneer dishes and also the goat. Delicious food. Great service. Nice people. Would go back again for great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iJZrR57i-4gVSqI-5Kk3mw"
  },
  "_mbSVABtNkH6Bl9tZa2ORw": {
    "date": "4/23/2016",
    "text": "Delicious food- love the biryani which is the best in Charlotte.  Kadhai goat and kebabs are excellent as well.  Mr Khan and his family are great hosts and provide an extremely warm and welcoming atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WlPQYp1Pba9FLy3QwuT4ww"
  },
  "tx6QApdBVqRmbmW5za5UHA": {
    "date": "4/10/2016",
    "text": "My boyfriend and I just visited Zafran for the first time. I had the buffet and he had beef kabobs. We were both extremely pleased with the food. The staff are amazingly nice and accommodating as well. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qgzc2XEMDSNf51-iA6JJRg"
  },
  "WCJ7ROjYMtf1bX6IMUvYsg": {
    "date": "3/19/2016",
    "text": "Really enjoyed the food at this place. The food was authentic and extremely tasty. I am a vegetarian and enjoyed the paneer tikka and channa masala. I hope  hey continue to maintain the great quality of food here. Cheers to some authentic Indian/ Pakistani food in the South Charlotte area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HI4wfWoiTpK14jLrLm24Hw"
  },
  "k83IkTBh_kmCvUPfOmx-Dw": {
    "date": "2/26/2016",
    "text": "Excellent mixed grill platter, True Pakistani flavors. Big fluffy naans and delicious podina chutney",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YaoOB5hr5Rg8iTi0_vUn2w"
  },
  "q2GOGSF_VA9l55-wuEVjfw": {
    "date": "4/20/2016",
    "text": "Great Authentic Food ! Very tasty.. Love the hospitality !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-bpbySvNzDqefLuc7wCsQ"
  },
  "_5duPX861Asjw_OboiPp9w": {
    "date": "4/3/2016",
    "text": "Awesome food...loved chicken  Briyani, dessert we have buffet. Will definitely try from menu soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wR8W-8-JJknpMrcw1hBfg"
  },
  "2p88GF2se5mHGSHK6hrh6Q": {
    "date": "5/12/2015",
    "text": "While staying in Charlotte for a night, we were directed to Zafran for traditional Indian cuisine, serving halal. We ordered Chicken Karahi, a tandoori mixed platter, biryani and naan. The meat was flavorful and well cooked. The chicken karahi was spicy, which is how I prefer it. The naan was lightly buttered and yummy. The chicken biryani was spicy and delicious. Overall, the staff was extremely friendly and warm. The owner especially was very hospitable and offered kheer (rice dessert) and tea as a bonus. The restaurant was very tidy and clean with plenty of seating, if you prefer to come in a larger group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "q2tWOjSKZ9r_qHuSUpo2sw"
  },
  "cpDWI_zV5gmho72iMfVZQQ": {
    "date": "9/3/2016",
    "text": "Definitely a small restaurant in a small strip mall.    We went on a Friday night and to their credit, when we got there, no one was there.   Shortly after we got there, the whole restaurant was full.   The good:  the Naan is outstanding, served hot, nicely flavored, etc... Probably best Naan I've found in CLT.  The chicken tiki Marsala was very good, nice depth of flavor.   The samosa were nice and seemed fresh made versus frozen.  The chicken tiki boti was so spicy, I could barely eat it.  Had it been served with rice or rialta, I probably would have enjoyed it more.   Instead, there was a watery cilantro that just didn't cut it.  We ordered water and couldn't get a refill if we had been on fire.   Twice I got up to go find a pitcher myself.    I can forgive some lax service for small mom and pop places, but this went beyond.   I might go back for take out and give it one more try, but it is definitely not worth the sojourn to this out of the way strip mall for this mediocre experience.   They do have a wide variety of afghani/paki/Indian menu, so perhaps they offer that what you can't get at Saffron or Chiaputi.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tYWFPPuGH3XY-9XteZEKzQ"
  },
  "jjwv7tkGh1k7sUljJSDFaw": {
    "date": "2/14/2016",
    "text": "Got a chance to visit this Halal restaurant. Loved the food and ambience. Decently priced. Had loads of variety of both veg and non veg in the weekend buffet. The chicken 65 was just too tasty . The Sheesh kabob was awesome too! Would definitely visit again. Worth every penny!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FvVR4GsDmK6fTQZ_bZhAvA"
  },
  "82n3Zvg4QKQEs0WHtJtH6A": {
    "date": "8/2/2015",
    "text": "Absolutely amazing food. Pretty cheap also. A very North Indian taste to it. We ordered biryani and kadhai chicken. Pretty good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0xQhL6w1393db_NMbeYSrA"
  },
  "89Frf8e6uo9DbCm7T-ETpw": {
    "date": "7/2/2015",
    "text": "We visited the place last weekend the food was very good. We ordered chicken tandoori chicken biryani and garlic naan everything was good especially garlic naan. The owner was very respectful. Chicken biryani was yummy. The place was super clean",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P1-Ayao2KcwHUUf9wlk2hw"
  },
  "Q8G7LAK1I4BV4fu9dI7NoQ": {
    "date": "9/18/2016",
    "text": "This place is fantastic!  We discovered it yesterday, had dinner and went back for lunch today. Guess that speaks for itself.  If you like Indian or have never tried it before this is the spot for you. We travelled across town but it was totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhx0LnokM0hsGJn5zRY2Qg"
  },
  "GjbRfmyScYRuG4rou0NF5g": {
    "date": "4/7/2016",
    "text": "Very good food and service! Authentic Indian and Pakistan food you MUST try! The staff is super friendly. Garlic Naan is a MUST TRY item( they serve a pretty large potion)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "VTscZFiKXQSE02xrZWHtHw"
  },
  "6EHTMzo9KmjNSy2KQsZ-qA": {
    "date": "11/11/2016",
    "text": "Best chicken tikka masala I have ever had anywhere. Can definitely tell it is made from scratch. Killer mango lassi too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v7WRaJG1BsenrQ-AiRC0Rg"
  },
  "NuVt7vD0O_5YlqO_wCWWBA": {
    "date": "8/24/2016",
    "text": "Decent food but pricey for what you get. It's also definitely not a kabob place like the name would suggest.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qFC_ksWOW5PpppKGeA9XGQ"
  },
  "ZjOSSGTQznhSrALMxsVtvw": {
    "date": "9/16/2017",
    "text": "Amazing food and great service. My family and I ordered the biryani as well as the chicken korma. Very tasteful and definitely our go-to Indian food in the Charlotte area! We go there almost every week now!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4bz6lcZnZHU_-MtJx7or9A"
  },
  "lov8ovnKF-0GtEgC9zRfJg": {
    "date": "3/20/2016",
    "text": "only went once and tried their zafran chicken biryani, regular naan, raita, and chicken 65. Everything we had was delicious, the setting was very home-like and the customer service was great. The chicken 65 was spicy but alright for us, but it may differ for anyone else, as well as the biryani was very flavorful and the chicken was cooked to perfection. Great experience and probably would return if we lived closer to Charlotte, NC.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M2Gu1Tk6Yb9zB-M89iQung"
  },
  "CKF_stnlJUa2zgfa3SjMyg": {
    "date": "5/21/2016",
    "text": "Once again yelp saves the day! We were in an unknown area of Charlotte and in the mood for some Indian food. This place had good reviews so we decided to try it. We made it just in time for the buffet which had a nice variety of food. They were very accommodating and let my wife order off the menu. All the food was very tasty and fresh. Most dishes were spicy so beware if you have a sensitive stomach. If you're in the area try it out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CiEtcBnJv2d2eGqT-NMAFw"
  },
  "qbmNUrRmGE0kkqLygJpjNQ": {
    "date": "6/4/2016",
    "text": "Terrific. I've eaten a lot of Indian in my time and as for Charlotte this place is up there with copper. I wish there were more of these places around. I wonder if they franchise? Great service, food was delicious and prices were reasonable. OMN!! Oh my naan. The garlic naan is the best in the city. Served whole, thin and crispy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sxffa2w_sdX6L9ViK1_kmA",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sxffa2w_sdX6L9ViK1_kmA/o.jpg"
      }
    ],
    "user_id": "Muxme8vWhEjZ2eLxGJdrCw"
  },
  "OW-QxYYXDC0US_4LjDqhZg": {
    "date": "10/2/2016",
    "text": "Very friendly. Service was on the slower side but the food was worth it. Very authentic and flavorful. Large portions as well. Hope to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6DpCbP0SXcusEoxPBCSiWg"
  },
  "f47d5UVzde8bsLZ0CN4F3g": {
    "date": "10/28/2016",
    "text": "Excellent!!! Perfect if you are looking for authentic cuisine and a staff that is willing to help you select the right dish. Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "khpbdHjABtk7Hhq0C08g7A"
  },
  "yFUSVYmO98etEffnr2zjhw": {
    "date": "2/29/2016",
    "text": "I came here looking for haleem, and they did not disappoint. Incredibly friendly owner and staff. The food was nuanced and delicious--even better than the Pakistani restaurant we used to frequent in the DC area. I only wish I lived closer! But it was so good that I will be making the trip to Charlotte again (and again...) just to eat there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "jvURI1B_UShKPqqgSTA0gg"
  },
  "flbDIvkwieW3ppyujsdy9A": {
    "date": "3/11/2017",
    "text": "I didn't care for the food. Decent customer service and looks like a hole in the wall authentic kebab house. However everything was insanely bland and amateur. At least it is not too expensive so didn't feel like a whole bunch of money just got wasted.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xU8G7UpRvNIX5_Mo6fD1xg"
  },
  "gXVWyKV_E-BMPjvAxtUdSA": {
    "date": "2/16/2017",
    "text": "Service is a bit slow, but the food is so good that it doesn't matter. I've had a sampler plate (which proved to me that everything is delicious), garlic naan, saag paneer, and paneer tikka masala. All were well-flavored, not overpoweringly hot, and the portions were ample. This has become my go-to for Indian and Pakistani food.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0UOUnwKQ7yhCxWD4JJKZgg"
  },
  "07DnsDXp-ouQlA5Ykaey6g": {
    "date": "6/29/2016",
    "text": "Kababs are awesome..so is Goat Kadhai. Haven't tried other stuff yet but these are must try if you are visiting this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xEfUndKDJNXAoBr707qrZA"
  },
  "iS6mAM0LsanoQRqT7NN0KA": {
    "date": "6/27/2016",
    "text": "Nice time. Our family went and enjoyed the food. Our 70 year old mom ordered a dish which was a pretty hot dish- would have been nice if waiter warned her and even nicer if they would have taken it off the bill after she said she couldn't eat it.  Not good for large groups, lack of space.  Would go again- saag paneer was out of the world!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olbyKwslpFYebZgudDIfgg"
  },
  "sUGXFv6rkruyG-AwA0I6nw": {
    "date": "6/25/2016",
    "text": "Finally some authentic Pakistani food in Charlotte! We had the mutton biryani, chilli chicken, beef nihari and the garlic naan. The naan was so fluffy and just melted in your mouth. The curries and the biryani were so flavorful.. Be prepared to wait a while as most of the food is made from scratch.. Great place! Already planning to try something new the next time I go in there!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_ztFpdzz7XLkeyC6JuYcg"
  },
  "_-a_9sjTQfwHEnDrJcM6Fw": {
    "date": "6/22/2016",
    "text": "Ordered the chicken samosas and chicken biriyani. Quantity was ok, but the taste was authentic North Indian biriyani. Not too spicy as the way we have in the south of India. This being a Indian Pakistani restaurant , the taste being closer to the northern part is not a surprise. Liked the place and would return to try the afgani rice with chicken!!!  Rating it 4 stars Coz they actually take 30 mins to serve. To be fair to them, they do mention that in their menu abt the wait, but I feel they could improve in that department.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1hyitzfoMjl_G_ud5_ewZQ"
  },
  "CxJpmdnqTRyV9OxHgg2_FA": {
    "date": "4/23/2017",
    "text": "Excellent authentic Indian and Pakistani food. The owners are also down to earth and very caring. The Sheri Kebab, Briyani, Mutton Karahi are the dishes one could die for...Awesome food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "es7k8hQGovpFM1eAEdni-g"
  },
  "zCF8VK5HH_p4CRng1h9DSQ": {
    "date": "8/9/2015",
    "text": "This place is beyond and above ..the food is awesome the Sizzler plate was unbelievable you have got to try this place..and Ya the portions were huge ..can't say enough real tasty food awesome service..authentic Pakistani food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5YRjci2BcAR5oYbxKjIpnw",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. To go",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5YRjci2BcAR5oYbxKjIpnw/o.jpg"
      },
      {
        "img_id": "DlmrQZOhKXXRNzSrZPha5Q",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States. Sizzler plate with naan",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DlmrQZOhKXXRNzSrZPha5Q/o.jpg"
      }
    ],
    "user_id": "7ztlAR_KqweosPr6vzLOOg"
  },
  "q9ebZHXpASj1b3Id68lGIg": {
    "date": "11/9/2015",
    "text": "Awesome place. I love all the items on the menu- be it veg or non veg. Anyone who is North Indian would love the food here - people are very welcoming. I went (3 times ) when they were closed but still they let us in. Quality of food is good and it's super delicious. Highly recommended.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCankZ9EKpyD6ehG_MrWFw"
  },
  "dZeS83dstYjWGme4QOB42Q": {
    "date": "11/6/2016",
    "text": "Not as good of a food as I thought it would have. Limited options in a buffet and service is lagging. Cramped up seating arrangements adds up to the woe.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lPRl7IPq2oh2ja2nyWaoNg"
  },
  "v5hKBFiWiX2n-Y9GR9lskQ": {
    "date": "12/21/2016",
    "text": "Pick anything in their menu and you wont regret it. I'm a big fan of Indo-pak style food and I'm glad that I have this place around.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6baUyp9Xm411wwFYvynvXQ"
  },
  "_ze7LbbKODfx98SEUuut1w": {
    "date": "10/14/2016",
    "text": "Was decent food but not worth a $14 lunch buffet.  Most of the food emptied while we were there and never filled it up.  Would not recommend this place over other buffets.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jMGT9yTekqz5yPbhEypKZg"
  },
  "Ilc9TYzFzFa2I9w5H93lrg": {
    "date": "8/26/2016",
    "text": "If I have to wait an hour and a half for food, it better taste like Iron Chef India made it. However, the food was just ok. No one greeted us at the door. No one gave us a table and we just randomly say down at one of the booths. Do these people get too much business that they just don't care?! So we ordered the popular mixed grill. Judging from the reviews, I thought it would taste like the best Indian food I've ever had. Sadly, it was just ok. Everything did taste grilled and it was a mixed dish so the order didn't lie. However, it was pretty bland and needed seasoning. The wait really killed it for me. An hour and a half?!? Please.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dCoqExlEUetmq-txBLLjCA"
  },
  "2EQXe6_6RLibcathWNAg9w": {
    "date": "10/31/2015",
    "text": "A great addition To Charlotte. Better than any S Asian restaurant I have tried here. Food is at par with many of the NY and SF hole in the walls.   I do take out frequently from this place  What's awesome Kababs, Kabab rolls, Chicken Tikkas, Biryani totally rocks, the Naans, Parathas - some of the best.   If that was not enough, Mr khan is quite a gentleman and a great host. I always get offered multiple cups of tea (free of charge) while I wait for my food.  What's not to love",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kRBmKxYXb2A4w9BNZqJ5Gg"
  },
  "TlcBv389kgLxmnTKBom2Jg": {
    "date": "8/31/2016",
    "text": "Food was amazing and very authentic! Service was great. This place makes you feel welcome and at home, like family. Will definitely be going back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OrMJ1-kH-3ixMUoCbd8YjA"
  },
  "LMPfeIpO5mqQC5--zxX4KA": {
    "date": "8/5/2016",
    "text": "Great food and even better service! We got there during their break but they still let us in! They brought out fresh warm naan and really good kabobs! The buffet is pretty great too! The staff way very very nice and helpful! I was pleasantly surprised and will for sure come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OeGMDVZPyyqUJZZfZp2Xpw"
  },
  "bTmv1patrAX30MzM2K6QQQ": {
    "date": "8/5/2016",
    "text": "Best indian pakistani in the US. The kabab had an authentic  taste the qorma was light and spicy Service was excellent",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "z09f0WNYMVtDE3fiu9FkRg"
  },
  "zyIrrozWmxqlEqxc238fpQ": {
    "date": "6/13/2015",
    "text": "I went for weekday lunch buffet. It's not so tasty and very limited items.All times not are not like fresh made, chicken biryani was dry. Less options for vegetarian folks.The owner is really and good hostility. Suggestion for management please  change the chef or train him to make some flavor food.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtGVRVAT7D3Gbx5usDW0EA"
  },
  "aMGTMuXcYDzaHjAERUf4OQ": {
    "date": "4/7/2016",
    "text": "87 Health Code Rating. Walked in. Owner was yelling at the top of his voice at an employee telling him he was not family but a helper. Owner then came over to me and said hello with a smile. Comical. Oh. Did I say 87 Health Code Score. Disgusting!!",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PN6lYym62G8NAaXgbMaSpg"
  },
  "vkadSCRDGlozVw_TScemPQ": {
    "date": "5/1/2016",
    "text": "If you like Indian/Pakistani food, this place is a must try! Delicious, authentic food and the Owner and Servers are very warm people.  This is the only place I have ever reviewed and I felt if I didn't, I wouldn't be as nice as the people who served me that delish food today!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MYYG_BCn_27uufA6I9JP1A"
  },
  "V3-sugTbJOYfmg4BDMYVaw": {
    "date": "1/30/2017",
    "text": "Very nice food recommended for desi food ! Best place so far I found out in NC.Love the Kababs and the karahi very tasty!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z5M4BT9nXTdmHBtdsTo-iA"
  },
  "0ssOyevBNAcdnQhQheLTzQ": {
    "date": "6/4/2016",
    "text": "Worst restaurant ever visited.. Always misses some item in the order and order was never ready always we had to wait for 30-40 mins though we ordered 45 mins back",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_ke-ckTSVoTsIdc9gUn0w"
  },
  "PGJDFa1RvM0ZjKW6eny12w": {
    "date": "11/13/2016",
    "text": "Most delicious Indian food and excellent service. We are little late after lunch time but they were sweet to accommodate us. We tried lamb Nikari and garlic naan which was mind blowing. I would say the best place to try authentic Indian cuisine in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cOyj1IELdoH4N0rxfgc_xQ"
  },
  "uOjzJqliCN3PUjcg5aOFLQ": {
    "date": "8/21/2016",
    "text": "Our third time. Twice buffet and once take-out.  Prior to enjoying the buffet, the person at the desk apologized and told us they used new hot peppers that were too spicy.  The food was too spicy for us, but the flavors were there, delicious!  We couldn't eat much but finished our lunch iwith a refreshing  and sweet rice pudding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v838Is3l73qF7-WerxxaMA"
  },
  "czPawvwQU2BKPYhvnzyaRw": {
    "date": "9/23/2017",
    "text": "Phenomenal food, great atmosphere, and impeccable service. The best cuisine I've tasted in a while. It was such a welcoming place & I will definitely be returning. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7Opb49XaNSsOFQNATH4Hfw"
  },
  "zhBRkhK01GHYdH39tvSVkQ": {
    "date": "4/23/2016",
    "text": "This is my first time at Zafran. Very nice food. Everything was delicious and service was good as well. Very nice owner. Definitely will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s2Od8Ty8glS4jHyLNGHgDQ"
  },
  "UnFw_r1alQXOf4nacMOXbA": {
    "date": "8/21/2016",
    "text": "If you are craving for some succulent Kababs and authentic Naan, then look no further cuz this place is the best you can find... The peshawari naan is to die for... The owner is very friendly and hospitable.. Their weekend buffet is great but best if you get there early as this restaurant is tiny and will get packed quickly!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TJpR6elxYRNFSi70a3ndVg"
  },
  "xNj9iJTywWa9SY6gWz_tBg": {
    "date": "8/9/2015",
    "text": "They specialize in all kind of middle eastern food and snacks, particularly Pakistani and Indian food. Hands down best pace to go to in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JzkHzEHySaN_rkaLsHnJvg",
        "caption": "Photo of Zafran Kabab Palace - Pineville, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JzkHzEHySaN_rkaLsHnJvg/o.jpg"
      }
    ],
    "user_id": "n9ehTQAW1TGp-ZspSJkhhA"
  },
  "YoDi3B-Bn08Ul485dCCkbw": {
    "date": "12/3/2015",
    "text": "I and my friend had a craving for Indian food especially Indian bread ie. Naan and kababs..Zafran served us one of the best naans i had till date. Such food can be found only in the most authentic restaurents in India and Pakistan..   The serving size of the peshawari naan is huge..very few can eat more than one even though it is so tasty..the paneer tikka masala also scored a lot of points.  The restaurent can work on scaling up their menu with vegetarian food..  Waiting to go back to zafaran at the next earliest opportunity...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2IekKiUz6wo34VaKyM24A"
  }
}