{
  "AzGfjQZlXblFkN4QqrxcGw": {
    "date": "8/21/2018",
    "text": "My friend and I eat sushi every week and we have high standards. We waited to try Sushi Guru based on the reviews we saw. They must have worked out the kinks because the food, drinks and service were all amazing! This is my new favorite Charlotte sushi place and I'm already excited to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-GHtb2zDEWneU53Kz_30jg"
  },
  "nbr3Hudy7gV8dZ-uiSSOqw": {
    "date": "2/5/2019",
    "text": "I have been looking for good sushi since I got here from NYC a couple months ago....found it!  The decor is chill and you can smell how fresh the sushi is.  The rolls are eclectic and I ordered more than I could handle.  Definitely going back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ocl5gCXRk6ZzmhzAAMwTZQ"
  },
  "4Aeo_1jMK8oYWl0c-92V5w": {
    "date": "6/13/2018",
    "text": "Everything was delicious! Make sure you get there early enough to get a seat because the restaurant does get fill up quick. Hamachi Jalapeno roll was delish",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jRlS7kISWdgooAflvLxSnA"
  },
  "fR3l7u5iNycn3wLKCpYIxw": {
    "date": "7/8/2018",
    "text": "I went to this restaurant with a group of 5 within the first 4 weeks of the opening. We were the first party to sit on the outside patio upstairs. The view of plaza/uptown is very nice around sunset. Our waiter was kind and attentive. Everybody got appetizers and entrees and there was no disappointing dish. I had a Cosmo and it was excellent, not too sweet and you could tell the ingredients were all natural. There was even a small garden on the upstairs patio where it looks like they grow drink garnishes. Someone who I assume to be a manager or assistant manager stopped by to check on us and make sure we were taken care of. I'll definitely be back here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eQEH6z-FPBBLOWkw1dcvAw"
  },
  "4ZIWHw9k4GDfofc2JaX0ZA": {
    "date": "6/14/2018",
    "text": "Really good food! So many options, the specialty sushi rolls were my favorite, can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFtQqBLDVwMd8jK7IG0oGA"
  },
  "Zn0uGBHa-kJz4SncJllUTw": {
    "date": "11/14/2018",
    "text": "The past 3 times that I visited  this restaurant, the service was just horrible. When we first arrived I noticed there was an empty table outside, but our host for some reason didn't want to seat us there. she rolled her eyes and puffed when I insisted we sit there. She said it was not reserved but she wanted to fill up the roof top tables first. When we finally sat down our waitress never refilled our waters, and she only came around maybe every 30 min. Therefore our glasses were empty virtually the whole evening. When our sushi finally came out over an hour later, our orders were wrong. We still had to pay full price for this evening, and no apologies were made. I thought it was just an off night so I gave it 2 more chances, and the service continued to be slow and inattentive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u_0Vn3gwAkSlL1DoguA4pA"
  },
  "DPlOgc2UoyqyZiP1sodi8w": {
    "date": "6/21/2018",
    "text": "Being a new place with a bumpy opening is understandable, being indifferent and unaccomodating is just bad customer service.   Came in tonight with 6 adults and a child. Arrived at 5:30 before anyone else was in the restaurant. Our server took our orders for apps and drinks and everything seemed smooth.... until anyone else arrived in the restaurant. We placed our food order and watched our server input our orders into their mobile iPad system and then things went downhill. Our server became overly busy with tables upstairs and down and never checked back on drinks. An hour went by and we had received one roll for one person at our table. Our server never checked back to apologize for the wait and the manager continually walked past us without acknowledging what was going on. When our food arrived it was super staggered and incorrect and no one checked on us or asked if everything was ok. We had to flag down another sever to tell them items were missing and items were wrong and their response was exasperation and indifference. They took my poke bowl which was missing spicy tuna from the table for 15 minutes and I assumed they were remaking it. I watched the poke bowl chef leave the station after looking at my bowl and setting it on the counter. I had to ask another server what was happening and 5 minutes later she brought my same bowl back with just some unappetizing tuna and mayonnaise on top. We still hadn't received 3 of 6 dishes at this point and no manager or our actual server had come by even though it was obvious we were unhappy. In fact the manager, Lynn took the opportunity to publicly and loudly berate our server just next to our table even though she hadn't asked us about any issues, and truthfully we had watched our server enter our order so we couldn't see how it was her fault (other than clearly avoiding us- which she likely did because she was powerless to fix it). I finally asked them to just remake my poke bowl to-go because I was over it. Three separate employees came over to ask what was in my poke bowl and I told them each time and each time they didn't write it down. It had been an hour and 30 minutes since we had ordered dinner and we still hadn't received 2 meals. We had to ask 3 people for drink refills and only got 2 drinks. Finally our last 2 meals arrived and after eating a few bites they brought us our $300+ bill and to our surprise absolutely nothing was comped. To be clear, we eat out at least 4-6 times a week and this was the worst FOH service we have received in memory. Everyone in the restaurant who arrived after us had eaten and left. The manager Lyn when she finally came to our table was basically was like sorry as she brought me my poke bowl to go. And as you can imagine- the to-go poke bowl was wrong when I finally got home. I will be taking my sushi business back to Pisces and my poke business back to Deejai. For a restaurant that has another well established location this dining experience was a complete cluster. They clearly didn't care if we ever came back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "zTYgJlN7Kzbd0Q9AGlBTrA"
  },
  "D-XGLsjBLtQOPWj7v5fTkw": {
    "date": "7/20/2018",
    "text": "Unfortunately I haven't eaten here yet. I came in a week after they opened. They didn't yet have the ability to handle to go orders. Ok. Understandable I guess. I came back today... again to order food to go. Menu looked great! I placed my order, sat for 5 minutes, ordered a drink, finished it in 10 minutes or so, went back to the front, sat for another 20 minutes.... Then the hostess asked, \"what did you want again?\" I left. I guess they still can't handle to go orders. If there's a next time, maybe I'll sit. That might just be the trick.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "re6NlJWtZcttdFFtSzZKzw"
  },
  "kaRVV8P8oZLWdgoCDF27gA": {
    "date": "6/16/2018",
    "text": "The hostess working the evening on 6/16 were rude. It seemed as if they were trying to steer customer away. Someone would come in and say \"table for 2, or can we sit at they bar\" and the hostesses would say \"ya the bar is full there's only five seats. And it's going to be a 45 minutes.\" The customer would say okay that's fine! And then the hostess would say \"well maybe an hour\" like pushing the time back? By the way, there are 18 seats at the bar, not five. And they were not all full. And there were plenty of tables open. Very strange vibes. ALSO a few people asked if they could go get a drink while waiting to be sat (a normal thing to do while waiting) and the hostesses told them all no??? That there wasn't enough room? But that wasn't even True. They were just lying",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "IHil-wCY5E52U8iaX76wgQ"
  },
  "glDFYs_DFp8mnRs58wEZ7w": {
    "date": "10/7/2018",
    "text": "While I love the Morrison Sushi Guru location, this location was extremely disappointing. To be blunt, the service is bad/non-existent, from waiting over 30 minutes to be able to even have a waiter (as there was a table/waiter mix-up) to being told it would not be possible to split the bill. The food is nowhere near as good as the Morrison location. The rolls were oversized and the quality was not worth the price.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VLaw9C6eLIElFwUZTFla_w"
  },
  "9jLUyjNa_xST1hcuCPDX1Q": {
    "date": "7/21/2018",
    "text": "Just visited Sushi Guru for the first time and had a great experience. We grabbed an early weekend dinner and sat out on the patio, which we really liked. We ordered edamame, midwood poke, and tonkotsu ramen, and really enjoyed it all. The service was great, very attentive, and the food didn't take too long to arrive to our table either. I would definitely go back, and am excited to have Sushi Guru as another go-to neighborhood spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZZ9BNtr1e3vEvfeG4edljg"
  },
  "3xonnY0zKYc-rik_Xa_qQQ": {
    "date": "8/19/2018",
    "text": "The sushi at this place is so fresh it literally melts in your mouth. The gyoza were surprisingly above par and the sushi and nigiri were delicious. You can't go wrong here. It doesn't have a swanky atmosphere - more casual which is nice. The margarita was delicious. We have had sushi from all over Charlotte and this is definitely one we will be returning to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a7-s3uu7DPQyCIycdIprWA"
  },
  "1xugdCRVcSLwVZUhgbhaeg": {
    "date": "7/1/2018",
    "text": "pretty disappointed, opened down the street from us we were excited about it. way overpriced for what it is, and they didn't seem to be running the place very well. and showing gory fish slaying videos while eating raw fish",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I6TjgOohP86L0L3IuMIKQQ"
  },
  "G39g3X0oY2vDy2B8ly3ihg": {
    "date": "8/11/2018",
    "text": "Food is good. A bit overpriced compared to other Plaza Midwood sushi. Service was questionable. Never asked if we wanted a drink, no plates brought for apps, and never brought eel sauce we asked for. Weird to bad music playing inside.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "h4J045gnopkHhymWc5fFPw"
  },
  "89zR3CbLyEAbDEiAVDBHsA": {
    "date": "6/15/2018",
    "text": "Growing pains. Which isn't hard to understand. It's anew place. Yellowtail sesame Salad was on point! Wait was worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jYNKExbVC9cVdrDrJbpTCA"
  },
  "iesAjWmQjiSxx5R7KBDZfQ": {
    "date": "12/13/2018",
    "text": "This place has alot of potential to be a great sushi restaurant. Unfortunately that potential was not seen due to poor customer service. My gf and I came here to try out the sushi. We were seated on the first floor which was a perfect spot because there were 3 poke stops around it and our table was within range for all 3. Our server came by and took our appetizer orders. We ordered the calamari, which was pretty good, and takoyaki which was okay. I've had better but it was still enjoyable, 6 pieces for 8 bucks is fair imo. We waited for our waiter to come back around to take our actual order he kept passing our table and I have him the stare down a few times. Didn't want to call out and seem like a needy table. But our appetizers had come out at this point and he had still not taken our orders. After being half way done with appetizers I didn't see the server for a bit so I got the managers attention and she put our order in. After 20 minutes she came by to let us know It would be another 15 or 20 for our food. At this point we were annoyed and asked for our check and to cancel out order. Just over an hour here and all we got were appetizers and poor service. It's a damn shame. Great location, great atmosphere. But the service was just piss poor. Took them another 10 minutes to bring us the check and another 5 to come back with change. Pretty upsetting. Will probably give it another try in the future but not any time soon. Especially with the great akahana right down the street.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MtFXJ-dfes3YDzReacxBg"
  },
  "uSwf83oIjxIriPaj3pab4Q": {
    "date": "6/30/2018",
    "text": "Went here at 9:20 on a thursday night and online it says they are open until 10pm. When we walked in they said they are already closed. Why put 10pm when u actually don't close at 10pm? Why mislead people. Doubt the food is actually that good here. Don't even wanna come back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kc3lfU85nH3wLhHliESL4A"
  },
  "WSnEM0dGjG1iRTJKM7nxjw": {
    "date": "8/24/2018",
    "text": "I eat a lot of sushi and this place serves great sushi.  I try to read between the lines of the negative reviews, and best is to pick your time to go, sit upstairs as the flow downstairs is a little odd, and chose the simple but delicious items. Some great service from some staff, but some questionable from others.. they just need to tighten this up then 5 stars as the food is very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "byTPqEwENfu7PQQuR5kvTQ"
  },
  "6zGJm7FRk1GJE_8_zopq1w": {
    "date": "6/30/2018",
    "text": "Good sushi, glad to have something on another level from Akahana in town! Very cool layout and fun sushi bar where you can actually see them making the sushi, unlike most where you're on the other side of the glass. Also have a poke bar! Loved the salmon tartare the best my first time out (it's sitting in a bed of avocado - kind of hard to see in the pic). Tried the takoyaki and loved them (although the taste of bonito fish flakes is not for everyone, I warn you)! Will update with more pics once I visit again - can't wait to have a Poke Bowl. Threw a few pics in of my friend's Signature Chef's Choice Sashimi. I didn't go 5 stars because for me that's reserved for places like New Zealand Cafe and Yamazaru (mostly due to quality of fish). Staff was super accommodating of gluten free for my roommate, as well! 5 stars on that!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0jSQS_wkOjMw-vW0BGILkw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0jSQS_wkOjMw-vW0BGILkw/o.jpg"
      },
      {
        "img_id": "rZIFlZ1mNmSL_8mpNVxXgQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rZIFlZ1mNmSL_8mpNVxXgQ/o.jpg"
      },
      {
        "img_id": "BA8365uKN8LpqtsO__N_Iw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BA8365uKN8LpqtsO__N_Iw/o.jpg"
      }
    ],
    "user_id": "muLjSwGZYTtntg9iazOwZg"
  },
  "SQQIvDfsRWeOYZZ4IpLMXA": {
    "date": "9/29/2018",
    "text": "My cocktail was fabulous but the sushi was sub par. There was A BONE in my salmon tartare, which, if we are honest, was 2/3 hard as rocks avocado and only 1/3 salmon. I ordered a Thomas Street roll and again there was very little fish and tons of unripe avocado. I would have rather had the totally meh sushi at Harris Teeter across the street for 1/4 the price.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cYl1Mkgi46HYpId55lcGQw"
  },
  "dpO7MBDKApsoLPwEvUq9IQ": {
    "date": "12/14/2018",
    "text": "Excellent food, the edamame is the best I've ever had.  I just left there with my husband and in laws, all of us are kinda food snobs and we all loved it.  If you get a chance try to sit in Lily's section, she's attentive, nice, funny and honest, we loved her!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1ypYp6LIATPYEsUbuFEdlA"
  },
  "O-dmbf83dyylNXQckAAChg": {
    "date": "11/24/2018",
    "text": "Sushi Guru has awesome drinks and truly fresh sushi!!! The service was top notch and the bartender (Mike) was an expert. We liked the Bushido, and the seasonal Apple Cobbler; couple these drinks with the agedashi tofu and welcome to sushi heaven.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WsO34WlDxTU_idcU8jxDIA"
  },
  "XXzZpElC8qa6TBAHSvHZuQ": {
    "date": "6/18/2018",
    "text": "This was such an awful experience!! I wish I could give 0 stars. I arrived around 6:50, at 8:49 I still had no food, I'd only seen my waitress twice,  she gave no refills on drinks and kept walking past us. When I was finally able to stop her she said the kitchen was backed up, but then proceeded to bring all the tables around us food. After I asked her again she claimed the kitchen\" lost our ticket\" - I don't believe she put it in; and we'd have to wait at least another hour. I asked why we weren't priority after waiting almost 2 hours and she just said she didn't know. She offered no other solution. I wanted to speak with the manager but the hostess was no where to be found to ask for them. This experience was so horrible. I would NEVER go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "b5bWpJUmaqUltiEUa-etoQ"
  },
  "U0q16x3d3p1r9jIX0n9aCg": {
    "date": "6/27/2018",
    "text": "Food was okay. It wasn't the best for the steep price. The drinks were pretty good though. The servers aren't very knowledgeable when it comes to the menu. We asked one of the servers if this was the tonkatsu ramen he literally said \" i don't know, I guess because it looks the same to the other one\".. like what?? Then i asked whats the difference between the two charashi bowl, my server had no idea. We ordered a bowl of rice, it took 15 mins to come out. I wouldn't recommend this place for food. The drinks are good so it's definitely worth a try for that. If you want a good charashi bowl, yamazaru is where I would recommend. It's cheaper and the quality is better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "rvP1HVQaJ8zcamqGGiMqUw"
  },
  "O1Tv7p_1IDzdmpX85oCNpA": {
    "date": "7/21/2018",
    "text": "Will keep coming back, sushi is fantastic. Staff is welcoming and friendly. Atmosphere is trendy and relaxing.  My wife and I were very happy w our meals and beverages.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "BfqCqZshMABtvrvGI3e1sg"
  },
  "R43Q9Bmdm9EF6t_CBux6Rg": {
    "date": "7/3/2018",
    "text": "Sushi guru offers a very broad menu, they not only serve sushi but poke, ramen, donoburi, and various appetizer dishes. We honestly came here for their \"halo halo\" since it's hard to find a place in Charlotte  that serves halo halo. We started off with the crab pan fried dumplings, honestly I wasn't a big fan of it, it just tasted like something you can get at any dim sum restaurant. I ordered the salmon roll, sooo good! As for our \"halo halo\" icecream, I don't think we were given the correct one. We recieved green tea icecream instead, which really confused me but they might have just ran out! Nevertheless the green tea was really good! But it's not halo halo!! The service was pretty slow, but I think our server was just slow paced which was fine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RpYeOtqujjc1ce3gYB_4vw"
  },
  "9xZhdgH9YMe1hOnFUVKDGQ": {
    "date": "8/26/2018",
    "text": "Excellent!  Great location.  Outdoor patio.  Had an early dinner and got the Ceviche.  It was incredible and I will be back just for another.  My guest had the Commonwealth roll and it was also wonderful.  Excellent service.  Good selection.  Great value!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wg3w2hYqQprpt-7v1KoXpg"
  },
  "p08JL1VwaeOtQoWDyKU2-Q": {
    "date": "3/22/2019",
    "text": "Fist time great!  Sushi was fresh, waiter was nice and prompt. Second time, sushi was not fresh and we had one of the worst experiences.   Long wait, worst waitress we have ever had.  We will not be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w2-imkOMbt3jPbufME0LpA"
  },
  "fXp4MUvpJatRniDWKk6kDg": {
    "date": "7/2/2018",
    "text": "Went here twice and waited a combined 5 hours to get my food. The second time they informed us after an hour that our food  was not coming. Done with this place... there are too many sushi places in Charlotte to ever come here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yUOOz2fpT44qm-7oEZZFGg"
  },
  "tbmTHFdYCDwM7C6AOnpxgQ": {
    "date": "3/10/2019",
    "text": "Food is so delicious but they are so slow that it doesn't even matter. They run out of everything too. Also, waited an hour for a call ahead carryout order. Poor hostess had to answer the phone, make drinks, wait on a table, run upstairs to pick up food while being stared down by customers for things that were not her fault - with zero help. Management, please fix this because this is such a good restaurant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pO4HVz0aYPvJZS-RgFwmBg"
  },
  "2gQOJNGm5j3wfQNVhJ9YKQ": {
    "date": "6/21/2018",
    "text": "How does this place have multiple good review's? The food was mediocre at best.  We were sat and abandoned.  The waitress after I had requested we get waited on sat and told us about how busy her day and the restaurant was. She had minimal understanding of Japanese food in general. The food came out wrapped in foil (Sushi) after an hour wait and no apps ever arrived. I ordered tea and she proceeded to tell me it was fancy tea..The manager was very apologetic but the entire staff we encountered was full of excuses and strangely casual conversations about how crazy their day had been in a seemingly moderately busy restaurant.  I have never left such a review but I had a friend in town and we were excited for a new sushi spot in Plaza. No way I would come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5w5zyYwY_sz7GINiHj21zA"
  },
  "kyWriUcrrWB18C9GV_h8Ww": {
    "date": "4/7/2019",
    "text": "Very average sushi for $16 rolls. Too much mayo took away from the flavors. Took awhile to get the rolls considering how many people were there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tI6IH0k-xopn_P2qkPohdA"
  },
  "uAzH8qOvGEsj7Oo-MlMFDg": {
    "date": "3/19/2019",
    "text": "Was hoping for a great dinner but it was awful! The server/ bartender explained that they have three kitchens so I was impressed the food should be fairly quick. Not a chance. We sat downstairs near the bar even though our drinks could have been poured from that bar, they came from upstairs which was odd and took longer. Then the sushi came out for the other guests it was well prepared and they said it was good. I ordered the Ramen- tonkotsu shio - which took about 35 minutes to get to the table. My other guests had to stop eating bc they were waiting on my food which ruined their experience. When the  ramen came out of the other kitchen which should have been quicker, it looked like mound of prepped veggies barley cooked. Obviously they knew it was late getting out so they tried to add more ingredients to make me feel better. To top it all off it wasn't even made correctly. Tasted like seasoned water with cold noodles. It had broccoli heads in it which did not even come with it and it didn't even have the boiled egg. Everyone loved the boiled egg ! I sat there and continued to try and pick through of a forest of spouts which was as high as my neck. After all of the dissecting figuring out what it was, I had to send it back and the waitress finally admitted after I didn't like it that it was made completely wrong. Wtf lol. Then she said she would take it off and offer me gyoza ... sure but then that took another 20 minutes.. and I was charged for it. Completely worst service ever ! I don't complain much but take one of my beers off and give me a free 8 dollar gyoza ! Holy Christmas!! Terrible !!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-VfsVzGT6PhLJ7c3MOSCBg"
  },
  "MQxd2SgxBp4y1Ttfjls-VQ": {
    "date": "9/30/2018",
    "text": "Tried Sushi Guru tonight for the first time with 2 of my friends and we were EXTREMELY disappointed. We ordered dumplings & a few varieties of rolls. The food was all excellent; however, to say the service was lacking is an understatement. Our server took 15 minutes to greet us after we were seated and when it was time for the checks he was seemingly unable to split our apps and ended up giving us a separate bill for the apps? We explained the issue and he acted as though he understood but he rung us all up for our separate bills THEN came back to ring us up a second time to split the appetizers. He had to come back to verify which credit card belonged to which individual...   We asked to speak to the manager and she simply said the server had sought help and it should be getting straightened out. Needless to say, the food was great but not worth the hand holding to split an appetizer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NfqG9c8frLiLmHLX2A4wxg"
  },
  "HAEc4mOhnseUkZamfuuaiw": {
    "date": "8/25/2018",
    "text": "Definition of hit or miss. We have been twice. The first time was pretty good across the board. Last night it was mediocre at best. The salmon lovers roll was so bad it turned your stomach. The engine 8 roll had so much jalapeno on it that you were just eating cold crunchy peppers, no flavor at all. The appetizers were great as they were the last time we went. After last night I don't think we will go back. You can spend less money at Rusans and get far superior sushi. I'm not interested in paying for your decor when the food is substandard.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0tXueFRreYlHlN5oqZ1OFA"
  },
  "OANp8TEvd_8ohpeQbjkKKg": {
    "date": "1/21/2019",
    "text": "I went last night for dinner and had a great experience. We got there early on a Sunday around 5pm. Service was of no issue as a lot of other reviewers pointed out. I live in the neighborhood and have been to every sushi place within a mile and would go to this one again. Sushi Guru absolutely has the highest quality fish. The top floor was a nice view of the plaza. I got a basic dinner, edamame and then a few different rolls and some sashimi. The one and only negative thing about my experience was the servers brought food out to set on the sushi bar and were all huddled around eating what looked like chips and guacamole. I get the employees need to eat but maybe take a break in the back and then wash your hands? They were going directly from tables back to eating. Then when I walked downstairs someone was sitting at the bar and she asked me if anyone worked there and I leaned my head over and another person was huddled eating!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ohiiyenkujVu00Quou7-A"
  },
  "kMKysZRiQn-NeJAUEr7IwA": {
    "date": "6/14/2018",
    "text": "Just had lunch at the Sushi Guru today - my first time there. The service was warm and friendly and the food was really good (and quick). I had the Tempura Shrimp and the Pork Gyoza - both were prepared excellently! Even though it was lunch time, the atmosphere was cool - I'm sure it's even better at night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oj4BiEXm-73sInwxGs7suA"
  },
  "eNsaF18zzl5IyH6MCilJxg": {
    "date": "6/14/2018",
    "text": "First visit to the recently opened Plaza Midwood location. This vibrant community is always busy so parking is a premium. Sushi G offers complimentary valet. Nice touch. Place was busy and the wait long. We headed upstairs to check out the place and ran into Jeremy working waitstaff tonight. Very lucky as he knows his way around a restaurant and while our drinks took forever to arrive due to a huge bar back up, Jeremy checked in often. I ordered the Oriental Margarita which was incredible. My guy ordered the gin Moscow Mule. Comes with a big slice of ginger We started with the Dimico Sushi roll. Tasty but so loosely rolled it was impossible to dip in soy sauce  For entrees we ordered the Teriyaki Salmon and a Raman bowl. Big portions and tasty. The menu is big. We spent the time waiting for our drinks reading all 15 pages. The menu is split into categories from Sushi, Poke bowls, Grilled seafood and meats, etc.  Plenty of vegan options.   I liked the restaurant. Sure it has a few new restaurant kinks to work out but if Jeremy our server is any indication the staff is friendly, efficient and effective. What's not to love.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VGANi25pBpRck9AAmJs6Zw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VGANi25pBpRck9AAmJs6Zw/o.jpg"
      }
    ],
    "user_id": "gIPjDX4r4Awhj9oaEJW2eg"
  },
  "i8eqxoCOznjkfqreVT9kVg": {
    "date": "11/1/2018",
    "text": "My boyfriend and I wanted to love this place, but do not. The seaweed salad was mostly romaine...the fried crab dumplings were delicious. Our waitress was super nice and our drinks were great, but it took over an hour for our rolls to come out.. our waitress avoided us most the whole time and had to ask another waitress about our rolls and when they did come out they looked like they were through together haphazardly.   Other people sat down after we ordered, ordered their whole meals and left before our sushi came out!   Overall can't recommend",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FHyzTnemM-fq2buXOcqBBg"
  },
  "r6Ru3Gh_LEPKF7YIrA838Q": {
    "date": "4/16/2019",
    "text": "Went with a group of friends last night. We were excited to try our new neighborhood restaurant. Got there at 815 as some people worked until 8. The hours posted online were 5-10pm daily. THE RESTAURANT WAS CLOSED WHEN WE GOT THERE. No lights were on and the chairs were stacked on tables. We walked over to Soul and ate there instead. What a waste of time. Won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X_GEEinqHVJRbX-h4103QQ"
  },
  "vUQ4xF7DceHhcuBFhABBbg": {
    "date": "9/23/2018",
    "text": "At must try sushi restaurant in Plaza Midwood!  Friendly staff with patio and rooftop dining. Make sure to stop by the downstairs bar and have Mike mix a cocktail!  Oh...and definitely try the Commonwealth sushi roll!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "F6IdOnQlSmpRnflH-QX1XQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Commonwealth Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/F6IdOnQlSmpRnflH-QX1XQ/o.jpg"
      },
      {
        "img_id": "7RH8vfAdmSrRnfRmgNoT8A",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Downstairs bar with bartender, Mike!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7RH8vfAdmSrRnfRmgNoT8A/o.jpg"
      }
    ],
    "user_id": "IaEzNYdtzmUqankLrj91_w"
  },
  "rjJ9bLgmPymv63W8_a1Oaw": {
    "date": "2/15/2019",
    "text": "Shockingly bad service from management. Our food was not even close to what was listed on the menu. The manager apologized, acknowledged the huge discrepancy, but said she had no power to do anything about it. To add insult to injury, they don't accept their own gift cards. Mushy, flavorless, frozen food... definitely not worth it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dcIExMM89J87AFuCR_gtgg"
  },
  "5CFC1rvSpABghC7t_vzsNg": {
    "date": "6/20/2018",
    "text": "Was not impressed with this new sushi spot at all. Don't let it fool you with its trendy look. Here are a few reasons why: -our server was clearly not familiar with iPad he was using to put our orders in and he didn't know the beers that were a available. Telling my boyfriend they had corona and Heineken and they had neither.  -our appetizer came out very last even after our entrees and we were still charged for it -my two rolls came out first and took over 40 minutes and my boyfriend didn't even get his rolls till I was done.  -on TV were fish being gutted with the intestines being pulled out which did not make me want sushi at all.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "G4e7-cVivAE7cm8r1J64fA"
  },
  "3Q4nR8Q4d7HT1VDxdiO6Xw": {
    "date": "8/31/2018",
    "text": "Decided to finally make a trip to Sushi Guru in Plaza Midwood with a ramen craving. It's a very oddly designed space and I'm glad we were sat upstairs. I sat on the couch side with the giant pillow which was more comfortable than expected but the two top tables are rather close together. I ordered the sake sangria and it was delicious and light. We got the shumai to start and it was very good as well. My husband ordered two rolls, the shrimp tempura roll and guru roll and was happy with them. I got the tonkotsu shio ramen and it was very good but a smaller portion than expected. Usually when I order ramen the bowl is so big I have enough to eat for two days. We'll add this to the list of places to go again but there are other options higher on the list.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpcYAvuU6ljcJ7jtFUE_Tg"
  },
  "87-38NX_iXQWgrK-sPZPVA": {
    "date": "6/25/2019",
    "text": "My Moscow mule tasted like detergent and the sushi was revolting. There was a piece of unidentifiable something in our roll. We will not be returning.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fhSX9sx0qUF_t4lzuSbgfA"
  },
  "ibcx-d6eQw05JT_nJg_Lgw": {
    "date": "6/28/2019",
    "text": "The service here was terrible, always out of calamari and salmon, servers knew nothing about the menu or alternative options. Brought out completely wrong meal even on what appeared to be slow night.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "27JJp4Dry9mwLafDaa3OoA"
  },
  "qQrNdLxHLqbHu8dpsvfLTw": {
    "date": "8/30/2018",
    "text": "Fresh fish, creative rolls, What's not to love?! This place is a fantastic addition to Plaza Midwood! Every time I've been here the food has been fantastic. Usually we eat sushi rolls and sashimi. I believe we tried the tartare last time as well.  Anything raw has been super fresh, noticeably so by the color.  The presentation with the sushi rolls that are on fire is also a nice touch.  Pretty impressed with the wine list as well. There are some great Chardonnay and Sauvignon Blanc options to pair with your fresh fish. Not everything in this hood needs to be about beer. Jeremy has taken care of us several times now and does a great job! Never a poor experience, I would certainly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dxHc2tqZYpapqnr4hpu87Q",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dxHc2tqZYpapqnr4hpu87Q/o.jpg"
      }
    ],
    "user_id": "PQedd2NaLmv0qKFZfuSQFA"
  },
  "nsrg_WqmO5FHnPWJTNeIDA": {
    "date": "6/17/2019",
    "text": "This was not a very good choice for sushi....we wanted to try a new place and this was more like a bar than a restaurant. Ordered the sushi tacos and they were ok but never got the spicy tuna rolls yet they were on the bill. My husband ordered the yellow tail cheek and it was like a charcoal piece of dry chicken such a disappointed. Should have taken a picture of it to show how charred it was. Had to get up to ask for ice for the water after waiting around for someone awhile. Mixed drink was too strong and tasted like too much liquor also not cold. Bad experience will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZNews5wYceqZShH2idhZrQ"
  },
  "-aRby7M2AkIH3SheOSHUKQ": {
    "date": "7/3/2018",
    "text": "I'll start by talking about the bad, then the good at the end. My friend and I have been so excited to try this place! We are foodies (we'll eat anything) and sushi is one of the main types of food we're obsessed with. We went and ordered shumai, a salad, and the stuffed mushrooms to share. We ordered the Naked Roll and the Riscan Roll as our entree. To drink, we ordered glasses of wine. Our wine came right away, along with our salad. She came a couple times and kept apologizing about the wait whilst blaming the \"POS machines\". After 45-50 minutes of waiting for our appetizers and sushi, our server came and said \"our POS system is not good and is messing up. *brings the check* What did you order again?\" We told her. We also ordered another round of drinks.   Appetizers came after a few minutes. We were SO hangry now and so ecstatic to eat! The shumai was fabulous, but the mushrooms tasted like rubber. As my friend said \"I waited an hour to eat rubber?!?!\". We honestly did not want to, but after an hour of waiting, it wasn't worth it... we returned the rubber. We still haven't gotten our wine yet... she comes back and asks us what we ordered again. We told her our drink orders again, she comes back with them quickly.   AND THEN SHE SAYS \"I'm sorry but they won't make your Naked Roll because the cucumber takes too long to make and they don't have time\", I promise y'all that was the excuse. After waiting almost 1.5 hours. Why didn't they tell me this an hour ago? So my friend was like \"is it going to take another hour and a half to make her roll then?\" She said she'll have it expedited. We waited for our waters to get refilled for awhile, finally a guy came to refill our waters after a while, then she came back with an extra glass of water. All of a sudden our mushroom app came out again!! We said we didn't want it. Our server comes over and says \"I'm sorry!! I saw her bring that out, I don't know what she's doing!\". I got the Ves's roll and my friend finally got her Riscan roll. Sushi was pretty great! While we're eating, someone else brought out ANOTHER shumai! We kept that lol.   She gave us our checks that were about $85 and said they took $15 off for us due to the inconvenience. She continued to be apologetic and blamed the system while talking about how it was a rough day. To be honest, the food and our experience was not worth $70. She told us the checks could no be separated. So I just paid for it while my friend Venmo-ed me.  ON TO THE GOOD - The shumai was fabulous. I would definitely order it togo if I were to be day drinking at Whiskey Warehouse. The menu selection was a lot, so be prepared to take your time to pick! The outside patio was beautiful. Was awesome they had free valet as well! Nice workers, just bad situation.   OVERALL - I believe the food here is good, but the service was absolutely terrible. I'm usually lenient when it comes to service because I, myself, also work part time in the service industry for many years now. I believe the servers could use a little bit more training. Study the menu a little bit more, understand what to say when they mess up (don't blame the \"POS system\" to us), & know what to say when customers are still waiting (don't talk about how rough your day is). I think the service made me not enjoy my food, but I will probably be back again in 4+ months from now. Hoping the service improves! I'm so surprised I wrote this much, can y'all believe that the dinner actually stressed me out?!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UteOq-se4jZ1ZML28bRo1A"
  },
  "nxOm4Ef-olY0ZflvsPryFw": {
    "date": "12/10/2018",
    "text": "Their sushi is some of the best and they make a mean martini. Unfortunately something has gone amiss w service here. Tonight my bf got served his dinner and 20 minutes later when I asked where my entree was, waiter responded he only served the food he did not cook it.... say what...and place was 3/4 empty. Based on lack of patrons, there is something very wrong w this joint. Sad",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "yxkyjYyoKseI7K4r54FQHA"
  },
  "D_Se9U_9yC0ZIqWPhjXIdA": {
    "date": "8/2/2018",
    "text": "Had dinner with friends and wasn't impressed. I ordered the Robatayaki Lemongrass Chicken and got chicken fried rice. The waitress was sure it's the Lemongrass Chicken so I was pretty disappointed because it doesn't say anything about it being fried rice. Anyways, the flavor was so bland so I packed it home to add more flavor.  I also got the ceviche which was good, but the fish pieces were not cut small like the picture on the yelp page posted by the owner. SoI didn't eat much of that either, but it was a lot better than the chicken fried rice.  The cocktail was good though and my friends seemed to enjoy their ramen and sushi rolls.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kg38vpoijtboMNwvPzcRVw"
  },
  "ou8ysAkdUWNPw6NCdzQpkg": {
    "date": "8/10/2018",
    "text": "Trendy, the food was pretty good. The waitress was knowledgeable and helped me decide what to get. Decided to try the squid salad, the steamed pork, and got one sushi roll, The commonwealth. The sushi was alright, it's hard to say when akahana has always been the sushi place we go to. This place is worth trying out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DbLPVsOmdKljdEIvE4B0pw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DbLPVsOmdKljdEIvE4B0pw/o.jpg"
      },
      {
        "img_id": "Zn6seOKz9DAbWHeLaWL8Uw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zn6seOKz9DAbWHeLaWL8Uw/o.jpg"
      },
      {
        "img_id": "6lWZD8_hye2aeQO-cr_Y7A",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6lWZD8_hye2aeQO-cr_Y7A/o.jpg"
      }
    ],
    "user_id": "FHiFWbXmqQ1e78GM8178Ew"
  },
  "puW2GEph1B-QBM1F6bMmYw": {
    "date": "6/17/2018",
    "text": "Decided to check out the new location for a late lunch. Service was great. Not overbearing, but perfect. Never interrupted and never had to ask for water or a question. That's a skilled server who has that skill. Ordered two drinks that were unique and tasty. The margarita and the another with a cucumber wrapped around the inside of the glass. Great taste and chilled for a hot afternoon. The food was delicious. Seaweed salad, yellowtail, seared tuna, shrimp, fresh poke cocktail, and a duck breast I'd kill a man for if it were the last one left. :) Yes, that good. For sure will return. Did I mention the duck?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nwd8qubkJgtUTr5-Tb7gHA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nwd8qubkJgtUTr5-Tb7gHA/o.jpg"
      },
      {
        "img_id": "Y-BK0RGLei8forgxDTBBEA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Y-BK0RGLei8forgxDTBBEA/o.jpg"
      },
      {
        "img_id": "Z5xHqdL7JqgBS_GakAY1GA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Z5xHqdL7JqgBS_GakAY1GA/o.jpg"
      }
    ],
    "user_id": "da3c5JxFodELNn2WkKxIeg"
  },
  "6ZI9748P-yGFtF-XEYPPkQ": {
    "date": "9/24/2018",
    "text": "Disappointed is the only word that comes to mind. I'd heard such good things about this place and was less than impressed. The service was terrible and there was no reason for it as we were one of four tables in the whole restaurant on a Monday evening. We got crab wontons and we're disappointed to find that it was imitation crab. The sushi just didn't taste as fresh as I expected. I've had quick serve poke that was fresher and less expensive. The quality of the roll for the price felt like robbery. And I never thought I would say this, but the rolls were too big. Sushi has a one bite, two bite max rule and these rolls were so large it took 3 bites. I will say that the ambiance on the patio is really nice and it was great to be outside in plaza. At the end of the day though if someone asked if I wanted to get sushi I'd recommend other places first.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "VPbz4-4vz4W1EAXytn9ojA"
  },
  "hIphVXQ6dJnF9SCXtz1n6w": {
    "date": "6/27/2018",
    "text": "Food was great, but with most newly opened restaurants, they still have somethings to work out.   We would definitely eat at Sushi Guru again to see if improved.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9oDDg8PyLim1nt9XYfMqBw"
  },
  "N2SCaxBL5c4eRUxjDNocuw": {
    "date": "6/13/2018",
    "text": "Let me start by saying that I'm struggling between giving 4 or 5 stars. I went on opening night and there are definitely some kinks that need to be worked out. The drinks, Oriental Margarita (super delicious), made the wait a little more bearable. The location is super adorable! The building is tucked away which made sitting outside of the garage doors enjoying the cool summer breeze perfect. Also, the food we received (remember, a couple of kinks need to be worked out) was pretty good. I would definitely recommend the Guru roll and the Ves' roll. Despite the kinks, this place is definitely worth trying again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JL1J8XErZm2JIWam-Jonug",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Oriental margarita - I took a sip and ate the garnish that was on top",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/JL1J8XErZm2JIWam-Jonug/o.jpg"
      },
      {
        "img_id": "kTKvLuSfOvTEZ2_EEMR6SA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Guru Roll - a definite must! (Also slight modified due to my eat first take picture later mentality )",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kTKvLuSfOvTEZ2_EEMR6SA/o.jpg"
      }
    ],
    "user_id": "NQCV10hxv5oTYa1hjtwAbQ"
  },
  "rFJW2A9EdTlzdFI2VSkZzA": {
    "date": "7/14/2018",
    "text": "The food here is amazing! The Miso Soup is certainly my favorite, the Tofu has amazing texture! Also the customer service was amazing 10/10",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d8B9X9OTzWkiO5ThcWCooA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d8B9X9OTzWkiO5ThcWCooA/o.jpg"
      }
    ],
    "user_id": "zU9uzxz7SWV6loWk0I_eng"
  },
  "OlSWAxrr-JIJ8KdMpYh1NQ": {
    "date": "6/17/2019",
    "text": "I received a gift card for Sushi Guru and brought a few friends along to help me spend it. Overall, the food was very good but not the best sushi I've had in Charlotte. Unfortunately, that wasn't enough to make up for the fact that the service was terrible. My party of four was there for more than two hours, most of that time was spent waiting - on our table, then our drinks, then our food. Tables there before ours were still there when we left.   Food was constantly being brought out to the wrong tables, with servers going around to each table asking if the food belong there. Several parties ended up leaving after being seated for 15-20 minutes with no service. There seemed to be at least three servers on the floor with maybe eight tables between them, so it's not as if they were slammed. The confusion about every table's order, and the long wait times once we were seated were, frankly, embarrassing. Not to mention, a young teen actually came into the restaurant to solicit sales for handmade jewelry, and none of the staff seemed to care.   I hate giving poor reviews to local businesses, but despite the quality of the food, this was one of the worst dining experiences I've ever had.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6LyszTWtc2pEKo90i3TEKA"
  },
  "4ttQwN5PYrkaUPTpqSi2SA": {
    "date": "8/23/2018",
    "text": "With Akahana down the street, this place won't stay open long if it can't fix its opening growing pains.   To start, our server was completely and admittedly unfamiliar with the sake options. When we asked about different rolls, the server was similarly confused. We asked about the difference of 2 rolls, ordered one, 2 were delivered, we sent back one, and our bill still had both rolls. Worse, my friend wanted the roll that wasn't fried, and he recommended the fried roll. The order mistake actually saved us, so we could send back the fried roll.   On more than one occasion, food runners tried to serve us food other tables had ordered. Their system of table numbers is not worked out yet.   The sushi itself is average. Of the rolls we ate (and ordered), none wowed me more than a traditional roll found in most sushi restaurants.   The seaweed salad was delicious, but wish it was more seaweed than romaine garnish. We left the romaine garnish and the waiter asked if we didn't like the salad because so much (garnish) was left behind. The gyoza dumplings were no better than frozen Costco dumplings.   The open garage and outside seating is a plus, but if they don't fix their service issues and create food that justifies the price point compared to places like nearby, they'll not last long.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ir8HD2v8YoL-bZfP8y7B0A"
  },
  "KQ5yI8GyKCVmK4Tc0a-Geg": {
    "date": "10/12/2018",
    "text": "The food here was very good. Some of the best sushi and cocktails in charlotte. Ordered the smoked squid salad and that was very delicious. The sushi was great and it came out on fire which was cool. Service was a bit slow. The kitchen looks to be tiny and we were a party of 15. They kept coming out and asking whether everyone had received their appetizers... their staff should be keeping track of what has come out, not us. Couple of people didnt get their appetizers. I definitely recommend the food here and may check out their south park location next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "k1Vk3MHx2sILrryYJWdZNA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/k1Vk3MHx2sILrryYJWdZNA/o.jpg"
      }
    ],
    "user_id": "EzMbKvgxMTxNtRBlSZcBFQ"
  },
  "ra6NbqGgX3xCoPMURjA-9A": {
    "date": "8/10/2019",
    "text": "Should have listened to the yelp 3 stars. Really don't have anything good to say about this place besides the atmosphere was okay- nice open concept with a breeze. Food was really gross, service was slow, hostess didn't seem to know what was going on. Stay away!! Surprise they're still in business.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "esl0jLZairESf5jiytHhFg"
  },
  "F1CYi4YRjlup3wDx9UgtqQ": {
    "date": "6/19/2019",
    "text": "Service in the dinning areas is horrible. We had been there a few times and ate at the sushi bar which was great, and have had takeout.  When we went with a group of 8 for a birthday party it took over 3 hours, hot food came cold, cold food came warm, drinks were only one at a time for the whole table, we never even got a chance to order desert or sing happy birthday.  And we had to tip 20% for the large group...  we all felt ripped off.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sJSJnm3tvwpzXUsJnbHq3g"
  },
  "rdQsO9_vESjI_0eHrErFQw": {
    "date": "6/29/2019",
    "text": "Sushi guru has been my go to place for Japanese cocktails, the bartender Mike is a nationally ranked bartender. The foods are delicious, cervicale and crab dumpings are a must try. The common wealth roll is served on fire literally. Best sushi spot in plaza midwood for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2LWRi8EvOq_WjVQSHzXcQ"
  },
  "o5Oghbd_tyQxiER--9os7Q": {
    "date": "8/8/2018",
    "text": "First off - in my opinion the cocktails are worth 5 stars. The food is worth 3.  We ordered 3 cocktails and would definitely recommended each:  - Tokyo club - Kitsu Kato (my favorite) - Rojin  Food was not bad, just not necessarily the best I've had had. We will definitely return, hope that some of the kinks are worked out with food and service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "CdJlGCMX2INYfMduMQtbvg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CdJlGCMX2INYfMduMQtbvg/o.jpg"
      },
      {
        "img_id": "MGVv4D4SXn1S-NKtKduQPw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MGVv4D4SXn1S-NKtKduQPw/o.jpg"
      }
    ],
    "user_id": "9HDFiWwi2mdZB1CtGKDzlg"
  },
  "MCg4dvvfXVgoXwShRk4uPQ": {
    "date": "6/1/2019",
    "text": "This is not the place to go when you're in a hurry or have somewhere to be at a set time! That said, the sushi is GREAT!! Drinks were well prepared. We found the service/staff to be helpful and friendly. They apologized several times for the slow delivery of food. We had read other reviews and were well prepared...no place to go after dinner ;)  Bottom line: food was great. Remember, patience is a virtue! :) Recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EzVwjGRGyWgl5Dj7_samqw"
  },
  "sH9A77I_MAgwTcy7KPH35A": {
    "date": "6/2/2019",
    "text": "Excellent sushi, fresh and high quality fish. Impressive cocktail menu, best Mule I've ever heard. Service was great. Loved the open shaded patio off The Plaza. Recommend the sushi pizza appetizer. (Surprised by the relatively low rating on Yelp. Seems like service may be hit or miss, but the quality of food is definitely 5 star. I've had all positive experiences.)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xzR2yY3TF0tMapM3DOHGUA"
  },
  "qf2h_cbRc4cl-Pj0131zsg": {
    "date": "6/29/2018",
    "text": "This place was recommended to me by a friend so I decided to check it out. They have COMPLIMENTARY Valet Parking, so don't even waste your time trying to scope out parking in the area. We were seating immediately upon arrival, but the place was rather small from what I saw downstairs. They might have seating upstairs as well, not completely sure.   For an appetizer, we got the Pan Fry Crab Dumplings. They were yummy and really just reminded me of something you can find at a Dim Sum restaurant. I ordered the Ves's Roll, it contained everything a seafood and sushi lover can want in one roll. The presentation was beautiful, but this dish did not come with wasabi or ginger which may or may not be intended. First couple pieces melt in your mouth. However, there is so much mayo and creaminess on the roll that as you eat, you get sick of eating it. I still really liked the roll, but the mayo overpowered all the other pieces in the roll and I lost sense of what was in it.   Dessert for us was a jumble of confusion. We got Halo-Halo, a yam based ice cream dessert with a variety of fruits over evaporated milk and ice. Someone tell me we got green tea ice cream? I'm not sure if this was a spin off of the traditional Halo-Halo or they just ran out of taro ice cream. One of the main reasons we came was for this since it is not found at any other restaurants that we know of in Charlotte!   Service is kinda slow. Our waiter liked to stroll, but it's okay he was friendly. Their menu selection is expansive so prepare yourselves!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "3HO8JhkD6F4xq4DfzzNfBA"
  },
  "ZMFEePNcqgdpMhHRF7HXpQ": {
    "date": "2/15/2019",
    "text": "I loved this place. Service was fast and friendly and the suggestions I asked for were not related to the price one the items on the menu. I really enjoyed sitting at the sushi bar and watching their excellence in action. I am already planning my next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y6nhff8giFZxr64r3ez9IA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Seaweed salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y6nhff8giFZxr64r3ez9IA/o.jpg"
      }
    ],
    "user_id": "sAoFGMNa_suxMUFMCiHUDg"
  },
  "oJdwbtmg0BcFbAz1ZrPvwA": {
    "date": "6/10/2019",
    "text": "Finally got a chance to try it since it's in the neighborhood, despite the reviews.   It was a Sunday evening and it was not very busy.  Kyle was our server and he was great.  I started with a Hanami Mule which was EXCELLENT and very unique.  We had miso soup (very salty, which I liked but might be too salty for some) and the pork and mushroom shumai (also delicious).  For dinner we split 2 rolls: salmon lover roll (good) and Ves's roll (excellent).  My date had a California roll too which he really liked.  Overall very good.  Food took a bit longer than I would have liked but not anything too long.  We would absolutely come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6KRRx8YRHsmoFUeusCv1fQ"
  },
  "wIjx0gGJwwBXQysupIdoDQ": {
    "date": "7/27/2019",
    "text": "Sonia was awesome!!! Very attentive and the food was AMAZING :-) I had the commonwealth roll and it was yum!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yOxzzNdPn5DBYpSHM-YQCg"
  },
  "mySlwbq_An-0_LbAUjzR4A": {
    "date": "2/1/2019",
    "text": "I was so excited to come here for the second time yesterday but the service was horrifyingly slow. Although they are the style of restaurant where you typically order smaller plates in different rounds, we were unable to due to how slow everything was coming, and I honestly left less satisfied than you'd think. Aside from seeing my best friend, the only highlight was the appetizer of Agedashi tofu, which I had never had before.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MoLJCoSlRXDD3wHoraadQA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Agedashi Tofu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MoLJCoSlRXDD3wHoraadQA/o.jpg"
      }
    ],
    "user_id": "pUVS6cS7880d6uwLRgMwEw"
  },
  "7uGWT4hRwp1kiH3cxMB02w": {
    "date": "2/17/2019",
    "text": "BE PREPARED TO WAIT.. and wait, and wait... I had to wait a FULL HOUR for a *carry out* order. Absolutely unacceptable. Will NOT return. Only eat here if you've got plenty of extra time to waste, many other reviewers had slow or poor service and waited an unnecessarily long time for their food here as well..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0bvzxRrNQbUg3PJ-2rATFg"
  },
  "jg_BvyUxnKerqDFN4KvatQ": {
    "date": "12/3/2018",
    "text": "BEWARE I came here to eat, very excited to try a new place. Service was slow at first but then when my food came out, there was hair in it! The waitress rolled her eyes when I told her and took the food away and didn't come back until she brought the check. She said she took 10% off my check but she never brought me back any replacement food.   I understand that there are food malfunctions sometimes or a stray hair falls, but this waitress never said sorry, never brought me new food, and still charged me for a dish i didn't get to eat. It was very bad service.  I did not tip and when i left the manager ran after me and confronted me for not leaving a tip. I always leave 20% because i used to be a waitress but i couldn't justify a tip this time. I had to go to Harris Teeter afterwards and buy another dinner. I left hungry and sad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXeHGH8Oj1zB0r4TKQeT2g"
  },
  "t_2SHHK5mkUS9WK2KW75dA": {
    "date": "8/16/2018",
    "text": "I've been dying to go to this place since it opened, but when I read the reviews and some as early as 8 days ago were still mentioning kinks in their food and service, I was hesitant to come. My fiance finally convinced me to go regardless of what the reviews say and I was like \"what the hell why not.\"   I'm so glad he convinced me to go because we had a spectacular time. We were seated right away, greeted by our lovely waitress Darlene, and were offered waters. We got the crab dumpling appetizer, which was decided upon thanks to the help of our waitress. we also got their version of a mule cocktail and I got the Tokyo Club cocktail. All of that was brought out efficiently and we never felt rushed to finish. After we ate the appetizer and got our drinks we put in two sushi orders- the salmon lover roll and the d'commonwealth roll. Both were astounding in both their display and their taste. We sat upstairs on the couch that has super comfy pillows. The vibe was very laid back and modern. Overall great experience!!  We went on a Thursday around 7:30 and was blown away by the service and food. Don't always judge a place by their yelp reviews lol.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RO263GZi_VzVQtStpz4fog",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. D&amp;#39;commonwealth sushi roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RO263GZi_VzVQtStpz4fog/o.jpg"
      },
      {
        "img_id": "N7m8ux7yZosZN9LmcY5ifQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Salmon Lover sushi roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/N7m8ux7yZosZN9LmcY5ifQ/o.jpg"
      },
      {
        "img_id": "0lFxiaP-9a8mly3qWdnb8g",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Tokyo Club cocktail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0lFxiaP-9a8mly3qWdnb8g/o.jpg"
      }
    ],
    "user_id": "bVGWWPpuPViRR7aCmZm0dw"
  },
  "-pB2CyHrlH9ogdngPA8BaA": {
    "date": "6/12/2018",
    "text": "What an awesome and neat place this is. There is upstairs and downstairs seating, and they have those cool garage door glass windows. The summer breeze on a cool night sets a lovely tone for the restaurant.  I highly recommend the miso ramen and the guru roll. Everything is well crafted and fresh. Most definitely will visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I8flth7ZMjES03pgNRK3nA"
  },
  "hAKs7wmfFJ3Uw_ysHwNX3A": {
    "date": "11/6/2018",
    "text": "TL;DR - be prepared to wait. Food is hit or miss.  My first experience with Sushi Guru was take-out about a month ago, hostess said food would be ready in 15 minutes and when I showed up my sushi wasn't ready.. no big deal. They weren't busy so I figured it might be a few more minutes. I ended up waiting another 15-20 minutes before the hostess brought me my food. The rolls were good so I decided to try it again last night, this time dining in with a friend visiting from Durham.   All the tables were full last night. I heard the table next to us complaining about the wait time on food - not a good sign. One waitress came up and took our drink order (bottle of wine) and immediately asked if we were ready to order our food when we hadn't even had a chance to look at the menu yet. We were then introduced to our new waitress, she was very friendly. We waited and after 5 minutes or so our wine showed up and I ordered the seaweed salad. My friend asked the waitress where our seaweed salad was once and she immediately returned with it as if it was sitting in the window the whole time. It was mainly lettuce with a very little seaweed.  For dinner my friend ordered a poke bowl and I got a veggie roll and the D'Commonwealth Roll (Flamed Spicy Tuna, Avocado, Lump Crab, Mayonnaise, Jalapeno). The poke bowl and veggie roll came out first, and I was halfway done with the veggie roll (heavy on the rice, light on the veggies) when the Commonwealth Roll showed up - on fire which was pretty unique. However, when I started eating I found crab shells in the first three pieces. I told the waitress, who took the roll and asked if I wanted something different and that she would send the manager over.   We finished our meals and the waitress finally came back and said my new Commonwealth Roll would be right up which I did not re-order. I asked her to box it up because I did not want to eat it anymore. I would have ordered something different or just asked for it to be removed from the bill altogether if the manager had of come over. Nevertheless I took it and ate it for lunch today, cautiously, but did not find any crab shells!  It took a while for us to get out of there... we were chatting and drinking our wine but we still had to ask the hostess to take our card to pay the bill.  I'll probably give it this location one more chance, in a couple of months.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bbu9_0Q8Dogo9ksnDOVMzw"
  },
  "_WqjmTJVzEV8uIIpYecmPQ": {
    "date": "11/14/2018",
    "text": "Absolutely amazing. Went here with my boyfriend for our anniversary and we were not disappointed. The staff was friendly and helpful--answering all of our questions. I am gluten free and my boyfriend is allergic to avocado and they took care of all of our food allergies. I even got gluten free soy sauce! They're sushi was the best I have ever had In my entire life!!!! We will definitely be back soon. I 100% recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "JNbs_tpBOS6zKTekjWThQQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JNbs_tpBOS6zKTekjWThQQ/o.jpg"
      },
      {
        "img_id": "Z7q1Fejq6wEUZf9JS8utCg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Guru Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z7q1Fejq6wEUZf9JS8utCg/o.jpg"
      },
      {
        "img_id": "GblkyHi05SONLyYWpYoOzQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GblkyHi05SONLyYWpYoOzQ/o.jpg"
      }
    ],
    "user_id": "F92xpyGrUnC5j0c4gwParA"
  },
  "0FbknbnhZQyHzWVjs6HMvQ": {
    "date": "6/30/2019",
    "text": "Great atmosphere and delicious sushi! We went late after a night out, around 9:45-10 pm so there's no wait for us. We shared a few rolls, the guru roll and the commonwealth roll. The guru roll was flash fried and came out on fire!! Amazing flavors and presentation! So cool!! Commonwealth roll had just enough fire spice for me but not overly so. We shared some gyoza dumplings and they were good too. My fujisake highball cocktail was like an apple sake whiskey drink. It was cold and topped by a freeze dried apple, sort of like a cracker. Interesting but not one I would order again. I think the setting atmosphere is great since we could walk in right away. If I had to wait hours like other reviews stated, I would not have thought it was worth it. However, I enjoyed the sushi and we had great service for walking in right away.  I think if you go later at night you can avoid crowds. We parked and walked so that's my suggestion for plaza.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7dpy16rr1ngpPNu-dS7raw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Fujisake highball",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/7dpy16rr1ngpPNu-dS7raw/o.jpg"
      },
      {
        "img_id": "wkZBPGFUoPYsNy65x0xKfA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Menu 2019",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/wkZBPGFUoPYsNy65x0xKfA/o.jpg"
      },
      {
        "img_id": "tT_exKCPx6LtKjmdC2vxTg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Menu 2019",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tT_exKCPx6LtKjmdC2vxTg/o.jpg"
      }
    ],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "rWhfOviEUn2Bx75aX09gIA": {
    "date": "8/16/2019",
    "text": "My husband and I were excited to try this place.  We actually walked in blind, we merely drove by one day and said \"that place looks fun, let's go there next weekend\" we didn't know the name of the restaurant or anything, we were in awe of the aesthetic, and that is what brought us in.   Food was mediocre. I had a veggie roll, no description as to what was actually in it. I found disappointing. I found my avocado to be not ripe, the pickled ginger very dry (as if it has been left out uncovered for a few hours) and the sesame seeds very over powering.  I also ordered the agedashi tofu. The coating actually fell off of the tofu, so I just ate warm soft tofu with a mushroom soy that tasted very fishy and left my stomach feeling upset.   My husband ordered a Japanese variation of a chicken fried rice- the presentation was absolutely beautiful. But the rice was very herbaceous and the chicken was very tough and dry.  He also ordered a Californian roll, we weren't sure what sauce was on top of it? Maybe a mayonnaise we aren't too sure. He thought It fell short of standard.   Our service was disappointing. Didn't welcome us to the restaurant or introduce himself,very odd just took our order. Checked in with us once and brought our check.  No style of service or eagerness to serve.   We agreed we would not come back, it was a below average meal and disappointing service- a shame for a beautiful venue.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qBH2DctWFfGHgsfwuVnUyg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Veggie Roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/qBH2DctWFfGHgsfwuVnUyg/o.jpg"
      }
    ],
    "user_id": "U13eUyAh7_tjtE0ANEjlMA"
  },
  "wUBT4IYdP73CvFkUq920Gg": {
    "date": "5/26/2019",
    "text": "I really hate giving Sushi Guru a 1-star, but I think it's fitting for the last couple times we have been to this restaurant.  One of these times, I ordered the chef's choice to-go. What they said would be a 25 minute wait ended up being an hour wait. Once my fiance and I started eating the sushi, we realized that the sushi had a fishy taste to it, and I wasn't able to finish the platter.  The last time, we actually went to the restaurant. We were able to get a seat with no problem, and ordered our usual: the chef's choice for nigiri. Ten minutes later, our waitress came back and asked us what we ordered and we repeated our order back to her. Forty minutes later passed, and we finally got our dinner...except it was the wrong thing. It was the chef's choice for sashimi. We politely told the waitress that we got the wrong thing. Instead of apologizing and taking it back, she started arguing with us and said that's what we ordered. We stood our ground and said that was what we ordered and we asked if she could just put the fish on rice. Instead of just getting us a new plate (which is what most nice restaurant would do), they essentially just put the sashimi on rice, even though the sashimi cut is very different from the nigiri cut. As we started to eat the sushi, we realized it was a bit fishy, but kept eating it because we were super hungry. Then, we ate the snapper, and all of a sudden, we both felt sick... The fish wasn't \"fishy\" but instead spoiled. It was one of the grossest things I've ever eaten.   This last experience was the final straw. We put up with the long wait times and the bad service because we thought the food quality was pretty good. However, after our most recent experiences, the food quality has gone down hill.   For this restaurant being in business for a year, it should have worked out the kinks... Because they haven't, this will just be another poorly mismanaged restaurant in Plaza that will eventually go out of business. I hope this restaurant has a wake up call before it's too mare by reading these reviews, and changing the way they're doing things. We'd really like a great sushi place in this neck of of our words!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "05vIILBRw2O2zGFgzD0dLA"
  },
  "DHBmXwFNdd4tDjB6RSh4-g": {
    "date": "6/27/2019",
    "text": "Our host didn't know how to use the text when our table is ready feature. Finally when our table was ready he called me even though I was sitting right next to him. When I walked up to him he said there is someone in front of us. I said you just called us and he said oh ok and seated us. We had to wait 15 minutes for water. The waiter dropped them off an immediately left. He came back a bit later to take our drink orders. He did not know the OMB beer on tap that night and did not offer to check. I got a yellow lady which was great. The guru roll was also really good. Food was great but, needless to say, they really need to focus on training their staff.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "45mHrZuxsw91N69eSp_S6Q",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Guru roll and philly roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/45mHrZuxsw91N69eSp_S6Q/o.jpg"
      }
    ],
    "user_id": "Pli7LcquUlzXGDnqIlZqYA"
  },
  "5WEPQ5ns-MYjyimm7PeEqQ": {
    "date": "7/13/2019",
    "text": "Ek we wanted to love this because its near us and we love sushi but sadly it was NOT good. I hate when sushi smells fishy and almost all of ours did. Also all of them had something fried or mayo-y. We wanted fresh stuff and this is NOT it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "P01S4NjVZe6E56Ov-WWomA"
  },
  "FPEYNGSw_j3y9oTaDopVMA": {
    "date": "4/22/2019",
    "text": "I was expecting a little bit more from Sushi Guru. I think they kind of fell into the trap of high prices and mediocre food. We arrived on a Thursday evening with a group of 4 and were seated pretty immediately on their patio, however, it took a good 10 minutes for anybody to come over for waters for the table.  There were a bunch of menus on the table, y'all. So much that we were struggling to find out what was where. The regular menu, the sake special menu, the cocktail menu, the wine menu, all on separate sheets of paper. These are not big tables. Consolidate, guys. Thursdays are half priced bottles of wine, so our table purchased one for an excellent price, along with two beers. The cocktails looked really interesting, but they just weren't our mood for the day! We ordered two appetizers, one calamari and one crab rangoon type thing. Both were decent, although I think I liked the crab rangoon better. There was just nothing that memorable about the calamari.  We ordered 4 different rolls in total for the table, and when they came out, two were the same. I asked about it and the waitress admitted that she got it wrong, but I'm usually not that picky about it. The roll that we got instead was good, it just..wasn't what we ordered.   I wish I could tell you what any of the rolls were but all menus are ERROR 404 on Sushi Guru's website. No access, file removed.   Overall our total with a bottle of wine, 2 beers, 2 appetizers, and 4 rolls came to ~$100, which I think is reasonable for most occasions. But... I don't think the quality of food or the innovation behind the rolls demands the price point that they're asking. I think there's much better sushi elsewhere in the city, including the OG Sushi Guru down in South Park which I still love. I probably won't be back, which is a shame.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "We4ApuwoJqKk0AVgqiRFMQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/We4ApuwoJqKk0AVgqiRFMQ/o.jpg"
      }
    ],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "re4dvwdrsHxdl2xHWQSKag": {
    "date": "7/9/2019",
    "text": "Need to put a review back up as I believe mine was taken down for some reason. Do not eat or support this restaurant, it's extremely mismanaged. With such a prime location we need a sushi joint in plaza that exceeds expectations. My party Waited 3 hours to get 3 sushi rolls, my wife's roll was  even incorrect. This is not an exaggeration. Just be forewarned that staff, kitchen, bar are very slow. Management did not even come to table to apologize for an such an extreme wait. Please keep this review up, everyone needs to know before they consider eating here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0AZPiCFjMQEcoavcbiN4zw"
  },
  "V82BwBy4NDWCl1XBZhdTyA": {
    "date": "10/20/2018",
    "text": "I came here with a group of friends and I was really impressed with this place!   We started with the gyoza and it was very delicious. I ordered the spicy tuna roll and the guru roll. The guru roll was by far love you favorite. But there are so many other items that I'm looking forward to try! I had the chance to sample my friends dishes too and they were all good. I can't wait to return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-S4J3VIaH_kyvjxt77EfBA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-S4J3VIaH_kyvjxt77EfBA/o.jpg"
      },
      {
        "img_id": "-RG4TFp5I661Vh83pKktOg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/-RG4TFp5I661Vh83pKktOg/o.jpg"
      },
      {
        "img_id": "IwfbhJ4iLFNPZu-hJX1ATQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IwfbhJ4iLFNPZu-hJX1ATQ/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "ye5-DPBHAaBjuwPOIWWkXQ": {
    "date": "12/21/2018",
    "text": "They exceeded my expectations. I definitely will go back. The customer service was amazing and the waiter had a great knowledge of what was on the menu and what he recommended based on his liking or others customers based on our liking. The drinks even were amazing. I opted for the purple hue drink and it was everything, I decided to get this drink because it was on their seasonal menu and wanted to try it while they had it. As for the sushi it was fresh and unique. My favorite roll that I would get again was the Guru roll with the fried shallots on top.   The food comes out tapas style. I would recommend you go when you are not in a rush, because you can expect to wait due to how busy they tend to be and how your order comes out. It definitely is worth the wait and I can't wait to bring more of my friends with me next visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Eqa8N76K6ZiSHQ2XLKj_hw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Fiery Commonwealth roll",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Eqa8N76K6ZiSHQ2XLKj_hw/o.jpg"
      },
      {
        "img_id": "eFc8FhsZ7Pa1uGpxqDw76g",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Purple Hues",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eFc8FhsZ7Pa1uGpxqDw76g/o.jpg"
      },
      {
        "img_id": "4hIINeRcPkU925bG2Kjbzw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Guru Roll",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4hIINeRcPkU925bG2Kjbzw/o.jpg"
      }
    ],
    "user_id": "4jctgjQPheMcaRwheqrgwg"
  },
  "2gSICWYG-Dyk4cmGa6_fuQ": {
    "date": "8/17/2018",
    "text": "I purposely waited more than a couple months to finally check out the new spot in my 'hood. I just wanted to make sure they got all the kinks out and what not. We discovered during date night that they're still trying working on the kinks and trying to figure it all out.   We went on a Thursday night at 8pm. There wasn't a wait and we were seated upstairs right away. The cocktail menu is super unique, but I just went with a glass of prosecco.   I'm going to preface this to say that I thought our server was great. She was so nice and really knew the menu. You know I love the spicy, so I had to go with the D'Commonwealth Roll (Flamed Spicy Tuna, Avocado, Lump Crab, Mayonnaise, Jalapeno). It comes out and the plate is on fire. The boyfriend got a tempura roll and some ebi nigiri. We decided to start with miso soups and the crab dumplings (server said it was one of her favorites).   So, we sat. And we sat. And we waited some more. Our server brought us some shrimp chips, apologizing because the kitchen was backed up. Nice gesture. An hour later, here came our rolls. We asked about our soups and crab dumplings. She went to check, came back and said they had ran out of soup and were making more. I get that, but why didn't anyone say anything sooner? We would've ordered something else. So, we didn't get our soups and no one ever acknowledged the dumplings or why we didn't get those either. It also wasn't all that busy in there.   It's the first time I can ever remember where my boyfriend asked to speak to the manager. It was just a disappointing experience all around. The table next to us sat down and immediately got multple plates of food before we ever got anything (granted, it appears the gentleman was a manager, owner or something. So, I do get that, I guess).   Anyways, I did like my roll. I love the fact that they offer complimentary valet (Plaza Midwood is a huge pain in the ass to find parking). I like the design and decor of the place. Feels very trendy and chic. Nice bar area where you can watch all the action  I hope they can get things figured out because I'd love to see this place do well.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 18,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "mEvqgG5FIDH57NIAgUxZRA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. D&amp;#39;Commonwealth Roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mEvqgG5FIDH57NIAgUxZRA/o.jpg"
      },
      {
        "img_id": "koTYYcwxZ7AHrjhLnkcLKw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Tempura roll",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/koTYYcwxZ7AHrjhLnkcLKw/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "qR6B9juvfPARAaznxeau_Q": {
    "date": "1/5/2019",
    "text": "It was 8:30pm on a Saturday night when everything went wrong. The hostess told us we weren't able to be seated - it would be another hour - even though we made a reservation. We calmly managed the situation and were seated a few minutes later.  We already had a bad taste in our mouths when we sat down to eat. Our server was friendly, perhaps because she knew what we were about to endure. We all ordered - a few miso soups, salads, edamame and sushi. Simple enough you'd think.  The first 45 minutes were okay. We chatted about life, our families, frivolous things. Finally a few seaweed salads came out. 45 minutes to put some seaweed on a bed of greens. Interesting.  30 more minutes pass and the server delivers our miso soups with a broken smile.The soup is hot, and we were starting to get heated as well.   At this point we're wondering if the chefs are okay since the edamame is still not here. If you've ever been to a sushi restaurant, that's the first item that comes out within 15 minutes MAX. Once the edamame arrives we know, we KNOW our sushi can't be far behind.   We were so wrong. Our sushi arrives at a cool 10:15pm. In the meantime, our server begrudgingly serves us cold gyoza \"for the wait\". It is ICE COLD.   As horrible as this entire experience has been, all of the food was phenomenal. I just f*king hope they have TAKE OUT!!!!!    Ps I got the Clean Roll. It was great.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2w892G5Jn0wXDg2rfRerhw",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2w892G5Jn0wXDg2rfRerhw/o.jpg"
      }
    ],
    "user_id": "sgiHInbb3TscAj81W3H4oQ"
  },
  "uNR3Hj_QWhxNvHinc0vlgg": {
    "date": "1/29/2019",
    "text": "Finally getting around to trying this sushi place out in Charlotte and it didn't disappoint.   We felt the need to try the infamous flaming sushi roll which was beautifully presented and equally delicious! And also ordered a couple apps and another roll to share.   The place is cute and the kitchen is upstairs. They have 3 separate kitchens, so your food arrives as it is ready which means no cold food! I like this concept and it is an excellent place to share several dishes with friends.   I was participating in dry January so did not try a famous cocktail, but my friend did say his was delicious, so I will have to go back and try one!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vRMlt2TBsH5_efNSJLGD7w"
  },
  "MDH65to1uHNNO4xmbB8Jfg": {
    "date": "6/19/2018",
    "text": "I have been anxiously anticipating Sushi Guru's opening in Plaza Midwood. For the most part, they did not disappoint. Since it's a new location, this review requires some detail. This is a very hesitant 4.  Parking- 5 stars I truly appreciate complimentary valet in any location which parking challenges. Such is the case for Sushi Guru. As a result, the owners were ingenious enough to add a parking lift to allot more parking spaces. I wish more Charlotte business would take this approach. Valet staff were super friendly and provided much care when parking cars on the lift.   Service- 4 stars  Lily, our server was as amazing! She was friendly, helpful and made great menu suggestions. We could tell that she had a lot of experience in this industry. However, the service throughout the restaurant appeared to be a bit frazzled.   They were well-staffed but at times it seemed to be lack of communication between the front of the house and everyone else. Likewise with the food. Our appetizers and meal came out almost at the same time.  Food- 3.5 If I'm honest (and I am), I've had better sushi in town. The crab dumplings were good but not great. I appreciate the fact that the ingredients were mostly crab. But, they seemed to lack a binder and a bit of flavor. The sushi was okay. The flavors in the roll seemed a bit incohesive. I had the Daikoku's Mallet which was not what I expected but paired well with the dumplings.  Atmosphere- 4 They offer a great atmosphere including 2 levels and outdoor seating. It is a bit tight downstairs but I love the idea of street side seating with easy access to the inside bar.   I plan to give Sushi Guru another go in a few weeks. It's a beautiful atmosphere and great location!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-qY_H5Dlt02kVKCNlYRGEQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Parking Lift in main parking lot",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-qY_H5Dlt02kVKCNlYRGEQ/o.jpg"
      },
      {
        "img_id": "1vhkoADaLOZCgUYNMVs6rg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Downstairs bar",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1vhkoADaLOZCgUYNMVs6rg/o.jpg"
      },
      {
        "img_id": "h3yr07DaJBU4POttxXafeA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/h3yr07DaJBU4POttxXafeA/o.jpg"
      }
    ],
    "user_id": "rK-vIBZ90hieDots3Clc4g"
  },
  "vNK60FYDrdFy7p3lmIjqNQ": {
    "date": "7/23/2018",
    "text": "I stopped in to Sushi Guru on a Wednesday around 6:30 pm for dinner.   My timing was great - it wasn't busy at all.  Our server let us choose the table we wanted and got our drink orders very quickly.   The delivery of the drinks, however, did not go quickly.  We didn't order anything complicated...but, evidently there were no clean champagne glasses --- and this took about 10 minutes to fix.  But, with drinks (finally) in hand, we placed an order for seaweed salad, 9-piece sashimi, jalapeno/white fish roll and Midwood Poke bowl.     The seaweed salads came out quickly.  They are presented in a bowl that is filled 90% with iceberg lettuce and topped with seaweed.  Honestly, it was a fairly small seaweed salad for $5.  But, it did taste quite good.    The jalapeno/white fish roll (I can't remember the name) was really good.  It had a bit of a citrus flavor that really complemented the fish.  The sashimi plate only came with 8 of the 9 pieces...  The poke bowl was very tasty - but hard to eat.  There's alot of food shoved in a narrow, smallish bowl.  It would be easier (and more delicious) to eat if served in a larger, more shallow bowl - allowing to pick and choose flavors in the bowl together.    During dinner, I did order another sparkling wine --- questionable decision -- as they had to find and wash more glasses before serving.  Please, get more champagne glasses in stock!    Overall, the food was great and the service was very good with the exception of the slow bar service.  We'll give it another shot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "128PgrHaabhIg2v5KtqbAA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Midwood Poke",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/128PgrHaabhIg2v5KtqbAA/o.jpg"
      }
    ],
    "user_id": "P0g72ss7P25E4A1Sb-LT_A"
  },
  "_LhEbMdFbbvmJAdpyWWQXA": {
    "date": "7/15/2018",
    "text": "I've been a fan of SG since they had a small stint at Press uptown. They later opened up their own official spot in southpark and just when I thought I loved their rolls, they introduced me to their flash smoked salmon and tuna...AMAZING! Now that they opened up in Plaza closer to where I live I was excited to see what new things they would roll out.   I'm a stickler for bad service and i have to say, I found everyone to be extremely pleasant and professional. I also didn't find like some of the fellow reviewers, that it took too long for food, so all good there. I honk it might be a variation of things, the day I went was early in the evening, on a Monday. There is an outside patio and rooftop. There isn't much of a view on the rooftop and very small but it's still pleasant. There is a bar upstairs where the kitchen is, downstairs has the poke bar and sushi bar. What I was very impressed with was not only valet parking but their NY style stacked parking lot area to help with how tight of space they have in their parking lot area (see pics for all referenced).   Let me get to the heart of my write up, the food, which did not disappoint. The Guru roll is awesome, tuna, avocado, onion crunch. The ahi tuna pizza is another one of my staples and exactly how I remembered it, delicious. The pork dumplings were also great. Their Moscow Mule was refreshing.  All in all, I will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lxOMJH_a1_hM76efjeX4jQ",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Upstairs bar and seating",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lxOMJH_a1_hM76efjeX4jQ/o.jpg"
      },
      {
        "img_id": "TLmJjkgVP6ViHstvecxzqA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Valet parking",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TLmJjkgVP6ViHstvecxzqA/o.jpg"
      },
      {
        "img_id": "4LVTr3MUKq59wAVVAYRXhA",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Parking",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4LVTr3MUKq59wAVVAYRXhA/o.jpg"
      }
    ],
    "user_id": "k24kSTpZHUdEd-QYXLy3fQ"
  },
  "PRdmV6Ej-d6TctIM4r7R9g": {
    "date": "4/13/2019",
    "text": "It pains me to leave a 1-star review on a neighbourhood restaurant, but this place is just poorly managed.   We should have known from the initial experience of being greeted by a distracted and unfriendly host that we were in for a bad ride. She quoted us 15 minutes but didn't take our names. A few minutes later a few parties came in and she began taking names. 20 minutes later the couple that came in after us gets called to be seated. A server actually noticed this and apologized. The host seemed unapologetic and did nothing to resolve the situation. I believe the server actually ended up seating us! More on the host later...  So we finally get seated in the downstairs area right where you enter. A somewhat awkward table especially since the downstairs bar wasn't even being manned. A few minutes later(we are 30 minutes into this experience) our server finally comes to take our order. She was the only redeeming factor of the experience as she was kind, knowledgeable, and friendly. We put in our drink order and the wait starts. She informs us about 10 minutes later that there is only one bartender working on a Friday night so our drinks will be delayed. We have waters so that is nice until it takes well over 35 more minutes to get... drinks. Yes. We are now 1 hour and 5 minutes into dining and we got drinks!  Our food finally came about 15 minutes after our drinks arrived. 1 hour and 20 minutes in! Sadly the food is wrong. Two of the three rolls we ordered are not correct. The server again was very apologetic but didn't exactly seem ready to comp the wrong items. We did receive more expensive rolls, but again they were not what we ordered. She stated she would just charge us the price for the cheaper rolls which seemed odd as we just really didn't get what we wanted. To be fair she did offer to have what we originally ordered made but said it would take extra times. We didn't want to be in there any longer so I became pretty blunt that we did not want to pay for at least one of the wrong rolls. She quickly removed one from the tab, but really that wasn't enough in my opinion.   During this time we noticed the unfriendly host is getting ready to leave. I happen to notice her walking out of the door and get in her car. The car is parked in the absolute closest spot to the restaurant. After the whole bad experience that just really rubbed me the wrong way. I would instruct employees to park further away so diners could park closer.   My credit card sat on the edge of the table for at least ten minutes. Our server is just MIA. No idea where she went. Luckily I had cash so I was able to leave it and walk out. Who knows how long we would have been there if I couldn't have done that.   I never saw a manager, owner, or anyone who appeared to be in charge.  Overall the employees were in slow mode with no motivation to help diners. Everyone seemed very confused as if it was all their first day with no help.   If one of these issues occurred I'd honestly be leaving a high 3 or maybe 4 stars as the sushi was really good! Though with all the combined mistakes and failures it would be hard for me to ever return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "vBnlaFpkCOIhHVe9deuM9Q"
  },
  "uEMmntr5ZTEPVdaHfFQ4ig": {
    "date": "7/26/2019",
    "text": "Sonia was a sweet server and very attentive. Guru roll and commonwealth roll were both very tasty. the crab dumplings were too dry (absolutely no cream cheese anywhere) for our taste. overall, pretty good food and excellent service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fjLuzkmtJWOqBhac8JtFRA"
  },
  "hIpK9KF_nVgpiNL7M4cy4g": {
    "date": "7/25/2019",
    "text": "The food here is delicious and the presentation is amazing. Our server Morgan was delight and such a cutie. She checked on us often and made sure we had a great experience. I was just here 4 days prior and had to bring my best friend back to have the same experience as I did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "45-zfsNuN51hwwOI7nQ3Aw"
  },
  "Wwc1WnLr5oHfn9MGF515yA": {
    "date": "7/14/2019",
    "text": "Ramen was cold and had like 4 spoons of broth. Maybe it's what they are going for but it's not tasty. Service was super slow. Also they bring your appetizer out after they bring out your main course--makes no sense.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYZ9x2ergC76xulOOKUuBQ"
  },
  "hcXUw7sScoTeXPz8l5aNdw": {
    "date": "10/11/2018",
    "text": "Wanted sushi so decided to tryout a new spot. I've been to the one in Southpark years ago and didn't know that opened on in Plaza Midwood not too long ago so decided to give it a try. It was about 7pm when we arrived and there was a lot of people by the hostess stand, but upon entering all parties were seated rather quickly. The restaurant its self is really nice and I like the layout, it's upstairs and downstairs with both having outdoor seating. We were seated upstairs near the bar. The air was on blast so it was pretty cold but I did have a jacket so it wasn't too bad. Our server Austin came and greeted us with waters and got our drink orders. He was awesome the whole night! I ordered the Penicillin and my friend ordered the drink he suggested which was the Daikoku's Mallet. My drink tasted like it could actually be the medicine penicillin, it was so gross. I couldn't taste the honey, lemon, or ginger at all. And after looking up Islay Scotch I realized that was probably what overpowered the drink. Austin was great and took it back & offered another drink so I got the Tommy's Margarita which was good a basic Margarita so can't go wrong. My friend did really enjoy her drink. I did see the bartender tell our server to explain the penicillin drink to customers bc it gets sent back all the time, and my suggestion would be to take it off the menu if no one likes it but glad it wasn't just me. For starters we ordered the crab dumplings and calamari, the sauce paired with the dumplings were bomb but the calamari was way too bland, highly disappointed. For Rolls I got the D'Commonwealth (very IG worthy lol) that comes out on fire. It was really good the only downside is with the lump crab you do run the risk of getting shells which I got in almost everything piece but the roll itself is worth it just be careful not eating too fast. My friend got the Guru roll which would have been my second choice if I wasn't getting full and I would recommend that one as well. All in all I had a good experience and will be back! Hopefully I get Austin as my server again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OKYmh1jd3PBa5cgpSDqR8A",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. GURU ROLL",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OKYmh1jd3PBa5cgpSDqR8A/o.jpg"
      },
      {
        "img_id": "56H5dJ2g9ktwfCsxEpDydg",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. Daikoku&amp;#39;s Mallet &amp;amp; Penicillin",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/56H5dJ2g9ktwfCsxEpDydg/o.jpg"
      },
      {
        "img_id": "OaH36kfmtQ9bMThAeWsX3A",
        "caption": "Photo of Sushi Guru - Charlotte, NC, United States. CALAMARI",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OaH36kfmtQ9bMThAeWsX3A/o.jpg"
      }
    ],
    "user_id": "O3cItff0mKAfXtl5VmbW2w"
  }
}