{
  "8V-UPh6SsgRjC_MN022h9w": {
    "date": "1/26/2016",
    "text": "excellent burgers for a cheat meal. the staff were friendly and helpful. above all relatively reasonably priced and plenty of tv's to watch your favourite games - even one right on the wall by our table. Ill be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9e6rMrq_FS1BwZgA6HQniA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Awesome set of TVs for a burger place - decent!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9e6rMrq_FS1BwZgA6HQniA/o.jpg"
      }
    ],
    "user_id": "iImnb-W4UaMsLsXd9Eq3EA"
  },
  "76YSQcKNDUQHauYpGPio3w": {
    "date": "9/17/2015",
    "text": "Me and my boyfriend went here the other day to do a quick lunch date so we ordered a bunch of wings and I asked for them to be extra done they actually brought out raw so I called the manger to let her know and she tells me they got young chickens that hatch to early and it causes the bone to leak I just said ok and I will never return",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zT9dYC2aDLkEyzjNASYA-g"
  },
  "Eb16RrQMAimpmJgPiVRzww": {
    "date": "8/25/2013",
    "text": "I've rolled up in groups of 8+ both times I've been here for Trivia and they've been able to accommodate us both times (impressive).  Although, your full group has to be there in order to be seated.  Trivia starts at 8pm on Wednesdays and is fun.  Teams get points for drinking specific beers or drinks or shots, therefore a team that drinks strategically can easily win.  The questions are entertaining and challenging.  Example: an entire category where the answers have \"poo\" in them or one word to describe a movie.    Kickstand features salt from Salts of the Earth (of 7th Street Public Market) as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "GJJSgRzXyG2W8PaZysFzOg": {
    "date": "1/8/2013",
    "text": "This place was awesome! I am definitely coming back! We visited back in the summer and enjoyed the live band on the patio and the overall atmosphere of the place.   My boyfriend built his own burger and was truly impressed by the size and taste of it. I loved the syrup that was served with the sweet potato tots.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "WIrLud8WzGjj2EZfRBW_zg"
  },
  "qQOaKsKxRbCVPB-rCWPo8Q": {
    "date": "9/18/2015",
    "text": "The food is absolutely great, good quality. However, the service could be better. Checks were mixed up, and also the orders. And little things like napkins and refills were forgotten at the last minute.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "7w_KEUJsVQuvaxSRxnQ8pQ"
  },
  "VqfbZOFwnQXh6mfixqfmXg": {
    "date": "1/10/2016",
    "text": "The food here is great but the last two times I've been here I've really struggled with the service. It's really simple things like refilling a drink when you've seen it empty the last 3 times you've been at our table or writing down my order so you don't forget my \"build a burger\" request. The last two times I've been there, they've forgotten half of the things I wanted on my burger. Tonight, when I requested the forgotten items, I got attitude from the server. When we showed up tonight, we were told there was a wait which was absolutely no problem, but only to find a completely empty area of about 10 tables? We weren't the only ones told we needed to wait, but seeing all of those empty tables and plenty of staff made us scratch our heads a little bit as to what exactly we were waiting for.   **update We came back after generously being offered a gift certificate for the last visit. We brought 5 other people with us this time to try it out because we have been talking about how good the food is. We got the same waiter which was a bummer because she still seemed to want to be anywhere but there. Other than that, our food was awesome and correct this time. It took a little while to get the food out, but overall it was a little bit better of an experience. I'm updating to a 4 star review from 3 stars for the customer service of the owner and the food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PvpaKhX-ge3Tjr_XpheO5A"
  },
  "xEh-jtrhLiBdXS7pCbQGsw": {
    "date": "2/12/2016",
    "text": "First time here and I highly recommend the build your own burger. The portions are just right, they're flavorful and highly satisfying. The staff were courteous and the atmosphere is awesome! I'd definitely come back for some of the midweek drink specials or other food choices. This may be one of the best burger joints in Plaza-Midwood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VqX7r2a45S5iTJcw0A4DA"
  },
  "AWFkr9Zxkgm8jVnodDmiNA": {
    "date": "7/5/2015",
    "text": "Kickstand has good bar food.  It is a fun place.  The service is good.  The casual appearance fits the neighborhood and the menu.  The only negative is the parking lot, but it sort of goes with the neighborhood.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NqzqrENgSH3Beg_-BpIy2w"
  },
  "XpHRvwdja3H4ZbEPc0KRQQ": {
    "date": "6/27/2013",
    "text": "My husband and I have visited Kickstand twice now, and both times we left satisfied and smiling. Both times we each picked the build a burger. It's just how it sounds, so I picked a single patty, with cheddar cheese, and an english muffin (toasted). I've also had the wheat bun, but definitely English muffin for the win.   I've had the tater tots, and the fries, and both are good, but I think tater tots slightly edge out the fries. My husband also got the gourmet corn on the cob, but it just had too much on it for my liking (cheese, butter, salt, etc.).   We got the layered nachos and they were good, but a great tip from JJ was to get the pimento cheese fries. I'm sure we will be trying them soon.   One of the best things is that they have multiple ciders on draft. They also have Red's Apple Ale on special (or at least when I was there) on Friday, a 22oz for $3.50. Can't beat that.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "wnk17Cjg9ZjShnkkIbfMQg": {
    "date": "10/5/2015",
    "text": "Good local beer selection. Great chili and steak salad! The wings are pretty awesome too.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxH7FxoJy4F0wsF7mxYQ_Q"
  },
  "JcUF9YYAqHR3k53HGcfxaA": {
    "date": "11/29/2015",
    "text": "Since i am a vegeterian I always look for veggie burgers, and i super recommend this one! I had it swiss and mushroom style and it was really good! My husband had the cuban and he loved it! We will be back for sure!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N5qgwjzZ7UobpTRh6cXTRw"
  },
  "GMJSXgQouRFvQDk8elcByQ": {
    "date": "8/15/2013",
    "text": "Burgers and Beer ,with trivia  Came for the Wed. trivia, and had a couple beers.  The prices were average $4-5 for a micro-draft beer.  The Nachos plate was big and had nice chicken chunks.  The Trivia on Weds is fun, and you get extra bonus points if you order certain drinks during the game.    Staff was nice and accommodated our huge group.  I would like to come back and actually try one of their burgers.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-1biwACMAHTD4AtOlWnpQ"
  },
  "UQHOUYL2RyuA5FbYIe7Fig": {
    "date": "9/5/2012",
    "text": "Not quite 3 stars, but not quite deserving of 4.   As burger joints go, Kickstand's got plenty of personality and charm. I love their bicycle motif, and the bikes regaled with beer logos serve as both a nice touch and plenty of advertising for local and domestic brews.   Burger-wise, though, there's nothing that really stands out. Kudos for introducing a different spin on burgers, topping them with several veggie combos one wouldn't commonly think of, but, frankly, their burgers don't really knock me out. For one, the patty itself is achingly small, in comparison to other burger shops around town. And the patty tastes alright. It could stand a little extra seasoning.  Having heard plenty about Kickstand, I must admit I was mildly disappointed. But I'm very willing to give Kickstand another shot, because it does possess some redeeming qualities to make me a return customer.  But, really, a burger should kick me in the ass. Instead, a taste of their burgers felt more like a toddler nibbling your finger with their baby teeth.  Oh, and keep in mind...parking sucks. If you show up at an off time, you're golden, but when the joint's crowded, you're SOL when it comes to parking in their offensively small parking lot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "jr212HQAwMOXGYKkZLfQvA"
  },
  "3LUlwUu7x2PwdmrczJjlmg": {
    "date": "11/13/2016",
    "text": "Absolute best burger I've ever had and very friendly staff. Great place to watch the game on Sunday they have a tv at every table and several more throughout the place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eUjNZWsT3OX0niludifDAQ"
  },
  "MhIpyWO7Ho5tiW-pP07pLw": {
    "date": "10/20/2012",
    "text": "Wow! Tried kickstand for the first time today for a late lunch and to watch football. Nice interior and great patio. Has 42\" tvs every 3 feet so you can watch any game you want - they have the EspN game plan, fox sports package, and big 10 network ... Plus nfl Sunday ticket! About 25 beers on tap plus lots of bottles - & the burgers are delicious!  Great find.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "tyGbO1r_2avF6retF5Bj2g"
  },
  "ZfWUFyQ8rOsJ-wg1_8zN2g": {
    "date": "6/28/2012",
    "text": "Great neighborhood spot. The food is priced right for the quality. Had the vegetarian sliders last visit and they were great with just the right amount of spice.  Four stars because its too loud inside and service is choppy - slow at times. Great place though. Definitely recommend it!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "Rx-V6MiWjYfG9MhIgl_UeA"
  },
  "baP6qLr9Dh8Pc4gMWQw5YQ": {
    "date": "9/25/2015",
    "text": "I had a random craving for wings and usually make them myself because other places just never do them the way I like..these have to be some of the best i've tried in the Charlotte/plaza midwood area.  I ordered them to-go so can't say much else about the place, but they were friendly, order was ready despite a busy evening, and food was delicious.  I will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mnyhmhtlH7P3VQqnEcCzCg"
  },
  "3PUhPqLWTfOpLKr1FGRR8Q": {
    "date": "6/8/2015",
    "text": "A friend suggested that we check out kickstand since we were in the neighborhood. It is a cute little place and we were in the mood for burgers so it worked out well. We ordered the fried pickles, my husband likes spears so those were good and he liked the breading(he's finicky). My mom got the Swiss and mushroom sliders and she said that they were good because there wasn't too much cheese on them.  My husband got the hungover cyclist which is a burger between 2grilled cheese with a side of tots and was happy with his choice.  I got the Greek burger with a side of fries. I was not as happy with mine. The tzatziki, feta and olive topping didn't have much flavor as I was hoping for and the fries were not good at all. IMO that is the easiest way to ruin your burger is to have disappointing sides.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6OGq1k2r75dOmcQ4LxBTqw"
  },
  "x1nYwSmAD94BvrnqzLqRUQ": {
    "date": "5/31/2015",
    "text": "My son said it was so good he fell in love with the kickstand!! He has always gotten a cheeseburger with mayo bacon and he said by far this is the best burger ever!!! FIVE STARS!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KdXtgpyvKSHuH9EN5xtGsA"
  },
  "rb0ozEocqu9c1HZqRyuG-Q": {
    "date": "10/25/2016",
    "text": "About 7 months ago I moved back to Charlotte, in an effort to reconnect with some good friends (about 8-10 regularly) and set up a weekly gathering close to our neighborhood we picked Kickstand at random. First and foremost...I want to make it clear... I won't go in to this building unless Sean-Chris-Kenny are working (sorry Chef X I don't know your name, but you're awesome too and have a mighty beard). These dudes make it happen, and are the best waitstaff I've had. Especially Sean, putting up with our wild demands for spicy things that aren't even on the menu and ludicrous sauce requests. The Monday night 2.50 draft deal was fantastic because it was only local drafts (KILLER). The wings are actually so good that I haven't ordered anything else, ever. I've eaten the same wings, and flavor (Spicy Tiger) for 7 months every Monday. The outdoor seating is great for cool days, and inside there are 7 hundred TV's with all the sports playing. Anyway...Kickstand has been a really awesome place for us to get some great wings and catch up with friends a few hours every Monday...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fWSG9fiXFnkVw4fIMYz1GA"
  },
  "6BxTIWXjumIEDbYdctxqYA": {
    "date": "7/12/2017",
    "text": "Delicious! I highly recommend the Booty Burger or the Cross Country burger. Tots go great with any burger you get. The atmosphere is great, too... very welcoming and friendly staff!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ZciEVU7CZZZDj5mdJZKnw"
  },
  "X0GZEG-EM94zS6HYI-X57Q": {
    "date": "12/5/2015",
    "text": "If I was to solemnly rate the burgers then I would give it a 2 stars. Honestly, the burger didn't really wow me and the beef patty was a little dry. My boyfriend and I shared the Cuban burger and it was nothing really special about it for me to order again. Maybe next time I'll try the fender bender (heard it can get real messy) or the booty burger.   We also ordered the Garlic Parmesan Wings, Fried Pickles, and Shell&Cheese.   Wings: I was expecting it to be a dry rub season type of ordeal. It came out to be like a garlicky cheese sauce that was poured on top of chicken wings, I wasn't too fond of it.   Fried Pickles: THE BEST FREAKIN' ITEM ON THE MENU... PROBABLY ON THIS EARTH. Instead of small slices of fried pickles, they came out in wedge sticks of fried pickles.. If that makes sense. The pickle itself still had its crunch and the batter was fried to perfection!! Must get!!  Shell&Cheese: This is probably the dumbest question but is there such thing as too cheesy? Lol the flavor was awesome but the cheese and shell pasta ratio was kinda off..   Service was nice. Our server asked my boyfriend and I if we were splitting our meal upon each other while taking our order and when he brought out our food, they split the burger for us on different trays. That was really nice of them.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oKaM5MTlyYb_ptyz8U_ZPA"
  },
  "7Cy94T2gv29ritB5hzuJ8g": {
    "date": "2/17/2017",
    "text": "Perfect place for a burger! When you feel like a burger and beer, this is the best place to get it! They are extremely juicy, toppings are fresh and tater tots and fries are perfectly crispy!  I'm not a hot dog person at all, but got tempted to try one, and it was delicious! Service was also great! Totally recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3y2rbmUXQTO8rwyfcBPRlw"
  },
  "PvFid46WruRhr5wvNm6dqg": {
    "date": "2/12/2017",
    "text": "Its ok.. service is just ok.  The burgers are meh..again ok.  Didn't know there was an uncharge for sides, guess I should have read the menu with more detail.   I wanted a burger and I got one and it was extra mehhhhhhhhhhhhhhh. I normally enjoy the Plaza-Midwood area but I probably won't be back at the Kickstand.  More interested in the Mexican spot next door.....",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VpHIz0qXBpjW7sYGB_IufQ"
  },
  "UdRRQEJp7dorwpfP75kuGQ": {
    "date": "12/12/2013",
    "text": "Grabbed dinner here last week, and let me say - big fan of this place. Great service, great burgers, GREAT beer menu. Anywhere with a bunch of local brews on tap can't be bad in my book, but what's more, our waitress impressed the socks off of me with her knowledge of the beer menu. She had clearly tried all of the beers they had listed and was able to describe them and make recommendations based on what we said we liked. What's more, she was just...pleasant. Nice. A great waitress. Really seemed to like her job. Hats off to Kickstand for the training of your wait staff! It really did positively contribute to my experience.  On to the burgers! I recently went to Block & Grinder over on Providence and had their burger, so it's hard for me to not compare them. B&G's burger is clearly a statement, with the branded bun and the premium condiments, and I can definitely appreciate that - it was a great burger. But Kickstand's burgers are good in their own right, and what they might lack in quality (no, they don't have a Gruyere cheese option, sorry), they more than make up for in breadth.   I went with the build your own burger, and wasn't disappointed - it was a quality specimen. And I love that they serve their burgers with tots! It's so...Napolean-Dynamite-give-me-some-of-your-tots. I went with what I've deemed the \"breakfast\" tots: sweet tots with brown sugar butter syrup. YUM. The reg tots were good too, though.  I, for one, will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1pZ9qywM0iJvuXxHYyz_wA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1pZ9qywM0iJvuXxHYyz_wA/o.jpg"
      }
    ],
    "user_id": "5aEtVEtCBLIX4tEuX1i3Hw"
  },
  "JeETHkh82Zfqd5najkT3Bw": {
    "date": "1/18/2018",
    "text": "Cool place, packed up quickly, great burgers and sides  for sure and service was perfect for our big group!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gE4A7gd5x6YNVYeC5ZgVhQ"
  },
  "yLTCaOseA567Xk8jqFcFGw": {
    "date": "4/25/2017",
    "text": "Kickstand never disappoints. Have been there  six times+ and on different days, different times of the years. Burgers are consistently good, onions strings will probably clog my arteries but I'll die happy, beer options are plenty and wait staff is always spot on. Even the manager knows a fanny-pack wearing doofus when he sees one. This will always be a go-to spot for us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ii_vgn8-rHG3W2lE5TiZrQ"
  },
  "ZDH3oCvxNcUcJaGBx_NLqg": {
    "date": "3/5/2016",
    "text": "The food was good and tasty. The service was a bit off. The staff was a slow to refill drinks and the restaurant was not very busy.  The champagne mimosas were a treat at $2.00 on a Sunday morning. We will definitely return. I came back for lunch at kickstand and it was awesome. The service was great and the staff was sooo friendly.  I enjoyed the chicken sandwich, corn on the Cobb and pimento cheese fries. The corn on the Cobb was new to me and it was delicious!!! This is a great place to bring friends and hang out",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3eGYUk1lm3ChCJohJQHwA"
  },
  "DfcfLUZVTo9EPe7NAhLXEQ": {
    "date": "10/17/2015",
    "text": "Yooooo! This place is probably THE BEST BURGER (well turkey burger) PLACE IN CHARLOTTE. not to be over the top but the food here is really good. I had a Turkey burger with a fried egg, tomato wheat bun and garlic mayo. (Picture provided) It was really good....I ordered avocado but they forgot to put it on my burger so they get a negative for that but I will return when I'm craving a burger! The beer selection here is pretty good a lot of local beers which I like that. The Decour in the building is awesome a real cool dive bar feeling with great food. I had a pumpkin ale that was phenomenal. And the waiter was really cool. All in all this was a great dining experience!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ESt4k1HWGzQ7CJDDzimD4g",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. A turkey burger on wheat bun with a fried egg and tomato and garlic mayo. Banging!!!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ESt4k1HWGzQ7CJDDzimD4g/o.jpg"
      }
    ],
    "user_id": "bm2tUuhog7tMu7EqfN7BNw"
  },
  "rvO6VTlR6GBhafmMMWfYfQ": {
    "date": "1/1/2016",
    "text": "Kickstand, we like you a lot. You're a rare breed. Tons of tvs... even little personalized ones at every booth. Your food is great, your service is spectacular (tall dude with beard and glasses... he's freaking awesome).   LOCATION Plaza Midwood-ish. If you're on Hawthorne, turn left onto Central.. It's next to a Mexican Restaurant. They share a parking lot in the back. There is a TON of parking.   AMBIANCE Relaxed, laid back... all the things you want on a lazy weekend. Not a frat-bro sports bar (thank GOD). SWEAT PANTS APPROPRIATE.   FOOD We had the wings (Spicy Tiger and Barbalo) and the tater tots.  The wings were great - they were thinly breaded and super crispy. The sauces were both great but by the end, we preferred the spicy tiger. I think the vinegar in the Barbalo got to both of us. The wings come with a good helping of celery and ranch-- which is always a plus in my mind.   Tater tots...... the side order gets you an entire plateful. This is the first time that we didn't finish the entire plate. The tots are crispy and stayed crispy for the whole hour we were there. AMAZING.   The CO2 machine is broken right now.....btw...... it would've been nice if we were told that before we ordered a diet coke..   But seriously though, the beer specials are great. When we went, 16 oz. domestics were $2.50.. that's pretty great. Mondays are Charlotte beer nights with $2.50 drafts. Pretty awesome.  We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YgRclUfGOFUcoslAXaZFgw"
  },
  "qnmbM_RIx6C60M-tx47BVg": {
    "date": "3/11/2016",
    "text": "I stop here every time I go thru Charlotte on the way to a racing event.  (And every other time I happen to be in Charlotte!)  Ambiance is awesome, quiet enough, but not dead.  The beer selection is decent and the sides are atypical and interesting (and delicious!)  But, we're here for burgers, right?  Where else can you get a meatloaf burger built the way you like?  Lots of customizable options, too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JgtRBQQIPW5nZz1qB26hOw"
  },
  "XnoxyTjy7IVVkoHRaRHBhQ": {
    "date": "3/13/2014",
    "text": "I've been a few times now, twice for a late lunch around 4/5ish and once on a Saturday night for March Madness and I've had:  FRICKLES!!!! omg the best ever! Chicken tenders - 10 Fried Mozzarella - 10 French Dip sandwich - 9 Onion Tanglers - 9 Build Your Own Burger - 8 Tater Tots - 8 Fries - 9 Citrus Chipotle Wings - 9  This is my new go-to burger joint. Tied with Pinky's for the best in Charlotte that I've had so far.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q-b67SOmaSMWyblGx7zmjg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. french dip sandwich + onion tanglers",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q-b67SOmaSMWyblGx7zmjg/o.jpg"
      },
      {
        "img_id": "P7-ngY2btX2qxqTwjlPwRw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. citrus chipotle wings",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/P7-ngY2btX2qxqTwjlPwRw/o.jpg"
      }
    ],
    "user_id": "VY-W1xPpLT7TqpQyjxheKQ"
  },
  "pV0qaUorLx13w8fnPFpy_Q": {
    "date": "3/8/2017",
    "text": "I went a few weeks ago looking for trivia based on an article I read that said they did half price wine on Wednesdays and trivia. They weren't running the promotion anymore but the manager working gave it half price anyway, which was a pleasant surprise. They are still doing trivia and that was fun, plus the food and service were good. Manager was super friendly and checked in with us from time to time. Great, relaxed atmosphere. 4 stars but 5 if they bring back half price bottles of wine!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OfuSljOi0jPDnvHsmB1MA"
  },
  "FpoWKJ5-hlZ3KtV1Bd0fLw": {
    "date": "5/28/2011",
    "text": "I met up with some friends in Charlotte last night and they took me to Kickstand.  If they hadn't told me this was a burger joint, I would have mistook it for a sports bar.  In fact, if I lived in Charlotte, I'd probably come here to watch sports.  The restaurant shares the same building (and restrooms) with an Americanized Mexican restaurant next door.  To enter either restaurant, you must enter a common area in between.  This area has a few TVs and arcade video game machines.  Kickstand itself has a ton of TVs.  Some of the booths have their own TVs.  There's a long bar and a separate room where I saw some Wii action going on.  There are also some outdoor patios.  Kickstand offers a wide variety of burgers, about 20 different kinds, that range anywhere in price from $7 to $14 per plate.  Each plate comes with a side.  Some of the more interesting sides that caught my attention include the sweet potato tater tots (\"sweet tater tots\") and the gourmet corn on the cob.  I ordered the sweet tater tots because I've never had tater tots made out of sweet potatoes before.  The tater tots looked and tasted just how you'd imagine them.  If you've had sweet potato fries before, it's the same idea.  You get the same sweetness and consistency of the sweet potatoes in your tater tots.  The sweet tater tots are served with a brown sugar butter syrup which is very rich and thick.  One of my friends got the gourmet corn on the cob and it looked like it was fried or slightly charred with seasonings and sprinkled with a bit of Parmesan cheese.  Yum.  As for my burger, I went all out and got the \"Hung Over Cyclist.\"  This burger has two grilled cheese sandwiches as the bun.  By default, the burger comes with just a tomato on top, but I asked for lettuce and onion too.  All this for just $7.50.  When it was served to me, it looked like a plate with two grilled cheese sandwiches, except the two grilled cheese sandwiches had stuff on top of them.  One had lettuce, tomato, and onion on top, while the other had a burger patty.  I added some ketchup to the patty, put the two suckers together, and chomped down.  Not bad!  The Hung Over Cyclist tasted exactly how it looked.  There was lots of extra bread and cheese because I was basically biting into two sandwiches at once.  It still tasted like a burger, though, because of the hamburger meat.  I finished everything, including my tots.  Towards the end of my meal, I realized the server did not ask me how I wanted my burger cooked.  I'm used to getting asked this in Atlanta, but my Charlotte friend informed me that North Carolina has gotten more strict about cooking meat, and most places will cook burgers well-done.  If I ever come back here, I think I'd order one of their traditional burgers.  While the Hung Over Cyclist was good, I ordered it more for the novelty of it.  One of my friends ordered the Kickstand Burger and it looked really good.  Our server was Adam and he was great.  Kickstand has ample parking in the back in a gravel lot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "-dQWuht4NoXItiyWssZB0g",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Hung Over Cyclist: two grilled cheese sandwiches as the bun for a burger with lettuce, tomato, and onion.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-dQWuht4NoXItiyWssZB0g/o.jpg"
      }
    ],
    "user_id": "j14WgRoU_-2ZE1aw1dXrJg"
  },
  "nwCwsR8M-0Vnoxv6RvHRCg": {
    "date": "1/28/2016",
    "text": "My boyfriend and I came here and sat at the bar for lunch yesterday. The food is always good here, and the service is too, however, yesterday they took it to the next level. The food was the best it's ever been, and the guy that took care of us (I think he must be the manager) was so personable and so attentive that it really made our visit amazing!  We've been here several times before, but we had such a great time there this past visit, that I think Kickstand is going to be out new regular spot! Also they have great drink specials on Mondays and Wednesdays!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NZbft3iS9rFG0KI4OlN7Tg"
  },
  "jTnJu0L6nL26ZDutJ3-QAA": {
    "date": "11/4/2015",
    "text": "Pretty good food and beer specials every time I go in there.  The burgers aren't super impressive but they are good nonetheless.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqhfMozc8Wp1ty_zDOis_w"
  },
  "OVPfmY17U2z3FdWQINR_Gg": {
    "date": "3/5/2013",
    "text": "I've been here several times before.  I mostly go when they have live music which is always good. The staff has always been friendly.  I mostly have had bar snacks. They used to have these loaded cheese fries that was AMAZING but the last time I was in, it wasn't on the menu. I'm sure they'd still make it for me if I asked. (Yes, they are that nice.)  I had noticed several times the shrimp burger but being at a burger joint I had never actually went with it. However, this past Friday, it was lent and I remembered the awesome shrimp burger. I was so excited to finally try it. I placed an order for pick up and it was ready and steaming in 15 mins flat. the french fries were even better than I remembered and I ate those right up.  The shrimp burger  . . . was different than I expected.  It was almost like a salmon cake. It was good, but not what I expected. The sauce was great. The patty was extremely moist. Maybe a little too much as it fell apart as I ate it. I would definitely order it again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "ki860330UL4xOJCAar5Iag": {
    "date": "1/19/2013",
    "text": "In the mood for a burger and wanting to try a new place, the hubs and I met a friend here recently for dinner.  First time for all of us.  They share a building with the Loco Lime and had a good bit of parking in the gravel lot behind the building.   One look at the menu and I knew I wasn't going to be having an ordinary burger.  I tried the Kickstand. I'm talking brie, cranberry chutney, and grilled onions.. WOOHOO!  It was a delicious burger!  I had the tots with mine, and they were perfect.  A friend of ours had a burger with southwest flair and fries.  I snagged a couple of fries because he said they were very tasty.  He was right.  My husband had a burger with TWO grilled cheese sandwiches for the bun.  Yes, that's right.. they make two grilled cheese sandwiches and slap a burger between them.  It looked like the heart-attack-waiting-to-happen that you'd expect, and the hubby said it was really tasty.  He also had the \"gourmet corn\" which was amazing!  We also sampled the Spicy Tiger wings.  I have had these wings on my mind ever since!  They were a great flavor combo and I will be back soon for more. I may have to try the \"fried grits and shrimp\" next time around, too.  That sounded amazing.  Kickstand boasts a decent beer selection and a menu that's flexible, inventive and varied.  More than just burgers, for sure.  We had excellent service and even on trivia night, the noise level wasn't such that we couldn't enjoy conversation.  We will be back for sure, hopefully on $.50 wing night, which is Wednesday!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "QXaRek__Hiw1UuyfzZ6DKQ"
  },
  "c9GdKwnsGqvG87SDE7FlGA": {
    "date": "1/16/2017",
    "text": "Worth trying.  Don't put it at the top of your list, though, if you're just visiting Charlotte.  If you live in plaza, may as well go there and catch a game.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v9FT1O5vdOHlzOYpyc-Y2w"
  },
  "80feqfNbtfuF6pydzRwqPQ": {
    "date": "2/17/2011",
    "text": "We went to Kickstand the other night for the first time to try out their burgers.  We were first impressed by the cleanliness and nice atmosphere of the restaurant.  We were seated in a booth that had its own flat-screen TV.  It was off and the hostess offered to turn it on.  While we appreciated how it would be good for sports fanatics, we opted for a non-TV dinner.    I love that the burger choices at Kickstand are unique.  They offer interesting flavor combinations.  My partner ordered the Cycle Zydeco Burger (Zydeco spread, Mardi Gras slaw, and Root Beer glaze).  It wasn't too spicy for him, and he's not a big fan of too much heat.   I, on the other hand, love spicy stuff, but went with the Greek Burger as a change of pace.  It had kalamata olive spread, tzatziki sauce, and feta, three of my favorite things to eat.  The sauce really made the burger.  The burgers themselves were juicy and flavorful, too.     There were also a lot of sides to pick from.  We both opted for the combo tater tots/sweet tater tots side item.  The regular tater tots were good, and the sweet (potato) tater tots came with a butter/brown sugar syrup for dipping.  It was literally like dessert.  What a great offering.    With the food, atmosphere, and service being great, what wasn't to enjoy?  We'll be revisiting Kickstand the next time we're in the mood for a really good burger.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-P_XZon6IbISRToQQ793kA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/-P_XZon6IbISRToQQ793kA/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "hvCrg5Gcr9XrsLcsCYdrPg": {
    "date": "8/24/2011",
    "text": "I came for takeout so I only got a fleeting glimpse of ambiance, but the place seemed like your usual sports bar flavored burger spot with lots of neon.  It was pretty spacious considering the well-sized dining area, generous outdoor patio and ample bar space.  I was also intrigued by the beanbags (that which you folks call corn hole) setup outside by the patio. But all gimmicks aside, the question one always asks at a burger bar is, where's the beef.  Or rather, how's the beef.  And you know, it was just okay.  I ordered the kickstand burger, which is a \"meatloaf style burger\" with some tasty accoutrements.  It sounded outstanding on the menu, but was not terribly juicy when I sank my teeth into it.  The grilled onions and fig spread on it were very tasty, the brie a bit understated.  Next time I'd substitute for a sharp cheddar or something like that.  There was something on the burger that didn't taste very good, it might have been the sun dried tomato relish, or else one of the meatloafy ingredients in the burger itself.  I'm not entirely sure. It had an... unwashed taste.  However the sweet potato fries were quite tasty, none burnt.  So overall the food was okay, but I think there are better burgers to be had.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "htzxDWzRt4Xd7UGy4t0yAw"
  },
  "WfZoRMcpkK81eXBfjjCK0g": {
    "date": "3/9/2011",
    "text": "For the past few months, I've been going to Kickstand pretty regularly every Tuesday for trivia night , and I really think this place has fallen into a good rhythm. The servers always do a bang-up job (quickly take your order and quickly have your food out). I pretty much always get the spin class burger, which has never failed to hit the spot.  The tater tots sometimes are a little room-temperature, but on my most recent visit they were piping hot out of the fryer and perfect.  Their root beer floats are a nice little indulgence every once in awhile, too.  It's a great scene here, and I'm glad they've manage to keep this space alive on Central.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "FSw3Kk2Ssn6vUe9asc5vsA"
  },
  "sS-Cvyd21L5JoG7J9UCL1A": {
    "date": "9/21/2014",
    "text": "My wife and I went to Kickstands for the first time last night and are we super glad we did. By far the best burger I have ever had. I had the Morning Burger and it was awesome. My first time having a burger with a fried egg and OMG I have been missing out. My wife is a vegetarian and she loves Black Bean burgers. She said it was the best that she has ever had. The real shining star was the exceptional service we received. Our waiter (Jeff ) was awesome and made us feel like we were on a pedestal. The manager was very attentive and made himself available if anyone needed anything. We will make this a regular spot for us. Totally recommend. Thank You Kickstand!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hytgLHUzlzuSiTe3XX2Ymw"
  },
  "wlQGwPWk7vxQtkbEgJS9Og": {
    "date": "5/13/2011",
    "text": "I really like Kickstand but there are a few problems that stop the all powerful 4-5 star review from happening. First off, me and my crew eat 99% vegetarian. Lots of choices ( compared to most places) for us to choose from. I love the shrimp burger and the black bean burger. You can also order a veggie burrito from Loco next door. The kids menu has a roasted corn on the cob that my son orders every time.  So three cheers for some non-beef options. Now for the bad. Music is loud and inappropriate for kids. Sorry, not to sound old but it's hard to eat with kids when Eminem is thumbing. Now take the loud music and add and ADHD effect with 57 tv going at the same time. So if you crave sweet potato fried and a decent veggie burger while eating inside a MTV studio then head to Kickstand.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "anExXbC_5v-60MmeeDSnHw"
  },
  "OYJ5FU8EwsDf81r9j9Hxow": {
    "date": "4/1/2011",
    "text": "I've never met a burger that I didn't like.  And, I still haven't.  This place serves up some pretty tastey burgers.  I've been here twice and liked both burgers and sides that I got.  There are a lot of different burgers to try and sometimes can feel a little overwhelming.  My advice, go with your first choice.  You won't be disappointed!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cI1HosrJtdXoLX8HhuTz9w"
  },
  "348h64v6GnjGxZut-VnO3A": {
    "date": "9/8/2014",
    "text": "Place has really gone downhill. I think management changed recently or something. Our favorite bartender was even let go. Don't understand what happened here but I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FddycBG2OGVO6M4PhckFVA"
  },
  "viFL7EkGT3a6B3W8gqvpxQ": {
    "date": "1/26/2013",
    "text": "THE BEST BURGER EVER!!!  The service is great. I've always greeted by several workers and sometimes I think the owner. I think this place is charlotte's best kept burger secret. The menu includes much many more awsome items other than burgers.  The sweet potato tots are a nice addition to the menu. Make sure you get there before 11pm if you want the full menu.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Nv5Bx1YF8MITYNDWEhnh_Q"
  },
  "iToCiM6o8QMTWONU5Mm2rQ": {
    "date": "10/13/2010",
    "text": "Why is that when a struggling rest/bar decides to close its doors  it reopens as a half-assed burger joint? Is it because it is a easy solution? It's not like Charlotte already has a million \"burger\" joints already claiming to have the freshest, baddest and most creative burger.  I personally enjoyed The Common House until its \"shift\" in their business approach upon prior to their closing resembled the staff at a  Sagebrush in Gastown.  On to the \"Kickstand\".......how novel along with the sign they blatantly copied from New Belgium Brewing Co.  I eventually stopped in to the barage of TV's everywhere........yayyyyyyyy more T.V's and burgers. Conclusion.............Lame! I'll give this place 8-10 months.  Once football season is done so is this place.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "60JpE6uNKm55POEV7LUa9g"
  },
  "w8I37tR84-9Rj0H7PNZenQ": {
    "date": "3/28/2013",
    "text": "FINALLY got around to eating at Kickstand, which is a shame b/c I'm all about some bicycles (which you could throw some more bicycle decor in there and I'd be happier). My friend and I went here yesterday for lunch- definitely a \"hipster\" feel to it, and after we turned the TV off at our table we were able to have a much better conversation. Our waitress- was hilarious. On the ball and helping us with some recommendations. I went for the Veggie burger- black bean. DELISHHH! Not too spicy and not too \"black bean plain.\" The fries were pretty darn good as well. One thing I thought added a nice touch- flavored salt. Yeah, not some new age invention- but the Smoky Merrywood flavored salt added a wonderful kick in my pants of flavor on my fries- I also dumped it on my burger (though the burger is good enough to stand alone). My friend got the Turkey burger with tots- also excellent. Even if you don't live near the Central area- trek over and make the trip to this place. Awesome food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "rq-BzoHF7EsCXMWMnhzDvw"
  },
  "ATBYezk19XrH9OoQpnZ8HQ": {
    "date": "10/17/2012",
    "text": "We were traveling in Charlotte and looking for a cool place to spend an afternoon.  This place was IT!  Great atomosphere, awesome food and excellent beer selection.  The owner come over to talk with us a few times, and our waiter was personable and willing to visit with us when he was not busy.  They have an awesome patio, although it was a little too cool for us to be outside.  We found a few cool places in Charlotte and Kickstand was the highlight of our trip.  Thank you for making our day!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "sBpCyuoWNVafKrgiu4QdMA"
  },
  "Y9SBQhK67rEJ9ej1O6GW7g": {
    "date": "2/19/2011",
    "text": "Yum! Just ate here. Veggie burger was deeeelish. It was made with black beans and had great flavor. I had a bite of my friends Greek burger which had olive tempenade and feta cheese. It had great tang. Amazing fries and tasted the tater tots. It was a combo of sweet potato and regular and came with a brown sugar dipping sauce ... Soooo good and soooo bad. Great service. The manager Ray was extremely accommodating and friendly.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "eLxD2wEYnxtNvEzCMP1tnQ"
  },
  "z72bun8YM24wqWTRh4_Mmw": {
    "date": "10/19/2010",
    "text": "Awesome bloody marys (super spicy), awesome chili, awesome awesome burgers, and omg the cornbread is the best ive had in a loooooooong time. I couldve just eaten that alone.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "9FPm9wj_zcBWJuB9-Tlqcw"
  },
  "c4jg4OLqVF9UVbDxQDhgFg": {
    "date": "9/7/2011",
    "text": "Enjoyed a basic hamburger for lunch. The sweet potato french fries with dipping sauce were wonderful. Will definitely eat there again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KXVYaZZ9o5_gS_o8dAzvDw"
  },
  "gk-6_RRvs00jyqHByxzqzQ": {
    "date": "11/14/2010",
    "text": "This place is a (obviously) bicycle-themed bar & grill type of restaurant.   It shares the entrance in the back with the Loco Lime restaurant.  Turn right for Kickstand.  Inside you will find a casual atmosphere with plenty of TV screens to watch pretty much any televised game or event.  There are even TVs in the booths, although there is no sound from them.  In the foyer of the entrance are several bicycles and there are plenty of them scattered about inside the restaurant, itself.   Also, there are photographs and other things bicycle-related.  They have many types of excellent beer on draft.  There are several vegetarian options here.  They have a homemade black bean veggie burger with guacamole that is delicious.  They also have a grilled veggie sandwich and a burrito, as well.  I like the laid back atmosphere of this place.  It goes well with the other things in Plaza-Midwood.   Bicycle parking and 2 racks are in the back next to the Loco Lime's patio and is sort of up on a deck.  Ask for a 10% discount when riding your bicycle here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tpi0KDtbpErE8Mg08IHkNA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Bicycle racks in the back.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tpi0KDtbpErE8Mg08IHkNA/o.jpg"
      },
      {
        "img_id": "vIT-Uw2s_b_hOx35s0M_RQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Black bean veggie burger (Spin Class) with K-fries.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vIT-Uw2s_b_hOx35s0M_RQ/o.jpg"
      }
    ],
    "user_id": "u3dcvsODEc3AtiKAnlcJyA"
  },
  "DzGN7YXTy6oaYWscU3S2lg": {
    "date": "4/18/2012",
    "text": "First trip was about a week ago and must admit that this is a pretty neat little joint. Menu is limited but enjoyed the fried pickle spears and tasty burger.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "fCb4CAysT0PeYGgh2n5mBQ"
  },
  "MB2wTEns4ayp8Q6Lf2rNOg": {
    "date": "11/19/2011",
    "text": "love this place! awesome selection of unusual burgers. the kickstand burger is heavenly as are the tater tots. check in on four square and get 1/2 of an app. good ber selection and personal TVs in each booth. patio area is super cute & atmosphere is fun - definitly worth a try!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "pk5fkWF1OTca_zz5Y8hPcQ"
  },
  "KIPWhU633Ypn3BDsQZmU1g": {
    "date": "8/9/2011",
    "text": "I was really excited about this place.  Cool atmosphere, one of my favorite parts of town but the burgers disapointed big time.  It was hard to pinpoint WHY the burgers weren't good, but my buddy who was with me, put it this way, \"it tasted like they are using brand new equipment\".  Metalic tasting, lighter fluid maybe?  I have no idea.  I probably won't go back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "0e7JFD6TbyDAFSOhLPtJog"
  },
  "wStYajhCsBTmJHAv_qJhjg": {
    "date": "1/31/2011",
    "text": "The beef and turkey burgers are tasty here, but the standout is the best-in-Charlotte veggie burger. Service is decent and the place is big enough that you don't have to wait for a table. I hope it survives - i think it's a great addition to the neighborhood.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "-XelgRVyA5pqbxDq9tsL8A"
  },
  "a3qYB4fFtPWu_Fl9RYSVIQ": {
    "date": "3/2/2011",
    "text": "The \"morning ride\" will serve you well, it's 2 meals in 1! Who could resist a bacon & egg breakfast on top of your burger?? It is delicious and incredibly messy! Be sure to wash it down with plenty of suds.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8oZTjLEk0f0wyRc5bj99mw"
  },
  "4Ze3QvOftQ3o5sI8ZLLtjg": {
    "date": "2/20/2011",
    "text": "This place is hit or miss for me as far as the burger goes. Sometimes awesome, sometimes just so-so. Usually the so-so is because it's cooked a bit more than I'd like. Beer specials are good. Space is nice and clean. $3 Fat Tire all day every day is a pretty nice deal. Glad it's near my neighborhood but not sure I would travel far to eat here unless it was to meet a group for dinner. Hopefully they are still figuring things out and will grow it from here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "lLBnCyh8aDZRohBR9k7Z2A"
  },
  "WZDoUhH5ou6QWoAjOML4Bw": {
    "date": "7/19/2015",
    "text": "I had never heard of this place until my boyfriend found it randomly online. We came  in and were seated right away. The waiter came and gave us some great suggestions on burgers and beer! Boyfriend got a build your own burger with tots and I got the buffalo chicken sandwich with fries. We were introduced to a local beer (Piedmont Pilsner) that was ahhhhhh-mazing!!!! Our food came out and was hot & fresh! Everything tasted delicious!! Will be going back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8SSgKo2UMp3ynl_TDfRgyA"
  },
  "-yDcYDPVqzNMjyW1GabucA": {
    "date": "9/15/2013",
    "text": "Kickstand is about as good as it gets! The food is insanely good and there is something for everyone. I got the booty burger and it was a masterpiece! The atmosphere was upbeat and fun. Everything was was clean and the food came out FAST. I'll be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yr8HsndXL4wrRy7Gei17Iw"
  },
  "3krEBoZEb1nJIOELhf41Qw": {
    "date": "9/11/2012",
    "text": "I had an ok experience, it was during lunch on the weekend... not a lot of people inside and they had the games on but the TVs were blasting loud... couldnt enjoy conversation. I ordered the french dip, it was very greasy... the au ju appeared to be some form of a gravy. The tots were good.. nice and crunchy and not too salty. Its a ride from my house and not a place I would go out of the way to go to again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "be40GYyvsx5FnKo8-dI_qw": {
    "date": "12/7/2013",
    "text": "Awesome burgers, every burger on the menu is tastey. Awesome craft beer selection and friendly staff. One of my regular spots.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jd77YGrMf0pe0x6aqqFTfg"
  },
  "2f6NwbDua5Axz-d6zxIidA": {
    "date": "4/1/2014",
    "text": "Well, don't eat burgers. Went to Kickstand's for a small birthday dinner. I'd never been before but I had been next door to Loco Lime (now closed). The atmosphere is cool and laid back. A nice little patio area in the front for outside eating.Long story short...I'd already had a light meal before I got there (knowing I don't eat burgers...). We had wings for the table and they were okay. I think they were Citrus Chipolte and some other flavor. Not the best, not the worst. One of our guests ordered the Tanglers and they came out cold. Like, not even warm. So he sent them back for more. I decided just to have some cheese sticks. They were stacked up some kind of way and when they got to me, one fell off and down my arm before the waitor sat my plate down in front of me. He clearly saw it and said he would let someone know. Everyone had there food and there were no complaints other than my one cheese stick fiasco and my little cousin not getting her kids plate until we were almost done eating. Needless to say I told our two waitors I was short one cheese stick. They never brought me my cheese stick. It's not that serious but I am a paying customer and I don't go to restaurants to have my food dropped on the floor. And, it's a frozen packaged item. Just drop one in the fryer and bring it out. Pretty sure they're not in the back slicing and breading mozzarella. One of my Yelp buddies recently checked in and I noticed her comment \"No pitchers of Beer...Where they do that at?\" Where do they? Seriously...it's a burger joint.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "onsvManL82rHzpcCB3Uyfg"
  },
  "Q3Lmg9P59TWhZV_k2ird_A": {
    "date": "4/19/2012",
    "text": "I used to really despise Kickstand considering I got food poisoning my very first time there. Then in a rush to find a place for 20 people on a Friday night at 8pm (graduation time too!), my parents insisted we try it out. The servers were very friendly and whipped us together a table in their private room in seriously like 0.2 seconds. Everything came out quickly and our server was very attentive. I've tried it a few times since then, and each time my food is decent, at the very least.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "etJXHbM-XrQY0J6MPrYESg"
  },
  "7H-LuEuM2OUR3SQxMc9f_g": {
    "date": "8/23/2012",
    "text": "My wife and I are big fans of the french fries. The burgers are great, too, but it's the fries that have us bypassing Bad Daddy's and making the 20 minute trip to Kickstand. They also have a very cool, laid back atmosphere and plenty of TVs.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "osD9vrFTSb3WnD5mD4-u6Q"
  },
  "3yZ_vZy6tAyOcPwKVe1rBA": {
    "date": "4/2/2012",
    "text": "My boyfriend and I love this place. So far all of the burgers we have ordered were delicious! I'm a fan of the Morning Ride and the Fender Bender, but my boyfriend swears by the Trek. Also, the fried shrimp and grits is a must-try appetizer, just the right amount of heat!   But I have to admit, my favorite thing on the menu is the gourmet corn-on-the-cob (or as I refer to it as, \"crack on a stick\"). I actually just created a Yelp! account because I wanted everyone to know how good the corn-on-the-cob is. It has some sort of spicy sauce on it with Parmesan cheese and it never disappoints!  The service has been average every time we've been, not excellent but not bad. But other than that, we love this burger joint!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "xMU2QeUZ5Ix2m7avn6lxKw"
  },
  "jMl4KNuKXhr4heSDv1OQmg": {
    "date": "4/19/2012",
    "text": "I've been here a few times and find the experience consistent.  I have only had the \"Spin class\" veggie burger but it is a good one.  The veggie burger is crispy on the outside and not too soft inside.  It has a nice flavor and I actually like it just the way they serve it except I get the sauce on side to control the calories.  The meat-eaters I've been with all enjoyed their burgers too, also good remarks for the wings, chicken sandwich and shrimp burger.  Sweet tots are yummy but find the brown sugar dipping sauce overkill.  A great beer selection is icing on the cake!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O4LnIwEJim0dQ4wr6Ic9ow"
  },
  "yYFG-MG1JXne3xFfRiRKcQ": {
    "date": "8/31/2013",
    "text": "My wife and I have been here twice and both times have been thoroughly enjoyable.  Everything from friendly and helpful staff members to fantastic food, this place is just great.  Local beer selection is a big plus for me and I wasn't disappointed.  The burgers are on the messy side, but taste fantastic (the kickstand is just great).  I have been recommending this place since we happened upon it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KC85LeqWvfEhUpasA41Iaw"
  },
  "DzTP_xcVcQMK89wwMkjkEw": {
    "date": "3/8/2015",
    "text": "First timer with my daughters on our way to the College Fair. Awesome burgers/sandwiches and great service!! Will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KVBt_C8npY7XkAcWM0gG6A"
  },
  "LrX2AobG1sos_vSCTWLgEQ": {
    "date": "5/11/2012",
    "text": "The BEST burgers in town!  After trying a burger at Kickstand and loving it, a friend of mine said I should try Bad Daddy's because they are known for their burgers.  Bad Daddy's didn't even come close to the juicy deliciousness of the burgers at Kickstand.  Besides the burgers, their shells and cheese, brocolli, and sweet potato tots are on point.  SO TASTY!  The waitstaff has always been super friendly, too.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JwNu7p9FGtG5q_ps-RObpQ"
  },
  "MYVKv9eISV0PxZfSUOo6ug": {
    "date": "4/26/2015",
    "text": "While the food was tasty and the server was friendly. This was quite possibly the worst experience I have ever had at a restaurant. I work in the industry and I'm usually quite patient.  Especially with extenuating circumstances. However we were one of the few tables there. Our app was wrong and took 3 tries to come out correctly and came out with our meal initially and by the time they got the order right it was after we were finished eating our meals. Our friends came out wrong 3 times as well and didn't receive hers until after everyone was finished. We waited 15 minutes and up for drinks throughout (often receiving the wrong drinks) and over 30 min for our checks which took 3 attempts to get them split correctly. Even after I wrote a list of what we had. Will never go back here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2YFRaLqsQyt749mXc9xJg"
  },
  "ujdrS8rHBJACVegdYTePMQ": {
    "date": "2/3/2013",
    "text": "Great variety of burgers. The Tangled Onions and the buttery tater tots are good enough to blow your diet. So far all the burgers I have tried have been wonderful. The Belgium Mimosa is really good. Great atmosphere, and good friendly service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xyyz9wJynAK9PuDSLSk85A"
  },
  "AMUOX7ebMP3WO2I8TQVhUA": {
    "date": "4/20/2012",
    "text": "I've probably been here 20 or more times and for some reason never taken time to sit down and write a review of one of my favorite places in Charlotte.   I've tried most of the burgers and they are all really good. They use a high grade beef which is always really well seasoned and cooked perfectly. That said my favorite  burger would have to be the Morning Ride. I've always been hesitant about an egg on a burger, but wow was I wrong. This might be one of the best burgers I've ever eaten. It's more like a breakfast sandwich with the toasted english muffin, bacon, hard fried egg, cheese, and hollandaise sauce. For sure worth a shot. I always get mine with combo tots, it's half an order of sweet tater tots (which is served with this awesome warm syrup dipping sauce) and half regular tots.   Of course you really can't go wrong with any of the burgers here. Also, the flatbreads are really good if you're in the mood for something a little lighter. The horseradish steak and veggie ones are amazing.   I would have to say though that my favorite thing about this place might not even be the food. The entire staff is super friendly. It's almost like your hanging out with good pals rather than your standard customer proprietor transaction. They take the time to find out what teams/sports you like and best bet the next time you are in there they will have your favorite team on one of their kagillion TVs before you have time to order your first beer.   Next time you want a cold beer and hot burger done right, make it a point to stop by.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "qVOdgo_JlP3dJb7Gfg77Ng"
  },
  "KCspJ1BYNeXkx3siYLN8MA": {
    "date": "3/29/2012",
    "text": "Now that The Penguin is a no-go (sorry, Ballentyne, but you can suck it), and The Diamond somehow doesn't serve up the burgers the same way (and neither, incidentally, does Pinky's Westside, across town and inherited of some of the Penguin's former staff), my intrepid food-companion games up to hit Kickstands when I am in a burger mood.   They've recently renovated the menu a little bit (the eponymously-named Kickstand Burger no longer has the fig preserves as an option, instead opting for the cranberry chutney as the sole accompaniment - which is a good choice, because, honestly, the fig just didn't stand up to it), but most everything I've had here is incredibly tasty. The pico on the Cross Country could use a little more kick, and I'm not crazy about the chili used on the Fender Bender, but those are nitpicks. The Trek is a solid winner, and the Kickstand is pretty danged mouth-watering.   The sides are worth some time on their own, too - I love that the sweet 'tater tots come with a brown sugar glaze, and the option of mixing the tot versions is pretty good stuff. I'm a mac 'n cheese snob, so it's a little disappointing that theirs seems to be Velveeta Shells & Cheese, but the orzo salad makes a nice alternacarb, if you're down.   All in all: a solid joint for a burger. I am still in search of a replacement for my old Penguin standby, though: big block, all the way and Southern style. Guess I'll have to keep looking for my perfect burger...",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TVU8HTzlaRWO7Ncx-BzfDA"
  },
  "kHq6pn5abU95KKK7ODrgpQ": {
    "date": "1/27/2012",
    "text": "We get together at Kickstand every Friday after work, and it's always a great experience!!  The food is great, and the burgers are phenomenal!!!!  They have great appetizer menu and drinks specials!!!  Plates and glasses are always empty when we leave!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hpUn0d0349cP7oWzHL7DcA"
  },
  "tbCu41xYPcXj0Vl_nljUyQ": {
    "date": "1/4/2012",
    "text": "I was very impressed to see a vast menu full of flavor explosions!!! I loved the Blue Burger Salad. Yes, a burger on a salad with Blue Cheese dressing. Great tots and good beer specials. Can't wait to go  back for more!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tIQqXjYZ8iUt7i9EDQO7yw"
  },
  "FfG-8K4WbWAoLbuNY4gBZg": {
    "date": "10/3/2011",
    "text": "Great atmosphere, great beer prices/specials ($2.75 Oktoberfest Warsteiner!) and inventive burgers. Food was OK and service spotty but they did appear to be under-staffed. Will try again.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "PTDhXN8nxW1DmDFFsDqSIg"
  },
  "tcWiDUYF7zFEd0uyI8JvFg": {
    "date": "3/31/2014",
    "text": "If possible, I would give Kickstand 4.5 stars. My wife and I came here, not only to try the burgers, but to watch opening day baseball. It has a great setup for watching the game. We happened to sit at a booth with its own TV that we had switched to the game we came for. We ordered two burgers. My wife got the Kickstand, which she said was four stars. I got the Hungover Cyclist. It was delicious, and cooked perfectly medium. The tater tots are good, but I wish I had ordered the sweet potato tots. They seem to have good specials too. $1 hotdogs for opening day. And the drink specials looked good as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oY9ZkOjJJ_zShYQ4AsZ7CQ"
  },
  "t0r3FWXEE46JSqQkhJE9YA": {
    "date": "6/7/2018",
    "text": "I have been a long time patron of this restaurant because the food has always been fantastic, as well as the service. But not tonight. I ordered the Booty Burger to go because I love the turkey burger and the pimento cheese. However, tonight the cook must not have been paying attention to the order. The burger was charred all the way around and it was missing the best part-the jalapeno cilantro spread. How do you leave that off??? The fries were soggy, which shouldn't have happened given that I only live 5 minutes from there so the drive wasn't enough to where the would get soggy. The turkey was of course dried out because it was too done, and I was just extremely disappointed. You guys need to get it straight over there. I won't be back unless majorly convinced. I know you all can do much better.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B6RPJmhzbkaCRoDwPIL-lg"
  },
  "Ll2N3L3axh3LyR49m9t-Iw": {
    "date": "11/12/2015",
    "text": "We went to kickstand based on the recommendations of others.   I got the booty burger and the sweet tots. The burger was very good, the sweet tots were also good. They came with maple syrup. I thought they could have been cooked a little harder, but I still enjoyed them.  I felt like the atmosphere of the restaurant was too dark. I know that may be a stupid thing to nitpick about but still.   I tried some of my friends nachos and they were great. Overall this place was good. I will definitely be visiting again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o8MBLr6zMV3zTc-TEXHQ_w",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Booty Burger with Sweet Tots",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o8MBLr6zMV3zTc-TEXHQ_w/o.jpg"
      }
    ],
    "user_id": "RgbQNq91CZatl9HedcXDqw"
  },
  "uPli7KHy791vxfC3tFYWHw": {
    "date": "11/5/2017",
    "text": "Great service! Awesome burgers! This place is close to my house and always has friendly servers. Their burgers just can't be beat imo!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "H9GYsAzLGGj8-KcVFYPO_w",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Awesome burger!!! So yummy!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H9GYsAzLGGj8-KcVFYPO_w/o.jpg"
      }
    ],
    "user_id": "mpzmFAWeGsVVRy5jWDG_qQ"
  },
  "jNR4ECaOR2H9-l_UZxSS8w": {
    "date": "8/13/2017",
    "text": "Service was awesome, my husband got the cyclist burger and added bacon and I did a build your own burger with bacon and cheddar cheese. Both burgers were juicy and flavorful!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MdNulWmBqw6cfSJ9X00c-Q",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MdNulWmBqw6cfSJ9X00c-Q/o.jpg"
      }
    ],
    "user_id": "QdrXO2Sio55G7SiixbBRUA"
  },
  "X4o9CdnHJkNPlbN6VK7xmg": {
    "date": "10/21/2014",
    "text": "Kickstand is the #1 place to go for burgers in Plaza Midwod. So many of my friends had never been before I had invited me to join them and none of them were disappointed with their 1st visit.   The menu offers mainly burgers but you can customize your burger with a turkey or veggie burger, wheat bun, and a ton of toppings. My favorite burger is the Cross Country Burger. I can't pass up BBQ sauce on a burger. Their sweet potato tots are served with a maple brown butter (or something like that) sauce and it is freakin' amazing. Definitely go for the sweet tots. I'm also a big fan of their Pimento Cheese Fries. Sometimes you just gotta do the fat thing and order cheese fries!  They also have a decent selection of local craft beers and a large patio on the back of the restaurant. I will forewarn you, though, the parking lot to the restaurant is a disaster. It's not paved and is terrible to drive through or park your car. If you can get past the parking issue, then I highly suggest stopping into Kickstand for a one-of-a-kind burger.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "uVpZdJz2Rp0yulgA5zpevA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Buffalo burger with Gorgonzola, blue cheese, buffalo sauce and bacon.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uVpZdJz2Rp0yulgA5zpevA/o.jpg"
      },
      {
        "img_id": "n0O42kVgpEN96u41gUy8EQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Burger with pimento cheese and fried onion straws. Nom.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/n0O42kVgpEN96u41gUy8EQ/o.jpg"
      },
      {
        "img_id": "8bHGqQtLEudNrYK_0JoBGA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Bacon burger",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8bHGqQtLEudNrYK_0JoBGA/o.jpg"
      }
    ],
    "user_id": "HUI9SrB4NW0GP0MUCCT6VA"
  },
  "CZOLNw1H-fhfD7rtpHnTQg": {
    "date": "10/17/2015",
    "text": "Overall, very good place to come and eat especially if your into sports. Pros: wings were AWESOME!!!!! We had the barbola and buffalo.  Burgers were juicy and hot (temp), lots of options on the menu  Not so pros: gourmet corn was okay, toppings a little funny but that maybe the way it's suppose to come, not my cup of tea. Burgers a little under seasoned but still tasty.  Bottom line, we will be back to try some of the other menu items. Also, our waiter was very good in recommending and answering questions regarding the food",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0RHa52QdWJqk1xQxCQgfiQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0RHa52QdWJqk1xQxCQgfiQ/o.jpg"
      }
    ],
    "user_id": "QV0TDziRw0wjSys2C7hznQ"
  },
  "dR8tlMrMvz1uWOAFQHhhYA": {
    "date": "9/26/2016",
    "text": "Used to be a solid spot for a great food and service.  They had amazing burger, REALLY amazing fries and a steak flatbread that we would drive there specifically for.   We went last night, raving about their food to our friends who had never been, and were extremely disappointed.  I understand that this is a bar, but I have always been impressed with the quality of their food.  Unfortunately, it has gone downhill quickly.  Long story short, the food was pretty bad and the server was unapologetically awful.  She mentioned something about new management.  Oh well!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HidNDPkoSzM8O9OyuQOXpg"
  },
  "b9iZQzxYuS8Yhk0M_2T4ww": {
    "date": "9/22/2017",
    "text": "Came in for a lunch and got the worst service in Charlotte. They were staffed with 1 server for the whole restaurant. Took over 30 minutes to get service. Then over an hour to get our food. Should have just gotten up and left.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iGWgBsi9JRRqXuOF_Ynz2g"
  },
  "TZnD-mhci3NEWFy30T22ZA": {
    "date": "11/19/2016",
    "text": "Love this place - every time!!!  The Cross Country Burger is absolutely fabulous - and the beer selection never disappoints :)  Service is on point. It's a never fail spot to kick back and have a great time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pOvLsPSRSyZLhRE1f_eovA"
  },
  "N82szMF9WJ0qaP2FPcxJSg": {
    "date": "4/20/2015",
    "text": "Went with a group of 14 after kicking back at Watershed on Sunday.  Our server was great:  attentive, prompt, efficient, and with a touch of humor (BTW he got all our orders correct, too!).  I ordered a basic cheeseburger on a ciabatta roll and dressed it myself.  Overall, it was good but next time I'll get it on a standard bun--the ciabatta was too big and bread-y for my liking.  There's much more I'd like to try here, but since I live next door to Cowbell in Uptown, it'll be hard to make the extra effort.  My first visit, however, lands a solid 4 stars mostly because of the service and everyone of my friends liked their food.  Sweet!  PS:  plenty of parking out back which alone gives them a leg up on their competition in Plaza/Midwood.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "hGomu0oGmtBEGcrI_u_sgQ": {
    "date": "8/24/2017",
    "text": "Stop in for drinks and the staff is great! the bartender was great to talk to and laughed it up with us! will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EnttXKyhOn4fW3Vwrx5RDg"
  },
  "LAd3feNlIpPsJxAFeVFoWw": {
    "date": "7/7/2012",
    "text": "Kickstand was pretty awesome... I came here for a dinner with friends and well to meet the new CM (community manager)! They hosted a nice CMYE event the night I came here. So lets get down to the plethora of dishes we ate and tried out. So lets talk about the inside. I came here once before, but I never really got to try out their menu and food. Inside, it seems pretty new especially the area that used to reside here.   First thing we ordered as an appetizer was the Fries with Pimento Cheese, which came on a big plate filled with friese and melted pimento cheese on top with green onions. It was pretty delicious.   Along with that the other appetizer we got was Shrimp and Grits. This wasn't too bad, as it was just kind of normal shrimp and grits, salty, tasty, and has something I can't describe. All I ask is to try it and see for yourself, I promise you won't be disappointed.  We also ordered Wings with Garlic Parmesan. In my opinion, it was just okay. Myself, I don't really like wings that much, but it could be improved on flavor in my opinion. They were glazed on with the sauce as well, and came with dippings of ranch and celery.  Next thing on the menu I got was the burger entree. For this I created my own masterpiece. I ordered a Single with Swiss, Guacamole, Mushrooms, and Chili. (There's a picture if you feel like scrolling through) Yes. It was monstrous, and delicious. I believe someone took a picture of me stuffing my face with guacamole and chili on my face.   Anyways, the point is that this place has full customization dealing with their burgers. Different toppings you choose has different prices. I believe the Guacamole and Chili was a dollar and the Swiss and Mushrooms had a price tag on themselves. However, if you're not flowing in your creative juices on what will be good... you can steal my recipe! Haha, or be plain and boring and order from what they created (which is not bad either!)  All in all, I had some great times with friends here sitting outside eating a monstrous burger and enjoying it. I saw some yelp friends and had a nice beer. The service was wonderful we got seated promptly, drinks came, and all was fine and dandy throughout my whole dining experience. I will definitely come back here if I'm craving for a nice sit down burger. The next creation will definitely be written down and reviewed on here.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JPzfyg8SN0jgYxJJ4MUvVw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. The Fender Bender",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/JPzfyg8SN0jgYxJJ4MUvVw/o.jpg"
      },
      {
        "img_id": "Z3CwxE2U9lwgJ8DxDasTsg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. My creation: Single with Swiss, Mushrooms, Chili, and Guacamole.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Z3CwxE2U9lwgJ8DxDasTsg/o.jpg"
      },
      {
        "img_id": "JldtDPP2cPccdEP5eYL89A",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Morning Burger (I think that&amp;#39;s what it&amp;#39;s called)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/JldtDPP2cPccdEP5eYL89A/o.jpg"
      }
    ],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "VfUIHNoI8uTJMZOEfStgZw": {
    "date": "3/23/2014",
    "text": "We came to kickstand for a Wednesday night because we heard it was trivia night. We arrived around 7:30 to get a good seat and boy, did it pack up quick. We ordered a really delicious bbq chicken flatbread and a bottle of wine to keep us company while we took a stab at the trivia questions.  I have to say this is the best trivia night at any restaurant around the area that I have been to. What is great about the trivia here is that they had a mix of questions that anyone could answer (e.g Candy Slogans). I actually left trivia night not feeling like the dumbest human being in Charlotte.   The only recommendation I would suggest is that they read off the top ten names for every round, since we spend so time marinating on a humorous name.  Definitely need to come back here again for trivia night and a delicious meal.",
    "rating": 4,
    "rated": {
      "funny": 6,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  },
  "66l4Oq6XJpnWBhCzZitAoA": {
    "date": "6/30/2014",
    "text": "Why haven't I been here before?  I mean I actually had the nerve to snub this place a few times while I pranced into Loco Lime...it was as if I was saying \"ugh, look at the sports bar..they must get the spill-over from loco lime.  We are SOOO much better because we are going to eat trendy Mexican as opposed to greasy bar food.\"    Some nerve I had!!  Meanwhile, Loco Lime went out of business and Kickstand is...well...standing!  I don't set out to eat burgers very often but I am thankful I have a husband that loves them so I get to go to town on a few burgers periodically.  So much fun.    Anyway--Kickstand did not disappoint!!  In fact, they represented--HARD!!  I'm a fan!  yay!  I tried the \"booty burger\" and it was delicious!  It has avacado, pimento cheese and some yummy dressing and it was a turkey burger.  The waiter even convinced me to try the gluten free bun which could have been a total disaster but it was perfect!!  Loved it, would get it again.  The sweet potato tater tots served with that buttery maple syrupy goodness were phenom!!  I love sweet potato anything so the sweet factor of the tots combined with my savory bootylicious booty burger just made my inner fat  girl wanna sing!  My husband ordered just a basic cheeseburger with pimento cheese fries on the side.  He said it was easily one of the best burgers he has had!!  Maybe we were overly excited because it was our first time but we really had a great experience.    The price was right, the service was excellent, the food was scrumptious...Oh, that reminds me...our server talked us into the brownie a la mode.  He said they put the brownie in the oven to make it nice and warm and then top it off with vanilla icecream.  It sounded like a dream!  HOWEVER--it really wasn't that great.  The brownie was luke warm at best (the icecream didn't even melt on it so that is telling right there) and it wasn't very \"moist\"...it was kinda dry.  Just a head's up...not the spot for dessert.  Maybe their shakes are better?  The icecream wasn't very creamy either..more like sugary frozen milk.  Just not creamy and not very flavorful.  But OTHER than that...everything else was wonderful.  The atmosphere was truly laid back and it wasn't overly crowded for a Friday night.  Great place.  We will be back!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "ripz0hAjJJv0RemYd5aDzg": {
    "date": "7/6/2017",
    "text": "I love the corn here burgers are good as well I haven't been here in a while but I always recommend it to friends that live in the area",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iVWtnR3Z-yKtzl56Ko8qSw"
  },
  "zqO1PwDRkWeLgTRrtucVwg": {
    "date": "7/28/2017",
    "text": "It was slammed! So it took a little while to get our food! The waitress did a great job taking care of our party!! The food was great! I got the burger on special \"the beer can burger\".  It was great well worth the wait!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BoFluR8klYg01euXk9MO7A"
  },
  "ZRchue3VyaNM07JsXxImow": {
    "date": "5/24/2014",
    "text": "Best.Burgers.In.Charlotte. I had the kickstand burger and it was quite possibly the best burger I've ever had. Couple that with some very impressive sweet potato tots and you'll quickly realize the other burger joints in Charlotte just don't measure up. The ambiance is spot on and they have a ton of beers on tap. The burgers are quite messy though so for those of you that don't like to get your hands dirty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o14IEPqYYAuExng730MlsQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Build your own burger. Pimento cheese and chili.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o14IEPqYYAuExng730MlsQ/o.jpg"
      },
      {
        "img_id": "rVS9erjITL4UjWUjBiyf9w",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Fender bender burger",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/rVS9erjITL4UjWUjBiyf9w/o.jpg"
      },
      {
        "img_id": "zl5yGw5PB9h3XFAbvZQ7pw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Chicken nachos.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/zl5yGw5PB9h3XFAbvZQ7pw/o.jpg"
      }
    ],
    "user_id": "D0NK_--2_QUMMrHIsEMrTg"
  },
  "g2mwHAE_C1ofzO2Wfu7vdg": {
    "date": "8/1/2017",
    "text": "I called and placed a reservation for my group to come eat lunch on Monday. When we came in on Tuesday they had their private room set up and ready to go. Everyone in the group placed their drink and food order and had eaten and paid in less than an hour and a half. Our drinks were always filled and our orders were 100% correct. I was really impressed especially since they had another large group (~15 people) that came in at the same time. Everyone loved their meal. I got the Cross Country burger and it was awesome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n19EI0t99z_Wj2MpE-YTvw"
  },
  "Eneb2tM2UBjSdQW_LMcY5Q": {
    "date": "7/26/2017",
    "text": "This was my first time and my last time at this restaurant.There was only two things good about my visit to this restaurant The Host was super nice and very knowledgeable about the menu and the tater tots that are made from sweet potatoes those were really good. I only spoke with my server twice the whole entire time I was there. Once for him to ask me if the food was okay after it had been dropped off not even a minute before hand and the second time was when he gave me my check and told me to have a good night.  I also had a burger that was very dry. my first bite into it I bit straight into a broken toothpick that the manager after flagging him down told me that they take the toothpicks out to hold the bacon that was supposed to been around the burger but they weren't supposed to leave it in there once it goes out to a table. And asked me to trust him that it was a toothpick. I was going to actually order a beer but nobody ever came back to the table to ask me if I wanted anything to drink because the hosts took my whole entire order my server never once came over and took an order asked me if I wanted anything else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FiGSdVOv37etEgvmD9meYQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/FiGSdVOv37etEgvmD9meYQ/o.jpg"
      }
    ],
    "user_id": "l1ua-UpCUHRQjRteugHaFg"
  },
  "FQXaACAsxLwjoEuLFFmXMg": {
    "date": "9/10/2017",
    "text": "To go along with my strong eggs Benedict fascination I LOVED the Morning ride burger so much! Such great food would totally recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6DZ1DRyL5w3iZP38CkaRA"
  },
  "5dLGDAjiJ-vjb3eU9ugTOw": {
    "date": "5/28/2013",
    "text": "This is my favorite sports bar in Charlotte.  I'm probably a little biased since I live in the neighborhood, but I really haven't found a better one in my 4+ years here.  I don't feel like I need to explain much.  They have a solid selection of cold beer and great bar food.  I'm looking for burgers and wings at a sports bar and they do both well.  They have a really cozy atmosphere with that sleek dark wood interior that I'm a huge fan of.  The guys working the bar have all been really friendly as well.  This is everything I look for in a neighborhood bar.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 4
    },
    "photos": [],
    "user_id": "W9_D98atQWeuQCO_pV2apQ"
  },
  "W8ToguWgCJ3efi7ds7Deaw": {
    "date": "6/29/2014",
    "text": "I'm the type of person who goes to a burger place and doesn't order a burger. I decided to go with the steak flatbread which I really liked. My boyfriend got a burger and are every last bite. Service was great as well. Not the best burger place we've been to in Charlotte but I would recommend it to a friend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "FM9VwZ6NdtFCvP2tLH33QQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Steak flatbread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FM9VwZ6NdtFCvP2tLH33QQ/o.jpg"
      }
    ],
    "user_id": "hYpMoyAkPOmEGk4jo7udwQ"
  },
  "NAtnn7mw7gMcJguWCbWYhg": {
    "date": "5/31/2013",
    "text": "Who's got one of the best veggie burgers around? Kickstand. I was surprised to find such a delicious veggie burger (or sliders, for that matter) at this little burger bar. But it's there and it's wonderful.  Service is great...I appreciate being checked on by our server as well as management several times during our meal. These guys love their regulars.  The bathrooms are a little hard to locate when you first come in...they're in the area between The Loco Lime and Kickstand. Walk past the mini carnival and you're there.  As for the menu, I always have a hard time deciding between the veggie flatbread, with its avocado, pico de gallo and cheese, and the veggie sliders, with guacamole, pepper jack cheese and chipotle ranch. Recently I opted for the uber healthy pimiento cheese fries. As an entree. And they were amazing.  Local beers as well as national brands on draught. Plenty to choose from. And the faithful PBR for those poor hipsters who like the taste of beer but haven't the cash to buy the fancy stuff.  We had our rehearsal dinner at and used their private dining room. It was a delight and we really enjoyed our time there, as did our guests. We're laid back people, so Kickstand was perfect for us.  It's one of our favorite places to go for a casual dinner, or just to kill time at the bar with a few beers. I'd hate to imagine a Charlotte without Kickstand. That's for sure.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 5
    },
    "photos": [],
    "user_id": "jfaz1aQqnkbtzQfQyCE8IA"
  },
  "EwgGuKagQEhQqZ-_76SgwA": {
    "date": "10/28/2015",
    "text": "Been here a few times. Good place, good food. I've not been super impressed with the burgers but the Mac and cheese is to die for, seriously.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hn1dSryI9tmYKt6HyQqJqQ"
  },
  "Cj1tJuTnsR5RA1e006Jhag": {
    "date": "8/8/2013",
    "text": "Exactly the type of place that makes me happy to live in Charlotte.  Atmosphere is spot on - casual, just enough TV's, outdoor patio.  Food was righteous - we had a variety of burgers - every one was creative, perfectly cooked, and full of flavor.  Nice beer selection.  Another 5 star offering in plaza midwood.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "1j5zNEF1L33ttr7g35TNzw"
  },
  "wYRi67w1JKwrJzKVAu6W5Q": {
    "date": "11/5/2013",
    "text": "Great burger and beer!  I am always searching for the best black and blue burger and found the almost best at Kickstand! We also loved the beer and cider choices. They serve Lagunitas so they have to be GOOD!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "2VMs6Qr8so2TdvE0Gp5SZg"
  },
  "aq81O2nH0VffOk39_z8rtw": {
    "date": "1/23/2014",
    "text": "It had been a while since my last visit to Kickstand, and they have changed a few things (like no more shrimp). I feel like I'm always here with a big group and they always take care of us, whether it be servers tag teaming or the manager stopping by, I never feel like my glass has sat almost empty too long or I can't find anyone to flag down if needed.  Wide variety of burgers, flat breads, and wings. I usually pick one of their signature burgers and just substitute chicken. On my last visit I had the greek one with feta, olives, and tzatziki - so good!  I like the range on the menu that you can eat as healthy or as unhealthy as you want, whether you make your own, make substitutions, or pick a lighter menu item/side - there are always options, and I've never had an issue with my order.   They usually have really good drink specials, so definitely check those out.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "n_zJNVFWUwyzryuFf1v9pw"
  },
  "lfPjcZtJFBIqVWzP51uw8w": {
    "date": "1/24/2016",
    "text": "Great burgers! Great staff! Nice just to eat or even watch the game. (Plenty of TV's) Drink specials everyday. ($2 mimosas on Sunday) Tables not overly crowded next to each other.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vug_OWQfEG-uuQQsPCxMVg"
  },
  "BlHexJEuebxo86R4BNlh1A": {
    "date": "5/25/2016",
    "text": "First time trying this was 5/19/2016 I will be back. The beef burger was seasoned and fresh, the tater tots were hot and fresh as well. The waitress was very attentive and nice. Thanks!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9vqQdOGEw-_11AiFAtMYsA"
  },
  "90TAgBizn_X_t6BjBTrtJA": {
    "date": "5/25/2016",
    "text": "I can't believe it took me so long to revisit Kickstand.  Ambiance was awesome with all of the people sitting outside.  Sorry if me and my friends drank you out of champagne.  $2 Mimosas on Sunday?!?..  How can you go wrong?  The food was good and the service was better.  Katlyn and Tracey were excellent  We didn't know you were dog friendly, next time we bring the hounds.  Thanks for making our visit seem special, although it was a regular Sunday afternoon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rUKLENxY4T_5TfiwTNrr4Q"
  },
  "5oq6wCQnpiSxLxAK-7j45g": {
    "date": "5/24/2017",
    "text": "The food is extremely good ! I Tried \"The Terk\" I believe it was called and it was pretty amazing.The service was excellent ! The servers and everyone else who worked here were very kind, they all checked on us to make sure we were doing well. The food didn't take too long. It was an overall great experience for me. I will definitely be coming again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8ta8VcZVbNSFoKCDKhGXuQ"
  },
  "ePCaB0e4cWtHppzAZ_UhhA": {
    "date": "5/29/2014",
    "text": "Yelp! sent out their weekly email and notified me that it was National Burger Day on 5/28, so my friends and I decided to take part. Kickstand was in the email, so we went there. It was delicious! We started with the Pimento Cheese fries, which were filling (be warned) but they were crispy and topped with tons of cheese. My friend and I couldn't decide which burger to pick, so we split the Kickstand Burger and the Cross-Country. I can't even say which was better because they were both huge and the meat was juicy and flavorful. The sides are so great too: we tried the sweet potato tots and the gourmet corn. Umm, I would go there just for the sides! We sat outside on the picnic benches, so it was a chill and casual atmosphere.  They have a great local beer list as well. I'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rjBjuHnqqBg2Av4fFP7_nA"
  },
  "Vh4mnOcndY6-as6kyAuG5Q": {
    "date": "6/5/2014",
    "text": "We have been going to Kickstand for awhile now. I have to say, the Veggie Burger (The Spin Class) is the best out there. We have tried a variety of veggie burgers and this is by far the best one. It's not your ordinary thin burger. It's much larger! It has pepper jack cheese, guacamole and chipotle ranch on a whole wheat bun.   If your in the area or in the mood for a veggie burger, give it a try. honestly, I love my hamburgers, but I'll always get this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "57CMMpuldc3cFZ3aj_ujkQ"
  },
  "BXXNAnhZG_RD4xtTB80WYw": {
    "date": "1/11/2015",
    "text": "Kickstand has the most welcoming atmosphere of all the bars in Plaza Midwood. We love and respect Josh, their GM, who takes the time to get to know what we like so we always have a great time and makes sure we are ALWAYS well taken care of. We really appreciate him arranging space for our larger parties during special events.  The horseradish steak flatbread is my favorite item on their menu. Creative, cooked perfect to temperature, fresh. The burgers and Kettle One dirty martinis are the best in Plaza Midwood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6M9SAVzh2jRVNfTv1MULsQ"
  },
  "jHy088_4UiJ97RogHmhdkw": {
    "date": "3/20/2017",
    "text": "I ate here for lunch for the first time today. I'd heard great things about Kickstand so was excited to try it out & was not disappointed. The restaurant was clean and staff was friendly. I ordered the Kickstand burger with fries. The fries were crisp (which I love) and the burger was delicious. I ordered the cranberry chutney on the side as I'm not a huge fan or cranberries. I did taste it on the burger, while it wasn't terrible I personally do not like something sweet on my burgers. I'll definitely be back to try more. My coworker got the morning ride burger which she said was great as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p9nd8-WjyGJjbzVXnXn5YQ"
  },
  "iCVhrEJdQdSKXHplVTntOA": {
    "date": "1/16/2016",
    "text": "All we can say is good luck! The burger joint is in an area that commands good food to survive and well it was rather disappointing.... My husband had the daily special and it was over cooked. I had the veggie burger and it was dry and the bun was well toasted, too well. If your looking for a veggie burger, head to Brick Tops. They have the BEST veggie burger in Charlotte not to mention their fries are yummy. The fries here are nothing special just short of coming out of the freezer and fried. Tater tots - lol!  The positive was the service, spot on. The beer specials - good.  With all the burger joints in Charlotte we will not be back, sorry.  Bang Bang burger is not far away with locally sourced beef and very tasty.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2ogJrhy4J_4gitCH1FVGtA"
  },
  "utuarxc5MZ7QbMiFs2i3oA": {
    "date": "5/5/2015",
    "text": "I really wanted to enjoy this place because I heard it's a great place.  After giving them 2 tries, I will not be able to rave about it like others. The 1st time, I sat at the bar for at least 10 min & was never even acknowledged, so I left.  I gave them another try last week and was happy to be greeted, however service was not stellar. I had an appetizer and based upon the service, I didn't hang around for a burger. I'm not one to be negative, but felt I should share. Acknowledging guests and providing service is #1 in my book.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "QrabY-k_dp5kVgGqgCFo5Q"
  },
  "B3_wMec0XQf0jKOFKCpqyQ": {
    "date": "2/17/2017",
    "text": "Best burger I've had in over 10 years! Love the option of getting tots as a side. Very extensive beer selection. Service is super friendly and attentive. Nothing negative to say! Amazing!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TgVObqQyTE9sqGVQY8D5-g"
  },
  "hzBu-VN_WgeDK9_3Wng6Lg": {
    "date": "11/2/2015",
    "text": "Went to the bar to watch the Flordia Vs. Georgia game and what a great place. Bartender was super friendly and was more than happy to change the TVs so we could watch the games. Taps have a great selection of tasty seasonals, IPAs and your general bud light/miller light finds. Got some apps to share and y'all...the fried pickles are so amazing. cooked perfectly and whatever they put in their breading, pure magic! Great place to hang out and watch the game and catch up with friends. Their deck is nice as well, but no TVs outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U1YcfM1N5FZhxHe0ltvQaQ"
  },
  "XakvjBfuYVpcf35OK1xT9A": {
    "date": "7/16/2013",
    "text": "SO GOOD! My wife took me to Kickstand for my birthday. I was really looking for a great burger, some tots, and a quality beer. I got exactly what I was looking for and some pleasant surprises along the way.  I chose the first signature burger on the list. Honestly, the best burger I've eaten in the past 3 years. Cooked medium, pepper jack cheese, pico de gallo, quac, and BBQ sauce on a delicious kaiser bun. A perfect balance of sweet and spice, fresh ingredients, and cooked to perfection.  Top it off with tots, a cold beer, a beautiful day, and a great patio - happy birthday to me.  The environment was fun and friendly with excellent service. Thanks Kickstand - see you again soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1mG0ZhZWujv7Hq4lcEKXmw"
  },
  "JPs6pzt2FQk6XFNlH0w_gA": {
    "date": "3/11/2018",
    "text": "Absolutely delicious burgers at affordable prices. Waitress was kinda rude which is the reason for one less star. Tap water tasted like chlorine but it was free so whatever. I cannot wait to try the other menu options. I'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H61dNiTHkySboLikXA8zIA"
  },
  "nlH2tJfBSxjuq0U7raad4w": {
    "date": "6/5/2017",
    "text": "Why did it take me so long to finally come here?? This is a great spot that I have run and biked past many times and had a great time with friends for a late night meal. The menu is full of hearty comfort food and they have an excellent variety of beers on tap. I had the Fender Burger, which is now among my favorites in Charlotte.  As somebody who bikes a lot for regular transportation, I loved the bicycle theme of the restaurant. I always thought it was a motorcycle themed place, but I'm glad I was wrong on that. I definitely see some bike trips to Kickstand for lunch or an early dinner in my future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SEW_Ej5nXB2MxXMWQSaljg"
  },
  "EQt-ux_9jRk55MrOtGe5IA": {
    "date": "3/11/2015",
    "text": "Great bar atmosphere, even better food. I had the garlic Parmesan wings, which is a deviation of my usual (burger) bar order. Lots of messy sauce on them. My date enjoyed the wings but didn't care for all the sauce. I thought it was great. Mind you, she ate all the leftover wings at home the next day!  She had the Hungover Cyclist, which is the patty in between two grilled cheese sandwiches. She was in love from the first bite. I wondered if it would've been a tad bit dry, since grilled cheese sandwiches aren't the same consistency of burger buns, but she had no complaints.  I'm definitely returning so I too can enjoy a burger from Kickstand.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "wWObKZ1P_VS95UABBA3Geg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Winggggggs!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wWObKZ1P_VS95UABBA3Geg/o.jpg"
      },
      {
        "img_id": "21GmTruGJdxHLGyn_lZiSg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Hungover Cyclist",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/21GmTruGJdxHLGyn_lZiSg/o.jpg"
      }
    ],
    "user_id": "7U3H1iJZ04FbadJtt2Npjg"
  },
  "19nuzIUI31nU-Ti443uIoA": {
    "date": "6/2/2016",
    "text": "So I check this place out based off the Yelp reviews. I guess I should set the stage for the experience. I was just looking for a place to do some work in the afternoon and try a new place for lunch while visiting Charlotte.  Mallory was super friendly and did a great job. I had the chili with corn bread was really good the chili was a little more than I expected which was a surprise I don't know if it's anything special about it besides the chickpeas but it was good and the cornbread was sweet and good.  As for the main food I got one of the burgers I can't remember the name of barbecue sauce and avocado it was really good cook medium just right. And I was on a really nice but I don't know what is made out of it was good too  Overall the service is what really set the place up for four stars if the food would have been something different than bar food which I went in expecting it probably 5 stars but it's a great place to go check out.  I'm leaving around 6 p.m. in the place is starting to get busy I'm sure it's a good place to check out if you want to come have drinks with friends for Thursday Friday Saturday I don't know it looks like a good spot with a good bar. It's definitely worth checking out again the service was great so stop by give it a shot.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "f7Z258cF3nw2wZFetfW8lQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Chilli with cornbread. Both were really good. I think they use chickpeas...?",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/f7Z258cF3nw2wZFetfW8lQ/o.jpg"
      }
    ],
    "user_id": "ipVUgmlF4DhMwceKJN5-sA"
  },
  "tGJtBSpGSUlyTR6lwYOnvA": {
    "date": "3/28/2018",
    "text": "I've been coming to Kickstand for Wednesday night trivia for almost three years now. The staff is always wonderful (shout out to Rich, the most wonderful server!) and we always have an awesome time. The trivia guy, whose name is Jacob, is a ton of fun every single week. The manager, Chris, always listens to any suggestions we have and is also a great person. The food is wonderful, they have a wine/beer special on Wednesday nights, and the people are so great. What's not to love?!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LAzYKbOrzmpXe6ym9FXZgw"
  },
  "5nlbUW8dp8aljJB8mPnOLw": {
    "date": "7/28/2017",
    "text": "We just came here for the first time because of the Burger Week burger. It was SO good! They were also so great with my son's food allergy. The manager came out several times to check with us and he was awesome. They even brought the kids food out first without us even asking! A+ for that!!! We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PpNd3CuEnlpdlIzVV1Ivmw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Burger Week Burger. So good!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PpNd3CuEnlpdlIzVV1Ivmw/o.jpg"
      }
    ],
    "user_id": "UcFGPEpnLdp5_uWYBg7vXw"
  },
  "1MpBiD8I_uErbAI3F5EtvA": {
    "date": "2/10/2018",
    "text": "We walked in to watch the whole half of a basketball game and enjoy some beers, wings, and burgers. When we walked in no one was there to greet us, so we went to sit at the bar.  When we sat at the bar a young lady came to give us menus and asked if we wanted to start with some drinks. My boyfriend ordered a beer and I asked for water, my water didn't come for about 10min later then she asked were we hungry, I said \"yes we are going to eat\" ordered a beer for myself. Another 15 min went by she walked by us multiple times didn't acknowledge that our beers were empty, asked if we wanted an appetizer more beer, NOTHING! Just a smirk and a walk by. So eventually by halftime we asked to cash out, she brought that quickly and told us to have a good weekend! I heard a few good things about this place and I wanted to try it for myself but unfortunately this was the outcome!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XMN5ThRdC7B7ascj4KbpQw"
  },
  "PUpuKns9MWCA0RW7-EcfiQ": {
    "date": "9/9/2018",
    "text": "Claims to have nfl Sunday ticket and show all games but when I arrived at the bar they refused to show the ravens bills game. If your not going to show all games don't advertise that you have nfl Sunday ticket.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "e7BXktYg83EiHwEvG6DyZQ"
  },
  "ZCl8_7XATN3qi66cMZeBqg": {
    "date": "6/25/2017",
    "text": "Trying this place again because I misunderstood my item.  First, the place is adorable inside and out with a large patio/picnic tables/umbrellas and 'ash trays' of small buckets w/water. Staff excellent, attentive cheerful. I was on the go, but I'll go back to sit in the neet street side, large window seating area up front next time. Ok, The Only Thing was I misunderstood the horseradish steak item. I thought I was ordering a sandwich-a cheese steak hoagie style thing w/horse radish as I wanted a couple of big mouthfuls of beef. This item is actually 5 flat bread squares or a pizza style thing with bits...of steak on top. Nice cheese, good flavor, but.. It's a grey area so 5 stars anyway since they could describe this item more/I could ask. Be back there shortly to try again and offer my feedback then 2",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "43K7u4QzLyQcwysjPH9r0g"
  },
  "KGixBepCRgff3jHxKXRg_Q": {
    "date": "5/6/2017",
    "text": "Ok so maybe it's because I'm 9 months pregnant and can.not.stop. eating nachos, but omg these are some of the best nachos I've ever had!  The serving is humongous...so not good for one person (even one that's not 9 mos pregnant), but they are fresh and tasty and crunchy and just heavenly!  They also had kids eat free on the day we went so that was a bonus!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWCPqwslWC0VjFDNzkHyaA"
  },
  "1LO1-A3Dp2dUablVEgu8IA": {
    "date": "1/10/2018",
    "text": "I frequent Kickstand at least 3-4 times a month and each time is always better than the last. The picture perfect food and friendly service never fails to disappoint which is why I'm such a loyal customer. I typically order the Shroom and Swiss or opt for a Build Your Own but when I'm not in the mood for a burger I venture out and get the French dip which is equally as tasty. The appetizers are pretty standard and nicely portioned for a burger joint so don't be afraid to try them during your visit. I typically sit at the bar, however there are TVs and outlets at each booth for a more pleasant dining experience. Pro Tip: avoid visiting on Tuesdays at all costs. Parking is dominated by droves of La Unica patrons anxiously waiting for their chance to order $2 tacos next door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xFxymcYKRmApJBKucERujQ"
  },
  "L7ru6U3fKRM4Vg4an4BZnA": {
    "date": "7/7/2018",
    "text": "Was there for an afternoon world cup game. Burgers were fantastic as always. Good beer selection. Best burgers and fried pickles in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HsA9-QuQpHZVmJcDxhiP7g"
  },
  "qFP2ixDduet9tyh9LB_6xg": {
    "date": "2/19/2016",
    "text": "This was my second time visiting Kickstand;however,this particular time I was with a large group(at least 40ppl).We received the best customer service by Christopher that a large group could expect.Participants from the group left at different times but Christopher was able to manage it all.He was on top of everything which included but not limited to our orders,refills on our drinks,to go boxes,and providing checks.There was also another young lady servicing our group that was helpful.I personally thanked Christopher on my way out and told him he did an awesome job.Although he was receptive to the compliment,I could tell it was just the way he was and awesome customer service is what he consistently provides.Thanks Kickstand for the experience!  Pros:great food,delivered in a decent time frame,awesome customer service,TVs available,affordable",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sgqj8Nvg43iv-l8-MlC01A"
  },
  "St2qoUhORw9uVuqVMXo2vQ": {
    "date": "5/24/2017",
    "text": "Excellent! We ordered the cross country and the fender bender, and they did not disappoint. The patties were fresh and delicious. Fries were good standard fries. Service was awesome. The manager and our server were friendly and attentive. We will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lCA7E7hpjT6Y4nJAauFDqA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Cross country",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lCA7E7hpjT6Y4nJAauFDqA/o.jpg"
      },
      {
        "img_id": "78Q4enyj_v4eE4MHFsUgnw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Fender bender",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/78Q4enyj_v4eE4MHFsUgnw/o.jpg"
      }
    ],
    "user_id": "zj7aXAsResMORfpbFP9QHA"
  },
  "llvreWmbAMqk9T-wMCHbOQ": {
    "date": "4/9/2017",
    "text": "We were in town for a Spartan race and wanted to have a burger. Found this gem and when we walked in the hostess sat us and asked if it was our first time. After we were about halfway done the manager Chris came over and introduced himself. He said \"my hostess said you are in town for a race?\" We have never had service like this before, and it shows that the manager actually cares about the interaction with his patrons. It's not just the same question over and over... how's the food? Ok, thanks for coming....see you next time.  The burgers were great and the sweet potato tots were mini bites of heaven dipped in maple goodness. We will for sure return when we are back in town. Thank you so much!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ul68zwfbSnTgLLzZWQohtg"
  },
  "DgXTneCiCXuyDB1nhNO_4w": {
    "date": "10/26/2016",
    "text": "I can't believe that I haven't reviewed this place before! I'm in love with the Morning Ride burger, and get this. Are you ready? You may want to sit down, this is big news. Especially coming from me....   Even the veggie burger looked good.   I know. Seriously. Everything looks delicious here, and it is. I came in for lunch yesterday and sat at the bar, they weren't terribly busy so service was friendly and quick. They have a good beer selection, and the whole front row of taps is Charlotte beer heavy. I ordered the Morning Ride burger with tots - not your healthiest choice. But my friend ordered the Spin Class veggie burger, and it looked fantastic. I should have taken a picture. I was (almost) food jealous - over a VEGGIE BURGER. There's not even any meat in there! This is a big deal, people. Kickstand must be doing something right.  The parking lot is a mess, the traffic and road work outside just makes it all worse. No one knows where to drive or what to do. Kickstand is in the same building as one of the La Unica locations. They share bathrooms in the middle by the basketball game - little bit confusing at first, but you'll figure it out.   I'll definitely be coming back here when I'm in the Plaza neighborhood, but probably on off hours when the parking lot is less of a monster.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLgFEumhrHq6LgbEOKCzdw"
  },
  "F7RhEom_s6LMp-eQ1rAB1g": {
    "date": "8/10/2013",
    "text": "I stopped here for a bite to eat between visits to my two favorite breweries,.  As usual, I sat myself a the bar.  I was quite impressed with the craft beer selection.  I was looking at the selection on the bar and and the bartender pointed out the additional taps across from those taps on the back wall.  He even read them off to me.  Awesome!!!!  Being that I just came from NoDa and was headed to Triple C, I decided on a Lagunitas IPA.  Really, you can't go wrong with anything from Lagunitas!!!!  Quote me on that!!!  For the burger, I went with the Booty burger which was inspired by the bike riders who do the 24 hours of booty.  It consisted of a turkey burger, avacodo, lettuce, tomato, onions and a mild jalapeno pesto.   Wow.  Honestly, after a few of my other favorite turkey burger places have slacked off, I can now proclaim that THIS is the best turkey burger I have ever tasted.  So why stop at 4 stars.....well, it's the fries.  They did not blow me away.  They seemed to be the quick fried and fried again type of fry.  I would have preferred a more traditional type of fry like maybe a steak fry?  Service wise, I was impressed with the first bartender but there were two and the 2nd seemed to go with being corny instead of being helpful.    Still a great place and I think I will have to come back here again to see if they can overtake Bad Daddy's as my favorite burger joint in Charlotte!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "zumwY8Pbn_-dUdzR7VPlQQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Only part if the draft beer selection",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zumwY8Pbn_-dUdzR7VPlQQ/o.jpg"
      }
    ],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "2ilrGjFv3ogtXmUFD12gMw": {
    "date": "7/24/2018",
    "text": "Kickstand is always a favorite! its a low-key, laid back spot to have some drinks and eat. Plus its in walking distance to so many other great spots in Plaza-Midwood. The burgers and great and you cant beat $2.50 drafts! We were in on Saturday to begin my Birthday shenanigans. We were greeted and seated quickly. Our waitress was pleasant and took our orders and we got drinks but we were hungry and the food seemed to take a while... The manager stopped by to tell us that the POS had gone down. If you've never worked in a restaurant you have no idea what a nightmare it is when the system goes down! You're at the mercy of a tech on the phone until he/she can resolve the issue. Our table had no issue with the wait because we all had worked in the service industry through college and felt their pains in their current situation. As always, when our food came out it was delicious, our glasses were always full and the staff remained attentive through their mini crisis.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_150KcoMhzi0rbnRc36I7w"
  },
  "wRau-TjKNGW6YBkpXVLO1g": {
    "date": "1/8/2018",
    "text": "Man with this Being a UGA bar, i have to give it to the bartender, autumn. She may be an Alabama fan but she works her tail off to make sure Everyone else is taken care of. She's Very laid Back and will crack a joke on you just as much  as the next person talks shit hah.  However, I walked by the kitchen multiple times and may have peeked in. The kitchen staff doesn't wear gloves before touching any food which is disgusting. Please fix that. Makes us all just want to go somewhere where it's clean and take your awesome bartender Autumn, with u.   Sincerely, An avid fan of Kickstand",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JH_aKrbUThK2wYs_S8zyQ"
  },
  "DeLVpiSlH6xREs9g45FRzA": {
    "date": "6/22/2015",
    "text": "We make asses of ourselves when in a big group.  They let us carry on, I'm assuming we keep it somewhat down.  Haha. They get five stars for their tolerance, amazing food (order anything, but specifically order the booty burger and onion tangles), and local beer.  Kudos to you guys. Sorry for being obnoxious and loud!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tKWz4Veij0G4dvsL9KKwMg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Yuuuum",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tKWz4Veij0G4dvsL9KKwMg/o.jpg"
      },
      {
        "img_id": "GGAuVeYTgy_zJBxfOV4g7g",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Booty Burger and AMAAAAZIMGLY delicious fries!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GGAuVeYTgy_zJBxfOV4g7g/o.jpg"
      },
      {
        "img_id": "eF8u__R00Y7y_Gw6XaigVg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Booty burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eF8u__R00Y7y_Gw6XaigVg/o.jpg"
      }
    ],
    "user_id": "1jbAZCXnpbO1GmjhXvO7Ew"
  },
  "6FFtlONweLGXtEvRtdxjUQ": {
    "date": "2/11/2011",
    "text": "Pleasantly surprised...I really wasn't a fan of the previous common house that was here so it took me awhile to take a chance on Kickstand.  I am glad I gave it a chance I had one of the best turkey burgers in a long time. Yes the menu is full of grease and fried food but if that is what you are looking for you can't go wrong here. Tons of interesting burger combos and sweet potato tater tots with maple syrup I have to admit the tater tots sounded much better on the menu then they actually tasted. Overall service was good, decent drink specials -$4 Smirnoff flavored vodka drinks on Thurs. nights and food met my expectations.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "xJafm7vGSkUI5ocgYkCWkA"
  },
  "bMvEeaYI0wVk_EpX0cbZ6Q": {
    "date": "10/26/2010",
    "text": "I was craving burgers for lunch something fierce the other day and since Kickstand had just opened in the neighborhood I convinced the roommate that we should absolutely go. I had heard good things and he seemed pleased when he tried it with a friend the week before, so my expectations were high.  Here's the breakdown:  Service: Super. Better than that. Amazingly super! Everyone was very attentive, to the point where the bartender flipped the tv in our booth to the Hokies game without our having to ask because we both had on Virginia Tech t-shirts. The servers were fantastically friendly as well.  Decor: It's bicycle themed, y'all. It's bright and clean and very very bicycle themed.  Booze: The beer list was of decent length and filled with interesting, non-bud/miller/coors choices. My Cottonwood Pumpkin even came with some pumpkin pie spice around the rim. They seem to have a generous amount of drink specials which the server made sure to inform us of.  Roomie was a touch sad they didnt have Shiner on tap, but he will live.  Food: Here's where my review begins to falter a bit. I got the Cross Country, which came with pepperjack, pico-de-gallo, onion, tomato, lettuce,  jalepeno spread, guacamole (which i actually dislike but didnt see in the list) & and a partridge in a pear tree. There was so many toppings that nothing really shone through. In fact I couldn't even detect the dreaded guac. My side of sweet potato fries was adequate but the dipping sauce tey gave me tasted like straight-up pancake syrup. Not my cup of tea (or should I say, cup of sugar). My roommate go the Hungover Cyclist, which is a burger between two grilled cheese sandwiches. The problem was that he sandwiches were made on texas toast so there was just too much darn bread to properly eat the thing.  I don't like to make flat out direct comparisons in reviews, but frankly, if you are thinking of eating at Kickstand, do yourself a favor and go to Big Daddy's instead. It is essentially the same restaurant, but BDs just makes tastier food.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "FXPGGtOlCawxz5Uw5DNF3A"
  },
  "y2nfqSfMBUwV0LQd2UbnLw": {
    "date": "10/1/2010",
    "text": "I decided to visit Kickstand on opening night after reading Sarah Crosland's article in Charlotte Magazine. It's rare to find a burger joint that offers a new twist on the American staple, but Kickstand does a darn good job.  The hostess and wait staff were exceptionally friendly and attentive, without being intrusive. They seemed excited to be part of the Kickstand team, which impressed me from the jump.  I had a Burger Pocket Press, a juicy patty stuffed with bacon, mushrooms, and Swiss cheese. Interesting idea, right? It was tasty (bacon FTW!) and hearty. North Carolina doesn't let you get a medium rare burger, which drives me nuts, but the Pocket Press was still a good choice.  My only recommendation was for the sweet potato tots to be served as a stand-alone side. They offer a mix of regular tater tots and sweet tater tots, but the sweet potato tots are so good they deserve their own plate.  Finally, on the decor: A TV at every table makes Kickstand a perfect place to catch a Panthers game or, presumably, a cycling event. Gimme the football. The set-up seems ideal for a sports fan without resorting to sports bar cliches.  Kickstand is a solid addition to the CLT dining scene. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 4
    },
    "photos": [],
    "user_id": "kmgNkPEC3BSlfLC_iQiRCg"
  },
  "tUx5L2kjlbA1B_CnH8d5Kw": {
    "date": "1/31/2011",
    "text": "I tried out Kickstand over the weekend with my boyfriend and another couple. We'd driven by a few times and decided it was time to finally stop in. I enjoyed the bicycle decor on the walls, menu, etc, as well as the creative names for each of the different types of burgers. The menu had quite a few vegetarian options as well as an extensive list of burgers. On Saturday nights they have buckets of beer (6 bottles) for $12, which I thought was a great deal. The drink specials were also quite good for the other days of the week...will have to go back to try them out.  In terms of food, everyone at my table (except me), got one of the burgers. Each person tried a different kind, and all were very pleased. I got the veggie sandwich with Kickstand's homemade artichoke spread, which was delicious. I also got the tater tots. Now, I'm a sucker for any restaurant that sells tots, and these did not disappoint. I also tried the sweet potato fries and they were pretty good.  We started the meal out with the veggie flatbread, and it was surprisingly good. So good, in fact, that I plan to order it as my main course the next time I visit.   The service was great, although the TV in the booth was a bit overwhelming - especially if you've got four people crammed into the seats. The only real con I had was that parking was pretty tight. Once we found a spot, though, it was a great meal with a cool atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "4oSao9GTLxFTurp9NFpE4Q"
  },
  "4xEoqe3jFEUnHNrPhcAl0Q": {
    "date": "12/10/2010",
    "text": "So it's deep-fried, and huge, but there's a house-made veggie burger here and you can get it any way that's on the menu without having to explain that no, you don't eat bacon.   Rad.  But the last time I ate here, I thought I was going to die twice - from delicious fried-food coma (which is absolutely impossible to avoid here) and then later, again, when my stomach was trying to beat some sense into me for having scarfed that much oil.   And since I usually pick wherever has the least TVs within view to sit, be it bar, hightop, booth, or table, walking into this maze of LCD flusters me and I stand there wide-eyed trying to settle on somewhere while the hostess's holding the menus and eyeballing me. I mean I've only been twice but it's happened both times. Like a deer in the ESPNlights. Baaa.  So ya - if you want to watch the game and scarf a seriously gut-busting burger, have ats. Beer selection is goodish, tho they seem to be struggling having their entire list ready to tap. Staff seems capable and somewhat nerdy, plus plus. Mixed sweet/regular tots, yay. Onion tangles, meh. Don't get the cheese fries if you don't like cheez whiz.   Do get the hungover cyclist if you're into spectacleburger - even if you aren't the food porn type you're gonna wanna take a picture. The most bizarre I've had thus far would have to be the cross country - complete mess flavor n texture-wise, but totally enjoyable.  The bikey theme gets totally lost in sports tchotchkey, for moi. Still, veg-friendly till the end! Yay!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "whqfWVBj4x5EDboIVDOymQ"
  },
  "CihR52e1gllChvjNGBIWYw": {
    "date": "2/11/2013",
    "text": "I like kickstand, we went on a Wednesday I think and it was 50 cent wings.  I got the naked buffalo medium wings, 8 count.  The wings were nice and crispy and sauced really well.  The wings had a lot of flavor and I could have probably ate 100 of them.  Next I moved onto the entree.  I got the running machine with tater tots.  The running machine is a turkey burger with lettuce, tomato, bacon (i didn't get bacon), bleu cheese crumbles, avocado ranch on a wheat bun.  The burger was really good.  The mix of flavors between the turkey burger and the avocado ranch really gave the burger a lot of flavor.  As good as the burger was the tater tots were a lot better.  The tots were really crispy and came out piping hot.  I really enjoyed the food and it was priced well.  The service was good as well.  Side note I would not recommend any burger with a veggie patty.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "g1YMgvlEcrOPyosKVlR-ng"
  },
  "d-8AjO6gQKC6B1sc9F_buw": {
    "date": "2/17/2011",
    "text": "Short and Sweet:  Good food. Good service. Priced $4 - $5.00 higher than expected on things. Drink specials during the week are nice.  I've been here 4 times since they switched from Common House and it has been great. It's a nice default location.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "z3u1oR4117rCBntB5_-gPg"
  },
  "eH1xla3PS8QJ-J1HI2NnZw": {
    "date": "1/20/2014",
    "text": "I had a surprise birthday for my girlfriend at Kickstand last Saturday and was very delighted with how well everything was taken care of from providing a private room to great food and drinks. The manager Justin really looked after each of my guests and made sure everyone was enjoying themselves. If you get a chance to stop by I would highly recommend one of their mouth-watering burgers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2mMED4rFIxXo--rQeBSPxw"
  },
  "G0JOIq1tSt5jGEHPPwgOBQ": {
    "date": "12/15/2015",
    "text": "Staff is great, food is wonderful, try the Trek or Morning ride and you will not regret. You can not go wrong by going there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "htGAGxBXa1QsmYAdFnvL1w"
  },
  "kAvfjMgCq-t9nHbzDBZEhw": {
    "date": "11/5/2013",
    "text": "Service was great. Beer was cheap. Good menu options for large parties including veggies.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fZoXZmSR-xnpjG5zi7ALrQ"
  },
  "oTI2Qb80utVntModhtSCQg": {
    "date": "3/3/2014",
    "text": "Kickstand Burgers & Bar is amazing.  The booty burger ( a turkey burger with avocado, pimento cheese, and a cilantro spread) is delicious and a great option if you are trying to limit red meat.  It is probably the tastiest turkey burger I've ever had.  You can hardly tell that it's turkey.  Kickstand has a laid-back atmosphere and really cool bicycle decor.  Plenty of seating and off street parking.  I sort of wish they didn't have so many TVs but the place still has a quaint atmosphere and I suppose the TVs are good for sports fans trying to keep up on games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-twdrk90QiwCAkrOyVQEzg"
  },
  "eo7lPpNdJg8nRiPsyJgVOA": {
    "date": "1/10/2016",
    "text": "My girlfriend and I stopped by this place for the first time on Friday night for dinner. It was a full house but we were seated pretty quickly in the bar area. Our waitress was very nice and helped us decide on which wing flavor to order.  We ordered the 12 piece wing. half citrus chipotle and half spicy tiger. The wings were crispy and delicious. When the wings arrived, I noticed that we had more than 12 wings on the plate. I called the waitress over and asked how many wings she put in us in for and she said 16. She acknowledged her mistake and only charged us for a 12 piece. I ordered the Cuban burger with a side of tater tots. My girlfriend ordered a burger with chili and coleslaw, (not sure what the name of it was) and a side of fries.  The burger was just ok. I didn't really like the seasoning on the burger. It was a little weird and  my tots tasted just like the ones you get from the frozen isle. I tasted some of my gf's fries and they were good.  I will definitely be back to try something different because I did like the wings and the service was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MLifl0vOxKVdykNK7a9K5A"
  },
  "tlQ5PzjDnesHZPJ1iO-ZZw": {
    "date": "11/23/2010",
    "text": "After mixed reviews on here we were skeptical about giving Kickstand a try, however we finally caved after seeing an advertisement at Loco Lime for their Trivia Tuesdays.   The atmosphere is definitely not what you'd expect in this neighborhood but I didn't hate it. There is a TV at every table - which I guess is great if you are a huge sports fan - but it just seemed to get in our way. My boyfriend and friend decided to do \"The Tricycle\" - a mild version of an eating contest. 3 patties wrapped in bacon with cheese, lettuce, tomato, onion, plus one side plus a PBR tallboy. There is no time limit but if you finish it you get your picture up on the wall and if you go on Tuesdays it's $2 off. They had little comment on how their food tasted since they were racing each other to finish, but my burger (just a burger with cheese and bacon) was quite good. I got the mac-n-cheese side dish which cost extra but it was good, too.   It's not somewhere I'm dying to go back to, but it's also not somewhere that I'll never dine again. It was very middle of the road for me. Decent burger at a decent price.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "LrmydTRoVKaQiSYUhLxzXQ"
  },
  "ya2a3P0BKjZsiaCY4aVVTg": {
    "date": "4/8/2013",
    "text": "Great burgers and really good service. The beer selection is large and the fried pickles are some of the best in Charlotte!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ug3rqe3jERMYyvm-1w95gg"
  },
  "8gryP-kO925tl8JqLV5lFQ": {
    "date": "11/9/2010",
    "text": "I've been waiting to try Kickstand for a while considering my love for a good burger. There's some positive and negative reviews based on food and/or # of TV's, etc. It's a sports bar in Plaza Midwood, so it gets a knock against it by many for that. For me, variety is great.   When we got there we sat in one of the booths. Now I love a good sports bar and this one has a neighborhood feel to it. Granted the TV's in the booths are a little much, but all the other TV's are just fine and make for a great game day! Had a great lunch special that day for $6.95 which included a burger, side and drink. Ordered the bacon cheeseburger medium with the onion straws as a side. Came with onion, tomato & lettuce w/pickle.   The meal for me was OK. It was a good burger, though a tad overcooked. That said; it had good flavor and was a great size for the price, special price or not. The let down were the onion straws though. They were soaked in oil/grease as if they hadn't been cooked long enough. I was able to dive into some of the wife's tater tots and they were good. I'd go with the tots next time for sure. Good experience and I'd return for another meal for sure.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "c8cur4lMkQsHoUEqm-qwxg"
  },
  "AKi_GfIxr8eaWefIC1DeYA": {
    "date": "12/15/2012",
    "text": "Best veggie burger ever! You can't beat the $3 drafts on Tuesdays either. The staff is awesome and make sure you all of they have specials, they come up with some ridiculous burgers.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "NPSqLRpALH46yOfd5jzomQ"
  },
  "Y2uOCUysGeX_MADBGgjwgw": {
    "date": "4/16/2014",
    "text": "I've only been a couple times but have had great food each time. Veggie burgers are homemade, not a frozen patty. They can be substituted for any specialty burger, but I've found I prefer the toppings they made up for the veggie burger. The meat-eaters in my group thought the regular burgers were pretty tasty! We all enjoyed the pimento cheese fries!  I have booked two parties for large groups, one of about 20 and one of 75. They are very helpful and easy to book with. Staff was helpful and attentive.   There is a large back patio and a smaller one out front. Dogs are welcome on the back patio, not sure about the front.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4zVw-PIu_SEZ-sIzu19gSw"
  },
  "woTfzGMjcQtzm78ARMqgcg": {
    "date": "6/11/2013",
    "text": "My friend, her husband and two sons were visiting from Ohio.  They wanted to go somewhere that had burgers for their sons, so I suggested Kickstand.  We were seated at a spacious, round table with crayons provided for children.  This was most excellent because one son, who has autism, loves to color and draw.  He felt quite comfortable in this place that was new to him.  I ordered a salad featuring a multitude of ingredients, including walnuts, tomatoes and blue cheese.  It featured a burger on top, so I chose black bean.  The blue cheese vinaigrette that accompanied it was tasty and the right amount for the salad.  The children ordered nachos and burgers, which promptly disappeared.  My friend had the turkey burger with a side of vibrantly green broccoli.  She stated that the broccoli was a little hard to cut, but that did not stop her from eating it.  Her husband ordered the chicken sandwich, which he inhaled.  Our waiter kept my water glass full and was the right amount of attentive.  Parking is a bit sparse, but a little driving around was well worth the dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wus7S9rFi7xYxmNgFm0UOQ"
  },
  "XVPvbwK1h1aaG8lqVCz_YA": {
    "date": "5/9/2013",
    "text": "Just a quick update since I've eaten here several times since I first wrote. Now i can speak to their food. I ordered a crispy buffalo chicken sandwich with blue cheese crumbles on ciabatta and it was awesome! I would go with tots versus fries as the fries tasted well...a little like they have been frozen for quite some time. I've tried some of their other options as well but overall the Buffalo has been my favorite (warning though it's not very spicy). Overall the service is always very quick and friendly. It makes for ideal spot for a quick late-night meal option or even take-out lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "oBZ4kqgPKFJ1he54PZD78Q": {
    "date": "10/9/2010",
    "text": "I was disappointed when I headed over to the restaurant formerly known as Common House and discovered it was now a burger joint. It's OK, I thought, Common House turned out some pretty good burgers in its day. So I decided to give it a chance.  I won't make that mistake again.  First, the menu: Everything has some kind of bike-ish name, except for the cocktails, which are all named after old movie stars (and Clint Eastwood). I don't really get it.  We decided to start with the cheese fries, which came with a healthy topping of queso I'm guessing came from Loco Lime next door and a sparse sprinkling of bacon and green onions. The fries themselves are pretty solid and the bacon isn't bad, but fries + cheese sauce = a soggy mess.  Next came our burgers. I got a plain cheeseburger and my friend got the stuffed burger. My burger was dry and kind of tasteless. My friend said his burger was overwhelmed by the horseradish mayo and that the stuffing wasn't anything but a gimmick. As for our sides, the fries, again, were pretty good. I got the combo tater tots. The regular tots were fine--nothing special--but the sweet potato tots dipped in the maple butter sauce... It's the first time in my life I've ever wanted to spit something out a restaurant. It's a combination of flavors that just don't work and the tots themselves have an odd texture.  There's nothing at Kickstand you can't get elsewhere--and better--at all the other burger bars in Charlotte. There's nothing about this place that has me coming back for seconds.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "uIu2oifqdP1VJe7bYLJ6ug"
  },
  "0sgnaH8jAYAWkwQAfyklLA": {
    "date": "11/16/2014",
    "text": "Love the food, great drinks and nice staff. Great sports bar  and location. A Charlotte must for visitors and hangout place for locals",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6Zocj-Bpb9kP1NyBYUCyaw"
  },
  "YqvPm33X2VQor0w3pQoHJQ": {
    "date": "2/8/2011",
    "text": "I frequent this place pretty often, more so back in football season. The TVs at Kickstand are not unlike a Best Buy show floor and the beer selection isn't too bad. Try to grab a booth seat near the entrance as it comes with your own personal HDTV in the booth.  As for the menu, there's a lot of burger options. I would suggest trying the veggie burger (which is more of a black bean burger) loaded with guac, tomato, and a chipotle sour cream...very on point. I usually go with tater tots for a side too. Fried pickles are a nice appetizer option here as well. They use a nice crunchy batter, but can be a bit thin at times. Still worth checking out...",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "e4YDUaSxu6806-MoAMi-xw"
  },
  "jrpdgaQkAExVdeloD94kBA": {
    "date": "7/26/2011",
    "text": "I love toppings- food accessories- dipping sauces- I'm a major fan. However, I think Kickstand reached a topping crescendo. I got the Kickstand burger and the fig preserves were yummy, the onions were yummy, if I could have tasted my brie it probably would have been yummy too- however it was just too much. I can't really dislike any place with outdoor seating in walkable distance to my house (oh yeah $2 mimosas on the day I went!) but it just wasn't anything special and with so many dining options Kickstand should be special.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "XatJ1Tkqw5dw5n7WeWr_FA"
  },
  "taDf4oPt13mRWsuP2T6Tog": {
    "date": "8/18/2013",
    "text": "Great! I was here with a larg group and the server was not phased by the number, she was friendly and at the top of her game. We had a few appetizers inculding the mozzarella sticks which had great flavor, the fries...so light amd crispy,  and the wings...oh yum, you can't go wrong with any flavor Kickstand offers. I also had the beef sliders with bacon, cheese, and bbq sauce. They were great! The buns were fresh, the burgers were right off of the grill, the bacon was cooked perfectly, and cheese was melty goodness! I can't wait to visit Kickstand again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HVq7SYfZ4hpFFVsAU_Ub_Q"
  },
  "1SwY_q4TtDRWb81BDpAGyw": {
    "date": "8/12/2013",
    "text": "Very good burger! I order the double turkey on whole wheat. It was cooked perfectly, not too dry, which is unusual. Cannot wait to come back. Also $3 draft on Tuesday!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a1jRkUfUWmoo6LIV7jprgg"
  },
  "TggCBcg-T_an98flIDb58g": {
    "date": "1/9/2011",
    "text": "I have a personal rule whenever I visit a restaurant - everything deserves a second try. On my first visit to Kickstand, I went with a friend and we sat outside on the little patio area. The food was decent but not exceptional. The burger itself was pretty plain, but the toppings and bun made up for it. I had sweet potato fries and they were a decent compliment, if not a bit squishy. They were served with a thick sludgy brown sugar syrup that was more sweet than flavorful. Decent service balanced it out, and I was ready to give it a second shot.  On my second trip, the service was beyond great. The wait staff turned our in-booth TV to the Virginia Tech football game because they saw us wearing our school colors. The food on the second trip was... Well, again, mediocre. I got the Hungover Cyclist which is a variant on my personal holy grail of burgers - the grilled-cheese buns hamburger. I've had it in several places that all put their spin on this cheesy miracle. I really hate to say it, but the one in my neighborhood did the worst. The grilled cheeses were enormous Texas toast slices that drowned out any flavor of cheese or burger with gummy bread. In addition, the only topping on the burger was tomato - even though I asked for some lettuce for balance, I didn't get it. Just a meat patty and a tomato slice between two incredibly awkward grilled cheeses.  So I gave it a third shot as a rubber match. I went solo and sat at the bar and left Kickstand completely frustrated. I happened to be there at the same time as another customer that came separately and sat down shortly after. The entire time I was there, the bartender never addressed us individually - he took our orders together, brought our food together, checked in on us at the same time, and brought our checks together. He spent the rest of the time leaning against the bar watching the news. In a complete class-act moment while watching a report about Obama in Indonesia, he remarked that Obama said \"It's great to be back in my birth country of Indonesia once again.\" I'm not a political person, I don't care what your side is, but if you're going to make completely idiotic and aggressive statements then we're done.   I've got better things to do with my time than eat a mediocre burger served by a mediocre staff.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "_isjlAWhwxeCNMhjDuyd6Q"
  },
  "BtWemuDi4BCtHoBbq3MXsg": {
    "date": "6/26/2013",
    "text": "Can't give this place a 5-star rating for one reason and one reason alone...their wings. Although good, they just simply are not spicy enough. I'm not one of those spice-nuts either. I like a good spice, but one where I can still taste the wing. Their hottest flavor, \"Chef's Blazin' Hot\" tastes of pure spice, but isn't actually spicy at all. Big dissapointment because the wings are good, flavorful wings...just no heat when you want it! If they had a siracha-type of wing or a standard hot buffalo, this place would be off the charts. Who knows, maybe they'll pay attention to this post and had some heat to their wing line-up. One can only hope.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "szkmB7yKucOYTSYGSgUvZg"
  },
  "_FTUCbHioMa9bFoxdI7EGw": {
    "date": "7/25/2014",
    "text": "Great food, great service, and a fun atmosphere.  The burger options are plentiful and many local beers to accompany the meal.  Non-burger lovers will also have options, and the chicken nachos are always goooood.   If you don't know what you want, the daily special is usually my 'go to' meal.  If he has taken the time to create it, you need to give it a try even if you don't think the flavors/ingredients will match.  I've rarely been disappointed, and normally just as for the special and THEN ask what it is for the day.   This is also a good game day spot for college or NFL games, and we come here with the kids during the week since they enjoy the kids menu items.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZJbT57cOAiYl4f0KxUJ1ag"
  },
  "MKb7gGQxyIufGgrmp5ornA": {
    "date": "1/22/2014",
    "text": "I'll start this off by saying the parking here is kind of a challenge at lunch time. But other than the food is really great, although the portion amount is very small. I was not a big fan of that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZSb7Z66aPhixg6X3YuhM9g"
  },
  "obTQ7snyjFj6hdxkCFyz8Q": {
    "date": "1/28/2013",
    "text": "Kids eat free with paying adult on Tuesdays!!!!!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "CFxwxt4T6IHYRfz2NeAcdg"
  },
  "3E1Ah71OisU73shxkJ8MAA": {
    "date": "7/3/2011",
    "text": "I headed to Kickstand for a snack and a beer to see what it had to offer, being so mainstream and located in conjunction with a sister restaurant (?).  It is more a sports bar, as I went on a Sunday evening, and it was empty. The service was also really slow, though I cannot expect too much when I am just watching TV. I went with the chili and the OMB Captain Jack. Props for offering a local brew.  The food is not super expensive, about right for a place that provides a watering hole with some TV. My chili was not bad. It was chunky and had a kick, but it was missing that Texas depth that I like in my bowl o' red. The sweet cornbread was a good pairing.  Kickstand is a cool place to grab a brew and have something to munch on, but there are cooler places around this trendy area of town to do both. I would recommend you check out other options. This is a little boring.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1P9BpFZ_d3PGCdytDTYJCw"
  },
  "R7ANqgr5dyMpRso1JPO66Q": {
    "date": "3/4/2014",
    "text": "Wow. Fantastic burgers. Best I've had in Charlotte so far. They have a great selection of cleverly crafted gourmet burgers included the Cubano burger that I had which was great. Cool bar with a great outside seating area out back for the warm days/nights. Defintely recommend trying the burgers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hruyuRlxPI37_RAsaxbvYg"
  },
  "EKczjApZJU7Z6qMCzYfrJg": {
    "date": "8/7/2011",
    "text": "Hellooooooo hamburgers!  I don't give anything 5 stars, but Kickstand definitely gets the highest 4-star I can give.  So the hubs & I went to the sister spot about a week ago (Loco Limes), and Kickstand popped in my head tonight to try out when I wanted some to-go grub for home.   Perusing their menu online made for a *really* difficult ordering situation for me personally -- there's SO MUCH that sounds SOOOOOO GOOOOOD!  I'm all about mixed flavors, the \"weird\" over-the-top stuff.  Hubs order was easy:  Two Speed (bacon cheese burger) with tots.  I opted for The Trek (steak sauce, bleu cheese, caramelized onions) and...get this...sweet potato tots!  Holy good googly moogly are you kidding me?  That was the literal cherry on top.  The portions on the burger platters are plenty to fill up even ravishing appetites.  Being the mac & cheese sucker that I am, I got the homemade \"shells & cheese\" as an extra side. Very rich and creamy, but not really worth the extra side price.  Since I ordered to-go, I did have to wait just a few minutes for my order to be ready (not too long, I called ahead).  Nice bar atmosphere & looks like a great spot to hit during sports seasons -- flat-screen TVs on every available wall space (literally I think there are 30 TVs in total).  Outside patio includes a mounted dart board and two cornhole setups.   Don't miss out on some pretty good drink specials too -- the variety looks very nice and their beer selection is pretty broad.  1/2 price appetizers during the week from 4-6p also!  Only suggestion I have for improvement:  pave the parking lot!!!  Only the handicapped spots are paved (which is what we use), but you have to drive through gravel to get to them.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kpsYhe7aZpEbmXbuX09lHQ"
  },
  "b8cQYeK1VLPD9Dz2IQv1lA": {
    "date": "2/8/2011",
    "text": "I give it 2 stars because the taters tots are PHENOMENAL (sweet tater tots-Righteous!)..other than that, really, what would draw you there? A bar that used to have personality & individuality as COMMON HOUSE now has absolutely ZERO.  Its a chain bar/restaurant that promotes itself as nothing but that, in a neighborhood/area that celebrates uniqueness; what could you get there besides a few menu items you can't get 100 other bars in charlotte?   I also agree w/some other posters that w/all the chotskies and damn bicycles everywhere, it does seem to want to draw the REALLY young drinkers and be more of a Hooters/Boardwalk Billys/Vinnies type BAR than a bar/restaurant.   Plus pair it up w/its sister rest. LOCO LIME (with its gentrified mexican fare thats on its best day \"mehhh..\" ) and you have one big complex of bland ordinary-ness replacing what used to be a really great neighborhood place to go. WHATTTAA choice!: bland overpriced mexican food w/average service OR...burgers & fries w/fratboys....how about we start having peanuts at the tables we can throw everywhere while you're at it!!!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "OrDjTUUA8z8p-FJQ5OjNag"
  },
  "8azH1aZ-NXg4M9mtDq0D8Q": {
    "date": "7/1/2014",
    "text": "This place was so whatever.  Some okay beers on tap.  However, the server spoke as if everything was so amazing.  I ordered a turkey burger.  We explained to her we were from California and asked if we could get them protein style.  It means wrapped in lettuce with no bread.  She said, yes, they called it, naked.  Anyway, my puny burnt turkey paddy showed up with a piece of lettuce and a tomato.  No bun.  The burnt turkey paddy was thin and very small.  If you are going to be a burger place, at least have burgers a descent size.  Mcdonalds is bigger!  The fries were over fried and just not good.  The tater tots seemed like they were microwave.  It was not very busy and service was terrible.  We had to track down the server to order drinks.  She was not even there when our food arrived to make sure we were all good. I am sure,  I will never be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "53yPSzRrZLQVVdvn6AkSDw"
  },
  "A3DnBY63okLNdz8ROjw9uA": {
    "date": "2/2/2011",
    "text": "Killer spot with tons of TVs and pretty sweet little HDTV's in your booth.  Buffalo wing and chilling buffet all day on game days for only $12.95. In other words a fan freaking tastic place to watch football.   The wings are great, the buffalo flavored are tasty and spicy. Some places have a hard time finding that balance. I ordered the spicy tiger flavor and was thoroughly impressed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "411MfS_Bl8E2A8NiG8CIbQ"
  },
  "Io6eLq1Dh9eX60FIVk7YyQ": {
    "date": "2/23/2016",
    "text": "Best neighborhood pub in Charlotte. Even though Mallory takes care of every customer at the bar, she makes you feel like you're the only one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j41bGK9fU_33KO-u-HRBfg"
  },
  "YvPEe1sJW8dPrdQCq-TZ7A": {
    "date": "10/16/2010",
    "text": "Where can you find a juicy and delicious burger, friendly staff and kitchsy atmosphere? Kickstand!  I was really intrigued about Kickstand so when a business contact suggested lunch here I jumped at the chance. What I walked into was a really relaxed vibe with bicycles all around - in their menu, on the premises, etc. I like it! Plus, they are working through some great events that will benefit local nonprofits through this bicycle feel, so that's just grand with me. So, I bet you're wondering about the food, aren't you? Well, here we go...  Beer selection: Nice selection overall...lots of seasonal brews, too! Specials looked pretty super, too.   Fixed Gear Burger: Their juicy classic cheddar cheeseburger cooked to absolute perfection - I had a bit of pink in my burger which made me practically drool all over the table. Total noms. Plus, the cheese was super duper melty - total win. With these two qualities, plus a toasted bun I was a very, very happy camper.  Sweet potato tots: I love me a tot and these have potential. They are eponymous: sweet potato tater tots and served with a mapley buttery dipping sauce. I just wish that they were a bit saltier -  some kosher sea salt added to the mix would be delicious, as I'm a huge fan of the sweet/salty combo. If Kickstand boosts the flavor/richness/saltiness and I'll have to restrain myself from turning into a tater tot.   Parfait desserts: These were on the house as they asked my dining partner and me to give them a try. There were three kinds: chocolate brownie, strawberry cheesecake and key lime. As I'm such a sugar head as it is, these were pretty damn tasty. Creamy parfaits (no, not yogurt) topped with deliciousness of all sorts. My favorite was actually the key lime. These are listed for $3 each and they are a really generous and sweet (ha-pun) end to the meal.   I truly enjoyed Kickstand and I'm very much looking forward to coming back.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 10,
      "cool": 7
    },
    "photos": [],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "hjKHPVmdxL6CP3c5HPacHQ": {
    "date": "1/9/2011",
    "text": "Spent about an hour at the bar drinking local beers with a friend.  It was a cool place to hang out, chat and get to know each other and occasionally watch the numerous amounts of TV's in the place showing the NFL playoffs and college basketball.  The staff was really friendly and attentive.  It is hard to do burgers with alot of creativity, but they succeeded.  I had the Morning Burger topped with an egg, I had them leave off the hollandaise sauce (not a fan of the extra fat and calories it adds - especially when the taste of the meat and egg were so delicious).  I would go back!",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "1gEx8Si6rkStWBp_IXnGCw"
  },
  "IdUedXofxAwle11jhYJH3g": {
    "date": "11/6/2010",
    "text": "We were heading to Loco Lime for dinner when we decided to try Kickstand instead.   Mistake.   We convinced our kids to eat there because they had a TV in the booth. Not that we'd sit and watch, and not that the kids would really sit there and watch, but the fact that they didn't have audio kind of sucked for watching The Flintsones (for the first time in their lives). And what if they did have audio on these in-booth units - would everyone in the restaurant be trying to out-blast the audio from TVs in bordering booths? No, no audio is probably best. Unless you really want/need to hear what's in your face right there in the booth.   We ordered cheese fries. They were disgusting. If you're going to make cheese fries, at least start with quality fries. Kickstand's fries were like fatter Burger King fries - with that faux crunchy exterior and fluffy middle, swimming in cheese sauce. Sure, there are like five pounds of fries, but I like McDonald's fries, so this appetizer was a bummer.   The burgers were ok. Nothing to rave about. Quality beef is quality beef. If you're charging $8 for a burger, it's got to be at least as good as what is delivered to your plate. I guess some people might like the fancy concepts for some of their burgers - like a maple syrup on the side - but i don't.   My wife had two beers, and our total bill with tip was $50. Fifty bucks for burgers for dinner. I'm not complaining about the price - after all, i saw the prices before I ordered. But when a massive plate of cheese fries sits on the table barely eaten, something's wrong. In fact, we had to box half of our dinner because it just wan't that good. Note - our server was brilliant, though.   If you're looking for a burger joint, there are better options in Charlotte. We frequent Hawthorne's and Loco Lime - which are owned by the same group that owns Kickstand - and this space's predecessor, Common House (also blah.) If you're looking for a place to watch sports and drink beer and grab a burger - maybe you'll like it. Drinking dilutes judgement.   I give this place six months. It was virtually empty on a Saturday night during the peak of the NCAA College Football season. Oh, and the whole bike theme is stupid. Just do great burgers and let your outstanding staff do their thing. Kill the in-booth TVs.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "1KqiKLBoOnw8c7P0HcBI8Q"
  },
  "ziplMVNHcyktT1FO-eWs8Q": {
    "date": "4/9/2018",
    "text": "Had a lunch date here. (3pm).. surprisingly it was empty. Very cool looking place. I was told they crowd is later. I had build your own burger. Chilly came on my burger which had chic pees in it. Which I did not like. My burger was basic. Tater tots were awesome. My friend got a chicken beast which was sent back twice. However they got it right the last time and she enjoyed it. I think the cook was off their game today. I will give a second chance",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yt_rgNE6kVDRzI7ujnn81w",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/yt_rgNE6kVDRzI7ujnn81w/o.jpg"
      }
    ],
    "user_id": "7x2d_TxjgMTlumoyChCLkw"
  },
  "dmapigq-cLC7QnkUC6j1pw": {
    "date": "10/28/2018",
    "text": "The 2.50 beers brought us, and even though they have disappeared, we will keep coming back. Food is always great (entire fried pickle spears, I mean come on), and the service can be scattered but prompt. Will continue to recommend to friends and family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xhm0nPVpjSbGU08Ho-KKFA"
  },
  "Zj80AuaE60QDwjjfafkevA": {
    "date": "8/17/2018",
    "text": "It's alright.. typical bar food(meh).. second time here and service was much better than the first time.. great prices! Great beer selection! I will come back but I'm not gonna entertain guests here, messed up my order both times here.. staff is very friendly and attentive..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6A7K2_-k1QeMIDLaGeE32g"
  },
  "VBRV5Imru7OKbiRA3ybRfQ": {
    "date": "7/22/2018",
    "text": "If I could give it no stars I would. Waited over 10 minutes to order a coke, 35 minutes for a burger; only for it to be wrong! It wasn't even busy. His order was also wrong. All the servers looked flustered. Waited too long for the wrong order and decided to go. I'm done paying for bad service. Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5-2NQKUSvNSCuSYzStuODA"
  },
  "ReU6enP3uknAaNnN86Gs1w": {
    "date": "5/9/2017",
    "text": "I love a good burger, but their's are GREAT! I can't stop thinking about the Kickstand burger. The flavors went together so well, and the side of pimento cheese fries visit me in my dreams. The meal was worth every carb consumed. And I'd consume them again...in a heartbeat!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kPhDDP542fw1PGxk75Y74A",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kPhDDP542fw1PGxk75Y74A/o.jpg"
      },
      {
        "img_id": "eGrTTBa8VaapjpwQV_LPGw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eGrTTBa8VaapjpwQV_LPGw/o.jpg"
      }
    ],
    "user_id": "qss1G9PhuUlFzdOlUVXl0Q"
  },
  "0NJvjOzsWK1ysLdRqsFCzg": {
    "date": "9/13/2018",
    "text": "I honestly don't get the hype. I've been there 3 times and have gotten a cheeseburger, wings and chicken tenders and everything has been gross. The chicken tenders are so over seasoned that they're barely edible. Service ALWAYS sucks even when there are hardly any customers in the place. Save your money and go somewhere else!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bed55KsGv1LEdbn4ZdJO3A"
  },
  "c4SFawNg2nrNDCIUe4wDQQ": {
    "date": "3/30/2016",
    "text": "If I was rating this as a bar to hang out with friends, have some fun watching a game or playing trivia while enjoying some great drink specials, then it would be a 5 all day. But we came here for the food, based on Yelp reviews, and so it gets a 3.  The menu is a good one, lots of choices without being overwhelming. I built my own burger (cheddar and bacon) and paid the up charge to have pimento cheese fries as my side. Hubby went with chicken nachos (right?  Who was this man?  He's usually all about the burgers) and the kid had shells and cheese.   The burger was well done, which I am not a fan of, but am ok with if the patty is still juicy. This one was not.  There was a good amount of cheese and bacon though. The fries were outstanding, but I would have loved to see some more of that yummy cheese. Speaking of cheese, it was a huge plate of nachos with plenty of chicken, just really light on the cheese. The kid loved his shells and cheese, but hey, he's 10 and is a big fan of velveeta, so there's that.   All in all, not a bad experience if you're looking for a cool place to hang out in a nice part of town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "w3tdhYHWJMTvdOq6_kScHg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Chicken nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/w3tdhYHWJMTvdOq6_kScHg/o.jpg"
      },
      {
        "img_id": "_CF6zJq4RL6w_2nfs-wFnQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Shells and cheese, straight up",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_CF6zJq4RL6w_2nfs-wFnQ/o.jpg"
      },
      {
        "img_id": "YiixwkwzIG2At6ueCunTPg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Build your own burger and side of pimento fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YiixwkwzIG2At6ueCunTPg/o.jpg"
      }
    ],
    "user_id": "bj49D4cftsnEr8cXtoFfRg"
  },
  "0ja3tCzXmstS36wP1Nfzow": {
    "date": "8/29/2018",
    "text": "We have frequented Kickstand often over the past couple of years and really enjoy the food. However there has been a steady decline in the service. Waiting 10 minutes for drinks. Getting appetizers after the food. I think we are done.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmQSxlY65_Zaf77XTmBOKg"
  },
  "n6ooPtGVeSbbDut5HmLNYQ": {
    "date": "7/7/2018",
    "text": "Apparently, recruiting talent is a skill that Kickstand does not possess. After many different waitresses messed up our family's orders for the past 4 years, enough is enough. We have given this place waaaaaaaaaaay too many second chances because it is so close to our house. I even left the $50 gift card apology on the table they gave me to come back. Order at your own risk...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XhLlyjo9Ca2LIHwkTt9d6Q"
  },
  "lW6-1IpIMKoKu7GEhCYweQ": {
    "date": "7/3/2018",
    "text": "Dear Kickstand, I love your fried pickles but have you guys ever tried frying Gherkin sweet pickles? Should give it a try :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sc9PO_8iLIkv1yER0SSAiw"
  },
  "UxZeEF90XpMhEmTLSgCQOQ": {
    "date": "7/3/2015",
    "text": "I recently visited Charlotte to see one of my sisters my mom, my nephew and the pups.  It was cool my mom drove from Atlanta to also be there.  Needless to say, when I arrived, I wanted to take a nap.  So I did.  Then it was time to decide what to do for dinner.  I had not had a burger in a while (my diet consists of 95% Mexican foods these day, no joke).  So I used the trusty Yelp app, and figured I would give this place a shot.  I mean, trusty Yelper Daniel B had been here before!  We pulled up, it was 7PM or so on Saturday night.  I noticed this place was attached to a Mexican restaurant- and trust me, I wanted to eat there as well, but I somehow managed to fight the urge. And the fact my family was sold on burgers.    There were 5 of us total, and I was surprised the place was not more crowded, given the time.  I would say about 50% of the tables were occupied.  However, there was a party going on in the back room.    So they told us there would be a wait. We waited about 10 minutes.  While we were waiting, I decided to play the basketball arcade they have in the waiting area.  Too bad it wasn't working- I played 10 seconds then the balls all got stuck.  Boo.  Then I wasted 2$ trying to get a stuffed animal out of the claw machine (I used to be sadly awesome at the claws).  Then, we were called on.  When walking to our table, I realized that there were a lot of TVs in this place, and the place was not crowded, so what was up with the wait?  I saw too table that had not been bussed yet, that had sat like that for at least 20 minutes or so.  Bleh.  I got a tall glass of Yuengling (which I then noticed was a Saturday special, score) which tasted fresh- always a good sign.  I looked at the wall and saw they have food and drink specials every day of the week.  Also cool they have it on Saturday.  Seems like getting a beer these days is as much as getting a cocktail (maybe that is why I have been appealed to Keystone Light lately).  I got an order of fried mozzarella for the table.  Tasty, but overpriced.  The next choice was what type of burger to get.  This place isn't limited to burgers, and you can also customize hot dogs, but I was also set on a burger.  So I got a triple.  With a lot of stuff on it.  Cooked medium.  With a side of tater tots.  I was looking forward to this monstrosity.  The food came out relatively quickly.  When the burger was presented to me, the food runner told me I better eat all of that.  I laughed at her, and went on my business.  As I was double taking it, I kept realizing more and more how big that burger was- the picture just doesn't do it justice.  It was too big to shovel in my mouth- I had to eat from the bottom, then from the top.  But don't worry, I still ate it faster than the rest of table ate their single pattied burgers.  But, I almost had difficulties finishing it.  Why?  Because my medium burger was damn near well done, making it harder and harder near the end to be able to finish it.  I looked at my sister's friends (who came along for the hell of it- good dude) burger- it was almost red.  He got his medium rare.  His looked like it was the perfect color.  Not sure how they thought mine was medium.  I used the side of bbq to help \"moisten\" the burger.  The tots were ok, so I also dipped them in the sauce.  They had asked if we wanted dessert, I was too full to even think about dessert.  So it was time to get out of here.    The place is alright, but need to get their cleaning game on point.  Looks like a solid place to watch some sports and have some beer.",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 4
    },
    "photos": [],
    "user_id": "g8j2ci2FcvmocszcO6ypNw"
  },
  "V4QQRbLdOEbQLKLeH-Ph8g": {
    "date": "9/13/2016",
    "text": "We've only had a couple of experiences at Kickstand, the first was to watch the Panthers vs. Broncos last week. We got there about 20 minutes before the game started and scored the last table! Our server was very nice and attentive at first but, as the game extended passed regular closing time, her attitude became slightly less pleasant but, enough to tell that she didn't want to be there. But, I get that. Drink specials that night included 2.75 bud light bottles, the bf indulged in those, while I tried SA Oktoberfest for the first time ever.. I know, I'm lame. We also started off with the $5 pretzels with beer cheese, it pretty good.   What really irked me was that we were not given warning that the kitchen closed at 10... it was a late game and we were waiting for half time to order food. At half time, we were told that only apps and fried food were available. :/ I think its in the best interest of the server to warn your table that kitchen is closing so order up while you can. Since we couldn't order actual entrees, we opted to just share a fried pickle basket and eat when we got home. The pickles came out pretty quick and were much thicker than we had hoped. Still good though, the light breading had a nice crunch.   We returned this week to order takeout, the bf and I ordered a Kickstand burger with shells n cheese as a side with an upcharge of $1.25. The shells-n-cheese was very bland, I wouldn't recommend it if you are a mac n cheese connoisseur like me. I was disappointed to find all the seasonings like garlic and basil were actually in the beef patty and not in the actual burger as toppings.. we missed out since we switched out for chicken. The bf wasn't fond of the melted brie but, I thought it was ok. They were very generous with the caramelized onions.   I'd come back to try a burger, just be on top of ordering food when you stop by to watch a game.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "YYQegNmc4OLUNpL8Z70DxQ": {
    "date": "10/30/2017",
    "text": "Awesome burgers and wings. Must try the pimento cheese fries!! Delicious! Very friendly staff!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nfx80EGfqMlSBT_doX5nPw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nfx80EGfqMlSBT_doX5nPw/o.jpg"
      }
    ],
    "user_id": "2rd241YQsmGxibFsZslFTg"
  },
  "iGmsyuSNWUSn8wkM9WZbTA": {
    "date": "12/12/2018",
    "text": "The people that work there seem to have racist thoughts. My parents called in a Togo order, and when my Hispanic uncle walked in to pick it up the, ignorant employees thought it would be ok to discriminate against him. My uncle didn't even get a chance to say that he had placed a Togo order before the employee humiliated him. The employee said that my uncle was in the wrong place and that the Mexican restaurant was next door. I will never go back there again, and I will make sure that my family and friends will never spend their money there ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtWRwIaFchwksw3WVD-Srg"
  },
  "-BkWjA8frjQ3u7QC87pNlw": {
    "date": "10/12/2016",
    "text": "Kickstand is one of my favorite burgers in Charlotte! They are inventive and well executed! The Kickstand - burger with sundried tomatoes, onions, tomato and garlic - Brie cheese and cranberry chutney is my go to when I can't decide. The Mushroom and Swiss is always a classic. Their sides are very good! Especially the onion tanglers... but I would shy away from the sweet tots.   They have a good selection of local brews and a good atmosphere. The service is good and the ambiance is nice. If you are a football fan, you can watch the games there and it's not super busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzbiAVIgM4RCuEqNoS1Wcw"
  },
  "T-n30KvitbSuFjXRPQp3PQ": {
    "date": "11/7/2017",
    "text": "*****12/14/17 - Chris the manager made every effort to make my coworkers and I happy - AND WE ARE!  Everything was great and yummy!!!!  THANK YOU KICKSTAND!!!!  **** 11/14/17 - owner requested information on our order, then never responded to my message :(  My office typically orders from Kickstand at least once a month.  When we first started ordering out from them, we could not get enough!  Everyone loved the food.  Lately though, we have been having a difficult time getting our food prepared HOW we want it.  One of my co-workers likes all his food fried hard (fries, wings, etc...).  The past few times, even though it has been specifically requested, his fires have been limp and his wings have been \"gooey\" (for lack of a better word).  The last time we ordered, my coworker checked the to go boxes to make sure they were done correctly, and the manager got snippy with her.  AND it still was wrong. Sadly, we will be ordering from somewhere else from now on.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dmWHBMXKutRjQElhsFKxsA"
  },
  "kdhZXKvdkAbN3LgS7iF_rQ": {
    "date": "9/11/2017",
    "text": "This was alright for an affordable, casual dinner. We got the pimento cheese fries to start and LOVED them.  They gave you hugely generous portions, so unfortunately we weren't even that hungry by the time our food came.  I got a build your own burger and enjoyed the onion strings on them, but felt the burger itself was a little overcooked for my liking.  The ciabatta bread my burger was on was also kind of hard.  My partner got the french dip and felt the same \"meh\" feeling.  The meat was a little overcooked and not as rare as you would expect a french dip to be.  However, neither of our meals was terrible. And the appetizer made up for it all!  Additionally, they brought us to go cups for our drinks, which is always a nice touch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BzVZZQxj2Gwdde2vgZ6zyQ"
  },
  "VkSxeaI-wRa8Jy4fVN7VvA": {
    "date": "10/7/2016",
    "text": "Nice bartender. Nice server. Nice day.  Upon arrival, the host stand (or is it \"hostess stand\"?) was vacant for an extended period of time. While baffling, this allowed me the beautiful opportunity to pretend I worked there, greet people and hand out menus. I was able to fool at least two groups before an employee intervened.  Once seated at a picnic table outside, flies swarmed. With no food or drink on the table at this time, I deduced the flies were attracted to the table itself. Which must have been dirty.   I suggested to the server that she spray a significant amount of cleaner on the table. She seemed to take this as a joke. (Note: This was not a joke, but rather a serious suggestion.)  Other than the swarm of flies outside and the fact that they desperately need more servers, Kickstand is charming. A real anything-goes pub with good variety and prices on its menu, many TVs, and a spacious back patio.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wjJmHkExNTXyQGwmgc8TYA"
  },
  "xBN3r21fLapr-6DeFerQyQ": {
    "date": "6/16/2016",
    "text": "I ended up at Kickstand this past week because of group of work people wanted to go here.  I had been here once before but it had been years.  This restaurant is close to both Plaza Midwood and uptown.  Plaza Midwood has so many new options- but this one has been here for a bit now.  It's attached to La Unica which is a Mexican chain in Charlotte.  There used to be a different Mexican place in there.  Both restaurants share an entrance and restrooms too.  The menu has typical bar fare.  We came for lunch and the lunch and dinner menu appear to be the same.  After ordering I went to the restroom and noticed they had lunch specials written outside on a chalkboard- and one of which I would've probably ordered-  but our server didn't mention them to us.    I ordered a burger and my co-worker did as well.  Other people in my group had wings and other appetizers.  I personally love when they put a giant mound of food in front of me.  This didn't happen here.  The burger was good, flavorful and tasted very fresh- but wasn't a huge burger.  The fries were good but I could've eaten more.  They were placed in their own cardboard serving container on the plate- must be for portioning.  I would've liked some more fries to indulge with!  All in all a solid lunch spot.  It was a Monday and we were the only table in there.  Not too sure how lunch is on other afternoons, or how busy dinner may be.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "HZc-l7hEkl0SIqCH8swQtw"
  },
  "inSfkjNbFjEAtSr7CVpwOg": {
    "date": "6/18/2016",
    "text": "This edition of Excited about Eating takes us to our favorite area of Charlotte, Plaza Midwood and to Kickstand Burger Bar.  This bar type restaurant with TVs at most booths really capitalized on their namesake by hanging bikes all over the restaurant. They are giving away this particular bike.  We chose the Onion Tanglers appetizer, lightly breaded thin onion circles fried crispy that melted in your mouth.  The dipping sauce possessed a little kick.  Dora here. haha, just a little. Enough heat to ramp up your tongue without burning.:) But a tad greasy for my liking.  I ordered the \"Build a Dog\" with cole slaw and chili. Our server told us that these were Nathan hot dogs so I was confident in their quality. The large dogs, loaded with slaw and chili, were great. The only negative was the standard bun, over toasted and dry.  Dora here. Bummer. I went with the Trek burger topped with caramelized onions, Gorgonzola, steak sauce, and chipotle mayo. The burger was good, but a bit overloaded with steak sauce. I devoured most of the sweet tater tots, but ditched the syrup. I would've preferred a sprinkling of brown sugar rather than syrup. Yeah, go ahead and tell me I'm spoiled. I'll admit it.:)  Still Dora here. Our grandson really enjoyed his grilled cheese sandwich and was enthralled with the decor. He would definitely  vote for a return visit.:) The inside was clean and the service quick and friendly. In Charlotte, the private parking lot is always a bonus.  Do you frequent restaurants because your kids or grandkiddos like them? ~Ernie & Dora Hiers, Fiction Faith & Foodies Blog",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "B44fGkq_eOrDhvi6ki9jxg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Parking is in the back, so this is actually the back entrance",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/B44fGkq_eOrDhvi6ki9jxg/o.jpg"
      },
      {
        "img_id": "CCw22TRdCVgaRV8MxYC_kA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Onion Tanglers...just enough heat to ramp up your tongue without burning",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CCw22TRdCVgaRV8MxYC_kA/o.jpg"
      },
      {
        "img_id": "vD1-Khi6vzJdUUqYEmiliQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. TVs at most booths and bikes all over the restaurant. They are giving away this bike.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vD1-Khi6vzJdUUqYEmiliQ/o.jpg"
      }
    ],
    "user_id": "ZB5IDns20frfEJGUW1h6VQ"
  },
  "CxXgVXuJwCuddya2gjPGJg": {
    "date": "10/4/2011",
    "text": "I have been here since it used to be something else, mostly for the half price appetizer deal from 4-6pm. Let me just say, I appreciate any places that offer half price happy hour... it's easy on the wallet and a perfect early dinner option.  I do have a small complaint regarding Kickstand's menu.  They have a very small appetizer section, since they put wings and flatbread in their own categories.  And they don't count soup as appetizer (even though it's listed IN the appetizer section). It is sort of confusing... I don't think straight when I'm hungry you know.  I ordered the sliders (mushroom & swiss).  I love sliders, they look oh-so-adorable, don't they? Better yet, this place has tiny buns that the patties stick out from... all the naked juiciness exposed, calling my name, asking me to ravage them (Is it me or it's hot in here, whew!  Sorry for a little R-rated narration lol).  Back to the sliders... the burger has flavor, the mushroom was plentiful for this size of a burger.  And don't underestimate these little babies, they can be filling.  But just as I ordered the sliders, my eyes wondered to another item called \"fried grits.\"  Not being a big grits fan, I overlooked this item at first, but then something caught my eyes... did I see SAUSAGE & SHRIMP & GRAVY!?!  Holy Molly, it has \"Peggy\" written all over that.  So as much as I know I'm over-ordering, I got one of this bad boy and man, it was yummy.  The grits was slightly fried to give just a little crunch.  But it's mostly covered in this savory brown gravy with just a little chopped sausage and 2 shrimps (well... the shrimps were kind of tasteless) and chopped green onions.  It's not a big portion, and I almost picked up the plate to lick it clean.  The service was decent as well.  I sat at the bar, reading my magazine, and the bartender checked on me enough.  I ended up with a bill of just over $10 (after tax, before tips), that also included an ice cold Oktoberfest beer.  May I say Budget Friendly?!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "M4yYtAXehUzaHB1ghl6EXg"
  },
  "banAEDe03KwmqxAun2Qqew": {
    "date": "3/4/2012",
    "text": "Met a friend for the Carolina/Duke game(Go Heels!) we had been wanting stop here for awhile both of us love a good burger. During the first half we ordered fried pickles which were great. The breading was thick but well seasoned and did not over power the actual pickle. For my burger I ordered the signature Kick stand. It was ok, there was not much flavor other than the basil. It was also bit over cooked for my taste. The sweet potato tater tots however were scrumptious, who needs dessert?! Overall it's a great place to watch a game since they have more TV's than Best Buy, the beer menu is decent with offerings from local breweries but for a burger place I am disappoint.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EI-AAtRBjDN62q2OpnlPSA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Fried pickles",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/EI-AAtRBjDN62q2OpnlPSA/o.jpg"
      }
    ],
    "user_id": "kvSbYKO9Ir6gSgXNgWPDKA"
  },
  "5cZOuazw7QyABVeM6JCkvg": {
    "date": "6/12/2015",
    "text": "Best burgers I've ever had. I keep trying new things and have yet to have something I don't love. My current favorite is their veggie burger (the \"spin class\"), while my boyfriend can't stop ordering the fender bender. The onion tanglers, fried pickles, and fries are all on point as well. This is easily my favorite restaurant in Charlotte right now-- friendly staff, great food, good prices, and more than generous portions.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDgCGGivC1HX7YKlOL35Iw"
  },
  "lAh9d9HCXTAwb6U-gMoO4w": {
    "date": "7/15/2015",
    "text": "Staff is always friendly, knowledgeable, and patient. The burgers are spectacular, always juicy and would make anyone happy eating here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_yfJFzyym4iK82sTDpH6Q"
  },
  "e5___h-ZGUwxGQxWriTyNA": {
    "date": "7/13/2014",
    "text": "My husband and I came here for lunch and are now hooked. We sat on the back patio, the tables had umbrellas which made the heat bearable but they also have a small front porch area that is totally covered.  We ordered the fried pickles to start and were pretty pleased. It was obvious they made their own breading which appeared to have some panko and possibly parmesan mixed in which was awesome.  We both ordered the veggie burger with various toppings and were totally hooked. So far since living in clt it was the best I have had. I ordered mine on a wheat bun which was fresh made as well, I asked the waitress. I ordered the jalapeno cilantro sauce, jalapeno, carmelized onions and pico de gallo on mine and was in heaven. I ordered the  onion tanglers for my side and they were basically thin mini onion rings and really good. I would recommend dipping them in ranch! My husband ordered a veggie burger with lettuce, tomato, onion, guac and a few other toppings and the guac was really delicious. He had the fries for his side and I almost wished I had ordered them, they were super crispy which is how I like mine.  They have a pretty decent beer selection as well. All in all we will be going here again for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-U-K9z9oraMH7eBZW1dOA"
  },
  "FitTBql5pkUg-Iebyh0mRA": {
    "date": "1/11/2015",
    "text": "After living in the Plaza Midwood area for the past 17 years, I found a \"home\" at Kickstand.  The entire staff (hostesses, servers, bartenders and even GM, Josh) always takes time to welcome guests and engage in small talk.  The food is consistently great, and they have a nice beer selection.  The overall atmoshere always provides a great experience that will make you want to come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHCxZ3tTc-7ZG-sBpT0PhQ"
  },
  "A860ZXOQNxuYgX_OG1tK3g": {
    "date": "1/5/2015",
    "text": "Went there on Saturday to watch the Panthers game. Awesome, friendly staff, who were busy but also got drinks and food out to us when we needed it. The nachos and pizzas we had were very delicious, I'll have that again next time I go. Josh was very helpful and took care of all our needs. Overall we had a blast!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qzZiGN1ELk8xPnS7C7A4wQ"
  },
  "uHkeyOrIHvVpdwgQr5zeBA": {
    "date": "1/30/2012",
    "text": "Great burger, Great burger the second time I ordered it, Great deal on PBR (\"$1 for a can?\" \"Whoops, no, $1 for an ice-cold draft\" - all the time!), Great little side salad, Sub-par corn-on-the-cob but c'mon I ordered it in late January,  Great service,  Super friendly staff,  Bicycle friendly!,  TV's for sports it that's your thing, Cornbag out back,  Darts out back",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "9FPnZGGR1s-vQu5FMTkkCQ"
  },
  "SSwJt-RGR8NIGsG6MAA1pA": {
    "date": "12/14/2014",
    "text": "There is no better sports bar in Charlotte.  Lots of rotating local beers.  Great burgers, and I'm picky about my burgers - any 2 year old can roll a meat ball and call it a burger, but that's not what you get here.  The staff is phenomenal.  Ask for whatever you want and they will do their best to accommodate - want a different burger, just ask; want a a different game on TV, just ask; want the TV turned to your table, just ask.  AND IF YOUR A RED SOX FAN, YOU ARE AN IDIOT IF YOU GO ANY WHERE ELSE.  All they need is heaters and TV's on the porch and then I'd mice in and give up my apartment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wMfYNzTyLmb6Z6rbVF5V4A",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. There is no better sports bar in Charlotte.  Lots of local beer.  Great burgers (and i am one picky eater).  Great staff.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wMfYNzTyLmb6Z6rbVF5V4A/o.jpg"
      }
    ],
    "user_id": "sBtuKaWiXC9NDW2uMiV_dA"
  },
  "NIP-KjVRP4ehVnqW8mILbg": {
    "date": "9/16/2014",
    "text": "One of the best burgers I've ever had.  Ton of really great micro brews on draft.  Awesome genuine good service. Worth the venture!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KltZxX4NoS-jYq6PcehZYw"
  },
  "Y8MZnnSLgantNGV6GOuPug": {
    "date": "5/19/2014",
    "text": "I visited kickstand quite a few times and so far have never had a bad experience.  Service was slow once but who cares, you have a tv in your freakin booth which generally means I get to watch more of the game.   Their draft selection is pretty awesome.  They generally have a ton of local beers from triple C, Noda, and Bridsong.   The appetizers are pretty awesome.  I swear I could just order the nachos as a whole meal and be satisified, but this is america and its my damn right to get fat.  The fried pickles are served differently than I have had them down here.  They slice them into quarters and use a little more breading.  I think personally they taste better this way. Finally the burgers.  You get a decent sized patty and they do a great job of cooking it medium rare which i prefer.  I have done the Trek and the morning ride.  The trek is an all around great burger. Though if you think you can handle it I would do the morning ride.  Fried egg, hollandaise, bacon all served on an english muffin the size of your head.    Kickstand is a great burger bar at a decent price.  I will continue to swing by when I am hungry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "P98UZhiM7p0uCnvJY82QZA": {
    "date": "5/18/2016",
    "text": "Delicious food and great service. Large burger selection and friendly wait staff. Laid-back, casual atmosphere. Would definitely recommend Kickstand.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GH7V7DMCF2RIsJAjvIHqUQ"
  },
  "b5p0spZrz5womMyEFfGudg": {
    "date": "5/21/2011",
    "text": "So last night was my first 'check-in' to Kickstand but we frequent the bar.  This is my first write up on it and I have to share the experiences.  Certainly worth 4 stars.  Compared to other burgers in Elizabeth, it is an easy 5.    We recommend the Veggie burger, Cycle Zydeco, and their customize option.  I'm not one for veggie burgers but this one is wonderful.  My wife gets it everytime... and she's a meat eater too.  I ordered beef w/ monterey jack, bacon, fried egg, onion, bbq sauce.  They got it right.  It was perfect.  Faux real.  They also have reasonable prices on bar and it's a great place for sports.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "zvFeFboNMXqes2x5yqxpYw"
  },
  "3R2eHDlUB5zY8Lw9mzRnPg": {
    "date": "11/14/2015",
    "text": "Let me start by saying the food was absolutely delicious. It's pretty rare that I feel inclined to not come back due to the service but this service was extremely poor. Our server probably said about 10 words the entire time, our drinks were consistently empty, the food took forever, when the food came my burger came with items I asked to leave off and we got different sides, and we asked for our check and got it about 15 minutes later. It takes a lot to upset me this much with service but I will not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "le_vJz8QkhZx5SNfzGpENA"
  },
  "kpjhLidhZKffXRhDxMJMTg": {
    "date": "10/12/2014",
    "text": "Lunch today (Sunday, 10/12)  was busier than usual as more people find this place.  Major update was the burger special with peanut butter, bacon and onion twisters which should make it's permanent place on the menu in the future.  Had heard about such a combination from a burger joint in Portland, Or which is their best seller - but they should consider adding a touch of smokey bbq sauce and a few pickle slices.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bZfXmrgHdwrMhbJ-THf8cQ"
  },
  "YON3JFZnhDngnF9S84msFQ": {
    "date": "1/4/2015",
    "text": "Awesome restaurant in Plaza Midwood and Charlotte! A lot of places these days haven't preserved the art of good old fashioned customer service, but not Kickstand. I've worked in the industry and appreciate the small things. The staff makes you feel at home the second you walk in the door. Food quality is unparalleled. This is the rare place where you want to order the \"special\" each day unlike most trying to move old product.  Fantastic beer selection with rotating local taps. The GM, Josh, does a great job running a tight ship. This is not only a place I take my parents when visiting in town, but also a spot to meet with friends for a bite and catch the game just the same. 3 words to summarize the experiences I've had:  Best in Class.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZTDs_W1PMrRyf5kjjWElA"
  },
  "CgDY1IFo7MCBN948JI2klg": {
    "date": "7/19/2014",
    "text": "I went there with a group of friends. We all enjoyed our burgers tremendously. I ordered the the enchilada burger which was outstanding. The burger was juicy and flavorful. It has a green chili sauce on top. I ordered a side of tater tots, they were very crisp and yummy, did not need ketchup. My friend had a side of Mac and cheese which she couldn't wait to eat the leftovers the next day. They also have vegetarian burgers in which my friends thought were good. Our waiter was courteous and was attentive. They have a great beer selection on tap and drink specials.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TVGnWasmfrfQtC4ODUhXiQ"
  },
  "dS9f_V511jWy-9mFsQ6UaQ": {
    "date": "6/16/2013",
    "text": "I tried the Spin Class veggie burger in my new effort to eat healthier. I don't know if it was healthy or not but i do know it was the best spin class I have ever had and the best burger with meat or without that I've tried. Fantastic! I wonder if tomorrow is too soon to go back and get one. I liked that it came with a whole wheat bun as well.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "XwoXi0M66RU6Gouq-DSDHw"
  },
  "W5a-QR7Z9jRZcYySbUacew": {
    "date": "3/30/2014",
    "text": "This is a great spot to grab a drink and food while watching a game. The food was good and staff was friendly. It doesn't hurt that they're a Redskins bar so I was happy to see fellow fans there crying in their beers watching the games and hoping for a win.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TaibKwCzl77Lu3-n7bofMQ"
  },
  "FQUo1x1LyGrGWOdZ7we0ew": {
    "date": "12/27/2013",
    "text": "This was a fantastic place! The burgers were craft, with the richest ingredients and the most exotic ingredients for a burger. I truly enjoyed this meal. The double layer nachos were fantastic, doused in chili, cheese, sour cream, and pico. I got Le Trek which had steak sauce, garlic mayo, carmelized onions, and feta cheese. It truly was amazing. I would go back to this place in a heartbeat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "nOtUXubF5i0U7lNZHOOaaQ"
  },
  "-hD1JAfOUfDG_y6oVU2IuA": {
    "date": "8/23/2018",
    "text": "Noticed a sign outside that said \"$2.50 drafts\", so we came back later that day for dinner. Literally all drafts are $2.50, all day, every day! I have no idea how they make money, but I'm not complaining! You can get everything from a Juicy Jay to a Shiner for that price.   Another great thing about this place is that I've never had a wait! They have lots of seating, but even if it's busy, there's still enough. This past visit, we were even seated at a table with it's own private mini tv screen that we could have turned to any channel we asked for. Just don't go messing with the buttons like I did... oops! There are also screens all around, so this would be a great place to go watch a game!  For food, I ordered the veggie burger, and I would say it's one of the top veggie burgers in Charlotte. It actually stays together for one, and it also has good flavor and great toppings. Both the fries and the tots are excellent choices for your side. Its a good amount of food and reasonably priced.   Our service was good and we even had a manager check in on us from time to time.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "C5It4blVxOFYW-aacn4Vcg": {
    "date": "7/9/2018",
    "text": "We were on the road back to Maryland and were stopping to visit a friend on the way in Charlotte. We asked him for a restaurant suggestion and he told us about Kickstand. I like that they have a private lot in the back. The restaurant is a mixed of a dive/sports bar. They have tv screens to watch games. We were trying to get back on the road as soon as possible so we ordered to go and ate at the friend's house.  The host quickly greeted us and gives us menus. We ordered and paid at the bar. The food came out quickly and the host walked our bag over to us in the lobby. I had the Cross Country Burger and fries. It was very good. Burger was well seasoned and the toppings made the flavors pop even more. I would definitely recommend this place to anyone in the Charlotte area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "59mev9E8W9Zl94firjcgDg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Cross Country burger and fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/59mev9E8W9Zl94firjcgDg/o.jpg"
      }
    ],
    "user_id": "Zf3JtxPFxt0OyJ7TyEqPwA"
  },
  "zbVBwAwxZRfHhWQ9x9k5vw": {
    "date": "4/2/2018",
    "text": "This is the type of place that I'm glad I came but I wouldn't return. They are just mediocre to me. If Yelp did half stars, I would probably put them at a 3.5.  Me and the boo came on a slow evening so there were plenty of spots available in the gravel lot and no wait time for a table. Service was quick and the hostess and server were hospitable.   The ambience was fun for sports lovers- lots of televisions around from all angles. Some booths had small televisions on the wall next to it for direct viewing, which was cool.  Use the bathroom before you leave home ladies because the bathroom stalls are tight. I'm a little chunky but I've never had issues not fitting into bathroom stalls. It was like having to do acrobatics and breathing exercises to close and open the stall door.  They have pickle spears as their fried pickles. Yes, you heard that right PICKLE SPEARS. They were better than my entree! Very juicy and with a solid breading.   Me and the boo agreed that the burger wasn't seasoned at all. They weren't bad, but I've had better at a drive-thru. The sides were also subpar.  Overall, I wouldn't return but I can't say I hate myself for stopping by either. I've heard they are the spot for trivia, if that's your thing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HQn8Tf8dNejB1TwiyURjLg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Draft beer menu",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/HQn8Tf8dNejB1TwiyURjLg/o.jpg"
      },
      {
        "img_id": "f4SeXUkiLLSXI_mx7_iqlA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/f4SeXUkiLLSXI_mx7_iqlA/o.jpg"
      },
      {
        "img_id": "NpOvBh6Rh9QIHTXOclRCvQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/NpOvBh6Rh9QIHTXOclRCvQ/o.jpg"
      }
    ],
    "user_id": "NgBYSAf3BQUX0Mwj0Y_vjQ"
  },
  "TC8DXFD8tMaF2MMLJXEhSQ": {
    "date": "7/7/2018",
    "text": "I really like Kickstand.  Solid, well-prepared and tasty \"bar food\".  I should give it an average score, but I do really like it here.  These low-key \"joints\" sort of soothe my soul.  Great burgers (better than Bad Daddy's in my opinion).  I love the old school, dark wood bar and decor.  It's relatively quiet and they have good tv coverage for the bar.  The staff are always pleasant.  I have eaten in here by myself and feel comfortable with the environment.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "hDz-j5VghjK1a8Kx9sBrWQ": {
    "date": "5/19/2018",
    "text": "Love the atmosphere & location within walking distance if you live in Plaza Midwood.  The turkey burger came highly recommended so I went there. Sweet potato tots.  Let me say that again: Sweet. Potato. Tots.  Cozy back patio.  I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wklmU8CM7czQQBuhOC4k9A"
  },
  "iRLqFfKZq6OuauZp2S4KFg": {
    "date": "11/9/2018",
    "text": "Chill place to hang out with friends. Loved their fries- perfectly crisp on the outside but soft on the inside. They have a decent beer selection as well. Will definitely be back to test out the rest of the menu but will probably not return during Panther's game day (we happened to visit during the recent Panthers-Steelers match and superstition alone prevents us from ever watching a game here again).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHgoZTMl9UxeZzwAejNlww"
  },
  "szoRuEjWevfDzMrJNPJOjA": {
    "date": "9/29/2018",
    "text": "I can't review this place much higher because they wouldn't let us eat or drink here.  Sign said open till 12 kitchen till 11.  My friends and I got there at about 1030 with no expectation of food, but thought we'll have a drink and if appetizers were available we'd get something.    We did the responsible thing and called ahead, and were told kitchen is open and bar is open.  We arrived two or three minutes later to be told kitchen closed and they'd already made last call.    Now I can understand kitchen closed, it was 1035 if nobody had ordered food for a while that makes sense, but the bar closing an hour and a half early is ridiculous.  Especially when:  1. We were told 2 minutes before everything was open   2. There were people at the bar drinking   I get wanting to go home when it's slow, if that's the case, change the sign to say we close when ever.  Also don't tell someone one thing and do another that's just bad business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "JcvQbZWrPj3M86d7jlfuCw"
  },
  "Hy04jM_5_LMaHNnx50F0rg": {
    "date": "9/23/2018",
    "text": "No more 2.50 drafts. There are better options if paying full price for beer.  We won't be returning, I will just go across the street.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "slnkQn-6XYIa_32bos4qPQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/slnkQn-6XYIa_32bos4qPQ/o.jpg"
      },
      {
        "img_id": "OZJIFWWdwVuLwuxsGCq6xw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OZJIFWWdwVuLwuxsGCq6xw/o.jpg"
      },
      {
        "img_id": "Uu4YDccFFodYaVRfJLTTCw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Uu4YDccFFodYaVRfJLTTCw/o.jpg"
      }
    ],
    "user_id": "eN12VACxEYX7OsPRz_yzVA"
  },
  "nPjf-tDZagA5hWXt3pZtpA": {
    "date": "3/29/2018",
    "text": "It has taken me too long to come back to my earlier review.  THANK YOU Kickstand!!! Our whole trivia team is so happy that you brought back wine specials on Wednesdays!!!  As I said before, Kickstand's Wednesday night staff is always wonderful. Rich, in particular, is always so kind and patient and we so appreciate the work that him and everyone else puts in to making trivia night so fun and enjoyable. Chris has always been awesome, going above and beyond getting to know us and making the whole Kickstand experience wonderful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hETgHml_EJ17ry4r_N8A-w"
  },
  "GTVUI3gJN3Oq0y7C31dtUQ": {
    "date": "2/26/2018",
    "text": "Finally got to stop in and check it out. Plenty of parking in the back. Inside is nicely done and feels cozy, I could definitely spend a few hours hanging out here. But on to the food!  They have many burger variations that sounded great, but I went for the traditional cheeseburger with chipotle mayonnaise and fries. It was awesome good!  Cooked just right, and the fries are those crispy kind that tasted so good!  They have wings and sandwiches and even gluten free bread available.  I'll be back and I'll bring my friends!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Pc5l4uFC-SfP0DTm5TdkYQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Pc5l4uFC-SfP0DTm5TdkYQ/o.jpg"
      },
      {
        "img_id": "o_qMIoT9nXkNKfXfG4HnsA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o_qMIoT9nXkNKfXfG4HnsA/o.jpg"
      }
    ],
    "user_id": "u8HPA-jU1njsPPAI_anMgA"
  },
  "woP6f00k4OGp551gnSEZYA": {
    "date": "7/22/2018",
    "text": "As a new resident to Charlotte I must say the food scene has been VERY disappointing. Perhaps my standards are a bit too high as South Florida is a culinary heaven, with a wide variety of foods.   After an unsuccessful attempt at a local Peruvian Food Festival which was horrific, we decided to try Kickstand for some burgers. Their reviews seemed good and you can't wrong with a burger (or can you)   It's located right off the road with plenty of off road parking in the back full of potholes and uneven terrain, but at least the parking is free. It's attached to a Mexican restaurant which was pretty unusual but cool nonetheless. Thinking back we probably should have chosen the Mexican restaurant.   We were greeted promptly and accommodated with our usual booth request and that's when it all went downhill. We sat there for 10-15 minutes before our server arrived to take our drink orders. He seemed flustered and overwhelmed, actually ALL of the servers appeared flustered which was confusing as they were NOT busy. I immediately began having second thoughts and had the urge to leave, but didn't!   After receiving our drinks we placed our orders and the server was very vague with his answers regarding food inquiries. I asked him several times about a particular food item and he assured me it only came with steak and cheese. I would find out 30 minutes later that he was wrong and came with unpleasant and unwanted sauce. The burger we ordered also arrived incorrectly! At this point we threw in the towel and decided to leave. How a place this unorganized can receive such good ratings seems very suspicious, but I experienced first hand that they are far from a 4 or 5 star rating.   Also the 6$ burgers don't even come with fries which is pretty lame. We've been to many burger spots that offer 5-6$ burgers on a weekly basis and include fries, of course not here in Charlotte.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HrMv8vtW9Cpgi6O5jHcojQ"
  },
  "ZlRsUj4ACjSB-6a9RC9OUg": {
    "date": "8/19/2018",
    "text": "Great private room to have Birthday Parties ! They have a great staff and she paid great attention to us . It was a 1st Birthday Party And  it worked out perfect ! Second time I have been there for a Birthday. Great Apps, Pickle Spears, Nachos, Onion Straws! They will substitute any kind of roll you want on the burgers . Big selection of Craft Beers and Ciders, I would recommend this place anytime !",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "kzLXCY-Mr5KYPMgUIJ_mMw": {
    "date": "4/24/2017",
    "text": "The fried pickles here are spears. SPEARS! And they are delicious.   I feel like Kickstand is one of those underrated spots you sometimes forget about. I've found myself here now twice in the last two weeks and both times said to myself, why don't we come here more?  Burger-wise, I haven't had a bad one. I'm a big fan of the signature kickstand. The shroom n swiss is usually a go-to item. I always get the Greek orzo salad. The nachos are a great app to share. They are huge and smothered in a queso-like cheese. Onion tanglers app is also a large portion. My friend got a cup of the chili during our last visit. She really liked it, it has garbanzo beans in it. They also have a shells and cheese section where you can build your own and add toppings.   They have a pretty good beer selection and a lot of local options. Different drink specials throughout the week, including $2 mimosas on Sundays. A lot of TVs. Nice spot to catch a game.   Note: the bathrooms are shared with La Unica. You have to walk out of Kickstand to get them. They are located in a small hallway between the restaurants.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "ptSl1sb1V8X_9JMCyVJkiw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. The Trek burger",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ptSl1sb1V8X_9JMCyVJkiw/o.jpg"
      },
      {
        "img_id": "WEA1yunNrUBwgQGlKVNn8g",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Fried pickles",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WEA1yunNrUBwgQGlKVNn8g/o.jpg"
      },
      {
        "img_id": "eToRLYDw-wvvuPLmbpkiIA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/eToRLYDw-wvvuPLmbpkiIA/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "UkTMfa_WSN0xSrf_CSo0ew": {
    "date": "6/29/2017",
    "text": "Thoroughly mediocre. Here's another place where the menu online looks much better than the food actually is.   When you pull into the parking lot, you have to drive all over gravelly rocks. It's fun to reenact a scene from a post-apocalyptic sci-fi movie, but you might not like this as much if you've recently washed your car.   Anyway, it wasn't particularly crowded, but the service was slow. It took some time just to get water, let alone our bar drinks.   So we started with the pimento cheese fries. The fries had a weird texture kinda (I guess overly fried? kinda like bumpy), and the pimento cheese was okay. We had a small clump of chives banished to a corner, but no other chives anywhere. I will eat cheese fries forever, though, so I shamefully ate them all.   I had the Hungover Cyclist, which is a burger between two grilled cheeses. The grilled cheese part was disappointingly flat and greasy without being buttery. They didn't ask how we wanted our burgers, which really bothers me because I DESPISE a well-done burger. These were medium well, I guess, but that's like two settings higher than I like.   I did like my Bloody Mary a lot, and it was cheap. No salt on the rim, though.   So to recap, I didn't love this place and probably won't go back on purpose, but if someone else suggests it, I'm okay eating there.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "7t5eRIGuD1vicXYT0qoGtA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Hungover Cyclist burger (burger between grilled cheeses).",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/7t5eRIGuD1vicXYT0qoGtA/o.jpg"
      }
    ],
    "user_id": "TLkPHRJX9yCJhy1kQXTe5Q"
  },
  "k-nH86TNdfdFUQf54jnsNA": {
    "date": "1/8/2018",
    "text": "Great burger bar. Lots of meat (and non meat) options and ways to customize your burger.   I did the Quadricycle challenge (not on the menu), which basically has 5 different burgers in between grilled cheese sandwiches. You have 30 minutes to eat it and if you do, its free. I was only the second person in the recollection of the staff to have completed the challenge. I got to sample a variety of the offerings.  The veggie burger was on point. Zucchini, black beans, corn, all mixed in for a great texture and fried on the outside for a nice crunch. All the burgers were juicy and well-seasoned without being too salty. Condiments were all good as well, crispy bacon, creamy guacamole, melty cheese. Tuesday nights are unlimited toppings for $10. Give them a try.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "WOOhS3yC2dEjOkBCTXaLdg"
  },
  "Cn9DffPmU3ynujFOHziwaQ": {
    "date": "6/13/2018",
    "text": "I really wanted to like kickstand more than I actually did. I came here with high expectations  with them being in a great location and near some of the biggest burger competition. Started with fried pickles which were amazing and done just how I prefer them. But I ultimately came here for the burger. The meat seemed to be chewy, extremely over cooked and dry. The egg on my burger was cooked beyond over hard which and egg should never be on a burger unless upon request. Wait staff was extremely nice. Could have been just a bad night, so I'll definitely be back to try it again. Until next time kickstand.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6v7O3QGZmD17zA6o1Cipg"
  },
  "Faln78jjgykB-HRmRyAT1w": {
    "date": "3/2/2017",
    "text": "Woooooooo!!!! That burger was GREAT! I mean the flavor was just... I don't know how to describe it... All the flavors of the Fender Bender just blend. Now... I did get mine without the mushrooms. Remember? I don't like woogly shit in my mouth. Perhaps it may have elevated the burger, but I'm sure it was just as good without. I could taste everything. The saltiness of the cheese, the spices from the chili, the mild yet subtle taste of the coleslaw and the simply seasoned meat. I like that the chili had chickpeas in it. Interesting.   The sweet tots were good. I wasn't really feeling the mildly flavored maple syrup? It didn't really add to the flavor of the sweet tots for me. Just wasn't hittin it. I settled on a mixture of mayo, mustard and ketchup to dip them in.   The shells and cheese were good the first bite. But then I took a second bite thinking, \"this reminds me of something\". Third bite, \"I feel like I had this before\". Fourth bite, \"maaan this is like Velveeta box mac and cheese\" Nothing wrong with it, it just didn't stand out.   Now I would have been satisfied if I could have gotten a coke float. I didn't need it but I wanted it.   Service started out great. One of the recommendations from our person was the Fender Bender, and I appreciate it. I really do. But then service was a bit mucky.   I told him I wanted the mac and cheese to try now but will take home. He asked me before he left if he could just put it in a to go container. I said that's cool. He comes back with it in a bag with the mac in a container talking about something like I put it in the container and didn't know if you cared but it's in there anyway so \"that's what you're going to get\"... not with an attitude or anything but I thought it was weird to say that.   Anyway fast forward to eating our food. Someone else checked on us which was cool. Then the guy checked on us which was cool, but this was all like maybe after I took a couple bites of my burger. Now I don't need someone coming to the table all the time, but all of a sudden I see checks on the table as I was getting through with my meal. Sooooo... I guess no dessert? He didn't ask if we needed anything else. Perhaps I should have put in my coke float when i was ordering everything else??? No float for Tieren... --- {insert sad face}  Also, the entire time I'm drinking an Arnold Palmer. I asked for a to-go cup for my drink. Normally at other restaurants they just give me a cup with a fresh drink in it. He doesn't. No biggie. However, when he put my drink in the to go cup I asked for a top off. He pours tea in there.... I wish you could see my face now.. Yea um I had an Arnold Palmer. Now it's just mostly tea.   Whatever. He seemed pretty rushed from the beginning to the end. I feel like there was a enough balance of him recommending the great burger I had to checking up on us once to a couple of the small things that I'll put a half star loss on him. The other half star was the concept of the sweet tots being just okay.   But I would definitely go back to try another burger.  Ps. My home said the mozzarella sticks looks cuter than they taste... just some average cheese sticks.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1anXiOF804D8wguxoYyHOA",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Mozzarella Sticks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1anXiOF804D8wguxoYyHOA/o.jpg"
      },
      {
        "img_id": "gRUOgb-NKI66Up2SJ_yhYQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. The Fender and Bender",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gRUOgb-NKI66Up2SJ_yhYQ/o.jpg"
      },
      {
        "img_id": "Sklea3Q-pSc5j8bnivQ3rQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Mac and Cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Sklea3Q-pSc5j8bnivQ3rQ/o.jpg"
      }
    ],
    "user_id": "yy7shAsNWRbGg-8Y67Dzag"
  },
  "iiTAYUiSwTt7ACd1fgSEfA": {
    "date": "5/10/2018",
    "text": "Nothing crazy or over the top, but it's definitely solid bar food.  I actually would have rated them 3.5 stars, if it was an option...  Started with the pimento cheese fries... plenty of cheese, but lacking some pimento.  I had the veggie sliders; good bean-based \"burgers,\" with avocado and cheese, but the buns were trying to steal the show.  My friend had the chicken tenders, tossed in the hotter hot sauce.  The flavor was good and they stayed pretty crispy.  I believe she was a newer employee, but Shampayne provided great service to my friend and me!   She was very pleasant and attentive.  I've only been for lunch, and it was pretty quiet, so maybe the atmosphere is better/more exciting at night or on big game days..?  Either way, I feel like Kickstand has a lot of untapped potential and I want to like it more.  I would return because they have a decent menu and the service was good... but, realistically, how many other places near Central Ave also provide solid bar food and good service?  As of right now, I'm still sitting comfortably at 3.5 stars.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "fRrWUCrM1rfuFU-0T1hvyg"
  },
  "aTzyOpAfh8VCQ34vjSfluQ": {
    "date": "11/5/2017",
    "text": "This is a nice spot to stop by while in the Plaza area. This is currently the spot for GA Dawg fans so I'm here each Saturday. The staff is friendly and typically fast despite being slammed during these times. On Saturdays they offer $3 Terrapin beer which is great. They have several draft beers and also some canned. The parking lot is gravel in the back which isn't ideal but it's not terrible. You can find me here on Saturdays!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "zox0bzk1LvmLb77fmcRjUQ"
  },
  "XcEjQO_Cnf-Gxe28pgDJKQ": {
    "date": "7/10/2016",
    "text": "Friday is Cheeseburger Friday and so I headed to Kickstand and ordered a beer with their eponymous \"Kickstand Burger.\"  The beer was quick - they have 20 or 30 fresh ones on tap - and while my burger was being put together, I had a chance to look around the place. It's a sports bar with a dozen televisions and there are a couple of skill games lurking about. The patio looked comfortable, but probably not on a July day when the temp is coming up on triple digits. I sat inside.  My burger arrived, cooked to order (medium rare) and assembled as requested. The burger patty is mixed with sundried tomato and onions and garlic and then they cop it with cranberry chutney, caramelized and brie. The burger was flavorful but wow, the cheese on top was an excellent choice. Sweet and smoked, it was perfect with the meat.  Very good burger, nice place. I could see returning.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 5,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "Jf7uhYeAzVlR8BMPjoNSlw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Kickstand Burger with LTO and slaw",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Jf7uhYeAzVlR8BMPjoNSlw/o.jpg"
      },
      {
        "img_id": "9TP8KRHissr2qZz3SRH23g",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Front of Kickstand Burgers",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9TP8KRHissr2qZz3SRH23g/o.jpg"
      },
      {
        "img_id": "oie8F8zz0vmbl6Oxm_znmg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. The bar at Kickstand",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oie8F8zz0vmbl6Oxm_znmg/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "wFIW32rLYSrslyMwUecQSg": {
    "date": "7/15/2015",
    "text": "Fast service, friendly staff. We got the Kickstand Burger and The Fender Bender. Both were delicous! Also tried the burger with the guac and pico but forgot the name and it was great too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbu5VBz2Zw24et8Vt_BS1Q"
  },
  "3AGR9koqqFcwbTxQteWpXA": {
    "date": "1/4/2015",
    "text": "What a great night! My friends and I were looking for a place to watch the Panthers game yesterday but wanted good service and not to be crammed into a bar with a bunch of 21 year old people (no offense). We found it. Josh, the general manager, had a room specifically designated for Panthers fans. It was perfect. The food was great and the service was top notch! Several of the people in my group were from out of town and had wanted to see several different bars. Not after we got to Kickstand. Everyone agreed this was the place to stay and we had a blast. Nice to be in a neighborhood establishment with friendly people, no loud music, and plenty of TV's. I'll be back soon and often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFko1Z_dJC_EwXXHnoklxA"
  },
  "dd77EE651-qxsWDkp-O46Q": {
    "date": "3/16/2012",
    "text": "I'm updating this review and rating for a couple of reasons.    1) I've eaten/drank my worries away here a dozen times or so and I've never had a bad experience.  2)The food is always cooked exactly as I expect whether it's 2pm for lunch or 9.30pm for a late (Late for the US) dinner.  3)Beer knowledge.  When my wife couldn't see the tap handles from our booth she asked our server to just pick one for her, he proceeded to ask what type of beer she was in the mood for and then made an excellent selection.  4)Atmosphere.  This place has been consistently busy, with tvs every where (good when important sporting events are going on, otherwise generally distracting), and is always clean.  How good is it?  My cravings for \"Mexican\" food pop up about 4x's a day and I've never been to the restaurant attached to Kickstand because if I'm driving over there, I'm grabbin a morning ride.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "DmMFoQvKlfDoSxiEbLO7ng"
  },
  "4ont1_CHjoPXScSrCkdG6A": {
    "date": "9/25/2014",
    "text": "I live in Philadelphia but frequent Charlotte at least once a month. This bar is great! THEY HAVE THE BEST NACHOS. I went here to watch a football game and had a great day. Great food, good beer, and TVs. I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-ohiiyenkujVu00Quou7-A"
  },
  "6_17mSkC8rn3gxBITxHbqA": {
    "date": "6/7/2015",
    "text": "Ordered the Schroomin n Swiss with coleslaw. Burger was juicy and hot off the grill. I would skip the coleslaw and the tots were typical frozen tots. Great burgers with mediocre sides.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lOKYlcYfRc5_3lnijW_yZQ"
  },
  "NjhswfaszYFnZhBau03KRA": {
    "date": "10/20/2014",
    "text": "I threw my boyfriends surprise 21st bday party here. Matt and everyone I worked with at Kickstand were absolutely phenomenal. They are the nicest people. They were so willing to go above and beyond to make sure everything went smoothly. And the food was delicious! It was the perfect place to celebrate his birthday. I can't think Kickstand enough.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2Q-Nb9Y91HV3_6cbuYniWA"
  },
  "q12Q5WvLqSuznovL6yXj_w": {
    "date": "7/4/2012",
    "text": "Kickstand is a fun joint. I've been a couple times for dinner, and for an event recently. The staff is friendly and very welcoming, and all the biking decor certainly sets it apart from other QC eateries.  They have a decent enough selection of beer, nothing out of this world, but better than most. I think the same can be said of the food offerings. Their burgers are decent, though I've had a range of qualities in my visits - consistency takes time, and they are working on it. Their signature burger, dressed with brie and cranberry sauce, is a different take on things that I enjoyed. The fact that you can get sweet potato tots is a nice addition, too.  I will say, though, that the parking situation is abysmal. You can't navigate the gravel lot, once down a row you're only exit is to put it in reverse and hope no one is trying to enter, and those raised embankments make even SUVs run aground. Come on guys...  Neat place, neat area, and with a few glitches worked out, could stand to be a long-lasting spot.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yNsOssYIr3EzAoJAPBerqg"
  },
  "DEIznFXTkTSImokUxU60HA": {
    "date": "1/10/2015",
    "text": "I finally made it to this burger joint and I must say I was impressed. Cool decor, an abundance of tv's, and they also have games. I went to watch the Hornets and drink a couple beers but I ended ordering some wings as well and I must say they really impressed. I will definitely be returning to try the rest of the menu. The beer selection was solid, the wings are great, and the bartender was awesome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aihRtdsX5RXWxgKmPGG1xw"
  },
  "cDrvQoa8tzTQ35Cpg5QixQ": {
    "date": "6/18/2012",
    "text": "Kickstand Burgers & Bar is a nice place to just chill out with  your friends.  Loved the environment!  When  you first walk in through the front door and see sight of the skeeball machine, don't get distracted and forget to turn right.  The building is connecting two restaurants, and if you turn left, you'll end up going into another restaurant!  Just thought I'd put it out there.  Anyways, when I walked in, I thought the place inside looked very nice and chill.  I liked how they had an old looking bike set up in the corner of the restaurant, and there was an old tricycle set up in another part of the restaurant.  Some booths that I passed by were wicked cool, and let me tell you why.  For the booths I saw, there was a small TV in each booth!  How great if you're watching a game so you won't have to arch your neck or squint your eyes to see what's going on.  Kudos to that.  But I did not sit inside.  My group decided to sit outside since it was nice out.  The scenery there was not too shabby at all.  There were even ceiling fans out so we weren't sweating too much.  Our server was great the whole time.  Great service!  He was always checking up on us making sure we were happy and had everything that we needed.  Friendly service always helps with the atmosphere.  The food was amazeballs.  For an appetizer, we ordered the Pimento Cheese Fries and they were so delicious!  I had to make sure to check myself and not take more than my share.  Good thing it was on the other side of the table or I would've killed that plate by myself!  My friend and I decided to split an order of wings, and what a good choice we made.  The wings were delicious with the Garlic Parmesan sauce dabbled over the wings.  It wasn't an overwhelming taste at all.  Just right.  For my burger, I chose The Cuban and my friends decided to make their own burgers.  I might have to try that one day for a fun experiment.  My burger was delicious though, no complaints other than it was just so HUGE.  It's definitely worth your money to try out food here because they give you a good amount.  I was totally stuffed with amazing food in a chill environment.  Everyone who is looking for a burger joint to just eat good food and have a great time with friends needs to check this place out for sure.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hhQUVO2AqBdSeQcPo19Bsw"
  },
  "8q3sy-ZDurqrRtnGk70JiQ": {
    "date": "4/18/2015",
    "text": "Now I know why they are on every top burger list in Charlotte.  You have to try the signature burger The Kickstand.  Perfect combination of sweet and savory. I will be back to try the other specialty burgers.  The service was great as well. I would recommend reservations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qmale2-UkL1cWTPwPaDTrw"
  },
  "XNSbBHVB-NhQfUfyg0XIPw": {
    "date": "1/30/2015",
    "text": "This place is tremendous, an excellent option for a burger when stopping through this area of Charlotte. I had wanted to go here for a while before my roommate and I actually went. It was a Sunday, the night of the Golden Globes, though we were treated to 60 Minutes on our table-exclusive television. That was a nice touch. Not many people were in the restaurant, which was a good way to spend a quiet evening. The wait staff is very nice and helpful. I had a salad as a side, and it was very good. My roommate got National Bohemian beer to go with his burger, but I just got water. I had a Fender Bender, and it was positively enormous. It took a Herculean effort to finish, although not having eaten all day helped. I highly recommend going here if you get the chance. It is perhaps a little pricier than some of the other places around, like the Diamond, but when you see the portion, you understand why.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MWy9DNsVzlF5NMwiVg7rRw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Fender Bender with side salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MWy9DNsVzlF5NMwiVg7rRw/o.jpg"
      }
    ],
    "user_id": "IVWtW-bKHRFnkR_X-k-q8w"
  },
  "siEsx1HhxZmrOEbneHAuZw": {
    "date": "6/22/2012",
    "text": "The CLT CM brought me here to ease my hunger, 10pm on a weeknight. It's a bike bar -- but not those kinds of bikes. Cruisers serve as decor. Good-looking beer list, with some locals featured -- though sadly, they were out of the brew I wanted. Ended up with the Olde Meck Copper... an interesting beer.  For food, I wolfed down the namesake Kickstand Burger. With caramelized onions, brie, and a cranberry sauce. Yum! Fries are unsalted, and have a crusty texture. But you can order tots instead, and the tots are tops!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "itXMelaTleEjLIFWCJtnwg"
  },
  "DDr1QsxcezVR30GE1gc97w": {
    "date": "12/13/2011",
    "text": "What's to say? I mean another classic example of overloaded wait staff on a football Sunday afternoon.  Staff up people!  The experience started out fine but ended horribly with us waiting for nearly 15-20 minutes just to cash out.  In between the beginning and end of our stay we were bombarded with nearly warm beer and ghost like service.  Oh well, I had high hopes and I'll probably give it another shot in time when the place isn't as crowded.    PS.  If you are a Redskins fan, this is your place!  They have a whole room dedicted to you.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "UpMTavH33xUmrQClx3Ckcw": {
    "date": "9/3/2015",
    "text": "Although they advertise they have gluten free options, last 2 times I have been here,  \"they ran out yesterday. \"",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_wfvcApI0ZVKZkzZK3MkHg"
  },
  "MYJ7YhiyZssOLub6senRNA": {
    "date": "6/8/2015",
    "text": "Food was awesome. That was the only good thing. Service was horrible. Ordered wings, never came, he said he forgot to put them in. The manager came over with a gift card to cover wings for our next visit. But then, brought food... No utensils. Drinks took 5-7 minutes to receive any refills or new beers. He would come around every 20 min and not even make eye contact. We had to put our and in the air for service. Sat with an empty beer for ages. I wanted to get something to go but decided against it for the sake of making it home tonight. Won't be back anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FpdhwmG9PR8GhQBxZfd3tQ"
  },
  "YPz0TnZLrqQ-jH9Vadz5cg": {
    "date": "6/24/2014",
    "text": "Ordered 12 chicken wings and fries  for pick up.  Upon arriving at home, there were only 8 wings.  Called in and server was apologetic for placing wrong order.  Manager offered to make another 4 wings and for us to drive back to pick it up again, duuuuuh... Why would I drive all the way back for 4 wings???  I requested delivery or credit for next purchase.    Although food was good, especially the fries, the manager was rude, unprofessional and confrontational.  When asking how he can compensate, I said he need to start by changing his tone when speaking to customer.  We all have bad day once in a while, but know your place when working in customer facing business.  Manager said he would credit back in 48 hours.  I would rate food as a 4, customer service however is poor at best.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6lbu7P9Lg5rTVRYTAsvOhA"
  },
  "0fW_mq-Tc3C6eHHnMos5tw": {
    "date": "2/25/2015",
    "text": "If you are in the Plaza-Midwood area and are craving a burger or chicken sandwich, then this is the spot! I have been here three times over the past few months and I have never been close to disappointed. The burgers are wonderfully delicious and the options are endless. I have also had the buffalo chicken sandwich which I would recommend. We ordered the friend onions as an appetizer and the portion was HUGE! They also have a great beer selection. Finally, you must try the fried pickles!!! They are divine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9x3RVQoYnJhHCRZZ_jShBA"
  },
  "UWVFuK-Y0YeJUX-i-kB1mw": {
    "date": "2/16/2015",
    "text": "A great place for a night out.  Didn't get a chance to try a burger, but I did try some of their buffalo wings and chicken wings.  Well worth it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jGN8VNaknpZsF79FxUV8Yw"
  },
  "8LOofd999ZwAcIi3f8SAFg": {
    "date": "7/26/2015",
    "text": "The chipotle wings are great And I had them delivered right to my door with Postmates still hot and fresh when arrived I will be going there very soon to check out the bar and burgers and more wings of course  try Postmates if in Charlotte here is a free delivery code for a your first try rechellej",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OPapT10TTX59sX2q5EzIeg"
  },
  "LDVzhUrUiOR7xmS8BLfF2Q": {
    "date": "11/30/2014",
    "text": "Best gluten free burger buns in town! Staff is so friendly and attentive. The burgers are so good that I haven't even tried any of the other menu items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z5HRS-VBAyurfuaR4H6RhA"
  },
  "afnQsAf1xnEj7ULawxTGNA": {
    "date": "8/22/2016",
    "text": "Great! And quick service! They have specialty burgers and BYO! Had the Fender Bender and a BYO both were great and cooked just how we liked them (one medium and one med well). Mimosas on Sunday here are only $2 and almost a full wine glass. Your welcome :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g1XbHNERg8seLrsrGq-Tfw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/g1XbHNERg8seLrsrGq-Tfw/o.jpg"
      }
    ],
    "user_id": "mKbWdlAj553VtG7ZACycfg"
  },
  "P6tzJ5qcVmww9cw710KKCw": {
    "date": "9/29/2016",
    "text": "I don't give high reviews very often, but I really enjoy the food, service and atmosphere of this resturant. I've always been greeted promptly and the wait staff are friendly and helpful. The food is consistently good (I recommend the tenders rolled in teriyaki, half the price of similar resturants) and extremely well priced. Perhaps what I like most is the unassuming, relaxed atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efyBnYOWL-NeUkiKCJgu2Q"
  },
  "Z10f8W3IqqgYJwEr0e0fgQ": {
    "date": "9/12/2017",
    "text": "My fiance and I absolutely love this place. Burgers are some of the best in Charlotte. Do yourself a favor and try a different one every time. Ample parking and seating so no driving around in Plaza Midwood for ten minutes trying to park and then having to wait for a table. The service is always great as well as the beer selection. Craft beer from throughout NC. Also get the sweet potato tots. You're welcome.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wncNELOqe7wcbYPOGh1M4Q"
  },
  "NBE-9uHm39lQqyCIM6OdUw": {
    "date": "2/9/2015",
    "text": "Love this place! We've actually only eaten inside the restaurant once, and have ordered take out several times.  Something I've learned over the years: if a restaurant can serve amazing take-out, they're worth going back to!  The wings here are pretty solid, and my husband swears by the sweet potato tots with maple syrup dipping sauce.  I've ordered several different combo burgers here, as well as a few original 'make your own', and they were all solid!! Not too greasy, great quality of meat, perfect preparation, and top notch ingredients.  If you're in the mood for good burgers + fries food that will please everyone, this is the place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UzCgd62svU_tmtawMqQTQw"
  },
  "DrTeFqQnCOgYrjOksZmTMQ": {
    "date": "1/29/2012",
    "text": "For the last sixteen weeks, I've enjoyed the food and the service at The Kickstand.  They so graciously hosted our Redskins fan group every Sunday during the season and as the it turned out, finding this place was the best part of the football season.    There's more tv's in this place than one can imagine including booth tv's near the bar.  The bar is awesome too.  For a trendy restaurant in Plaza Midwood, the beer is cold and cheap - a huge plus and a rare find.    For a burger place, you might not expect the wings to be a main attraction however the Spicy Tiger wings are clearly off the hook and fried pickle fans: by far the best in town.  Most places fried pickles are the dill chips while these guys fry up the spears for more pickle-y goodness.    The burger menu is something put together by a mad-burger-scientist.  The Hangover is two grilled cheese sandwiches with a tomato and a burger in between.  Not just a cheese burger with toast but 2 grilled cheese sandwiches!  That's insanity...and so good.  They have everything you can imagine and you can tell it's all fresh.    Salads are pretty good too.  They use real lettuce (not the iceberg junk) and fresh vegetables - not something else you'd find at a burger joint.  Usually the salad is a complete after thought and the last thing you'd order.    Overall, this place rocks!  Service is great. Food is great! What more can you ask for?",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "z8zhmm7JLmjsqY_pFlqTKw",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/z8zhmm7JLmjsqY_pFlqTKw/o.jpg"
      },
      {
        "img_id": "OiWKXzxtHI6EsUOyA2pFkg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. The Redskins Room",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OiWKXzxtHI6EsUOyA2pFkg/o.jpg"
      },
      {
        "img_id": "ZUJ2AwOt6iqo_91kOJDSBg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. That&amp;#39;s a burger between two grilled cheese sandwiches",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZUJ2AwOt6iqo_91kOJDSBg/o.jpg"
      }
    ],
    "user_id": "bdlFwefJOfC8xBiezIF4AQ"
  },
  "GCzkAM-my8m_dIpCC3hWrA": {
    "date": "4/27/2016",
    "text": "Me and my wife have been here numerous times and it's always pretty good food with solid service. If you're in the mood for a burger with a lot of different options to choose from this place should be on the top of your list.  Nothing complicated here, it's a burger joint and they do it right!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "0ATxQUXBr5y_hXBMFn9kNA": {
    "date": "8/29/2017",
    "text": "Burgers are ultra dope. Service was bad, once. Every other time has been great. $10 build your burger with $3.50 drafts on Tuesdays. Why is this place empty? Can y'all come back here so I can keep having cheap beer and burgers?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wPCJSZwxWiYy9SZG2UBKw"
  },
  "C5WariPy1OGYyZZDE05bXA": {
    "date": "3/16/2012",
    "text": "After watching an episode of How I Met Your Mother about searching for the perfect burger, my friends and I suddenly had a mad hankering for a burger.  We headed down to Kickstand tonight in order to sate our cravings.  This is not my first trip here, but I've yet to review this place.  I simply love this place; they have some tasty burgers and appetizers.  Let me tell you about some of the great things here.  On our first night here, we ordered the nachos as an appetizer.  Imagine a gigantic platter, completely filled with chips, and piled high with cheese, jalapenos, chili, beans, and the usual nacho condiments.  Truly, two people could eat this as a meal, and probably four people could eat this an an appetizer.  The chili on it is not too hot and not too sweet, with a solid flavor.  We love these things, and have ordered them more than once now.  The first burger we tried was the Fender Bender, with chili, fried onions, mushrooms, and even bacon.  It was good, but more of a knife-and-fork kind of burger.  We had their tater tots, which are pretty tasty as well.  We had tried Le Trek burger (grilled onions, blue cheese, steak sauce & chipotle mayo) with bacon added - which is definitely their best burger.  My partner has also had the Kickstand burger, which was a little disappointing (the cranberry chutney and brie are just weird on a burger).  You can also build your own burger, as well as choose from veggie and turkey burgers, other sandwiches, plus hotdogs.  I am told the vegetarian burger is awesome with beef instead of the veggie patty itself.  Their sweet potato tater tots are ok too.  Not to mention they have some decent beer specials, including $1 PBRs every night.  Service has been pretty good each time we've been here, and each time it's been on a busy weekend night.  My biggest complaint is that the parking situation is a pain.  There are no lines in the parking lot, and people just park wherever, making it difficult to navigate the lot.    This is a decent place to grab a burger and a beer while watching a game.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cZeMCY6vrQkFOgcmIbKspw"
  },
  "5jts9fwThOmS21BfTZ0Mpg": {
    "date": "9/8/2014",
    "text": "Great food and service every time I've visited.  Their burgers, flatbread pizzas, onion tanglers, and chili are my favorites.  Their bar selection could use some improvement, I've ordered fairly standard drinks, and on several occasions have been told they don't have the right ingredients.  They have a lot of TVs often showing sports, but they keep the volume low, and I've never been in there with a hooting and hollering vibe going on.  That may just be because of the days and times I've gone.  Once, I was in there when they were doing a trivia contest where the host was set up close to our table with an overpoweringly loud speaker.  We left pretty much immediately.  Other than that, a good dining experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXdSj9b93Qg5nUKgcAd7XA"
  },
  "wyV0EY3PXWKObI3j_whMEg": {
    "date": "8/14/2017",
    "text": "Had the blue cheese burger salad. It was wonderful. Everyone aft our table loved their meal. Had some special needs on one plate and our server made sure it was perfect. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_aAlfachfrwFP66th7-muA"
  },
  "Gllf3SbyWDTTQ01NVpuWsA": {
    "date": "5/23/2016",
    "text": "We come here every Monday for $3 Charlotte beer and the burgers are the best in town! Sean/Shawn and Kenny are the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZtQotd5ycsW-NpeOnjcm_Q"
  },
  "Kx2nOAHkgZcRzYug_jOKcw": {
    "date": "2/12/2016",
    "text": "I kept hearing about the great burgers here and I finally decided to see for myself. So glad I did!   Started with pimento cheese fries, which were amazing. They came with a couple of jalapeno slices, which added a nice kick but I wish there had been a few more slices. The cheese was amazing and perfectly melted, and the ranch dressing was perfect.   The booty burger was delicious. I ordered mine with a beef patty rather than turkey. It was perfectly cooked (medium) and the only problem was I'd filled up on cheese fries so I couldn't eat it all!  The shells and cheese was good, not great. A little too rich but without real cheese flavor. I had Gorgonzola mixed in, which helped. I ate a couple of bites and put the rest in a to-go box. Still good enough that I will eat it later!  Ambience was great. Casual, great place to hang out and have a beer. Service was really good. I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kx246DR4k9ZvqcDq5nuKWg"
  },
  "paYQlx5xxvoh3I6WdM7Ruw": {
    "date": "11/22/2014",
    "text": "Big fan of build your own burger.  I feel this place gets lost in the shuffle of the Plaza Midwood area. It really shouldn't because their food and beer selection is really good.   Like I opened with their build your own burger section is my favorite part of the menu. I'm constantly on and off a strict diet and that part of the menu caters to my needs. And when I'm off my diet the sweet tots are a must.  They always have a couple dozen craft beers on tap. Mostly local. Yay!  My girlfriend and I go about every Sunday and just about every time we are there the manager stops by to check on us. Which is a very nice personal touch that keeps us coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "690lClPHEn8UaSy0S0HWPg"
  },
  "ILWuFcxZBDdHhvmAnnEUVw": {
    "date": "10/11/2013",
    "text": "\"The Running Machine\"... (which i always want to call \"the running man\", because why not?) ... is perfect. Not all that big a fan of turkey burgers normally but this one is so good that 9 times out of 10, I'll get it instead of something else.   I love Kickstand in general. Great staff, great beers, great atmosphere- super willing to work with you when you want to bring in a group (I think I actually come here more for group events than dates with my husband).   This is one of Charlotte's best places to be.   Our waiter went and won a stuffed frog from a carnival machine out in the front and gave it to my daughter just because. That's beyond good service.   Excellent food, excellent people.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "7hbYRZQbpJOd16oGTn_nGA"
  },
  "UhtSc-5IIkQAAl0bFhdZfg": {
    "date": "2/25/2012",
    "text": "My hubby and I had to try Kickstand after passing them numerous times on Central Ave. We are big fans of burgers and wanted to see if they should be added to our list of favorite burger joints.   Kickstand has a neat name and a really cool atmosphere. The music also rocks - they were playing classic rock the night we were there. The service is also very attentive. But the big downer for me was that the food was just ok.    I'm disappointed that I cannot get a medium rare burger in NC. So, I cannot really hold that against Kickstand. But, I was given a choice of how my burger was prepared (medium), and it was pretty much overcooked and not juicy in the least. I also love mac 'n cheese and was excited that this was a side option with my burger, but I just didn't like their version.  I might give them another try, but probably not. The addition of Bad Daddy's to Birkdale will make them my primary go-to place for burgers. Sorry, Kickstand!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "yL4whR1Qb63FptG9IVRdVQ"
  },
  "W682N7v6HqR6ke2PWwdCSA": {
    "date": "7/9/2016",
    "text": "Good burgers. Live the tangled fries and tarot tots. Great service and atmosphere. Fun and a large beer selection. Good Saturday lunch stop!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ynphrmZzAifb58amPgNIg"
  },
  "nMLETcq1BjOvXzyJMR8ayA": {
    "date": "9/7/2014",
    "text": "These guys need to get their Sunday gameday act together. They used to be such a great bar that showed EVERY game. Not anymore. It's always been our go-to on Sunday's because we could watch every team there. The majority of the TV's now have Redskins on. There's a separate Redskins room for those diehard fans. And their game is on full sound. The rest of us would like to see our games on in the bar area too. In the past, a different game was on EVERY TV. I wont be coming back if this is how they show their so called diversity for everyone's team. The manager didn't have a clue as to how to set up the TV's BEFORE 1:00 when the games started. It was after 1:00 & he still didn't know what was going on or how organized & fair it had been every other season. There used to be post-it's labeled for each game on each TV. This guy had the Skins on 7 out of the 10 bar TV's. I realize it's supposed to be a Skins bar, but come on, you have to also show all the other games too.  For a sports bar, we're very disappointed this season & might have to find a new place that will fairly show all games.   The AC must not have been working because it was literally about 90 degrees inside. Everyone was complaining. There were not enough servers & bartenders to handle the packed crowd, which ended up being standing room only around 1:00. In the 3 hours we were there, a server came around 3 times. That's unacceptable. I waited almost an hour for her to get me another drink & then she didn't even stop by to check on us. We had to walk up to the bar & get our own drinks. I'm hoping this is just first game day of the season jitters & they will get it together for the rest of the season. We typically really love this place, so this was all highly unusual.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c42srUzZjM7ONO9I32D-Jg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c42srUzZjM7ONO9I32D-Jg/o.jpg"
      }
    ],
    "user_id": "KMokoIg-963M8ihKnglgmg"
  },
  "O26TRxNdiUdYfoS4UZIADQ": {
    "date": "5/7/2015",
    "text": "Best burger in Charlotte, hands down.  Awesomeness, for sure.  The salads are also pretty fresh, green and amazing.  Staff is pretty great, however some of the newer wait staff have a bit of a 'tude.  Nonetheless, it's my favorite spot in my plaza midwood hood.   Oh, and there's beer.  Local stuff.  Good stuff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ti5vTjgFx9FF_hvCuCEKNw"
  },
  "3a3EF0Bv6X0n0i42GeQizg": {
    "date": "4/17/2014",
    "text": "Recently kickstand has become our hotspot on wednesday for pub trivia. This place is awesome. If you are coming for trivia, I would try to arrive no later than 745. This gives you time to get situated and order your food/drinks. Our server is awesome.  We have had the same now for two weeks.  Hopefully she sticks with us (good luck charm).    I would bring a big group of friends and just have a relaxing Wednesday.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A_lR_ibGJtp8WwBzZrX6vQ"
  },
  "uFw0FK3MtadqJ7SMojdhwA": {
    "date": "12/9/2015",
    "text": "Best veggie burger in Charlotte - hands. down.  I hear the other burgers are great as well from my meat-eating friends.  The atmosphere is cozy, the servers are always friendly and the food as consistently yummy every time we eat here.  Try it for yourself - you won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XPlJeS2OJ2198VuVdkk73A"
  },
  "I1q5sBU2XpjdDPrmTJgcDQ": {
    "date": "2/7/2017",
    "text": "Kickstand Burgers and Bar offers one of THE best tasting veggie burgers in Charlotte. It tastes of fresh black beans and seasoning, plus whatever they put on the burger is delicious too. I eat here quite often as I work right next door and cannot get over the black bean burger. They are a little pricey but completely worth the price if you ask me.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3f4HXE5rHkLZRHQ8bgy3g"
  },
  "PqawcDUd1sTrOu0LLPZIPA": {
    "date": "2/25/2015",
    "text": "I heard such great things about kickstand and was really excited to go here, but was extremely let down when I came for trivia. The restaurant was about half full, my friend and I ordered wine, the bottle came but it took another 20 minutes to get glasses to drink it. We only got glasses because my friend went up to the bar (apparently they were out of wine glasses).    When we finally were able to order food they delivered it to the wrong table. My other friend ordered a beer and never received it. Our waiter came and delivered the check before mentioning or bringing his beer.   Huge let down....I'll head back to pint central for trivia night.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "9xIcp00kmTRHQtHZNll6xg"
  },
  "lHENwPTBTCs3ZLMNMwlwLQ": {
    "date": "9/18/2016",
    "text": "Came here for the first time on game day because we were craving wings. Kickstand did not disappoint! We arrived around half time and the service was good for how crowded it was. The wings were delicious and there were plenty of TV's to watch the game!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vS_mVPju9reeXQEvxhSQSw"
  },
  "yQDPpE63iD_tOumuSo_1kw": {
    "date": "6/23/2015",
    "text": "Kickstand is one of Charlotte's burger joints and their signature burger is an amazing triumph is burger creation. The Kickstand Burger has sundried tomato, basil, garlic, cranberry chutney, carmelized onions, and baked brie. Somewhere between the sun-dried tomato and the baked brie your eyes start fluttering as you enter burger nirvana and the cranberry chutney makes this one of the Best Burgers in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vJvaeogZj9AZYM3l_qFilQ",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vJvaeogZj9AZYM3l_qFilQ/o.jpg"
      }
    ],
    "user_id": "pS03ZJBfVmjFOEDweTViOw"
  },
  "8KfAQM4dHK1-jFsTQ_u8lw": {
    "date": "11/1/2017",
    "text": "Not a good experience at all.  My first, last, and only trip to Kickstand Burgers & Bar was a few weeks ago on a Saturday afternoon.  The experience was not good at all.  First, even though the location was sparsely populated it took quite a few minutes to be seated.  Apparently their focus is much more on the bar than the food (more on this later).  As there was no hurry to seat you if you were not sitting at the bar.  Further, the location was extremely loud for a Saturday afternoon as all the televisions were turned up like they were trying to capture the attention of the late night club crowd.  Anyway...the food was less than impressive.  I am a tomato sauce, cheese, and meat guy by nature so I love pizza and burgers.  From the menu here I ordered several items:  Fried Mozzarella The Hungover Cyclist (with fries) The Roni (with tater tots)  The fried mozzarella was awful.  It tasted like some frozen Farm Rich cheese sticks from the Walmart freezer section that still had freezer burn.  The marinara dipping sauce wasn't any better as it was nothing more than watery vinegar.  The Hungover Cyclist was just as awful as the fried mozzarella.  The grilled cheese sandwich was NOT a grilled cheese but rather a TOASTED CHEESE.  The bread was dry and hard and had clearly not been cooked in a pan.  You could also clearly tell that there was no butter on the bread and they did the most underwhelming thing possible...made a grilled cheese with just American cheese.  That being said...when you got to the burger...you had basically a large McDonald's burger with no seasoning to the meat.  Not good.  Finally...The Roni was the burger of the week.  This was supposed to be a \"beer can\" burger..filled with tomato sauce and mozzarella cheese (the delight of a tomato sauce, cheese, and meat guy).  Perhaps I disappointed readers earlier by revealing the fate of this visit but The Roni was another in the long line of failures here.  I am not sure which \"beer can\" they used but I would assume it was more a Red Bull Can as the burger was tiny.  Once again, the flavor was lacking (most likely due to the tiny burger and the inability to actual stuff anything into the \"Red Bull Can\" burger).  Simply put...one would come out better driving to Troutman, NC or Salisbury, NC and going to the nearest Sheetz and getting The Big Mozz burger.  Not only would you get a much larger and better burger at a better price...but the burger would have 3 fried cheese sticks on top of it that are FRESH and not from the Walmart freezer with freezer burn still on them.  In closing, the fries and tater tots were nothing special.  Again, these clearly came out of a pre-prepared pre-packaged collection of freezer items.  They tasted like...and were about as fresh as Gorton's fish sticks.     Save your time and your money.  If you want a bar atmosphere there are much better places.  If you want a good burger at a great price...go to Chubz Famous Chiliburgers (Woodlawn & I77).  If you want a varied menu and something similar to The Roni (only much better and more cost effective)...go to Sheetz.  Yeah...I said it...gas station food dwarfs anything on the Kickstand Burger menu.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ub6-uZpdkX08Yl-5CtGY-g"
  },
  "BwU0NNJ5WYIVFmdIDgby0g": {
    "date": "10/31/2017",
    "text": "Food and service are good. Great staff. Restrooms however are consistently dirty- from the floors to the ceilings and walls- and everything in between.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-dpiHeiIOyl2iWOex-yAmw"
  },
  "fs-o-u0247g8vxDUzn-2yA": {
    "date": "12/23/2015",
    "text": "We sat at the bar and the bartender was very attentive, great bar food with some healthier options, and a nice selection of beers both local and seasonal.   They also participate in Service Industry Night on Mondays and give a discount!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_vek7lZhmMCPat_gaIk0QA"
  },
  "tiAxRcCy4v8DVfsFxG_fUw": {
    "date": "4/22/2016",
    "text": "Went back. Again, 5 star. The salad with a burger on top was on-point. The kids were super happy and my wife's salad was also really good. Service was tight and the overall experience was excellent. Keep up the good work Kickstand!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EG8ub3qfHJGjjYA-gJHxng"
  },
  "SEVM_nsKBSICGUYa0aUdrg": {
    "date": "8/7/2012",
    "text": "Painter Smurf and I dropped in for dessert since they have updated the menu since the Redskins season last year. The BROWNIE A LA MODE is the best, a very soft, moist, warm gooey brownie, served with vanilla ice cream swizzled with chocolate syrup. It is worth every penny. I've even been just for the brownie alone.  The fried pickles are good as well, since they are cut in spears and breaded with a seasoned bread, great starter to any meal.  The spicy tiger wings are the best, with a sweet and hot flavor. #HTTR and Painter Smurf's home bar when he's in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sG1XP-XAS-kBwaIMOhazzg",
        "caption": "Photo of Kickstand Burgers &amp; Bar - Charlotte, NC, United States. Painter and Jokey Smurf are really enjoying the new dessert item from the Kickstand.... ummmmm CHOCOLATE!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sG1XP-XAS-kBwaIMOhazzg/o.jpg"
      }
    ],
    "user_id": "ffCSliq0_7KbqPFGezcW9A"
  },
  "ESvOpzSIXwBOV4LRzHenJw": {
    "date": "8/21/2016",
    "text": "My beer was served warm (and not in a cool, on-purpose way), and the burger was just okay. Fries were room temperature, limp, and soggy. Bill was $20 (with tip) for a burger, fries, and one beer--pretty steep, especially considering the quality. Our server was nice enough.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Op00-3BG3sNPkB564kXQg"
  },
  "sHR7COV5oirwNG8Bk0I0hw": {
    "date": "1/29/2015",
    "text": "All I can say is Mmmm...mmmm...GOOD!  Never disappointed with a burger from this joint!  I always create something different.  Cooked fresh to order.    Looking for a substantial burger with no fuss....this is your place.    Try their Orzo Pasta Salad too....its delish!  Great drink specials. ... cool bar atmosphere.... lots of TVs.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_Q6VOqWQDE_ktlHC-LZNw"
  },
  "55-xMmddeDBcSpp-W_SxEQ": {
    "date": "9/7/2016",
    "text": "I come here every Wednesday and they have the best burgers I've ever had.  Not only do they have amazing food but they're wait staff and management are the best in the business.  We come for trivia and the manager is super friendly and always fills in when they are short staffed. My favorite burger joint in CLT!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9PwGdXcPzMJ9g7COTGxGjA"
  },
  "a88jDcSUjVQMFXhl58nEdA": {
    "date": "11/23/2016",
    "text": "I can't say enough great things about this place! I was looking for a last minute casual location with a room for birthday party.  Chris, the manager and Carrie, our server could not have been more helpful, accommodating, and gracious in helping us pull off the BD surprise! And then we got to eat!!! With a large group, we ordered many different things off the menu and each thing was better than the next.  The burgers especially, were truly \"crafted\" and just delicious.  Will definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XctpX494TDiEGnVIvTeJvg"
  },
  "e8FMOpHQc_r8DYKiKhuDmA": {
    "date": "6/27/2015",
    "text": "Was craving a burger for Father's Day lunch so I yelped best burger places in Charlotte,  and this placed showed up near the top of the list.  Let me just say that after my meal I can think of at least 4-5 places in Charlotte where I've had a better burger recently.  IMO this place is not in the running.  The visit started with inattentive service- just because you are a casual place doesn't mean the service should be sloppy- Good service is good service regardless of the atmosphere.  Forgetting items,  not checking in,  lack of personality are the hallmark of a place with poor FOH management.    Secondly the menu has s selection of what I would call burgers with dubious combinations of flavors-  a turkey burger with avocado and pimento cheese?  C'mon...  Finally we ordered the fried mozzarella app-  we were served pre-made mozz sticks and canned sauce.  If your chef is so lazy that he won't cut and bread mozz and put together a simple fresh marinara,  well good luck to that establishment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "loIkDCPNPhNXflWinZ5RDg"
  },
  "mBUmPiZb8zw0kB_thB156w": {
    "date": "3/28/2012",
    "text": "Planned and hosted many an event here. Must say that this is our go-to spot in Plaza. You really can't go wrong with $1 PBR every night of the week. (Hipsters UNITE!)  The staff has always been so kind and willing to get to know us as regulars. Derek, Justin, Telley, Jenny, Sunny and Jessica are always smiling and busting to make sure everything is running shipshape.   My wife and I had our rehearsal dinner here and Bryson did an amazing job serving our group of close to 50 people. One server, one room. He conquered it.   I've had my last two birthday parties here. Flawless as well. The private dining room is awesome. You can shut the doors and make it more intimate for your group. Great option.   Been to many a catered event here as well. They have a great system down.   The Food: You can't really find a burger on the menu that you won't like. (I recommend the cuban, running machine or the pocket press) Recently tried the sliders and they are rockin'.   Wings are awesome. Head over on Wednesdays for $.50 wings. Great flavors. Especially crazy about Barbalo (Buffalo/BBQ)  Definitely one of our staples in the QC. Can't believe I'm just now writing this review.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 3
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "cuQ1HzMRbk_mVc1WF9KfiQ": {
    "date": "8/3/2016",
    "text": "Had a horrible experience at this establishment.  All of orders were incorrect and it took us along time for our orders to be taken. The waiter was not very suggestive. The best part of our visit was the hostess. She was very attentive and took of us when we needed something. I only suggest this place if you wanna sit at the bar for a drink and food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "phtpA48QMXl18wjqaYNc4w"
  },
  "zMupPQYOuz3t-qrnjtkA9Q": {
    "date": "8/2/2016",
    "text": "Visited Kickstand a couple weeks ago when we were in Charlotte for the day. We were in for lunch during the week. There was a good crowd but the service was prompt and our server, Mallory, was very friendly. The food was great really fresh and tasty. We started with the house made potato chips with chipotle ranch. It was a huge portion and they were delicious. I wish I had some right now. Overall, I would definitely visit again the next time I am in Charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zKjeSVBjqarsx29XFevZFQ"
  },
  "pNavnl55Ck4BsO9NN7PSmw": {
    "date": "10/16/2016",
    "text": "Some friends and I ended up at kickstand on a friday evening mostly out of convenience because the wait for a table was 45+ every where else in the area. At kickstand 7 of us were seated immediately.   Good unique menu with lots of options for burger toppings and sides. Portion sizes are good, prices reasonable. Really good sweet potato tots. Burger was very good, but not the best in the area. Beer menu was pretty large but they were out of at 2-3 things on tap. Good place to park, which is great considering the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnmQL-qJuYxCDtIHanOcbA"
  },
  "lSBOMJya5WBLjDYlujxD0w": {
    "date": "10/11/2016",
    "text": "Having lunch with my oldest son. Great food and great service. Have a great day and be safe my friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qtp92tsaZBSAKzhWcqZztA"
  },
  "GR8LEFIKEvfyeDycRLLtIA": {
    "date": "8/28/2016",
    "text": "Wow is all I can say about the burgers. This is a great place to get some grub and brews while hanging out with friends.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GwkmJkpI0eq03f7-D3NLag"
  },
  "x2XUGqyk_8rkfee-8ExGaQ": {
    "date": "8/4/2011",
    "text": "Had a lovely dinner at Kickstand on Tuesday.  Not too busy that night and the service was splended.  Hambugers yummy especially the veggie Trek with the infused steak sauce is ridiculous stupid. Enjoyed the beer special and the comfortable seating.  Not a sport night, but looks like a splended place to watch the big game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3hAl3dhwJlXqoZGmTwJY0w"
  },
  "J_WXMJHU43t9aHwb7MrCLA": {
    "date": "10/5/2010",
    "text": "My husband and I were very excited when the manager at Locolime told us about the new concept going in next door.  Locolime is one of our favorite places to eat and we go there probably once a week, we are also huge fans of Hawthorne's Pizza - so we were excited that the owners had a new concept with great drink specials.  My friends and I decided to give this place a try Friday night.  Unfortunately, that was a bad choice.  My food, the hung-over cyclist, was good but our experience will not make me return.  First, it started when our server gave us the drink specials, after everyone at our table ordered the special she came back and told us they were out of the special.  Then, we ordered the draft special, 3 out of the 4 beers were flat.  Not a great start but still we understood the place is new and has kinks to work out.  Next we order our food, my friend who has been a vegetarian her entire life (30 years) decided to get the original veggie burger with a salad and the dressing on the side (which we were informed is how all their salads come).  I guess that isn't the case though, the salad came and had the dressing already on it.  Then, the rest of our food comes and my friend takes a bite of her burger and she has a beef burger.  Okay, so the kitchen makes a huge mistake (shouldn't you have flags for veggie burgers so your servers know the difference?) but what made the entire situation worse was how the managers handled it.  First, they said \"oh we will bring you out a new burger right away - the guy over there got your veggie burger and you got his sorry about that.\"  (I don't know how many vegetarians you know who would be okay with eating meat but I was very upset and it wasn't even me - my friend was in tears).  Next, the other manager comes over and says I am sorry, I used to be a vegetarian (key words USED TO) so I know how that is, we just opened and are still trying to get things worked out so we messed up.  But so you know for future reference the veggie burger comes with a wheat bun.  (really?!  You are now blaming the customer for your mistake).  Then, our server comes over and says \"I am so sorry I used to be a pescetarian so I know how you feel.\"  (Again, key words USED TO).  All in all, the experience was not a pleasant one for anyone at the table and the only thing that was done was an apology and I will take your burger off.  If I were the manager I would have handled the situation completely different - it would have been one thing if I had ordered the hung-over cyclist and then was given the veggie burger or the pocket press but when you give someone who has never had meat in their life a beef burger and just say sorry I will take care of that - it doesn't cut it especially if you just opened.  Sadly, for this place I will not be going back and all of my friends who I had told about the place before we went now will not even be trying this place.",
    "rating": 1,
    "rated": {
      "funny": 6,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "234_RyGSiPQbw61w5Ga5Aw"
  }
}