{
  "gZiepddNJxQr1qg4ZffNBA": {
    "date": "7/6/2016",
    "text": "Three Strikes...You're Out!!  Have been here a few times since the place changed names.   Hostess never asks if \"hi-top\" table is ok or if we'd rather have regular table.  Not a big problem...but when you ask for 2-3 beers on different visits and the place is out...strike 3!!! Then...wife asked for strawberry daiquiri and was told they couldn't make them.   Onto the food.....got a philly cheesesteak. Had to physically open the bun to see what was inside.  Talk about skimping on ingredients.   The fries come in a cool little \"fryer\" type basket. About 4\"x 4\". Inside this basket held about 8 waffle fries.  Again...skimping on portions.  This pretty much describes our last (and \"last\") visit here. For locals...I would say, stick to Hickory Tavern or Christopher's in Mathews.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "st7RIqRKhIhdpKb2KmnjQA"
  },
  "Vk64jhrZgBrk8CsFULBLVg": {
    "date": "3/23/2018",
    "text": "Better than your average chain restaurant. Friendly staff, great food & drinks! Fun music and events on weekends and holidays. Good for families during lunch or dinner as well as your local watering hole later in the night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QoHvBOz1efU7UlUwdP7bmg"
  },
  "2ahO5EqssbUm6VyYXrN-Jw": {
    "date": "1/3/2016",
    "text": "Tonight was our first, and likely last visit. We (4 of us) arrived at 7pm, towards the tail end of the Panthers game. The place was crowded, but most people appeared too be done eating and getting ready to leave.   Things started out fine, we were greeted and seated quickly... But it went downhill from there. We placed our appetizer order and then 10 minutes later ordered our entrees. It was over 30 minutes before we got our appetizer. The waitress apologized and said the kitchen was crazy. At this point there were exactly 3 tables in the section of the restaurant we were in, so how\"crazy\" could the kitchen be. Less than 5 minutes later, while we were still eating our appetizer, 2 of the 4 entrees were served. 5 minutes later the 3rd was served.... 3 minutes after that HALF of the 4th entree was served, it took a few more minutes for the missing fries to be served. Unacceptable.   The food was actually decent... Minus an overcooked burger that is. The pulled pork sliders were tasty. The loaded tater tots were good too, but alas not good enough to make up for the lousy service. Our waitress was fine, a little frazzled, but the problem was more with the kitchen and getting food out in a timely manner. The manager was apologetic and offered us shots or a free dessert, which we declined.... Taking something off the existing bill would have been more appropriate, but wasn't offered.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-kLnQd3MAgbXE_8rwKHBwQ"
  },
  "op1N6n35G5gbUw1Q1HbF2Q": {
    "date": "1/16/2018",
    "text": "The best of what's around with a menu that's got something for everyone. Higher end establishment... for the area. Good place for any time of day and any occasion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6dwrom-jxcSThlq3aizyg"
  },
  "A0wgMp613vTGFZ7t-mWu4A": {
    "date": "3/5/2018",
    "text": "Food is really overpriced , we shared the wings as an appetizer and we got the Parmesan garlic they were gross , not worth the money . The waitress never brought drink refills we had to ask twice when we were empty . Definitely wont be back .",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "69shVIf4wXO7tpeXYOBTtw"
  },
  "71fbMz4zMJ1zXrlhyT8SYw": {
    "date": "3/31/2017",
    "text": "This is our local go to restaurant.  Relaxing, kid friendly, good food.  Can watch a game, listen to live music at times and enjoy a cocktail with a meal.  We also bring family when they visit.  Great salads, appetizers, burgers and wings.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_n8vjDkzNkFdaI7ExKwR5w"
  },
  "NTGmyMOhMpC6NaGmvI3jwA": {
    "date": "8/16/2017",
    "text": "This place is an Indian Trail family dinner staple. I've had every burger they offer -- can't go wrong! (Just wish they would expand this part of the menu, they've been in business for a while) Hawaiian is definitely my favorite. I could eat them every day with the sweet potato fries and a cold Bold Rock Cider. I take friends from out of town here because everyone likes it and the outside patio is great for catching up and playing Giant Jenga. Staff anticipates needs and nice all around.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fUoUpALW_4oNZR2LEQPAVQ"
  },
  "poYv-jVZVVhhWXjsu8Yw4g": {
    "date": "4/9/2017",
    "text": "Thanks Trail House for all you help making our event awesome! Your staff was very attentive and the event room was perfect! Also, our whole group enjoyed the wings and food. Thanks again for making our special day lots of fun.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "euMk2RbZiSj61JYp0mx3MA"
  },
  "oMMxq5IFY6CR8nH0j4q4Wg": {
    "date": "5/20/2017",
    "text": "Went here for the first time for Mothers Day brunch. We knew going around 11:30 it would be busy but we were able to get our table for 4 fairly quickly. They were definitely staffed for the crowd which was nice and our server was very attentive. The food spread for brunch was vast from oysters, shrimp, sliced prime rib, sliced ham to the usual eggs, bacon, omelettes, French toast and pasta dishes. The food was good not great. Now for the bad part.....the price. $21.95 per person not including drinks. I walked out of there (including tip) dropping $120 for 4 people to eat essentially breakfast. I don't think the Ballantyne Resort charges that much and the ambiance is much nicer. Anyway I can say I tried the Trail House but there ant many many more economical restaurants out there that will be getting my hard earned money.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J-nGtFmz5DIH_SQcSm0blA"
  },
  "io9sRmY3aCkX3DdTZxJPNA": {
    "date": "9/26/2015",
    "text": "This place needs to decide what it is.  Is it a sports bar?  Is it a dance club?  Is it a grill?    Came in Saturday for food since everywhere else was closed and we wanted to try something that wasn't hickory tavern(again).  So very very loud.  Can't even hear myself think.  Seems like a serious distraction if you are trying to watch sports.  Acoustics are awful,  never thought I'd hear so many songs I love and hate hearing them.  Like ice picks in my ears.  DJ is terribad.  In no world does Turn Down For What seague into Sweet Home Alabama.  Just....no.  Brussels sprouts appetizer was drowning in sauce and not very good.   Union burger was delish, had the bacon added and it was on point.  Waffle fries probably the best I've ever had but I cannot see ever coming back unless it's for takeout.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "6O5Q0kyHUqcc_Vl2_uVCbw"
  },
  "MjGhEuco1UZeVM_QO_h5uQ": {
    "date": "4/20/2017",
    "text": "Impressive!!  We were looking for a restaurant to go to for Easter Brunch but my girls wanted a buffet. We had been to Trail House before for drinks and to see a band but not food.  I don't know how their normal Sunday brunch is but Easter brunch was amazing! All four of us loved it and want to try out their regular brunch now.  So much to choose from and all the wait staff was super friendly and attentive.  So happy we found this!  Well done Trail House!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSWwDl-ibAHTLcucDArnkA"
  },
  "i0kc9xE748HocjUmPVr6FA": {
    "date": "6/27/2016",
    "text": "This is probably one of my favorite places to hang out. The food and the atmosphere is great, but the people that work there make you feel like family. Great place to hang out with friends and family either for just dinner and drinks or good live music and drinks. Highly recommend trying the TrailHouse.  It is BREWBROTHERSCLT approved :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T2rbCtTV1pPDFARhwtd_cw"
  },
  "JOhAjY4T1dIQDMW14QHAPQ": {
    "date": "12/29/2016",
    "text": "My family came in town for Christmas and we all got together here last night. We reserved the back room so we could all sit together. They turned the game on so the men were happy. Our waitress was friendly, she introduced herself and got our drinks out pretty quickly. The food took a while to come out. Not sure if that was due to the size of our party. I ordered the ITL Patty Melt with onion rings. It was delicious, and the onion rings great! The only issue was my brother's ribeye steak not being properly cooked. Other than that, everyone seemed to really enjoy their meal. We will definitely return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRDNGAelGEbZABPitQ39wg"
  },
  "pYuZGE_sfVrwxTjToKEOWw": {
    "date": "9/12/2015",
    "text": "Went to The Trail on a Friday night with my friend and we got seated right away.  Our server Chris (handsome lad with glasses) was very thoughtful and attentive.  I appreciate that he didn't give us the bums rush after we were done eating.  I hate it when places do that.  The burger I had was yummy as was the mojoito.  The bathroom was clean too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtsC3E8DOzm_tyUXJ5HGZA"
  },
  "nkzRGo13f-04GSJn83v-lg": {
    "date": "8/20/2015",
    "text": "Went to the Trail House for lunch today. Was my first visit but will not be my last. Had a burger with chili, slaw, and mustard. It was very good and very big with chili and slaw falling off the sides. I ate it with a fork to keep from getting  it all over me. As good as my food was the highlight of my meal was my server Shelly. She took great care of me and was so sweet and friendly that it made lunch a great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RjzntzeWtrP2l0M10_hSTw"
  },
  "beBydm6cpDPTvAf5rakFbA": {
    "date": "4/16/2017",
    "text": "Went to Easter brunch. They were well organized and the set up was smoothly ran. The food was delicious, hot and a great selection. Waitress was awesome!! The only place I see that needed work was the front desk. We had requested a table for three. She was asking us to take a high top which is not comfortable for us. There were plenty of tables open and remained open even as we left... may need to address this because we were not the only ones that did not want to set at a high top.  Everyone was friendly and the Resturant was very nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L7VIQXKTYo29i5pSB0CdMw"
  },
  "b5jB9MwOndQNyIYG8Xs9hw": {
    "date": "9/18/2015",
    "text": "Disappointed and we will not return.  Friday night-  730pm, dinner  Food was poorly made. Chicken in the fettuccini Alfredo was awful to taste.  Shrimp dish my partner had was way over marinated.  Service was weak and amateur.  Manager had to bring someone over to take our order. While server was friendly, we were not given place settings. Not even when food arrived. We asked a server for them and we got 1.  So, took one of another table  Price- overpriced on the food. You should at least get what you pay for.   Other: place is very, very loud. The acoustics should be fixed. Bathroom was dirty. No one changed the trash can in a while and it was overflowing with waste towels.   Saddens me to write such a negative review, but folks should know the truth before the fact. It's a newer place and has that newish wow factor for now, but we do not think that it will last for long with these conditions  It was our first and last time there.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-0U7YWdMI8QK0Hq3Zvkk8w"
  },
  "u78yzKGK5QUOSj1DwVSq-w": {
    "date": "10/26/2016",
    "text": "Nice place for a date night if you're not looking for a super romantic place. The service was fast and our server was great. We ordered fried pickles, honey sriracha boneless wings, and the flatbread. They were all super tasty! The strawberry margarita was strong but didn't taste of strawberry. The slices of fresh strawberries were a nice touch, though. I can't wait to go back for more wings!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9K_EMrngEzvRvXNC7Dk9Mw"
  },
  "hxhM8qYBN2iZE2rLYcrQig": {
    "date": "8/31/2016",
    "text": "The food was awful. They changed names, but apparently keep the same cooks. The waitress did not know the menu or what comes with each meal. This might be a great place to get a drink if you are ready drunk. Union County should strip this place of every being called a restaurant. I will never dine here again, no matter what name they change too.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "k4SqE1T1VQBDe5wEkahrsA"
  },
  "ddfIHaGLHeAN-3VIAnNe8A": {
    "date": "11/13/2016",
    "text": "Delicious brunch! A wide variety of breakfast food including Belgian waffles, sausage & bacon, eggs, biscuits plus lunch offerings featuring fried chicken, blackened chicken pasta, shrimp & grits, Mac n cheese, plus fresh fruit, salad and dessert. Very friendly service - our server Cheyenne took great care of us throughout our meal. We were very impressed and look forward to returning!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlUQ8vmsuayV--Po7oIyaQ"
  },
  "Qa_P1NOCi0ELSpJJ3VCluw": {
    "date": "6/19/2017",
    "text": "We went to the Trail House for my niece's birthday 9 people on a Saturday afternoon it wasn't busy we were seated right away we started with nachos and they were tasty. It took a long while for our waitress to come back we had to ask several other waitresses to get her for us which was strange because again it wasn't busy at all. I got the chicken tenders and tater tots with a side of mac and cheese everything was tasty, however again having to track down our waitress to get drunk refills or extra napkins was annoying. I will go back and try it again for sure we were all pleased with our food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jIkgncMmxZuFnvFleIvk3A",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Chicken tenders and tater tots",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/jIkgncMmxZuFnvFleIvk3A/o.jpg"
      },
      {
        "img_id": "rw6e65bv113YV2UCqwxGWg",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Mac and cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/rw6e65bv113YV2UCqwxGWg/o.jpg"
      },
      {
        "img_id": "70pOelDi5Gx2QYIdSpypIQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Nachos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/70pOelDi5Gx2QYIdSpypIQ/o.jpg"
      }
    ],
    "user_id": "aeELJ_VPa0JYqekZhzLEBA"
  },
  "7A2Sv9UGRS_rs51qKXNXhw": {
    "date": "1/18/2018",
    "text": "Slightly upscale place that seems a little out of place in quaint little Indian Trail...in a good way!  Nice atmosphere with some surprises on the menu.  Very good food!  The Sunday brunch is awesome and is probably one of the best I've ever had.  Highly recommended!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4g4RYTxx9V7xITgmKQDcA"
  },
  "E8c-Rq3fAy3_LV--jnre5w": {
    "date": "6/21/2017",
    "text": "The Sunday Brunch is amazing. We love it. Want to try out their all you can eat crab legs next.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CSk2gh1Nb9cY30MYQqBaNA"
  },
  "pFb3GYhlbaDQpoQ2IwsEWw": {
    "date": "4/2/2018",
    "text": "Probably a great place to go watch your favorite team play while enjoying some typical bar food. And that's why I'm only giving this three stars. It was typical but nothing special. The servings were a good size for the price and the service was good as well. Of the three items ordered at our table, the Buffalo Chicken Flatbread was the tastiest.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jHmHBOp6LQEvYknjy7AE_g"
  },
  "c_XKRiKJoELoI8cZmn3NIA": {
    "date": "2/21/2018",
    "text": "This place has been a few different restaurants and The Trail House is the latest one. The food is good but WAY over priced. It most definitely is not worth the price. It's always extremely loud in there even when there's not live music. Definitely not a place to go for a relaxing meal.  There are too many other good restaurants in that area (and more being added constantly) to waste time and money at this place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LP05yQGERO7dHPOUa9pang"
  },
  "mgIbqSjq9L2YtxdFA6l0AQ": {
    "date": "6/14/2017",
    "text": "Food is fresh and well prepared. Prices adequate.  Service varies depending on when you are there, at least this is my guess. I've had great service and the place was busy and I've had bad service and the place was busy.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1oVuT-4V0RZynu_FH3sNTA"
  },
  "Cc-jgEabBh2ZFfZvxhIIqA": {
    "date": "12/7/2015",
    "text": "Food was surprisingly good.  Everything came out very quickly and hot! The service was good.  I would definitely visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "i5fzAUVt1D76OImaCEqsLg",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Avocado Wrap appetizer",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i5fzAUVt1D76OImaCEqsLg/o.jpg"
      },
      {
        "img_id": "7Bne0lkcPRnGPcigPgvk6A",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Fettuccini Alfredo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7Bne0lkcPRnGPcigPgvk6A/o.jpg"
      },
      {
        "img_id": "7remYqg3KAmPc5ZmQ8oo0Q",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Meatloaf and Mac &amp;amp; Cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/7remYqg3KAmPc5ZmQ8oo0Q/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "9_J09GGa9_WBC5s4vxTLQQ": {
    "date": "8/14/2018",
    "text": "I've been wanting to try this place for a little over a year now and finally got the chance to do so yesterday. I had previously amped this place up to friends and we were more than happy to go and give it a try. We went on Sunday about 4 pm the restaurant was empty. Only a few people at the bar and nobody at any tables. This being said there was no wait time on being seated. The Hostess was very nice and gave us a choice of seating we decided on a booth. Once seated the server came over swiftly and took drink orders. We needed a little time to browse over the menu and she had no problem coming back. She came back with drinks and took our order. I ordered the meatloaf with double mashed potatoes, my friend ordered the trail house pasta and ordered her son chicken tenders from the kids menu. The restaurant was very clean, tables wiped off, floors swept, restrooms were kept clean. A downside was the lighting was a little to dark for my taste. There was also no cell service. The food came out rather quickly. For the price of the food I expected to be full by the end of the meal and not have to eat again for the rest of the day. The way they plate food is very fancy so it was picture worthy. After reading reviews on how good the meatloaf was i was very disappointed. The meatloaf was completely covered in BBQ sauce which was upsetting. The BBQ sauce was so overpowering you couldn't taste any other flavors in the meatloaf. Mashed potatoes however were good just wish there was enough to balance the amount of meatloaf that was given. My friends pasta was a very small portion for the price. She said it was lukewarm when brought out to her. She added that although the Cajun sauce had a kick to it the pasta was very bland overall. The kids chicken tenders meal was also bland her son didn't really eat it. Overall the restaurant was nice and the staff were very kind and helpful but they dropped the ball when it came to the food aspect.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QsdK-3-LXLC4NbgW_aMY3w",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QsdK-3-LXLC4NbgW_aMY3w/o.jpg"
      }
    ],
    "user_id": "EjuRg9dz-660O8hU43FFtA"
  },
  "K00EKUI_Yd69LbNJH650_g": {
    "date": "8/13/2018",
    "text": "So let me start by saying my friend and I were really excited about trying this place out we wanted to go to taste of Charlotte when they were there but we weren't able to so we finally tried it yesterday 08/12/2018 and let me just say glad we didn't waste our money at taste of Charlotte we went around 4 and it was DEAD we didn't have to wait to be seated didn't have to wait to get drinks either however the water tasted like tap water.GROSS! I ordered the trail house pasta and chicken tenders for my son my friend had the meatloaf with extra mashed potatoes  instead of green beans. I'll start with my food my pasta was lukewarm and bland and it was swimming in the Cajun cream sauce i would have preferred more chicken in it but whatever i give my meal a 4 out of 10 the chicken tenders my son had where tasteless seems like they came out a bag and the cookie that comes with the kids meal was hard my son literally took it out and knocked on the table with it the cookie didn't even crumble my friend down right hated her food she said the mashed potatoes wasn't two portions which it wasn't and her meatloaf was drowned in there bbq gravy and it was over powering she said she couldn't even tell if the meatloaf was good all she tasted was the sauce and to top it all off the lighting was dim and we had no cell service we both have AT&T and both our phones had zero bars the presentation was nice but i rather a bad presentation and amazing food rather than the other way around all in all will not be back",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZUE7Faw2Y424oh96yVxBjA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZUE7Faw2Y424oh96yVxBjA/o.jpg"
      },
      {
        "img_id": "w4BDHELGdlHzbAdfcRuRjA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/w4BDHELGdlHzbAdfcRuRjA/o.jpg"
      },
      {
        "img_id": "XgoOiEKZI71meyPAcBys0A",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/XgoOiEKZI71meyPAcBys0A/o.jpg"
      }
    ],
    "user_id": "3FEfZBvgRQcslCarXsTH3A"
  },
  "nKsXqj9z0TICax6SNy1Azw": {
    "date": "2/6/2017",
    "text": "Ok place to grab a bite before the movie - but one entree was served cold when it should not have been.  Server did take the entree cost off our ticket, so I appreciate her paying attention to our experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u8HPA-jU1njsPPAI_anMgA"
  },
  "HNfDNmZYLCNf35_0rXCRig": {
    "date": "8/16/2015",
    "text": "My family of 4 had an opportunity to try The Trail House on their first Friday night service.  We are always happy to see local small businesses come into our area and always try to show our support.  This was a good experience and we will likely return.  Positives:   - Food was very good!   - Extensive beer selection and bar menu. They have Old Meck beers on tap! - They have a great menu (lots of choices, but not too much) - Service is very friendly.  - The decor is fun and contemporary. Nice play on upscale pub decor. - Location is convenient (in Sun Valley 14 plaza) and lots of parking - My family had a potpourri of food samplings. Hot Wings, Slider Trio (Pork Belly, Short Rib, and Beef Burger), Steak & Chicken Fajitas (portion was on the small side), side Caesar Salad, and Pork Chops. Everyone enjoyed their food. - The \"Trail Mix\" that they bring to every table is unique, fun, and yummy.  Negatives: - Food delivery was a tad slow and one of our items came out incorrectly (Fajitas were supposed to be Chicken and Steak with no Rice or Tortillas...came our Chicken and Shrimp with rice and Tortillas). We will chalk this up to being new, but I did consider that in my rating.  - My son and I also had water splashed up on our legs from the waitress spilling our drinks onto the tray during delivery and then tipping the tray sideways to carry away. She didn't clean it up (although she knew she did it because she apologized for getting us wet), but luckily another server was walking by a few minutes later and wiped it up. - A tad pricey for the type of food offered. My family of four had 2 appetizers (as meals), 2 entrees, 2 soft drinks (no alcohol/beer), and a side salad and it was $67.00 (before tip). We enjoyed our food, but we can get similar food (type and quality) elsewhere for less $$.  We will go back again and we have already recommended The Trail House to several friends. I hope that they do well and wish them the best of luck!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ecd5AmF0lxJCTyPnZt5Bhw",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ecd5AmF0lxJCTyPnZt5Bhw/o.jpg"
      },
      {
        "img_id": "xSJSjAj2NTejqsIItfyeqA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xSJSjAj2NTejqsIItfyeqA/o.jpg"
      },
      {
        "img_id": "eIdGBNHSrt-QxsyEcA7oBQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/eIdGBNHSrt-QxsyEcA7oBQ/o.jpg"
      }
    ],
    "user_id": "vbHlFP0Orx1mM5-uBqzYFg"
  },
  "xsM-hui2m9fPfV47SRX5Zg": {
    "date": "8/10/2016",
    "text": "If you love the ambiance of divorced people out trying to spread their seed for another round of broken children, this is the spot for you.  We walked into the Trail House on a Saturday, trying this place for the first time after we had been to the previous residence of this space and left disappointed.  When we walked in the door, I was overwhelmed by an echo chamber of a thousands conversatons each trying to drown out the next.  As soon as we sat down, a bartender walked over to brief us that our server was busy and she would be happy to take our drink order, we promptly ordered one as well as an appetizer of Fried Pickles.  I ordered a Sugar Creek Belgian Dubbel, it arrived quickly but seemed flat and neglected.  The Fried Pickles were quickly dropped off at the table but we lacked silverware and a napkin, so I had no where to wipe my greasy fingers.  It was another 8 mintes until our waitress finally arrived she had been tending a party of 8 teenage girls, who I hope don't have children.  The fried pickles were less than stellar.  But she did finally get me a napkin.  The decor of the Trail House is really appropriate.  The wooden like panels give it a Western feel, black and white pictures decorate the room of various Indian Trail sites, like the Highway 74 sign.    My wife and I split a French Onion soup, and it was the most delicious French Onion soup I ever had.  If I was coming to this place for French Onion soup alone, then I would have given it 11 stars.    My entre was the Cajun Penne Pasta, and it had carrots in it.  Who puts Carrots in a Cajun Pasta?  You ever been to Louisiana and said, toss me some carrots in this delicious Cajun meal?  You get carrots in your Cajun pasta when your veggies come from a veggie medley bag from the Harris Teeter across the street.  Who we kidding, it was Food Lion, not HT.    My wife's order was the Cuban with the French fries.  The fries were warm and crispy, but the Cuban, was soggy, imbalanced, and disappointing, like Ted Cruz.    I wrapped up this disappointment with an Olde Fashioned, which was tasty.  My final verdict, this is a great place to meet strangers for a couple of drinks if you are drinking the hard stuff or a botteled beer.  Lots of TV's, a great patio, all sorts of strange, but if you are looking for a delicious meal, just walk over to the Pizza place.",
    "rating": 2,
    "rated": {
      "funny": 9,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "EWqprVqPER91tM1-bb12bQ"
  },
  "djU5PB8ErNTLJEL2EarLrQ": {
    "date": "10/5/2017",
    "text": "The Sunday breakfast brunch is the best! Includes amazing blackened chicken pasta, carved prime rib, red velvet mini waffles, plus a full array of the breakfast staples: bacon, eggs, homefries, shrimp & grits, etc.   This might be the most underrated bar in Indian Trail. Good prices, cool outback patio set, occasionally some cover bands play. They could do with a furniture upgrade but other than that I love the place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MeeFKzmSUz4zQ30DpM6G-w"
  },
  "JC2WpkjSjo2QIX4SuRwhFg": {
    "date": "9/22/2017",
    "text": "We went Thursday night! They have half off cocktails and $2.50 tacos.  Their specialty burger was stuffed with a lot of goodies that my wife really enjoyed.  Service was on point! They even have an ice cream for dessert with my daughter's kids meal.  When we left, my little girl screamed, \"I love this place!\"  Now I'm a big fan to. =)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ysusH9G6qqgVflI9heCaUQ"
  },
  "jJxt5ZaidaPguzOceef8iA": {
    "date": "6/9/2018",
    "text": "The food is really salty and just ok.  It wasn't anything special.  We've been here a few times and we have had a various items from the menu.  Thry do have great specials during the week and the band on Saturdays are usually a good time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTSyV3SAJqPcNH9L6grmgg"
  },
  "iIcd6oI0SLVAtiFolxm1yg": {
    "date": "5/18/2017",
    "text": "I thought the Captain Crunch & pretzel mix that they give you when you sit down was a bit odd, but I liked it. My husband, on the other hand, said he couldn't eat that cereal without milk. Haha. The food was really good. I ordered the fiesta chicken- I think. It wasn't \"all I'd dreamed it would be\" but it was good...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2IZdOGgJBhsZZJ5KofAFXw"
  },
  "r1LzP7iy1U_D8V5Kb2LxVw": {
    "date": "9/9/2017",
    "text": "Great food and drinks. Good service. Nice to have FNZ radio there to give out trivia and prizes! Such a great place to watch college football on Saturdays! Sundays they have brunch which looks fantastic. Looking forward to coming back each week to watch multiple games at once, enjoying great apps, meals, and drinks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vr7hlzHnh1duZkDmpYVv2A"
  },
  "xbIEcUvFuJ7dCTQD3s9G7Q": {
    "date": "4/12/2018",
    "text": "Good deals and the food is always great but the service is so slow. I have been there a number of times now and each time it took longer than normal to get our food and to get our check.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s2UFZF7TvGxJYNFsuCAIgQ"
  },
  "vk_OSZ-2rqcSOuhwWYJr_Q": {
    "date": "9/1/2017",
    "text": "Nice atmosphere!  Local IPAs were delicious. I would recommend the Charlotte IPA. The meatloaf sandwich came with barbecue sauce, which was surprising, but nonetheless very tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sx_rVGP1O3bfnpWQKREIIw"
  },
  "p91MoLify6gq5Gx86Fm6mg": {
    "date": "2/16/2016",
    "text": "Our server Elijah made our date night out so much better than expected. His intelligent dry wit and extremely attentive service was refreshing.   We went out for a drink and appetizers  only. We ordered a Reuben and it was one of the best we have ever had. It was not fried and greasy. The marbled rye bread seemed homemade.   I ordered the strawberry margarita (1/2 off specialty drink menu on Sundays) and it was very very good. They even had some fresh mottled strawberries mixed in. The drink was artfully prepared and presented.   My husband ordered a local on tap IPA and that tasted very good.   We will definitely go back for more.   ...afterthought; they had one drink on the specialty drink menu seemingly geared towards the female crowd and the name of the drink was offensive. I'm sure the guys who came up with the name think it is funny. Hopefully they will read this and consider how it looks from a different point of view.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OwepC1U-OoVnDKzXQEkXHQ"
  },
  "vnVB0R9AA5Y2Iq6Y9mkjYg": {
    "date": "12/13/2018",
    "text": "Good food selection and specials with a nice atmosphere. Good place to watch sporting events",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JzRYHVFAeffpDHF5naJXkA"
  },
  "LoodspSndsQUQ8fCr80tUg": {
    "date": "7/27/2018",
    "text": "Great place!  Tasty food and very gracious and expedient service. The Indian Trail area needs more places like this!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nKnvmsOex0KS7P1ePzoRfw"
  },
  "wqQHaFW6FDBzPXkzmZIHYw": {
    "date": "3/26/2019",
    "text": "Great brunch buffet and awesome service!  Made to order omelettes and waffles were good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "emtxMBECZUFRYVXR5Bvbhw"
  },
  "0hfaWflby8Aswk3l-FHZFA": {
    "date": "7/27/2018",
    "text": "Good food and we were seated right away on a Friday evening. It's a little loud but overall good environment. This was our second time eating here and we'll probably return.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0vBZ186vD_2sPOCcdNG31w"
  },
  "csnj_sJitvaPa25S-ncA3Q": {
    "date": "12/12/2017",
    "text": "Let's start with the food: Wow! Creative takes on food we all expect at a traditional American place like this. We started with the cheesesteak egg rolls, which honestly surprised me with how good they were. My son ordered the Trail House Grilled Cheese, and I ordered the Meatloaf. Both some of the best items I've gotten off a menu in a very long time. The grilled cheese is definitely not what you'd typically expect, or at least not what I'd normally think of when I think grilled cheese. Take two thick pieces of bread and stuff them full of macaroni and cheese and pulled pork and you've got this sandwich. The meatloaf wasn't anything necessarily unusual but it was equally as delicious. All in all, the food was great.   Now let's talk about the service: Meh. We arrived around 4:20 on a Tuesday night. Definitely not a busy time for most restaurants for sure. We were seated and told that they'd have to find our server. A few minutes later a guy came by and said he wasn't our server but would get our drinks. Once our server did appear she was definitely friendly and helped me to make a decision on what to try. Our appetizer came out quickly but, as is a pet peeve of mine, our entrees were also soon to follow. After our food had arrived we didn't see our server again (well, at our table) until we were not only done eating, but empty on drinks and ready for boxes and the check. Even still, when she came it was only to drop off a refill. We sat for a good 20 minutes between being done with our meal and finally having the opportunity to ask for boxes and the check. To be fair, she appeared a little overwhelmed as she had the entire floor to herself (including the tables in the bar area). In other words, blame the lack of exceptional service on poor staffing at the time we came.   Overall, we will definitely be coming back and I'd recommend the same to anyone else as the food really shines but, hopefully next time there are some more folks on the floor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "N3Yx3WuaWz84fsIbUARGBA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N3Yx3WuaWz84fsIbUARGBA/o.jpg"
      },
      {
        "img_id": "_NSpszD8d_YZ1U0eQYEHGQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_NSpszD8d_YZ1U0eQYEHGQ/o.jpg"
      },
      {
        "img_id": "yaomyodBL7Bke225r8xD6Q",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yaomyodBL7Bke225r8xD6Q/o.jpg"
      }
    ],
    "user_id": "DKN6f9dtbpR7D5kwgcPxsA"
  },
  "U-XjnmVM1wrxyG-4FPiyQw": {
    "date": "3/10/2019",
    "text": "The TRAIL HOUSE IS AMAZING!!! Let me share a worst day/best day story!  So, to be brief - I had planned a work function at a different restaurant that fell through about 5 hours before the event was to start (but that's an entirely different story...not telling that one.)  ANYWAYS, in a last minute panic, I contacted The Trail House and explained my plight and they were like \"We would love to host your event this evening!  We can totally make this happen for you!\"  They were AMAZING!!!  They put together a lovely evening for our group of 20 people in their private room - with delicious food, outstanding service, and everyone was absolutely wonderful to work with!  Jason went above and beyond to help me - and Alyssa was a terrific waitress that somehow kept everything straight!  I am so grateful to them!  They definitely saved the day for me, and we had a really terrific evening!  Now that I know about The Trail House, they will ALWAYS be my FIRST CHOICE when planning an event!  They are the BEST!  THANK YOU!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CZIdJetu84b5xmq6zoA4EA"
  },
  "tmjTSKZ8TCVsjnSRddGKlg": {
    "date": "7/1/2018",
    "text": "LOVE The Trail House!! I am the Property Manager of Copus 1 Apartments and we use The Trail House a lot for events! The food is awesome, the managers are great and easy to work with and I would highly recommend this restaurant to anyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m5a9wNwQOJAtAjqc4NMREg"
  },
  "wCTYkxYQOZMVm4F_jD6h2g": {
    "date": "12/31/2018",
    "text": "I love it here, and the specials and trivia nights are always great! Nice menu options range from kids, sandwiches, apps, and nice entree's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "579SvAaOWGgriWZHTPwXCg"
  },
  "AYB_jcZ17iUz_M2IibH0rw": {
    "date": "7/21/2018",
    "text": "My family and I went to the Trail House on a Friday night. We were seated right away. I am a vegan and my family is not. I was able to get a really yummy quinoa salad, which I highly recommend (and got a full glass of wine, which almost never happens when you eat out). My husband and daughter got burgers, which they really liked. My son got the buffalo chicken flatbread and said he would definitely order it again. Our waitress was great; very personable and answered any questions we had. Everyone agreed that we will going back in the future!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tL0JY4RH10ukt9t9itrVzw"
  },
  "_mW061hU5DfIzVFLM4MNOg": {
    "date": "2/25/2019",
    "text": "Met a friend for wings! Try the Honey Sirhracha, they're the best! Thanks to Damian for great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtdxiWhYNp8kcj59J-zSpQ"
  },
  "ghQ8J9CDjCkuqsgz4cII9w": {
    "date": "6/5/2018",
    "text": "Very good food and the staff is friendly.  I've never had a long wait here.  Cool bar area with flat screens and the back outside area has corn hole.  Good time for lunch or drinks on the weekend.  I believe they have bands come as well on certain nights.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UdLlIg0aWGkFAtvXyuo6HQ"
  },
  "yNtoqN-NGn7by8tjnsXY4A": {
    "date": "6/1/2018",
    "text": "Took my three girls there and they are foodies. All were impressed.  Miller was out waitress and took great care of us.  We will be back",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "hIvvEKPCrpbfvg3ftqk2Ag"
  },
  "6_hhmHQ9k7v4MPgYezbnnw": {
    "date": "11/30/2017",
    "text": "This tops my list of best places to hang out in Indian Trail!  My favorite night is Tuesdays for the Best Trivia Ever and it is \"Kids Eat Free\" night. Other great specials all week long. Live bands on the weekends and occasionally on Wednesdays and Thursdays. Also a great Brunch on Sunday morning. They have a really good menu and the staff is outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Voqzn16BO_y1LH7Zvjftnw"
  },
  "hJT0zlSbSh2ABncQOu90Yw": {
    "date": "2/27/2019",
    "text": "My favorite local spot. Excellent bartenders - ESP Melissa. Great food, good prices. Zero complaints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b83GDkXS2T32eXaPhEb-HQ"
  },
  "1tZUxJDPfS4sYxPsLV2mpg": {
    "date": "11/9/2018",
    "text": "This place is kind of pricey but the food is worth it. I love their wings and nachos I get them every time! I love the set up and that they have live music sometimes. Definitely would recommend trying this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nvQwbFAOx_nU8zbrxPTEag"
  },
  "r9ljQ0VbwxSbbp1qwH5OGg": {
    "date": "12/6/2018",
    "text": "We tried their Sunday brunch. It was great. What a selection of food including prime rib",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2I-MIy7Cb9OQdkavXgUDVw"
  },
  "G9KOOYzER1vqPB0UxHY8TA": {
    "date": "4/25/2018",
    "text": "Trail house is pretty good. Only reason  I have it a 3 is because  they dropped the crab legs from the menu. They should put them jawns back on the menu. They should have a dj to keep it litty 250",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K18IBHgFw-SIxoVa-newYQ"
  },
  "QU2m07bjPhqcvv02o4cthg": {
    "date": "5/22/2018",
    "text": "Me giving this place a one star is being generous. The waitress paid no attention to our table, drinks were empty for 30 minutes--including while eating, the food was subpar & the \"computers went down.\" We found out the computers went down by eavesdropping on another table because during this debacle our waitress did not even notify us, nor did she check on us as she continued to visit other tables, including checking on one table 4 times. We saw our waitress to take our drink order, food order, and deliver the check after we had completed our meal for at least 15 minutes. We had to request another waitress to tell her we were ready to leave. When she delivered our check, she wouldn't even look at us, nor would she sincerely thank us for our business and she also did not apologize. I will never be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_FZSHNgk1u_rw2cCe2x5Q"
  },
  "CFy28oEUnjOGp-JVHjs_4g": {
    "date": "8/17/2018",
    "text": "We love this place! The food and drinks were fantastic. We had sliders and the grilled chicken. The waitress was excellent. She was delightful and answered all our questions. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "j16EDiOwGsNDWJZiyR2oNw"
  },
  "OkFqiYto9pjUYoy_qlrTqg": {
    "date": "8/7/2018",
    "text": "We started with the fried pickles...delicious!!!  Highly recommend them. We ended with the brownie ala mode. Again highly recommend. Oh and the food in between was good as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Dyd-MVAGL_UoYuUaakqfA"
  },
  "vVDChSWdq8vg8gSWNpnnjw": {
    "date": "4/26/2019",
    "text": "Went her two weeks ago with my nephews and my niece and it was OK!, the food wasn't bad but the service was a little slow. They sent out the wrong foods to our table, but once we said something they where quick to bring out the correct items. I would choose Hickory Tavern over this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2RzYPcRFOy4zMsiVQDwUFQ"
  },
  "bLDPMYvc7MYPks_feiLxjA": {
    "date": "5/24/2018",
    "text": "Stopped here one Sunday evening for dinner with some friends and our kids.  The place is nice, and fairly clean inside.  We were seated quickly as it was empty when we arrived, and the waitress was over quickly to get us drinks.  We placed our drink orders, and as soon as we got our beers we placed our food orders.  Food arrived decently fast and the orders were all correct!  I got a avocado shrimp salad that was very tasty, the avocado was a little brown, but not terrible.  The salad was crisp and the shrimp were perfect!  That's what really mattered.  The size is OK - for a salad as an entree it's not quite enough.  Luckily my wife's chicken sandwich was HUGE, and I was able to eat her leftovers.  The only downside to that was it made me regret getting a salad and not ordering more meat!  I should have taken the advice of the Simpsons and known that you don't win friends with salads, but I know better next time I visit here!  The beer list was good, prices were decent, and the service was good.  It took a little long to get our checks towards the end, and with an empty restaurant, a large group was seated right next to us that caused cramping and noise when there were plenty of spots that would have been in the same serving area.  Other than that it was a great visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPZcg_4iu35i-MeMY0e5Mw"
  },
  "vfk6V4O2VBrRyZZUHT_LEQ": {
    "date": "10/15/2018",
    "text": "Good items on the menu.   Fried green tomatoes are delicious.  They had trivia night on the day we were there (Tuesday) and the format was weird (to me).  You had to text your team info then watch on the video screen to answer your questions.   Not what I expected.  Lots of options for beer.   Waitstaff very friendly.  Plenty of onsite parking.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GN_WFhq9RjFMrsLysjoFtw",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Shrimp tacos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GN_WFhq9RjFMrsLysjoFtw/o.jpg"
      }
    ],
    "user_id": "MUhLpPHeWDQlvEVhNgmcSQ"
  },
  "wBpQc1WeAoRQnFvo5oslOQ": {
    "date": "5/12/2019",
    "text": "Very pleasant surprise. Uncrowded, not noisy, and no intrusive music. Portions were generous, hot, and tasty. Will definitely return, even though it's a 20 minute drive. Lots of variety on the menu, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jQxv9LrXTM0ZmyQW7OH0mQ"
  },
  "2OBLpHI8P9z3vUKgLUa7SQ": {
    "date": "7/16/2019",
    "text": "Displeased with the response from the owner. Firstly, we visited on a weekday closer to 5 PM. Not a \"peak time\" and EVEN if it were, you work in the restaurant industry - you HAVE to have a sense of urgency and adhere to regulations and customer demands even during busy hours. Unacceptable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bI3889azlfZvUmv8UW1Tyg"
  },
  "zF9FFW-OotykZeB9lZW-kA": {
    "date": "7/23/2018",
    "text": "Found this eatery on Queens Feast wow food, service wonderful.  Its been there for 2 years per the owner.  Their choices were great I started off with the steak/cheese egg rolls they came with a hot sauce Im not a spicy person but if you are get the spicy Im sure its good.  These steak egg rolls were so good I could have ate a whole plate of them lol They also offered a drink with the queens feast I ordered my favorite hard cider beer . My entree I choose the Salmon with Shrimp fried rice with Tempura asparagus.  The salmon was perfect the shrimp fried rice had big pieces of shrimp .  The last course for desert the Brownie A la mode homemade brownie with ice cream I was so full I had to get a to go box lol My friends ordered the Lemon Chicken an Steak Medallion they loved their food. I will be back the wings an burgers look great , our waitress was great, plus the new owner walked around . If your in the Indian trail area you must stop for lunch or dinner:)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZlE7pBRi84t4VqwFeBpMgg",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Peach crisp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZlE7pBRi84t4VqwFeBpMgg/o.jpg"
      },
      {
        "img_id": "_6zRNJl2oa76rxtWBlVQwA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Brownie a la mode",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_6zRNJl2oa76rxtWBlVQwA/o.jpg"
      },
      {
        "img_id": "mm2IiOSkQA-BXY4xMvcAIw",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Teriyaki salmon with shrimp fried rice an tempura asparagus",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mm2IiOSkQA-BXY4xMvcAIw/o.jpg"
      }
    ],
    "user_id": "6owWBv_F8Tqti4zmnn2ymA"
  },
  "1R0_LzD_SZ6mxGsx29CLXA": {
    "date": "3/23/2019",
    "text": "We've tried The Trail House twice and both times the food was mediocre and services was bad. Today, we asked to sit on the patio and it took over twenty minutes for our order to be taken. While waiting for our food two servers stood outside complaining about how busy they are. We won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wCZdIFKTDw0AoYe_kuIoYA"
  },
  "ZmY-JgQOuE6J_x2XX8scqA": {
    "date": "11/20/2018",
    "text": "We went to this place on a whim, and we were so happy that we did! It's an awesome place to drink beer and eat yummy food. The staff was very friendly to us and helped give us recommendations. Their menu is very well-priced, they have great specials on their drinks, and the food is delicious! I got the Stalling's Chicken Sandwich with Mac and cheese, and I think I died and went to heaven with each bite. It was euphoric. It's obviously a great bar to go to, but it's also a great place for a cozy dinner with family or friends.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X1dD3yIkFbiWw30SKiobUQ"
  },
  "x4ksfHpx9RlVNQy-BJQBtQ": {
    "date": "6/18/2018",
    "text": "First back in a few years and they changed ownership. Service was good. Beer selection was good. Food was good. Price was good. Can be loud but not intolerable. I had the classic burger and it was good and the wife had the chicken. We will be coming back. You probably sense a theme here in my post; \"good.\"",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC2sg6Z5nkaMeiKC6_5Hzw"
  },
  "P9ph2iirdTe6kHFwURqxmQ": {
    "date": "2/16/2017",
    "text": "Located in a shopping center, this place looks pretty bad from the outside. The windows are mirrored which is awkward because we couldn't tell if it was open. Its a sports bar feel with a stage on the right for live music. My sis and I sat at the bar which was a beautiful granite with a nice bartender woman.   After reviewing the menu and drink list I ordered an angry orchard cider $4. They had a couple good drafts but the price was around $6, higher than I felt like spending. We settled on 2 tacos which came with my choice of side (waffle fries) for around $7. Definitely what I'd consider the best deal on the menu. I got the pastor (pork) and fish tacos, both were excellent! The flavors were on point and not bland at all. Great seasoning, I wish there were about double the amount of waffle fries though, come on fries are cheap, give me a lil more.  My sis can't eat flour or corn tortillas so she requested lettuce wraps and they came out beautiful! Very thankful to the chefs. I noticed they do daily deals, thursday $2 tacos I believe, and Wednesday karaoke. Overall the environment of this place is what really gets me, it needs something to liven it up or make it feel nice during off hours. Maybe some plants outside and inside would do help.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "01DvKeOFrZKqzmDXlt05jA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Fish taco &amp;amp; pork taco $7 with a side",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/01DvKeOFrZKqzmDXlt05jA/o.jpg"
      }
    ],
    "user_id": "i_EASSNcEqc1JrfdBjBeVw"
  },
  "wp7nABMS81p6HsuUQcEkQQ": {
    "date": "12/23/2018",
    "text": "Decent place to eat. The service was good and the establishment clean. I had the trail house grilled cheese and it was kind of tasteless. Both the Mac and cheese and pulled pork could use just a bit more seasoning and flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ST-kPajNmea8989tNohN-g"
  },
  "4UTTquLP7Hz6Ctezd179aA": {
    "date": "3/11/2019",
    "text": "One of my favorite spots in the Indian trail area. Food is always great and the staff are wonderful peoples!! They always have something fun going on throughout the week as well which is great in a smaller town! Definitely recommend stopping in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qu3tJrk7ahQvUYq9btVP8g"
  },
  "Wc3fHIDRGx4RTz0qraeKyQ": {
    "date": "11/7/2018",
    "text": "What a friendly place to come and just hang out with friends or have an amazing dinner with family.  I enjoyed the live music and drink selections but the best was the service that I received from the wait staff. I would recommend the Trail House to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CHyUbY0c1IwYcW7vyGMnEA"
  },
  "FhWMK8RLwnDYeDm3zHAkjw": {
    "date": "2/17/2019",
    "text": "Love this place. They have great food. Love the steak and cheese eggrolls. They are my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qLb9GXl_o7YKoXePHFe5Rg"
  },
  "512l-BJwp2MCpeBhbnCioA": {
    "date": "11/28/2018",
    "text": "Just ok.  I wouldn't travel out my way.  Nice restaurant, but food could use some help.  We went for lunch.  I had tacos and wings.  Food was just ok.  Nothing more to say",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rOhyDyMWN7ckYDNA4C-JDA"
  },
  "fYlRGRQqnhe7ddmwU2FCkg": {
    "date": "5/12/2019",
    "text": "We've always had great service and good food here. It's one of the very few restaurants in the SV area that you can count on for a good meal and good drinks. We've never waited long for a table and even during busy times, service is great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ayuciEegTQAM0vUghXZRPQ"
  },
  "xO0hZT3FUbl0F5uH_g_MXw": {
    "date": "5/7/2019",
    "text": "The last time I went to The Trail House, I remember the fried pickles not being as good as Bonfire's (The restaurant previously occupying the space). But when I went last night, the fried pickles were way better than I had remembered. So that being said, definitely get the fried pickles! The waitress we had was very helpful and polite! She wasn't overbearing and always made sure our drinks were filled. She also gave us suggestions on the menu, which I always appreciate. I got the fish and chips, and that is the only reason this review is four stars instead of five. It made me so sad when I got this beautiful plate of fish and chips, with absolutely delicious chips and crispy, flaky, moist fish- only to find it was really lacking seasoning! Seriously, how the fish was cooked was absolutely perfect! The batter was superb, and the texture of the fish matched. It just really needed some salt, in my opinion. My mom got the flatbread, delicious. And my father got the mild wings, which were also great! The ranch at The Trail House is also fantastic! My experience overall of The Trail House was great. I loved it and I will absolutely come back when I'm in Indian Trail.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T-hitNELgKXJk0sP3L2h-w"
  },
  "xnsfR6GvIryYhy6A5TKRWA": {
    "date": "10/1/2018",
    "text": "We read reviews before coming in and were so hyped about the place. Sadly, it was such a disappointment appointment, our food was over fried, our waitress did not even ask if we were enjoying our dinner... just terrible service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtFKZSjsAH5gk9f6Vzzjpw"
  },
  "xVaLlBLiEPsld5MBd0iOmg": {
    "date": "8/2/2018",
    "text": "The food is subpar and the service is spotty. How long would you wait for a burger? This place just can't seem to get it together.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "eN12VACxEYX7OsPRz_yzVA"
  },
  "Tdh7CPuuEqd8ei1fdmxQ3w": {
    "date": "5/7/2019",
    "text": "We had a great experience here tonight! Good service and food! Love the beer selection!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PkPKR-FkU79AZNzsFFC4tA"
  },
  "j2hh2WZ0Ex-26cTuCZBqpg": {
    "date": "4/7/2019",
    "text": "Fabulous onion rings. Great burger. Delicious meatloaf. Friendly, attentive service.  Lots of TVs. Wish they had the closed-captioning on, though.  We might have come in after a bunch of small children ... the floor needed to be swept. And sticky menus! We'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jI1XHPSYoPtkA2v7-G1NLQ"
  },
  "gjaDOErNRB6am8IcO9G-2g": {
    "date": "3/30/2019",
    "text": "We've been to the Trail House a couple of times for their brunch. It offers plenty of options and is actually very good. We have also had the opportunity to have The Trail House delivered using Doordash and oh my! The food was a-MAZING!! It was hot and delicious. It was like they had cooked it and delivered it to our table!! If you are looking for really great American fare stop in at Trail House!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vms347Z3O3o2zcYD38zTiQ"
  },
  "65lPjMMhDtuQ2XwXIS4D7w": {
    "date": "3/20/2019",
    "text": "It is becoming easier and easier to find good eats in IndianTrail and we chose this joint because of some pretty good Elite Yelper reviews. It is a quasi-sports bar but one that can bring it foodwise!   Everything that our trio ordered was delicious starting with the chicken parm. I like the fact that it was served with a side of perfectly prepared Fettuccine Alfredo instead of the usual spaghetti with red sauce. The large chicken breast was beaten flat, fried crispy and was tasty, although just a touch on the dry side. My only other gripe is that I wish it came topped with a bit more cheese.  The chicken sandwich was nicely prepared and the mac and cheese side was piping hot and cheesy. The Fettuccine Alfredo entree was accompanied by scrumptious thinly sliced garlic toast.  Overall, the service from beginning to end was friendly and attentive. The dining area was comfortable and attractive. The sanitation score was a 97.5. Hey, there's little to dislike about this place. We'll certainly be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Zn6-pLl74iWmxtS1YdlOzQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Fettuccine Alfredo",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Zn6-pLl74iWmxtS1YdlOzQ/o.jpg"
      },
      {
        "img_id": "xwGhJNR_P2zs6k5aFJbOJw",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Chicken Sandwich with mac &amp;amp; cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xwGhJNR_P2zs6k5aFJbOJw/o.jpg"
      },
      {
        "img_id": "83N8wdNdXeBmXcWFmEKp3Q",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Chicken Parm",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/83N8wdNdXeBmXcWFmEKp3Q/o.jpg"
      }
    ],
    "user_id": "HFFiM63x9asevqVOZG5GBQ"
  },
  "LJcdEN9dA1lfQIB-9wdkpw": {
    "date": "8/27/2019",
    "text": "A solid post-baseball game spot to find a little something for everyone.  What's not to like?  Particularly in this area, this place stands out from the commercial chain surrounding eateries.  Think pub meets diner with a TGIF flair(...well not literally) We usually come here after my son finishes his baseball tournaments nearby.  The kids love the selections and the mammoth size soft drinks and my husband enjoys being able to see whatever game may be playing.  They have a few TVS.  The center of the restaurant is where the bar sits.  While the drinks are not the greatest you've ever had, they have a solid selection of beers.  The service isn't terrible, considering most of the servers appear to be pretty 'unseasoned'.  Everyone is friendly.  For me, there are no stand out menu items but I appreciate the variety offered that will get the job done after a long day of youth baseball with a family where no two palates are the same.  From salads to wings and handhelds, The Trail House has got you covered",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_0LwemzCLchggFtEWHERDA"
  },
  "RupN6OyTXjbsI8qdNtWHgw": {
    "date": "7/1/2019",
    "text": "Nice place in Monroe, its clean and big and has pretty darn good food. Nice music on weekends, loud rock but I love it! great Onion rings, lots of different cocktails to please everyone and some craft beers. Swiss Patty Melt was good, that is what I had. My sister had the Veggie burger. I have also had the Chinese Chicken Salad, which has a great dressing and a lot of almonds and chicken.  Service has always been great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YFHrehv9nlluLMmn7eUUqw"
  },
  "2VhZU4N1ysxpy6MMLfUwWQ": {
    "date": "7/17/2019",
    "text": "This is a great local place to eat. So many different options that I have a hard time deciding what to get. Always seem to have great drink specials going on. Cookie Skillet is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EgkwP0DGGvgfocAKPqSEtw"
  },
  "tb2OY-_zumF-J86DB2eMjw": {
    "date": "8/22/2019",
    "text": "Delicious food amazing cocktails what's not to like about this place. The staff was super friendly and the atmosphere was great. Good vibes all around and definitely a place I would come to again",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vFtAl3nP03y3-0_v7XEaSw"
  },
  "FaOwooy5gVZzzFvC1YIe-w": {
    "date": "8/2/2019",
    "text": "Went with friends to The Trail House a couple Sunday's ago. The Sunday brunch was exceptional. The prime rib was cooked to perfection as well as all lunch and breakfast items. You must have some banana pudding!  Excellent and yummy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "z3wCGAHPzVsYnpOvPmLDhg"
  },
  "DdEMym-OlDHG8ph2d5avXg": {
    "date": "4/4/2019",
    "text": "I review places for what they are and try not to compare them to other kinds of restaurants.  This is a sports bar. While I am typically not a big fan of sports bars, this place was exceedingly delightful.  It is a very large and attractive restaurant, with a massive bar area.  The exposed black pipes on the high ceiling gave it a warehouse feel. There are televisions situated along the walls, but they were not blaring and were quite subtle.  The lunch menu was really good.  I had a cup of tomato basil soup and then a salad that I was able to build myself with the vast array of ingredients listed on the menu. The portion was HUGE and I brought at least half of it home for dinner.  They do not skimp on portion sizes!  When I did my Yelp check-in, there was a 20% discount that popped up on my phone.  This is always a nice Yelper's perk, when it pops up.   Service was very friendly. The bill was reasonable.  The tea was really good: the best I've had in quite awhile.  It was a great experience and if the roads take you to Indian Trail, find THE TRAIL HOUSE.  You won't be hungry or disappointed when you leave.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "4XDUzRM3nRMP4A8bUi3o5A",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4XDUzRM3nRMP4A8bUi3o5A/o.jpg"
      },
      {
        "img_id": "0vcjHCyrXsKvbMHZ4k0qRQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0vcjHCyrXsKvbMHZ4k0qRQ/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "ECVaBxD8uMdzOc_BH8puxQ": {
    "date": "5/2/2019",
    "text": "If I could give 0 stars here I would! The service is a joke nothing is ever consistent & the owner Jason doesn't give 2 hoots about his customers or the customer service save  your money go where it's consistent & your money is appreciated!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gtTakxNlTM2sod3j2Ja7Kw",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Brussel Sprouts",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/gtTakxNlTM2sod3j2Ja7Kw/o.jpg"
      }
    ],
    "user_id": "hYrP80B1UM8Xfx1fYRpWtg"
  },
  "MG4hotUODz5DcBRKRAhsRA": {
    "date": "7/2/2019",
    "text": "Attention to details.  Ordered Onion Rings and a 3 slider plate.  Slider plate included pulled pork, meatloaf and fried chicken sliders.  The pulled pork and meatloaf were excellent the fried chicken was ok but nothing special.  Overall restaurant well decorated great back patio and inside bar space  Will definitely return",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kwGk8s6epGCDnRjf2WLUAw"
  },
  "Ho7O6F0Y1qQAF3tB_SPh0A": {
    "date": "7/9/2019",
    "text": "The food is good, not excellent. The service is usually slow and inattentive. I've been 4 times. They were consistent in their behaviors each time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FBy9pZwDLUoSQjnOIEDdEw"
  },
  "QnHlPsGaqjrRjOJ9r68YZw": {
    "date": "2/9/2019",
    "text": "Stopped in for a quick lunch with my husband today.    We were seated quickly by friendly staff,  and our order was taken within a few minutes.  I ordered the spinach salad with a side of asparagus. My husband had the avocado shrimp salad with a crab cake on the side. Delicious! We were very happy with our choices and left with full bellies.  The large salad is no joke - it's enough for two people to share.  So if you're wanting to sample some of the other menu items,  get a 1/2 order.    Special thanks to manager Rhonda,  who came over to welcome us \"first timers\". I can see why our local friends spend so much time here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q1V9bDJQUCT23dr5W3snAA"
  },
  "zITUpXCn1RSpDs2JwQIR5w": {
    "date": "7/4/2019",
    "text": "I went there for the wings with my mom since we haven't found a wing spot since moving to NC. They weren't bad and the drink weren't bad. I would go back again to try some other items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-grUL5gXe4XqzMdPzx827g"
  },
  "jWCh06poH75o-K5-VwdJaA": {
    "date": "2/24/2019",
    "text": "Ughhhhhh I got some calamari from here and it tasted like grease. It literally tasted like grease. I didn't eat it. Won't be here again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Ueouw2ZBwA_br7yfvkggPA"
  },
  "IYzVlwuT0n2qmlcDyP-Q3Q": {
    "date": "5/20/2019",
    "text": "GREAT SERVICE!!! Miller took care of all of the cornhole players on Monday night which is not only A LOT OF WORK but she had to keep from getting hit with bags. VERY MUCH appreciated! Will be back for Monday night cornhole. The manager Ronda took the time to come out and speak with us. Love great service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mGTfIhwFXPWGH9PQXn1CmQ"
  },
  "Fgy7Ar8Dncg6HDq1-w6jkg": {
    "date": "3/15/2019",
    "text": "My niece and I enjoyed a delicious dinner at the Trail House. Wonderful food and friendly staff made this a new find that I will definitely be returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2UuaDZuSbkHObSWzNaMfrg",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Yummy tacos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2UuaDZuSbkHObSWzNaMfrg/o.jpg"
      }
    ],
    "user_id": "qg_Ls59ZmjG-C0WGTUnmUg"
  },
  "dOek4AerZAMeh0OZ0rS2hg": {
    "date": "2/22/2019",
    "text": "Me and my wife decided to stop in for dinner on Friday night, We were greeted and seated quickly. Our waitress was friendly. The menu had a pretty good variety of items to choose from. I had the Trail house grilled cheese and my wife had the swiss pattie melt, both were really good. We would like to go back and try their outdoor area. All in all a pleasant experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_FaqYgC7aKWMKlCBxuy9QA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_FaqYgC7aKWMKlCBxuy9QA/o.jpg"
      },
      {
        "img_id": "9CXUW2E_15pKJgSJGQ_40w",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9CXUW2E_15pKJgSJGQ_40w/o.jpg"
      },
      {
        "img_id": "qTO__ChZ4nV6OwPxly96iA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qTO__ChZ4nV6OwPxly96iA/o.jpg"
      }
    ],
    "user_id": "G_w7L1Wy1Zfna7G7kfmGAw"
  },
  "K1EQwfDLPKsJzw3_CmEysA": {
    "date": "4/28/2018",
    "text": "I really liked this spot.  You don't see many like it in IT! Good food, beer selection and tvs/ambiance!   The philly steak egg rolls were fantastic! The perfect appetizer.  I got the \"monroe meatloaf\" for entree. It's not that it was bad, i just have a super high standard for meatloaf (See \"Dish).  I will say, the sauce on it was tasty and the mashed potatoes were very good. I got the onion rings as my second side and they were above average rings.  I look forward to trying other menu items!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tXuJ_x4BdCjuA7XinG6GHQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Steak and Cheese Egg Rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tXuJ_x4BdCjuA7XinG6GHQ/o.jpg"
      },
      {
        "img_id": "0u3gItLBOzMGExMYij48GQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Monroe Meatloaf",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0u3gItLBOzMGExMYij48GQ/o.jpg"
      }
    ],
    "user_id": "nap5CM2nZvaFodByvUL75w"
  },
  "dzNDDDUttDRS2FebTN_wig": {
    "date": "10/2/2018",
    "text": "Came here recently to try a new local place. First impressions - place is very clean and inviting. We were promptly seated and the good service continued through-out the time we were there.  Food selection is quite good. Spouse had the fish'n'chips while I enjoyed pesto primavera pasta. The pesto sauce could have been a little more, but that's just me. I sampled the fish'n'chips and they were very good as well, crisp and not over-cooked.  Pricing is very reasonable. Family friendly and great service.  We will definitely be back to try other entrees!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TsKeGaVVmS2lS6bks5ZLw"
  },
  "cI3Ok3orOYsqBXwVAbIolw": {
    "date": "10/9/2016",
    "text": "The high rating is largely due to the excellent service from our waitress Casey and also how quick our food came out. We only ordered salads and chips and salsa, but they were great. But the food was at our table quicker than I usually get McDonald's fries  (for my kids of course). We'll definitely be going back with larger appetites.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBnsc05Mp-x8a8lwGHhXnQ"
  },
  "NIEHy9NFoFlknBFkZrbKHw": {
    "date": "9/5/2015",
    "text": "I gave this place a bad review this past Sat due to the terrible service that I received. We waited 15 minutes and no one came to our table. Don't waste your time and money. So disappointed.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bkZLiczbYmrAsMLq1yx1Ig"
  },
  "roPcgQkRFTn4aIgJX72z-w": {
    "date": "8/26/2015",
    "text": "This is a bar atmosphere so expect that when you come here. Food is better than average and if choosing between this place an other nearby bar type restaurants come here for sure. Probably a good place for an after work get together or going out with friends. Quiet during the weekday but expect the weekend brings more \"party\" crowd.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Q3GXJ9ApNhzMvSzZxkhoMA",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Lobster corn dog",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Q3GXJ9ApNhzMvSzZxkhoMA/o.jpg"
      },
      {
        "img_id": "RKCd57DnBvl7s1Na_IhAZQ",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Ahi tuna with roasted veggies and risotto",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/RKCd57DnBvl7s1Na_IhAZQ/o.jpg"
      },
      {
        "img_id": "vQZOAjnjHYnNz4F8SSRIcg",
        "caption": "Photo of The Trail House - Indian Trail, NC, United States. Bacon burger with waffle fries",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vQZOAjnjHYnNz4F8SSRIcg/o.jpg"
      }
    ],
    "user_id": "geWyE6uU5GCwNcmEhTTyLQ"
  },
  "auGMfXl781h0W8WvZHeA6g": {
    "date": "12/31/2015",
    "text": "NEVER, NEVER, NEVER make a group reservation at the Trail House in Indian Trail.  We made our New Year's Eve Group Reservation several weeks ago.  We were to have the \"Party Room\" for 20 people.  The original reservation was made by phone and confirmed by phone a few days later.  We also went to the restaurant about three weeks ago, had dinner, and reconfirmed the reservation again.  This week, I once AGAIN confirmed the reservation when I called to see if we could still order off of the regular menu instead of ordering their \"New Year's Eve Package\"  that was advertised on their website.  Upon arrival tonight, we were really shocked to find another group of people occupying the \"party room\".  They, too, had made reservations for the same time frame.  If I could give \"zero\" stars as a rating, I certainly would!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vR6SlYLSeEJdgDBzI9Ww-Q"
  },
  "jh2UIaN1sN8ssae3fn5g8w": {
    "date": "7/15/2017",
    "text": "So I have not been in this place in a few weeks...mainly because of two female bartenders they have there. They are younger of course and it shows....the most unattentive employees I've seen. One stays in a corner always talking to certain group of people not paying attention to anyone else....thats quite unprofessional. The other one just walked past you and doesn't even sees you having an empty glass. Seriously girls this is your job. My wife convinced me to go back because of someone she met there. I can't remember the guys name but he said to call him Jay. Let me tell you this guy is impressive, he pays attention to everyone no matter what, no matter what he's doing. That surprised me a lot because he looks like he belongs in a gym half the time, but he's an awesome bartender. Ask for Jay when you sit at the bar. If I could give Jay 5 stars I would but those 2 girls make the place a 1 star.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qwTaQpurpzhpvdGNu5ntAw"
  },
  "2Oinwck3GcexTaoL_6ID_w": {
    "date": "6/6/2016",
    "text": "There are not many good restaurant options in Indian Trail, but I'm so glad we have The Trail House.  I eat there at least once a week and the food is always great.  Tonight I had the Blackened Salmon with tempura asparagus over quinoa rice with a teriyaki glaze.  Reasonably priced at $16.95.  Amazing!  It's so nice to have a restaurant that isn't part of a chain.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zM7YnBoD62Iwwg3K5GrKsQ"
  },
  "k6GDgFNYft0Ra1BkaA6r3Q": {
    "date": "2/13/2016",
    "text": "If I could give it zero, I WOULD. My wife and I used to love this place. The service has always been hit or miss even when it was Bonfire, but the food was good enough to make up for it. Oh how things have changed. My wife is the one who encouraged me to write this review (I have never writen a review before) so here it goes. We ordered take out and were told it would be ready in 20 to 30 mins. I arrived there roughly 25 minutes after I called. I paid for my order and waited. And waited. And waited some more. Finally after not being acknowledged by anyone for 20 minutes I asked what appeared to be one of the managers approximately how much longer it was going to be because I had somewhere I needed to be. His response was it is done and I will get it bagged up for you. about 10 minutes later a guy comes and says here is your take out.....No \"sorry for it taking an hour when we said it would take half that time or less\"....just \"here's your order\".  All that I could get over, and still probably eat there again. What made me swear off this place and write this was the quality of the food after getting it. First the order was not right. I asked for tater tots and got fries. Second, all of the food was soggy and cold (I was eating it within 5 mins of them handing it to me so it was not from the ride home). The appetizer was so bad we did not even eat it...it was supposed to be fried pickles, but we got a handful of cold soggy breaded pickles.  All that said, if you are reading this you probably think I'm some privileged snobby patron. I know I would if I was reading a review like this. The fact is I am not. I have worked in the service industry and my wife still does and the service I received was appalling and for that reason you have lost my business.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qk0TTuh5dPL0qZ0YpLKcqQ"
  },
  "BdtZp5i1nOSuJT7EPN2D9g": {
    "date": "4/15/2016",
    "text": "Horrible food, horrible service. Management not professional at all as I sat there at my table while management was taking shots at the bar. Food is always different I never know what to expect. I went once bad experience decided to give another shot an was disappointed again. There are much better places such as Hickory tavern, way more professional. I don't see this place lasting very long. I always hear waitresses and bartenders complain of working there. Never will I go again. STEP YOUR GAME UP TRAIL HOUSE.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ka5GFjAB6tvEQIAMrvcYsQ"
  },
  "IC72LcZi93-oJZZniqPAtw": {
    "date": "10/17/2015",
    "text": "Very nice decor, had the burger.. it was really good.. band was excellent.. saw they even had the lead singer from Boston in there playn.. wow! Will be back soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l2BmvpyChw1wWd6-5-ODIg"
  },
  "IK_R-tpntW1OBqQ_lCaRrw": {
    "date": "10/26/2015",
    "text": "Great food! Great atmosphere! They also have great entertainment during the week and on weekends! All around great new restaurant and staff is super nice!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JsrqeKPOPpS8ouVX8uUc0w"
  },
  "C2MOWcwcU8UPKUQhxq2qlQ": {
    "date": "9/5/2015",
    "text": "I found this place on yelp. My potato soup was cold, my pork chops were very over cooked and my order was wrong. I'm batting a thousand here.  Also I want to leave but my waitress disappeared   So I guess we're both having a bad day",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mXrU36gul25A79snE3XFCQ"
  },
  "dET4VFtZkDBhVTd4DOOocA": {
    "date": "6/12/2016",
    "text": "This was my first visit. It took about 5 minutes before anyone approached the host stand. My server was awesome! He had a great personality and was good at what he does. I ordered the Trail House Pasta, and it was DELICIOUS! However, the pasta was extremely overcooked. It would slide off the fork and it fell apart every time I picked it up. The sauce also seemed a little thin. I will definitely try it again.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DD0TVS8vy5dV8DSt4uK_Yg"
  },
  "m97umuAWMApJvJWqiLVaiA": {
    "date": "3/16/2017",
    "text": "Great place for dinner and drinks! Love coming for music late night and coming right back for there Sunday brunch! If I could give more stars I would!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WkfWMHTLq6qCPrWl2gO9Wg"
  },
  "tAYlpQ7r3NEEzKshGmrfrQ": {
    "date": "5/5/2018",
    "text": "So sad that the service was so bad because the food was amazing! We had the dip trio and cocktails and really loved both. Took a to go order of sliders home. And even warmed up later they were amazing. BUT we visited on a Saturday afternoon. It was quiet, only maybe 4 tables seated and people around the bar, which in this busy part of town is exciting for a pretty Saturday when everyone was out and about. Problem started when we walked in the door and literally NO ONE even looked at us. No host. No waiter. NO ONE. Right as we were about to head back out of the door someone got up from the bar, the poor guy said he was off but would seat us. Definitely not his fault that the people on the clock couldn't be bothered, I greatly appreciated him! We asked to be seated on the patio, which was picnic tables. Our waiter seemed very new. The beer menu didn't list specific beers available, only rotating, so when asked he had no clue what was on tap. We chose to order cocktails and an appetizer. Both were really good. Except when he brought our appetizer we have no silverware or napkins. We asked for those and he came back after 2 requests 20 mins later. So we enjoyed our drinks while staring at yummy food that we couldn't eat. We were there for almost 2 hours sitting next to a table that no one ever bothered to clean. For 2 hours! Sad to write a review like this because the food was so so good. Maybe next time we opt for takeout!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I7jjPRt23pQhYVB1sSwLag"
  },
  "XhxIlBeS4ycH21c2TzPgaw": {
    "date": "11/13/2016",
    "text": "Fun place to watch UFC. Been here a few times with my wife and kids. A few times by myself.  The staff is pretty and sort of friendly. The food is okay, standard bar food fare. I have had the Trail House grilled cheese, which consists of pulled bbq pork and macaroni and cheese between Texas toast. Always delicious and more than I can handle. @sfigz",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S9zvJ_S8ZNYgcOObb6m2SQ"
  },
  "orR0HBHHYCSZF-JOF48rqA": {
    "date": "7/26/2017",
    "text": "I was really looking forward to this. It wasn't terrible but wasn't great either. Was definitely less than expected. The Brussel sprouts app was the best thing we had in our 3 course meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OMoCMxdgtXEn7RzhTmde5A"
  },
  "2tZpSFSZp3mvktT7wL4UOQ": {
    "date": "10/22/2015",
    "text": "Since the new owners took over the trail house has become one of my favorite places to eat and hang out. The bartenders are friendly and knowledgeable and the wait staff is prompt and always smiling. Would definitely recommend if your looking for a great local place with great food and a fun atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "T6AfW17AzhPn0mj1QR67mA"
  },
  "zgO0t-qlVnsnL8YoylAyYw": {
    "date": "9/10/2015",
    "text": "Nasty disgusting place!  Our waitress was nice and apologetic. It wasn't her fault our patty melt was charcoal and my sliders were flavorless and gross. Fake chicken!!!! This place will always be Bonfire. I don't care how many coats of paint you put on the wall or how many times you change the name.  Don't go. Overpriced and gross",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "_ESYv1XKS-bFTFCQI0X86A"
  },
  "FsU0botO-6J5UDvbE231yg": {
    "date": "9/26/2015",
    "text": "Was really exited to try this place after hearing good things and the menu looked amazing. Was really disappointed. Wasn't bad, just seemed like reheated cheap food. The server didn't seem to have a clue on the beer or food offered either.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VXQkBxGcrjnzlKi_x4mkRA"
  },
  "YwflDeXSLDn9Gj1MeyhWAw": {
    "date": "2/28/2016",
    "text": "We have been here for dinner 2 weeks in a row. I am excited to have this option in Indian Trail as I am not a fan of chain restaurants as my only food option! I just want this place to step it up though or people wont return!  Last week we started with the lobster corndogs. Definitely not worth the money! You get 3 corndogs for $11 and it mainly tasted like breading. Then, I had the Chicken avocado wrap- it was BORING! Add some flavor to this wrap would make it better!  Last night, I was really not impressed when the other 3 people at our table received their hot dishes and my salad didn't show up until 10 minutes later. The server ignored me instead of doing something about this! Unacceptable! The salad was very good when it finally got to the table.  Also, they have trail mix which is cool but you have to ask for it! Why is that??!!!  Great drink selection.  Will go back and hope for better service!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oxnj45lwk_LUiQ6pUKd63A"
  },
  "a9qJJmU7joX2M68l-aJyeg": {
    "date": "2/19/2016",
    "text": "First time here but I have to say I will definitely be back.   We had the lobster 'corn dogs',  a salmon special,  and a great ribeye steak with lobster 2x baked potato and creamed spinach.   My son had boneless wings and Tots loved them.   Great place, great drink specials.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "815EabQChhaNDIVzJY8-jQ"
  },
  "qabKVVRqfQJvgz0wx1uWEw": {
    "date": "8/31/2015",
    "text": "Finally! We finally have a great bar to go to that isn't super expensive and has great service and food. I was excited when hickory tavern came into town, then they jacked up their prices, portions and menu shrunk, and the service is terrible. When I saw that The Trail House was opening I had some hope. This was my second visit today and it was awesome. Your immediately greeted by an attractive and pleasant hostess. Our waitress was knowledgable about the menu and super nice. The ambience is very chill and nice warm earth tone colors that makes you feel at home. There is TV's everywhere and this would be a great place to watch some football this season. They have great specials each day, the first time I came they had $3 craft beer drafts, awesome.. The crab cake corn dogs are delicious. To sum it up, this is my only hang out in Indian Trail now, hickory tavern, you guys should be scared ;)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JXBOsuS4wIIRqgBWwA4-zA"
  },
  "PeZyT7hLAKpYG4V9tfMiYg": {
    "date": "6/13/2017",
    "text": "Delicious $3 Bloody Mary's on Sundays!!!  Nice atmosphere and A LOT of TVs!!  They also have a nice private room for private parties!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RoeyA0uFF0iAd7xbe6fcgQ"
  },
  "iqnlNLWn9U5n9rWwIZw9Rw": {
    "date": "11/27/2015",
    "text": "Gave this place a try on a Friday for lunch. Menu had a good variety of American grill type fare including a build your own salad option and fried pickles. Lots of salad options as well as tacos choices. Staff was ok but it seemed like they were overstepping one another at our table. I ordered the sliders including beef tips, chicken, and beef burger and a side salad. My husband ordered the fish tacos. He liked his although the menu said shredded lettuce and instead it was a coleslaw type mixture. The beef tips slider was flavorful but the chicken breast, burger, and salad were just ok. There was 80s/90s music playing and the tvs were on relevant channels. The menu will bring me back to try something different and see if the food and service improves. The manager/could be owner walked by several times but never stopped and chatted with us which was disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6IkA9QddLGlX0XlAEMmlZg"
  },
  "WlnR72n70X62kezQQVp5iA": {
    "date": "4/9/2017",
    "text": "So, today, I went to get their Sunday brunch buffet. All I can say is \" wow, did that just take me to flavortown?\" To answer my own question, I respond with a huge \"OH DALE YEA.\" The selection graced every inch of my pallet and food soul imaginable. Definitely a 10/10. This service was remarkable and the chef working the omelet station, I think his name was Carl or Kyle, knew how to flip the omelet with precision and ease. It was as if his hands were crafted by JC himself. Moreover, as I am writing, I can't help but wanting to make a reservation for however many Sunday's are left in my lifetime. Man, this place is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DDmmtgaH4Pjv3twsCooH6g"
  },
  "Y1jzo8iw4ApRzWL6zAtA-g": {
    "date": "9/14/2015",
    "text": "We went to The Trail House Saturday 9/12 for dinner.  We were seated immediately , but waited over 10 minutes for the waitress to stop by and take our drink orders. We had the lobster corn dogs as an appetizer. Everyone really enjoyed them. The sauce that comes with them was really tasty as well. I had the blackened salmon. It was absolutely delicious, as were the tempura asparagus and quinoa rice that came with it. After we were finished eating it took the waitress about 10 minutes to clear our plates and another 15 minutes to bring the check. My dad and husband sat through half of our meal without a drink refill. The food was wonderful. I just wish the service matched. We'll give it another try because the food was so impressive, but they need to better train their staff to be more attentive, and much quicker.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NDdGbirIVz8p9B_nrhYuwg"
  },
  "AMli0gVAw9el8kVxrRhurA": {
    "date": "11/20/2015",
    "text": "We had excellent service provided by our server, Amanda! The food was good...not fantastic, but good. We received all of our food and drinks in a timely manner. We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBmWPwOEGVwzQRqTA7Igrg"
  },
  "EAZ4Fd-bZQpMpGAtUt35Ew": {
    "date": "1/8/2016",
    "text": "Great food great restaurant. I went and ordered fish tacos and the sliders. Each slider was a different style I had a cheese burger, rib meat with slaw, and crispy pork belly with cabbage. All were good but the rib meat didn't wow me. The fish taco was tilapia chipotle Pico de Gallo and cabbage. Will be coming back soon",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0a0baaY7fggfvEaLZDWIOA"
  },
  "IVxfdyH588grpAP0jl7Z9A": {
    "date": "9/20/2015",
    "text": "Great service and awesome food! The atmosphere is perfect for watching games and enjoying company. The Sunday brunch was one of the highlights. Will definitely be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6OGcRYd4mcO8mfG4ox4xCQ"
  },
  "DM2pQEthcRFZftf3BSUr0A": {
    "date": "9/12/2015",
    "text": "We had the best experience with our server Chris! He was hilarious but also very attentive.... I really wanted to sit at the bar but settling for Chris was second best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kHe3c52--umaOXMtIhPWsQ"
  },
  "wVEhxZcIS-LGCcvCHT62Ig": {
    "date": "9/7/2016",
    "text": "Awful ... Lipstick on my beer glass, burger had patches of red for well done and service was ok at best. Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IYmKxuAnPDU9L83702iUQw"
  }
}