{
  "JdQJhnFOa3utaQdeR2p5Fg": {
    "date": "9/24/2014",
    "text": "Honestly I don't know why this place has only 3 stars. The pizza is great! I read the other reviews and even though they were giving 3 stars the actual review wasn't that negative so I decided to try it anyway. This pizza place is now my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ym3NIPTrDCMjjyfsWEjrjA"
  },
  "0yCG8LdLOSMIAdm32l7I0w": {
    "date": "7/1/2012",
    "text": "Excellent menu, intelligent and courteous staff, pleasant ambiance. The only thing I'd change/add is turn the closed captioning on on the TVs. My wife and I go there nearly every Friday and the folks know our order as we enter the room. It is not quite the 'place where everyone knows your name,' but it's close...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fzpdY4Y5L9hCW_e1URjAcA"
  },
  "mBEpYlbyzb1bYzcNVxsDIA": {
    "date": "7/5/2014",
    "text": "Positive:  we asked for crispy and it was perfectly cooked slightly brown top and crisp crust.  Service is nice, atmosphere is the same.  Surprising beer selection as well.  Topping were good quality. Negative:  we ordered meatball on half as a topping and there wasn't nearly enough on the pizza, a couple of slices in just that half had none.  The price on the ad board for a supreme pizza in the restaurant was less than what I paid for 2 and a half toppings.  I dislike restaurants that have an inconsistent pricing scheme or require that you ask for a price in order to get it and then you see the advertisement when you walk in.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VFP5b5ZXPHmtiFjD-Kftiw"
  },
  "IvicVj55YSWm5Jbyfuz4dw": {
    "date": "12/10/2011",
    "text": "Couldn't find a clean table out of 7 open tables. Pizza wasn't bad but we won't be returning. Soda fountain was very sticky from old spilled  soda.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "Fj6Ot9LKMzDmOYWQ2pt6cw"
  },
  "qNRzfUDbuzP2Ek6pM7UycQ": {
    "date": "3/2/2012",
    "text": "This place was just ok. The  barbalo wings are good.the sandwiches are horrible. I ordered 6 wings an got two celery <a href=\"/redir?url=http%3A%2F%2Fsticks.wtf&s=3c36cda19dfca7d77fc101d175fcc150f5368ae4f875f8d7ac63489424da28e0\" target=\"_blank\" rel=\"nofollow\">sticks.wtf</a> Very skimpy.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ifZh_oEWxd05Ci_RQVoL9Q"
  },
  "IfzlSrxMgak2f8CU2PTPdA": {
    "date": "3/30/2013",
    "text": "Delicious pizza. I have been here for lunch many times, and had the personal pizza. Speaker system playing the music is low quality and at a high volume, which was annoying on my last visit. But the food is always good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vX8_eMroanoIPPKQbFrSrw"
  },
  "HstgcU97vOcz70ISLwrGTg": {
    "date": "6/9/2012",
    "text": "Farley's Pizzeria in University City (Arbors) is fantastic. I've never ordered delivery because I live around the corner. Ordering online for pickup is super quick and easy. My order is always hot, right and ready. Delicious pizza and strombolis. The pizza crust is especially tasty.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ItJr03gDxko24r_be5xQhA"
  },
  "vep7b3D3Suv1QSebg8495g": {
    "date": "3/26/2016",
    "text": "The food is always pretty decent. However, the customer service is SEVERELY lacking. I've ordered 3 times, each time there's been an issue.  I'm over Farley's now, won't be eating there ever again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "wDSSc372JrEypPHTeKu4oQ"
  },
  "quJRVkRusNxV4wcg0UP4MQ": {
    "date": "8/10/2014",
    "text": "Build your own pizza is great, especially since my fiance and I are total opposites...veggie vs meat lovers.  They have plenty of topping choices, fast and quick service too.  If you are not in the mood for pizza, they have pasta and salad choices as well on the menu.  Pricing is reasonable.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "BphsNVzYVMkE4dhbon-gYA": {
    "date": "12/29/2013",
    "text": "Stopped by for a quick lunch, hoping they had pizza by the slice. No pizza by the slices here.  We ordered a thin crust chicken barbalo pizza. It took quite some time to get the pizza out, kinda kaboshing the \"quick lunch\" idea. However, the flavor was really yummy. Sweet and spicy -- very unique.   If I'm ever in the area and have time to wait, I would eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1h1jY5LlCp13AOVPXP93g"
  },
  "_VrDjkaJIuEIXy7DpoyU9w": {
    "date": "11/12/2015",
    "text": "I've only had their wings and pasta so far and it's delicious . I swear the breadsticks are better than Olive Garden .The prices fit my budget . The staff is helpful and kind and the dining room is always clean . Love this place !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0LzaaoQ4zsxr8M-yp3yAKQ"
  },
  "lnpXQO32KygqSSoKMYSx8g": {
    "date": "4/14/2017",
    "text": "Jason is THE MAN. I was unhappy with a previous order and the response I had received. Jason went above and beyond to make this right and win me back as a customer  - he succeeded in doing both!! The food here is delicious and the service is spectacular. Thank you Jason!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PnI4DM8Y7b8AQcUP0DrJ9Q"
  },
  "DeF5rfxnanZF-BOLl-ZuCA": {
    "date": "6/14/2015",
    "text": "I came here with my three kids on a Sunday about 4:30pm. Empty restaurant was to be expected, but the condition of it and the bathrooms wasn't. I has to clean the high chair before putting my child in it, it literally had pizza and food caked in the seat. I even tried to swap it out.. The other seat was even worse! I ordered pasta for myself and a pizza for my kids. The wait wasn't too long, however the kitchen carried on a conversation that involved profanity. Which my children could overhear in the empty restaurants. There was a girl wrapping brownies that kept licking her fingers. My food came out with the wrong sauce and cold broccoli on the pasta. There wasn't a genuine concern over the mistake. I sucked it up and just asked for a side of the suave I ordered and she said it would take about ten minutes to melt the cheese. TEN MINUTES? Are you using a candle to melt it? I finally had enough when I heard \"Holy S!*%\" come loudly and clearly from the kitchen. The manager \"Chris\" listened to me. He said I'm sorry. But that was it. I told him in no uncertain terms that I would not be back. He walked back in to the kitchen. The end.  There are simply too many other places that are Clean and efficient for me to waste another dime here.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "iIR5Qr914wg2m2vppl996w"
  },
  "LxF9GB9HsQZQEFRPkgtmWQ": {
    "date": "7/20/2011",
    "text": "Went here for lunch with co-workers.  There's a pretty big menu aside from pizza here.  They offer wings, hot sandwiches, cold sandwiches, and pasta among their many offerings.    I decided to try their chicken philly hot sub and a drink combo for $5.....  with tax, it comes out to $5.46....   you can't beat that.  There was a bit of a wait for the hot sub and when it came out, the cheese was nice and hot, but the chicken wasn't.  Still a decent sandwich despite the odd temperatures of the fillings.  Staff was friendly... there are 2 registers up front so there can be a big line when the lunch rush hits.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "l5P2J0M_U3dp7o27azoW8w": {
    "date": "6/11/2014",
    "text": "The staff was friendly. We ordered medium sauce on our wings and the NY hand tossed pizza. They don't offer a military discount or student discount (We didn't ask for a student discount they just offered that info).  The pizza was tasty but they are skimpy/stingy with the vegetable toppings. The wings weren't spicy at all. It was okay for our first pizza joint in N.C.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bz-apFR279TMIlDFPKE_kQ"
  },
  "bVue8z1e1iFEQt4xqYmZXQ": {
    "date": "2/20/2016",
    "text": "Ordered delivery and not impressed. We ordered 2 subs and wings and it was nothing at all to brag about. Maybe we will try the pizza next time but if your hungry I do not suggest the subs",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j9nZX6Ib0ILpvNAL7GoVnw"
  },
  "nsMgKElQmIUjvm_bOZGKYQ": {
    "date": "11/21/2016",
    "text": "First time, we both had a Stromboli, nicely browned with lots of stuff inside. Will be back, service was good. We were the first customer of the day.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AOBfqfNw9wwYwHZJ5Ov8Yw"
  },
  "U2p8LpJQEL75HQsbM42--g": {
    "date": "6/29/2016",
    "text": "Finally a good pizza place. This place was terrific. I ordered their Margarita pizza and wings.......yummo. On top of the food being delicious, they provided excellent customer service. Their manager is fun, which that will always trickle down to your employees. I will always be a customer of theirs. Fantastic job!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "7VVLHIxJPP6_yREVf444sg"
  },
  "QCeDn3thaLHCs0y0gDYMYg": {
    "date": "10/2/2012",
    "text": "Great food.  This is where our family gets its pizza now.  They're right at the entrance to our subdivision and even within walking distance.  No need for pizza delivery, we can just call ahead and pick it up as needed.    The Barbalo pizza and barbalo wings are my biggest favorites, but even the plain old cheese pizza (for the kids) makes for a happy family.  Very friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "vw5dN6jOIpdni5WfdRc0Ig"
  },
  "WlSdtOzhUEUMIV5vtxhkUA": {
    "date": "4/21/2015",
    "text": "Some of the best pizza I have ever had. They don't advertise as being New York style (at least not that I saw), but I felt like I was eating a pizza in the Big Apple. Everything I have had from here has been phenomenal, including a meatball sub (I'm really picky when it comes to my subs). I have definitely found a new favourite restaurant in Charlotte! I'm lucky to have a place like this so close!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "daY41SPZR7GtXOdG_1Kocw"
  },
  "ghT5x5D9cBWhvb5Qx5hP6g": {
    "date": "8/17/2015",
    "text": "After ordering their pizza again,  I would have to stand corrected about my previous review. They are definitely consistent with their quality. They definitely rank above a pizza Hut or a domino's when it comes to quality. I still wish that their slices would be a little bit bigger, but I will be honest, I try not to miss it too much, as the pizza is actually pretty good. They have made a regular orderer out of me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTz4RTiI06ySru20pfD_mg"
  },
  "tQ1kWsevEhLnFOJRiHRB6Q": {
    "date": "2/1/2015",
    "text": "Since moving to Concord, this is by far the worst pizza I have had to date.  To start with anything called the Gutbuster should not be sparsely topped.  Second get the toppings correct and put them all on there.  Crust had  the texture of cardboard.  Ok, I picked a bad time to go, but this performance deserves no second chances.  Recommending Tony Sacco at the Mall, Lubrano's on 29 and Brooklyn's as far better and well deserved choices.  Yea, and the wings, Garlic and Parmesan had absolutely no flavor, beyond the chicken it was.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cxjgthNSCOpoUVRp-ZPrew"
  },
  "ArFdoly4o52ORVbehRolQw": {
    "date": "8/27/2015",
    "text": "This was my second trip to Farley's and I brought my 22yo daughter along for company. Last time I created my own pasta dishes with penne, spicy creamy tomato sauce, and broccoli. It was outstanding! Next time I will add meat to it and maybe trade the broccoli for spinach. This time, my daughter ordered a stromboli and I ordered a personal black and blue pizza. I think that is one of the best pizzas I've ever had. The crust is perfect blend of flavor and crunch and it was covered in Parmesan cheese, balsamic glaze, spinach, steak, and garlic sauce. I will definitely go again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BaNkpjscB9iM4FCHjI0oAA"
  },
  "1HMgNAnZ6yrv52xqw4Asww": {
    "date": "10/6/2011",
    "text": "Love this place!  Try to go here at least once a week to get thier calzones.  They are addicting and i can't get away from them, to try anything else!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "y5QfAKgk-_DUArxx0EiYRw"
  },
  "MUfziKzenksn6F34yYwwPQ": {
    "date": "6/7/2016",
    "text": "Smiles and Great food. Came in and was immediately welcomed. I Ordered at the counter and noticed local craft beers. The pizza was made with my wife's unusual toppings of olives and anchovies. It was so tasty! I noticed a good crowd and the music was good. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ru0WZNrPGeowR3UhiaSWBw"
  },
  "yZNYtmdScH_EoQfBtvt-dg": {
    "date": "6/11/2011",
    "text": "Three coworkers and I had our \"Friday Fun Lunch\" here yesterday, and we were all very pleased.  It's quick-service style-- you order at a counter, pay, then when your food is ready your number is called.  There are several lunch specials which are a great bargain-- I got the calzone special which came with a drink (and 2 toppings for the calzone) plus I added a side garden salad.  It was plenty of food and the total was less than $8.00.  The calzone came out nice and hot, with crispy crust (bottom crust, too!) and the fillings (I got pepperoni & onion) were tasty.  The side salad was a nice size and everything was fresh-- no soggy lettuce here.  One of us ordered the cheese bread, which was pizza crust with lots of melted cheese and a side of marinara.  This stuff could be addictive!  The marinara (which also came with the calzone) tasted homemade to me.  Another friend ordered the baked tortellini, which she really liked.  It came with two fresh breadsticks, and it looked so good that I'm definitely going to try it soon.  The menu includes wings (both regular and boneless), salads, stromboli, pizzas (of course!), subs, pastas and desserts.  Our food came out in a reasonable amount of time, especially considering we ate at peak lunch time on a Friday.  The cutlery is plastic, which I don't mind considering the prices, but it is a bit difficult to cut through calzone crust with a plastic knife.  My friend's pasta was baked in and brought to the table in a metal take-out container, but I thought that was really a great idea-- she couldn't finish it, and all she had to do was go get a lid for it when we were ready to leave.  The only prices over $10 are for large and extra large pizzas, and they apparently offer delivery.  Lunch business yesterday was brisk, and we're definitely going to go back.  I'm hoping that they are very successful, because it's really convenient to our office and it's nice to have this option so close-by.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "1KdKknQGdSmcN_7AuCmZ4Q"
  },
  "qX8DJIhNz-BXv020IwxSeA": {
    "date": "10/11/2014",
    "text": "Fresh and flavorful pizza, clean and comfortable dining area, and reasonable prices. They also have a nice selection of local beers on draught. I would definitely come back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K75_wK8FjDacHdbyW8NTlA"
  },
  "te_APvT_YVVO77p29ApNGg": {
    "date": "11/11/2017",
    "text": "Pizza was on point. We ordered the Hawaiian pizza and loved it. The wings were deliciously crispy and flavorful. Love me some Farley's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pWk7BvGbwCXeN0Pex6skUQ"
  },
  "jO0RLjs0hliVHb4z3O2WLA": {
    "date": "12/29/2017",
    "text": "I liked this place and would recommend it often. But like others have commented, it is so inconsistent. Especially when you spend $25 including a tip and it's different then last time. Considering I always order the same \"craft your pasta\" I know what it can be when cooked properly. The whole meal came out tonight and was COLD! Not even slightly warm. The chicken that was also ordered clearly was not grilled because it had fry grease all over it and he had a chicken wing in his pasta! So gross. It was also fried for so long that it darkened and was not edible. It just comes down to pure laziness in my opinion. Which is unfortunate because I won't be back after tonight. The remake that the host had made clearly was just thrown in a microwave to \"warm up\" and was even nastier then the first one. Nice gesture and I appreciate the extra effort put in by her but it just was overall disappointing. I hope they are willing to train their employees for consistency, because that's what helps you in the long run! Lost me after tonight!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TvtmPuL716lAzJAbE4EpLw",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TvtmPuL716lAzJAbE4EpLw/o.jpg"
      }
    ],
    "user_id": "t6zcjbIxl8LqjMWmdrsqrg"
  },
  "LEjUykJof3r4j69JSDXeeQ": {
    "date": "7/21/2018",
    "text": "I was in the university area for business and stopped by for lunch, I have tried there Ballantyne location so I thought I would give it a try.   I got a crafted pasta which was amazing.    Shrimp were big and flavorful and the alfredo sauce was seasoned perfectly.   I was very impressed with the portions size on the pasta.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hElMBb2N5lLDG9iGZBUzRA"
  },
  "xKF8kXxcyk_TcR27v5YkSw": {
    "date": "6/12/2015",
    "text": "Do you want pasta? Wings? Subs? Pizza? Whatever you're lookibg for a casual quick dinner or lunch, Farley's at Arbors got it. And they taste good. The large pizzas go for $15 to $16 so two large pizzas with soft drinks would cost you about $35.  This area has a lot of homes with kids so you'll often see families with children and even grandparents parked here for dinner. Hacen't been for lunch so can't say. For guys who must watch sports while having dinner, yes there are a couple of big screen TVs for you as well.  You can also build your own of course. Oh, they just came out. One BBQ and one Garden! The Garden is the veggie version. Alright, digging in!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "G1K1kwDxLl58Cz6n30XN5w",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. The BBQ Chicken pizza I devoured with delight.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/G1K1kwDxLl58Cz6n30XN5w/o.jpg"
      }
    ],
    "user_id": "44aGjKTAg81bi9NtTqqhQw"
  },
  "qEWtLlQlfRwx8NsNHs2WSg": {
    "date": "11/8/2016",
    "text": "Tonight was my first time visiting Farley's Pizzeria. I started off with a Garden Salad with Caesar dressing and shared a large pizza 1/2 Garlic White 1/2 Hawaiian with my family. The customer service was awesome; the hostess working was always checking in on us and delivered our food quickly after we ordered. And the food was delicious! The pizza had a medium crust thickness and was cooked perfectly. I would highly recommended both kinds of pizza, especially the Garlic White! Lastly, the prices were very reasonable. We ordered three Garden Salads, three drinks and a large pizza for about $30 and had a $5 off coupon bringing our total to only $25! Will definitely be going back, maybe to try a calzone or sub next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "nDPHQelrloDP1kAUYaidUQ",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. 1/2 Garlic White &amp;amp; 1/2 Hawaiian at Farleys Pizzeria!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nDPHQelrloDP1kAUYaidUQ/o.jpg"
      }
    ],
    "user_id": "TlzQv20A--3ul_Tv9GwwGw"
  },
  "TOVwOB8VyemyNRNDH89sUw": {
    "date": "7/7/2017",
    "text": "Foods good but literally ordered two pizzas online at 8:18 said 20 minutes will be ready. It's now 9:00 still no pizza and they offered me a free drink for forgetting to make my Worked all day and very hungry wish I didn't get my hopes up for this one. Disappointed. Update next day -_-  Food was good large pizza was smushed in the box but at the end of the day still tastes the same.  Tried ordering for delivery to get a pizza and salad really quick.  Ordered pineapple personal pizza and a salad.  I get a call 25 minutes later.  \"Sorry we are out of pineapple\"  Ok green peppers and mushrooms then \"Sorry we are out of mushrooms\" Ok Italian sausage then \"Sorry we are out of that too\" Ok green peppers black olives and ... \"Sorry ma'am only two toppings\" What  whatever ok  \"Also we are out of eggs for your salad just letting you know  Ok fantastic that's great.   If you are taking someone here in a date I don't recommend it how can I have a bad experience two days IN A ROW. I'm not hard to please but I do give up on this place I'll stick with papa johns.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KfbhClWSm69YBjTZSFzmhg"
  },
  "n6rKnEDyV2U4cY0AzRTX0g": {
    "date": "6/19/2017",
    "text": "This place uses to be great. But we will not be ordering from them again. They delivered the wrong pizza and when we call to inform them they asked if we could come pick up the correct pizza. Well we ordered and paid for delivery because we didn't want to go out! So over an hour after they delivered the wrong pizza they finally showed up with a cold poor excuse for their New Yorker pizza on thin crust which of course is not what we ordered. We're done with this place.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "-p4G2IPUjmoj7qQA8g_mJQ"
  },
  "_C2wmJtwwDRyH2pr5xAywQ": {
    "date": "5/6/2017",
    "text": "First time visiting there I ordered a personal Gutbuster pizza and an ordered of the barbola wings it was great. I will return.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "bP5ewvQLbGUM2Y9cf6qJiw"
  },
  "hXI0xSRQT2_127VmF0xOMA": {
    "date": "4/29/2017",
    "text": "My family has ordered from Farley's a decent amount in the past, but will be taking a break from after this last order. They are the most inconsistent pizza places I've ever been. We ordered a pepperoni pizza well done, and received a pizza that was completely burnt on the bottom.. I guess they should change \"well done\" to \"burnt\" on their website if that is what that is what they consider well done. We also received two orders of breadsticks considerably burnt.. I was shocked someone would actually put that in a box and serve to your customers. Unfortunately this isn't the first time this has happened. My family will definitely be taking a break from Farleys, the price and quality of food we are receiving is not matching up.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gt-7BjrNVo29m_fPH8pscQ",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Burnt breadsticks",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gt-7BjrNVo29m_fPH8pscQ/o.jpg"
      }
    ],
    "user_id": "I4eQLLUMc2BcHZmbhjCFIA"
  },
  "Gsl0Q7OQapjs3rqjxB56wA": {
    "date": "10/1/2016",
    "text": "Service was very friendly. Great lunch specials with plenty of good affordable options. I decided to go with the create your own pasta combo: Fettuccini noodles, grilled chicken, broccoli and Alfredo sauce. It came with two bread sticks and a drink for about $8-9. The portions were large so the price seemed reasonable. We also ordered the personal pizza combo for about same price. My only complaint is I was halfway done with my food and the pizza was still not brought to the table. At some point the waitress realized that the person with me was sitting there with no food and went to grab the pizza. I think it was ready shortly after pasta, she just became distracted and forgot about us. She apologized, smiled and thanked us for coming as we were leaving so overall I am pleased with this visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q-qRBPMtX3_u5uotmIgOLg",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Pepperoni and green peppers personal pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/q-qRBPMtX3_u5uotmIgOLg/o.jpg"
      },
      {
        "img_id": "6Jx1dFIi6p1syryu6kJmzw",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6Jx1dFIi6p1syryu6kJmzw/o.jpg"
      },
      {
        "img_id": "l-7T1PTdSB3_Qx2amEq6Pw",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Grab a slice of homemade cake near register for about $2!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/l-7T1PTdSB3_Qx2amEq6Pw/o.jpg"
      }
    ],
    "user_id": "KuQ_W7Z6HSsBfmDuTWHE9Q"
  },
  "NYuIOB_ExV_W50VarLPong": {
    "date": "8/19/2017",
    "text": "Food is awesome and the buffalo salad is my favorite!! Will come back soon! Great staff as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N_9AOyU6aSXESi-nO8DmWw"
  },
  "O9nbQQN6kgfTbtrF1uoRZw": {
    "date": "11/17/2016",
    "text": "Done with this place.  It has slow gone from one of our favorites to beyond terrible over the past few years.  We keep saying \"never again\" but now we are over it. Not only did it take and hour and fifteen minutes for us to get our cold pizza but is was also wrong and had a HAIR- yes... a HAIR in it!! Not sure if it changed ownership at some point as we have had delivery since it came to the area but I'm done complaining to them directly.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_6gy1CGZjJ7JHwLIdZjYwA"
  },
  "yPwGWoOcWpe0-zj0xNmBXQ": {
    "date": "8/21/2015",
    "text": "This is our JOINT! We enjoy Farley's crafted pizza and wings pretty much every Friday night. Not only is the food on the spot, but the staff is cool and they really get to know their customers (I don't even have to give my name as Captain Awesome anymore, they know to put it on my receipt!). Add to that that they donate a percentage of sales on Friday night to my daughter's elementary school and you got a winning combination!   It's Friday night and it's 4:44pm, guess where I'm headed? Yep!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "EG8ub3qfHJGjjYA-gJHxng"
  },
  "9OOtgDc5z13gV-cUWBU3gg": {
    "date": "6/7/2017",
    "text": "Good pizza at an affordable price. Their buffalo chicken pizza is amazing but even their regular cheese is really good. I will warn you though: their pizza is pretty greasy but that's my guilty pleasure behind liking this place so much !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3ZlfhsGD1XMi1_S7iBZSmQ"
  },
  "KthxkGT-4dFm__PbOKyGvA": {
    "date": "12/12/2016",
    "text": "I had tried Farleys pizza in my office few weeks back and it was really good and ordered it for dinner. But guess what it wasn't that great this time plus my son puked 4 times through the night and me and my wife both had stomachache. We usually get Domino's or pappa johns and that's what we will stick with. Horrible pizza !!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RKlkj4XsZZs0z97gTBtQbw"
  },
  "pdIf5X-Wxdak4_RQzrg8bw": {
    "date": "7/9/2017",
    "text": "After delivering to our house at least 20 times in the past few years, we place an order an get a call saying we're out of delivery range. When I asked since when she says, \"Since always.\" The manager confirmed they don't deliver here. Not sure if the management has changed or what but we've never been outside of their delivery range of 5 miles. I looked on google maps and we are 5.2 miles away. Wow",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qdrBA_OskcEWOJDOQhpR4A"
  },
  "A3tIdPecZEdhd21YdUeGcw": {
    "date": "1/8/2016",
    "text": "My family and I stopped by Farley's for the first time and we were impressed. It is clean, features wifi, and is serviced by a friendly staff. I appreciate that they have gluten free options, as I am sensitive, and that they will change knives and such for vegetarians. Our food was prompt and our order was correct. The manager William personally brought out our food and spoke to us. He along with the young ladies up front checked on us throughout our meal. Any place that can meet all of our dietary needs, and still provide fresh, hot, delicious food is a place we'll return to again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "MR8XeEtfONbIqMWulR-f1g"
  },
  "N-Gvmbx5W9zySPs_ABfdxg": {
    "date": "7/13/2014",
    "text": "The thin crust pizza here is great. We order light cheese and extra crispy, and this pizza seems almost healthy it's so light and fresh. I've had, and enjoyed, the regular crust as well. The toppings can sometimes be a bit sparse, so if you want extra make sure you order it that way.  The person taking orders and the guys making the pizzas are always really friendly and open to any special requests.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "XufS4-wvFvBksdkyBAB5NQ",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Pepperoni Roll with spinach instead of pepperoni. Very good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XufS4-wvFvBksdkyBAB5NQ/o.jpg"
      },
      {
        "img_id": "5drPUEO-UldDZyTXy6biDQ",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Pepperoni Roll with spinach instead of pepperoni. Very good!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5drPUEO-UldDZyTXy6biDQ/o.jpg"
      },
      {
        "img_id": "gSO33d_uwnPu5egsDxLlBA",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Jalapeño Roll",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gSO33d_uwnPu5egsDxLlBA/o.jpg"
      }
    ],
    "user_id": "x37OyP--VEFE5p-xreplYA"
  },
  "_EzskUOOZ8uK-ML05ALZmQ": {
    "date": "2/23/2015",
    "text": "Excellent pizza. Excellent service. Pick up and delivery staff were great! Listened to what I wanted, offered current deals, accepted coupons and even made sure that I was getting the cheapest meal possible. You can't beat that! Plus, the pizza was excellent! Been several times to pick up and also delivered several times. I recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "nb51x31C528Hdk0l0izhHA": {
    "date": "12/28/2015",
    "text": "Farley's is pumping out top notch pizzas with high quality ingredients. They also have pretty good combo deals. I think I got a large pie, wings, and a 2-liter for $20 or something like that. I am a huge fan of their pizza, I think they use a combination of corn meal and flour when stretching the dough, which gives the pizza a much better flavor in my opinion.  I highly recommend you give them a try, I have worked in several different pizza joints, and have ordered Farley's 3 times so far, and it is better than any other pizza in the area.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tn0v-lX34kAlYUrpm6_g1A"
  },
  "rNF9I4E4quy8Bp0eHFhOVw": {
    "date": "6/23/2019",
    "text": "I've never dined in and am basing my review on delivery experiences.  Good food, fast service.  The ordering process is easy.  I've ordered online and by phone.  I guess some people call the wrong location and am often asked if I'm calling the right location.  I'm asked in a way that kind of makes me feel like I'm an idiot or something.  I mean, I tell them I'm doing delivery order, they have my address and duh, I'm obviously calling the correct location.  ::rolls eyes::  The garlic bread here isn't really bread.  It's Papa John's-style pizza crust with garlic spread and cheese.  It was okay but not what I expected so I wouldn't order it again.  The pizza crust is great and flavorful and has bite and isn't too chewy.  The pasta is a hefty portion and I always have leftovers.  The meatballs are also good, and this is coming from someone who doesn't eat red meat often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mrR8fOI18-wi7J6txouZLQ",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Meatballs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mrR8fOI18-wi7J6txouZLQ/o.jpg"
      },
      {
        "img_id": "MrqQ2xcEoQ5FlneugUAYmg",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Baked Alfredo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/MrqQ2xcEoQ5FlneugUAYmg/o.jpg"
      },
      {
        "img_id": "50UGUNyhs7VujeZLKHbklA",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States. Garlic bread",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/50UGUNyhs7VujeZLKHbklA/o.jpg"
      }
    ],
    "user_id": "S_khmVj6bZDWDNjztq3fjQ"
  },
  "sbxF-dBgmjlyQ6DdCsepHg": {
    "date": "9/3/2019",
    "text": "Horrible. If I could give 0 stars I would. I ordered here last week with some coworkers and all of our orders were wrong, soggy and cold. We waited over an hour for our food to be delivered. They also forgot half of our food! I called and the team member had a nasty attitude with me. I was supposed to get a refund of my $45, but apparently no one can help. The manager David was supposed to refund it and it was supposed to be back on my card today and it's still not. I just called and another team member was nasty towards me and refused to put a manager on the phone because \"the manager is busy and has no idea what you're talking about\" I will never order from here again and everyone at my job was also stating how they won't order from this place because they obviously don't know how to treat customers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S0KnO82RhqiyC4NJEUQjvQ"
  },
  "3reC-e-nv6T7F56msNVQ7w": {
    "date": "9/6/2019",
    "text": "Ordered a Spaghetti with marinara sauce as a to go order. And found a huge nail in the food!! Find the pictures!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ftksQHgjFCsiJNHzTWxlA",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2ftksQHgjFCsiJNHzTWxlA/o.jpg"
      },
      {
        "img_id": "57qvkZ5b30lgDB-2kWMU2A",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/57qvkZ5b30lgDB-2kWMU2A/o.jpg"
      }
    ],
    "user_id": "ErJsBXPB29CR-aipYWDpag"
  },
  "e1KfrjQ0urlX-BIE2D2dkw": {
    "date": "6/25/2019",
    "text": "I wish I could give this place 3.5 stars. It was good, not great..but definitely wasn't displeased with my experience. When comparing it to other craft pizza joints, I must say that I'm partial to Blaze Pizza. However, for the 8.99 lunch special -- a two topping pizza and a drink-- this was a good deal! The pizza came out got and fresh. I ordered pepperoni and sausage. The sausage was different than the usual small pieces you get at Papa John's. These were heartier pieces! Thick crust and 4 big pieces. Definitely enough for two meals, which is what I did. Good experience here just not enough to get me excited about this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HwF4c2qETSYApVrgLGOTVw",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HwF4c2qETSYApVrgLGOTVw/o.jpg"
      }
    ],
    "user_id": "fqcty5_beOvO1eVQ80aXiA"
  },
  "1Auvx6jIFvUElvZorTftBA": {
    "date": "2/11/2018",
    "text": "Date night Friday and my honey chose Farley's. I had my reservations because the Yelp score wasn't 4+ but I'm SO glad we came here. The pizza was great and served piping hot. Good amount of cheese and toppings. My boyfriend Loved the crust.  Their wings were cooked to perfection. Hot sauce was spicy, but not overwhelming. The honey BBQ tasted great, but there was too much sauce on the wings. There is such a thing when sauce is thick.   Service was great. The young ladies were friendly and patient. Overall, Farley's exceeded my expectations and delivered great food and service.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 9
    },
    "photos": [
      {
        "img_id": "2dt-IYVuNI4LYSxLSLVSCA",
        "caption": "Photo of Farley's Crafted Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2dt-IYVuNI4LYSxLSLVSCA/o.jpg"
      }
    ],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "M0DsHyaDdc2nBagcIEWcTg": {
    "date": "7/19/2019",
    "text": "This place is such a hidden gem! Wonderful atmosphere and food. The staff is so cheerful and helps makes the experience so great. I would definitely recommend Farley's as a great place to take your family, a lunch with coworkers or even a date!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kvAdL5aOw3RCPm12PJOoRQ"
  },
  "q3Fk0CK2QQ2Zo8tdS3BVdA": {
    "date": "6/11/2019",
    "text": "Within the last month or so, the service and product inventory is lacking.  The most recent order was Sunday at 5:20pm, placed online, 45 minutes for delivery, 6:20pm I called.....\"oh yeah yeah it's on the road should be there any minute\".  7:00pm I called....\"oh it's 1 minute away\".  Finally was eating my barely warm food at 7:20pm, two hours after I placed the order.  My order was complete except for the Greek salad dressing for my Greek salad, they were out, so they took it upon themselves to substitute it with ranch. The previous order about a month ago, no Greek salad dressing and no boneless wings, at least they called to let me know and give me the option of changing my order.  I get that they may have been short staffed of delivery drivers, but say that, update your online numbers and for goodness sake when someone calls be honest about where my food is.  I would have canceled my order, but given the previous experiences who knows how long it would take to credit my card. It will be a l.o.n.g time before I place an order with them again.  Not worth the $50.00 which included driver tip.  Driver received no \"extra\" tip, had a horrible attitude, some threatening comments as well when he was told we were not giving him a tip.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D_zigBtkWMW1bHAHp5avhA"
  },
  "tLwcW4pBWWGPQeLnFAUn7g": {
    "date": "8/25/2017",
    "text": "I stopped here for lunch one day and the line was extremely long.  I had to wait at least 20 minutes to place my order and then another 10-15 for my food to be prepared.  I would not suggest coming when you are on your lunch break.    I got a Stromboli with cheese in it.  It wasn't bad.  I have had better, it was a little greasy, but otherwise ok.  Tolerable.  The marinara sauce was pretty good and I enjoyed the flavor of that.  I would ask for an extra sauce next time, because it was rather small and the Stromboli is huge.    Service was ok, they were all very busy, so they definitely did a good job of keeping up with orders.  I would come back again try some of their other dishes at some point.  They have decent lunch specials and the pasta dishes looked pretty good as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "pZo_nsllVA7I36peEGHaSg": {
    "date": "9/11/2018",
    "text": "Ordered online, food arrived wrong, nasty customer service, never, never again!!! I want to add we order Farley's very often from my job. We will not again!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHFrBVJ1Z0LmdykPqy_9mg"
  },
  "R5N-m1yUKQMh_3tXFtfbFg": {
    "date": "11/30/2018",
    "text": "We love their pizza but decided to change it up.  Both of us ordered Philly Steak sandwiches and we shared an order of french fries.  The roll was soft and delicious, and so was the whole sandwich.  We enjoyed every single bite.  The order of fries were crispy delicious, and one order was enough for both of us to share.  Now it will be a hard toss up of what to order... a sandwich or a pizza, because we love them both!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mIUPVv2rTuarYcPWQ5SZOg"
  },
  "_cU-1Cc7Vo0hZOolKyCjTQ": {
    "date": "2/18/2018",
    "text": "Went to eat with my family on a Friday evening. Got a 19 month old, a 7 yr old   and a 12 yr old. There is one other family eating. We place our order with the 2 young ladies at the counter. They look a lot like siblings. We sit down with our drinks and how our food brought to us.   Now that we're settled I realize there's music playing. Did i just hear what I think I did? So I guess one of the kids behind the counter decides to play hip-hop music and it is uncensored. I look at my sister in disbelief. They can't be serious! Every F- bomb every n-word every bitch and hoe came flying out those speakers.  We were horrified. These employees can't be serious! I know they see kids in here. This is not a club. It's an eating establishment for crying out loud. This place has ok pizza. Can't  say the same about the staff.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CYeew1TH4h-Bs3A1JpXK0w"
  },
  "LkjQ_ZaEKCpUstNNTxkvdw": {
    "date": "7/19/2018",
    "text": "Really good wings and pizza. Will be back soon to try the hot wings! Had the black and blue pizza and it was great loved the crust",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ms9Ot-S8rXZ6fqUA6P4JPQ"
  },
  "1np60Ssbdc4wEXH-OV-8ZA": {
    "date": "7/11/2018",
    "text": "This is one my favorite restaurants. Every time I come in I'm always welcomed and it gives off such a warm welcome. Food service is always quick. Many different tasty food options. Friendly cooks and the owner and other managers are always very polite.  I would refer this restaurant to any and everyone looking for good eating.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxqCFBpOvlVG5OCnCs-TFA"
  },
  "XOxu7UXQJTEk9FEAxgqC6A": {
    "date": "3/20/2019",
    "text": "We love this place! The pizza is amazing!  The Philly steak is a good choice too! The staff is really friendly and it is a great environment!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aGBgj0lKfi7fMquEEIuTdQ"
  },
  "ooCcbNyCHbzMoEpmFoDYPQ": {
    "date": "4/14/2018",
    "text": "As the pizza delivery man came flying down a residential street in a  neighborhoodt, the neighbors told him to slow down. The driver stated, \"I'm turning!\" as he came driving down the street like a bat out of hell. He delivered the pizza to a neighbor. As he drove away, I stated, \"That's a stop sign.\" He declared, \"I don't care!\" as he sped away. My neighbor informed me the delivery was 2.5 hours late. I won't use Farley's",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "OOvr3vrFl96d0YBlqiTQ_w"
  },
  "VOzIFd3zo7vUmFv32HxqTw": {
    "date": "1/30/2019",
    "text": "So I ordered pizza through foodsby at my job as I've been wanting to try this place for a while now. Mistake! Where is the sauce? This is the most tasteless pizza I think I've ever had. The crust is pretty good and veggies are decent, which would've made for a great pizza experience, but the sauce (or lack thereof), is extremely bland and flavorless. Maybe this was a bad day or the person(s) preparing the pizza was being stingy. Either way I do not think I will order again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJ2eEYWTKUD0p1SKkbNNKQ"
  },
  "4B9hcPdwr-vgbHqDk8U-LQ": {
    "date": "4/12/2018",
    "text": "Very happy with the delivery service but pizza was subpar. Dough was slightly soggy, crust wasn't great. 2 stars because the ingredients tasted fresh but probably won't order pizza from here again. Maybe the other menu items are better?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "g8C_zJMDz5wFGW2-87q-ZA"
  },
  "0yzRFCSve4hti1dNEUr5_w": {
    "date": "1/14/2018",
    "text": "Have eaten here once and ordered delivery once, both times the food was excellent.  Wings and sauce were delicious as well as the taste of the pasta/sauce...Sure not out of a jar!!   This will be a new fave spot for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Y-JgQxRVWLJBDnHUTgeHdw"
  },
  "355uwWIUBCqjONkjmIrZfw": {
    "date": "4/10/2017",
    "text": "One of my favorite places to eat in Charlotte that I will definitely miss when I leave.  This is one of the few restaurants my best friend's Dad will go to - if he approves you know it's good.   I haven't tried everything here but I really like the pizza, pastas, subs & the fries. But the wings. Their wings are my favorite wings and my bf likes to order wings as an appetizer at most restaurants so I've had a lot of wings! Also they have homemade ranch and a Coke freestyle machine.  The employees are always super friendly as well.  Awesome place & close to I-85.  I'll probably be in Farley's sometime this week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "jZbBJomDyrCl700lYhczsA"
  },
  "OsXer5a6cC58kTFK7cFcMw": {
    "date": "2/4/2017",
    "text": "My absolute pizza place. The honey barbalo wings are the best. Staff is always friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KYr1mr7NjRQicflxVxlR6Q"
  }
}