{
  "nW-dgC4Xa8amGtvAuJ_T5A": {
    "date": "11/30/2016",
    "text": "Very good food always a good delivery time yet when it comes the fried food they put it in styrofoam containers which keeps it insulated and makes it very soggy--",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FGAVG8MySEOiJqAZhZAsA"
  },
  "qdjnECALYbis2PVKFPqeyQ": {
    "date": "11/29/2015",
    "text": "Love their wings for Sunday football! Watching the game without them isn't the same! Going to order some right now again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L-DDf53t85gkHlPz8IZogw"
  },
  "pgHEieEarSDzNqdAsZYu6g": {
    "date": "8/2/2015",
    "text": "Nice to see new options in the area. I am a big NY pizza fan, and their thin crust NY style was just ok. It was a bit pricey too. The sauce on it was good, just not enough of it. The pepperoni were miniature, and the kids joked about it.  The crust was decent.We went back and had Italian sub. The bread was good and the meats were good quality. The kids meals were a good size and quality.   My wife got the tortellini Alfredo, again ok.  We might go back, but if I want better NY style fare I will go down the road to Marios.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vy4M_lE1JSrluScoSvW1eg"
  },
  "craoDSXkEV_QwVSt3clTuw": {
    "date": "9/21/2016",
    "text": "Nothing warrants a one-star from me more than feeling like I was ripped off. My first time ordering here; I ordered a calzone to go. Paid the extra $2.00 for two toppings for a total of a $13.00 calzone. I cut the calzone in half and could see the black olives I ordered scantily, very scantily throughout the calzone The sausage I tasted perhaps three times while eating it. Way too much ricotta as well. Well, perhaps it seemed like too much because there were no other ingredients in there worth noting! The actual size of the calzone was small as the tiny amount of ingredients were all in the center with nothing but 2 inches of dough all around the outside. If I want to eat $13.00 worth of dough I'll buy a 3-4 loaves of the most expensive bread out there! I won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OM62gRH5z-IUSwaHlgxCrg"
  },
  "CcadRSz2wphY15Rgn69WwQ": {
    "date": "10/24/2015",
    "text": "This is my favorite pizza place in the area. I won't give it 5 stars because it's not located in New York City. They have two styles, thick and thin, both delicious. The crust really stands out, tastes close to NY quality. They also have good specialty pizza, wings and pizza rolls. The pizza is pretty expensive and there are cheaper options in the area that are good but, in my opinion, not as good as this place. Oh, one more thing, they make a pizza egg roll, definitely worth trying.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yHfxAvOX9hhXKAdev2ZQKg"
  },
  "CEp9m8-c5BpFYWyX--ocxw": {
    "date": "8/9/2014",
    "text": "The staff is very friendly and attentive. The pizza tasted like it was from Buffalo. It is worth the drive. Definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Kdd92_QEhVkRL8Kz3ZYY4g"
  },
  "Tez_ms56gwisxHoMCDIFmw": {
    "date": "12/6/2015",
    "text": "Bisonte Pizza company is the best pizza and wings in the Carolinas I visited for the first time on 12/05/15 and it was just like going back home to Buffalo NY I suggest everyone  should give this place a try I promise you will not be disappointed.  And all you Buffalo people this is Lanovas in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZWIXlichS5oi56FLhQ1oYA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZWIXlichS5oi56FLhQ1oYA/o.jpg"
      }
    ],
    "user_id": "rLX12N6huBCnk6cIoJG-qg"
  },
  "QU5dtHpO58qiS3JKZN6a5A": {
    "date": "11/8/2014",
    "text": "Got there at 8:55 and they let me in and sit and eat.... That along with them wings made my night.... GREAT place",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LZ6infjJ6UVWQHjxftTYVA"
  },
  "OEA8hI4ugc_30A_yAXnDlw": {
    "date": "3/26/2015",
    "text": "It was my first time there. Excellent pizza and delicious chicken wings. We got the bacon chicken ranch pizza and the medium buffalo wings. You should really try it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B2n7XIQl3C0iTbQkDIFtzg"
  },
  "vptaWIxTYRKGqKB8a6GqZw": {
    "date": "10/19/2014",
    "text": "By far the best pizza I've ever ate. Me and my husband order weekly! Service is great and they always deliver fast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "34IeodGi_9J06owD3OWyxg"
  },
  "fevh-7DQSTHIngjIMijyCg": {
    "date": "3/13/2015",
    "text": "Best pizza in town. Buffalo chicken is a must have, dip it in wing sauce and its Buffalo wing Pizza! Recommend the Buffalo style crust, not thick, not thin but just right. Local owners - great service. Highly recommend, kid friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9TrPQwTg_CPxTv_xK86Mcg"
  },
  "XheCuCa_oJVF6uYwDwThSQ": {
    "date": "8/30/2014",
    "text": "Couldn't make split pizza, prices way too high.  The highest I ever seen on a pizza. $26 for a large is ridiculous.  Athens pizza down the road was a lot better and cheaper and tasted better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dErlcFTlWOcGHeF2yc00rA"
  },
  "KcfdhCu5WCa0xo--9RKJCA": {
    "date": "7/29/2013",
    "text": "We visited for the first time this past Friday evening.  We ordered a buffalo style pepperoni pizza, medium wings (homemade blue cheese dressing) chicken parm, and fettuccine.  It was ALL great!  My husband wanted to go back on Sunday, but I wouldn't let him!  An asset to the Indian Trail area, and I don't think it will be too long before you can't get a table!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "KOAC8pGAToeThHVi1DMJEQ"
  },
  "TVXOhvac9S2M9aFs0LlR_A": {
    "date": "1/11/2014",
    "text": "Just moved here from NY. Had pizza yesterday it was terrific reminded me of the pizzas in the Bronx. Had the calzone and a veal parm hero tonight, only thing I can say is this is my pizza place from now on !!!!!!!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dS1rDBzpPiJLjSZOyuedmA"
  },
  "QNY0BWCugqL5guVH_UvNmg": {
    "date": "7/13/2013",
    "text": "Great pizza, nice salads and really good staff.  Love the specialty pizzas - especially the White.  It's not a white like a clan pizza or Alfredo.  It's white with fontinella cheese and that was a treat.  Tomato Basil Roma was amazing.  Better than most margherita pizzas.  Antipasto salad had lots of meats.  Priced right with lots left over to take home ... Bonus! It's a bit off my travel path, but I promise I'll be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Tu8lEnXbwsUs6qdHcKVyw"
  },
  "PBPF8KOaKni4MBFNEMn-hw": {
    "date": "4/4/2016",
    "text": "Not being from Buffalo, I didn't know what Buffalo style is, but I love it. More filling than the really thin NY pizza. The flavoring is excellent. Definitely on thr pricey side. I wouldnt order a bunch if pizzas from here for a larger party because of that. But it is our go to place now in the area for good pizza. Have not dined in, only carry out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XUNG5tAciWBvJ84rlBHoFw"
  },
  "hTfc2nGBtQf65EKJ1I-l-A": {
    "date": "9/2/2013",
    "text": "I have been here about 15 times already.  I grew up in Buffalo and this is just like home.  I eat here at least once a week and love everything.  The chicken fingers, BBQ on the pit are out of this world.  The pizza is awesome with the great pepperoni.  The pizza needs to be cooked a little more at times so I ask for it crispier.  I love the food so much but my only two complaints are the inconsistency from visit to visit.  When the owners cook, it's always great but sometimes they are gone and results aren't the same.  The prices are a little high for the area but its worth it to me.  The chicken finger sub is to die for as well as the wings.  Give it a try!!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RVba8r6hnzw_IwLqiJ4EwA"
  },
  "yJMgfLXLaoW9CYRAMqXhBw": {
    "date": "1/17/2016",
    "text": "Best wings south of Buffalo!!! Beef on weck is awesome, never had a bad meal here!!! Calzones, pizza & pasta are really good also.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jnaNlI6FG_91U4R1f0YzJw"
  },
  "ezVJnEp6Ar2Snfj1pGXZIQ": {
    "date": "10/24/2014",
    "text": "Another former WNYer who finds the food here just like home.   From pizza and wings to subs this place is legit.   Great family owned place with service to match.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uCAKm2suBy-uON1CwdLKg"
  },
  "aoLhUbWvJh8tUubBd26tRg": {
    "date": "4/7/2013",
    "text": "The pizza was good, but very expensive. It also took quite some time for the pizza to come out.  I enjoyed my visit but may not order a whole pizza again until the price comes down. Note: you can order by the slice, which with a drink would cost a little under $5",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3nsMwcftirYRa1TX6QHrWg"
  },
  "DSGKM3-jtTnvgYHGGhDHwA": {
    "date": "9/17/2017",
    "text": "Ordered cheese pizza last night. Food came in good time and hot. It was awful. Know it's suppose to be like ny pizza. Bring from ny it was Far from that. Sauce and crust not good at all. Three more then half a pie out. Disappointed because we live nearby and it would have been great to have a local place that delivers.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BCWT4_zhDpwlAonynyT42g"
  },
  "AWAmDdL1GNwbTmRFXbp2yg": {
    "date": "8/27/2017",
    "text": "We came in on a Sunday right at noon. There was one other family inside. We are a family of five. We ordered a 6\" cheeseburger sub, cheese ravioli, a small NY Pie, and a calzone. We waited FORTY-FIVE MINUTES for the order before I got up to check on it. The sub and ravioli was on a shelf and was handed to me basically cold. The pasta didn't even need to be blown on before I fed it to my 10 month old. Another ten minutes went by before my daughter's pizza and husband's calzone came out. The pizza was good, but the calzone was doughy and not thoroughly cooked -- amazing for an order that he waited almost an hour for!! My son enjoyed his cheeseburger sub. I went up to pay as we were leaving (the credit card machine was down when we ordered) and the manager did comp the calzone. It was $38 and not worth a quarter of that. Bummer of a visit and no extension by the management to apologize, explain, or invite us back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lBxjoWSTEjfw4CEoNGKxfQ"
  },
  "voTdGLEcl_BR5NeH11FSsw": {
    "date": "5/31/2016",
    "text": "This was my second try of this place and I was really not happy with a few things.  - The food is way, way overpriced for what it is. I haven't cared for the pizza, the wings, or the subs. Everything I've tried has been either burned, dry, slimy, lacking sauce, or just not cooked right. Yeah, I could've said something, but I'll touch on that later. - It takes forever which is horrible when you have 60 minutes for lunch and - no exaggeration - 20 of it is waiting. My first try was after the \"dinner rush\" and well before closing time. We were the only people in the restaurant and it still took forever.  - The staff are disengaged and do literally a walking fly-by asking you how your food is while simultaneously hustling to get away from you so you have no time to answer. If you attempt to make eye contact outside of ordering, they immediately go somewhere else, or look away. It's like they want you to go away now that you've paid and they put food in front of you. This has happened on both occasions with multiple staff members.  Just do yourself a favor and don't bother. Maybe delivery is a better experience, but I have no interest in trying that.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xcS7QbhGkEKdweXnMSbMcw"
  },
  "duVBaaHkgn2mhntmMFgHLg": {
    "date": "5/3/2015",
    "text": "I've been back a few times and Bisonte is on point.  The homemade meatball sub was amazing but I think it should at least come with a bag of chips.  The people working are always very nice.  This is by far the most authentic Buffalo food in the area, even if they are missing the beef on weck and haddock fish fry.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "s4cki7AiOrOjb5r-ZpbJUw"
  },
  "5XZUqv0UFk1IHqrl4pl3qw": {
    "date": "6/12/2016",
    "text": "The food here is great but the service is horrible. My husband and I called to place a order for pick up and were put on hold for 10 minutes. When we asked to speak to the manager my husband was talking to the manager who was rude and the manager ended up hanging the phone up on my husband. I have had terrible service from them before but loved the food so I always let it slide until this time. The manager and staff were very rude. Pizza and everything else is great but don't go in thinking you will get good service. Will never order from them again.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FCqQZIMmJsP61Luzi74WIg"
  },
  "Lgnc7ZimCzgX5fpIwLuRKA": {
    "date": "9/17/2016",
    "text": "Yuch.  Ordered veal parm with spaghetti.  Not Real veal.   Terrible Frozen patty.  Manager  agreed.  Did not do anything when i said it was not good.  Will not return.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B8-4H--6zrIBdM1_rC44bg"
  },
  "75GNVyLOyNmphbs54E9XeQ": {
    "date": "5/23/2016",
    "text": "Decent pizza, a bit too greasy for my taste and mushy crust, but good pepperoni and pretty quick despite other reviews. I only ordered one slice to go though, so not much to go by!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zPrnD3FdU7zouX0JhJgOrg"
  },
  "yEpjP-UZsX7Z9GC6iNgV6w": {
    "date": "9/22/2017",
    "text": "Went here for lunch today.  Great, friendly service and excellent food.  I would recommend a 6\" Steak Bomber and 6 hot wings.  You will enjoy it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-D5_i-duCyBzmG_JrtHvfw"
  },
  "x8MOHCZtyngFP7gXyz92Yw": {
    "date": "4/30/2015",
    "text": "Surprisingly good plain cheese pizza! And I say that as a New Yorker used to New York thin crust pies. Let me explain that. So initially I was disappointed as it's a thicker pizza and NOT a crispy crust. BUT then I tasted it! And I have to say I'm pleasantly surprised. I equate the texture to ur standard NY sicilian pie which is a fav of mine. Their sauce and cheese are super tasty. I also order cheese sticks w fries to give those a try. Again, wonderful flavor for both! Only got thru half of those and my slices so lunch for tomorrow is covered too!  Only 2 downsides. One. It took SO long to get the food. FOR 2 slices and some fried sides 30 mins is a bit too long in my book. Second, and I really hate to mention it cause I know this will freak some folks out but I did find a small piece of hair on my plate under one of the slices. Eww yes but not gonna make me sick eww (like being served and eating raw chicken like at another place I could mention). Would have been worse if it was actually IN the food. But the manager came over, apologized and offered to make good with replacements so that satisfied me. It's food service and things like that can happen.   So all in all I'll definitely return  very delicious meal :-)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "63BHuAn2aOs0n3y7Oxv2SA"
  },
  "1TJ4Lyx_rS32eBehY4qM5A": {
    "date": "5/9/2015",
    "text": "Uncharacteristically for me... not a lot to say. I will keep coming back to review as the pizza is very good and now I am wanting to expand my tastings to a few other areas and see how that goes.   Couple of concerns but nothing worth sharing right now. If a pattern emerges I will update the post.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yff7VGBTfm1Y4RmopuV_Og"
  },
  "0nqo4EmRuHHCGdk1unexyw": {
    "date": "8/12/2016",
    "text": "Charloteans rejoice, for there is truly a Buffalo pizza joint in town. Close your eyes, take a bite and you are sitting at La Nova's. I just moved back to the area and good friends let me know this gem existed. You can get slices at the counter or order from the full menu. I am so happy this place is in town!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RBhnXSy5AFHPM2wVHO5wCw"
  },
  "eZBg2b2tUoQ8PUSN-2e08Q": {
    "date": "9/11/2017",
    "text": "Second review.  Not so good this time.  Took about 30 minutes to get our food and there were only 4 other tables in the restaurant at the time.  Two girls at the counter on their phone.  Got charged .94 cents extra for some ranch for my kid to dunk his two chicken strips in...really?  Beef on weck $10.49 for a 12-inch and that does not include any side item.  Wings at more than $1.00 each...............I'm not so sure we will go back again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wKTBjeRFRkTZXWb12gQQdw"
  },
  "E_Nuq7ke9ZiVMIaQ3Xlukg": {
    "date": "10/4/2016",
    "text": "Total Rip Off. Ordered Cheese Tortellini and Mac and Cheese. Not sure how someone can get that wrong.  Absolute waste of 25 bucks. the cheese sauce in the mac and cheese had coagulated to almost dry. The tortellini had not cooked through and was almost raw with zero salt. The manager said they expected us to salt it ourselves. Wow. Then he hung up.   It wasn't a sorry it was not to your expectation. He never asked what he could do to make it right. It was a non apology .. I am sorry you feel that way. I didn't need him apologizing for how I feel. He then hung up on me. What a jerk!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eix3UCFXNgWbF_Lg4lKb9w"
  },
  "0d4KQmHKOKDNCqIXDIspZw": {
    "date": "7/15/2016",
    "text": "We grew up in Buffalo where there we many options of delicious pizzas, but moving to NC we have had a hard time finding any good pizza or wings that tastes nearly like Buffalo pizza. We were thrilled when Bisonte opened. The pizza and wings are delicious and the best in the area. The down side for us is Matthews is a hike for us. We wish they were closer so we could order more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WZ7LCLXtEsnsVbmftWexnw"
  },
  "WT7rzoz1SgumVY6Prmycxw": {
    "date": "7/7/2017",
    "text": "First time visiting Bisonte and will now come regularly. Had a classic buffalo pepperoni pizza with buffalo wings. Great food and service!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dQ_6LtKSC01pAnemRKggrg"
  },
  "7oUD3wKOccShY0Zt2Km6jw": {
    "date": "12/9/2015",
    "text": "Being a semi-regular, tonight's pizza wasn't up to Bisonte's usual high quality! The staff was their ever present friendly selves checking on us a number of times. Tonight's pie was dry, minimally sauced & the sausage was MIA! Crust was uneven, being thick in some spots and thicker in others. The pep was generous. Shared comments with a Team member & was thanked for the feedback. We'll be back expecting the \"Charlotte's Best Pizza\" reputation~ds",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEZNR83u5qi3-boq-MkdaQ"
  },
  "D_chtLIKo2SJOO3jqLJSeQ": {
    "date": "6/10/2014",
    "text": "Got to say this place is the best. I am from Buffalo and eating here makes me feel like home. If you are in the mood for pizza buffalo style this is your place. Chicken wings best in the area better than Anchor Bar. The subs are amazing chicken Philly, steak bomber and cheeseburger sub you cannot go wrong w Costanzo roll wow. In the mood for Italian food try the chicken Parm wow. There isn't 1 bad thing on the menu. Everything is made from scratch and fresh. This place is the best hope it grows into more in the Charlotte. Best part beside the food is the staff owners Jimmy and Steve make you feel like you are eating at home. If you like good good trust me eat here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jp8q0Xg5j914Wfh0n5TGPA"
  },
  "lEEQnieBy8q_Uv-ZYxd01w": {
    "date": "12/19/2014",
    "text": "they said they were awarded best Pizza in Charlotte, so had to try. I thought it tasted like something you get at the roller rink or movie theatre. I just didn't get the hype.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "56RbwxjSLffruN9hgL_MCA"
  },
  "UTBOYSDnwhplmMoNk9j6_Q": {
    "date": "10/24/2015",
    "text": "This place is the best...awesome....get the wings extra crispy and its like you are back in buffalo. The deals are great and when its time for the big game sunday, this is the place.  The staff is awesome and nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SxcN4e5SKNhZ4wfEUbAMRA"
  },
  "085Td0bDNsbZmRYAGQ6BmA": {
    "date": "3/8/2015",
    "text": "The bacon lovers Pizza is the greatest of all-time at Bisonte. One day I fought a homeless man and fire breathing Panda for this pizza and lost. Would get a black eye again. 11/10",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "azcEWXxhd5oqJ9cO3y7Q9w"
  },
  "774u3GWF5pfo381lEzrk8A": {
    "date": "8/6/2017",
    "text": "Was in the area and decided to give this pizza place a try.  The food was good and we got our pizza buffalo style. They also can to a pizza ny style. It was filling and would definitely recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gpyOWW1bkSyDnRCbBuMmbg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Pizza rolls",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gpyOWW1bkSyDnRCbBuMmbg/o.jpg"
      },
      {
        "img_id": "bgRO-pzbR6jqAuuER-xCAA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Pepperoni pizza buffalo style crust so little bit thicker than your normal pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bgRO-pzbR6jqAuuER-xCAA/o.jpg"
      },
      {
        "img_id": "0NY7HlOsm3XMDnZnBhesbg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. The table signs are areas of NY",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0NY7HlOsm3XMDnZnBhesbg/o.jpg"
      }
    ],
    "user_id": "0qKD2SV888wQEgDu2VcvCA"
  },
  "Wl_BIfBpT5dCcbWA-uemDA": {
    "date": "2/16/2018",
    "text": "Likely won't go back.  Stand in line order and then pick a table.  Don't order wine it's Sutter Home in the small bottles.  Pizza is okay, light ingredients.  5 toppings,still seemed more like a cheese pizza.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S71g9wK0JwaXcVswbODUlA"
  },
  "DzBniPgbEkPmRpk1pmPIZA": {
    "date": "1/4/2018",
    "text": "I ate dinner here last night and it is a pretty good pizza joint! The wait staff was attentive and the pizza was good. There was nothing that really *wowed* me about this place, but I will be back for sure. The environment pretty clean and is also pretty basic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_za5jpnwhLNjaVfyLB9L_g"
  },
  "FPEa3pHaCzPMoLim7cahIQ": {
    "date": "8/29/2016",
    "text": "We had company over so I ordered a sheet pizza, a large pizza and 50 chicken wings. When I went to pick it up I was told there was a mixup and the wings were ready but the pizzas had just gone into the oven.   Yes there was a mistake but the owner immediately asked me if I wanted anything while I waited, a beer a soda whatever. Then he came over to me and asked how many people were at my house waiting for dinner, I told him 8. He then said he was sending 8 cannolis home with me for free. Every business makes mistakes from time to time but acknowledging the mistake and making it right with your customer is something most places don't do these days.  There's a reason I drive 25 min out of my way for this place. Great food & great customer service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "FrIjMFFWSABhgaVqAQHBCA": {
    "date": "3/6/2017",
    "text": "I would give this place no stars if I could. The pizza is great but the service sucks.   Attempted to order delivery and the girl on the phone took 10 min to take my order because she wouldn't let me talk and then afterward pretended to run my card 3 times and when she said it wouldn't work each time (called the card company, no attempt to even run the card.) Call back to speak to the manager and was told it was a mess up on there end but we couldn't order because they closed in 12 min.  They obviously don't want business and won't ever receive mine. You should take yours elsewhere also!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_nQ5-v3aKcFgsWobQI6TmQ"
  },
  "RG_kDhAbwIl8U_lveJBSgw": {
    "date": "10/27/2017",
    "text": "This place has the worse customer service I ever experienced. I wasn't greeted when I came in, they took almost 20 minutes for a cold sub. And I was the only person in there. The manager and the other employees were just doing their own thing...like I wasn't even there. The guy finally gave me my sub and just looked at me. Not \"have a good day, sorry about the wait\". Nothing at all! I drove 30 mins for nothing. For them to take so long, you would think my sub would of been spectacular. It wasn't, at all! I'm from Buffalo, and this place is making my city look bad. I like to try new spots, but it didn't go so well this time. I'm just going to stick to what I know and that is \"The Taste of Buffalo\". The staff is great and the food. They make you feel right at home. They represent Buffalo well!!!! You want good food and customer service..go to The Taste of Buffalo!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QiaUtk79qWhJ0Df4CC_9cA"
  },
  "13zeNwxcmcvh_253aQrb5Q": {
    "date": "10/18/2017",
    "text": "3pm.   ordered large pizza w/ tomato & basil to go.   got there & there was only one other customer @ the register counter.  2 employees & 1 manager (i think, if not the owner) talking to this ONE customer.  so i say \"hi im picking up an order\".   the one employee tells me to hold on & all 3 of them continue talking to this ONE customer.  i'm like, okay.  i didn't realize it takes 3 people to take care of ONE customer!  i go outside for a few minutes to make a call.  come back in & this time noone is there.  along came another employee after a minute & i pay for my large pizza.  i get home & open the pizza box & it looks like they just re-heated a large pie & gave it to me.   so i took a pic.  watya all think??   the tomato & basil & cheese r all over done.  perfect example of a re-heated pie.  $20+ for this pie.   ouch!   big mistake.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4nY3hGzMbclgPhAq-aqExA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4nY3hGzMbclgPhAq-aqExA/o.jpg"
      },
      {
        "img_id": "0HW-HHLKIu5N9TRIHkkfww",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0HW-HHLKIu5N9TRIHkkfww/o.jpg"
      }
    ],
    "user_id": "HNGjVpRldss37h69yo3GpQ"
  },
  "5b45P2uUkedOeFDwo6lagQ": {
    "date": "9/21/2016",
    "text": "Once you are able to get through on the phone to order the service and pizza are very good. Usually have pizza in hand within 25-35 minutes. The hot and cold subs are very good as well but I feel are overpriced at $10 for a full size (no side with that).",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4efBi4kBZroNzxR0wvGq8Q",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Can&amp;#39;t beat a cold Sam Adams while waiting for the pizza to be ready!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4efBi4kBZroNzxR0wvGq8Q/o.jpg"
      }
    ],
    "user_id": "J-nGtFmz5DIH_SQcSm0blA"
  },
  "7ROA_Nq4zBpdimrMGvA3fA": {
    "date": "9/17/2015",
    "text": "Well my expectations were very lofty as my friend I visited with referred to this place as having the \"best pizza ever.\" I was very eager yet simultaneously skeptical.  My initial impression was not the best given it was twenty five dollars for a thirteen inch meat lovers and two fountain drink cups. Subsequently, it took almost thirty minutes for the pizza to come out at a very non busy time. But luckily my friend urged me to be patient and it was certainly worth it.  While waiting and chatting we observed the photos on the wall wondering the city. It ended up being Buffalo, something I was finally able to guess due to the presence of American and Canadian flags in the few blocks of the city the photo showed clearly.  Still, I was surprised when the employee I asked confirmed this as Buffalo isn't what I thought of as a great pizza town.  The pizza was fresh out with all the meats: pepperoni, sausage, ham, ground beef, and bacon evenly and deliciously distributed throughout the pizza. The three cheeses were layered I believed I counted almost four with my tastebuds. Yum! Yum! Yum!   The only thing keeping Bisonte from a five is it is only the second best pizza I've ever had and also I'm impatient so thirty minutes is quite a while to wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Z8nu0eHPUVWE-buQfn_cVw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. When you both take a good selfie at the same time..",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Z8nu0eHPUVWE-buQfn_cVw/o.jpg"
      }
    ],
    "user_id": "yqNRBMYEIv1xmPMr4QuhhA"
  },
  "VStJul9E1OQCmtxxWqlnJQ": {
    "date": "7/12/2017",
    "text": "This place does a fabulous job of catering. We have used them three times and each time our guests rave about this pizza! Their wings are crispy and delicious. There pizza is incredible and their salad was wonderful. Anytime we do a meeting in Charlotte we will Bisonte Pizza Co cater it. They are always spot on!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mfz4nWriM809qwYd57yd1w"
  },
  "sXIxNaf5NXjGY5G94s20pw": {
    "date": "6/23/2017",
    "text": "We've always been pleased with our orders here!! The Buffalo style pizza is awesome, as are their wings. We will continue to come here and maybe even order something else!! It's just hard to order something different when what we get is so good :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Fq8tsbtyoJXEgA5zzbogFw"
  },
  "Femr-S2gyOetLPzV3fx2ig": {
    "date": "2/25/2018",
    "text": "I had the wings and sub. Both were excellent. Try The Stinger!  Wow.   Friendly people and neat little atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByN_6-fSqBAdZpvx5mJxfg"
  },
  "9fyHGnlsO08UkOFRk19fvg": {
    "date": "3/19/2017",
    "text": "Between the bland, dry fries, the overly soggy pizza, and requests for clean plates, today's stop was a bit of a bust. Hopeful things pick up.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8Izk2WQCFRlv-_-pPtipw"
  },
  "TjNUWHsfCY1AQuBN3bC_1g": {
    "date": "11/17/2015",
    "text": "Pretty good lunch place! Pizza has a good taste and is not expensive.  They have a few different lunch choices as well.  The place is clean, people are friendly and I would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "R_fIF0C4EcVB1tgbVFwp6Q": {
    "date": "12/22/2015",
    "text": "I have eaten here quite a few times; never dined in, always had delivery or carry out. The pizza is greasy as hell but delicious none the less. It is my preferred pizza joint even though their pizzas are pricey. For two large pizzas you can expect to spend 40-50 bucks. The salads leave quite a bit to be desired though their ranch and blue cheese are probably two of the best I've ever eaten. French fries are great but soggy when delivered or carried out as they steam in their styrofoam container.   I quit eating from here about a year or so ago. I felt like I was being \"nickeled and dimed\" every time I ordered. Good food though.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPN_SmdofE6fAcirilf1FA"
  },
  "VPe7ls3m3efqRxQrtFIKIw": {
    "date": "3/14/2016",
    "text": "Great, great, great pizza!!! Reminded me so much of the food back in Buffalo. Had a pizza and wings and they were both authentic.   Only flaw was that they were pretty light on the sauce for the pizza. Other than that, everything was great. The bleu cheese was even authentic, think and homemade.   I really wish there was a Buffalo style pizza place near Myrtle Beach, may have to drive here every couple months for my Buffalo pizza and wing fix.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EZIJg-ncPcTF2oTVTFUeVg"
  },
  "1guPuPRiPWZ5Z6sKnFmn3g": {
    "date": "11/16/2013",
    "text": "Stopped in for lunch today with some friends.  It's a little bit out of the way, but I think it's worth the trip if you're in the neighborhood.  There are two doors and two counters in the restaurant.  Enter on your left for dine-in, place your order, and your food will be brought out to you.  Enter on your right for carry-out.  I decided to order the meatball sub and a side of fries.  The sub was excellent!  The bread was soft and the meatballs, which are made in-house were terrific.  The fries were average.  I asked them if they could do some garlic fries and they used garlic salt to season them for me.  The staff was very friendly and I observed them assisting carry-out customers by actually carrying orders out to their cars.  If this place was closer, I'd frequent it weekly.  When I'm in the neighborhood, I will definitely stop back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "vyTlHe6bV0vDIZCrp34D7w",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Cannoli",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vyTlHe6bV0vDIZCrp34D7w/o.jpg"
      },
      {
        "img_id": "2KMUWc_53ypa3o9zqUKIHA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Meatball Sub!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2KMUWc_53ypa3o9zqUKIHA/o.jpg"
      },
      {
        "img_id": "8TMHerrkQ2rdZA1RNEOBvA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Breadsticks!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8TMHerrkQ2rdZA1RNEOBvA/o.jpg"
      }
    ],
    "user_id": "SwgCR62v2RKU3mQo1S-dlQ"
  },
  "lk4w3CYowJMKtnQB9P_T3g": {
    "date": "9/9/2017",
    "text": "My daughter and I went to this place today lunch. I had been craving Wings and pizza all week long, but flies were on the pizza so I opted for wings only. I ordered the six which is called a single medium wing and my daughter ordered the double medium one and a barbecue Bourbon style we also ordered mozzarella sticks and fries for an appetizer. The mozzarella sticks came out hot but the french fries were cold I did ask for replacement fries and they were steaming hot when they came out. The wings came out and they were hot freshly cooked. However after eating them on our way home my daughter and I became sick. It was hours that followed of bathroom time before we felt better. I did contact The Establishment and the management spoke with me and assured me that there was no cross-contamination, however my daughter and I were sick for a reason and it was the only place we had eaten that day. I just wanted to inform the restaurant before I yelped about my experience. I was surprised because my daughter and I have eaten at the one uptown and didn't have any adverse effects after eating the food. Nothing was really offered for our experience.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "OhsCg_yTTSUiRvkTGiPyog"
  },
  "6vgHY23QEDfIkpkqrtK4qA": {
    "date": "5/30/2015",
    "text": "Updating my review here. The pizza and wings are great but I don't know if I can keep coming back.   Why no gloves during food prep?  This mohawk guy is picking in his ears AND building my family's Pizza?  Girl at the front is handling money AND cutting fresh celery?  I love this place but I hate to see gross things happening with my food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 9,
      "cool": 1
    },
    "photos": [],
    "user_id": "IpXWAbu7VACBS8Z6MH2CfA"
  },
  "10W6weLFA4FefCjKcf8hGw": {
    "date": "8/2/2016",
    "text": "Good pizza! My husband and I have been trying to find good \"New York style\" pizza and this place comes pretty close! The flavors are all there and the sauce to cheese to crust ratio is blissful! I love this place and recommend anyone hungry for a slice to check them out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RRQ0qrkZde0HshH77I8tPg"
  },
  "JEl_omhAXv7XWadZ0NnEbg": {
    "date": "4/8/2018",
    "text": "My fiance' is a wing lover.....it's his FAVORITE item to eat and trust and believe that he has eaten at many....many....many wing places. 3 weeks ago his friend told him about Bisonte and hands down there wings are the BEST!!!  He's ordered the California Gold wings 4 times in 3 weeks!!!!! THE ABSOLUTE BEST!!!!!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "h5ZTNy7xG5P2mXnzSV3kMw"
  },
  "ebG_TH1jt9oKbnWLR0vYgg": {
    "date": "10/21/2017",
    "text": "Best pizza in the charlotte area! Best wings game n the charlotte area! Beef on weck and other great buffalo items are all here! Owners and staff are very friendly and helpful. I highly recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC2sg6Z5nkaMeiKC6_5Hzw"
  },
  "O3RYscKZlKVZRfvT5ag3dQ": {
    "date": "1/9/2019",
    "text": "I really wanted to love this place, having spent some time up near Buffalo, and being familiar with variations of NorthEast U.S. pizzas. But to be honest, while the Buffalo style pizza was OK, there was nothing outstanding about it to warrant my seeking out this place again.  Yes, it was competent as pizzas go, the ingredients were clearly fresh especially the tomatoes used for the sauce.  The \"Buffalo style\" crust was simply a thicker version of a NY style, and I think I'd not order it again.  If I was in the area on other business I wouldn't hesitate to stop at Bisonte again. But I can find as good or better pizzas in Matthews that are closer to me.  The restaurant itself is smaller than I expected, and the repeated opening and closings of two doors to the outside made it a bit breezy for a cold winter day. Not sure why they felt they needed two doors for such a small place.  So, on the whole not a bad place per se', just not a great one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LTapQZqThBcUPZgfS9qwhg"
  },
  "7HksAMR6Dd4yZkF7c3gO4w": {
    "date": "11/2/2018",
    "text": "This place is way over price for the quality. Your better off ordering from one of the chains at least you can save some money",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xqjWUXeqb-H8SmAf6nRDOg"
  },
  "7D7_1DmHi5OesH_uqjLFLA": {
    "date": "8/24/2018",
    "text": "I love their boneless wings and fries. And I would of given them five stars. But I couldn't thru on the phone line to place my order. And when I asked if my order was ready after 15  minuets of waiting. The owner sarcastically sad we are moving as slow as possible. I know he didn't mean any harm by it but still didn't sit well with me. For now on it if I can't get thru to order I will go elsewhere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "36cpOM1Sm9mVWLTsED1WUw"
  },
  "HHA5jOOZCtsDO-mKsgDuGg": {
    "date": "3/18/2018",
    "text": "This has been the worst experience ever! First the driver tried to solicit a tip after he delivered the pizza. My husband still tipped him $5 on a 29.00 tab! Then when I finally eat a slice, there is a brown hair in my pizza!!!  You will see that the hair is baked in the cheese! I will NEVER order from this place again. It's over priced and not worth it!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fPbWm5rnT-NpNlh9rk7Sqg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Hair baked in my pizza!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fPbWm5rnT-NpNlh9rk7Sqg/o.jpg"
      }
    ],
    "user_id": "xlNiI77BuzaSn4a_hj1Vmg"
  },
  "PFfgSidkHdAR3cHVbhj3lQ": {
    "date": "5/9/2016",
    "text": "This is seriously one of my favorite pizza places plus it's a local business! Their dough is amazing. There hasn't been a time where there is a bubble on the pizza!! We always get buffalo style. It's fluffy and airy and just plain delicious! Their Toppings are great too!   Wings are awesome as always. Meaty and huge!! We love their homemade dressings! We always get the hot flavor. One day we are gonna try the inferno flavor.   Their lunch specials are good too! They also have daily specials through the week!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ij7cj2dxzHv44qM8K8JVhw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ij7cj2dxzHv44qM8K8JVhw/o.jpg"
      },
      {
        "img_id": "1xuVyaC2LRZLpJGVX0RsCQ",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Large buffalo style pizza with beef and bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1xuVyaC2LRZLpJGVX0RsCQ/o.jpg"
      },
      {
        "img_id": "ec3f-Bd5AG5rqVgpaKA9-A",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Hot wings so good!!!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ec3f-Bd5AG5rqVgpaKA9-A/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "vypwlif8k2s4FkE3YohJbg": {
    "date": "12/22/2017",
    "text": "In walking distance,  but we never do-even for a slice and beer. That should tell you all.   The owner is gruff and the pizza is overpriced with a sauce I don't care for.   Parking lot by the teet and Poppyseed bagels (highly recommend) outside tables and delivery.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3sY-Wj7CKDb9YjQm7LG5Ew"
  },
  "vQ59JAZIgvPefOr7EYkf2A": {
    "date": "2/17/2019",
    "text": "(Sigh)...customer since opening...pizza last weekend was phenomenal - sorry to say that I was there less than an hour ago for another pizza and hate to report that it was made with SO much salt we had to leave 5 of the 8 slices...must have been the sauce? ...I can't stress how bad this was...perhaps someone dropped the salt in the pot? I eat anything and my waistline looks it but I just couldn't in this case.  Tonite there was no sign of the convivial owner(s) circulating (well-deserved night off probably)and staff wasn't coming out to check on the customers...(I had time to observe as I wasn't eating)...I finally had to walk up to the counter to mention it...I was told \"sorry\" by a pleasant cashier and then nothing...I went back to my seat to finish my sweet tea. Was looking forward to this pizza all day (frownie face).",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o389eeJa6s06M1hAIsyNhQ"
  },
  "sh3jQ9WmtVxhtESlGsfw8A": {
    "date": "9/18/2018",
    "text": "Bisonte is our Friday night go to! Awesome pizza, great staff and our order is always right, hot and ready on time. The tomato basil roma is our favorite. Bisonte is also a generous business in the neighborhood; they do a great job supporting local schools and causes. Thanks, Bisonte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ca2HslivV28rjWqXtfowoQ"
  },
  "uan9GpZFjgEEi5sJMtoaGQ": {
    "date": "6/25/2018",
    "text": "ok i am from buffalo ny and this place represents everything about buffalo when it comes to the food best pizza and wings in the WORLD",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "eQ7YJq7yIBDiLmz7prjEJw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. In Buffalo this Bar B Que charred wings are just as famous as the original Buffalo wing please come and enjoy this flavor WITH BLUE CHEESE",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eQ7YJq7yIBDiLmz7prjEJw/o.jpg"
      },
      {
        "img_id": "gbXfXZU109tiQll1P6-_kw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. You can literally drink out of the deep bowled pepperoni AMAZING BUFFALO STYLE PIZZA",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gbXfXZU109tiQll1P6-_kw/o.jpg"
      }
    ],
    "user_id": "ympZibOFlDiQuCCLPsG0dA"
  },
  "JV0S6CMl3foM79rgMJIZ6g": {
    "date": "3/20/2018",
    "text": "This is my boyfriend and I  favorite local pizzeria. the wing are a must have and the sandwiches as well. Don't be scared of the price of the wings they are so worth it. perfect for our date night in the house with a movie.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "aAARZ8x14HbZ_t44SDvBbg"
  },
  "dpY0NBm98wC4K0hjt4JZqw": {
    "date": "1/29/2017",
    "text": "This is a 30 minute drive from my house it is well worth it. It really is Buffalo the pepperonis are incredible the wings were amazing we will definitely be back to try the chicken finger sub I'm not from Buffalo but I have friends that are and I was sending them photos in their mouths were watering. We definitely will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "APUlZjwy8pwDc42tzpI2jw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/APUlZjwy8pwDc42tzpI2jw/o.jpg"
      },
      {
        "img_id": "yzCcH5KjugwxKGErPL7mMg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yzCcH5KjugwxKGErPL7mMg/o.jpg"
      },
      {
        "img_id": "2RomTVeK2osxq4jvy9kySg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2RomTVeK2osxq4jvy9kySg/o.jpg"
      }
    ],
    "user_id": "DlqdkcwoOUL-65TLLPFvcg"
  },
  "wGXJt5P2wpwkLUrqAqD4Tg": {
    "date": "4/16/2018",
    "text": "Got order to go.  Didn't realize til got home and ready to eat how taken I'd been. Sandwich based on horseradish had none. Called and spoke to mgr who said they get complaints about too much horseradish....so he left it off?!!! And the small salad that was $6 had about 3 pieces of lettuce and two chunks of tomato. Again he said they were cutting back on portion size. His response was \"what do you expect me to do?\" REALLY?!! If manager is that horrific with customer service they don't deserve my business or anyone else's for that matter.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Y6smIoNQmSRzB-LQH1BKKA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Y6smIoNQmSRzB-LQH1BKKA/o.jpg"
      }
    ],
    "user_id": "Q94pPtb-tIiDktlUqpqTaQ"
  },
  "EiY_ePWxMC9VhoQ4bVt0Bw": {
    "date": "3/22/2018",
    "text": "UPDATE 3/23:  Received an email from Slice and our order has been refunded.  Thank you.   Never had the chance to taste their food but will never order from them again. I mistakenly ordered from the SLICE app for pick up...  my fault obviously so once i received the confirmation email and realized they did not deliver to my address i called to have the order canceled.  Apparently it was too late (15-20 min after the order was placed) and they refused to refund anything including a tip that was for delivery.  I acknowledge that I accidentally ordered for pick up but I had no vehicle at the time nor would they remake for later. My husband is a restaurant GM and wasn't impressed with their lack of customer service. We will never recommend this joint...  nor the Slice app!  They got an earful as well since the girl who was supposed to immediately get a cancellation instead took 12 min to tell me they don't deliver to me (already knew at that point!) and never asked to cancel first per my request.   I prefer restaurants who will work with the customer, not against them.  I'm now out over $50 (including a tip that i will now consider stolen since they did nothing to deserve a tip!!) and my son will be admitted to Levine's tomorrow without his requested Pizza dinner... thanks Bisonte, it's a shame you are out for money and not good reviews. We all know a pizza and 2 subs don't cost you what we paid you!  You could have worked w us a little.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AAyE4quLfyfTvc3VIod1MA"
  },
  "TQZTqC6ArpebNWeygw8j9A": {
    "date": "11/18/2017",
    "text": "Very nice local restaurant great Wings Great Subs good pizzaVery nice local restaurant great Wings great sub good pizza. Try their wonderful hand cut fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TyUEKrau3BD646yi_FqO-g",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TyUEKrau3BD646yi_FqO-g/o.jpg"
      }
    ],
    "user_id": "mZnzz5HAaKNi0R9TBf1E9Q"
  },
  "q0Mc97kGEI0Yr4DNP4d1OA": {
    "date": "1/26/2015",
    "text": "Bisonte means buffalo in Italian. How do I know that? The Internet.   When in Rome (or in this case a Buffalo restaurant in Matthews), one has no choice but to bring a True Buffalonian to put it to the test. Reido was stoked to see they had Loganberry in cans. This is a Buffalo born drink... sweet, not carbonated. He finished it way before our food came out to the table.   After a careful study of the menu, we decided on splitting a Buffalo style pepperoni pizza and a 12''Stinger sub. Reido schooled me that the dough for Buffalo style is a little thicker than a New York style. It was delicious. Reido said it was some of the better Buffalo style pizza he's had down here in Charlotte at the transplant restaurants like these. For the Stinger, we had our chicken fingers dipped in a mix of hot and barbecue. I didn't see barbalo as a sauce option, but they did it on request. Steak, cheese, chicken fingers... that's a winning combination. Reido was most impressed by the bread. He said it's super Buffalo authentic  I thought it was worth the drive to check out Bisonte. I want to come back and try the wings and pizza logs. I've never had a log of pizza, but it sure does sound delicious.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 9,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "pd9ZS0P_YnxckHGS1LZwtg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Buffalo style pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pd9ZS0P_YnxckHGS1LZwtg/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "-2KdXu_M0u9n4b4bJBUPRA": {
    "date": "5/21/2016",
    "text": "I will give this another try someday. But, this evening (Saturday May 21,2016) I called for takeout.   The girl who answered must have said \"wait a sec\" 5 times in the first 30 seconds.   I wanted to order an Italian. She was not ready and asking me to \"hold on a sec\" over and over.  Don't answer the phone if you are so occupied with something else. Or, ask me to hold till you can give the appropriate attention to a customer.  Then she asked me if I wanted steak on the Italian. Steak on an Italian...?  I said no. Then she asked me what I wanted on it.  I had to go back to the menu on Yelp and word for word tell her what comes on the Italian.  I then said that I wanted it bake as their menu allows for an extra charge.  She was again unsure if they could bake it. She put me on hold. 3 minutes on hold and I was done. I disconnected the call.  Normally, I do not write \"bad\" reviews. But, this experience was frustrating and comical.  I'd like to try the food one day. Maybe, I'll just eat in the shop.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "JU54PFtLnY-zZweOrxsmvw"
  },
  "JYG-vgcztmlag7RZJysBzw": {
    "date": "4/20/2018",
    "text": "Fantastic first experience here. Was craving the Stinger and boy were we happily satisfied. I'll probably dream of it often. The pizza was also very good and crispy. Love that! I'm from Buffalo and this made me feel right at home.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DkcB-etvbU9TzIlsAMSvcg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DkcB-etvbU9TzIlsAMSvcg/o.jpg"
      }
    ],
    "user_id": "lDBi4dcKSP2VE4BS7zZE6g"
  },
  "NJnujzp4oqvUMKGPMCAqgQ": {
    "date": "12/3/2017",
    "text": "If I could give this place no stars I would.  It's horrible, I'm predicting  they will not be in business in a year.  The staff is rude to say the least.  The time it took to get 2 plain cheese slices reheated which were already made was more than 20 minutes on a Sunday.  (there was only 1 other customer who clearly knew a worker and totally  jumped ahead of me to order a specialty slice).. BTW,  there was 3 pizza makers working.... All standing around talking to each other n watching football.    This place is just the worst.  Your better off going to Harris Teeter  next door to get a take n bake or frozen pizza.    Horrible pizza, which taste like & smells like way too much tomato sauce with a too thick crust..... #notgoodpizza #dontwasteyourmoney",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "PHO83xH2BsU1FvyGpWhJVA"
  },
  "8vqMeFfrjxhfZ7apoS_8iQ": {
    "date": "7/24/2019",
    "text": "I liked the pizza we had today at Bisonte. It was Buffalo style, whatever that means. I just know it was a tasty dough. They had more than your average selection of bottled beer but no draft. I'd say it was a bit on the pricier side but overall a good pie. Would like to try the subs and pasta next time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "w8-JnzLPWnY1Op6kcs02Rw",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Garlic Sticks",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/w8-JnzLPWnY1Op6kcs02Rw/o.jpg"
      },
      {
        "img_id": "UE_FnOdjnIQyp1A8QOl3rA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/UE_FnOdjnIQyp1A8QOl3rA/o.jpg"
      }
    ],
    "user_id": "JiRZzPhGTbcnzTpu-BsyEw"
  },
  "McZ8K5PDNlUG19pgA7jDmA": {
    "date": "7/6/2019",
    "text": "We had a great lunch experience there yesterday. Friendly staff and food was excellent. The chicken wings were the best we've had in the area. We also had subs, pizza and pasta and none of our picky eaters had any food to take home. Will be back again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "v78D2S6woSuBDrKX_wfqLQ"
  },
  "G-sRclF9TzpMegA0xRxY3A": {
    "date": "7/20/2019",
    "text": "Love Bisonte.  I've become a big fan of the thicker Buffalo crust.  The Classic pepperoni is great and so is the Tomato Basil.  Best wings in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pPNolM9skQue8FcOyUF26w"
  },
  "-usnvrHac4VaKqvaHagAEQ": {
    "date": "3/20/2019",
    "text": "This place is somewhere I love to order pizza. It's perfect cause the prices are great there's different toppings to choose from and there's also a lunch special. With all the competition there is for pizza I think Bisonte does a great product! I will be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "Rc9c2bdJTSCXL7DqgL6JZA": {
    "date": "8/16/2019",
    "text": "Great pizza and gluten free options !  Only challenge they apparently don't have an air conditioner that works.  It has to be 95 degrees in the dining room!  Get take out unless you plan on sweating through your meal.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RZ4g7K5JMbK3FviKyC8rmw"
  },
  "24_q9hlNwDCOrElLyGYWYQ": {
    "date": "10/15/2018",
    "text": "They have 2 locations but I stopped at this location because they offer better parking.  Both locations are great but that's how I ended up here. I stopped in and got the Cheeseburger Sub and it was all of that. I got the large with an order of fries. Everything was delicious.  I must admit I think the large was too much and I won't get so much the next time. I ate the whole thing because I wasnt sure how it would be if I took it home and reheated it. If your close to this location stop in and give them a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "BDh7xQ6Lb6KB6VDE-JexLQ",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Order of fries, very good.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BDh7xQ6Lb6KB6VDE-JexLQ/o.jpg"
      },
      {
        "img_id": "fmIVIf6gnsLNM_0-tUZFbg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Cheeseburger Sub Large",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fmIVIf6gnsLNM_0-tUZFbg/o.jpg"
      }
    ],
    "user_id": "Hf1dov8HZLiXvfrxIeTZVw"
  },
  "HtHCs4xgYFNJ5_DynksHMQ": {
    "date": "4/23/2019",
    "text": "Been here 2xs. 1st tried regular pepperoni pizza and their beef sandwich.  Not impressed with either. No distinct flavor to either...average.  Returned and ordered their Tomato Roma Specialty pie...OUTSTANDING! Not as thick as their regular pizza and the flavor jumps off the pie!! I've heard their Buffalo chicken pizza is really good too...good service and clean restaurant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2ZK4Pa9bTTkIJw0oqfvETg",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Tomato Roma specialty pie...Outstanding!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2ZK4Pa9bTTkIJw0oqfvETg/o.jpg"
      }
    ],
    "user_id": "qHHrI_OzUYHaCejzWO5sEg"
  },
  "GMUmboSwbJ2u-uBkCcevRQ": {
    "date": "6/22/2019",
    "text": "The pizza by the slice looked like it had been sitting all day, but I ordered two slices anyways. The two slices were burnt and the crust wasn't great. It overall tasted like cafeteria pizza.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2jnmNdGmvcslVeV6s3KAXg"
  },
  "X6B_qoPkNbwI0WS2Fyi9xw": {
    "date": "12/13/2018",
    "text": "No one comes close to Buffalo pizza in Charlotte. Then Bisonte opened and I didn't have to drive 12 hours to have some.   I am so happy to have Buffalo pizza in Charlotte/Matthews. Their pizza is amazing and their subs are just like home as well!  Check them out and you will not be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "qOzJO_14unftIWKhxL487g"
  },
  "UaMjdv5tAQ10qyfs0t6PUQ": {
    "date": "1/23/2019",
    "text": "Mouth watering deep dish Buffalo style pizza! Fabulous meat lovers pizza with sausage and pepperoni and bacon! It's awesome savory taste and delicious crust made me so mouth happy. The flavors were incredible. The price was $26 for a large specialty pizza and I saw there was a deal for one topping pizzas on certain days.  I think prices are worth it!! I did takeout pizza and they are super quick, under 20 minutes. They're next to the Lam chinese restaurant on Chestnut Lane, by Harris Teeter.  I want to return for their award winning wings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "SZ79xGVyaqe01XVEJX7wVg": {
    "date": "12/17/2018",
    "text": "Hands down my favorite pizza in NC! I was born in Buffalo and this place is authentic! They know it's the sauce that makes it special. We're so happy to finally have a Buffalo pizza place in the Charlotte area. My family lives nearby, so we're regular customers and always get the Buffalo style pizza with pepperoni and mushrooms. Sometimes we'd splurge and get the charbroiled BBQ wings and royal sub. It's delicious!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZ72UqTsfUSSM0hotRQ5tw"
  },
  "T2jep6g5H5ZSggr5srQK-A": {
    "date": "11/21/2018",
    "text": "If you want a taste of Buffalo New York this is the place to go! So many wonderful choices I can never decide what to eat. The pizza is authentic Buffalo pizza (but you can get it New York style)  The wings are the best. The subs are huge. Pasta, salads, cannolis. Love love love",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sK7iCJ11c9aMBoVAneRCLw"
  },
  "ZttUp6NBThZuO_hg6dmvYA": {
    "date": "11/19/2018",
    "text": "For $3 a slice of regular I won't be back. Pizza is adequate at best. They also don't have to go cups so you either have to buy a can or take a solo cup in the car with you. Super disappointed. I thought by now they would have it down pat.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6tmhLUP1vcvLnVQjmEtg3A",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. $3 slice of regular.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6tmhLUP1vcvLnVQjmEtg3A/o.jpg"
      }
    ],
    "user_id": "QwYhd2ideUKRrYt_5q6Ueg"
  },
  "EHeZeXafwiWEAM5pyLKLNg": {
    "date": "9/8/2018",
    "text": "I really want to like this place because it's really close to us BUT it's just way over priced for what you get and the service of the staff.. eh...they put like 5 LITTLE pieces of pepperoni on a slice of pizza. We just ordered a pizza for 17$ and it definitely does not have the amount of toppings you would think would be on there. I saw the lady putting it in the oven and she accidentally knocked something so the toppings and stuff got all messed up and then another guy with his bare hands started fixing the toppings. When the pizza was ready he just called our name, put the pizza on the counter, and walked away. We were the only people in the restaurant. Why not wait for us to get to the counter, greet us, thank us for coming in, and that you hope we enjoy our food?!?",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fqQJMFyDsuy8s5MCHKOizA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fqQJMFyDsuy8s5MCHKOizA/o.jpg"
      }
    ],
    "user_id": "mN8fojhPhHtyLMVCmiA2_A"
  },
  "XLYtfbk2qmxcWGUKVE_2fA": {
    "date": "1/5/2019",
    "text": "Just heard about this place so my boyfriend and I decided to go. We are so glad we did and will definitely be back soon! The pizza is awesome, generous amount of cheese as well. The wings we had were AMAZING, as well as the fries. The staff was really friendly as well. Just an overall good experience and we can't wait to be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "orPOtOPAnVd3egmaAWcDKA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/orPOtOPAnVd3egmaAWcDKA/o.jpg"
      }
    ],
    "user_id": "NB9TyU-KSXmjNWw41oL5Cg"
  },
  "9BLnJ7Pwxs0jYpkt3x79Bw": {
    "date": "9/19/2017",
    "text": "This was my first time at Bisonte Pizza. Some of the locals in the area really spoke highly of this place. Overall I was pretty pleased with the dining experience. Nothing unbelievably different going on here, but they were pretty solid across the board.   The inside of the restaurant has a pretty open floor plan with a tv's on the outer walls. You walkup to the counter to order and then the food is brought to you. I heard really good things about the philly steak sub, but I wish I would have gotten all wings, but I was persuaded to get half a sub paired with 6 wings.   The wings were excellent, especially the carolina-flavored wings. I can see this place being pretty popular on a Saturday night or Sunday afternoon when big games are on. The staff here were very friendly and helpful with menu selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "2NTUJp6TvTPWqBDzKJVhlQ",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/2NTUJp6TvTPWqBDzKJVhlQ/o.jpg"
      }
    ],
    "user_id": "odN-IdB7adJTabCrvKEK3w"
  },
  "M2QLEYacQU36wJO00YuQhg": {
    "date": "9/9/2017",
    "text": "I had no idea what buffalo style pizza was until tonight. Yummy!  A cute little spot in a small, strip mall, Bisonte Pizza Co lived up to its 2014 \"Best Pizza\" distinction.   Buffalo style is a thick crust but not \"doughy\". I ate the pizza all the way to and including the crust, something I don't usually do. We had a large pizza (17\") and added 18 wings which was more than enough for our family of four. The wings were very good, too. We had a mixture of mild and carolina gold. Carolina gold is a blend of barbecue and a mustard sauce. Very good!  Staff was friendly and responsive. Definitely a good spot to watch a game. I will just take a jacket next time. I nearly froze and the temperature made our pizza cool too quickly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "omCU8oMhSzxoZbf7ESPetA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Exterior.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/omCU8oMhSzxoZbf7ESPetA/o.jpg"
      },
      {
        "img_id": "djdBdWl8bwGum_n_BUVoQA",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Quaint seating.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/djdBdWl8bwGum_n_BUVoQA/o.jpg"
      },
      {
        "img_id": "MQXpWGfO89BCxiHxZg5d9w",
        "caption": "Photo of Bisonte Pizza - Matthews, NC, United States. Buffalo style pepperoni and sausage.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/MQXpWGfO89BCxiHxZg5d9w/o.jpg"
      }
    ],
    "user_id": "CtIBG55GolSXI3qjcQFExg"
  },
  "AKMNggEB4zrzMmidwLfwzQ": {
    "date": "6/26/2019",
    "text": "I wanted to try Bisonte because the pizza options in the area are not the greatest. I had a beef on weck and a slice of cheese pizza. There were only three other tables seated prior to me and a few take out orders from the time I ordered. A table of 5 that came in after me got two pizzas before I got my order. It took 30 minutes to get the 1 slice of pizza and another 10 minutes to get the 6\" sandwich. There were 5 people working so no real excuse for the delay from what I could see. The previous review I read about the pizza being like school cafeteria pizza was pretty accurate. It was chewy and soggy, not much flavor. The beef on weck had great flavor but I'm not sure if they dipped the bread in au jus since it was so dry. If I'm in the area I'll give it a second try to taste a different pizza, but I won't go out of my way to get there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BDLhKPqicGSR9fVDdYI9DA"
  },
  "raZ1GBobbHa-u-j8zcqreQ": {
    "date": "10/29/2018",
    "text": "Best pizza in Charlotte! Try the bisonte classic or the chicken finger! The chicken finger is phenomenal.  Staff is friendly and very helpful as well",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lYkbQwzf_fObELa1peOVWQ"
  },
  "DZPP3Wm8FS3MQypqVAnqYw": {
    "date": "9/2/2018",
    "text": "Like being back home in Buffalo.  I've lived away from Buffalo since 1999 but, in all that time, I've yet to find a place that said they had Buffalo style food that really did... until now that is. I am in absolute heaven. The wings were like eating from the local pizza joint I grew up by and, the chicken finger sub literally put tears in my eyes. The fingers were fingers (not tenders), the bread was the right sort of bread, the cheese was the right sort of cheese... seriously just like home. The only complaint I guess I could force out of myself is that the mild wings were just too mild... like barely any kick at all. But they were cooked so perfectly and so yummy otherwise, I can't even take away a star for that. Seriously, if you are longing for a taste of Buffalo, look no further! Happy happy Buffalo native girl here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DKN6f9dtbpR7D5kwgcPxsA"
  },
  "OKm_ZAHdAnreav9fEOZKDA": {
    "date": "8/21/2015",
    "text": "Very good local pizza joint. This may be sacrilege, but our family does not like NY style pizza so I can't speak to that. But, Bisonte has a buffalo style pizza with thicker crust and we love it! It's not the best pizza we've ever had but it's consistently good, well priced and convenient. Pepperoni are nice and thick. We get the \"sheet\" pizza and it's enough to feed a small army. They are our go-to for pizza takeout. We've tried the subs, which are also tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTl6N2Q5_Mc_R5dYCP6Z3g"
  },
  "Yx8COUSfrMXu-Qpa5GhT1g": {
    "date": "8/13/2016",
    "text": "We have visited Bisonte's several  times as they have the best pizza logs and wings around.  I'm giving this review a 2 because of our most recent visit and the one before.  We asked for mild chicken wings which were delivered with hot sauce and we couldn't eat them.  We told the server who took them away and then immediately brought them back.  I asked what they did to make them mild - they put mild sauce on them.  The wings were still hot and we couldn't eat.  In the past the mild have come out dry and this is how we expected them.  We told them they had been dry on our previous orders (which have been many).  We asked for a slice of pizza, which we reminded the server we had ordered.  They brought out a piece that was cold and we asked them if they would reheat it.  They reheated it and gave us two pieces.  One of the men behind the counter did come by and check on us.  Meanwhile both owners were behind the counter and did not come over to our table.  This is the second time we have had an issue and the owner looks away.  Apparently they enough business that they don't care.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xpjDl54w1y3xvLohkGKNRw"
  },
  "DPQRX6WAnrCKhe4OvNiDVw": {
    "date": "7/25/2015",
    "text": "Solid pizza and subs. The wings are awesome. Overall good quality but a little expensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lyW6wU5r8cjudMNiqNsIyw"
  },
  "Do4QbAwv4_JzUx1xJWhRfQ": {
    "date": "2/28/2015",
    "text": "Absolutely spectacular!  My wife and I both grew up around Buffalo and this place has nailed the food!  Pizza is outstanding, wings and chicken fingers are amazing...subs are to die for!  Jimmy and Steve the owners are there a lot.  Place is always clean, service is excellent and food is remarkable!  Great job guys!  My family and I dine there often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EovPgCoKQLwGL_s8b0X6Tg"
  },
  "lqePJdr7zD6I2lvYhLXYLA": {
    "date": "5/24/2015",
    "text": "Great food, friendly staff. We enjoyed the pizza & mozz sticks. Looking forward to going back to try other menu items!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d18Eg3pSYDvUjX7HAXSIxg"
  },
  "yEoJPTC8mlMYS3bujF9miQ": {
    "date": "2/19/2015",
    "text": "Love this \"buffalo\" pizza. The crust is awesome. Just right between thin & thick crust. Not sure where they get their pepperoni from but hope they never change it. Love the pepperoni. The pizza is even better when you dine in and it comes straight from the oven to your table. The cheese is real good and it's not greasy. Wings are also real good. This is my new \"go-to\" pizza place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ejoJlvR9UXLNbxm2CP94lQ"
  },
  "SCDf_21HqOdzH-HvTlCYng": {
    "date": "8/6/2013",
    "text": "Hubby and I decided to try this place for the first time tonight. I have to say that the toppings and flavor were fine but the crust was the soggiest dough we have ever had anywhere!  We only live five minutes from here and even tried to re-heat in the oven on a stone but it was still mushy and soggy. Why?  You guys need to work on this as we have driven home with pizzas before and never had this issue. I guess one has to sit down at the restaurant and not take out. Totally disappointing.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "me_DfeOZUFZB7pTlXv-Aag"
  },
  "EurWGBsT7kHe1PAQEW7S3g": {
    "date": "12/31/2014",
    "text": "After seeing they won the pizza wars, I had to try this place. I'm from Long Island as well as having spent many summers in Buffalo so I know what I'm looking for in a pizza. I ordered a large half plain half pepperoni pizza and 6 hot wings. I enjoyed the overall experience very much. The sauce, cheese, and pepperoni were all very good. The one downfall of the pizza was I didn't seem to find anything special about the dough which is what prevents me from giving it 5 stars. However, I did order the Buffalo style crust which is a tad thicker and I prefer the thinner NY style. Since I was in a Buffalo restaurant I wanted to try the Buffalo style first to see what I thought. Next time I will have to try the NY and update my review to see if I find that any better. The wings were excellent and reminded me of buffalo. I actually live 20 min away from this place and ordered my food to go (I do have a hot bag in trunk) so I'm positive that if I were dining in the wings would be even better considering how good they traveled. Easily top 5 place in Charlotte for wings. I'm usually a ranch guy but any real wing eater knows you eat good wings with blue cheese so thats what I ordered and I really think it might of been the best blue cheese I ever had. Other cons that kept me from rating this 5 was the wing prices a single order of 6 is $6 thats a little steep unless you are getting big jumbo wings and while certainly not small they weren't anything special. I would definately go to this place again especially to try the NY style dough but, I still dont think I've found a place I necessarily have to go out of my way for. The search continues for the best pizza in charlotte.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hCESELaly3iofEnyOsH3mQ"
  },
  "hlFBW6cidydNGnT8lgpNFQ": {
    "date": "7/5/2013",
    "text": "The food was decent but nothing to write home about. My food was cold twice and they definitely tried very hard to fix it but to no avail. The pricing for the area is OUTRAGEOUS. Despite the fact that the owners seem very nice I doubt they will stay in business for long. The food is mediocre and even if it was 100% delicious it is way too expensive.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZkyxkQF_7cO0dPuLL9ac4w"
  },
  "CCe2yobE_twd1iHjPO6LGw": {
    "date": "4/28/2013",
    "text": "We try to support small businesses and have now been to Bisonte twice. And both times the wings were awesome! We've lived in Charlotte for several years and have searched high and low for great wings.  And I agree with another post - they have nailed it both times.  The staff was friendly too!  We have small children who are often picky about what they'll eat and they gobbled it up!  It's great to have a place not too far from our neighborhood with quality food.  I hope others will support this place - you can't go wrong with the hot and BBQ wings. Yum!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "-2sPRxMJ3e_LTkUhYxwbFA"
  },
  "g6o-HM09TfQZ9SNV1_S2wg": {
    "date": "8/9/2014",
    "text": "AWESUMM!! We kno pizza & wings, we're in town from Buffalo for Bills to paddle the Panthers. We drove 1/2 hr from Charlotte (Elizabeth), & it was worth it! Service and staff were very friendly. If U want cheap tasting Pizza- go elsewhere, they clearly use fresh good quality ingredients- @ reasonable prices. Truly a quality Pizzeria/Rest, & we'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2izq6tDYYbOPaOkEpKqsHA"
  },
  "AdUdz0-hENj5jKhEGG4TbQ": {
    "date": "6/30/2013",
    "text": "Sad that the quality here is dropped so much since they opened a few months back.  The pizza used to be very good.  Now it tastes like under cooked frozen pizza.  It seems that they are using cheaper ingredients and it is impacting the quality.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "y25oHV0O62UHaqaI8AAKmA"
  },
  "W2QBYoXAeBuQ6CkRVrmytw": {
    "date": "9/19/2013",
    "text": "My husband and I eat here every time we want pizza and wings. It's about a 20 minute drive for us but sooooo worth it. Bleu cheese and ranch dressing are to die for! Wings are always crispy and love the lil pepperoni!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R1r5hgfJhevh2Lv2UXzm7g"
  },
  "CtNc6bMeGPKwBdSf-lrCIA": {
    "date": "4/6/2013",
    "text": "We have eaten here on a couple of occasions since they opened. The pizza is ok, nothing great. I  have to say that we placed and order this evening, we were told it would be 15-20 minutes. I walked in 25 minutes later and had to wait for the pizza. There were only 2 tables and they were eating when I arrived, so it really did not make sense. In 5 minutes or so, my order was ready. We ordered one small cheese pizza, and a white pizza, which they classify as a specialty pizza which is news to us. My wife ordered a salad too. When we called it in they said it would be $32. We really thought either we misunderstood, or it was a mistake on their part, Well it was correct, $32 for a small cheese pizza ($10) which had a burnt bottom crust, small white pizza (14.99) and a small Caesar salad (5.49) with Ken's packaged Caesar dressing.  As I said, the food is ok, the price is outrageous, and it is convenient but with all the pizza places in the Indian Trail I think they need to rethink their pricing, or I am afraid they will not survive. We could of gone to many area restaurants and eaten much better for less money. I do not see us ordering another pizza from this place again,",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "RHIqKhK8v6ac5BHhm2hRow"
  },
  "gogrbQZ-OMeziOvFxCxRFQ": {
    "date": "5/15/2014",
    "text": "Our favorite pizzeria!  The food is delish and the staff is amazing!  Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bqoaF4jXFRJnkhuBsh5aDA"
  }
}