{
  "Dhg3bUk7eC3EzOUyT0arfQ": {
    "date": "8/30/2015",
    "text": "If you like thin crust pizza and personalized attention then this one might be for you.   This new entry to the Charlotte pizza scene is a located at the Metropolitan sandwiched between national chains. Parking is available in front and plentiful in the Metropolitan.   The interior of the restaurant is calm and welcoming, lots of whites and earth tones combined with clean lines. Contemporary music plays over the stereo. The majority of the seating consists of sit down tables with a limited amount of counter spots allowing for a peek into the kitchen with its traditional pizza oven. Very suitable for a casual business lunch and casual date night where eating quickly is of importance.  Lunch time on a weekend seems to attract a relaxed crowd, two families were present during our visit.   The abruzzo pizza was very pleasant. A thin and light crust was able to withstand the weight of the homemade meat balls, mushroom, garlic and cheese toppings quite nicely. The ingredients are of high quality resulting in a very nice pizza eating experience.   Just as a side note, the owner encourage less toppings.  The staff was pleasant and attentive. The owner stopped by a couple of times to see how we are doing.   The pizza menu is extensive, split between traditional pizza and bianco (pizza without sauce) but not overwhelming. Also on the offer are salads and soups but pizza is their strong suit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "jK9lYocQUbX9lFs-OFPORw"
  },
  "gSk-Rj7Wm32jJn0t4ggxew": {
    "date": "4/27/2017",
    "text": "Amazing food. Great atmosphere and service. Feels like a little cafe in Italy.  The food is exceptional and staff friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8GRe3VpX3x8YDRx95FbeaQ"
  },
  "E7Et2KQLMTx_xtSAUlZk9w": {
    "date": "4/24/2017",
    "text": "Many times you see locals reviewing a restaurant. We were just passing through and stopped because of the Yelp reviews. It did not disappoint. I liked the personal sizes and thin crust. Allows you to try different pizzas. Kids got a simple cheese pizza and inhaled it.  They are pretty picky about new restaurants and enjoyed it.  Value is reasonable given the quality and location. We are not in this area often but will definitely be back if able.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "96__4z8kNye1JdXvlwXeqA"
  },
  "EVQ1oGRI8KDKbf5MbI8Ocg": {
    "date": "9/30/2015",
    "text": "Had the Ortolana pizza tonight. Excellent. Nice thin crust with tasty eggplant & zucchini. Very friendly and attentive staff. Will be going again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WXdRJAl6dil42zpfjHKy5w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Counter and dining area.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WXdRJAl6dil42zpfjHKy5w/o.jpg"
      }
    ],
    "user_id": "csSkJrstFig6vN8lSfFZmg"
  },
  "7l7wu5yuZ8cCjE7eNvx0Rw": {
    "date": "4/16/2016",
    "text": "One of the best pizza in town! The Siragusa family knows how to cook real Italian and they know how to treat customers. My new favorite!!!!! We tried two different pizzas and cannoli. Out of this world.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Dqd81GkmDXcUlW6g8RvU9A"
  },
  "woQSpPbennlDfz8Z23YsHg": {
    "date": "2/11/2017",
    "text": "Planned a trip to Trader Joe's (on other side of parking garage) and was looking to yelp to see what we could try that we don't have in huntersville for late lunch and settled on pizzeria omaggio. 2 pizzas (individual sized) and 2 cokes later $37 (including tip)!!! That is VERY pricey to me for pizza. The margarita pizza had the equivalent of 4 melted moz balls, hardly any cheese and did not impress - it was little more than crust and sauce. I will say the crust and sauce are good but not sure good enough to get over the price tag. Service was fine, although a bit pushy in suggesting appetizers. After saying no thanks to apps she described three to me. Will not be back, there is simply better pizza avail at a much more reasonable price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyOScqxrq9aHIMAb7gaZvA"
  },
  "O4jYVd2T0UiokO8TjyZ8Fw": {
    "date": "4/4/2017",
    "text": "This place is phenomenal. Not only do they have hands down the best pizza in the area but what really makes this place amazing and stand out from the others is the customer service. Super friendly waitstaff and management, always very accommodating every time we come. We arrived around their evening closing time and were still greeted with a friendly attitude and received amazing service, per usual. Not in the mood for pizza? Their entire menu, ranging from pastas to salads, is delicious. Definitely will keep returning to enjoy another lovely evening on their outdoor patio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A6LINSFmhLj3pDsbThzmnQ"
  },
  "_b3dVEeENFR4QD-2RWcuuQ": {
    "date": "6/30/2017",
    "text": "Pizza at this place is very tasty. All of their ingredients are very fresh! The service is friendly and very attentive. My husband and I tried it for the first time tonight and would definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDtTGmCgeLUnnZc0hdy19w"
  },
  "lnDEG46eBHN0G6knByqysA": {
    "date": "3/14/2016",
    "text": "I had the opportunity to try Pizzeria Omaggio, and was VERY IMPRESSED with the Customer Service.  The Venue was very clean and well taken care of.  PIZZA WAS AMAZING!  I ordered the Vegetarian Pizza, with pepperoni added.    The Crust tasted fresh and was delicious.  I'm not a fan of the Garlic Bread, but the Pizza was on point.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZdVqzMA36wRp4EsYnHbjOA"
  },
  "gGpdWOtGOOnymRw1LTHVFQ": {
    "date": "9/8/2015",
    "text": "We had been looking forward to visiting Pizzeria Omaggio since it opened.  When we arrived, we were greeted by the friendly staff.  They were very helpful with assisting us with the menu.  I love the decor inside the restaurant - clean and modern.    We ordered a caesar salad, garlic rolls, and the margherita pizza. I appreciate that the mission of the restaurant is to provide fresh, high-quality ingredients, but we left feeling very underwhelmed.  The caesar salad was good, but the garlic rolls and pizza were lacking in flavor.    Hopefully Pizzeria Omaggio is still working out the kinks since they've only been open for about three weeks.  Otherwise, I'd recommend checking out Zio - that's our favorite pizza spot.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "KYVC4BTgvRybXloj60DU5A"
  },
  "lwQnjY8UhJEPiihV_m22gA": {
    "date": "12/9/2017",
    "text": "We ordered Pizzeria Omaggio from the Postmates app. It arrived promptly. However, the order was incomplete. We called Pizzeria Omaggio to correct the errors and were met obstinate resistance and sheer rudeness. We ordered the Burrata Antipasti. The menu describes the dish as follows: cream filled mozzarella, balsamic marinated eggplant, roasted red peppers, balsamic vinegar glaze, xvoo. What arrived was three slices of tomato, a ball of burrata, and a drizzle of balsamic. When we addressed the absent eggplant and roasted red pepper the manager took that opportunity to describe to us the definition of burrata and to inform us that the menu changes periodically without notice. He offered no solution to correct the error. The salad we ordered was supposed to come with a balsamic glaze but did not come with any dressing. It was added our dressing and it was edible but disappointing. The pizza was mediocre at best. I will never order from Pizzeria Omaggio again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BK81QPv9MHbvyNhHbALTDA"
  },
  "f49869BbKil_2U3BjS1oNg": {
    "date": "1/6/2018",
    "text": "Fantastic restaurant! Super tasty food, and authentic Italian food. Whether you are looking to sit down and have a meal, or order something to go, this is definitely my favorite authentic Italian restaurant in Charlotte. If you live in the Met, you can easily walk to it as well, which so nice and convenient!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pUj8d0Ekryof4WY6RehDzA"
  },
  "B_jPQGF-j_lFtkRL1b2Ojw": {
    "date": "2/8/2016",
    "text": "We had a great experience at Pizzeria Omaggio.  The food was delicious but equally impressive was the owner- and his clear passion for his restaurant.  Upon entering, we were warmly greeted and he walked us through the menu.  We got garlic bread, 2 pizzas and 2 glasses of wine that were great and very reasonably priced.      The  1/2 dozen of garlic bread was a lot for 2 people- we had to take a lot home with us.  The pizza was fresh, had interesting toppings and was perfectly cooked.  We will definitely go back to try more of the pizzas and other items.      This is a great place for a casual date or quick dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RTl7CErdGmgymbT1qozf7g",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Garlic rolls",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/RTl7CErdGmgymbT1qozf7g/o.jpg"
      },
      {
        "img_id": "po5ULQqLxlBocBRdlyrB5w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Trio pizza added mushrooms",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/po5ULQqLxlBocBRdlyrB5w/o.jpg"
      },
      {
        "img_id": "8s2-ZlwTE8Bwn-1r3x6iVw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Di Parma pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/8s2-ZlwTE8Bwn-1r3x6iVw/o.jpg"
      }
    ],
    "user_id": "xGFlePAMuW8-DSlI6c2n-Q"
  },
  "dJ1hv0mxd2q-Yg0QWsGJaA": {
    "date": "8/28/2016",
    "text": "Completely average, non-memorable pizza.  It looked tasty, but was really lacking flavor. We had the Trio and Abruzzo. Arugula salad was fine...again, not worth coming back for a second round.  Garlic rolls had the most flavor, but need salt and should be served with a side of marinara sauce and olive oil.  It was nice to sit outside and the staff were pleasant. P.s. The pizza leftover box is terrible, so make sure you eat all of the pizza",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cp5T2zvbyfvi1WqgAFHJYQ"
  },
  "n-v3I5W5811yn7APX1Dfbw": {
    "date": "10/26/2016",
    "text": "Just had a meal with friends here. The layout is like a pizzeria place you would find in New York. The meatballs were okay but they needed more flavor in them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEXQPLOCIgYoNXeekjL2aQ"
  },
  "-mm53jrFvoAEMAitUyz_Bw": {
    "date": "6/30/2016",
    "text": "Great family owned spot. Extremely friendly and attentive. The whole family loves it. Antipasto platter, eggplant stack and any salad is recommended. The pizza has perfect crust and high quality toppings. Tutto Carne would be our top pick. All desserts are also perfect. Just go!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iNqys1m8OhS708ctjXLjyg"
  },
  "BNiv11kQ4gDvWSTZ_HNXDg": {
    "date": "9/29/2016",
    "text": "Had an early Dinner with a friend. The place is very quaint. Nice size with a open kitchen that you can see the pizzas being formed and topped. We tried 2 appetizers one with the bruschetta and one with eggplant and mozzarella. The bread was very crisp with olive oil and seasoned diced tomatoes. The fresh mozzarella was Great and eggplant was well seasoned. I tried to Tutto Carne and my friend had the Abrazzo. Toppings were very fresh, only complaint was the crust was a bit bland and not seasoned. Reasonable prices for personal pizza around $12-15; wine was $8-9 a glass. Overall would return.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-au58wpCb4oX-_N-tKjonA"
  },
  "1KscBBw9FlCnmqPuDuimEQ": {
    "date": "9/21/2016",
    "text": "Great service and food. I can't stop ordering the meatballs! You only get two but they are so good and the ricotta is simply amazing. I also got the Hawaiian pizza. Also delicious. Thin crust, fresh ingredients and not too filling!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KtJL3cW-BRRBJIW-kXV7Dg"
  },
  "Prwns8OjmRvrZnLRbFn0Kg": {
    "date": "5/3/2016",
    "text": "Loved the food. I had the Margaritta pizza and the sauce tastes like NYC pizza sauce. Mmmmmm. My husband had the bolegnese pasta. Very good. Came with two plump buttered garlic rolls. The service was excellent. Will definitely go back again. They said on Wednesday night they have apps with your wine. All should check it out.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4bueyp5DQXTYQOszONcs0w"
  },
  "XINZNyOr-X6BMF-LTOyhDQ": {
    "date": "1/19/2017",
    "text": "One of our favorite places! Very cozy pizzeria,  friendly staff, nice atmosphere, very clean. Pizza was flavorful and smelled amazing. Definitely will come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5kZZ49DZoHdTp4TbNucXpg"
  },
  "7-HgG50-wyy-lE7UcHEpCA": {
    "date": "5/25/2018",
    "text": "Hands down the best Italian restaurant in town. I send people here all the time. The food is authentic and fresh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xJcjmqWd7YFUOeYGw_rPg"
  },
  "7VDD5V61o3KjvUFHrDQP7g": {
    "date": "1/11/2019",
    "text": "Thin crispy pizza with tiny delicious pepperonis perfectly spaced; Fresh pasta options; crisp salads.  The food here is characterized by quality.  It's a nice bistro atmosphere in the Metropolitan shopping center (so convenient parking garage nearby).  The food beats other more expensive \"fancy\" options and is the best, most authentic option we have found in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sRzmzXAFvLn3BJ_S-P0MfA"
  },
  "kQpJyFtUoQGMCNsaJGyusg": {
    "date": "9/15/2017",
    "text": "Second visit to Pizzeria omaggio and they did not disappoint.  The food is excellent as always.  We had the Trio Pizza and the Capricciosa Bianca Pizza, both were excellent but Trio was by far the best!  Even our son's kids pizza was really good.  We love their outdoor seating and always great service.  A definite must when visiting Metropolitan.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QOCiceTU50ybg09U7A2N3Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Delicisio!!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/QOCiceTU50ybg09U7A2N3Q/o.jpg"
      },
      {
        "img_id": "bRrB-5vEGt5pmHmtW8IHOw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Kids pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bRrB-5vEGt5pmHmtW8IHOw/o.jpg"
      },
      {
        "img_id": "dpmXYkXY3GOm3ryibqRXxA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Capricciaso Bianca",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dpmXYkXY3GOm3ryibqRXxA/o.jpg"
      }
    ],
    "user_id": "RMhh-vs9CBglg4kfxWdZHQ"
  },
  "ok3hHDF5s9kP5HU4bJbqeg": {
    "date": "1/1/2019",
    "text": "Great food and service. I would absolutely recommend.  We had 2 pizzas and side salads. The pizzas were delicious. The restaurant is clean. 5 stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q7wDkJFFhb84MN2d36a3dA"
  },
  "h2tCr74jIMMVtf1lyxSd-w": {
    "date": "9/14/2017",
    "text": "We were passing through town and in the mood for pizza. Found this on Yelp and very happy we did! We came in at 8:30pm with a closing time of 9, and we were treated very well.  Excellent beer and wine choices. Meatball appetizer (with ricotta, sauce, and toast) was delish, and so were the garlic rolls!  My chicken pesto pizza was excellent, with the pesto drizzled over the top instead of on the crust. Very different and very yummy. BF's arruzzo pizza was also good. Tiny little meatballs under the mushrooms and cheese. Very thin crust, crunchy and good! Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CdMXUA8nkXbxeU0IZZ0Y8g",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CdMXUA8nkXbxeU0IZZ0Y8g/o.jpg"
      }
    ],
    "user_id": "0NIATzFHZunl47sfAyGZOQ"
  },
  "uVgRjIa7iQjsoJILwiWl3g": {
    "date": "12/29/2017",
    "text": "In town to watch the A&M bowl game.   Wowwwwww is the place the cats meow. Homemade food. The owner greeted us, sooo nice too.  Our server was the absolute best server ever.   Oh yeah.... the good.  Best pizza ever, wife's calzone was incredible and the ( we shouldn't have but .... ya know) desert cheesecake was fabulous.    A CHARLOTTE staple.   Lucky if you live here.  The atmosphere is so nice too  Thank you so much for the experience!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-powmOW8OVXCufQFjBpvnQ"
  },
  "rz0udnbR6xQPs1r1um_BMw": {
    "date": "10/22/2016",
    "text": "Great restaurant if you are in the mood for fresh, authentic Italian pizza!  I had the rustica pizza with fresh cherry tomatoes, mozzarella, chicken and arugula.  Delicious!  Nice light and crispy crust.  Very fresh ingredients.  Just like being in Italy.  I had the arugula salad to start, which is huge. You could definitely split.  Nice mix of arugula, carmelized walnuts, pear and goat cheese.  Service was great!  Inside, I love the cool, modern vibe which is still warm and inviting.  Nice open kitchen concept.  This in The Metropolitan with street entrance on Charlottetown.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "sofxDIrqB0NKlMxeDzKIKg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Entrance",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/sofxDIrqB0NKlMxeDzKIKg/o.jpg"
      },
      {
        "img_id": "LZWnJpYVy0HMFwEYqT5epw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Rustica pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LZWnJpYVy0HMFwEYqT5epw/o.jpg"
      },
      {
        "img_id": "gQnXrsQv7eTkLxJ3Sh6x3Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Arugula salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/gQnXrsQv7eTkLxJ3Sh6x3Q/o.jpg"
      }
    ],
    "user_id": "HKPdEatcYoEfOL8MEKsWOQ"
  },
  "uqhBV0Wzzh1JU0Ic8eiFug": {
    "date": "11/9/2018",
    "text": "Great legit Italian Pizza. Nice ambience. Waiter were very friendly. Loved the place, definitely coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UynHnnDHgB3ihFHQznrJZQ"
  },
  "pgGhN5CBfCgT2D2rJkUpdg": {
    "date": "11/29/2018",
    "text": "My boyfriend & I love coming here, they have the BEST pizza I've ever had. It's the perfect size and it leaves you full without feeling disgusting. The owner is always there, and he's super nice along with his employees. I'd recommend this place to anyone who's craving some god pizza!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXzMRvWID_1L82jPv5r2Uw"
  },
  "CFrTa6mWfoAjbCvKbShGCQ": {
    "date": "6/14/2017",
    "text": "Came here on a weeknight for dinner. Was sat right away at pretty much any table of our choosing. Our server was very friendly and informative of the menu. He also was very attentive to anything we needed. The food was also very good as well. We split two apps- the meatballs and eggplant tower as well as a pizza. The eggplant tower was the only item I would say was worth the price. I figured the meatballs would be large as it only comes with two, how I usually see them at Italian restaurants. Unfortunately for us they were extremely tiny. Probably smaller than some you would get with a regular order of spaghetti anywhere. The pizza was ok. Again very skimpy on the toppings and very flimsy. Fell apart as soon as you picked it up. Again service and taste would get 5 stars but proportion size especially for the price gets a 1.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "ab55sdwSpOhQYB6F8OI4nA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ab55sdwSpOhQYB6F8OI4nA/o.jpg"
      },
      {
        "img_id": "c8gFMuyBQAUm5KhQ5ck5SA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c8gFMuyBQAUm5KhQ5ck5SA/o.jpg"
      }
    ],
    "user_id": "KHbnJXr3gx4-JfI5U00YCg"
  },
  "iy15_eUedgnPysWGuCxA3g": {
    "date": "4/5/2016",
    "text": "I am honestly so torn on this review, It's Ok (3 stars) or Yay, I'm a fan (4 stars)..tough call. I have decided on 4 stars.  The pizza was good, but the owner was so nice and I enjoy the atmosphere.  I have been wanting to check out this place for a while, but due to the parking situation, I always continue to drive by.  Luckily this past weekend, after a Target visit, I decided to check it out.  I was a little thrown off that you order at the counter and receive a number, should have read the other reviews, being that I wanted to sit down and enjoy a glass of wine, etc.  No big deal though.  I decided to start with the tortellini soup and a cheese pizza, added grilled chicken. And, of course a glass of pinot grigio.  The wine was crisp, perfect for my liking and a great price.  As for the food, the soup was okay, very bland broth, I actually added salt for some flavor. The meat tortellini were great, the three or four I received.  (Check out my photo, mainly onions and broth.) However, the tortellini actually reminded me of when I was a kid, and ate my Italian grandmother's tortellini/ravioli. The pizza was delivered and I loved the crust, thin and definitely light. I will say I would have liked a little more cheese and a little less sauce, but overall very good. And, the chicken was cooked too perfection and they didn't skimp on the amount. Being one of three customers in the restaurant I did appreciate the owner and waitress checking on me but I did feel like it was a little too much. I almost felt like I was being watched to see my reaction. Sorry, maybe it was just me.   Overall great little spot for a quick pizza and glass of wine.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "JCtFMWy7gKuZb9oS8d36UA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Classico with Grilled Chicken &amp;amp; and glass of Pinot Grigio!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/JCtFMWy7gKuZb9oS8d36UA/o.jpg"
      },
      {
        "img_id": "E5ElCTTrIKPIlexcYIqESQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Chicken Pesto Pizza (under the White Pizza&amp;#39;s)...with a side of marinara.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E5ElCTTrIKPIlexcYIqESQ/o.jpg"
      },
      {
        "img_id": "2oFiJgq4jJ1Z9q28JiqrLQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The &amp;#39;Trio&amp;#39;, amazing!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/2oFiJgq4jJ1Z9q28JiqrLQ/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "FDeesmCOGguWo7txWslgqA": {
    "date": "4/17/2018",
    "text": "If you have never been to Pizzeria Omaggio do yourself a favor and make it your next night out. My fiance and I went for the first time tonight and had a wonderful experience. The pizza is the best in Charlotte, half priced bottle of wine on Tuesday and had amazing desserts. The service was outstanding and everyone was super friendly. At some points we felt like we were back in Italy. We will be back for sure to try the other goodness we did not get to try tonight.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bDLZvRqOXIWwAMGZEShScA"
  },
  "uNTHm2WLaqvsvCcCdvzkiQ": {
    "date": "4/27/2017",
    "text": "I went for the lunch special and was disappointed. The lunch special includes a \"soft drink\". When ordering my drink, (and after indicating I intended to order the lunch special) I specifically pointed to the menu and asked if these were all the soft drinks. The menu lists sodas, s.pellegrino, iced tea, sweet tea under soft drinks. I try to order the s. pellegrino and it's not included.... okaaay. Then I order ginger ale. Also not included. So what is included? And why do you offer free \"soft drink\" when you really mean fountain drink. That was my first petty strike. My biggest gripe was the pizza. I ordered the Margherita and I felt like I was eating tomato sauce and bread. The first thing I asked was.... where is the cheese?! Take a look for yourself...  Yes I ate it but as I got the second half of my tomato sauce on bread I just got mad and needed to take a photo.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "GOiqExU0ZknXfFPUEO6U8A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Disappointing Margherita pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GOiqExU0ZknXfFPUEO6U8A/o.jpg"
      }
    ],
    "user_id": "3wDOPxLm04WmhU4392vDWQ"
  },
  "uM4sBVju8QKqKW-2DeqzBA": {
    "date": "6/24/2016",
    "text": "Forgot I haven't written a review for Pizzeria Omaggio. This place is awesome. Quick service and delicious, well-priced food.  My husband and I came here for lunch about a month back. You order at the counter and they bring the food out to you when its ready. We settled on splitting the Hawaiian and the spinach salad.   Grabbed a seat and food came our pretty quickly. The pizza was delish. Crust was perfect. The salad was fantastic!! It had egg and bacon on it. It was right on par with the pizza. I would literally go back just for that salad.   Noticed they had wine and beer available, which we will check out on our next visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Hw5riZfnB-B7G79vBTOssA"
  },
  "LRySsAvYcl1PCnBb303fzA": {
    "date": "5/4/2018",
    "text": "Pizza is delicious. Excellent crust and sauce. Toppings are fresh and served generously. Excellent wait staff. Didn't give the fifth star cause the garlic rolls weren't as good as I thought they would be. They were kinda sweet and not garlicky enough for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cKU4v_TaUZrKz59EOnLt3A"
  },
  "BQtCuqFReF_RMEHHTOfPrg": {
    "date": "9/30/2018",
    "text": "For starters, I hate pizza...I finally found a place that serves pizza I LOVE. The appetizers are amazing (my fave is the buretta but all are great). I love the zucchini and zucchini flower pizza. I hope it becomes permanent rather than \"seasonal\". Amazing service, wine and dishes. Love love love.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7gEA5fybYu4c21WT2YJ2Q"
  },
  "q-WiEwTHNARZMueYKm_iWg": {
    "date": "3/26/2018",
    "text": "Amazing Italian food! Had antipasto Italiano, meatballs and split a Romano-style pizza, and finished it off with the perfect Cafe Americano. Along with the great food was the great casual cafe ambience! Definitely stop into this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hnQOZY0TV49AUgvnob0iRQ"
  },
  "NQ-dXQgpql2aHizxb1tyyA": {
    "date": "2/24/2018",
    "text": "This was my first time dining at Pizzeria Omaggio and it was an exceptional experience. The customer service was impeccable, the food was delicious and I will most definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4NIdl36jMsM6yLiAKzJZA"
  },
  "JJRF7p9Zm5C9GkKD7Sa_-Q": {
    "date": "3/25/2016",
    "text": "I am in love with this place! I'm so glad I took a trip out to the Met and this shop? It actually makes that horrible parking deck worth it. Seriously.  The staff is great. They are friendly, will offer suggestions and are very quick to bring you any items you need. They work very hard to keep the interior clean and check on your progress, without being obtrusive.   Good grief. Look, I gave up sandwiches, potatoes and candy for Lent this year. Since it was over last night, I was so excited to grab a sandwich somewhere. I had the Italiano panini here and it was amazeballs. The bread *has* to be freshly made here. Oh. My. Gosh. It was so soft, but it had this perfect crust on the exterior. It was just the right amount of warmth. Not insanely hot, but not room temp. The balsamic vinaigrette on the sandwich was a fabulous balance. You could taste it on the sandwich, but it wasn't so much that it made the bread soggy. Y'all know how I hate soggy bread. Ugh.   The Rosemary chips are awesome. If you're looking for a comparison, they're like Papi Queso's, but without the truffle oil. Rosemary isn't my favorite herb, so I was wary, but since I haven't had potatoes in FOR-EV-ER, I went for it. They were seasoned very well. You got more rosemary than salt or pepper and it was blissful.   I really enjoy the places with open kitchens. I fancy myself a home chef, so I like to see how people get down in a kitchen! It's fun to me.   I didn't get a pizza this time, but it's definitely on the menu for the next visit. And there definitely will be one here. What a great experience, Pizzeria Omaggio! Cheers to you!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "opcAcMu-w8Z7b0fIhUdkSg": {
    "date": "4/20/2018",
    "text": "My wife and I visited Pizzeria Omaggio for the first time this week and all I kept thinking while we were enjoying our dinner, is why hadn't we found this place sooner. I had the Bucatini Amatriciana, which was just out of this world. My wife chose had the Prosciutto Funghi, which was also amazing, albeit, I wouldn't choose to have Prosciutto on my pizza, as it's a bit salty, but I'm the guy who doesn't put salt on fresh fries.   The only other thing I'd share is the Service that they provided is just as good as the food.  We will definitely be returning!  Best Italian food in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LjHxEmkiZtqmnG5q3aAqbw"
  },
  "TkRx0pn7yFaE0-K2Gm0j7w": {
    "date": "12/29/2017",
    "text": "This place is located in a popular shopping center area with other great quality places. The food was delicious and made fresh. I feel that they really tried when it came to customer service and I appreciate that. The waiter checked on us often. We were seated soon after entering. The part where they lost stars was this older guy who appeared to not speak English well brining items to the table that we did t ask for and we thought were free. There was a huge miss understanding and lack of communication. The guy was cleaning tables, brining food out, and appeared to signal/talk to guests with his limited communication abilities. He came to our table and brought wine poured it said taste and enjoy then immediately walked away. We were confused asked him was this for us and if this was a gift the nodded smiled and waived his hand. A gift you pay for?! Well it was on the bill. We brought this to the servers attention and he went to get the older gentleman to explain his actions. The server stayed out of it. Well I came here because it's my friends favorite spot and I wasn't going to ruin her last night out in the city, but I don't plan on returning after that. Charlottes growing and has several spots popping up I try something different or new.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "NJ-GxROGF76ik9eZbBqQ_w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NJ-GxROGF76ik9eZbBqQ_w/o.jpg"
      },
      {
        "img_id": "0uRycWLhW8W6ryoVvfQEPw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Nutella",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0uRycWLhW8W6ryoVvfQEPw/o.jpg"
      }
    ],
    "user_id": "Wt-dSc-L33pKiQ4mdZv3nQ"
  },
  "EscOcNZ1hO6PupzN_XJ4lQ": {
    "date": "2/9/2016",
    "text": "I purchased a groupon, $15 for $25 for a sit down dinner service and decided to use it the other day. It was so worth it! I love how you go up to the counter and order, very easy and hassle-free. I ordered the spinach ravioli while the bf ordered the Rustica pizza and with Yelp check in, got the chocolate orange mini cannolis (worth $6). I wasn't surprised to find that there were only one small and one medium sized tables available when we walked in for dinner given all the wonderful reviews. I wish the place was bigger, I doubt there is enough seating during a really busy night. The manager and rest of the staff were welcoming and very friendly.   Our food didn't take too long to come out and when it did, it was steaming hot and fresh. I LOVED the ravioli, very nicely made. Had the perfect ratio of cheese to spinach. The pasta sauce was DELICIOUS and went very well as a dipping sauce for the bread rolls that come with pasta dishes. Though the bread rolls had great flavor, they were way too oily for consumption if you have any heart complications. My bf loved the pizza, the crust was my favorite part. The fresh mozzarella really comes through here. The cannolis were lovely as well, I enjoyed the orange, definitely put these cannolis apart from the competition.   We will be back for sure, don't forget to grab a gropuon!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "Cr9aiX0qki_tkeqxNoUrPQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Mini Cannolis with Yelp Check in!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Cr9aiX0qki_tkeqxNoUrPQ/o.jpg"
      },
      {
        "img_id": "FFZl7smomOzOymcPPhDwig",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Rustica Pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/FFZl7smomOzOymcPPhDwig/o.jpg"
      },
      {
        "img_id": "uwN1DtryzENLPRAx0zmbZg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Garlic bread rolls",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/uwN1DtryzENLPRAx0zmbZg/o.jpg"
      }
    ],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "VnBTihbZe4gBHJ0p70I45A": {
    "date": "10/14/2018",
    "text": "I can't say we were thrilled with what we received. We ordered so we didn't get to experience the atmosphere many people seem to like, but the food was just average. The meatball appetizer was only two small meatballs for a seemingly high price, only one of the two pizzas we ordered was delivered the first go around.  Luckily the Uber eats driver was kind enough and go back to pick up the second that was not given to him an hour later which still wasn't that great. We probably won't be trying here again",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hr_d5xU0i3_-e9a9rqnw9A"
  },
  "4xP7DEWmPJeusLbSsuasAQ": {
    "date": "2/17/2019",
    "text": "My husband and I ate there last night. Very nice restaurant and great service. I had a marvelous thin crusted pizza and my husband and a meatball sandwich. Everything was wonderful, very tasty and great ingredients. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "atT0TGYMzTw_5txVP-gTaw"
  },
  "JmW9yRtMTXhSkg-KCIT9ww": {
    "date": "10/27/2018",
    "text": "Fantastic atmosphere, Outstanding Service and food!!! The best Pizza in Charlotte. Excellent ingredients and a wine list that allows great food pairing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gd-_-OhxZfqThWJG5kJ4nw"
  },
  "sxJsWjgmH460elFiVMrHig": {
    "date": "8/10/2018",
    "text": "Gotta give this place an A+!! I've had a chance to try a few things from their menu and I haven't been disappointed, also great service!!  TRY the meatballs!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YHfmDXlWaYITUJp3eX1qTw"
  },
  "t0gaRIawnUpO62dsBHZb9g": {
    "date": "10/2/2018",
    "text": "This place is the real italian deal. My wife and I ate there tonight and the server was awesome and the food was perfect!! I loved the white bean appetizer and meatball sandwich. Plus we had the brownie dessert which was delicious. You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZTUJKJ993ntpDiqABLM5_Q"
  },
  "K06kVWn3xQPIpKxpY5_Rbw": {
    "date": "1/16/2017",
    "text": "Despite a great location and friendly faces behind the counter, I was really disappointed in this gourmet pizza joint at the Metropolitan. My Margherita personal pie was underwhelming, and didn't amount to much more than marinara sauce and a bit of undercooked cheese. The beer selection was just OK, with a handful of taps and a few more selections in bottles -- local brews were significantly underrepresented.   Charlotte has some outstanding pizza places, but Omaggio isn't one of them.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "u8ipkF_PwdoybLOz4v-p3Q"
  },
  "QK3qlHSb7cmrQnBGd1DGWw": {
    "date": "9/27/2018",
    "text": "Fresh mozzarella appetizers are delicious. Good beer on tap. Pizzas are great as well. Second visit and great service each time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sodYf77z213MKz2521pgSw"
  },
  "VrXISQMWBCkFbNgulFZ1Nw": {
    "date": "12/7/2015",
    "text": "Staff was friendly!!!  The restaurant environment is modern and super clean.   The pizza crust was delicious and really thin, which is exactly what we like.    The lunch price is a good deal, but it would be tough to pay full price for dinner.    We would definitely go back again for lunch!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "xELCpVseoEHvct2LHlNNwQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/xELCpVseoEHvct2LHlNNwQ/o.jpg"
      },
      {
        "img_id": "HLr9Yhs5b18wFkpV_5HQ7g",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/HLr9Yhs5b18wFkpV_5HQ7g/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "v50R5K3NxlAFHWjMiAF0sQ": {
    "date": "2/16/2018",
    "text": "Their pizzas are delicious but the Meatball Parmigiana sandwich is my favorite item on the menu! The staff is super friendly and the food always comes out pretty fast. I love this restaurant!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "IolMuehlMkSn2-MogFmYkw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/IolMuehlMkSn2-MogFmYkw/o.jpg"
      }
    ],
    "user_id": "ILTRtJykTe1W6qgPXPNt-w"
  },
  "6GKT9WeVqYKQKCHgN1j4lw": {
    "date": "1/16/2018",
    "text": "I visited this place with my mom while we were craving some pizza and I must say we did not only satisfy our craving but we found a great homemade dessert place as well. My mom is a tiramisu lover and she can not have enough of their tiramisu. Very tasty, loved it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4NiK3lgHlyul5CZDjLzEaA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4NiK3lgHlyul5CZDjLzEaA/o.jpg"
      }
    ],
    "user_id": "BOsO-MH_dtmDykL2Eumssg"
  },
  "mmanxERewe2ZiB6d2OmlQw": {
    "date": "7/15/2018",
    "text": "Great atmosphere and wonderful owner! Daniel, the owner made our family feel at home in this upscale pizzeria. Everything we had was excellent. The bruschetta and the garlic rolls were fantastic as was the arugula salad, which my wife and I shared. I loved the Calabrese pizza, which had homemade sausage and pepperoni (salami). The Regina Margherita, which my wife had was excellent as well. Per Daniel's suggestion, we also ordered some kids pasta for our children with olive oil, which they enjoyed very much. Tiramisu and cannolis were to die for. The aperol spritz was also very refreshing and made me feel like I was in Italy. A wonderful experience and we'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0NMdyXqjjw7WHYVUFxqww"
  },
  "O8KaVRbdyPF6YHLsigeP7Q": {
    "date": "3/7/2019",
    "text": "This is a wonderful restaurant and family friendly.  The service is excellent! You can tell its a True Italian restaurant when you walk in the door and the smells make you smile. Antonio's recommendations are the only one you need.  I don't get to Charlotte often but when I do,  this is a spot I'll come back too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UlBKKfcxvECcIveHnMRUBg"
  },
  "8HVW8uFK3yjbgI0oRINthQ": {
    "date": "1/6/2018",
    "text": "We fell into this Italian restaurant and were pleasantly surprised. The food is amazing, delicious, and Rome-authentic. Our waitress was clearly part of the ownership as she was well informed of the offerings and lead us to the most delicious pizza and sandwich.   The restaurant itself is decorated beautifully and has a hip, but authentic vibe. We were surprised they could pull off both! I would recommend this to place to anyone looking for good Italian food (or just pizza!).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T8bRSvpbgdhdjZ5HKce6Ag"
  },
  "S3kBxNO6Q8dI5Kc1OrBxtQ": {
    "date": "10/30/2015",
    "text": "This place took me by surprise, I met a buddy here the other night for dinner - definitely solid.  When my friend said pizza place at the MET, I was confused and figured out this place was \"new\".  I had some errands to run in the same shopping center so I braved the parking deck (not my favorite) and got everything done and met for dinner.  First impressions:  They had just had a \"grand opening\" celebration so there were balloons out on the patio, seems like everyone had cleared out and we were greeted by the staff very warmly.  I felt pretty lost as far as what to do, but the young lady manning the cash register saw us and asked if we had been here before...  She gave us the run down of the menu and her recommendations.  You order at the counter and are given a number and then you sit and wait for your pizza/food.  We had ordered beer (3 taps here) and they have a small selection of bottles/cans.   Since they weren't terribly busy, they brought them to us.  I ordered the Eggplant Tower as an appetizer and the Pizza Rustica (sucker for arugula here).  Since I checked in with the yelp-app... there was a free mini canoli(s) dessert.  Everything came out super quickly and cooked to perfection.  Our plates were clean and we did not leave hungry.  Pizzas are about 11 inches and are a good size for one person - all the ingredients are fresh and on thin crust.  I did spend about $30 bucks, but that was including a beer and an appetizer... pizza prices range about $9-$15 depending on your toppings, etc.  The nice lady manning the register came by frequently to take away plates, refill our drinks, and ask how everything was.  Overall a great first impression.  Hopefully they are able to keep it up since I've now found out the previous tenants of the space was also a pizza place that didn't fare so well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "K_XGPgvUvGKUeRB6VnX1Uw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. mini canoli",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/K_XGPgvUvGKUeRB6VnX1Uw/o.jpg"
      },
      {
        "img_id": "vd5UOYIOqno2tei5U8XD9w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Pizza Rustica",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vd5UOYIOqno2tei5U8XD9w/o.jpg"
      },
      {
        "img_id": "i0tsnQylNrsTU-afEbhhaw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Eggplant tower",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/i0tsnQylNrsTU-afEbhhaw/o.jpg"
      }
    ],
    "user_id": "Ry1O_KXZHGRI8g5zBR3IcQ"
  },
  "BQeDxEMI4llR7uBtrnTpBg": {
    "date": "9/11/2015",
    "text": "As the third pizza place in this location, you'd think it to be the \"charm.\"  Not so much.  They are trying a bit too hard to be an upscale restaurant in a flyby space.  Having heard great things, I decided to give it a try for lunch.  Upon entering I pull out my laptop at the bar as I await my order's arrival.  No WiFi.  #fail  These days you must offer WiFi.  It's just a part of the customer experience.  Had I been able to sit and do my work, I may have ordered a dessert, a coffee, etc.    Once my pizza came, I had elementary school flashbacks.  Although a good size for the price, the quality was lacking.  Other than school cafeteria pizza-esk, I'm not really sure how to describe it.  A manager, or perhaps the owner, kept asking everyone how everything was.  Common restaurant practice, but in a space so small with so few customers, it felt forced and odd.  Of course I'm going to tell you everything was good.  Especially when you have the look of a child that may burst in to tears if I tell you just how sloppy your first coloring project really is.  He needed to exude a bit more confidence and give a bit more space.  Once I started to pack up my leftover pizza, he came by to tell me that he hoped I didn't feel rushed by the service associate that brought me a togo box.  I had to reassure him that I asked for the box, for I feared he may go chastise the poor girl.  How long did you expect me to hang around anyhow?  Should I have brought a tent?  Chill dude, it's only lunch.  Prior to going in, having seen several positive reviews and being a pizza fanatic, I debated with a friend how long this place would last.  I had faith.  He did not.  After my personal dining experience, I sadly have to agree with my friend.  Although I wish them well, I'm just not so sure this place will live up to the hype.",
    "rating": 2,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bkIlBpcWYq_paIobnAkx1g",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/bkIlBpcWYq_paIobnAkx1g/o.jpg"
      }
    ],
    "user_id": "ZlDYPORxTpNgImmbwIn3Dw"
  },
  "ubWUrgHJzzI-a5-5Kpm0tQ": {
    "date": "3/22/2017",
    "text": "This place is awesome! It's a low key environment, but very inviting. The tables are pretty close together, so don't expect to have a private dining experience.   The wine list offers a decent selection of Italian wines, and the server was helpful with what we were looking for.   The entire menu looks so good, but a pizza craving brought us out so we stayed in that direction. We decided on the Calabrese and Capricciosa Bianca pizzas. They were both delicious, but the latter won my heart (aka stomach).  There was a dessert Nutella pizza that I'm sure would have been just as satisfying, but there just wasn't any room to put it. Next time!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lAnyD05t0klPqGw3gObQdg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Calabrese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/lAnyD05t0klPqGw3gObQdg/o.jpg"
      },
      {
        "img_id": "iOwkoM2ZSjIHhnJSjn4qww",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Capricciosa Bianca. You need this in your life.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/iOwkoM2ZSjIHhnJSjn4qww/o.jpg"
      }
    ],
    "user_id": "DGGyRn5gDKqSlNscFvbJzQ"
  },
  "QrDb12SzM9ttY6Dwsx1ffw": {
    "date": "10/3/2016",
    "text": "This place has \"Pizzeria\" in its name for a reason - their pizza is off da chain! We came on a Monday evening around 8pm (you'll probably have to park in the free garage - not much street parking) and were sat right away. We sat outside since it was beautiful weather and nice atmosphere. Ordered the abruzzo pizza (at the waitress's suggestion...perfect for garlic and meatball lovers) while the bf got the spinach ravioli with a side of meatballs. They only have personal size pizzas (11\") which is perfect for one person (maybe a teeny bit too much). The pizza was soooo good - garlicky and hot and tasty. I was underwhelmed by the ravioli unfortunately (and the garlic knots - they were way too buttery for me).  Service was great (our waitress apologized for the bad service and I had no idea what she was talking about). I like to judge service by how frequently my water glass is refilled :D and then we finally ended our meal with the free mini cannolis that come with a Yelp check-in. They were yummy and the cream inside was perfect with the orange zest. I will definitely be back to try the other pizzas!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "A4iKMcFGZA6RYkTOCtM1xg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The outside patio of the restaurant. Very cute.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/A4iKMcFGZA6RYkTOCtM1xg/o.jpg"
      }
    ],
    "user_id": "4BNDTxOd0ckca5HNjPU69w"
  },
  "7RWHoelxksxhEBuG4L97Qg": {
    "date": "12/26/2017",
    "text": "Great Italian Pizza. Light delightful and great taste. Price is a little high for me, but not for this area and the quality of the food warrants a premium on price. Very friendly and attentive staff. Stop by to savor real food done right.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TA44HlFIyIVndJ5mcqdEfA"
  },
  "aJGvkbuICPWqOkejVhaLJQ": {
    "date": "2/19/2017",
    "text": "We tried different types of pizzas. They were all delicious. The wine selection was also pretty good. You must also try the calzone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sGmBc3W32CXL2GVDXdptgg"
  },
  "9pSPja6fwZK35KETpQiAVg": {
    "date": "5/28/2016",
    "text": "My favorite pizza ever! I love the Rustica! Their sauce and crust are amazing! Owner and staff are so nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QieJIUQTAm-lypJiqHUwRA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The Rustica and the Abruzzo! Delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QieJIUQTAm-lypJiqHUwRA/o.jpg"
      }
    ],
    "user_id": "vS6J2B1PF7MEp6z66kU-PA"
  },
  "4Z7v1ZQaE3QBa4ca0-Dqvw": {
    "date": "1/30/2016",
    "text": "Came here on a random Saturday to use our groupon! They have pretty yummy gourmet pizza. The pesto chicken one was good, but we really liked the trio the best!! Wait time was around 10m or less for 2 pizzas (6 slices each! Bigger than we thought) also Got the mini cannoli dessert. Homemade ... Pretty delicious, crispy and has quite the hint or orange zest! The staff is super friendly! Probably one of the nicest staff in Charlotte!! Very accompanying and attentive :) not sure many people know about this place! Just be prepared to dish out 15$ for a pizza!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "KKhKf3aP2b4Mkr6a_O_oOQ"
  },
  "vFw-G2O0SWVZ3RCc547TFQ": {
    "date": "2/14/2017",
    "text": "We dined in and ordered pizza and pasta from Pizzeria Omaggio tonight and sadly were disappointed. We had high expectations because of the glowing reviews and ratings on Yelp. The pasta was an extremely small portion and under seasoned. The pizza (vegetarian) was soggy and under seasoned as well. The best thing we got were the garlic rolls. The service was great and the interior of the restaurant is beautiful.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tZ-46m2ckE_d7rVs0sXnXg"
  },
  "fGfBDcRYN7RIyTahCS94RA": {
    "date": "1/18/2017",
    "text": "Delicious pizza selections! Wine was a little too pricey but beers were decently pricedq.q the atmosphere was clean,intimate and friendly. Nice little get together spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "K38uCNNV3seELIEl6_CfMg"
  },
  "2rPV0izt0DRyJqrOVEDORg": {
    "date": "12/16/2017",
    "text": "We are visiting from Long Island,NY and this is the best restaurant in Charlotte. The pizza is amazing! The crust is thin and crispy.  I had the ravioli with pink sauce that was delicious. We ordered the bruschetta for an appetizer and it was perfection. My daughter ended her meal with a Nutella Pizza. Seriously, this place is amazing. We loved it so much we came back the next night. A must try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqG35kNIpPVq7q7ODf9b8w"
  },
  "vIXuofC1HXY9aCOo3B-rDQ": {
    "date": "11/21/2015",
    "text": "Pizza was delicious - relatively quick, fresh ingredients , nice sauce to cheese ratio.  Antipasto was light and perfect size for two couples.  Italian beer on draft.  Very friendly, attentive service.  Relaxed atmosphere",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "c12BUpq3F2A6dnOytps89Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c12BUpq3F2A6dnOytps89Q/o.jpg"
      }
    ],
    "user_id": "wMsOc-vZ6U8YiRMLhRTUvA"
  },
  "AOcTb7r6pwsFU22Xm1t6hQ": {
    "date": "6/12/2017",
    "text": "Best pizza joint in Charlotte for the money.  When you talk about better ingredients, better pizza, you're not talking Papa Johns...you're talking about this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TPzaJSqFnKL-sQTPUxs-PA"
  },
  "geVDniv3Yo8sPU7P-4KLnQ": {
    "date": "9/4/2015",
    "text": "The Mr and I were excited to try a brand new pizza spot in the neighborhood so we walked in mid-afternoon on a Friday to see what was up. We were greeted by friendly staff and were quite impressed with the decor and ordering counter setup.   Our selection was a 4 cheese pizza and one with eggplant, red pepper and balsamic as well as a couple of canned drinks.   This is where it got disappointing. From my first bite of pizza I realized that something was missing.   Salt.   Yep. The crust was just boring. No flavor (although the texture was really nice).  The pizza toppings were fine...or would have been, had they been properly seasoned. The balsamic was somehow not piquant at all.   I waited for the Mr's reaction and it was identical to mine. We both covered our pizzas in what our friends' kids call \"shakey cheese\" or the table-side Parmesan that was brought out with our meal. Honestly, it was one of the only ways we made it through.   So here we were, wondering if we had missed something because both our pizzas were sauce-less. Maybe if we had ordered a pie with their marinara, the salinity of the sauce would have perked things up.   So the Mr walked back up to the counter and asked for some of their marinara.   And it tasted like unseasoned stewed tomatoes.   Service is impeccable.  Space is perfect.  Setup is simple.   Food...well, maybe we just went on an off day. I know they're probably working out some kinks.   Go see for yourself. Maybe you'll have a different experience than we did.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 9
    },
    "photos": [],
    "user_id": "jfaz1aQqnkbtzQfQyCE8IA"
  },
  "gxq0f_24oUeH3C5ybrtaFQ": {
    "date": "10/15/2015",
    "text": "The Arugula salad is VERY good. I went back two days in a row to get one. I do wish the pizza had a bit more flavor....maybe seasoning the crust would knock it out of the park!  The customer service is great and I will be back for more salad and even some pizza from time to time. The ingredients are fresh and I liked that.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "4NfB_V2DwzHGoQ0c6MZPXg"
  },
  "UB9xIwdh4KBi628L9aANOQ": {
    "date": "2/4/2016",
    "text": "This is a very nice, clean, friendly restaurant. I enjoyed the 11 inch Omaggio Special pizza. The toppings were all fresh and the sauce was well prepared.  I liked that the crust was lite and not over filling. The pizza could have used a bit more seasoning for me!   The wait staff is very friendly and attentive. Because I checked in with the Yelp App, we enjoyed a complimentary dessert of canolli.  I will definitely return to try other items on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3eGYUk1lm3ChCJohJQHwA"
  },
  "bmN-wZ-EXv9qcEd6IIc3GA": {
    "date": "9/15/2015",
    "text": "I was in NC for business and wanted some pizza...some real pizza. Read good things about this place so decided to try it out....and so happy I did! Living part of the year in Italy, I can say that this is as close as it gets to get True authentic Pizza in the US.   The service is good, simple and polite. Not perfect as they just opened, however they all seemed to give their heart to the product and to the customer, which for me is key.   The restaurant is cozy and clean, the Wifi worked well and although it was busy I did not feel like I was overwhelmed.   I would not be surprised if Charlotte will have many more Omaggio's in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "x2MmP4KbwYjueu3aISgnRA"
  },
  "Qp3GRwbyamAY8De-y9icSQ": {
    "date": "9/6/2015",
    "text": "THIS is REAL pizza. Roman pizza. The way it is supposed to be made. I have read people in other reviews (elites even) talking about how the crust isn't salty enough and the sauce isn't loaded with this or that and comparing this place to Mellow Mushroom, or Fusion. Omaggio is not them. Omaggio is authentic.   True Roman pizza is built on a simple, sweet crust, with a simple, homemade tomato sauce and fresh mozzarella cheese that all act as the foundation for the flavor explosion of fresh toppings. Omaggio is exactly this. Simple, balanced and perfect.  People who are fans of the over seasoned, over spiced chain restaurants will probably take a few visits to truly appreciate the clean flavor of a truly authentic homemade Roman style pizza. This is not the Americanized, in-your-face, oversaturated pizza you are used to. This is pizza in its Truest, original form.  But this place is not just about the pizza, the antipasti is incredible and every sandwich on the menu is filling and satisfying. The garlic rolls are actually GARLIC rolls, not just little bread knots with a little oil and garlic sprinkled on them. The cannoli is so fresh and crunchy you'd have had to make it yourself to get it any quicker. The atmosphere is the same as the food: simple, clean, beautiful, elegant, comfortable. You will never have anything less than a wonderful experience with service here.   The Siragusa family who owns and operates Omaggio is legendary in Miami with multiple award winning pizzerias and Italian restaurants. Best Pizza in Miami, Best Authentic Pizza in Florida, Best Garlic Rolls every year, the list goes on and on. They have a track record of greatness, which is on full display here at Omaggio. Prepare you palette for a simple, artistic, passionate meal made in True Roman Italian fashion.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 3
    },
    "photos": [],
    "user_id": "Vdx4G5AxIMe6r2hgdE_rKA"
  },
  "o7fWJ4fslKl3WIPzc8SVJw": {
    "date": "9/20/2015",
    "text": "I'm perplexed how this place is at a 4.5 star review due to the fact that the Charlotte Observer along with several other reviews pegged it for the pizza that it brings to the table.  My friends and I walked into this really nice restaurant and ordered a few of their pizzas. The service was good, the restaurant is clean, but the food (pizzas) are lacking.  There was absolutely no seasoning on the crust or the sauce and I am not one to enjoy an over seasoned pizza, however, there was no flavor to the pie.  Nothing really unique about the pizza and to be honest I probably won't be back. Garlic knots were subpar as well. Nothing special, just a nice restaurant with good service but underwhelming food.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 2
    },
    "photos": [],
    "user_id": "f7QxsFyzwBqfA9096XSDbg"
  },
  "I22yPFE9kkXQ2D-Ojt67Zw": {
    "date": "8/23/2015",
    "text": "We went here for lunch today and were extremely impressed.  The staff was very friendly and accommodating and the pizza was delicious.  The crust was crispy and didn't get soggy due to the sauce like most other pizzas I have had. The Trio pizza is a great alternative to a plain pepperoni pizza with fresh basil, mozzerella, and ricotta. You can taste that all the ingredients are fresh.  Pizzeria Omaggio is a great addition to the Charlotte pizza scene and other pizzerias should take note!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 11,
      "cool": 1
    },
    "photos": [],
    "user_id": "dp1XMUV1Laq6-EBiSXj_1Q"
  },
  "VL8EeMJ8u7XgIzwKDEyepw": {
    "date": "9/2/2015",
    "text": "Went in because the area around smells divine. They dont have slices but their pizzas are small, 11inches.  Still too much food for me on the go so I had the italiano sandwich, which had soft firm bread, very good and was very tasty.  I had asked for the chips but there was a miscommunication and got the salad (which is fresh and good). But I really wanted chips and the manager said no problem and brought me chips.  And they were fast.  I will be back to taste rhe pizza.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "lbTVHyEDZMk26g1Ho3Tt4w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Italiano sandwich, very good!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lbTVHyEDZMk26g1Ho3Tt4w/o.jpg"
      }
    ],
    "user_id": "dqYKmSmLQWK2UPjavWwlUw"
  },
  "fxZ9hnaRndLxtHd-TMGRqw": {
    "date": "5/16/2017",
    "text": "LOVE THIS PLACE! Had been wanting to try it for a little while and this was my first time going. Got the bruschetta for an app which was fresh and delicious and very reasonably priced. I forgot the name of the pizza I ordered but it had eggplant and zucchini on it, very good and is a personal size (still had one piece leftover because I got full). For dessert we ordered the special which was a Nutella pizza with strawberries, amazing! Shared it with my friend since we were both already pretty full. Would absolutely recommend for not only the food but the atmosphere. Also very glad we decided to sit outside since it was such a nice night!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vQKCch7Fv3fAseBM4vfN0A"
  },
  "e345K7QRHheitzE74PeUlg": {
    "date": "2/8/2017",
    "text": "Had great meal here with a friend. I got the eggplant stack and the soup and both were really good. He had a calzone and loved it. Brownie for dessert was really good too. Cute clean little place and service very attentive and on point. Walked by a million times. Wish I'd stopped in sooner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zzw0Z6-_VDp9ShIRSKIsQw"
  },
  "2C9e-DqO2otA1C_dVIxwRg": {
    "date": "8/31/2015",
    "text": "So glad that we finally got around to trying this place!! We stopped here for a quick dinner on a Monday night, and it far exceeded our expectations!  First of all, they did a fantastic job with the upfit and decor of this place --- the atmosphere is perfect. Laid back and sophisticated without being too stuffy or too casual. The menu was clearly very well thought out, sourcing only the best ingredients, and wasn't overwhelming at all.  We ordered the Pear & Gorgonzola pizza, the Di Parma pizza, and had limoncello sorbetto & cheesecake for dessert.  Can't say enough good things about the pizza!  Light, authentic, the perfect balance of cheese and quality toppings, and the crust was awesome! It hit the spot without making you feel overwhelmingly full.  Same goes for the delicious dessert--- so glad we ordered the sorbetto, it was the perfect ending to the meal!  The staff was fantastic as well. We got to meet the owner, and Sal (the manager), and they were both phenomenal!  You can tell that they care a lot about their customers, and about the quality of the food that they're serving.  We will definitely be back here, and look forward to spreading the word and supporting such a great little place!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "UzCgd62svU_tmtawMqQTQw"
  },
  "dw8qDl7X49s5g8CVin1O5w": {
    "date": "10/24/2015",
    "text": "Based on the recent reviews, my boyfriend and I decided to try out this new pizza place in the Metropolitan. The location used to be a Pizza Fusion which we didn't love so I was a little wary, but Pizza Omaggio did not disappoint!  We had the garlic rolls, meatballs with ricotta, tutto carne (meat lovers) and the pear Gorgonzola pizza. My boyfriend is a pizza snob and he loved every bite! He can't wait to go back.   The service was also excellent. As other reviews mentioned, the owner way at the restaurant and was very attentive. He even saw that my wine was low and brought the bottle to top my wine off (you pay for your meal at the beginning so it was free extra wine- which I never say no to!).  Anywho, you should definitely give this place a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "y0bL2EZxhzD7DlxGMhUboQ"
  },
  "5-bqO1hoy5PGEP_ex4hTWA": {
    "date": "6/5/2017",
    "text": "I had a craving for pizza, and Pizzeria Omaggio did not satisfy it.  Let me start by saying I think this place has potential, but they have to do one fundamental overhaul to get to 4 stars: their cheese. The mozzarella cheese on the vegetarian pizza was bland; it had virtually no flavor. I was SO bummed.  I added fresh pepper and red pepper flakes, only kinda helped. They also put an insane amount of mushrooms on the pizza, but that's neither here nor there. Perhaps their fresh mozzarella is better, but I doubt I'll be back to try it.  I had the Pinea Salad to start and that was yummy. Arugula, roasted pine nuts, fresh parmesan, balsamic glaze. All of the salads that I saw brought out looked fresh. So perhaps that's the way to go here.   Finally, they have Gerwurtztraminer on the menu! What a lovely surprise. That was the best part of the meal.   The restaurant itself is relatively unremarkable. You can see the pizzas being made behind the counter. The tables are somewhat close together. They have a nice patio but it's The Metropolitan, so there's a lot of action going on. We went at 7pm on a Saturday and it was pretty empty.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GjUDrHo0z0AeeNPW2HssHA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Vegetarian pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/GjUDrHo0z0AeeNPW2HssHA/o.jpg"
      },
      {
        "img_id": "9fpLrCTqGDJHFAndusGt0A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Pinea salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9fpLrCTqGDJHFAndusGt0A/o.jpg"
      }
    ],
    "user_id": "T8fSuI8CXWOYZfgfm4QshQ"
  },
  "j2E3fVGjRf2BgLeWt3DEzQ": {
    "date": "7/22/2018",
    "text": "Authentic, fresh, delicious! Lunch specials are so great of a deal! Excellent meatball sub in addition to the pizzas. Love their calzones too : lots of garlic, butter spread on outside. I feel as if I transported to Italy when I go there. Marinara sauce is fresh tasting like crushed tomatoes and spices. It's definitely my top 3 Italian places locally.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ngt1DInAEf3Zlw0YqWoh9Q"
  },
  "QO8fUdzbxidBv58q2-efYQ": {
    "date": "5/20/2019",
    "text": "I decided to give this place a try since it has great reviews. Unfortunately it did not meet my expectations. We ordered the bruschetta appetizer that came with ricotta and honey. It wasn't anything special and literally tasted ricotta and honey. Waste of money in my opinion since I can make this at home. We also ordered the mushroom pizza and the pizza special with zucchini. Again, we were underwhelmed. The pizzas tasted very bland kind of like a kids pizza. Service was great although food took forever to come out. Price was pretty high considering the food didn't \"wow\" us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9zkLYepS7JHsz98PKbSOLA"
  },
  "GsWFAfulnnsUilfIhi9Ssw": {
    "date": "2/10/2019",
    "text": "Amazing thin crust, perfectly-made pizza, attentive service, nice decor, good location and decent prices...what else can you ask for in a neighborhood Italian place! Wish we lived closer so we could eat here more often. Keep up the great work!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pCIcygjCB3f7RLVpT1ayMA"
  },
  "VwFzsYwag-3eA--XDhUqtQ": {
    "date": "6/10/2018",
    "text": "This is an amazingly great pizza place. Food fresh and desserts rival a fine dining restaurant.  Pizza selections great and sandwiches authentic Italian.  Pasta dishes too. Can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9Y7QivLeKXZ5URLcVQ00-w"
  },
  "jOXCn011ZJitCjuoLf6lnQ": {
    "date": "11/5/2017",
    "text": "Gluten free and vegan  pizza was delicious! I did the marinara pizza for a vegan choice! I added olives and spinach. Very flavorful!  My favorite dish? This Egg plant tower!!! Spectacular!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5ydnkPSgzZrEzMELUxqrMg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5ydnkPSgzZrEzMELUxqrMg/o.jpg"
      }
    ],
    "user_id": "iKGscOvRC7Tv4_s3Gmj3ng"
  },
  "OOEIE6jr5TJ-x-ZkJBXjdw": {
    "date": "3/6/2019",
    "text": "Hands down the best pizzaeria in Charlotte. The owner as well as staff were just the sweetest people i had ever met. I definitely will be coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZN67pz8xf5uAWldVvzpH7Q"
  },
  "0GffJ1tHknkLZJi9IdhRvw": {
    "date": "2/13/2017",
    "text": "Ok, now I'm excited!!!!   I had a great meal here!   Salad- Romaine with mozzarella and Cesar on the side.  Soup- zucchini - very good!!  Pizza- cheese pizza w buffalo mozzarella and light sauce - Amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8SVuQw-5-yy2okASSs0Acw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Cheese pizza with buffalo Mozzarella! Mmm! So good",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8SVuQw-5-yy2okASSs0Acw/o.jpg"
      },
      {
        "img_id": "Jgg274THkJz2oF801SokjA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Pinto Grigio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jgg274THkJz2oF801SokjA/o.jpg"
      },
      {
        "img_id": "ZPUcA7825GTDoh29BwowNA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ZPUcA7825GTDoh29BwowNA/o.jpg"
      }
    ],
    "user_id": "T13IBpJITI32a1k41rc-tg"
  },
  "QY2XtJ3sElbaj1mQMgYfIg": {
    "date": "6/8/2019",
    "text": "I would not recommend this place. The ingredients used are subpar quality and my pizza did not have the correct cheese on it. The crust had ok flavor but no texture. Not what you would expect for the price.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXwhlB4LghWqxN65AqSJ6w"
  },
  "JBisIFtV_RszuYljwwWOfA": {
    "date": "2/23/2019",
    "text": "This little spot hits the mark when it comes to real Italian food. Not just the pizza but the pasta. Sandwiches and everything else are made from real Italian ingredients! Great wine list too. Only negative would be the atmosphere is a bit drab. Major plus if they would make it feel like a rustic Italian spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CCrVftxfcs7GsXSKI3vfpQ"
  },
  "jLew3Ke5GvyCpScDSp1qJw": {
    "date": "6/19/2018",
    "text": "Pizza oh my goshio! I really love this place, this is the closest thing to my NY/Philly flavor of pizza. It definitely isn't the same as that style, it's more of the authentic Italian pizza style. But it's delicious none the less. They have excellent customer service. Every time I go I feel welcomed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0HFufqTN9ro6_F7Zexmhiw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. That Trio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0HFufqTN9ro6_F7Zexmhiw/o.jpg"
      },
      {
        "img_id": "kSDStpGrZmFUGmZK25BAdw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Trio style",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kSDStpGrZmFUGmZK25BAdw/o.jpg"
      }
    ],
    "user_id": "HLcdP__R2Bhx3A5jFJinHA"
  },
  "iJ6wLGrGBT7ElpMh5-SspA": {
    "date": "2/11/2019",
    "text": "I absolutely love this place! We started going there over a year ago. We've gone on different days and times and the food is always served in a timely manner. If you like a thin crust pizza, you will love theirs! No wonder they have been voted best pizza in NC!! I have a soft spot for the prosciutto funghi, no need to say more . All their cold cuts are imported from Italy and are super fresh!! You will not regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZTiVHUeYMcCivoYgSJiogg"
  },
  "5vTpm9SVcBpr9Wui0iu7SQ": {
    "date": "5/24/2018",
    "text": "One of the best margarita pizzas I've ever had. The mozzarella just melted in your mouth and the crust was nice and crisp. I would fly back here just to have the pizza.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mM-csxBhreBigTOYLcraOg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mM-csxBhreBigTOYLcraOg/o.jpg"
      },
      {
        "img_id": "c2QO6kGv40RQapPgXhrWww",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/c2QO6kGv40RQapPgXhrWww/o.jpg"
      }
    ],
    "user_id": "DKtv7eyEu-hIwPurMByuyw"
  },
  "AzvbGu_QNs4IJsh0cLAfow": {
    "date": "5/11/2018",
    "text": "Oh my god, what a pleasant surprise!! Incredibly authentic Italian. I had a beautiful seasonal pizza with zucchini flowers. They are so hard to find and here they were on this beautifully presented pizza.... You're welcome. Then the affogato was one of the best I've ever had. The espresso and ice cream quality were just wonderful, they didn't try to make anything fancy just beautiful fresh ingredients. I am so impressed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MxURTkzNj0vtewTm7ApzXA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Spring special pizza with zucchini flowers. They are my favorite food and SO hard to find. What a treat",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MxURTkzNj0vtewTm7ApzXA/o.jpg"
      }
    ],
    "user_id": "rJiQ0IfG3_mzFjB_TGC5_w"
  },
  "YrkaFGfX5nWph91dawcU6A": {
    "date": "8/4/2018",
    "text": "Amazing Italian food. Very good customer service, everyone was very friendly as soon as we walked in. Food came in very fast and super hot. The pizzas were very good in size, perfect for one person. They were delicious, the dough was crispy and soft at the same time, just incredible. Also tried the spinach ravioli and it was awesome, very soft spinach flavor on the inside and the tomato sauce was on point! Would recommend 100%!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dIrHcQGax3Gyi6tmv3K2tw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Calabrese pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/dIrHcQGax3Gyi6tmv3K2tw/o.jpg"
      },
      {
        "img_id": "a0nLXn9iZeaWUussK3yxdA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Prosciutto funghi pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a0nLXn9iZeaWUussK3yxdA/o.jpg"
      },
      {
        "img_id": "CAi8cp4kQxaUNRHVPvJ5uQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Vegetarian pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/CAi8cp4kQxaUNRHVPvJ5uQ/o.jpg"
      }
    ],
    "user_id": "5KMukumeMNkvnByscM5LYw"
  },
  "x_UJ7nj6qTvdij7YOCfd7Q": {
    "date": "5/2/2018",
    "text": "I've been here twice. My favorite spot in Charlotte, hands down! Great food, excellent service!  I've had the pizza, bolognese, the garlic rolls (from Heaven) and an excellent cappuccino!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "j2OEyVn9g3B8AEwzPwqOkg"
  },
  "txtUQ1pozSBirgRUT3g15w": {
    "date": "8/15/2016",
    "text": "Updated review is a 5 star!! There is table service now, I love the wine they have, the quality of the ingredients go above and beyond, pizza is never greasy, and they even have gluten free crust!! Just so good. Every time I've eaten here the food is fresh and beautifully created.  I will (proudly) inform you that I have only had pizza each time I've visited here, it's so good, I'm not ashamed of my massive pizza consumption ;)   You have an array of both traditional and unique choices and can even build your own pizza with the best toppings... I mean we're talking eggplant, zucchini, delicious ricotta, etc. The choices are plentiful and my boyfriend and I  just love coming here or getting takeout! Staff is always friendly and makes us smile.  I highly recommend dining here for a casual yet pleasant experience that will leave you completely satisfied after just indulging in a great pie.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "-mFsxwnY6s74tZY_n1bRlg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. I chose build your own pizza... GF crust with black olives, ricotta, eggplant. It&amp;#39;s just too good :)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-mFsxwnY6s74tZY_n1bRlg/o.jpg"
      }
    ],
    "user_id": "X86vXWcxSzuCfMJyOnx1UQ"
  },
  "tcRHK2NZ2iW71BOrv3G4WA": {
    "date": "10/22/2018",
    "text": "really good pizza.  excellent service and friendly staff.  I love the thin crust pizza not soggy and full of flavor.  very authentic full of flavor.  i'll be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YvVsjJaWm1mpbdv2sBz54A"
  },
  "xCJq1zLmU2wVhXpP-AvS_w": {
    "date": "3/11/2018",
    "text": "Seriously. I've driven past this place 100 times and just thought it was just another pizzeria. I had no idea it was going to take me right back to Italy...our neighboring table was speaking fluent Italian while we enjoyed this Burrata appetizer that was nothing short of the feeling of being in NYC's little Italy. Ok, that doesn't even do it justice, more like Rome's street side bistro....simple menu let us pick quickly and enjoy so much (I had meatball parmigiana that I requested extra sauce for, I couldn't get enough!). We ended up enjoying wine and two desserts it was THAT good.....I think we found our Sunday evening spot",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "T-QjLxA1wdvzNG2usjp-RA"
  },
  "vsu4ZGZiy3NyinUXzkfWoQ": {
    "date": "2/28/2018",
    "text": "Friendly staff and fast service, authentic vibe, and AMAZING food We started with the homemade meatballs and garlic rolls. The meatballs were resting in tomato sauce and were served with toasted Italian bread and a large scoop of creamy ricotta cheese. The garlic rolls came with a side of marinara sauce for dipping and each bite simply melted in my mouth.   The pizzas at Omaggio are thin-crust...this is great because it just means you'll be able to eat more delicious pizza.  We ordered the Calabrese and Hawaiian pizzas. The Calabrese was topped with homemade Italian sausage and pepperoni, while the Hawaiian was topped with pineapple and smoked ham. The Hawaiian pizza shuts the pineapple-on-pizza haters down! The sweet pineapple compliments the savory ham and cheese, making this combination flawless. Although the crusts were thin and crispy, the chef did not skimp on the toppings- the ingredients were fresh and the portions left you feeling full, but not stuffed. Both pizzas exceeded my expectations!  Next time, I plan to order the Margherita pizza and tiramisu AND I will definitely snag a seat at the bar to watch the pizza-making action from their show kitchen",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3obbLAmokiaxwNK9atHOmQ"
  },
  "zWfdE5ozknZkU6iPjIiYzQ": {
    "date": "1/17/2016",
    "text": "Best pizza I've had in a long time! Would most definitely return. Fresh ingredients, friendly staff, good wine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MP2aNiVUT-vwXIoArVxXUQ"
  },
  "Qy-JL42E0vhFsKa3IPPzHw": {
    "date": "3/13/2016",
    "text": "This restaurant was excellent.  It was nice being able to meet the owner.  The Margarita Pizza was very good.  The waitresses were very friendly.  My wife had the arugula salad which she loved. The Garlic knots very also a hit.  Would love to go back next time when we're in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RUlxSaeDPqiJbA0rXEbm2A"
  },
  "inV_gWeORI_npJsstQw05g": {
    "date": "4/3/2017",
    "text": "Stumbled upon this restaurant yesterday. So glad we stopped in. The atmosphere was great and the food even better. The prices were more than reasonable and the calzone was perfect. We will become regulars at this spot.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kbKPBZrv1rajRVMim0RUug"
  },
  "_anP34zo88fKAzUI2vD3Uw": {
    "date": "8/31/2015",
    "text": "We tried a little bit of everything. I agree with Gabrielle A, we also thought the garlic rolls were too garlicky and crunchy. It was an overpowering flavor- even for garlic lovers like us. We did like the pizza being thin and airy. The cannoli's filling was not very flavorful, plus they were a  little harder than we have had in the past. Drinks are bottled only and they charge a whopping $2.25 for a 16.9 oz drink which probably came in a bulk package. Tip for next time: get water. :)  We really appreciated the friendly servers and the manager making his rounds. He genuinely cared about the patrons' dining experiences.  The pizza is little pricey for quality and we may come back only if we're in the are or have a Living Social/Groupon.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "6tlC85J2zsHpnrtHp3qX6Q"
  },
  "EHwwXQ5Aq-yHMzqHdTHBmQ": {
    "date": "10/11/2016",
    "text": "I stepped into pizzeria omaggio on a whim today because a coworker and I wanted to grab lunch in metropolitan area. Immediately the GM or owner greeted us with a smile, helped us find the lunch menus, explained the lunch special, and told us about their season fall pizza - roasted butternut squash and onion. He was very helpful and easy going. We must have been there at the right moment because an instant rush of people came in right after us and I knew this must be a legit joint. I got the meatball parmigiana sandwich with a side salad and my friend got the Quattro Fromaggio pizza. I LOVED my sandwich, the baguette was large but light and fluffy while still crisp and crunchy on the outside, the meatballs were moist and very tasty with lots of parsley and fresh herbs. We loved our lunch and we'll definitely be going back. The total was $9.47 all included. I felt it was a great value and the interior and exterior were also top notch! Also the customer service was really good, you can tell the owner cares about the small details.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pm5OJx9d2w7OGwfB8Nyqqw"
  },
  "n3tuKri27enDmE4EHxGCzg": {
    "date": "11/14/2016",
    "text": "Very good, authentic Italian-style pizza. 5 starts for quality of ingredients, environment, back ground music, service and manager's attitude . I just wished my wine wasn't warm, that's all.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A2TJ9rQarY93f2qJXNfJrg"
  },
  "-KkJFxxkTyxs1c4WPeUN2A": {
    "date": "12/29/2016",
    "text": "This is the best casual Italian restaurant in Charlotte. Menu has a little bit of everything from appetizers to dessert and everything in between. Everything on the menu is excellent. I have tried them all. You can't go wrong. The wine selection is also excellent and reasonable. The owner and staff are friendly and very helpful. If you go once, you will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bz06CezCPcKg6_khmmrRfQ"
  },
  "qmIX4QztFeskiKygzvjscg": {
    "date": "2/25/2016",
    "text": "I only had a sandwich at lunch time, but it was pretty darn good, and it's hard to find eggplant and Charlotte so I'll be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_VVPeViIS3x_AIUFEhZ42Q"
  },
  "PK94FP9LV15t86-9BeDOXA": {
    "date": "10/25/2015",
    "text": "Outrageously priced for the quality of pizza/portion. I could eat two at a time and I weigh 145 lbs. It's also very bland. Cute atmosphere for a date night but otherwise I'd probably go somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UNWLAGypfwsdeUHf6tLE1w"
  },
  "goI46YjjXwWMuAVdxiOa_A": {
    "date": "10/22/2016",
    "text": "Outstanding experience! Meatball appetizer was delicious, as were our dinner pizzas. The wait staff was very friendly and service was perfect. Great location off the Greenway. Wine was fantastic and very reasonably priced. We enjoyed visiting with the owner, Daniel, who is an Italian... my husband and I visited Italy this past summer and can say this restaurant definitely had the authentic Italian flavor in his menu.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uwz-rqWeeyE9g8nTd6nfAw"
  },
  "iksyVG1uf9lU9-uq_XQMdQ": {
    "date": "11/21/2016",
    "text": "Fresh authentic Italian food set in a semi-casual setting. Delicious hand made pizza (watched them knead the pizza dough myself) and cheesy meatball Parma sandwich. Very affordable for the family too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q0o_Istqcvkgi8gHU7TGFw"
  },
  "8Ct5LETaG_pZnMjQWx9PXw": {
    "date": "9/13/2016",
    "text": "Tried it for the first time, and everything we had was excellent! They use top quality ingredients, and it makes a big difference. Best calzone in town!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_EUYpuwoLSdGyluDLtUI8w"
  },
  "bdQV4yzWPqlnXhoGVoBPbA": {
    "date": "4/13/2016",
    "text": "Reading some other reviews, I expected MUCH more from this place.  The counter service is a somewhat off-putting way to serve apparently \"artisan pizza\", that should be reserved for a standard grab a slice or whole pie to go kind of place.  Regardless of the ordering process, the pizza itself is very mediocre.  Being from the north (the land of real pizza), makes me particularly picky, but I have had much better pizzas in Charlotte.  The toppings were sparse, the garlic was thrown on in huge globs and seemed like an afterthought, the sauce reminded me of store-bought jarred pizza sauce.  For the gourmet prices, I would expect a more gourmet product. Honestly, the best part of my meal was the salad which was fresh and large. I would recommend many other pizza places before this one.  Sadly disappointed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "um2Wjv18kPQDyQkoqPhc3w"
  },
  "A0EyCz44qw1rTzin9USz4A": {
    "date": "7/25/2016",
    "text": "My husband and I were hungry because we had not eaten all day. We were attending a convention and did not want to eat hotel food. Saw the excellent reviews and gave it a try. Had margarita pizza and vegetarian pizza. Also had arugula salad. All was very good. Will come here again the next time we are in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KQ4Sk-uLgCWFc8WpujUIQ"
  },
  "TuFjVil49inYfeFJNaxxQQ": {
    "date": "11/1/2016",
    "text": "This is our favorite go-to Italian place! We've tried every pizza on the menu and still come back for more! The spinach ravioli is one of the best on the menu and the sauce is great for dipping the bread. The food is always fresh and the taste is consistent the manager is very nice and polite and stops by and makes sure everything is how it is suposted to be.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LzEVUyb_GZaFFS32HdYxXg"
  },
  "RiTtbTUqhEhmkwgawiaH0g": {
    "date": "10/16/2016",
    "text": "Pizza and pasta tasted good but the quantity to price is a bit low. My husband and I got a pizza and two pastas to have lunch and dinner in order to avoid going out again. It ended up just being lunch... Food was good and high quality ingredients, but we won't return as there are other Charlotte craft pizza's that taste better for less cost.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tBiZK2EMQEz0Tmn4aVEqEw"
  },
  "UlgxXCtxB23NVjqG2ORV0w": {
    "date": "4/2/2016",
    "text": "We were really excited to try this place based on the amazing looking pictures however were very upset to pay $28 for two personal sized pizzas... Extremely over priced for what they give you. Workers seamed nice but we felt like we got robbed.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "28xaaowl9geAO6Bl7ZKEnA"
  },
  "5gzbeoI4eH5Y7M8Ao8U5vw": {
    "date": "6/16/2016",
    "text": "I recently ordered takeout from here: a pizza, the eggplant tower, and the Caesar salad. It was all delicious. The pizza was not browned, which is the way I like it, and it had a good coating of sauce and cheese. The eggplant tower and salad were simple but also tasty. I deducted one star because the portion for the eggplant tower seemed a bit small given it is $9. I would order from here again for the pizza.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bxFv6HIAlb7G1SFhM7bgMA"
  },
  "hu4ezXtq3qaTYx1QK5h3Ug": {
    "date": "10/15/2015",
    "text": "This is the best pizza in Charlotte - hands down. Authentic Italian style means thin, crispy dough, the FRESHEST ingredients, and prepared, tossed, and baked by order. This place hits a home run on all of those points. I also tried their eggplant panini which was so delicious. I'm shocked this place doesn't have a crowd when we stop by but I'm sure that'll change. In my former city of Houston this place would EASILY have folks waiting outside the door. Real cute and comfy atmosphere as well with great service. Must try!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "OR2I7pbdh1iVxdcwQRCdmA"
  },
  "9hoVncGkE4x1ouvIzugvVg": {
    "date": "9/19/2015",
    "text": "Visiting Charlotte and found this gem, what a treat!!  Pizza Margherita was out of this world. As a NY pizza lover, I fell in love with this thin crust and savory sauce. The service was great and the new owners were very welcoming. Can't wait to go try some appies that looked great. I'll be back in Charlotte soon and will make it a first stop for sure. Recommend to your friends! Great addition to the neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "1C3abc7_Xsh_qd607tFWVQ"
  },
  "b7Z1aa6cH8PTRcSgFcRV-w": {
    "date": "2/18/2016",
    "text": "OK, You go to a party, meet a guy, he tells you he is going to open a restaurant, yeah yeah heard it a thousand times. Fast forward a year and one of the kids says...let's go to this new place, the pizza is really great. Well, guess what? The guy opened a restaurant and the pizza is outstanding, best in town. Crisp crust, lots of choices including a whole list of white pizzas, usually impossible to find even one. Think of it as that pizza you ate in Milan in some locals favorite place and have been looking for since. And surprise, a whole list of antipasti, salads, soups and pasta for that one family member that say \"not pizza again\".  And a kids menu? Yep. (Don't worry it's not date unfriendly, take her there)  The atmosphere, slick, outstandingly so in a casual sort of way. The place looks like a B&B Italia Cafe. Friendly staff, yes the owner is right there and remembered me. Nice list of wines by the glass and the bottle, some very cool beers And guess what.... its very reasonable, really reasonable. This should be everyone's go to place for casual dining and pizza. What a lucky place Charlotte is to have Omaggio. Go there, now, today. I'm not kidding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TCr-9AybM2pcBctKcN4gyg"
  },
  "V0BFDrVUfTKBF3SDcCJ_pA": {
    "date": "4/2/2016",
    "text": "Not somewhere I'll order from again. Servings are very small for the price. Disappointed in the food. Only reason I'm giving them 2 stars is for the staff. Lovely and helpful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xLW-LFjimfjU5Cn8HesOrA"
  },
  "5KFUAra2HBF8TWk1zCgiMw": {
    "date": "7/11/2019",
    "text": "Excellent choice for lunch or dinner. Extraordinary culinary delight! Terrific service in a convenient location! Pizza and salads and desserts!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ymR6icvTRdeY35w5_5d2Pw"
  },
  "EekeXyAYGXYs3hFIe8KLzQ": {
    "date": "3/31/2019",
    "text": "Outstanding and authentic Roma-style pizzeria in Myers Park - the pizza of the week cycles offer some incredible flavor profiles - today's was a saffron crema with fennel Italian sausage and pear/gorgonzola- fabulous thin crust. Super yum! Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m9_-1Ec7q5O6KfeU-G9S0g"
  },
  "FYAAAoARch5wozwpanngqw": {
    "date": "8/18/2018",
    "text": "Small pizzeria located in a great part of up town. Clean, with a nice aesthetic.  Upon our arrival we were greeted and sat quickly. Once at the table it took close to 15 min to have any one come to the table which was a little frustrating. How ever once the server came to the table he was incredibly apologetic and very nice. Service was great over all.   The food is Fresh, delicious, and taste authentic.  We had the bruschetta as an appetizer. A white pizza as an entree. Cannolis and pistachio gelato for dessert.   Everything was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "jHRh7f5JSu3TLHgaNM7WlQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/jHRh7f5JSu3TLHgaNM7WlQ/o.jpg"
      },
      {
        "img_id": "9Rv3FnObw5nekgpuaz2Pyg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9Rv3FnObw5nekgpuaz2Pyg/o.jpg"
      },
      {
        "img_id": "3Pe_sp8umxh2Dak3qy-iWw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3Pe_sp8umxh2Dak3qy-iWw/o.jpg"
      }
    ],
    "user_id": "gIPRbmZnNivWEZ-dPoZa3g"
  },
  "1K89vYywyhR44OG4APNY5Q": {
    "date": "7/6/2019",
    "text": "Nice environment and comfortable area for our group of 8. The pizza was sub-par, there are about 6 slices per pizza which was a good size, however the pizza was little on the greasy side. If you are a fan of white pizza (no sauce), this is a good spot!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "F1levYI5B4e-gOEj6uw0Kg"
  },
  "NbCIPCnH3og3yxhv-dvUsg": {
    "date": "12/21/2017",
    "text": "Pizza lovers, rejoice. I, finally, found a great Pizzeria in Charlotte.   As a sucker for pizza, I was on the hunt for the best pizza in Charlotte, during my short stay there (four months.)   Disclaimer: I am not a pizza expert, but a pizza snob. I know the difference between an extraordinary pizza from a abysmal one from the very first bite.  Pizzas at Omaggio are thin-crust, bready, and chewy. I've tried few and those made it to the top of my list:  - If you are a cheese lover, try the Tre Formaggi pizza.  - If you are more of a top-centric, get the Funghi pizza.  - Even if you are a classic pizza type, the Marinara pizza will not disappoint you.  - Craving something else, how about a taste of heaven with a cheeeeesey, hot Calzone, or a hearty and flavorful Rigatoni Bolognese. - Ready for dessert?  Get the gooey Nutella with fresh strawberries pizza made a scrumptious dessert pizza. What better way to end your meal that pizza dessert!!!  Specials: - Lunch: Mon-Fri 10:30am-3:00pm Pizza starting at $9 with soft drink. Panini starting at $9 with spring mix salad or rosemary potato chips and soft drink. - Monday 25% All pickup/ takeout orders after 4pm. - Tuesday and Wednesday 1/2 price wine bottles.   P.S: Omaggio means to pay \"tribute\" Kudos to Chiara and Oscar.   Four and Half Yelps.",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 8,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "1ZLkdooam5CzWAzyAB1rmQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Nutella pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1ZLkdooam5CzWAzyAB1rmQ/o.jpg"
      },
      {
        "img_id": "1i9zIIHjcIRZCEIBiLMNgg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Margarita with mushroom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1i9zIIHjcIRZCEIBiLMNgg/o.jpg"
      }
    ],
    "user_id": "N9hqTPQu2bmI8c2Pj8F1ww"
  },
  "qlIeL2u_PVFg4xIBhqZuQA": {
    "date": "8/9/2019",
    "text": "Best Italian food in charlotte. Haven't had this good and fresh of food in so long. Wish i could eat here every day",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XP33zoFsOY3JbNcUE0YtpQ"
  },
  "2MQvH6ACpkWMhN6B19fanA": {
    "date": "12/29/2017",
    "text": "What a gem of a pizzeria in Charlotte! Delicious thin crust pies, chic atmosphere, and the friendliest service!   I came here on a Saturday night with a small group and we were seated immediately. I love that they're open until 10 PM on Friday and Saturday. We started with a Caesar salad, which was delicious, and big enough to share among several people. Since we weren't starving, we ordered 2 pizzas for 4 people. The pizzas here are thin crust, so it's easy to eat almost an entire pie!    The Margherita pizza was simple but wonderful -- the fresh mozzarella and basil made this pie simply divine. I also enjoyed the Prosciutto Funghi pizza -- such a great topping combination. My only regret is not saving room for their tiramisu, which looked incredible.   Everyone who worked here was super friendly and helpful, which really topped off our great experience. I'm so glad to have found such a great pizzeria in Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "sY8ckhpssY3AnopXqIg_YQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/sY8ckhpssY3AnopXqIg_YQ/o.jpg"
      },
      {
        "img_id": "SMQ_pfr-dN2Q1laKe-AjZA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Margherita",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/SMQ_pfr-dN2Q1laKe-AjZA/o.jpg"
      },
      {
        "img_id": "pmvI9Yrk9KFioGSoAIk-zQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Prosciutto funghi pizza, yum!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/pmvI9Yrk9KFioGSoAIk-zQ/o.jpg"
      }
    ],
    "user_id": "Zy2CsKycXRDizxRxzhRFbA"
  },
  "1zK0-s-vKruhE0qO7PBNKA": {
    "date": "6/27/2019",
    "text": "Eat here almost weekly. The pizza is perfect. A nice crust. The calzones are delicious. Many wine and beer choices. Tiramisu is perfect!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exwWGBCGMYHvOqi9BYhOmA"
  },
  "MpNMPEGuSSLSnZ1Sf0iRfQ": {
    "date": "2/27/2019",
    "text": "This little jewel in Charlotte NC is a must if you are in the area and love real Italian food. All homemade and freshly made everyday. * Pasta Fagioli* is the best I've ever had!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-VVzqOrI1kZ0mF84unLbhA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-VVzqOrI1kZ0mF84unLbhA/o.jpg"
      },
      {
        "img_id": "raVaN2j_SZp4ykHkY7W58g",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/raVaN2j_SZp4ykHkY7W58g/o.jpg"
      },
      {
        "img_id": "13cDLBNxat6fOot6yuQj5A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/13cDLBNxat6fOot6yuQj5A/o.jpg"
      }
    ],
    "user_id": "_5FvepGFJv8ukktk5gAuyQ"
  },
  "CiYyeYbD7dvqztvXBfWHDw": {
    "date": "1/15/2018",
    "text": "We went here for lunch one day at work. I was pretty impressed.   We had no wait to get seated and the service was pretty fast. They were friendly as well.   I got a build your own pizza with meatballs, prosciutto, roasted red peppers, and artichoke hearts. I decided to get it on their wheat crust which I probably wouldn't do again. The crust was kind of dry and didn't have good flavor. The pizza itself was pretty good though. My husband got the meat and cheese board which he really liked.   All in all, I didn't think it was as good as Inizio, but I still enjoyed it and would come back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TDo-B8-iIoYHfHiZAvObiQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Build your own pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TDo-B8-iIoYHfHiZAvObiQ/o.jpg"
      },
      {
        "img_id": "9dH5nmio_SW1HTUy5t5p1A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/9dH5nmio_SW1HTUy5t5p1A/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "gNpTw1ezIanqaUIO6mTcVw": {
    "date": "1/13/2018",
    "text": "Had an excellent time here with friends! We came in around 8ish on a Saturday night and it wasn't too busy. The waitstaff was very attentive and, not too long after sitting down, this adorable older man was caught looking at us and then came over to chat. He asked us if it was our first visit and it turns out he was the uncle of the owner and we helping out for the evening. He was such a sweetie and continued to come check on us. He even brought his nephew, the owner, Daniel, over to meet us all. It was all super personable and they even brought us a mini cannoli each at the end of meal \"in honor\" of our first visit. It was an excellent experience!  Their wine list also has a good variety at great prices per glass! A few dollars cheaper per glass for the same wine as we had at the wine bar we just came from.   The pizza is also very yummy, personal sized, and has super thin crust. I ordered the Rustica, which came with a red sauce, mozzarella, cherry tomatoes, roasted chicken and arugula. There was a lot of arugula, which the waitress warned me of, but I really liked it. The only flaw with such thin crusted pizza is its inability to hold a lot of toppings when you pick it up to each it. Also, the cannoli are amazing.   Can't wait to return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "6pjet3GHu6f00arXGQS40A": {
    "date": "7/24/2018",
    "text": "Place got some solid thin crust pizza. Nice little outside place to eat out. The restaurant in & out is kept well clean.  Server was wearing by far the most unique apron I've seen. I had the vegetarian pizza, no complaints here.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QOko-xveQqHYR7GYhjjvZA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QOko-xveQqHYR7GYhjjvZA/o.jpg"
      }
    ],
    "user_id": "Y2YB9v-59Ruu2svIFGvqIA"
  },
  "PTHUm9HDmEwEd25G00wS8w": {
    "date": "8/16/2019",
    "text": "The pesto spaghetti with chicken was the best pasta I've had in my life! Great service, super friendly people.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fT5ZgJZ09MqTQQcATiYZBA"
  },
  "pXdmaCgUOeuwdTqG9B1ZCw": {
    "date": "3/9/2019",
    "text": "I've driven past this Italian restaurant (so much more than just pizza) in the Metropolitan area and finally stopped today. I was reading the menu stanchion on the outside patio and a really charming older man (who turned out to be the owner's very authentic Italian uncle) walked outside to greet me, explain the menu, and welcome me in. How could I say no!!!  I'm glad I did. The prosciutto funghi pizza, eggplant tower, limoncello spritzer, pear mimosa, Pinot, cappuccino were all I had hoped for. Service was even better and felt like I walked into an Italian family kitchen. Clean, modern. Open kitchen. Great experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DpaDmBxe3OXtr_GCsfcUgw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Prosciutto Funghi pizza",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/DpaDmBxe3OXtr_GCsfcUgw/o.jpg"
      }
    ],
    "user_id": "1dDmbnql8nv182CExvNMPA"
  },
  "EtFflaZ6gFUHfcFCeQ9Yjw": {
    "date": "2/11/2019",
    "text": "This is not at all what I was expecting from a strip mall pizzeria. The insides were more suited for a casual dining experience. I was the only customer and I appreciated the fact that the music was low enough to not be distracting. The menu was diverse and had a good selection. I ordered the rigatoni bolognese. And it was served in a timely fashion and was hot. So as not to give the impression of coming from a vat. I would return for another meal the next time I am in town. I would like to see how they handle a busier dining room.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OQr37kJrKgE-qeLje4sFUA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OQr37kJrKgE-qeLje4sFUA/o.jpg"
      }
    ],
    "user_id": "4MK7VrmQi23buiWSeRi8pA"
  },
  "1Y2sIL6r_yr7KycbpxYKQQ": {
    "date": "4/19/2018",
    "text": "What I ordered: Regina Margherita Pizza  Service: Excellent- 9.3 out of 10  Pizza: Excellent - 8.9 out of 10  Price: Average - 7.3 out of 10  Atmosphere: Business Casual  Repeat: Yes!   Great place with great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "y37vrXKAvWOQjOJQE-9AtA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/y37vrXKAvWOQjOJQE-9AtA/o.jpg"
      }
    ],
    "user_id": "9tAAV1mEV8ILFrCx1C4oMQ"
  },
  "2YYI0TyNdXVPn4ybPyXlFg": {
    "date": "12/29/2018",
    "text": "Loved this quaint adorable place!!  Not at all what I was expecting!!!  I thought this place was just another fast food pizza place! NOT. AT. ALL!!  My Caesar salad was very fresh!!! Very yummy!!  The spaghetti with marinara was very tasty as well!!  The restaurant was very clean and service was good!!  I will definitely be back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k-_ww50hnX50DR0F15vWSg"
  },
  "dSlkxcTzDcYoBC_jIrJwIQ": {
    "date": "12/28/2018",
    "text": "Pizza and I get along quite well, some might call us best friends on a Friday night out. But I want to hang out with this pizza on a Tuesday night at Omaggio. Tucked in a quite unsuspecting (and quite corporate) shopping center, I was reluctant to walk into a place that had similar experiences to Blaze. Well was I surprised!   The staff was just enough in tune to the tenor of me and my guest as they were to my inability to pronounce words in their native, Italian tongue. Welcoming, I felt at home and delighted with the idea to finish my meal with a shot of espresso that perfectly polished off the meal. If I wasn't just visiting, this might be a place I would go to more often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xRUY8Art84uQwPfMLxsgig"
  },
  "hYUmFqHibBhCU466Eml-Nw": {
    "date": "7/20/2019",
    "text": "Not only is it the best pizza and italian restaurant, it may be the best restaurant in Charlotte.  The staff is amazing and friendly, and the food is as well.  Also very inexpensive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cVfJJq9wEOf3X9rhQc_t1g"
  },
  "JT3enhILTVt9R79WtdhDBA": {
    "date": "1/18/2018",
    "text": "This. Place. Was. Legit.   My friend and I were just in search of a really good calzone. Stumbled across this place and we were NOT let down. It was a bit more fancy than we anticipated but our waiter (wish I could recall his name now) made us feel totally welcome and ushered us in with a warm greeting accompanied with a gracious smile!   The pictures don't even do the food justice. Best pizza I've had in years. Hands down. Thanks Pizzeria Omaggio for warming our souls, hearts and bellies on this cold night!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mMGl5NBAv4DoSZMpKPswZA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/mMGl5NBAv4DoSZMpKPswZA/o.jpg"
      },
      {
        "img_id": "rYziRQ9VyLhfqHL1AnRahQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/rYziRQ9VyLhfqHL1AnRahQ/o.jpg"
      },
      {
        "img_id": "_vHSW-IhuM7IhYvieosTxA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_vHSW-IhuM7IhYvieosTxA/o.jpg"
      }
    ],
    "user_id": "zqXfVR6WbLUFgnb_jBs4cg"
  },
  "TiHeDfRrBbS5-9n2h3MPxA": {
    "date": "8/22/2015",
    "text": "Terrific Italian style pizza. Great staff, fresh atmosphere. There are a lot of pizza places in CLT--but we haven't found pizza like this--True Italian style--anywhere else in the city. We had the classic Margherita and the Omaggio Special--both were delicious and so were the leftovers- one pizza is enough for two people. Easily worth a stop when shopping around Metropolitan.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "1_nzR0ByhOscRcAXnBSjxQ"
  },
  "uk6X5-5ZaNgLxwUxJ7sq8g": {
    "date": "9/6/2015",
    "text": "Awesome, awesome pizza!  Best in Charlotte.   Delicious.  Great service. Great new addition to Charlotte restaurant scene.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 6,
      "cool": 0
    },
    "photos": [],
    "user_id": "2GvDT2UOirpFMCskhM3jcg"
  },
  "lOVYUqhJYDe202T9BfDI2w": {
    "date": "11/5/2015",
    "text": "Awesome.  Great place. Must go. Excellent pizza.  Great owner.  Good beer.  Pepperoni pizza....added garlic.  Loved it.   Spinach salad very very good.  Dressing great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "q-60qvKsjFcYVeYmu8noIw"
  },
  "LXRQw0eQ1mS8PrTzutjrVw": {
    "date": "10/15/2015",
    "text": "Amazing food, great service. Their take on classics like the Garlic Knot, and Ricotta INSIDE the Meatball.. just stop! hehe, I don't want to take away from this place at all, however I will say if you find yourself hungry and north of WT Harris, I would strongly recommend Antonio's Pizza, their food is amazing as well. The Chef, Tony B. Awesome guy, and makes the dish right in front of you. It's a great alternative if you find yourself across town. Just saying. All in all, Omaggio is killing it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "mYWYVoQwR4BEhDoh9b8pEA"
  },
  "jNBL2CK7yotxM2NgUdwspg": {
    "date": "3/5/2016",
    "text": "Absolutely love this place. Great service, owner is very friendly, anyone who has helped with our order has been wonderful, and food is always delicious! My husband and I have loved it since the beginning. Our second time coming, we had our puppy with us and we're hoping to find somewhere that was OK with pets. It was summer time and a beautiful day to sit outside, the owner said it is completely ok for us to have our puppy sit with us while we eat. The third time or so we came, it was our birthday (husband and I have same birthday), and were given complimentary AMAZING cannoli's! Have never been disappointed. Now we have been there multiple times and will keep coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THN_USsmihNZnYWa2ALwxQ"
  },
  "2O5KznK_bOri3yO23WPkow": {
    "date": "9/20/2015",
    "text": "I have lived in Charlotte for a year now and this is the best pizzeria I have tried in here - hands down!!!  I should mention that I am from Italy and I know what to expect from a good pizzeria. At Omaggio they only use fresh and quality ingredients and this clearly reflects on the quality of the pizzas.   Daniel, the owner, was very welcoming and since this was our first time there, he offered us complimentary appetizers; I have never experienced such thing in Charlotte.  I would recommend the place to all my friends and acquaintances and will definitely be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "3KEZlom6yVbMLKZtfrtWMA"
  },
  "wAcsVAeQ00--XI6ja40Mqw": {
    "date": "9/21/2015",
    "text": "Great Pizza - True Roman style. Great and friendly staff. Worth the pilgrimage if it's not your local.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "3iNQ0trZbAvAgM1Rc3ZpqQ"
  },
  "N-w78Oxbamun1PLtJlkfew": {
    "date": "1/23/2016",
    "text": "This was my fist time eating here and I would definitely come back ;) The pizza was delicious and the service was outstanding ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Twno0Fx5tGj0fiVo-Y40EQ"
  },
  "D3pbMohj51YiiHAOLrE_uA": {
    "date": "9/8/2015",
    "text": "Was craving Italian and stopped by to check it out. The garlic rolls were amazing!!! I ordered the Tutto Carne Pizza. I gave it a shot and I fell in love with it. It was very good. I found a place to go back for the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "RBRFWHuBJiC_QhzrHQ-eJg"
  },
  "5Rw_I8XbrOd1fmGKD4pfbQ": {
    "date": "9/11/2015",
    "text": "I've been here twice now. Both times for the pizza lunch special ($8.99 includes 12 inch thin crust pizza with about 5 topping options, and a drink). The taste and texture of the crust, sauce, and toppings has been on point both times. The Margherita pizza especially is pretty dang close to the real deal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "Rp86UkjNQk3w1J-ikNHsJQ"
  },
  "Hg0FqR0dIT2SrBfo5a9Nhg": {
    "date": "2/22/2017",
    "text": "Great upscale pizza and salads.  Pizza is amazing thin crust with fine toppings.  Intelligent and friendly service. Nice wine list.  May be the best pizza place in town.  Not cheap but the quality of the ingredients, preparation and presentation make it worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JPFdagmxB56H3XKG3nRD1g"
  },
  "GFSFZC9BmPCY9G1rvFVMvw": {
    "date": "9/14/2015",
    "text": "Friendly staff and absolutely delicious REAL quality pizza. We love this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-iercfaFg8Wc3XZfSKmTw"
  },
  "-vPfBgCxVB6mSskPUlIG6Q": {
    "date": "9/7/2015",
    "text": "I normally don't write any reviews on pizza places bc I was spoiled growing up with my dads Pizzaria in Brasil. The pizza places in America that I've tried has never even came close to the pizza I'm used to. I must say Pizzaria omaggio has done its job and I'm afraid to say this but it might beat my dads Pizzaria. You can taste the freshness in the ingredients and overall this place is amazing. I would definitely come eat here couple times a week. Just go in there and try this place you for yourself you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "JMyrojO0Fyjh9dOcKVRpBQ"
  },
  "GZIGz3qn7MROv3ndfd43Ow": {
    "date": "2/13/2016",
    "text": "One word, Amazing!!  Authentic Italian pizzeria with real ingredients and staff who goes the extra mile to make your experience a great one. Next time I am in Charlotte we will definitely be back to explore menu further.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C_grn4xXjQtl58fcmU6LYg"
  },
  "-ka-YvMGeZuSPRy5neSLYQ": {
    "date": "9/18/2015",
    "text": "We really enjoyed our dinner at Omaggio, service was attentive and the pizzas we ordered were great.  Great quality ingredients and very authentic Italian pizzas not your over sauced or drowning in cheese.  Only complaint was my husband felt the dough needed more salt, I thought it was perfect.  We'll definitely be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "vTzZjJDyOFtpP13XkDBU2w"
  },
  "La799H65VYfks_ayRYtmjA": {
    "date": "9/10/2015",
    "text": "They have awesome, authentic italian pizza on thin crust, made fresh when you order! It always smells wonderful and the staff is super friendly! I love it here and the salads are also really yummy, my favorite is the Arugula. I'll keep coming back :-) Thank you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "CNUIMSJtYIqvW77xsEM05A"
  },
  "AW7Z8GMNoy3oDu8xX2pxIg": {
    "date": "3/12/2016",
    "text": "Very clean and nice atmosphere for a quiet dinner with my husband. Food was yummy! I ate the margherita pizza and he has meat-lovers. Both were good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VWFlB5q4nBNNGvucn-fNug"
  },
  "lkrKIpRxQ-rsQzJNAkJuQg": {
    "date": "5/4/2017",
    "text": "Yummy food and the garlic rolls are heaven in your mouth :) Will definitely be back to try other dishes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lkJFPdPMtb3Ph2Gy82x46Q"
  },
  "rYl0NMp0Hq_5SfNNN6k4sA": {
    "date": "2/23/2017",
    "text": "Amazing service and the food is always top notch. This has become our weekly pizza stop. Highly recommend the omagios special pizza. Also love their soups and apps.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1-xyCVMt3Hv_3iaHMAC2A"
  },
  "vFdoBd2EyNp_CV2E5ZrxWQ": {
    "date": "2/11/2017",
    "text": "Great thin crust pizza and fabulous salads!! There are varied appetizers and pasta on the menu as well.  We are Italian food snobs and loved this Sicilian style pizza !  We will be back for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsPIakiKC8TL0pxgrxClTQ"
  },
  "NT6rDJjqwhBsjAl3EIA1gg": {
    "date": "9/13/2019",
    "text": "A warm and friendly authentic Italian pizza shop/restaurant in Charlotte.   I ate here with a friend and we were greeted by the manager and a waiter the instant we walked in. Think about the last five restaurants you went to and how many times that has happened. Probably zero.  The meatballs were excellent. A little pricey but still recommended. The garlic bread was outstanding,  and I usually don't like garlic bread. My friend killed the cheese.   Very good thin-slice pizza. I might try a pasta dish next time. Tiramisu was off the charts (that's a good thing). Gelato was very good.  Clean, great service, very good food. Family-owned, which probably has a lot to do with the service. Definitely recommended.",
    "rating": 5,
    "rated": {
      "funny": 21,
      "useful": 49,
      "cool": 47
    },
    "photos": [
      {
        "img_id": "eVqT6t43G74E5tyGNqoWJA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Italian bicycle",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eVqT6t43G74E5tyGNqoWJA/o.jpg"
      },
      {
        "img_id": "WdHestKEizSdjFrmE0G7AQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The crew",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WdHestKEizSdjFrmE0G7AQ/o.jpg"
      },
      {
        "img_id": "Gi4VqeQir_e7k-O9_IJepQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Not sure why I took this picture",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Gi4VqeQir_e7k-O9_IJepQ/o.jpg"
      }
    ],
    "user_id": "3gRfkaVcEWri-Ju7OQX7uQ"
  },
  "4vbd7sPEtr1xkv8lIG70kg": {
    "date": "7/1/2019",
    "text": "Went online to check out which pizzeria in Charlotte was rated #1. Pizzeria Omaggio was the top of the list. So we went there for an early dinner. Our Venezuelan waitress was friendly and helpful. Based on the reviews, I wanted to try the Margherita Pizza. Knowing it was super thin Italian style, we ordered a second pizza: Calabrese (at the suggestion of our waitress) with N'duja. Folks, if you like thin crust Italian pizza, this is THE place in Charlotte! The Margherita Pizza was nearly perfect. Have not had one this good since being in Italy a year ago! Great crust, tasty sauce, just like the old country (I prefer a little more fresh basil though.) The Calabrese Pizza with the 'Nduja spice on it was better that I could have ever asked for. I should'a taken a photo of that pizza. What is nice about thin crust pizza, you do not have that bloated, stuffed feeling afterward like regular pizza. Our waitress suggested the Tiramisu for dessert. Of course we followed her advice. Again, she was spot on. The chef did a great job on that item too! Overall, I love this place. Got to chat with the owner for a bit. We are here in town for a couple weeks. I guarantee we will be back a couple times more to try other things on the menu! There is a reason this place is #1!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0VcDTryBjEuhGAFcQJ5vuQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The Margherita Pizza at Omaggio Pizzeria.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/0VcDTryBjEuhGAFcQJ5vuQ/o.jpg"
      }
    ],
    "user_id": "n0amJ0p8b9pCfPcEACYwLg"
  },
  "-rQKTpZPwLLvmSjA0LNOfw": {
    "date": "5/31/2019",
    "text": "I found Omaggio Pizzeria on Yelp trying to find a restaurant in Midtown, and I'm so glad I stumbled across it. It's a cute restaurant with some patio seating, as a heads up for people who enjoy sitting outside. It has a nice view   I ordered the Arugula Salad which was fantastic. I'll be back to get this again. I should have stopped with that, but I also ordered a cheese pizza to try which was also good. It is thin, Italian-style pizza. Definitely make sure to check this place out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ec083MQy5vBzj2nooDN9-w"
  },
  "bYCB5v1212IKVikELe2lEg": {
    "date": "5/25/2019",
    "text": "Love this place! Tucked away in Midtown, cozy and posh setting. This place is perfect for date night, a night with friends or a night out with family! The food is great and they have a nice drink selection!   If you have your little(s) with you, take them to the pizza bar to watch them in action!   Whatever you do, don't skip out on dessert! The brownie -- YUM!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "0eaD3KxhnSNbUfjV04EcEA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Hazelnut brownie with ice cream",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0eaD3KxhnSNbUfjV04EcEA/o.jpg"
      },
      {
        "img_id": "ft8H3Lgptvf505bjO9_UnQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Kids butter pasta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ft8H3Lgptvf505bjO9_UnQ/o.jpg"
      },
      {
        "img_id": "YeKP0KXrHYSNo3iWlet3CA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Tre Formaggi",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YeKP0KXrHYSNo3iWlet3CA/o.jpg"
      }
    ],
    "user_id": "PMEK5fq3B_YAMfR8urwBtg"
  },
  "6ezwcX3NWbDjlp4T_xmWow": {
    "date": "7/27/2019",
    "text": "Really impressed by the quality of the food and the excellent service that our waiter gave us. He went above and beyond on explaining the menu and made sure our first time at Omaggio was a great experience. Our waiter was Turkish, I apologize because I forgot his name but he's the best! Now let's get to the food part, I ordered a Chicken Caesar salad along with Bruschetta, and the Trio Pizza. Everything was fantastic, never realized how much better it is if the bread of the bruschetta is really thin. It's not a piece of bread that you have to tug with to get the perfect bite. The salad was also great, and the pizza was perfection. The ricotta gave it such a fantastic taste and I loved the sauce that's on the pizza. Thank you for having us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "R-kWX4OFQo7-Jo1X2OaHhw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/R-kWX4OFQo7-Jo1X2OaHhw/o.jpg"
      },
      {
        "img_id": "hSnnLrWZELr2A5IB8yytwQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/hSnnLrWZELr2A5IB8yytwQ/o.jpg"
      },
      {
        "img_id": "lRC-58DAg1Hst2mZb-cMCA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lRC-58DAg1Hst2mZb-cMCA/o.jpg"
      }
    ],
    "user_id": "J2oYUy_l7PI0vpersBY-BA"
  },
  "ibw41FyOE5FCFqhBi_qJjw": {
    "date": "3/12/2019",
    "text": "I'm obsessed.   The staff was fantastic. Attentive, friendly and knowledgeable on the items. Great recommendations were made--first and foremost, the staff made the experience a 5.  The location is a little tough because parking can be frustrating in those garages--but once you find a spot, it's worth it. I loved the lighting in Omaggio, because of the windows in the front it was so sunny and bright.   The food was delicious. Hands down. We went for lunch and they have a smaller lunch menu with some great specials. We both did the sandwich with a salad and a drink. I had the Sicilia which is a roasted eggplant sandwich with a Caesar salad. The salad was so good--I was one step away from licking the bowl. The dressing wasn't too salty and they don't toss the lettuce, so you're not feeling like your drowning in it. This salad was recommended by our waitress. My sandwich was fantastic. The bread...we couldn't stop commenting on the bread the sandwiches came on. It was soft in the middle and crunchy on top. All ingredients tasted fresh and bold. We could not stop complimenting the food.   What a wonderful experience, cannot wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ApvOexWFH2gs3PSY-JGW_A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Eggplant Sandwich with Caesar salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ApvOexWFH2gs3PSY-JGW_A/o.jpg"
      },
      {
        "img_id": "q6xm3mxD7GzhEIoaoIluWw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Italiano Sandwich with Caesar Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q6xm3mxD7GzhEIoaoIluWw/o.jpg"
      }
    ],
    "user_id": "ehqxXKlMjg0H3FkxCySXiA"
  },
  "5VMmbuT88Ea2h-qXPgbRkw": {
    "date": "9/11/2019",
    "text": "Love this place. We frequent as it is close to our shop and the food is always great, service friendly and atmosphere is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s-P2fFNbbC0S4beKDvnrsQ"
  },
  "YcHb6RF6efWdV42Is74IOQ": {
    "date": "7/31/2019",
    "text": "Absolutely one of the best places to eat in metropolitan Charlotte. The owners make all of their food with pure love. Taste like a homemade Italian meal. You can't go wrong either if you go with pizza or pasta entrees. The service is always great, some of the friendliest staff. Super beautiful view if you sit outside or even inside with full open windows.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ONYHcKXWPW8f-MmLk7n71A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Tiramisu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ONYHcKXWPW8f-MmLk7n71A/o.jpg"
      },
      {
        "img_id": "OqxAo2V6DvTpaNw3Tzl-8Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Beautiful velvetty cappuccino",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OqxAo2V6DvTpaNw3Tzl-8Q/o.jpg"
      },
      {
        "img_id": "PuF2iDlrKXvaoiX0S9xI0A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Meatball sub and ceasar salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PuF2iDlrKXvaoiX0S9xI0A/o.jpg"
      }
    ],
    "user_id": "-ES-4TU3fLQk1ixawrIXuQ"
  },
  "qimQWZNSdyaRFJ8CkRV35Q": {
    "date": "7/14/2019",
    "text": "Ordered through postmates and this was a good meal ordered pesto pasta which was very good and tasty, homemade meatballs YUM! Was overall a very good meal and held up through delivery.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rW3jfs9TLzvm9Xc3d6kaTg"
  },
  "_CLomel9r4NZ1WulzFNrAg": {
    "date": "9/7/2019",
    "text": "Easily the best pizza I've had since moving to Charlotte. Great atmosphere and very attentive staff. Would definitely recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k2vwG65gfa6fT-X_xpiVUQ"
  },
  "NJXxnvgC1WdbQUThQNzXMw": {
    "date": "9/2/2019",
    "text": "Fantastic, absolutely love it. Great staff, better food. Very authentic ! Will definitely be returning next time I am in charlotte !!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cPfCW1rHeyo58p82WOm_nw"
  },
  "Q6TVeDlU9RMVHfLB9zeo9g": {
    "date": "9/5/2019",
    "text": "DISGUSTING!!!  I ordered lunch through uber eats and was a little concerned that the quality of the food wouldn't stand up. What I didn't expect however was the fact that the food itself was just INEDIBLE! I ordered the meatball sandwich and honestly I've had better meatballs at SUBWAY! They're advertised as \"veal\" but the overwhelmingly LIVER taste says otherwise! If I wanted ground up ORGANS/subpar meat, I would've just gotten TACO BELL and saved about 15 bucks!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IsaLA-kGUQeOYrE_OeOV5w"
  },
  "LoZjlIUQEhysmhKGtJ5QrA": {
    "date": "2/15/2019",
    "text": "This place is legit. Italian owner, quality products the food is always fresh... been there more than once and definitely recommend.   Meatballs are delicious. Trust me on that one. Not even italian grandma was able to make such deliciousness. They always end up on my plate.  The Pizza has a really nice thin crust, today I ordered a 3 cheese and added some good stuff I love to have in pizza (ham, salami, onions and garlic). Have ordered the calzone before and it's also a solid dish.  I don't take much photos of food but today I just couldn't resist... The pizza was not only delicious, but beautiful.  Outdoor sitting is always a plus specially if you like to enjoy the mild winter nights of Charlotte or just sit outside on a warm summer night.   And one more thing: the tiramisu is something you have to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "e8z12YfK94eHYfYsigjuQA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/e8z12YfK94eHYfYsigjuQA/o.jpg"
      }
    ],
    "user_id": "LQe89VTqQM-41Ci7O84cNw"
  },
  "Lfc7Lv6x-HFbFUFj_g5FBg": {
    "date": "8/16/2019",
    "text": "So, I was curious about the food and this place So I dropped by for lunch and ended up coming back for dinner. This is probably the best Italian place I've been to in clt! Quality of the ingredients are superb, probably as close to Italy as you can get. The food was so flavorful, not that bland tomato sauce that you get at other places. I will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_G0TLb58oeXV0kj_lUia3Q"
  },
  "WPGbSaJ7nX12UnztAEhIvA": {
    "date": "11/20/2018",
    "text": "THE only bad thing I can say about this place is the lighting.  Although I get that it helps in setting up that certain pristine ambiance, it felt a bit austere...if that's the right word to describe it?  THAT aside, I loved this pizzeria...from its intimate-yet-chic ambiance, to super-friendly, Italian service.  Most of all, I LOVED their pie crust!  I absolutely love thin and crispy crusts...and this place knows how to do them right!  After checking out some Yelp pics, I decided to try their \"Trio\", and I definitely made the right choice.  Possibly one of the best pizzas I've ever had!  Their side order of Caesar Salad was also quite fresh and tasty.  Overall, this pizzeria is amazing good...and think it deserves the best rating!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "AorT9U_fQzjov_p6DVhMIQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. &amp;#34;Trio&amp;#34; Pizza - OMG Good!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AorT9U_fQzjov_p6DVhMIQ/o.jpg"
      },
      {
        "img_id": "NNs0GZ3vGowEv7ps4rFBqQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Caesar Salad - Side",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NNs0GZ3vGowEv7ps4rFBqQ/o.jpg"
      }
    ],
    "user_id": "mCrhj_CG3_pOmDFcfKotRQ"
  },
  "Zc5MRM83P7Kt41qv5488sQ": {
    "date": "11/26/2018",
    "text": "I've been following this pizzeria on Instagram for a little while now. Finally, I made a point to visit after always seeing pictures of their delicious looking pizzas. Came in on the Saturday after Thanksgiving and didn't have any issue getting sat right away. I ordered the Abruzzo pizza while my Dad got a regular ole' pepperoni. First thought about my pizza was \"where are the meatballs?\". I asked the Manager over and he mentioned that they were underneath the mozzarella. I only saw a few hiding. So, I would have likely enjoyed the pizza more had there be more sliced meatballs. The pie was definitely covered in plenty of mushrooms though. Crust was thin and crispy, which I like.  My Dad didn't seem overly thrilled with his pepperoni pizza, but I didn't inquire further. I like pizza and Italian food, so I'll definitely be back to try something else!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "oZNiC_iSQWiorPlK6u-wUA"
  },
  "8aCfk9R6CVkfhc0L9OjBeA": {
    "date": "8/16/2019",
    "text": "Great food and great service.  The calzone was fresh and cooked to perfection.  The pizza was just the right size.  Would highly recommend.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IUjA7bGnjDnOjXVmzJpMZA"
  },
  "X_-O5mw9CZszPbfNYABAXw": {
    "date": "4/18/2019",
    "text": "Was in Charlotte on business travel and had to run by target to grab a few things. Smelled Italian food and pulled up yelp and discovered this fantastic restaurant right across the street. The appetizer, main course and desert were all absolutely perfect. The prices are well below what this quality of food demands elsewhere. The service was fantastic and the outside seating capped off a wonderful evening meal. I highly recommend you give this spot a try if you're anywhere close.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "p_fkHWMFDuGrqypu_lOGBg"
  },
  "BXDLdUsUiZcCxSGri-KmkQ": {
    "date": "7/3/2019",
    "text": "This pizza was to die for. Wonderfully thin crust, which did not leave us feeling stuffed. The sauce and toppings were just right. I loved it so much, I had to resist going back the following night.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "OLmFYXqlT8Koq5wPi6_wyg"
  },
  "Tk--tJr8aKUPfuQ30OrVNg": {
    "date": "6/30/2019",
    "text": "A cute little place in a very nice area. Lots of different pizza options to choose from and love the thin crust. I got a white pizza that I was expecting to be a little different than it was, but still really yummy. Will definitely go back!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-oE5GF93iTBZfeuGbWdcww"
  },
  "AN7Mqz9lxl1yvLwHyUTM9A": {
    "date": "2/22/2016",
    "text": "Had an incredible experience at Pizzeria Ommagio on last Saturday night.  My wife and I like to go get dinner with our other couple friends frequently and we decided to try out Pizzeria Ommagio based on a recommendation from some other great friends of ours.  It was DE-Licious.   Big win - it wasn't crazy busy on a Saturday night. While I typically hate the parking at the met and general waits, this was great. Got a great parking spot and no lines at Pizzeria Ommagio.   We pulled down a few delicious draft beers - Peroni on tap! (for my wife) and the Charlotte go-to, OMB copper.   My wife started with a salad because, well she's a woman in her late 20s. (I came for the pies). Let me make this clear - salads aren't a meal, they're (as Ron Swanson says) what my food eats. But this salad (The Arugala) was delicious - who can't pass up candied walnuts (or candied any nuts for that matter).   For the table we got 4 pizzas - because we're new parents and eat our feelings.   All of them different and all of them tasty in their own ways.  Here's the quick rundown on each: 1. Omaggio Special - HOLY MOLY. This pizza was delicious and huge. If you're in the market for a \"supreme\" pizza, this is your go-to. 2. Trio - It's like a pepperoni pizza on steroids. Have you ever put ricotta ON the mozzarella? Ricotta happens to be the steroids here. 3. Abruzzo - I'm typically not a mushroom fan on my pies, but they did a good job on this one. The earthy flavors really all came out and we're really complementary of one-another. 4. Di Parma - I hate white pizzas. I had one once and it wasn't a good experience. My wife (see above) decided recently she LOVEs white pizzas. So while I cowed down on my Trio (I know - I was surprised too that I didn't get the Ommagio Special), she made good work of the Di Parma. I had one slice and I think my white pizza aversion may be changed. I actually at 3 sliced of the Di Parma for breakfast the next day, because I need more greens in my diet ;).  Anyway - I'd definitely recommend this place. All of the pies were delicious, the staff was friendly, and I didn't need to worry about a wait or a line!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "1kuIAtXgLMVR0bH-GTz0qw"
  },
  "hNyYtlPsxSsnG02L36iXFw": {
    "date": "12/8/2016",
    "text": "I can't go on enough about what a gem this place is! We came in here the first time just looking for a locally made pizza, and ended up experiencing fine Italian dining. The menu is perfectly sized with enough choices to satisfy every taste, but not so many as to overwhelm. I cam honestly highly recommend everything on the menu from the delicious pizzas to the handcrafted and beautifully presented pasta dishes. And being a baker myself, I was entirely blown away by the beyond artisan quality of the garlic rolls. They sit there on the menu, masquerading as an appetizers or side, but they deserve a section all their own.  And the owner is one of the nicest and most genuine people I've ever met. He came out after our meal, asked us about it, about us, and thanked us for coming to his restaurant. He is very hands on, checking on diners thought out the meal, and bringing many dishes to the table himself.  My only complaint is that Pizzeria Omaggio is in Charlotte and not Raleigh.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "99kl4KLXK09yWpurMkn1Ag"
  },
  "5iAB5fOWX3pKZH6s-vDTOg": {
    "date": "9/17/2017",
    "text": "Not great but not terrible.  From all the great reviews, I guess we had higher expectations.  The ingredients were fresh and plentiful, but the flavor just didn't nail it and the crust was just ok.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7dm3xgA2o87c0BbXWDaHuA"
  },
  "8CBF1gR6NhAnW7WUq9A8Ag": {
    "date": "9/13/2017",
    "text": "This is really good pizza. Very light crust with a bread like taste and texture. The crust seems to be somewhere between Neapolitan and California wood fired pizza. It's oven baked but not greasy like some NY style pizza can be. I had the calabrese and really enjoyed the butter like flavor from the sausage and calabrese. As others have noted, the atmosphere and staff are fantastic. This is a great place to hang out with friends or dine alone while you watch the pizza being made. The menu has some very good options and the pizza of the month seems to cater to those who are willing to think outside the box.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lD_7R6XQhPoWcBpw_GZG1A"
  },
  "Rx9WWgPM6DTNxSRFfnRs6Q": {
    "date": "5/25/2016",
    "text": "As a NYC transplant I appreciate the flavor and style of their menu. Reasonable prices for the food and I love the quick and easy fast casual style.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P5WUcIraUQLdmzBJ0nuoBg"
  },
  "7yvq4IsjEMhXJTtVMbvjYw": {
    "date": "6/3/2016",
    "text": "Had lunch here today. Great friendly service, great pizza. Got the Abruzzo ... Perfect single portion size, probably should have taken a piece or two home. Definitely going to come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Woh6QrnidM7Zm4y5hFvzqA"
  },
  "tchQltQdIxCVRVJvCWSCKw": {
    "date": "5/26/2016",
    "text": "So, weird thing here, the pizza looked great, most of the people in our group ate pizza. I had a panini and one had a wrap type thing, but the sandwiches were not what we expected, pretty dry and bland. I'd go back for the pizza, not the sandwiches",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GWHwxGiu4GlcdWJfCJJzeA"
  },
  "BtGs5jybU5A2cNPkyzzUDg": {
    "date": "8/19/2016",
    "text": "Excellent and authentic addition to the community!  The management is incredible.  I would highly recommend you ignore the low rating reviews as those folks clearly do not understand fresh, quality ingredients.  I'm quite perplexed!  It sounds like a lot of them just really appreciate over-seasoned food ... the stuff that doesn't taste good to begin with so a restaurants solution is to over-season everything so you actually don't taste the ingredients.  I've never had a bad meal here and I regularly visit.  The sauce for the pizza is on point!  The crust is always crunchy!  The toppings are always fresh.  And the atmosphere is clean and inviting.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QBN2nZejXXJ0craYVae27w"
  },
  "7ZoMq543YieMcecD4L3Ifg": {
    "date": "5/22/2016",
    "text": "I am from Chicago and I can be a pizza snob. This pizza was amazing! Thin white pizza with spinach and mushroom and cheese.... Yum!  The server was pleasant and very attentive. A must try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PPM3DLncwhRaLAaFIueUQQ"
  },
  "rsMXTBN2y6v8hq4SnqywBQ": {
    "date": "2/18/2016",
    "text": "Not a lot of flavor, very bland, over priced. Nice people though. Definitely wouldn't eat again if I had to pay for it. With this place you pay for \"the area\" , not the pizza. No real good pizza in Charlotte. Still searching.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOacTztc8INoMyquiyp6xA"
  },
  "uY32SfxzCrMyj3RUNqQPnQ": {
    "date": "7/2/2016",
    "text": "Holy Cow!  This place was incredible the moment you walk in. We had an Arugula Salad, fresh greens and velvety soft goat cheese on top.  Pasta Fagioli filled with beans and pasta was great. And then the pizza was spectacular. Fresh tomatoes make up the base of the incredible sauce!  Extremely reasonable prices and an overall spectacular meal!  Can't recommend this restaurant enough!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K_KUpmG2BxANFar9InO72A"
  },
  "Q2bzz8QhK38H9sjdUhkYFQ": {
    "date": "8/28/2017",
    "text": "We stumbled onto this place when we had to make a trip to Target which is across the street. The staff was very polite and helpful. Our waitress was attentive, and suggested an appetizer that was not even on the menu. Service was fast and the food was all very fresh. We had pizza and pasta. The pizza was Neapolitan style with excellent crust, cooked just right. We sat outside where the traffic noise was present but not annoying. The inside seating seemed quite quaint. Definitely a hit, and would come back when in town again. The nutella  and strawberry pizza was delicious for dessert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4sPBjSySwJ6fx-597MgOg"
  },
  "hMlJmLuqC2iMROftCQPbNA": {
    "date": "6/4/2016",
    "text": "Hell of a pizzeria! Light Crisp crust with great toppings and options. Fair price. Loved it.  Definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "M2iQe7jmhxJApvedjkmE7Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Margarita pizza.  And abruzzo.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/M2iQe7jmhxJApvedjkmE7Q/o.jpg"
      }
    ],
    "user_id": "jF7MvVUX75rlnNcsclAcZA"
  },
  "ClbA4baEztGTINdyKo1BvA": {
    "date": "11/24/2015",
    "text": "Excellent food. Had the eggplant tower (basil pesto made this dish), spinaci salad was good (actual pancetta, not bacon bits), zucchini soup was fantastic (worth a revisit for this alone!), and their Omaggio Special (light, with fresh tasting ingredients).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Qr-pVxr3XzabDrJTD9FhaQ"
  },
  "NXyzVDBu5pvvTQVCxzHsfw": {
    "date": "12/26/2015",
    "text": "We have lived in Charlotte for about 2 years, and so far this is the best pizza we have come across. The sauce is awesome and fresh mozzarella!! We love crispy thin crust and that's something they could work on, maybe cooking it a little longer or pre cook the crust? Either way yummy fresh food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8WnRWridC2lac0EPdvGKcg"
  },
  "RJCi3vC4NcSzxpkv1nF4Tw": {
    "date": "12/13/2015",
    "text": "Brand new place and the Service is great! The owner/manager was super friendly and check up on me and my friends. The personal pizza was delicious and very authentic. Love the decor as well. I totally recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "68L1vsUthzRt8oegdhUvdg"
  },
  "0N1Dh-6GKP_8Ceb71xavMg": {
    "date": "8/31/2015",
    "text": "Great pizza by an owner/operator that knows pizza.  The pizza is a fusion of Roman Italian thin and american deck oven.  For those that like a slightly sweet crust with a nice snap at the end, this will be your place.  I only sampled one pizza, the Margherita.  A nice supportive crust with a great crispy texture.  The crust was mild and sweet in flavor, allowing for the other flavors of the pizza to stand out.  The sauce was clearly a simple sauce without gobs of unnecessary ingredients, and it was bright and clean in flavor.  A sign of quality over cost.  I could see the tomatoes in back and in fact they were one of the highest quality American tomatoes available.  The fresh mozzarella was laid out in round slices, a high quality EVOO was applied along with fresh basil.  The flavors stood on their own and provided a nice variety from bite to bite.  If you like new york style but want something a bit healthier, I recommend this pizza.  The fresh mozz provides plenty of flavor and mouthfeel without the additional calories of a pizza loaded with cheese.  Omaggio is a wonderful addition to the Charlotte pizza scene and I look forward to a return visit to try one of their white pies.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 7,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BGLX08sXnqZOMvrcTdZaRQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BGLX08sXnqZOMvrcTdZaRQ/o.jpg"
      }
    ],
    "user_id": "I7FvE1jTafKbS-mWy9GQqQ"
  },
  "p2eeD9kTJnomNfpaVrv03Q": {
    "date": "9/5/2015",
    "text": "Went in to give it a try while running some errands. We ended up loving the pizza. It was great service and our pizzas came out extremely fast. We will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 7,
      "cool": 1
    },
    "photos": [],
    "user_id": "pUJkz0Z0jNY6KeJmhK7lVw"
  },
  "r5JIV29pifOFuhdJ1oNBtg": {
    "date": "3/19/2017",
    "text": "The restaurant is clean and quiet; It has a really pleasant atmosphere. We were seated immediately and the waitress was attentive in getting us drinks and our order taken. The food was delicious - I had a prosciutto mozzarella tomato basil sandwich. Tasted fresh and the bread was warm and soft. My boyfriend got a calzone which was was delicious as well. We shared a Caesar salad which was fresh and came out fast. It wasn't busy when we went (Sunday afternoon) and everywhere else in Midtown was packed. This place is a hidden gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BOoCDzJ4JpH_GHfXYnIe4g"
  },
  "bBLD_h9YxrqIOKkY3A1p0A": {
    "date": "11/7/2015",
    "text": "The best Italian pizza in Charlotte. The guys that run it know pizza and are actually Italian.  I lived in Southern Italy and know good pizza. You've gotta check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yk7uVnlmlGyrEY4dzr1ijg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Regina Margherita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yk7uVnlmlGyrEY4dzr1ijg/o.jpg"
      }
    ],
    "user_id": "UO-J6YatNgcAcR2QdUbIrg"
  },
  "OZ76zhAPiucdzYfHPTuqvA": {
    "date": "9/18/2016",
    "text": "Would come back. In a nice shopping area close to the Panther stadium. We got the Trio--which was AMAZING.  Not heavy. Not too much cheese. And the ricotta was scrumptious. I took a pic, but not before I took a slice to eat. Service was great and did not take long to get our food. We took advantage of the free mini cannoli--just enough to curb a sweet tooth.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "SrqSOalrIs-ly0OZLwwF2A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. #yum-i got excited and ate a piece before I took the photo",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SrqSOalrIs-ly0OZLwwF2A/o.jpg"
      }
    ],
    "user_id": "DKs2kLk4n_eKbdRbjxaeAA"
  },
  "erkj6muQFEEsiYSrENcmuw": {
    "date": "7/14/2018",
    "text": "I am new to Charlotte and have attended a couple of different Italian social club events locally. As I query the local attendees at these events I have been asking \"where can I get a really good and very authentic Italian pizza in Charlotte?\"  4 different people had Pizzeria Omaggio at the top of their list. So - after attending an event last night - even though I wasn't really that hungry - I stopped by this fab spot and met Daniel the manager and owner at 9:45 pm. I ordered and happily consumed a delicious personal size artisanal pizza. I will be back - with many newfound amici. Grazie!  Sal",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mj-UCSx4zjLLrn-FDdTbnQ"
  },
  "Vl2VAjDjcrVBEGV1vZOt4Q": {
    "date": "1/9/2018",
    "text": "The only Authentic Italian pizzeria in Charlotte! Highly recommend! Wine specials on Tuesdays and Wednesdays. The seasonal pizzas are always cool and inventive Italian inspired. IMO this place is one of Charlottes gems!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eii_GZlcESiw2lcZfBF5-g"
  },
  "GyXFFKDobeQNTDQedokXvw": {
    "date": "12/2/2017",
    "text": "Never again. Ordered an overpriced and small margherita pizza via postmates and here's what I received: - What appeared to be canned sauce on a burnt crust with almost no basil - It was so small, so unsatisfying - Rubbery chicken on top (extra topping that I ordered)  Never again. This was probably a step below your chain pizza, which is saying something.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ywigqbQKZj9yPIx09HCFKw"
  },
  "6kE1_SxgGx4-ryeLHzYbZQ": {
    "date": "2/5/2017",
    "text": "Always amazing food!  Authentic Italian cuisine all around.  Daniele is always helpful, accommodating, and generous.  Highly recommend the Burrata appetizer and the Di Parma pizza! Can't wait to come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v0rBjbLZGOaK69rW4vityw"
  },
  "PCkNOVwGXKtBr8OWdd4OMw": {
    "date": "12/24/2017",
    "text": "The ingredients are fresh, the options are both classic and creative and the food is some of the best pizza I've ever had. The service was also great. My kids loved it, too. We will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i9-jJ8rCj4RdjKWz7UOHPw"
  },
  "tFK75Go75qhTAeKzFrno3Q": {
    "date": "9/6/2017",
    "text": "Great Manager ! Handled my complaint with concern & resolution of problem . Admitted they need to work on getting better in some areas of his trade . Humility & class ! Will go back - he earned my respect and business ! Thx !",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3UIrNPhB1-vNS78cZ1FONg"
  },
  "w7NWXd-x7b3GdJbKgD54-Q": {
    "date": "5/16/2017",
    "text": "Fantastic pizza!!!  Sons of the best hand made pizzas around. Very tiny place so big great for groups but awesome for a night out with the wife or family. The charcuterie plate is especially tasty. You even get to watch them make the pizzas behind the glass.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "fn7QupFXqWPheord2aWbSg"
  },
  "5Nalst88naaTtoZnMBDdbw": {
    "date": "5/7/2018",
    "text": "Been here several times. Went again last night! It was DELICIOUS! Best pizza I have had outside of Italy. It is authentic & spectacular! The service and food are both impeccable. I highly recommend it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ee7T7a7GR-rH0CyTTZcqXw"
  },
  "8wOSTsCZKhbAE9f89LAa2w": {
    "date": "5/14/2017",
    "text": "If you want to know what Omaggio pizza tastes like, go to the supermarket and buy Lunchables Pizza and then stick it in the microwave for 60 seconds. That's exactly what Omaggio pizza tastes like: inedible crust, cheap cheese, and flavorless pepperonis. DO NOT come here if you have ever had authentic pizza from places like New York City or New Haven, Connecticut. You WILL be disappointed!",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhcBTzJ1l2P5OCTbWRrabg"
  },
  "_GsL_NE228UMS2CD2so51Q": {
    "date": "5/30/2018",
    "text": "Wow. What a breath of fresh air! Delicious food. Desserts are amazing. The tiramisu was perfect. The staff was friendly and on point. The restaurant is very clean and the atmosphere is beautiful. Best mozzarella in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGNa52JNYMD2IUiCRhs5qw"
  },
  "5dZQ2lTUU777a9pePVIIFw": {
    "date": "6/17/2017",
    "text": "Service and atmosphere were great. We ordered two gluten-free pies, the Classico add basil and the Rustico (chicken and arugula). Probably some of the worst pizza I've ever had. Don't offer gluten-free pizza if you aren't going to hand make the dough. It tasted like we weren't eating an edible crust, akin to cardboard or carpet maybe? I'm not really sure because I've avoided cardboard and carpet since I can remember. Little did I know that it is sometimes disguised as gluten-free pizza. Seriously though, this place should just not serve this. FYI, the California Pizza Kitchen Gluten-free Margherita pizza from the freezer section at Harris Teeter is WAY better. Maybe just sell those instead??",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HAZfQgE3prIBgPDyilKK3A"
  },
  "pEEU6BkPM5uCi0sQJMwqpQ": {
    "date": "4/27/2018",
    "text": "Wonderful pizza dinner. Such a cozy and friendly spot. Our waitress from Ukraine was fabulous, knowledgeable, and charming! The owner is always present with a smile and nice words. So lucky to have this delicious and quality pizza in the neighborhood! The pizza is so tempting never tried anything else. Will frequent often!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fVPNN7d80RdU_cNOJFYyoA"
  },
  "7WRlhPZUBGkvW36-w-sINg": {
    "date": "11/12/2016",
    "text": "We were in town visiting friends for the weekend. Having been gone from the city for 4 years we wanted to try something new. I took to Eater and this was listed in an article from hot spots of 2015- so I double checked on Yelp and everything raved and it did not disappoint!   Leanna was our waitress was so sweet and let me taste the difference between two of the wines which was just going above and beyond for a glass!   We had  The burrata - beautiful presentation & delicious. served with eggplant and roasted red peppers Garlic roles that were tender on the inside and crispy on the inside Pizzas: The special of the night of butternut squash puree with sausage & a white pizza with prosciutto  and ricotta, both delicious and perfect amount of food for us with leftovers.  Checked in for the mini cannoli and for this Italian, they got it right! Great spot and I'd highly recommend it for a pizza night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "o-zu9HcsKW-SmQh8DsIPjA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Mini cannoli &amp;amp; butternut squash with sausage",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/o-zu9HcsKW-SmQh8DsIPjA/o.jpg"
      },
      {
        "img_id": "YdyrcXKPTlfGe-tgvuPHwA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YdyrcXKPTlfGe-tgvuPHwA/o.jpg"
      }
    ],
    "user_id": "Rz1Ye-3wdutzLHpjHE-V1g"
  },
  "oVy9NB6G7nTFkjS2uTNREg": {
    "date": "4/6/2018",
    "text": "This is my favorite go-to with the kids. The owner is always there and it shows. Quality of food is excellent, staff great, prices good especially for what it is and a really pleasant outdoor space. Kids love watching them make pizza. Nutella pizza is a must. Love you Omaggio!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MYpg3_Yl0BgXQAaaC7Y5-Q"
  },
  "kA8AnZwzEBja_CGOoea0jQ": {
    "date": "8/22/2017",
    "text": "What a gem of a place and friendly staff. Including the owner. Very accommodating in changing some ingredients in the dishes. Very attentive and helpful in navigating the menu. They have great deals through out the week so call and check in on those may be a great incentive for trying them out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KN8aLwSN4irIgfJI4T1zQw"
  },
  "7A1kFnbDr2ff6RxWaXfolw": {
    "date": "6/13/2016",
    "text": "I hadn't been here in a while but I wanted to write a review. My friends and I had ordered other stuff other than the pizza (pasta and eggplant with pesto and mozzarella) but really, you should only order the pizza. It is great! We ordered the tuto carne, rustica, and the di parma. Each pizza is a single pizza so I would recommend coming with friends and trying different ones to share! Parking can be tough, but you can find a place in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bco1WVVLtMz67Yi-ilJwsA"
  },
  "Rbr09EJJG30T0zMz14Cbtg": {
    "date": "8/18/2016",
    "text": "The sicilia lunch special is a must!  Including the side salad (or rosemary potato crisps) and a fountain drink, it's by far one of the best meals for under $10 in Charlotte",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8DzCvzqKeum1uX8_nLJkvw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8DzCvzqKeum1uX8_nLJkvw/o.jpg"
      }
    ],
    "user_id": "LPivZGJBag0n4J8EIKhIvg"
  },
  "skgCjH8S5Y6YpB0aVzca9Q": {
    "date": "4/2/2016",
    "text": "Tried this place out for the first time. Ordered 2 pizzas for pick up and was extremely disappointed in the size of the pizzas. For $28 the pizzas were very small only 6 tiny slices and practically looked like a personal pan. They were nothing special especially for that price. Don't eat or order from here if you're pretty hungry.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xhubM2pxu7FIvTicq5AySA",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Pizzas are extremely small for $14. Almost looks like a personal pan.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xhubM2pxu7FIvTicq5AySA/o.jpg"
      }
    ],
    "user_id": "CfJb7zd0Nq2KmU1Sv5GxMA"
  },
  "SjKeH4v5YXHP2-y7FRPhwQ": {
    "date": "5/15/2016",
    "text": "Pizzeria Omaggio is one of my favorite joints in the area. Not only for the authentic, fresh and flavorful ingredients, but the amazing customer service. It's always a safe choice for a good meal experience, and we are so glad they opened up shop here in our neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8Z-yLP3itmX1oTGvRcrB-A",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Even their take out is pretty.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8Z-yLP3itmX1oTGvRcrB-A/o.jpg"
      },
      {
        "img_id": "zFd2ssHEzLnOeWT-HVmIYQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Simple yet satisfying Bruschetta",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zFd2ssHEzLnOeWT-HVmIYQ/o.jpg"
      },
      {
        "img_id": "9vCppCdZdKJrP0lBiKdI6w",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Omaggio Special - tomato sauce, green peppers, red onions, sliced in-house pepperoni, homemade sausage, mushrooms, whole milk mozzarella",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9vCppCdZdKJrP0lBiKdI6w/o.jpg"
      }
    ],
    "user_id": "IqEIszEHEzZG1KYNTLq0oA"
  },
  "NlIboTj8ac4CXxb0mYwMFg": {
    "date": "10/13/2018",
    "text": "I liked the space; it was clean and bright and cutely decorated.  We ordered appetizers, pizza, and dessert.  Garlic rolls were nicely done with a crisp crust and soft center.  Pizzas were quite tasty.  The pizza crust had a nice snap and just the right crispness.  I liked the sauce and the amount of toppings made for a good pie.  Desserts were all good.  The limoncello sorbet was amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fpdsvhlHS2MbAUgyWQf0Jg"
  },
  "XL9D_PcMEYbTQ_moushyYA": {
    "date": "6/7/2017",
    "text": "This is my new favorite lunch spot! The food and service is always premium. Everything is very fresh and the ambiance is delicate but welcoming. The Italiano sandwich is by far my favorite thus far (of five 6 things I've tried up to date).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xVYPhkdWrTAdOQqeQtbDyQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. The italiano and sardines",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xVYPhkdWrTAdOQqeQtbDyQ/o.jpg"
      }
    ],
    "user_id": "g2prozZ3UHPGZ18MYFF1Fg"
  },
  "FfBRm-dl3yW5N2JzXR0gtw": {
    "date": "1/31/2018",
    "text": "Delicious authentic Italian style pizza! Owner is from Rome and they offer a wide selection of items including the usuals bruschetta as well as caprese.  They even had on special the zucchini flowers pizza which was a huge hit!  Pizza places in Charlotte should take note and learn a thing or two from these authentic REAL Italian pizzerias like Omaggio :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fSDE-rRJr0-cSorhNzy4pg"
  },
  "QEywuIenmC63bzo62Ttqyg": {
    "date": "4/14/2018",
    "text": "Came here this past Tuesday night, we sat at the bar which was nice because you can see the pizzas being made right in front of you. They had a wine special half off bottle wine, which was super! Me and my husband really liked the pizzas they were fresh and light. You can tell they use good quality ingredients. We also tried their dessert brownie that was soooo good! We are happy to find his place and will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AW3z25JWJ_kKfau23OGGNA"
  },
  "AcuniYDqyL5rPisVCFpP7A": {
    "date": "11/28/2016",
    "text": "Went here while Christmas shopping this evening.  Didn't expect much.  Got what I expected.  Walked in expecting to smell pizza.  Walked in to an overwhelming smell of sanitizer.  The menu is EXTREMELY basic.  Very limited pasta dishes (5).  Nothing original as far as appetizers. More like a pizza and sandwich shop with an upscale appearance and menu.  We had the antipasto app, which was very tasty with quality cheeses and meats.  That's pretty much where tasty stopped.  Ordered a pepperoni pizza and the Omaggio special.  Neither would classify as special in any way.  It was the most bland pizza I've EVER had.  I would agree with one of the other reviewers when comparing it to middle school cafeteria pizza regarding taste.  Bland doesn't describe it.  Zero taste on the \"special\" and barely any taste on the pepperoni.  They didn't put enough cheese on it to even cover the sauce.  Sauce tasted like plain tomato paste out of a can.  Blah.  Not even close to worth the $50 we paid.  Service was good.  Really don't know how this place has such good reviews.  Way too many better options to eat pizza in this town.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "YPZaFWVzZ7ODVYIAa_HFnQ"
  },
  "fHI-mcIskzd0uJA310X5qw": {
    "date": "2/17/2018",
    "text": "The best pizza, pasta, bread, salad, and anything else Italian you can get in the Charlotte (+ surrounding) area! The service is more than perfect and the staff is extremely nice, basically family as soon as you walk in (thank you so much Oscar)! Nobody does pizza better and paired with the extremely welcoming atmosphere, this place is better than too good! Also the most amazing desserts in the whole world, the affagato is a perfect end to a hearty and delicious meal!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cBAcBOaKUK_Lab89BfcNMg"
  },
  "Cd4t3p-VXSLwTusqHzG_gA": {
    "date": "7/2/2018",
    "text": "WOW!!!!! this place is amazing. Calzones and pizza are the best I have found in Charlotte so far. You can't go wrong. Chicken pesto pizza and calzone are the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6jpAJu_UY7dKAI7-gltljg"
  },
  "ltdly9E6OnfWjYAAeUwLTA": {
    "date": "12/23/2017",
    "text": "This is such a cozy place to eat at - I ordered the pizza rustica that had chicken and arugula. The pizza was thin and yummy, was just visiting Charlotte but will definitely come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c8sSz_s-YDVd_-RmgEYbAQ"
  },
  "S7wURcjiaWjim6AhasBGFw": {
    "date": "1/7/2017",
    "text": "Italian pizza place but playing Mexican music when here.    Excellent service and attention. Product is pretty good.  Almost a little bit confusing on what they're trying to be.  Feels like they're trying to be a fancy pizza place but they also have take out pay at register but no where for those people to stand or sit without feeling rude for sitting in this kind of venue.    Would like to see everything a little bit less expensive and the food is above average.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EyhtHRpDtgvJ-jGvta068Q"
  },
  "y06259sPtk-LbvU14VWbCA": {
    "date": "2/25/2018",
    "text": "Amazing authentic and fresh!!! Absolutely some of the best Italian I've had in a while. Ambiance was bright and lively... great staff too. Highly recommend and I will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqS05fYN6HHAfwYW1OyNpg"
  },
  "80RSXM9wghJEIv18HucJag": {
    "date": "8/29/2015",
    "text": "I have been here a couple times now and am really enjoying it. There are a handful of restaurants that could learn from Pizzeria Omaggio's owner/manager - he is always there and actively engaged in the front and back. He recognizes my wife and I, always making conversation and recommendations. It's nice when you can put a face to the business.   The pizza is great and is made right behind the counter. The trio and Omaggio special are fantastic. They are about 11 inches and can be shared. You can also build your own from a lengthy variety of ingredients. The soups and salads are on my list of dishes to try on my next visit - they look delicious coming out of the kitchen.   Pizzeria Omaggio has put a lot of work into the interior. Clean and bright with marble counters. They have made the space their own - something that the previous pizzeria in this location failed at.   I am optimistic that Pizzeria Omaggio will stick around for a while. They are doing everything right and has been well received from what I have been reading.",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 13,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "GKLY3HDCxcMPwdgqm5sCoQ",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Trio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/GKLY3HDCxcMPwdgqm5sCoQ/o.jpg"
      },
      {
        "img_id": "zQRFUTz-KYPNnt4ysnJF0Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Made fresh in-house. Bit of orange zest in there makes you come back for more",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zQRFUTz-KYPNnt4ysnJF0Q/o.jpg"
      }
    ],
    "user_id": "tqIAiKisujzZWEjbdbMxyg"
  },
  "T_kYEz2HtFcGoo8auOS2jw": {
    "date": "10/1/2015",
    "text": "10/1/15 UPDATE: Finally ate AT Omaggio instead of doing take away. It's even better in person. They just recently got their beer & wine license. We enjoyed a Triple C IPA (for him) and an amazing bottle of Sangiovese (for me)! The meatballs and ricotta with garlic knots for dipping are our go-to. So good!   9/10/15 UPDATE: We went back for more takeout late tonight. Despite breezing in just 30 minutes before closing, everyone greeted us like we were old friends and they just couldn't be happier to see us! They not only remembered my boyfriend from the previous visit a week+ ago, they also remembered his name and order. It's so rare to find a place with both amazing food AND service. This place really has it all. As promised, we ordered a pizza with less toppings. (See below for my review of the Omaggio Special -- good but weighed down with too much stuff.) This time we had just sausage and arugula -- my favorite pizza from my time in Italy. It did not disappoint, even made me a little homesick for Tuscany and my favorite pizzeria in Ponsacco! We also had the meatballs and ricotta. Trust me on this one. You MUST order the meatballs and ricotta. It is melt in your mouth delicious. They threw in an order of garlic knots on the house just because. Remember what I said about the outstanding service? If you haven't already enjoyed a meal here, go now!   9/1 ORIGINAL REVIEW:  We had take out from Omaggio Tuesday night. The antipasti was a delicious mix of cured meats, marinated veggies and Italian cheeses. We ordered the special pizza (like a glorified supreme) with sausage, pepperoni, green peppers, mushrooms & onions. I wish we'd ordered something different, with less toppings as the pizza felt kind of heavy and the crust/sauce/cheese were over shadowed by all the other stuff. We'll be back for sure and I look forward to trying out the Margherita or maybe the Pear & Gorgonzola oh! or the Classico... You get the idea. ;)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 1
    },
    "photos": [],
    "user_id": "eVxYV4jI-618bnRCDniowQ"
  },
  "coxNnJJyNUYo5S62WaVnPA": {
    "date": "1/21/2018",
    "text": "This is now a favorite for my husband and I. We had gone on a Sunday around 6. There was no wait. We were greeted with a smile from the hostess and our waitress as well. We both had a glass of their delicious wines and started with an appetizer. Every ingredient was fresh and delicious. Pizza and dessert followed. The hazelnut brownie with the vanilla gelato was to die for. All was homemade. We were definitely impressed and will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IO0Zziq6ndgVteXPxY2QaQ"
  },
  "-xHoYy6fRD8B2w8NyIKwNw": {
    "date": "11/6/2017",
    "text": "Great atmosphere, small but cozy place. Quiet and nice for a date - good pizza and dessert. Recommended for sure.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "fYta4yULD4EpqNJ5W1PTzQ"
  },
  "HLaSu2fokjNoMMEMlkmiOg": {
    "date": "1/20/2018",
    "text": "I went here for the first time last night around 6 and we were the only people dining in, which was perfect because the total size is kind of small. I don't have anything to complain about. The pizzas, bruschette, and cannolis we ordered all tasted amazing and were reasonably priced. We will definitely be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iDDzTRt0ruOujj3LT9lnEQ"
  },
  "3YBHl5JtpTuD53bu4G3JGw": {
    "date": "8/30/2015",
    "text": "Cute little pizza place. New and in a great spot at the MET. I wasn't all that impressed with the food. Garlic rolls were hot but too garlicky and super crunchy. The Caesar salad was average. Maybe even less than average. And we ordered a white pizza. Fresh ingredients but def not incredible. Nothing blew us away. Everything was average. Not going to lie, I was a little disappointed. We LOVE our pizza and I think True crafted Zio and mellow are far better options. Plus all three of those places have better salads. The people were very kind and the place is super cute but the food, nothing to write home about. Neither one of us are in any hurry to get back there bummer, I was hoping we'd have a new pizza spot",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "L8yDoamJ0BSrL71c8VOKEw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/L8yDoamJ0BSrL71c8VOKEw/o.jpg"
      }
    ],
    "user_id": "oBOTde_uEobbnUcgU9wfDg"
  },
  "ZLOfyNTPuXliRtO5Q-gz0g": {
    "date": "2/3/2016",
    "text": "The pizza is amazing, the ingredients are fresh and good quality the service is very good and the place is super clean. I had the meatball Pizza which I had never had in my life before and it was amazing, I also tried a version of the white pizza with Mushrooms and Ham and that was YUM! ...  I'm a pizza lover and I can tell you that this is in my top list for pizza.  About the dough it was tasty and crispy, because I wanted it well done It didn't feel heavy on my stomach after I ate it and didn't gain to much weight LOL.....   I also tried the Eggplant Sub and the  bruschetta and again there were amazing. I will definetly go back  and not to forget the Tiramisu  WILL CHANGE YOUR LIFE",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_MVZg5g8b9ykXVLjNQfGWg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_MVZg5g8b9ykXVLjNQfGWg/o.jpg"
      },
      {
        "img_id": "i1S7iOOycEkAHGPrZDJtEg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/i1S7iOOycEkAHGPrZDJtEg/o.jpg"
      },
      {
        "img_id": "jRHH4r_bvVyyCK2ZZFOcGw",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/jRHH4r_bvVyyCK2ZZFOcGw/o.jpg"
      }
    ],
    "user_id": "cSVVS5mqE9VMbzL-b3Ng8g"
  },
  "_dUAMEQ0uzzH7m8Sg2v2lg": {
    "date": "4/24/2017",
    "text": "From start to finish, the experience here is exceptional. The entire staff was friendly (and honestly entertaining). We sat at the bar and were able to see the pizzas being made front row center. It was a slower Sunday night, but even then both servers and the manager talked to us about the menu, the ingredients, and then dessert. Their entire menu looked delicious, but I went with the special pizza with smoked pancetta and baby kale along with a bottle of Sangiovese, also on special. My friend got the Regina Margherita. Both were great! We sat there for over an hour and enjoyed the fun. They even brought us out a little sample of the tiramisu for next time. I'll definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "uYkmRldQd8SgYsyitUbd8Q",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Where the magic happens",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uYkmRldQd8SgYsyitUbd8Q/o.jpg"
      },
      {
        "img_id": "mp_m2XtOlETBAeGs5rnFDg",
        "caption": "Photo of Omaggio Pizzeria - Charlotte, NC, United States. Our view and enjoyment",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mp_m2XtOlETBAeGs5rnFDg/o.jpg"
      }
    ],
    "user_id": "eMP026Z9uhbIsc9LOwLvUw"
  },
  "0s6fB5vx8fHofITXLPBx3A": {
    "date": "8/3/2018",
    "text": "Delicious quaint restaurant.  Pasta Fagioli Soup was great!  Pizzas are perfect and light!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_wzRJC73MXAE3Rvwa6CzQ"
  },
  "P4FvO-sfulJEvxDFoTYZ9g": {
    "date": "9/5/2015",
    "text": "We were so excited to order pizza from here, since Revolution Pizza and Pizza Fusion closed down in the same location. I'm not sure what it is about this spot that pizza places crave, but I almost feel like you are doomed to setup another pizza joint here.  We ordered a pizza on a Saturday night and picked it up to go, since we live around the corner. The people at Pizza Omaggio are extremely nice, so we were pleased with the service and how quickly the pizza and garlic rolls came out to us.  The garlic rolls were very garlicky and buttery, but almost too much. I ate a half of one and threw the rest out. My husband had two and enjoyed them more than I did.  However, we both agreed that the pizza was extremely lacking in flavor. We ordered the Rustico pizza and even added roasted red peppers, but it did not kick up the flavor of this unseasoned recipe. Another YELP elitist was spot on... The marinara tasted like watered down tomatoes. There was also a full salad of arugula on top of the pizza (to perhaps hide the unflavored crust).   Unfortunately, we will be ordering pizza elsewhere from now on. I hate to say it, but it seems as though this place will face the same doom as the pizza joints before it.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "LwvPZ1bQt5-Zl1xxPberVQ"
  }
}