{
  "mSFs-pbPKTE3duqCdLIPYA": {
    "date": "1/23/2018",
    "text": "This place has yet to disappoint me in any way. Great food and the service is even better. Their Philly Cheese Steaks are the best in Charlotte and their beers are top both in selection",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dglzHkUIZKygfgaacet6wg"
  },
  "4RgPeRM_-Cud6fYbxi0ufQ": {
    "date": "7/12/2015",
    "text": "Haven't been back to Duckworth's often since my first review, but visited yesterday and saw reason to update my rating.  The beer selection and quality at Duckworth's is top notch.The service is good.  The food, however, is not. Or more fairly, the menu at Duckworth's is hit or miss.  Ordered the St. Louis style ribs yesterday, with cole slaw as a side. The food arrived on an enormous plate.  As I tucked into my food, I could swear I tasted... lighter fluid? I don't know, something \"off\" about the ribs. They tasted chemical-like, not smoked.   The cole slaw was warm, and also tasted slightly rancid.  The garlic bread tasted like my dad's version, which is to say it was drowned in garlic salt... Blech.  The tater tots? They were fantastic. But COME ON! They're tater tots!  If you're going to Duckworth's, stick to pure bar fare. Wings, potato skins, etc. Probably your safest bet.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "IZXnSMdOkVdFH-mw6zQBbA"
  },
  "Y8uZYURbIhQKGPGDtBpPbg": {
    "date": "11/25/2016",
    "text": "I came in here for some drinks with a friend. We both ordered a beer from the tap and it was terrible. I contacted our waiter and he was very nice. The beers were completely flat. The manager tasted the beer from the tap and agreed and brought us two different beers. No big deal, right? Wrong, when it came time to pay the waiter advised me that the bad beers would have to be paid by him. They \"couldn't\" take alcohol off of the bill. It didn't matter that the beer was flat or bad. The waiter was very nice. And I paid for the \"beers\" and told him that the manager should take those off and that that was poor management. I will NOT be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K6pGU8UXR4Zub5Ar8TAjnA"
  },
  "xZRWsJ4aG9rk3eOPYFqWMQ": {
    "date": "10/24/2016",
    "text": "Best fajitas in town. Awesome beer selection ($3.50 draft night Monday and Thursday), service and overall dining experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "N7eGUsrRJsHbhXnB7zMIow"
  },
  "Hh8-_RxN7y-SsloD0AKbcQ": {
    "date": "5/22/2017",
    "text": "We had a great time. We were celebrating a high school graduation. The server went out of her way to help us take a great family picture. Our drinks remained full and the food was wonderful. Thank you for a great night. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rSuUP4mFged5If5N9nd7qw"
  },
  "SOT54bt3o2Iz4BgG7PhBCQ": {
    "date": "12/12/2016",
    "text": "The food menu is excellent the beer selection is mind-blowing and the wait staff is very familiar with the different beers. So if you like awesome food and great beer this is the place for you",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oPG-N9hh0-YNg9vXN3uE5w"
  },
  "ShSWNsmXRfbZc0POZNRwXA": {
    "date": "10/10/2015",
    "text": "Typical looking sports bar on steroids as far as the beer on tap goes and the number of tvs. Food is pretty decent. I'm giving it 4 stars mostly because they keep the lights on way too high / bright at night! I feel guilty drinking here..lol.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2bYryFdnQnJd_R8PzP1X_Q"
  },
  "3bX7ffKD0g_vjrjTCjQucw": {
    "date": "7/27/2015",
    "text": "I don't know if I have ever referred to chicken wings as \"terrible\" until now.  I also don't know if there has ever been a time I stopped at 3 wings, and this was for a MEAL.  Three tiny ones.   Stringy, hard,  overcooked,  probably precooked hours ago.   Two different types,  so not a fluke.  So hard the skin couldn't be peeled off.  The fried peppers were very good but salty.   My daughter's pizza was fine.   Service was fine.   But we came for wings,  and it was a disappointment.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "TTqDlTO0VpFaClCOvD6gNw"
  },
  "H4XVXo3luKRZ68iY9ebo_A": {
    "date": "11/17/2016",
    "text": "4 months ago I came and the flyer at my table stated if I gave a Yelp review I would get a gift card... Well needless to say \"I was told via email they did not see mine\" LoL I gave them 5 Stars for food and Service But  1 star for not honoring their offer!  #HaventBeenBack #DropsMicWalksOffStage",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wdzSjRaSrym7gzLB_c-Tjw"
  },
  "NX4oQvL9zpCeLUjL7W3dJA": {
    "date": "6/27/2015",
    "text": "Went there for the first time during Fifa women's World Cup. Although a storm ruined the satellite feed and we missed the last 20+ mins of the match, the food more than made up for it!! Yummy salads. And the chocolate cake was moist and delicious!! I got my bro a burger to-go and I think he enjoyed it as well.  Service was good - attentive wait staff.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2J6ZK7e5riTUSChoP9E7og"
  },
  "3TZy6O06kPGAApun1P5EWg": {
    "date": "4/1/2017",
    "text": "Visiting Charlotte for a girls weekend and this place was recommended to me by a friend. Our Server Scott was awesome! Very funny and entertaining as well as attentive. Had the wings, they were very tasty. The rib and wing platter is enormous!!! I will keep this on my \"visit again\" list",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FOOOBJfaXlzONpf00FM5-A"
  },
  "DAAjcl1SlN2_LyM22gUpBA": {
    "date": "6/27/2015",
    "text": "I have been here 2 or 3 times and never had a bad experience. It is very loud, but the food is always good, and the beer is always cold. The hardest part, though, is that the taps change out so frequently that the servers don't always know what they have, to answer your questions. Overall, the experience is pretty good here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dyXtMyPmBMt-HsIRFwIL9g",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/dyXtMyPmBMt-HsIRFwIL9g/o.jpg"
      }
    ],
    "user_id": "aWwp-AicF5CyLw48tSzHMA"
  },
  "S-Wiegel_uRCfCuoFNK__g": {
    "date": "3/1/2013",
    "text": "I went here with a couple of friends on a Friday night for $4 well drinks.  Duckworths has an extensive beer list which always includes at least one cider.   Our waiter was Joshua and I thought he was great. He knew the beer list extensively, which I know could not be easy.   We ended up getting the cheeseburger, baked potato, fried pickles, and loaded nachos. I really enjoyed all of the food, in particular the cheeseburger. I thought the pickles were a little salty, but the nachos were also very good.   My husband was able to get $5 Patron shots which is a great price.   Overall, we thoroughly enjoyed ourselves with the great food, great service, and tons of TVs.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aIIZH3QGaCNYLEdLHqA0rg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Daily Specials",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aIIZH3QGaCNYLEdLHqA0rg/o.jpg"
      },
      {
        "img_id": "9okVRSGoZCBK47qjSu2laA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Tap handles lining the ceiling",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9okVRSGoZCBK47qjSu2laA/o.jpg"
      },
      {
        "img_id": "-Pjcoq2BFzztX4iI5TzviA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Monthly Events",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-Pjcoq2BFzztX4iI5TzviA/o.jpg"
      }
    ],
    "user_id": "H7JLpACO44A3xVXnOt1Z_A"
  },
  "3EFT83HD2rHJG91vwBTNBA": {
    "date": "11/2/2015",
    "text": "This place is my regular meet up place on weekends.They have wide variety of local beers and weekend the place will be very crowded. All I can say it's sport bar with huge space.If you want to watch game with family and kids you should try it. \"Top selection of local beers,Game place on Sunday,happy hour,family\".",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EtGVRVAT7D3Gbx5usDW0EA"
  },
  "oZ8Y8Ar0N1qzTsFrNg0gaQ": {
    "date": "11/1/2015",
    "text": "Good meal. Great beer selection. Lots of TV's. Good Service. Great chips and fries, fries were a little salty. Like the high back booths, which keep noise down at your table. One gripe, Growlers are supposed to be 64oz not 32oz. I got a half growler of Franziskaner from Germany for $8. The price isn't bad.  Just never heard of a 32oz. Growler. Suggest calling it a half growler. Bottle is cool though.  I will be back with my family. Speaking of families, There is an iPad on table with the beer selection on it. Maybe load some games or a movie or cartoons on it for kids also?  <a href=\"/redir?url=http%3A%2F%2Fwww.beeradvocate.com%2Fbeer%2Fprofile%2F142%2F1946%2F&s=c578f4eeca1d3ef78ff55bfcec6e58ab30ff2cad592602c175f7a29558105ff4\" target=\"_blank\" rel=\"nofollow\">beeradvocate.com/beer/pr...</a>",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uFePFqaDpAbFhLRkjmwW-w"
  },
  "GDtP7P91g9dGh0QGXQ2-PA": {
    "date": "2/15/2016",
    "text": "Great Burgers and great service ! Love all the craft beers that are available! The service was friendly and very patient!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9Oe_B94HFoNhpURzATh2g"
  },
  "SeAWDkYaNirxgPm1L4SJ_Q": {
    "date": "4/17/2015",
    "text": "I have been frequenting Duckworth's less and less due to the long time it takes for my food to arrive.  However, last night was it!  I ordered a sandwich at 6:30 pm and by 7:00 pm my sandwich still hadn't arrived.  I cancelled my order and the manager had the audacity to state there were several large parties.  Hmmmm - lets think about this.  Did the manager instantly add new chairs to the restaurant?  No.  So that meant the dining area is designed to hold that many people and the kitchen should be prepared for such things.    As I was leaving, I asked one of the groups when did they receive their food.  Their reply was 5:30 pm.  A full hour before I placed my order.  If you are looking to order food - look elsewhere and stay away from this place What an absolute joke!  EXTREMELY POOR MANAGEMENT!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LhdTEefg1PA3RptwBpe-aQ"
  },
  "I-xpIp8Z4E-9vCfULAa1bA": {
    "date": "6/28/2017",
    "text": "Not as clean as the other Duckworth's in the area! My family always drives to Huntersville now! We love the Philly Cheese steak and great appetizers! Definitely worth driving to Huntersville from Ballantyne!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AgiQ3Oy638t57Iw8xBjAAw"
  },
  "aK6d2SqrCxk1tRDxEO25Rw": {
    "date": "3/11/2017",
    "text": "I love beer and Duckworths has plenty of it. I can't remember the dude's name but the bartender was on point! Went a few Thursday's ago, watched Patrick Kane's hat trick while drinking the yella pilsner with my girlfriend. The beers are a little pricey but service is what matters and the bartender nailed it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U6BCaf6XZOs4oF3dpsdtuQ"
  },
  "PDrJiBipJcJMzDBzfOkJmw": {
    "date": "10/24/2015",
    "text": "Overall, the food and drinks were excellent. Two people in our group ordered the Buffalo Chicken Wrap which they said was the best wrap of it's kind that they had ever eaten. The sweet potato fries were also a treat! The mixed drinks and shooters were especially delicious and well prepared. They had more beer on tap than I could count. Our waitress was very knowledgeable about the mixed drinks and beer, and her recommendations based on what each member of the group had a preferred taste for were spot on.   I will say that the service time did take a while. I felt like it took forever to get our food, but it was a busy Friday and there were seven of us.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoatxTSUjA4MamfTm6KFRw"
  },
  "PtFYMHa-vbz1H9JrnIrsdQ": {
    "date": "12/24/2018",
    "text": "I go to Duckworth's Grill all the time and we always get good service. They have a wide range of beers and really good food. The manager Ken always looks sharp, he makes sure that the guest receive great service. Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RtWRwIaFchwksw3WVD-Srg"
  },
  "8hOcnWFJRVfmkoDDKjAoLQ": {
    "date": "11/9/2018",
    "text": "We had an excellent birthday dinner for my daughter in law . Bacon cheese chicken was very good and the fajitas were great .  Dessert was awesome . Loved the coconut creme cake & the double chocolate cake was sinfully delicious. The grandkids loved the cinnamon sugar donut holes.  Service was excellent as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vxHLa7D9dWFw2bkQ3UoQ3Q"
  },
  "Fx-nr4MRXx9Kj7atS4BveA": {
    "date": "12/19/2018",
    "text": "Amazing food and great place to watch the game in Ballantyne. They have a great beer selection and great specials. Would rate a 6/5 if I could.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uZnrXTWHO2bGFVy1Foljlg"
  },
  "qmTalHyzTvxWfHlfBPqydw": {
    "date": "8/2/2017",
    "text": "Duckworth's is a place I have been a ton of times since it's close to home and the beer selection is unbeatable. Plus with weekly beer specials it's hard to beat.   Every time I've been has been fairly consistent and service is adequate. However, my last trip was one of the worst restaurant experiences I've ever had.   I went on a Saturday afternoon about 2:00 with some friends from out of town. There was 6 of us total. When we walked in the place was dead, there was probably 2 other tables in the place. The hostesses didn't really seem like they wanted to deal with us and weren't even sure if the table they were taking us to was clean. Saying, \"I guess we'll find out when we get there\".  We sat down and noticed the servers openly arguing about being sat. I guess they were ready to go home but again we felt like we weren't wanted here.   Finally someone volunteered to wait on us and came over. We ordered some waters and when the guy brought the waters he ended up spilling one on me. He apologized and I let it go although I mentioned I at least deserve a free beer for that. I did not receive that free beer lol.   We then realized we only had 5 menus so had to ask for more menus. We ended up ordering everything at once since we had been sitting a while. We got beers, apps, and entrees. The apps came and they didn't bring any plates so we asked for that. Again we only received 5. We also only had 5 silverware sets so had to ask again for 1 more plate and silverware. Seems they can't count too well or really like the number 5.   While waiting for beer I noticed the server putting the beers up to his face at the bar. I couldn't tell if he was tasting or smelling. Either way it didn't seem very sanitary. I questioned him and he said he was smelling to tell what beer was what and does that often. Pretty gross if you ask me.  After all this we were pretty much ready to go. We finally got our food and thankfully that was correct.   When he brought the check he asked who should pay for the apps. I made a comment that we shouldn't have to pay for anything. He then came back and said the apps were comped. I'm assuming we would've been charged full price if I didn't say something. Great customer service.   It took us about 2 hours to eat and drink 1 beer. Most of this time was spent waiting on our food. Remember there was only like 2 other tables in the whole place. I feel like we should've been out in an hour tops.   I rated Duckworth a 2 because it felt wrong to give a 1 star with my past pleasant experiences. However, I probably won't go back for a while and I know my friends will never go back after this past trip.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5SDHbVfEkErUFN7DAEVZRg"
  },
  "eEUV377XbrLrBMKfJNA5bw": {
    "date": "3/10/2015",
    "text": "And God said, \"Let there be taps\", and so Duckworth's was made...  If you like choices, this is your place. Close to 70 beers on tap the day I went. Yes, you heard me correctly. How do you know what's on tap? Two friendly bartenders greet you, tell you their names, offer to help and work as a team. An IPad menu with all the selections to view? Pure genius. Want a flight? Just drag and drop the selections that are of interest and give it back to the bartender. Find a winner and want a Growler? You can buy 32 oz. of hoppy goodness to take home with you! Oh, and if you get a chance to look up from your beer glass, you'll notice that there are 5 bazillion televisions. Sweet! Can't wait to come back and try some things off the menu!!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "TeuCaCzRKCeEEN2ZWOfkIQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TeuCaCzRKCeEEN2ZWOfkIQ/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "8M8xArGs__aFyAdm5l733g": {
    "date": "4/21/2018",
    "text": "Huge menu, all above average and very consistent. Friendly for kids, whether you sit in high tops or booths. There are about 197 televisions within view at all times. Awesome place, it's become a bit of a mainstay for the family.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HJoKxiZijJ6r2eGcO3lwBg"
  },
  "iSxTNIbaDoY5cI9wU-44XA": {
    "date": "7/14/2016",
    "text": "It was average.  I ordered the BBQ sandwich and it tasted exactly as it should with it being in NC.  The coleslaw that came with the sandwich was seasoned with something that ruined the entire side for me.  It was a strong herb taste and very earthy.  The house chips were awesome!!   I went with a group for lunch and while I do not know what everyone had, the ones around me looked like they had some tasty meals.  The Fajitas smelled out of this world and the chicken caesar salad looked amazing.  The reason for only three stars is because there were a few tables that sat dirty for quite some time and the place did not appear busy.  It was lunch time and it appeared to have plenty of staff on hand, so not sure of the reason why the tables were not clean promptly.  Cool vibes and decor was nice with a craft beer touch. I'll definitely give this place another try!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wkIHGdNJKTMaEYTX53BQgw"
  },
  "AMRoBcLG2AIO4gmORYvmbg": {
    "date": "8/13/2017",
    "text": "Hate to do this 3 star review but here it goes.  How does a \"beer bar\" only allow 1 or 2 beer menus (read iPad) per table?  On top of that, ITS A HUGE MISSED OPPORTUNITY; the app is awful.  Why can't I sort by style, abv, location, price, etc?  It is as functional as a 3 printout but costs $600 so they only give 2 per table.  They have great food, excellent wait staff, PLENTY of TVs (each independently controlled). Honestly it would be 5 stars without their dumb beer menus.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5HxHDFsi5jpiwcoPF3-l7Q"
  },
  "4IXBDuYpjxJNmGCg8djHvg": {
    "date": "10/14/2018",
    "text": "My experience here was excellent! The waitress, Chrystal was what made the experience the best and I would give her 5 stars! She was attentive and offered great recommendations! The food was also very good, lots of variety for a sports bar.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hR9T3aVDAF2SqoiXSzraGA"
  },
  "CNiU5TPbJ5cJqViDRKc9Fg": {
    "date": "10/13/2018",
    "text": "Amazing! Just in town for the weekend. Liz was our server and she was great! She was constantly checking in if we needed anything. Great place to have drinks and appetizers.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hd8WDe3bI7y1sqFO-Dnh3g"
  },
  "dCpC-mAGc4SjyhOYybs1qg": {
    "date": "1/27/2018",
    "text": "This is a SOLID bar with a varied food menu.  The food and service is always GREAT!! I love their fresh cut fries.  It's one of my favorite places for a burger. The beer selection is extensive. Half price wine bottles on Friday is a bonus.  The perfect place to watch a game.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mMElyDkLoPvP7gGG4FxahQ"
  },
  "nub9lUydD_qyFGSgXxOslA": {
    "date": "10/5/2018",
    "text": "Food was good and was served immediately. Wings are awesome! They have a great selection of beers on tap. Bartender was very knowledge on the beer selection and gave good recommendations on what to get. Would recommend going for a late night drink and grub",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rb6hEAP3cg46qLx3iQqbbg"
  },
  "_iMLjf5iB9LuDjaTLhhVsg": {
    "date": "2/25/2018",
    "text": "Awesome place....great wings, phenomenal beer selection and fantastic service!  Love it here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NAIu2Z0nm6qNfdS83nLzyA"
  },
  "BqhuE7LBKnNAgSgWIdJjBg": {
    "date": "4/6/2018",
    "text": "Duckworth's is our go to restaurant near our home.  The service is ALWAYS great and so is the food.  They have a good menu selection which allows for every family member to find something that they love.  My personal favorite is the Carolina Burger with chili, slaw and onions.  Being on a no carb diet I order this without the bun and and it 100% satisfies me with very few carbs.  My daughter (and I) both love the cheese sticks and my son likes everything there.  I would also like to note that their wings outdo most other places.  Seriously a must eat at place for those that have never been there.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IxeLKYi3a3ZpVD0DifnJJA"
  },
  "g_BJZ6lWysZ3V10bvmoeWg": {
    "date": "4/2/2018",
    "text": "We have gone here more then once   And always had good food and service       But wow  we went here on Easter night     They where not busy either,  The service was horrible and the food was not good    Very sad for a bill of 150.00    Will never go back",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "i4PP_kqPbeJDc1hwd31Xyg"
  },
  "tS9aI8JgJypgKc3nSICSig": {
    "date": "8/20/2018",
    "text": "It is worst experience here. The flat bread was cold and when asked about this they just reheated and got me. It was burnt half of it. Not a good experience",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y9ZY4asWZd-GHoxdiPu7IQ"
  },
  "SZiRzdWEiS2AnpdSKwjteA": {
    "date": "4/1/2018",
    "text": "We love Duckworths! The food is always good and the beers are always cold! Bartenders are fantastic as well. Glad to see they are doing some updates on the menu but keeping the old favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ijYqnTGRX6TIxwtYixCvMw"
  },
  "phwkbRUFtwlHuEFgnemG7w": {
    "date": "5/20/2017",
    "text": "First visit to Duckworth's was great! Previous reviews showed the famous Mommos wings so we have that a try. They were crispy and so saucy! We also tried the Sweet Gold and Bold wings that won first place in a wing contest. Overall very nice food. Will be back for more.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UmVkWBaeYbb2-8XFiQAuBg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Garlic Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/UmVkWBaeYbb2-8XFiQAuBg/o.jpg"
      },
      {
        "img_id": "xy8UrQwdIZxLeEwTqgGvBA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Wings :)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xy8UrQwdIZxLeEwTqgGvBA/o.jpg"
      }
    ],
    "user_id": "XOxkN7XxCvESCS8ritHWuA"
  },
  "4hqQ2L2BULjr90Emnb6diQ": {
    "date": "8/13/2018",
    "text": "I have been to a few different Duckworths locations. The Ballantyne location is near my work so I come here often for lunch. I have enjoyed everything I have ordered there. My favorites are the fajita chicken salad, fish tacos and pizza. Fast friendly service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WXZ1JVDBfSHUJEaq_PPhpA"
  },
  "fOR-z_V5y6wzc35A4Ze0wA": {
    "date": "11/12/2017",
    "text": "A good spot for watching games. Good food and decent service. I've never had an incredible experience here but I've also never had a bad experience. They have a great beer selection and friendly servers.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "kRIbMM7X2_A87GHfDxz0Yw"
  },
  "AmS7_INdyh11O0CJ7LnGEg": {
    "date": "11/16/2011",
    "text": "I have been going to Duckworths on Park Rd. for a few years now and really enjoy it, so I was really glad to see this one opening up a little closer to the house.  This location is set up in similar fashion to the Park Rd. location, but much larger, and about twice as many TVs. The place is pretty nice, but not much in the way of atmosphere.  The service was pretty good. Our server was attentive, and very pleasant. My glass was never empty for longer than a minute or two without him checking on us. He seemed to know the food menu fairly well, but didn't have the same level of understanding of the beer menu.  The selection is terrific. 80 Taps + 1 cask. If you can't find a beer that suits you here, you won't find one anywhere. Really a vast selection of great local and regional beers, as well as some Midwest and west coast beers.   The food is the same menu as the other Charlotte location. Decent food at a decent price. Nothing that will knock your socks off, but better than many beer centric places that I have been.  Overall, this is a great addition to the Charlotte beer scene.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "-EWQZjRHAKMddHW_dZTvdw"
  },
  "6vxtZItBtXx2jItvk_xycw": {
    "date": "1/7/2015",
    "text": "First time at this place was yesterday for lunch.  When I arrived, the staff was friendly and the place was almost empty so I had my pick for seating.    I ordered the wings with the mild sauce and the Hot bbq sauce with an order of fries and a coke.  The order of wings is pretty big, you get 10 in total.  The food came out pretty quickly too.  I thought the wings were alright.  They were very crispy but just lacked a little flavor for  my personal taste.  Also, they're not covered in sauce.  They were very lightly covered in sauce.  I wish they were drowning in the damn thing!!  The sauces were milder than I expected, but were good.  The bleu cheese was nice and creamy.  The fries were also good.  By the time I left the place, it was pretty crowded in there.    I didnt give this place 4 stars simply because I thought my wings were a little on the bland side and just didnt have enough sauce to make up for it.  I will be back though to try some of their other good.  'Til next time......",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RApXDoOpPkUtKThblGpCOg"
  },
  "_1aUn9Mnp5qQ1jRh3_u0og": {
    "date": "11/4/2011",
    "text": "I was so excited on Wednesday night to visit Duckworth's Grill & Taphouse-- IN BALLANTYNE! I have frequented the location on Park many times previously and was a fan.   The Ballantyne location certainly trumps the one on Park Road. For starters, the dining area is much wider and more open. While the atmosphere is certainly different at the Park Rd location (bustling, college kids and yuppies uniting in small cramped spaces to enjoy rich brews), the Ballantyne Duckworth's appealed to me more. I didn't feel like I was in the stranger-next-to-me's conversation, nor did I ever once rub shoulders with anyone but the man I was sitting in our booth with.  The overall noise level was much lower, making the entire place very chill. I should mention that most people probably didn't know it was open yet, so I should reassess the place in a couple of weeks.  The food we ordered was pretty good-- nothing special. I got a Caesar salad, and Casey ordered some sort of spicy, garlic-parm wings. Nothing to write home about, but not bad either. And they did soak up the beer we consumed, which was sort of the point. Two delicious beers I ordered that require recognition are: Duck Rabbit Rabid Duck and Founders Devil Dancer. Delicious dark high gravity goodness.  The waiters, waitresses and hostess were all very friendly and attentive. Our little waitress was nice, but oppressing with her neediness for attention. Other than that, the entire experience was chill. I can't wait to go back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "5O_4vVavv2VKvusu5VaCkg"
  },
  "w3_bhe4tAcxBE6obr9EYSw": {
    "date": "6/7/2015",
    "text": "Awesome love the food atmosphere is great staff is great and attentive had a very nice time and the cost is reasonable make sure you pay them a visit you can watch a game have a beer or whatever you like they have an outside patio and outstanding food Johnathan was our waiter and he was awesome kudos to Duckworths",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "prEueXhhOul_i85HyFM2_g"
  },
  "LdEKRui6CcJGXE0CRTj1ag": {
    "date": "6/21/2012",
    "text": "Love the beer selection. There are so many available, and they are constantly getting new additions.   The food is good and your standard bar food. However, something about the place keeps me coming back. The pizza is surprisingly good.   Be sure to try to the homemade chips. Add some seasoning salt for the extra zing.   For Meat eaters, check out the steak.    The only thing lacking is a Veggie Burger. There are limited Veggie items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CtvxL2SA-Wn0Tt-Ov1dJwQ"
  },
  "5_JUAHdv-w1fmoWDJ_ICZw": {
    "date": "12/29/2011",
    "text": "This new location of Duckworth's is right down the street from my office, so when I wanted to meet a friend for a holiday dinner, it seemed the natural choice.  There was a little bit of a wait, but that's to be expected the week of Christmas.  Other than that, we had a great time.    Duckworth's atmosphere is like pretty much any other new-style beer and burgers joint: think Hickory Tavern, etc.  However, in my opinion at least, Duckworth's far outshines the competition.  Probably the coolest thing about the place is its large and diverse draft beer selection.  The fact that our waitress was very knowledge about the list and could speak about anything we were interested in was a huge plus.  The food was good, too.  I ordered a Carolina burger, with chili and slaw, which is one of my favorite ways to eat said food item.  It hit the spot.  I will be back to Duckworth's.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2m2MNnlOdofofmUs-hYTJQ"
  },
  "buULxDbJmVjxrJRM7hN3AQ": {
    "date": "12/3/2011",
    "text": "Went on a Saturday.  It was very busy but we only had a 10 minute wait. Normally I don't like the trendy sports bar look.  We counted over 30 TVs...that's kind of obnoxious.    Speaking of of obnoxious the noise level was deafening.  I had the Hero Burger, which was actually pretty good.  Unfortunately I picked baked beans as a side because I was in the mode for them.  One bite...the rest were destined for the bin.  My wife had the bar-b-que.  She said it was passable after drowning it in vinegar.  I could not eat it with that much vinegar.  The service was...well...he was trying.   But he put his thumb in my nachos, forgot that he told me that he was going to bring me a spoon for my beans, and had to be reminded to refill my drink.   But he was a nice kid.  They did have free WiFi...for my fellow technogeeks.  Bottom line is that we won't go back.  Pity, I did like the burger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2FtjeOyyzNKuX1U2o9CFw"
  },
  "gU76-yw90PM5KVm8MKRnbg": {
    "date": "9/19/2013",
    "text": "This review is bit old and I am just catching up on it since now we can post it from my iOS device.   Anyways, I came here with group of folks from my office for lunch. We were greeted by a beautiful young lady and got the table right away.   We all ordered our beverages and the employee were pretty attentive. Our drinks came back in fair amount of time. We were chatting and looking at the menu so we took our time to order. When it was my turn to order, I asked her that I am a vegetarian and since this is my first time here, what would you recommend? She gave me couple of options and I ordered Mexican salad.   My beverage didn't taste right so I asked her to switch it back with coke. She was friendly and was able to take my request right away.   My food came back in fair amount of time and I have to say that it looked awesome. I should have taken a picture of it. When I started eating it, it was as good as it looked. I mean the cook or chef did a fabulous job.   We were all done and waiting for our check. When I received mine, I noticed that I was charged for drink twice. I told her about it and she said because you got two drinks. I said that the sweet tea didn't taste right and that's why I asked you to switch it out for me. She gave me a look. I have always requested restaurant replace to soft drink if I don't like the taste of it and they have always done it without any attitude. Anyways, that's the reason they didn't get 5 full stars.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 5
    },
    "photos": [],
    "user_id": "EtBYV4tWrKH6jR0RCwV_JA"
  },
  "Z7KYzTdIJnyxlIFg8bkAHA": {
    "date": "2/24/2014",
    "text": "Slow for a Monday night but service was excellent. Grabbed a Cobb Salad and some wings. Salad was a huge portion! It was well worth the money! If you haven't been, check it out. You will become an instant fan. Prices are very reasonable for a meal that is sure to fill you up. All I have to say is that they know what they're doing back in the kitchen. Give it a try. This is my 4th time here (forgot to check in a couple times). They will continue to get my business.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrzLUixUSApjgyH3-s6XFw"
  },
  "fLLNI4ynBoN5VYKuwOhcQg": {
    "date": "8/17/2014",
    "text": "Great beer selection and pretty good wings. Last time we got two large orders to go. They were over charred and tasted like they had been cooked on a dirty grill. Pretty yucky. Usually they have decent wings though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X54KrDMJeyHKO7BB9jEE6g"
  },
  "dhHrVg8Vjf2Kl6Zsek8YBw": {
    "date": "6/25/2016",
    "text": "Wow. This place was a great place a while back, but has gone down hill. Food all over the restaurant floor. Went to the restroom and the stall door literally fell off in my hand. Dangerous. Also not clean. Not staying for dinner and won't be back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "U5yR1xJ_UrQHOm8IZOoPKg"
  },
  "VtkXJrm0hUrTapc-QhUIcw": {
    "date": "11/2/2014",
    "text": "Great beer selection. Only place I've ever been able to find strawberry fruli. The shrimp flatbread is so delicious! Definitely a place to try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QFgrmJLq6KqiP_7Vqaz-RQ"
  },
  "RvMd-1Q4P_3R_g8Kkpx10w": {
    "date": "3/24/2016",
    "text": "Absolute worst service - unfortunately that will catch up them and another place will go under in Ballantyne! Service is everything!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B_LQNlIU61TkvYwMBqoBZw"
  },
  "AngxxVF-8Faqb7AA-P9NFw": {
    "date": "3/22/2016",
    "text": "Good food really good staff awesome atmosphere this place hits it everywhere really awesome to kick back and watch the game at",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SIqENP8MSWUaaN78usHnOA"
  },
  "iEnzfMtCW1t3XUS1_egJ-w": {
    "date": "6/23/2014",
    "text": "Stopped here for the first time and had their lunch special.  It was one of the best sandwiches I've ever had.  Oriental pork sandwich, with cole slaw and sriracha for some added heat.  FANTASTIC!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Uhem_dcUYgUpL68LBrgGmA"
  },
  "Gehq3KM6v-HhJBcqbY3srA": {
    "date": "2/6/2015",
    "text": "Duck worth's has a nice atmosphere and very friendly staff.  I was impressed that my server asked me if I wanted any extra lettuce & tomato with my sandwich.  I added some extras including extra blue cheese at no cost.  This location is also great for after work happy hours.  Highly recommended",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A-5wZABpS2mxz-5OyMeoyg"
  },
  "UkWNBbEr7JW-c0pszhUNlg": {
    "date": "9/19/2013",
    "text": "Casual sports bar environment.  It feels like a BWW but less stuffy and with much better food.  This is a great place to watch sporting events.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtsRy9LmwJiTYb8AMtoFcw"
  },
  "9G90V-tChStlg8XGDnsbEw": {
    "date": "7/26/2014",
    "text": "This place is just great! I have just found this place in my neighborhood and I luv it! The drink specials are awesome and SO many beers to choose from. They do have a beer club free of charge and they do a sample round as well. Their wings so awesome and the Gold N Bold are my FAVE!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ne8Qi6-SaWbz26rqc1XSnw"
  },
  "yjIwDJHFFoz_HvLUbCW6Ew": {
    "date": "7/19/2014",
    "text": "My boyfriend and I wanted to go somewhere for lunch and we love coming to Duckworths. I ordered the Philly cheese stake with garlic fries and my food was properly cooked. My boyfriend got their special BBQ platter with a side of tator tots. The tots was hot when served and the waitress gave him two BBQ sauces to have additional. During the visit we had two different managers come over to ask how everything is and if we needed anything else. This place is very friendly, the ambience is appropriate and I would recommend this place to anyone and everyone!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LEgYjHEvYKu9zd5IMBdhlA"
  },
  "KaipRpy-3c3VGAp16jw5sg": {
    "date": "1/28/2014",
    "text": "Great beer selection, loved the Hefe-Veitzen.  Pulled pork was very tasty and the slaw delicious.  Atmosphere is bar-like and menu is fairly standard, chain restaurant like.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M0N0cvv4pTxFuLEtp2-zyw"
  },
  "OnMIPmxISQOGdrF2lBNefA": {
    "date": "4/9/2015",
    "text": "The food and service is great! I've tried multiple entrees at this restaurant and have yet to be disappointed!! My friend and I had the greatest server the other week- wish I could remember his name- but he had such a great energy!! Love this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5_5IBQcoUtTe2sLIIY99eQ"
  },
  "0JqjUkFGXOQO5BPU0hs3ug": {
    "date": "7/1/2015",
    "text": "Kino, my awesome waiter, said the Philly Cheesesteaks were their specialities and he was right!  The supreme (included mushrooms) along with crispy onion rings was the perfect combo along with a great beer recommendation!  Wish I lived closer, Missouri is a bit far but will definitely be here on my next visit! C",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wbelKqYQMla-7coGim_THA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/wbelKqYQMla-7coGim_THA/o.jpg"
      }
    ],
    "user_id": "kMPknTJfOlbx3ZKcKSzKtw"
  },
  "cKIj1qa0HKw5Dj_Se7Vw1A": {
    "date": "7/23/2016",
    "text": "Great food.  Awesome service, Becky is the best person in the place... GREAT personality.  I ordered the chicken sandwich with a potato side. AWESOME food.  I was pleasantly surprised by the outstanding fast service from Becky. I highly recommend this place  to anyone.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O83HVScFv7a36NKeulbTzw"
  },
  "rrARuFQxo5L46HarN7ExsA": {
    "date": "3/17/2015",
    "text": "Not half bad beer flights and pints. What's innovative is that they have iPads to select your flights. Always a lot on tap! Great place to catch a game out in Ballantyne. Parking can be a drag if it is a big sports night or weekend. Not really a place to go on a date, more of a place to cut loose and hang with friends at anytime! Typical bar food, I'd say 7/10.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LUNO0fVb3aO-SPDjMYmzzA"
  },
  "ogScYdtokxOjDN9Bv9TzOw": {
    "date": "1/21/2015",
    "text": "The service and food was excellent today. Our waitress really was super nice and took care of us all the way through our meal. Offered To-Go drinks and boxes. I was very pleased with my visit. This is a great place to eat in any city.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kKM-t2Fta2m6yF0TPrsxcA"
  },
  "eUBiz11DvyeVMB6gZCp8bg": {
    "date": "6/3/2016",
    "text": "very solid for bar food.  The TV arrangement could have been better.  We have a party of 4 and we had to look at a lot of different and sadly small TVs.  An arrangement like that of Hickory Tavern or Taco Mac (T-Mac) would have been great.  More TVs and easier access for a group to watch the same one.  Food was pretty good and menu was huge.  Service was good but payment processing took a little bit of time (on a slow, late weeknight).  I would recommend this location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "efJbtU4xBHNoGzKyLR8-KQ"
  },
  "zH0SbMtu9erdqRy6IAA2Vg": {
    "date": "11/24/2014",
    "text": "This place is just simple and doesn't pretend to be something it's not.  You get a huge selection of draft beer (I go because I can get Great Lakes and sometimes Thirsty Dog on tap), decent bar food in sometimes insanely large portions - order the nachos for at least three or four people, and friendly service.  Do not however be flattered when you are asked for your ID - they card everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mpeE03Ul_rvLQ4Io-o6Sjg"
  },
  "FUADmluVz4uYrWsQ_7r2wQ": {
    "date": "9/25/2015",
    "text": "9/25/15 arrived 7;20 pm  30 min wait for 2. Host quoted good wait times was sat in a booth at 7:40. Server was new, did not know any liquors. I had to get up and get my own drinks from the bar. ordered Cheesburger with jalepeno's all veggies on the side, and a BBQ and wing platter. order was placed at 8pm... at 8:30 the server came by and told us she saw the bbq plate in the window but the burger was holding it up. the food came at 8:40pm , the burger had bacon and onions on it, no jalepenos, the bbq platter was luke warm wings(moomoo) were hard and dry and no slaw.   after we told the server that we did not want to wait for another burger we would just eat the tots, she got a manager. he did take care of the bill and sent a burger home with us.   this was our first time trying this restaurant. the menu reads good but didn't get to try any hot food. I think the wings were bad from sitting in the window for so long... the manager said that the ticket times were running 12 min. so if it was cooked and ready in 12 min. and we got it in 40 min... well....",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BZ4LLml7l-QBGkFKiNEAaA"
  },
  "5FR9dXs-vFiAD1dyjLujGw": {
    "date": "4/11/2012",
    "text": "Long, long ago in Charlotte....far, far away? Whatever. I visited Duckworth's off of Park Rd long ago for a beer with some colleagues and didn't have the pleasure of perusing their menu in full. I had been meaning to revisit and explore their array of Philly's and, boy, am I glad that I did.   My wife and I went last night to the Ballantyne location. Went around 7:30, so it wasn't slammed. Got a nice booth all to ourselves. Big enough to stretch out and play a little bit of paper football.   Our server, Bailey, was very bright, funny and helpful. They have TONS of beers on draught. Much to our everlasting joy, plenty of NoDa and Birdsong brews as well. Beers came out nice and cold and our appetizer shortly followed.   Here's a tip: Get the Buffalo & Bleu Cheese Chips as an app. Awesome homemade chips with a generous helping of bleu and buffalo sauce. Not overpowering and perfect pair for a great Pale Ale from Birdsong.   Entrees were next, of course. My wife got the Caprese Sandwich. It was delightful. Chalk full of fresh mozz, tomatoes and basil on a hoagie. The first of its kind that I've seen. Sweet potato fries to accompany. They were pretty standard with a honey mustard dip.   I had the pleasure of experiencing the Buffalo Chicken Philly. Not an avid Philly eater, but this one was great. Finely chopped, smothered with cheese and buffalo sauce....Yeah, I was a happy camper. Delicious. The onion rings could use some work. You know, the kind where you snap a bite out of one and the whole onion comes trailing behind? Yeah...I hate being left with a deep-fried, onion-flavored tube of goodness, too. Not a deal breaker, but just an opportunity for some improvement.   My hat's off to you, Duckworth's. You'll have us coming back on the regular for sure. Especially if you keep having CoCo Loco on draught!  Cheeers!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "nQEmXQjZ3GuIzF1HVhdnDA": {
    "date": "12/9/2014",
    "text": "The food is great, beer selection is amazing, and the Monday/Wednesday deal night is a steal.   There isn't a better place around if you want to have a good time with friends and watch sports and drink great beers. My favorite dishes are the fried pickles (great with beer), cheese steaks, and the Bacon BBQ Chicken flatbread.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJtnuUqdWSb3El2g2uOXmw"
  },
  "dO6Vk9J1psEHjzclruUGUw": {
    "date": "10/30/2014",
    "text": "Service was excellent, extensive on tap beer selection. Blue cheese chips were delicious! Only flaw was the flatbread I ordered was not crispy enough in the middle and was a little soggy but flavor was great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sO6iNKgv_ToVfof-aQWgXg"
  },
  "_WOJ4XbcAB5dqKVlRTCIgQ": {
    "date": "9/6/2016",
    "text": "I love Duckworths! Tammie was amazing, she had excellent beer knowledge and a great personality. I will definitely be back for more craft brews :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ePkaelwlrGVvRn3MPETkoQ"
  },
  "kIvz6DDl7dblbhKheNiVmQ": {
    "date": "5/11/2012",
    "text": "Bland food and bland service. I will not be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vF5T045KKO9m4AdhGydySQ"
  },
  "GtSg7jDigHWHQFmcCZ_j4Q": {
    "date": "9/2/2016",
    "text": "I ordered the Carolina Barbeque and wings platter. I ordered the Leno pepper wings. It was ok. Great sports bar atmosphere. Lots of TVs so it's a great place to hang out. Seems to be known for craft beer selection but we didn't have any. My hubby wanted some natural cut fries and saw some on posted pics and thought we'd check them out.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xox-pONGs4kliQ34dXO2Qw"
  },
  "r0ovJNDom8XD8fVKBoo82g": {
    "date": "10/21/2014",
    "text": "This is a good restaurant. They have a million beers on tap. The prices for both beer and food are a little high but the quality is very good. Give it a shot you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z0Zy7eVZpURv_T7RN5e3lQ"
  },
  "tUOG5JJuwQPf_P_8xPQUjA": {
    "date": "2/14/2012",
    "text": "Can't say that I expected a whole lot but I was pleasantly surprised to find the beer list as long as my arm and them carrying several of my fav's.  The place was packed on a Monday ($3/pint night) so you never know if the service can maintain.  All in all I thought they did a great job, quickly seated and catered to right away.  The food was fantastic too.  I had the flat bread BBQ chicken and jalepeno pizza paired with fried pickles.  Yummy bar food...my secret love.    Now that I know this place is doing $3 pint night on Monday and Carolina Ale House is $3 pint night on Wednesday, I've only got 5 more places that will cover the other days of the week!  Let the hunt begin!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "HuuRcl0hpkjDQ6vZJyeYZg": {
    "date": "2/19/2014",
    "text": "Came here because of a recommendation from a friend.    fried pickles-3 wings-3-they claimed whatever the sauce was to be award winning.   Disagree. bbq pork sandwich-1 (i don't know how this is possible in NC but it was-disgrace) however my garlic fries get a 4.  beer selection would be the only reason i would come back here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "r4_XcrRt08sADOdIT5ex3A"
  },
  "fV3w5IgjxYX9y8ixWUT4DA": {
    "date": "7/18/2015",
    "text": "Been here with the family a couple of times and both times I had their pizza.  It's some good pizza. I'd recommend it and I'd also go back for sure. Thank guys.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0ubhEyGkUWEZoXvuZ7QeA"
  },
  "L_nmePSedWK5k6M24AX7dQ": {
    "date": "1/29/2015",
    "text": "Have a huge selection of beers.  They have an IPAD beer menu which is cool as well.  The food was pretty good.  I had the tater tots and chicken fajita and it was excellent!  It appears as if they were understaffed as well when i went a few months ago.  They managed to handle it pretty well.  Overall great place, atmosphere and would recommend to anyone!!  Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fdeRD6IWFN_GVeTGmh2ghw"
  },
  "7n8nj55kXrGltqSwfiMAOw": {
    "date": "6/29/2015",
    "text": "Can't say enough for the beer selection.  Endless selections. Flatbread was okay. Wings are great also. Have had the tacos in the past and they were great. Small outside seating area but nice because you are not looking out on a parking lot.  Kind of secluded which is nice. Wish there was more booth seating.  Definitely  plan on returning.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kCuhv067MOIHv9uLIoP7tg"
  },
  "xb5VEPytpg-gAaHPOqFMXg": {
    "date": "9/4/2018",
    "text": "Service was ok. Had to flag down our server often. The buffalo wrap was delicious. Not to spicy. Wings was great. The only bad thing beside the service was the extreme loud tv and people talking",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uO7XVsfncch_ZUoBXee1wQ"
  },
  "zWS_DM4BuRo_6j-PrpGihw": {
    "date": "2/4/2017",
    "text": "I'm not a fan of Dworth's - this location or any. The service is always very slow and lackadaisical, and the food seems just as lazy.  Oh wow, they have a wall full of draft beer!  Well, so do a lot of modern establishments! And, those places will be my first choice over this company. Sorry, not sorry.  It can get busy and loud during big sporting tournaments when all the bros come out.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "M3ncFIlEfaSdSpoiMINwBA"
  },
  "ey8PLBLL-LOWm_d7R5VGlA": {
    "date": "4/5/2018",
    "text": "Great fun sports bar and restaurants.  Good food and a great place to meet people.   Great Service too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cT2_lqP-tV5s3g4VDYI1KQ"
  },
  "36BNkQJS72O_aJlGMuyynA": {
    "date": "9/12/2018",
    "text": "Great wings and verity of beers. I loved there burgers. Service is great and staff is really attentive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lpYa1HPRZYDdEZmzU0RL4A"
  },
  "brN91LNLAf3O5RdWT5OQ_w": {
    "date": "7/6/2018",
    "text": "We tried the Duck  Worths for the first time last night and the food was great, freshly cooked very tasty and well presented. The waiters were attentive and service overall was good. The restaurant looked to have been recently decorated. Overall a great meal . And donut holes were crazy good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "idgGrA8gt699JDUPKyiHJw"
  },
  "N-5eUlCWHTYof09ATvcjhQ": {
    "date": "11/4/2017",
    "text": "Not a bad place, but not great either. Pretty much a nightclub atmosphere, very loud, with food and kids. I don't usually comment on things like seating, but the booths were incredibly uncomfortable and ratty. Very thorough beer menu - and on an iPad, to boot- but food was mediocre, at best. Expected more from the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VHq5-cn5VsyrVqg1czI5Aw"
  },
  "6cqylQne8gqG28xZNOD-Iw": {
    "date": "3/3/2019",
    "text": "I'll start off with the food because it was good. The French fries were good, kids enjoyed their burgers and chicken tenders. My husband and I ordered the same dish. We asked for a side salad because the only sides offered at lunch are potatoes of various forms. Literally not one other vegetable.  We also asked for our sandwiches without buns because we are eating low carb.  When the food came out only one of meals was prepared. The waiter forgot to put one of the meals in to the kitchen. Also it came with the bun, which I just put to the side, but it wasn't correct.  The waiter admitted his mistake and brought the side salad so at least we both had something to eat.  He didn't come back again until the other sandwich was done and someone had brought it to us.  The rest of us had finished eating (it took a long time for the sandwich to be cooked, it seemed like longer than the 1st one took) so we sat and watched my husband eat after we had all finished.   I ate my entire meal without anything to drink because until I asked the (I'm assuming) manager for a refill of my drink nobody checked on us or offered.   Our waiter was so busy spending his time chatting with coworkers and standing around it was frustrating because I couldn't get his attention and he made ZERO effort to take care of us. I watched other tables being taken care of and our waiter just standing at the bar, standing near the back chatting. Truthfully I noticed quite a few people standing around.    We didn't get an apology for the fact my husbands meal arrived so late after our other food. I didn't expect a discount or anything except a real apology and at least being attentive after making that mistake would have been appreciated.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3xT0gLF5tHqEi2-qPQEqbg"
  },
  "aOxNoDnSp4Y4oddpN5oUow": {
    "date": "2/23/2018",
    "text": "Great neighborhood restaurant and pub.  Pizza is really good, and there's always a certain large pizza for 10 bucks.  Cheese steaks and burgers also a favorite.  Many local and other craft beers on tap.  Occasional tap take-over events.  Friendly staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZKgLD8hM5WWZKYwByL17Fg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Founders @ Ducks!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZKgLD8hM5WWZKYwByL17Fg/o.jpg"
      }
    ],
    "user_id": "10a_irgRWh1_Wvrapkyvpg"
  },
  "a6KkujvLxHdu08cb2I6itA": {
    "date": "3/10/2019",
    "text": "Food was amazing! The manager ken was extremely friendly! He came to our table to check on us and made sure everything was perfect! I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4rlKOKBgpcTqIif-q66hqA"
  },
  "PjAHBTsHhlSgY-L1sfgsiw": {
    "date": "9/28/2017",
    "text": "Always a fun time at Duckworth's.  Been to two locations so far (uptown and ballantyne) and both locations were pretty good in terms of food quality, service, seating capacity and ambience.   Loaded Chicken Nachos would never get over!! that's a super hearty portion but enjoyed every chip of it.  Lots of chicken, like literally a pound of chicken! You get those fancy ipads to swipe through various beers, wines and cocktail lists and end up buying a beer anyway.  Why don't just order that beer already? Service was also good at this location, forgot the guys name but he was very good and quick on his feet. Would definitely go back for another bite!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "F4Abg96un5mT019hdstmVA"
  },
  "hhgCUBJTjolkMK5PYnO_YA": {
    "date": "2/13/2019",
    "text": "Take out food so hot. Philly cheesesteak absolutely delicious. Could not have had a better experience.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qWGMpGVE34y_XUzTUFVxzQ"
  },
  "uL01AFbsF5OCogeHQw5rzg": {
    "date": "8/10/2018",
    "text": "Great place to watch a game Little bit everything served here to meet all needs Went with the chicken wings Carolina bold and gold sauce and it tasted good. Got my eyes on the impossible burger next.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LdOAamKzfDlc2ieWE_225w"
  },
  "elf_d5SgBiKL5W9rexzX4Q": {
    "date": "10/23/2018",
    "text": "I walked into Duckworths feeling alone and broken, a shell of a man. As I walked on, I headed straight to the bar, past the hostess who I would eventually know as Jensen. I sit down at the bar, with a feeling of want in my life. I look up and there he is. His lustrous beard reminded me of my fathers, although things were not always pleasant at home. He welcomes me gently and in a soothing strong voice telling me his name is Andy. He asks if I would like anything to drink. I'm thirsty. Parched. I ask for his recommendation and he suggests a love ninja. The way he described it gave me goosebumps. He asks for my I.D. which is so flattering to someone of my age. He asks about a beer club, I decide to join after finding out that he's is also a member. I put my mouth to the glass, Andy watching all the while, and I taste heaven in my mouth. It's so creamy and delicious, very easy to swallow. Andy comes up and asks me if I'd like an appetizer, but I don't, I'm too eager to get to the main course. I ask if there was anything he suggests and he tells me of a Big Bad Burger. The sound of it scares my nubile innocent mind, it seems so intense but also enticing. I tell Andy I'm scared, but he gently touches my hand and tells me that once I put it in my mouth, all my worries will wash away. I wait patiently as the ominous burger is prepared in the back. When it comes out, Andy lays it in front of me with his burly arms. He has the physique of a lumberjack. I stare at all the meat in front of me and wonder if my supple body can handle such a burger. I open my mouth wide and take a large bite. I start choking a little bit and my eyes water. It's so spicy and sweet at the same time, such a seductive sandwich. I feel a hand pat me on the back to stop my choking. I look into his sultry eyes which resemble an abyss that I just want to dive into, and say thank you. He grins and told me it's okay, not everyone can handle so much meat. I start to feel better about it. His soothing words made me realize that it was okay. I kept working at the burger, trying not to choke again but so eager to get the whole burger inside of me. Eventually I did, I licked the delicious glaze off my fingers and was fully satisfied for the first time in years. Andy asks if I'd like desert, but I'm filled with too much meat to handle any more. I thank him dearly and give him the best tip he's ever had. I will definitely come again...",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HG2tH4-JqUAhcjILkwjnGQ"
  },
  "47c87pMC_Q8NjsITll_BpA": {
    "date": "7/26/2018",
    "text": "One of the best bars in town, great bar specials and convenient locations. Staff is always super friendly and offers recommendations based on what your eating and drinking. There are tons of special events offered through the month for breweries and food items. Love it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zr340LR68X478zkAsVAf5Q"
  },
  "tJ3MK14ywQvKrMjg2jWriA": {
    "date": "6/10/2018",
    "text": "Great late night place to eat.  Food and service are always consistent no matter the time.  They have some of the best burgers in town, and I highly recommend trying one.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z4c0ZNbz9c9sJ74gck_Imw"
  },
  "hGb5fJuZoWyl-ko4b8NsBQ": {
    "date": "1/5/2019",
    "text": "Awesome atmosphere, fajitas were perfect, and our server Louise was outstanding and had an awesome recommendation on the beer I chose. I'll be there again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TX3-6ROvMXCZ7vdGrqTpeg"
  },
  "iqsaLDjEcCret9nJR2Jzvg": {
    "date": "12/31/2018",
    "text": "This place is amazing! I had the impossible burger and it tasted just like a real burger! I seriously had to ask the waitress a few times if she made a mistake and ordered a regular burger instead of a plant-based one. What I really like about this place is that they offer vegetarian/ vegan dishes and they don't compromise the taste. Our waitress was extremely friendly and professional, and she made sure to bring us out hot french fries. I am going to make sure that I budget for a weekly treat to Duckworth's. One of the best restaurants in Charlotte, hands down.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AqLbs1FCxUCItE46NX9HQ"
  },
  "pHZjLcWYeRuIUZJTL15zdA": {
    "date": "9/20/2017",
    "text": "Relatively underwhelming food, but I am giving four stars for three reasons: (1) Quiet outdoor patio available, (2) $3 drafts on Wednesdays all night, and (3) evil twin - all I know is that I know nothing, is on draft. Beer list is large but unimpressive. I recommend coming here on a temperate Wednesday to enjoy the inexpensive beers on the outdoor patio.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x2yep2170vQWIybJnakkSA"
  },
  "3YYLxGpma3NYJr261JoApQ": {
    "date": "11/16/2018",
    "text": "Typical bar food.  They have a large selection of beer.  If you are in the Ballantyne area you can get a quick lunch there as well.  It's a decent spot for after work drinks as well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owJxLKSBm9SQAtjerMSxdQ"
  },
  "laM7mopL9gp3KUx9ah8KfQ": {
    "date": "6/27/2016",
    "text": "So came back in for probably the last time for food. Ordered a salad, sounds safe right? Nope!  They served me rotten salad. Disgusting!!! (see pictures).  This place has gone to shit due to sorry staff and management.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8nQk2--d9pB7QCCes-BtLg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Gross",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8nQk2--d9pB7QCCes-BtLg/o.jpg"
      },
      {
        "img_id": "iKud03oe7JS5QbGO-Hjlgw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. They served me old/ spoiled lettuce ...",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iKud03oe7JS5QbGO-Hjlgw/o.jpg"
      },
      {
        "img_id": "wV5SPO48PfvNokrO-0tcDA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. They served me old/ spoiled lettuce ...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wV5SPO48PfvNokrO-0tcDA/o.jpg"
      }
    ],
    "user_id": "SWFP-3VMVFkQswmTHwHODw"
  },
  "-AL40pMa_jVAeQwYsErmWA": {
    "date": "3/18/2012",
    "text": "My family and I enjoyed our meals here!  My wife had the Grilled Salmon and said it was among the best she had ever had.  My Daughter had the Mixed Grill and loved it.  My son had the Hangover pizza and he also loved his meal.  I had the fajita nachos and was overwhelmed by the size and flavor.  The portions are large and the flavor is abundant.  We finished the meal off with what I would consider one of the best chocolate cakes I have ever eaten.  Outstanding!  We will definately be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Eh173uxC1IVP1TnLmwaBFA"
  },
  "SBzUGvBrNv9OVfkytMZejQ": {
    "date": "10/24/2013",
    "text": "Love this place.   My husband and I have started to come here to watch football on Sunday's.   Great selection of beer and amazing food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HaS78RXXuw9ffTLgeR1CTQ"
  },
  "CuQ2QBVOtDR43h3LgDvCKg": {
    "date": "7/25/2013",
    "text": "I ate lunch at Duckworth's on Thursday, July 25th and had the most awsome Chicken Quesadillas I've ever tasted.  And our waiter, Chris, was the absolute best. I highly recommend this restaurant.  :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hODpDEl5zusi7R69irqgGw"
  },
  "wN8l2FShrEVe2o1j_YmblA": {
    "date": "11/2/2012",
    "text": "Excellent food! Our office is located minutes from this restaurant and we visit them very often for lunch. Their cheeseburger special on Mondays and Thursdays are AWESOME and the best deal in town! I just tried their BBQ sandwich and it was great. Their sides are great too, fries, sweet potato fries, and onion rings! Give them a try, you won't regret it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lbr0_QKTNV9k7X_EpgymlA"
  },
  "hjFIaLkrFs99HiNgiUc8dw": {
    "date": "10/15/2012",
    "text": "Great beers on tap. Love the selection, rotation and suggestions on the front page of the beer list. Wouldn't have found Dale's Pale Ale without it!  Good Philly cheese steaks and tons of TV's.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HoU_TsjMjnnahH5CjJVCGQ"
  },
  "_66Ql6dLsazefuT4NHcQ7Q": {
    "date": "12/16/2011",
    "text": "If it wasn't for the beer, I wouldn't go here. With the exception of one waitress, the service is well below average. One waiter isn't 21 and is supposed to be able to give you advice and help with your selections. That would be alright if an establishment only serves Bud and Miller, not a place with such high quality beer. The atmosphere is typical strip mall, very bright and loud.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cD_55KnDr1dRHXUNXxqXWw"
  },
  "ob09NICdgkhGH76F7IYD3g": {
    "date": "3/13/2013",
    "text": "All was good at the resto.  Service excellent, ambiance and atmosphere, and the quality of the drink and food superb.  Great evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dofIvA_zkeiDcLM9QQiRDQ"
  },
  "L5vRfhDS1s-L63_XXPVdnw": {
    "date": "11/5/2012",
    "text": "Wings were good.  Sweet potato fries were outstanding.  Beer selection is really good.  Great place to watch a game.  Were were there this past Sunday to watch the Panthers play and loved the atmosphere.  The waitstaff is outstanding.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2F4fUYY5rJI9v3p4MOSiDw"
  },
  "45VHBTzhnb8TsjDi0B_Qbg": {
    "date": "4/8/2014",
    "text": "Great beer selections, local, craft, national...tons of taps! Depending on when you go (game days are crazy in there, very loud, but, if you get there early enough to grab a table in the bar area, watching a game there can be lots of fun). Service is good as well, even when they are busy, they usually have an expediter run your food or drink if the staff is overwhelmed. Management sometimes stops by when we are there to ensure our experience was good, not every time we are there, but about 50% of the time one makes it over to us before we leave. As for the food, it's bar food folks, some of it is going to be good and some isn't. The buffalo blue cheese chips are a hit with our family, but not so much the nachos. The flatbreads are yummy, as are the burgers. I am a wing lover, and can eat the spiciest of the spiciest out there. Their hotter hot are still totally tolerable, not as hot as they sound, but good overall. The best wings in the house though, are the mommoo's, in a vinegar based sauce. A must try. Greasy but delicious! Make sure to ask them to chargrill finish them, its worth the extra charge! Overall, if you select your food right (remember this isn't fine dining folks, its a bar) and order a draft beer to your liking, you will definitely enjoy your experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "v1xbil7KgcFngYsiRVvbHw"
  },
  "FKrcRUHkphEJHMMH7qE6hQ": {
    "date": "10/18/2014",
    "text": "We sat at a \"communal\" table which means first come first served in the bar, but others may join you. We were lucky in that nobody sat across from us. We came to celebrate a birthday and to watch the UNC football game because the Ballantyne Hotel doesn't get ESPN-U; which is where the game was broadcast.  We had Spencer as a server and while I believe he also had a 15+ top outside plus other bar tables, he was cranking it out! He was very on point and attentive. He always checked on us. When we needed something or when something came out missing an item, he took care of it in record time.  I was very impressed with him as out waiter. The shots ($5 chilled Patron) was a good deal... We had several! The wings were good - get them extra crispy! We also got some fried pickles; which as odd as they sound, are quite good and salty. We also had a few beers before I asked for a Diet Coke (needed some caffeine!)   We share a large cheesesteak. Unfortunately, they forgot our onions - but Spencer and the manager fixed it right away. The steak was sadly very over-cooked and chewy; I probably wouldn't order that again. The chips were good with ranch. ...and the ranch was quite good too!  We finished with their Reese's cake/desert. It was very very sweet and clearly was pre-made and frozen before thawed and served. I had a few bites hit didn't love it. Which says a lot because I'm a sweet-a-holic!  All in, we were here several hours. While our tab after tip was just over $90 - for the area and considering the alcohol we had it was ok. We came here for wings, beer and bar food; they had it and then some...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tWDydjs4sqj6_9f-Asv5UQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Uh oh... Don&amp;#39;t worry, Uber serves this area. Don&amp;#39;t drink and drive!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/tWDydjs4sqj6_9f-Asv5UQ/o.jpg"
      },
      {
        "img_id": "DVPptiqbHC1F2KjrvQOaiA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/DVPptiqbHC1F2KjrvQOaiA/o.jpg"
      }
    ],
    "user_id": "4LYFy4BZot6YrP3bKUsCTA"
  },
  "YQe-82YhSpKdahMmQ-5G9A": {
    "date": "2/3/2015",
    "text": "Continuing from my last review, I'd like to add that the SW Veggie Burger was really good. I ate it with everything except the sour cream, however I did slice up some cheddar cheese and added ketchup. A bit spicy in some bits, but over all- finger licking good.   Next to review the cupcake sampler. First up was the vanilla bean cupcake- good. Icing tastes just like vanilla bean ice cream, but the actual cupcake is just ok/mediocre. Next up was the chocolate one- omg death by chocolate.. dark chocolate, very rich and bitter, should be served with ice cream. Third, the lemon drop- by far my absolute favorite. If they didn't have the rule of \"no mixing and matching\".. I'd probably order all 4 lemon drop cupcakes! Absolutely yummy! Lastly, I enjoyed red velvet- it wasn't horrible, but after lemon drop, it wasn't very memorable. It had more of a Graham cracker pie crust kind of flavoring than of red velvet.  I would be interested to see them make a German chocolate cupcake with the coconut and nut filings! :-)  Over all 3 to 3.5 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OV7w0v-HwBGBh4EWLUNv3g",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Cupcake sampler from top clockwise: red velvet, vanilla bean, chocolate, and my absolute favorite lemon drop!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OV7w0v-HwBGBh4EWLUNv3g/o.jpg"
      }
    ],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "w6WLRrcEJxF3_ndswnS7Sw": {
    "date": "2/25/2018",
    "text": "This restaurant has the best food and service in charlotte!! I highly recommend the grilled salmon with mango chutney glaze!!  Their salads,nachos, steaks and sandwiches are amazing. You can't go wrong. Not to mention the vast selections of beers. There are 5 locations in n the greater Charlotte area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g3ZH5NLGnNwqygVXzej1TA"
  },
  "Xn_70cBxKqwXakuJybzaFg": {
    "date": "11/23/2014",
    "text": "First time here and came for the beer. We did have the super nachos as an appetizer. The place was packed but our wait was less than 10 minutes.   They have an impressive beer selection and you review the beer selection by a notebook. It was a great idea! You can review the beers and save them as a potential pick.  Nachos were good. The beer was excellent. I will be coming back.   The only negatives: tables were small. Four people at their four person table barely fit our drinks and appetizers. Not sure how you are suppose to eat a meal also on it? Also the bathroom could have used attention.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zC2sg6Z5nkaMeiKC6_5Hzw"
  },
  "1CpICrrrcS7Vob2friUriA": {
    "date": "9/23/2017",
    "text": "This place is a great cheap, casual hangout. My boyfriend and I come here all the time at all hours of the day and we've never had to wait for a seat. The place is clean, staff is courteous, and food is super fast and yummy for being bar food. They also have a huge menu so it's a great place for those times where no one knows exactly what they want but they just know they're hungry! (Aka if you are a boyfriend/husband who needs to feed your hungry girlfriend/wife and they can't decide what they want lol)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0j3dBA2Vh2FTvWJjRcx_-Q"
  },
  "qVDFfTgIRk_ncAbQvJu-Vw": {
    "date": "9/21/2018",
    "text": "This place as gone way way down hill. We have been coming here for the last 5 years. I don't know if management changed or what but we lost all faith in Duckworths. Tonight was the biggest waste of $47 I've ever spent. It took our server (Jordan) 15 mins to great us. Which probably would of been longer if we weren't sitting in the middle of an empty dinning room and what I can assume is the GM (taller man in white button up) asked about us. Once we placed our order it took over 45 mins to get our food. Which mind you the only other table our server had sat down 30 mins after us already had their food and were pretty much done and they had more food then we did. Once we finally did get our food we told her we needed boxes and the check since we have been here for an hour and are just getting our food. She seemed perplexed that we would ask for them and just walked away and got the check and boxes. My wife's a server of 10 years if she had a table that said something along the lines of what we said she would of grabbed the manager but Jordan just seemed to be more concerned with doing her side work. I find it kind of odd that the manager wasn't concerned with a table sitting there for 45 mins with out any food with obvious pissed off body language didn't feel the need to touch the table and make sure everything was ok. But I guess in order to do that she would have to stop watching a game that was on the tv and stop chit chatting with 4 or 5 servers. I would understand the wait if they were busy but they clearly were not and most of the staff was just standing around. We never had problems like this in the past but the last two times have been similar experiences. We would have said something to the manager but we didn't want to pull her away from her socializing and I'm not the kind of person that wants things for free. I thought it was common practice for the manager on to touch tables to check on them but It appears to me that the manager doesn't really care and just wants to chit chat. If I were the GM or the owner I would be looking for a manager that's main focus is customer retention and good service both of which are lacking recently which I can only assume is caused by bad management.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mn1OVxazofDTKgKe82BS1Q"
  },
  "p99W4vTEUr9Y3bgOe3G5eg": {
    "date": "2/11/2018",
    "text": "I'm a big fan of Duckworth's and this location is great!  Give the sweet potato fries or homemade chips a try!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5FgO1TA8KBkOs5LtA1tWzQ"
  },
  "hAw3n70VtMJAqjNAcvvE5A": {
    "date": "10/22/2014",
    "text": "Great wide selection of bears. Lots of local options (I wish they had OMB on tap). Great specials every night and the tacos rock!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u0e2F0kqnjL2XswSQMYu2Q",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/u0e2F0kqnjL2XswSQMYu2Q/o.jpg"
      }
    ],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "D3Sc7HxFkqPUdiQnterpDQ": {
    "date": "2/4/2016",
    "text": "First time at Duckworth's!! We had the barbecue sandwich (lunch special) and the Philly Cheesesteak and both were AMAZING!!!! The server was friendly and efficient!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRKK8x3pJeUKhyulHGyrhg"
  },
  "G6zD1-JQ5IiX5cKQUF3Hfg": {
    "date": "2/2/2018",
    "text": "New to the area and thought we'd stop in and give this place a try... we'll never make that mistake again.  Slooooow service (on a Wednesday!) He ordered the philly cheese steak and says it was ok, but the applewood bacon burger I had was bland... literally only tasted the bacon.. no seasoning at all on the patty.  Our server was doing her best at playing peek a boo because we barely saw her.  When it came to ask for our check we had to ask someone else because she was no where to be found. They finally located her and she looked bothered that we dare interrupt whatever it was she was doing.  She took our card and was gone again!  We waited 20mins to get our card back when she finally lingered back to our table, SHE ASKED \"Can I get you anything?\" SERIOUSLY?!  Yeah, our card that you had for over twenty minutes! She said \"Oh! I forgot to do your check\".  I think she forgot her whits as well .  Lesson learned - never come back.  Way more options with better service in the area.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d7wBSZkF395Jh8lG3F8cKQ"
  },
  "9o41Gwj6uU_Xo3G7WzImdg": {
    "date": "7/3/2017",
    "text": "This place is exactly as advertised.  Not spectacular but always consistently good.  It's a little overpriced for what you get but the service is a step above so it's totally worth it.  The beer selections is freaking awesome.   I just wish these guys had a trivia night so I would have am excuse to go weekly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VeRy6Em8vsCQe6EKePiWeg"
  },
  "MvvGAxI8J5xsKsGuHRrhGw": {
    "date": "2/2/2017",
    "text": "I love this place! I go all the time! I often even went by myself for lunch when I was pregnant. The cheesesteaks and fries are amazing! I think my favorite order is the Buffalo Chicken Philly Cheesesteak with fries. I also recommend the nachos. You really can't go wrong! The staff is always nice. They also have some good salad options for those who want to be healthy.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 3
    },
    "photos": [],
    "user_id": "1Sd4p9TIjoTMW7ReFBY-hQ"
  },
  "L6f4ihU8bBmx72pVNtbaYw": {
    "date": "2/27/2017",
    "text": "I'd rate Roxanne a 5. However, the speed of service from the kitchen is what resulted in a 1 rating. We waited 1 1/2 + hours for food. And the restaurant was not packed. The kitchen was slow and over cooked the chicken sandwich. The Philly cheesesteak was delivered cold. Roxanne was the only saving grace. We love the Duckworth's in Huntersville.  We will give this location one more chance.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WgyiiQj7GTwN4RHDQ3Ti4A"
  },
  "yV3DYZ5DJNOXt8k1Cg-JsA": {
    "date": "3/4/2018",
    "text": "One of my go-to places. There's something for everyone when it comes to food and drink. Great beer selection, both local and international. TV screens everywhere! Service is attentive and not disruptive. You gotta go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VCmC45edL5zIuqgrGaqC3A"
  },
  "rkIdpVtqboIWn7KHAOWwbw": {
    "date": "3/2/2018",
    "text": "Usually order here for lunch and occasionally go after work for drinks and small dishes. Love their wings!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "15zZzvhf4jQnuvaH2XVtLg"
  },
  "8zeuX_lzn3Zj_1NV3W6YOQ": {
    "date": "12/18/2013",
    "text": "I stopped in here for a couple of beers because their website said they had Cold Mountain on draft.  When I got here, I was not disappointed.    The layout of the place is a bit bigger than my normal Duckworth's on Park Road but it was basically laid out the same.   There were about 40 TV's around the place and outside in the enclosed patio so it's a great place to see a game or 3.    The beer list has about as many selections as the Park Road location.  Any beer that have in bottled form is available to take home!  Yay!  They had Cold Mountain in bottles also so I took two home.    All of the staff was great here.  The bartender was helpful.  One of the managers stopped by and shook hands with everyone at the bar and everyone wished you well when you walked out.    I didn't try the food since I was going out to eat elsewhere but I'll make an effort to do that in the future.  For now, I give this 3 1/2 stars.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "cTlwqeOinG-xerJg3FuhFA": {
    "date": "3/22/2017",
    "text": "Great loaded nacho's and detailed beer selection. Friday/Saturday nights could be a little more lively(band?). Other than that its a good tap house.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GCxjUcPqaFk0NF4JdzcELg"
  },
  "FeCiu-DmhxpiiDcQWUkVWQ": {
    "date": "2/8/2018",
    "text": "Our definite go-to restaurant! The food is delicious and service is great! You're greeted with a friendly smile when walking in.  Our server, Nikki, was Ah-mazzzing!!  She had great suggestions for us, including the delicious tater tots with chipotle ranch!  She was prompt and friendly!  We'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "shAyWdkdj7k5jWFgrQBxIA"
  },
  "oU2yPFS5XfUVJZ-o7yCfpQ": {
    "date": "2/2/2018",
    "text": "Food and service was amazing!! Can't wait to go back. Everything we ordered was wonderful and I'm very satisfied with my server",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1QpnAjyXawGnCcjAmi47iw"
  },
  "42Pb-u5m3G7NPd-378w0Eg": {
    "date": "1/27/2018",
    "text": "We recently moved to SC from NY.  We love to eat out and are always looking for a new place.  We happened to see Duckworth's from the car on our way to another restaurant, and just the name made us make note of it.  And we are very glad we did.  We stopped by for a glass of wine today to see what it was like and we loved it.  We ended up ordering food even though we hadn't planned on it because we loved the environment so much.  Everyone was so friendly, and it was spacious and clean.  I ordered a flatbread pizza and it was absolutely delicious.  My husband ordered mozzarella sticks and loved those, too.  Our waitress was wonderful and the manager checked to see how we were doing a couple of times.  We will definitely head back there within the week!  I highly recommend this to anyone looking for good food, good service, and at least 15 TVs with every sports game going on you an imagine.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YJUS_5uVAHSzGTEm-UOQLQ"
  },
  "dK5SK971I-8-SIrnMuPjQw": {
    "date": "4/5/2019",
    "text": "This is such a wonderful place! They have such a large variety of food items and it's all fantastic.  I recommend the pulled pork as it is tender and cooked to perfection. Also, the atmosphere is super cool and inviting.  I highly recommend!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZoqW2_6OhA_qmmQrrq7vHw"
  },
  "6diY6GaC4EzPB4sLwGQKvw": {
    "date": "6/18/2019",
    "text": "Went there this past Sunday night after a long day. Went in around 11 pm was created at the door by a host.  I order the twisted chicken sandwich. The server recommended I get it in a tortilla. It was so awesome and I didn't feel bloated from eating the bread. The sweet potato fry were out of this world. The manager Ken came by to talk to us for a min. He was a pleasure to talk to. This place is very well ran, food is awesome, and service is great. I will be back very soon. Thank y'all.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nd364x7hIXY8hub7XCYJLA"
  },
  "2_QZUPa_GVbPJ973uYsOoA": {
    "date": "1/23/2019",
    "text": "Not impressed. 1st place wings are horrible. I sent them back twice for them to get them right. I ordered them well done and they must not understand what well done means because the second attempt looked exactly like the first attempt.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_2hm9TwsyeS45oJVB5-rmw"
  },
  "cQmv84oDZ1lq3jhxchKfZw": {
    "date": "6/6/2019",
    "text": "Great staff, food, and beer selection! Kids eat free on Tuesdays and Thursday with an adult meal.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lEb11LEj61wN4TYoK1ck9Q"
  },
  "ih5hVqqeiV85g1onxvMY5Q": {
    "date": "7/1/2018",
    "text": "Must dine in...   3x in take out and delivery and they can never get it right.  I once just gave up when trying to order a steak salad and they kept asking me things like i ordered fajitas. My office at work was in disbelief just hearing my side of the conversation. I canceled and hung up...   Then, I switched to online ordering but still a hot mess with missing items/sauces and a $15 salad the size of a side salad.  (if you dine in, it would be a nice salad tho)   When dining in, the food is a mixed bag, but they always try to make it better if something comes out horribly.  Overall average eats.   Slow service, but everyone's nice.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qolJ3yHjNtQIlI0JD1xyRQ"
  },
  "FY1tDurm-91kxpwwh5h9hw": {
    "date": "5/17/2019",
    "text": "Only been there once but they had a great beer selection and the wings with the sweet and gold sauce were very solid. also, had a margherita flatbread which was very light but tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-7rXEqkT59fwGvXGBK5aIg"
  },
  "KNRPs0-_p_BeHD6KJt61HA": {
    "date": "10/2/2016",
    "text": "While visiting North Carolina, I was fortunate enough to catch my friend's birthday celebration. She decided to have it at Ducksworth in Charlotte. It was a nice location for a multi-generational event.   The vibe is like cabin casual with a full bar, big screens playing sports and several seating options. The staff seemed to be friendly and on top of things considering how busy it was on a Friday night. The noise level can be a bit loud, I'm used to it but do to the cheering of fans watching the games and the amount of customers don't be surprised if you have to SPEAK UP!  As for the food, I ordered the Jalapeno Chicken, vegetables and exotic rice. This is where my rating hits 3-star or average. The meal in my opinion was average. The ambience of the restaurant seemed more exciting than my meal. I could barely taste the chicken, which the texture was a bit dry, under the cheese. I like a bit of cheese with my chicken not a bit of chicken with my cheese, thank you. The veggies and rice were good but again, the ambience was more exciting.  I will say they made a very good Cocktail so if you are looking for a beer or drink this place is quite alright.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 8,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "n1PX4DklN5YG2eLMEqPAKA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/n1PX4DklN5YG2eLMEqPAKA/o.jpg"
      },
      {
        "img_id": "pJDdmNlR4DBzrHVGnLml9w",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Double grey goose and vodka",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pJDdmNlR4DBzrHVGnLml9w/o.jpg"
      }
    ],
    "user_id": "quDu_Z0-i9TCYvdHRnULEw"
  },
  "r6lmdAR24djLCWLpy7eGpQ": {
    "date": "7/28/2018",
    "text": "This was our first visit to Duckworths and we will be back! Our waitress Crystal was amazing, she gave great beer and food suggestions and was a pleasure to talk to! There are so many beers to choose from, and everything we ordered was delicious! Definitely recommend the nachos!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "MeNNU1T6FzTMliuFBRQzpQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Nachos!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MeNNU1T6FzTMliuFBRQzpQ/o.jpg"
      }
    ],
    "user_id": "lZhSox-EJFcucjs2JQ7RJw"
  },
  "s4QB821i1T-vnjn-owPNfQ": {
    "date": "10/10/2016",
    "text": "So I expected a great beer list with marginal food. I was wrong! The beer list exceeded expectations! It's listed on an iPad that provides a description of each beer. Nice. So I reluctantly ordered the salmon( what was I thinking?) I was thinking smart! As the salmon was very tasty. It came with a satisfying salad and also a  rice and veggie side that was great. So the beer list is awesome, the food is surprisingly good, what's not to like?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wdwqTfTzgyeAopwR-Bud0g",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Beer taps",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wdwqTfTzgyeAopwR-Bud0g/o.jpg"
      }
    ],
    "user_id": "Sp9etOpTTIDWKIYYRRNG3A"
  },
  "bxX6nH8OSVl1ai2kRkJC4A": {
    "date": "12/11/2018",
    "text": "The best grilled chicken sandwich in Charlotte, no question!  I especially enjoy the Ballantyne location because it is very family friendly too.  The menu is incredible, the pizza is fantastic and the apps are fantastic too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iRPl5kyl3olcHnND-g0kTw"
  },
  "X9fyGXsAVtOa7C1_Oqqtfw": {
    "date": "11/12/2018",
    "text": "I am a regular customer of Duckworth's in Huntersville where everything is always perfect. This Ballantyne location needs some fine tuning. The ribs were great. Both of our fries were cold and soggy but were replaced. The Buffalo Chips Appetizer was average at best. Still a good dinner spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZBn7SYd4Tn80BAGYmNLUow"
  },
  "90qqusEr4OJIZc8ibPTXuA": {
    "date": "1/11/2019",
    "text": "GREAT VEGAN OPTIONS!  They now carry the Impossible Burger, which is priced WAY to high so i only go there once a quarter or so, but done well. If they dropped this to $10-$11 i would eat their weekly. Grilled veggies were off the charts, they used peanut oil and maybe a soy or something else that was a little salty, so good.  Service is always great, I do not recall ever waiting long to be seated. If you like beer, they have a ton of small crafts.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3bRtnUjKAqZGY_xM0toi9Q"
  },
  "sb4rVASHfBAOah9aP6jUsw": {
    "date": "10/16/2018",
    "text": "Excellent food quality & service!  Thank you for a great experience!  Husband had burger with sausage in it - superb.  I had blackened chicken - excellent. Best ranch dressing I've ever had!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJyKW_wBgbM_akOMYr3Meg"
  },
  "nN37E4N6epVX5j8BrJ__cg": {
    "date": "4/11/2019",
    "text": "I had been wanting to try this place since I moved to town. Thought I'd finally give it a try tonight, so I ordered a couple of dishes to pick up. They were very slow for a Thursday night. 4 servers were hanging at the host stand, but they still managed to give me only one of the two dishes I had ordered. Yes, I should had checked my ordered before leaving the restaurant, but you'd think the staff would check as well before handling your food. I only realized when I got home. I work in the Ballantyne area but live uptown so there was no way I was driving 40 minutes (back and forth) for a chicken salad. I just took my fiance out to eat, and threw away the other dish that was all messed up in the box anyway as they also forgot to close the top of the beans container.  Very disappointing experience.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNq0uXCklESUILxKrlizzg"
  },
  "m4qtbwlJ4PzCcW1lA7I7Lg": {
    "date": "9/19/2018",
    "text": "Second time here and did not disappoint! Food to Atmosphere to Service - all on point. Courtney ruled the bar. She's my happy hour hero! From Jersey and have been craving the Sweet Bold-N-Gold's since the last time I was here. Great atmosphere, I watched the bartenders greet regulars warmly and pointed them to open seats. Did I mention the wings? I'll be back.... (not in the Terminator voice...)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hPoEcD-iy5aMj7v5N_8Ngg"
  },
  "KR8flIFWP7ce_cFzVV438A": {
    "date": "9/2/2018",
    "text": "Very good food. Kind of run of the mill 'current' style bar and grille interior. Clean and good selections even for those who have food sensitivities!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LPWSfa9mGf59P7KZg_eOdA"
  },
  "7f9IkPLciqX0c_gfxccU9g": {
    "date": "11/27/2018",
    "text": "We often visit this restaurant. The atmosphere is easy going and relaxed. They play many different sporting games on their numerous televisions. The bar area and seating area and large and not cramped at all. The nachos are amazing. Great food, great atmosphere and amazing service. I highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k9HPsBcYlibPlh2qVwEV2Q"
  },
  "T63BI8pxJXAu54hdzNGVLA": {
    "date": "2/5/2018",
    "text": "Met a newer friend here for dinner and a drink. We sat for about 3 hours, totally lost track of time but had a blast. The hosts sat us almost immediately and on a fairly busy night. Clemson was playing on the big screen and while we expected it to be loud, we could still hold casual conversations and not yell. Definitely kudos to the restaurant for sound proofing. My friend is newly 22 and doesn't know much about alcohol so the digital drink menus were a big help. She was able to view pictures of interesting beverage options, see a quick description and pair up flavors she liked with the variety Duckworth has to offer.  She lit into some honey bbq wings and I enjoyed a Caesar wrap with sweet potato fries. Both were well portioned and timely. Our server wasn't great at keeping the waters filled once we finished our alcoholic beverages but considering the rest of the positive notes, that wasn't the worst that could have happened.  Overall, not a bad spot to meet a friend. Wouldn't suggest bringing the family but there are definitely tables for larger parties. Will certainly keep this place in mind in the future.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "neB2-zoSA5XoewHHOGNDhA"
  },
  "QJOMZOKAitwnjf3MdqQmdA": {
    "date": "8/23/2018",
    "text": "We had dinner here tonight and had a wonderful time. Our server was very friendly and knowledgeable, and the food was tasty! My Strawberry Chipotle Margarita was so unique and delicious. We had a really positive experience and will definitely be back again soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MzdVBpmPIDNwAgWvWp4jUg"
  },
  "9f0tKFNk4sqPS92UtqtkxA": {
    "date": "6/27/2018",
    "text": "My friend and I both ordered the Philly cheese steak and it was delicious. Sweet potato fries were perfectly seasoned right:  sweet and salty. And great Arnold Palmer with right amount of ice. Then I saw a pic of the coconut layer cake and ordered that too. It was heavenly  Definitely loved the vibe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "LKHn7RY0YYkdICeIJlh-qA"
  },
  "DioDfOmi4jRHXYMi9by1Ew": {
    "date": "8/23/2015",
    "text": "Eh, it was ok. Very loud and sports oriented. Perfect for a guy. We ordered fried banana peppers. Really good, almost addictive. Not too hot. Everything that is fried lately seems to be accompanied by a ranch dressing which I'm not very fond of. But, it was good. My bed ordered the hotdog platter. Came with two hot dogs and a choice of one side, he got the beans. The beans were good, smoky and sweet. I ordered the rib platter and wasn't thrilled with it. It came with two sides and I ordered coleslaw and sweet potato fries which I make better at home. The ribs were a little bit dry and bland. Drinks were good as usual. No great shakes I wouldn't come back but, he would for the sports and the beer.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EDZKP6CGokUIoQfRmkLhdw"
  },
  "dxMeSvjLax7LPDfWSfzjjw": {
    "date": "12/6/2016",
    "text": "I have never had a bad experience here. They have a lot of beers on tap and a wide variety of foods to choose from on their menu. Their food is very good also. Great spot for a happy hour or if you want to take visitors to somewhere more casual but nice.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RESW4kX8g9oUqf77dHV83Q"
  },
  "NR2lfueNHjJFL0-dk5IpNQ": {
    "date": "4/13/2015",
    "text": "Ok, I learned a lesson the hard way...drove 30 minutes each way specifically to fill my growlers, only to go home empty handed. You see, Duckworth's won't fill any of the 12 growlers I already own, they want me to blow $5 on the junk growlers they are peddling. What a shame. What a sham. On the basis of principle alone, I refuse to be extorted. You just lost a new customer. Oh and thanks again for taking every shred of joy I should have felt getting my growlers filled and stomping all over it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPtcm-krVuWIyY4UIJqDFg"
  },
  "y2QgfqVyXWhSka8qJzh7Fw": {
    "date": "4/16/2013",
    "text": "This is my current favorite place to get bar food.    They have a great selection of beer on tap.  I am a little skeptical about places with so much beer because the beer can sit for a while and get old.  I have never had a problem with taste here.  They always have a $3 dollar special, sometimes two.  Thursdays at this location is pint night and most pints are $3.  This is a great deal for some of the beers you can only get in a 22oz bottle at the store.  On Sundays they tap a \"rare beer\" last Sunday is was a \"1809 Professor Fritz Sour\" very good but it was not cheap.    They list all of their beers and specials online.  This is good because you can spend a lot for a bar but if you play your cards right you will come out on top.    I like to get the boneless wings with the sauce on the side.  This helps them stay crispy.  The last time I came here my food was very hot when it came out.  It brings me much pleasure to have food that needs to cool a little before eating.  I got the smokehouse Philly which was not my style but the quality was amazing.  The garlic fries are awesome!  Service was great.  Our server had just come in and was not sure what the beer specials but was very pleasant and offered to bring me a sample of the beer before I got one.    I can't wait to go back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ofBG0aiodf4mmNsj4DeH1g"
  },
  "djW3Gs9uTKPSpwD6bk-4iw": {
    "date": "2/18/2014",
    "text": "Great selection of local and national beer.  Great place to hang out with a large group.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "P9H9tCYvRBuaCUKraOOs0Q"
  },
  "pbUm94IznegjMQW6Qqs1UA": {
    "date": "1/30/2013",
    "text": "Coming here is definitely worth it for the beer, but the food is usually a 'meh' experience. They're famous for their ridiculously long draft list, and they have beers there you'd have a really hard time finding on draft anywhere else. Worried about trying crazy experimental beers for 7 dollar or more per pour? Get a sampler and try them for a flat price of 6 dollars per four samples. Always a fun thing to do.  The food is always perfectly edible, but never makes me really happy. Seems to me like convenience cooking without any inspiration in the kitchen. It's just decent bar food, better than most bar food in fact, but not a place to come for a culinary experience.  The service is always friendly and efficient, which probably has something to do with the fact that out of the three times I've been here, managers came to ask us about our experience twice. That's nice I suppose, but not necessary.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "up-mcezRNykPU1RvfNFt0w"
  },
  "nescdv1C_wuN8FYoAk89GQ": {
    "date": "7/3/2016",
    "text": "Have been here many times.  Food just okay, not great but okay.  Service is lacking.  We are in our mid 60's, still like to have more than 1 beer each when we go out.  Waiter never asked us if we wanted a second round,  No Offer about dessert, never asked us how we wanted the check split.  Don't think we will go back as there are too many other sports bars and restaurants to visit.  Just because we are older we are ignored.  Poor service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Nps59G773_kl2hMTbbKoTg"
  },
  "XtsHtA7F7qUFTCrysALNtw": {
    "date": "5/1/2015",
    "text": "My favorite place to eat in Charlotte. The garlic Parmesan chicken fingers are to die for. And their fries are the best. Biggest beer selection in the area and a very diverse menu. Tons of TVs for sports. Overall an awesome place to eat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YCFwSpHrG92Q1YG62Oo4RA"
  },
  "7xnVwYS9LKZUZxy7HVnvXQ": {
    "date": "1/27/2016",
    "text": "I rarely ever come out to Charlotte so when I do I like to eat at different places. My friend suggested this place so we tried it out. I got the steak platter and it was humongous. I wanted my steak medium rare but when I cut into it it was rare. It looked like they just threw it on the grill for a few seconds. When I told the waitress she told the steak back and apologized. The manager came out and apologized as well and handed me a brand new plate. This time the steak was perfect. Not only did I get a new whole plate but they also gave me a free choose of dessert. I got the strawberry shortcake cheesecake and it was amazing. I would definitely recommend this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_wS5h4e3ubP5duN9Wt4IA"
  },
  "nHXun2BIy_-BDM3BTPiiEA": {
    "date": "9/4/2016",
    "text": "Ate here for lunch on a weekend visit to Chatlotte.  Ordered the steak salad which was a pleasant surprise.  The steak was juicy and well seasoned.  The service was good and our server was very friendly and attentive, even during the lunch crowd.  This looks like a very good local hangout that we will enjoy patronizing during football season.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exCtpfHgNYXe2CiqRVO8Jg"
  },
  "L07j1V1Yp3osE3_Blhi5XA": {
    "date": "9/28/2012",
    "text": "Love all the draft beers! I tried a couple local brews (Triple C & Birdsong). We ordered the Sweet & Bold wings. Nice texture, good spicy flavor. It was a little heavier on the bold than the sweet. We also ordered the Loaded Nachos w/ chili. This thing is huge! Large amounts of toppings, just needs more chips. The service was ok. It wasn't slammed but busy. The waiter just seemed uninterested. Lots of TVs for all the games! Overall, a good experience.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "d_FNcmMdBm8D8cSZ7X1Aaw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. The loaded nachos w/ chili.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/d_FNcmMdBm8D8cSZ7X1Aaw/o.jpg"
      }
    ],
    "user_id": "na1ZD7bFvAUHXiV61CrCDw"
  },
  "RK-wG-hoGHMaRkG2rQAlpA": {
    "date": "10/30/2012",
    "text": "I have been to the Ballantyne location of Duckworth's many times, as it is down the street from me, so very convenient location.  Great beer selection and mostly basic pub type food are on the menu here. Food is ok at best for me.  I have had good and bad, but maybe I am just picky.  The one drawback is that it gets crazy busy during peak hours and consequently very loud.  Not the best place to have a quiet night out, but they have great beer special, which is 3$ pints on most of their 80 or so taps.   As far as service is concerned, I have had good and bad, but I will say that it has been great the last 3 times that I was there, even when it was crazy busy.  Best time that I had at Duckworth's was when I went for a few late night drinks on a Saturday recently with the wife after going out to dinner somewhere else.  It was on the way home, so easy enough to pop in.  There were a few people watching some late night college football games, but for the most part it was a relaxed atmosphere and the service was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "GqJRlbga27rUpolN-SP9Ig"
  },
  "C6vdme0f3OOOePJtq3I1Ig": {
    "date": "3/15/2015",
    "text": "Fantastic service!  Excellent food. Never had anything bad here. Over 70+ beers on tap. How can you go wrong!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a1jRkUfUWmoo6LIV7jprgg"
  },
  "pJn_iYsGMdBZZanEz2iQbQ": {
    "date": "1/29/2013",
    "text": "When I lived in Ballantyne, I was 10 min away from this place. Now I'm in uptown, and I wish it still were 10 min away from me. There are so many awesome things to note about this place. Firstly, this is such a great place for sports fans. They have 40-odd TVs... Yep, you read that right, 40... Each one showing a different game so a great settlement for parties that have a variety of interests or when there are multiple games going on simultaneously. The service is pretty decent. One particular thing worth mentioning was how much the hostess was concerned about my meal when i ordered my steak medium-rare and it came out well done. She looked at it and said \"oh yeah, that's definitely not medium-rare\" and quickly had it taken away and brought another steak. Kudos! Also, I love their beer selection although I really dig their Strawberi Fruili (pardon me if I misspelled that) which is a strawberry beer. I always get their beer sampler because I think it's a very good value for money. As for food, here's my favorite part. They have the best home style chips I've ever tasted in the United States. I always get the sirloin steak because they just make it so perfect every time. They also have nice sides, the over roasted veggies and sweet potato fries being my favorite. My boyfriend is crazy about their Jalapeno Chicken. And the Seasoning Salt they have at the tables is a fantastic addition to everything, from the fries and roasted veggies, to steaks. Mmmm, writing about this is making me drool already. I think I'm off to get me some sirloin steak!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q83R2UssCoErEJX36wrlvg"
  },
  "ecvDQpzb-5Wu87SSAfYvHw": {
    "date": "8/18/2015",
    "text": "Great place to watch a game, the loaded nachos are some of the best I had, I like the fajita chicken. Kid friendly and a nice menu. The food is bar kinda food so the my rating is comparing it to other bar type places. The beer selection is large with a ton of local and regional brews. Staff is friendly and the manager has always came by to say hi and check on my table and fix anything that needed to be fixed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uHw52ESiwTHeLUoPk3zKfA"
  },
  "iPNTAExPs130IbpMc85GdQ": {
    "date": "7/1/2012",
    "text": "LOVE the beer selection!!! If you're looking for a great pub to have a few drinks and watch some sports, this is it!!! Amazing tap and bottle selection from micro breweries all over the country and world!!! I'm a complete beer snob, and was really impressed... Found some options that i've had trouble tracking down just about anywhere else. Quite impressed...  That being said, the service and food were flat out awful. Our server was completely lost the entire time. Brought us the wrong drinks, never brought us the waters we requested, came out with the wrong food and took forever to replace it, didn't know the menu and seemed completely lost... I would have imagined that a college kid on their first night would be more attentive and knowledgeable... To be fair, they were busy when we were there, but still, i would expect a lot more.  Food was terrible... Fried pickles looked like they had taken one of those economy jars of sliced pickle chips, dipped them in batter and fried them (NOT fried pickle spears). They were terrible and tasted like they had been made in a walmart parking lot... Wing appetizers i ordered were decent, but only because there was so much sauce it covered up the burnt taste of the overcooked wings... Wings were tough and tasteless (with the exception of the sauce, which was actually quite good). We also ordered nachos which  were pretty lousy, and a salad that came out with the piece of meat completely cold and uncooked in the middle.   All in all, unless you're planning on saddling up to the bar for a few drinks, i'd stay away... There's a mellow mushroom (i know, it's a chain, but much safer in this case) right across the street that has a similar drink menu, and significantly better food and service!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "SfXjjbhDO91e4s8zuKRo0Q"
  },
  "Fj0cDmO9Mvr8T1N23SWCmA": {
    "date": "5/9/2015",
    "text": "Stopped in for an early dinner Saturday. Me, the wife, and daughter. The food was good. Wings came out hot, and I asked for extra crispy/well done and they were. Wife's buffalo wrap was a bit too spicy for her, but they switched it right away no issues. The thing that really stood out was the manager. I think his name was Matt. He stopped by and apologized and went out of his way to make sure we were happy. His attitude was beyond what you would expect and was really nice. He alone would is the reason we will go back. I would give 5 stars but the price for some wings, beer, and sandwiches seems a bit high.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I5g_p58CZPqerzhhNxpmUw"
  },
  "2kWzpB33fBTgo-r_kiFvVw": {
    "date": "3/15/2015",
    "text": "Despite a ton of unbussed, dirty tables we were given a decent sized wait. When we pointed to a empty table we finally told the truth that they were understaffed. We then say at the bar for 10 and no one came over to ask if we wanted something. Love their other locations, likely poor management at this one.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_iutYuJzeY3xz2CWkUcXA"
  },
  "vocevPqPN7C5JnWnpon57w": {
    "date": "12/30/2012",
    "text": "Pretty standard sports bar. Good layout, with plenty of HDTV seats. Beer selection is expansive. Feature beer night I went was watermelon. I tried it... Yech! Why even put it on the menu?  I only ordered the french fries, which were good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-IP9-MSTsJpI48JnkNqIA"
  },
  "UIeIU8wKX2qjhNi9fg2IqQ": {
    "date": "7/15/2015",
    "text": "I eat here often and the food is always great.  But I expect that anywhere.  The service is usually good.....but, tonight we had a bit of a delay and a misstep.  When the mgr realized we'd been sitting a few minutes he came right over....took out order and had the waitress bring out an appetizer we hadn't even ordered.  It isn't about something what goes wrong, it's about how you fix it.  Nice job.  Really like this place and the food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sF1FGDNzP1ozjz2lG4c2kg"
  },
  "I3ZVBti2wRMs-E4frwrZAQ": {
    "date": "10/7/2015",
    "text": "Walked in after church on a Sunday here for some good brunch. Walked out feeling full & happy with the burger and fries I had. Great place!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vdecnpSEbOI3xYL444pU3w"
  },
  "sDl40PCWVkzs61PZJ3gLxw": {
    "date": "1/16/2016",
    "text": "Duckworth's is the best bar in Ballantyne. Lots of TV, lots of beer, lots of menu items...lots of everything you would want in a sports bar. I highly recommend to anyone looking for an affordable, fun place to have dinner!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7u2md67PagrSmrDgmgQL4w"
  },
  "msUFt7a6rvXvHl6VKzH5_g": {
    "date": "1/1/2016",
    "text": "I love this place for the RIBS!!! They have the absolute best ribs ever and you can get a full rack (feeds 2) for $20 with sides! The wings are good also, but the ribs are top notch!! The only side I like is the fries (regular or sweet potato). The rest of the sides are mediocre at best. Overall, a great place with a nice atmosphere...especially if you like to watch sports!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-YVD2pxble_O99uOXu-TkQ"
  },
  "pg9sQXBDBoTyX0tH7K1IqQ": {
    "date": "3/18/2016",
    "text": "Cheesesteaks were 1 of the closest things I could find in the Charlotte area. Nothing beats an authentic Philly & this 1 didn't disappoint. (No amorosa rolls), but cmon, it isn't Philly. If you're looking for a fix, I would definitely recommend. Not to mention over 70 beers on tap. Waitresses was friendly & recommended some good stouts.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tSu-fnlKQM4fuIMYy9Gbjg"
  },
  "hVuzgwDrh753YeDaIOQQcg": {
    "date": "3/12/2015",
    "text": "Our first experience at Duckworth's was terrible. It was a  Wednesday night and the hostess quoted my significant other and I a 45 minute wait. That was okay with us so we headed to the bar to grab a drink while we waited for a table. As we were standing in the bar we noticed several tables were empty but needed to be bussed. I watched at lease a dozen servers walk by these tables without clearing one thing from them. After waiting almost an hour for a table and noticing new customers walking into the restaurant being seated immediately we went to the hostess stand to check on our table. Turns out they had crossed our name off the list like we had already been seated.   After the hostess cleaned one of the tables we were finally seated. For an appetizer we ordered the mozzarella sticks. They were pretty good and came out relatively quickly. Our entrees took at least 45 minutes to come out. Please note by this time it was close to 8:30pm and the restaurant was beginning to clear out. Both of our food came out cold. I ordered the 1/2 rack of ribs and the baked beans. I did enjoy my ribs (besides the fact they were cold) but the beans were terrible. My significant other ordered the buffalo chicken wrap with fries which were nothing special. Mean I to add that my significant other had to ask for ranch dressing 3 different times before actually receiving it! 1) when she placed her order 2) to the server who delivered the food 3) the another sever when it still had not come.   Overall, our food was cold, the wait and ticket times were ridiculous, and the staff was inattentive. If it wasn't for their over the top beer selection we would not have a reason to come back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DOUXMjpuA-QGzPv4VQ9G6Q"
  },
  "mBXeeQV4M7qFdavKLB_fUQ": {
    "date": "9/1/2013",
    "text": "We went on Saturday and they tried to sit us in the very back corner, beside the bathrooms, tucked in with 3 or 4 tables with kids. It looked like Chuck E Cheeses. No.   Then they tried to make us sit at a high top in the bar.  There were empty tables and booths all over, but the only available seats were in the kid's section, or at a high top?  I don't think so. We went to the new Indian place in the shopping center, and were very happy.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-2uhgBrHoFvUjfLaf3OFQ"
  },
  "uJ5QkbdLtkZoPiGWKhGC6w": {
    "date": "5/28/2017",
    "text": "This place has a great vibe and an amazing beer and drink selection. I have been to this location and a few others in the last few years and it never disappoints. They make a killer Philly cheesesteak! Also, get the wings! I prefer boneless. Get the mommoo and the sweet n bold gold flavors!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Yt5hRC6IVclRyCMjdcEI8g"
  },
  "-AOFvRlqqE7iPnCVW1rbOw": {
    "date": "1/22/2017",
    "text": "Amazing, one of my top favorite places in Charlotte.  Lemon Pepper Wings, omg!   Garlic fries....etc.....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3KPccnn8B-eGZSTnUGzZng"
  },
  "vWF8BI8r1oT8EUQer-BNEQ": {
    "date": "7/24/2013",
    "text": "I came here thinking I'd give it a show as someone had told me it was pretty good. I should have known better considering I'm not overly fond of chain restaurants. There are some good ones out there and I thought maybe this could be a good one to catch the football games at on occasion come August. Yeah not even close.  They have a multitude of televisions but they are all small. Not a single large screen tv in the place and that was disappointing. The wait staff was not on their A game and it took us forever to get our order in and to get our check at the end of the meal.   I ordered the chicken pesto sandwich with sweet potato fries. The pesto tasted like it came from one of those packets you get at the grocery store. It was very runny and mediocre. The fries tasted good but they were swimming in butter. I know I asked for them sweet (you get a choice of sweet or salty), but I wasn't expecting there to be butter pooling on my plate from them... gross!!!  My mom got a bacon cheeseburger and while the bacon was plentiful (as in way too much.. I know what am I saying right) it was well under cooked. She had to pick 90% of it off and by the time she was done there was a pile of bacon on her plate sky high.  Their beer selection seems to be a good one and although I didn't have any they had a lot of local choices as well as the usual. So I give them an extra star purely for the beer list. Overall I will not be back here!!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "HhYUDP1vR7CSRi2cvfai0Q"
  },
  "IGzN35buUk_zwLWc83zSoA": {
    "date": "10/30/2013",
    "text": "Came in on a Monday night with a friend to watch some football. The baseball games were on and most of the televisions in the bar area were turned to that - which was fine. It was loud and we could not ignore when the Red Sox would make some sort of play.   I had wine, he had beer, and we split the fried pickles.   Good selections on beer and the wine was pretty good with a generous pour. The fried pickles came fresh from the fryer and the portion size was appropriate.   Our server was pretty good and checked on us quite often.   If I'm in the Ballantyne area, this is a nice, casual spot to have a drink and watch a sporting event.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "id9wv84sKtznP2voeQFFag"
  },
  "9u7ezb7b8JDi7qQHNpGcrg": {
    "date": "5/20/2016",
    "text": "Good value, Good food.  Clean.  Wait Staff courteous and helpful. We ordered cheese steaks and they were topnotch. Beer selections are multitudinous. Definitely a great place for lunch or dinner. Thoroughly enjoyed our visit and will return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RRiq-0XP0bnVPeaikbpiaw"
  },
  "zet73vMshMkxksQAPAPZMQ": {
    "date": "5/14/2017",
    "text": "Great food and great service! Far exceeded my expectations and love that they have outdoor seating! The onion rings were the best!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QkOaTIwqLu1R-T9Kd61FZw"
  },
  "KDLCsXnL4sganlKszML_DA": {
    "date": "11/21/2015",
    "text": "Food is really good! But it takes forever to get the food :( ...   It was really crowded, and we waited 40 min for a table... Auch.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RhhOcV7ShW1EiPldEW_VkA"
  },
  "YSj1dseUl5ig0rLH-BlasQ": {
    "date": "5/12/2014",
    "text": "GREAT place to watch games!!! SO MANY TVS!!   The food is good as well, they are very accommodating and have a great selection of beers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_KbeQpVBtZQbxOoUg_Eveg"
  },
  "oL7JT3kOfp2h-RnRZu4FOw": {
    "date": "4/19/2017",
    "text": "I would rename this place safe haven after being harassed by other customers at the Blue Olive lounge my friend and I,  out on a girls night we're looking for shelter from what seem to be a drunken storm. We were so well taken care of at Duckworth's and their pizza was one of the best I have ever eaten I will be going back and I will be bringing more of my friends",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R9nHrVcQxP3hfQI5GcEO4Q"
  },
  "GWw9QWl298zYtCrKdAZ06g": {
    "date": "4/18/2017",
    "text": "Usually pretty busy, but the service is always great. Good selection on tap. Definitely one of my favorite late night spots, that never disappoints.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C0dmNmyZJ_Au2M4i9ImKAg"
  },
  "ZrrrKu1szv5njAh1ULVsjw": {
    "date": "4/14/2016",
    "text": "Had to find an employee in the bar to be seated because no one was at the front. I ordered the boneless wings with the sweet and bold sauce. The sauce must have had a lot of vinegar in it because the fumes were making me cough and my eyes water. I ate one and it instantly gave me serious heart burn. I sent them back and got a Teriyaki sauce. SAME THING. My boyfriend ordered the Philly and the meat looked like it was fake. He wasn't pleased with it at all. They have a good beer selection but unfortunately the beers we ordered were flat. Must say out of all of this our server was awesome. Will not be coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ANwqJQB267lp2ROC_w_PA"
  },
  "Eu_6pXnuQIt8K6c5I9APGA": {
    "date": "1/14/2017",
    "text": "Worst dining experience ever. The server never put our order in and we have waited over an hour for our food. When it finally arrived it was wrong and the staff seemed upset with us for being disappointed. Never coming back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_4coanA8499ZrVD5rdk2VA"
  },
  "ufUn9J-2b6eBOvaPfthV7w": {
    "date": "8/15/2015",
    "text": "Awesome experience! Our waiter (John) was extremely friendly and attentive, but not over bearing. He was knowledgeable and suggested some delicious beers/blended beers. The manager (Dan) came by and was also extremely friendly and gave us some complementary samples of limited time beers. The food was amazing! We had fried pickles and the Buffalo chicken pizza and both were to die for. The atmosphere was awesome, free wifi, not much more you could ask for...oh except for maybe a selection of 80 beers on tap! This was my first time at Duckworths but certainly will not be my last.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "4yM9nKlfD2U1ItdX0cp80A"
  },
  "ajv-SG1Hkg4iTHLkT7zSSQ": {
    "date": "1/23/2015",
    "text": "For the good..  The staff is very nice and the beer list is excellent.  Our server was working her first shift but she was supported by additional team members so it was not noticeable.   For the bad...  Of the 3 items we had 2 were of poor quality.    The first issue is with the mozzarella sticks.  The kitchen seems to think dried basil/oregano is an appropriate garnish.  It's not.  Dried spices should not be used as a garnish.  Fresh basil/oregano would have been great.  Beyond this, you don't need 2 tablespoons of garnish for such a small dish.  The second issue came with our chicken wings.  It was obvious that these were overcooked and sat under a heat lamp.  My thinking is the wings needed to wait for the veggie burger to be ready and paid the price.  FWIW, the veggie burger was great.    All in all, this is a very promising place with a great front staff.  I hope it was simply the kitchen having an off night.  We will be going back and I hope to upgrade the review here as there is a lot of potential for this to be a good spot in my book.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1uCAKm2suBy-uON1CwdLKg"
  },
  "LXmZIM_M4yNz9IzW0VbrjQ": {
    "date": "6/23/2019",
    "text": "Been a Duckworths patron for many years but unfortunately the wings have gone down hill. I was told by a manager that they have changed wing suppliers. They are now short fatty wings that distorts the flavor. I am getting soft on one my favorite and highly recommended places to eat. Please go back to the old supplier.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xK8j1CK0pEs9KOqz2QAQ0g"
  },
  "JI4MRMM8WxjLjXuiWKRmlw": {
    "date": "6/19/2019",
    "text": "My coworker and I were in Charlotte for training and afterwards went here for lunch. The food was delicious, and the service was great!  I had the Cobb salad and my friend had the buffalo chicken wrap. Kaitlin was our server and she was very friendly. I highly recommend Duckworth's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5Z0zTWHQRN5hwJYFxkTj6A"
  },
  "kA0J3A0FO6zwinZCXdnDHg": {
    "date": "11/7/2018",
    "text": "We love this place. The atmosphere, the service, and most importantly the food. The philly is ALWAYS money. I had the tater skins for the app, really good.   We enjoyed having Katlyn as our server. She was very vibrant and attentive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VC_FvqPGy_qQA-2iXbiZQw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VC_FvqPGy_qQA-2iXbiZQw/o.jpg"
      },
      {
        "img_id": "W4q3snjpClQ1AsxK7LVZdA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/W4q3snjpClQ1AsxK7LVZdA/o.jpg"
      }
    ],
    "user_id": "UYhqhAfk-s7PZU5rBJ59vA"
  },
  "L10MSf3JmiRRBJ9w6OKHvA": {
    "date": "11/4/2017",
    "text": "This is our second time to Duckworths and really I'd give this visit 3.5 stars because the service was just sooooo slow (2/5).  But the small supreme pizza was very good.  Again though the wait, and keep in mind that small 10 inch pizza was all we ordered but it took a good 35-40 minutes, yes,  no joke, can I getta WTF??  But the waitress was fine albeit she was not as present as we'd would have expected with drinks either.  Heck she may have forgot about us .   Seriously,  at one point we decided to leave, which I never generally consider.  I didn't take a pic of the pizza because at that point I honestly forgot so just an interior shot.  The pizza was good though, but probably not worth the wait.  Also, it really gets loud in the restaurant and the overall layout of the tables seems random and odd (2/5).  But we would still go back for the pizza and give them another shot with the service.",
    "rating": 3,
    "rated": {
      "funny": 8,
      "useful": 17,
      "cool": 12
    },
    "photos": [
      {
        "img_id": "meRJSSveL_dbvLZwIyQh-Q",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Interior",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/meRJSSveL_dbvLZwIyQh-Q/o.jpg"
      }
    ],
    "user_id": "P14bqC_Ynbp8O3tLePRKSw"
  },
  "rWPllX_juDtTyNnoaxDO3g": {
    "date": "7/31/2019",
    "text": "Had a great experience.  Enjoyed the food and had a great time with friends.  The manager came by and asked how we were enjoying our meal.  Great atmosphere, will defiantly be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8OVP10SPm3nR0aGJHNAE7g"
  },
  "5PigZaL1NCwCnRWFv_6yUQ": {
    "date": "3/3/2019",
    "text": "Long time customer at DGT.  Food and beer are still A-1 and I will continue to visit.  Bartending has steadily declined over last few months.  Used to be that you never had to flag someone for a refill.  Nowadays not so much.  So many times the bartenders are just handling the housekeeping and ignoring the empty glasses.  Eye contact?  Some are very good, some are very bad.  I should say that I rarely had a bad server when seating at a table, but on occasion inexperience does show.  Managers do periodically stop by and ask how everything was, but this appears to be perfunctory.  Instead of asking how everything was, how about 'how can we do better'?  I am not sure if you will get any better feedback, because most of us don't want to complain face-to-face.  Rather we hide behind the anonymity of these reviews.  Restrooms also tend to get ignored most nights.  Some improvement here - please?",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDJRIkF5cXcYV5Khyx2NaA"
  },
  "Ss5gr7I1rTiqo94y6aokXQ": {
    "date": "12/26/2018",
    "text": "Up until today, Kerr's Wings in Clearwater, Florida were my favorite for nearly 20 years. No more. The king is dead. Long live the king!  Duckworth's wings (grilled after deep frying) with chunky Mommoo Sauce  are the best wings I've ever had!  When we moved to the area I asked a neighbor where we could get some great wings. She recommended Duckworths, stressing the Mommoo Sauce HAD to be chunky. Man, she was spot on!  Great service! Clean! A zillion wide-screen TV'S! And who could complain about IPads left at your table to sort through their 70+ beer selections?  Arrive hungry. Be prepared to be impressed!  Highly recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SdYu8To3oUFo1Cc2KcMmIg"
  },
  "UVtbbbvYtSnhiijhWgZJnA": {
    "date": "7/27/2019",
    "text": "Really great service here! This was our first visit and our server, mike, was very friendly and personable! He asked about our beer choices and how we liked them, and also made sure we had everything we needed throughout our time here. Lots of good choices of beer on tap! Will definitely be visiting this location in the future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "72KZ2Iyh8_P1Safv5Hw6Wg"
  },
  "yplDwx7Rkq5gs67-l53T4g": {
    "date": "12/9/2018",
    "text": "In the hour we've been sitting here, I've watched a bartender stick his finger in a customer's shot before a waiter took it to the table; bartender take half shots of whatever drink he made for customers, and casually stick his fingers under the rim of someone's glass to pull something out before serving... Also just a heads up the wings dont come with celery unless you ask for it.  They serve celery with wings \"by request\" only to help keep the cost of the wings down ..K.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwFdDZowg2wiV_6H9QVtmw"
  },
  "4dEgJFGG4jOlTerLRWy5hQ": {
    "date": "9/22/2018",
    "text": "Came here on a date. Checked in right away, they took our name and number to text us when a table opened up. They said 25 mins. 40 minutes later, my husband went to ask how much longer it would be--we had a babysitter and didn't have a lot of time. The hostess looked at the list of names and found ours--they had skipped it. She didn't apologize, just said \"We can seat you right now.\" And took us to a table. She said \"someone will be with you shortly\" and took off. Looking around, there were a ton of open tables, so there was no reason why we were left waiting.   We ordered within 5 minutes. Got our appetizer promptly--fried pickles, they were good. Our waitress was nice. Then we waited 35 minutes for a burger and a flatbread. The burger was very small and the flatbread had very little toppings on it.   Super disappointed in this place as we had been before and had a great experience. It took way took long to be seated because we were forgotten, and then took forever to get our disappointing food.   Won't be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "_HusgWDHwpuSQ7fawGSj7w"
  },
  "UsulDU-7RuoS01Wqfxnhyw": {
    "date": "4/8/2018",
    "text": "This is fantastic location with ample menu selection offerings for both food and beverages. Basically, if you leave here hungry, it's your own fault.    The buffalo chicken wrap is excellent, particularly when paired with the sweet potato fries. Try the cinnamon sweet potato fries, they're delectable.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "zcw0d_xl6xMmOAa6-S8hBA"
  },
  "DmnA9XMNAu5pRuUXJKQGug": {
    "date": "10/13/2017",
    "text": "You had me at half off wine bottles on Friday!    Duckworth's never disappoints and our service was amazing.  Emma is an excellent server.  We were in a rush and she made sure we had everything we needed quickly.  I highly recommend the loaded buffalo chicken nachos.  It is more than enough for two people and the portion is huge.  These are the best nachos in charlotte.  How many times have you gotten halfway through nachos and you run out of toppings???  At Duckworth's the topping/chip portion is perfection.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "pCznDkAs0dBLLa015ryMng",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. 1/2 off wine bottles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pCznDkAs0dBLLa015ryMng/o.jpg"
      },
      {
        "img_id": "_qhilaMWrai9HVoXEF3Lhw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Loaded buffalo chicken nachos",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_qhilaMWrai9HVoXEF3Lhw/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "lOV_d24kmHFmfnS4T0JOig": {
    "date": "8/21/2018",
    "text": "There seems to be a Sports Bar on every corner now and I typically don't patronize them, simply  because I cannot consume alcohol.  I don't think of them as first choices for lunch options, but today I needed to take my mom to lunch and didn't have a lot of time to look for restaurants. We were right next to Duckworth's Grill & Taphouse, so we stuck our heads in the door and landed in a booth.  Giant menu with a lot of options.  We were initially going to splurge on some chicken wings, but both opted for a summer salad.  The salad came with cranberries and strawberries and mandarins and a lot of good things, including blue cheese crumbles. When the food came out, my mother asked if they had any crackers.  The answer was no. So, I asked if they had any bread. The answer was that they had garlic bread but that it would cost us more money.   The lady who brought our food was abrupt and not customer centric.  When our server came, I mentioned that my salad was supposed to have blue cheese crumbles, but didn't.  She apologized, but I said it was no big deal.  I asked her for bread without garlic and she was happy to get us some.   Before we knew it, the area manager, Kevin, was at our table apologizing.  He ended up talking with us for a long period of time. He went to get blue cheese crumbles for me and rushed our bread along.  He was extremely pleasant and when we finished, my Mom resolved that she would need to return to Duckworths. It just goes to prove, once again, that a little customer service goes a long way.  (The lady who delivered our food needs some additional training in  customer service.)   Still not a Sports Bar fan, but as it goes, this was a pretty good one!   And I will always ask for Kevin, if and when I am back in there!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "d1fqP16hUz81_PIbn7bPBg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d1fqP16hUz81_PIbn7bPBg/o.jpg"
      },
      {
        "img_id": "5d5oLtD3z80kg3iDevojtw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/5d5oLtD3z80kg3iDevojtw/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "spsqbfr-Jyi3EG1zI00UzQ": {
    "date": "7/14/2019",
    "text": "We've eaten here a couple of times and love it. Staff is very friendly, place is clean, food is delicious. Everything was cooked pretty quickly and made just how we wanted. We will definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tcU2rHp6cpaGrOQ3P71aeg"
  },
  "9WLuJK-A4px80tcrne6lbA": {
    "date": "7/14/2019",
    "text": "This place has gone downhill. Very disappointed.  From the start there was bad service.  The older(with glasses) hostess greeted us without a smile.  Then right after she asked us to follow her to the table she took a phone call and we waited several minutes.  Once seated, the really bad service begun.  Our waitress (overly made up with teal eyeliner and a sour face) was unfriendly, never smiled, seemed annoyed to help us, and got a bit snarky when asking questions about the flights of beer.  We specifically came in for flights and to try the \"impossible burger\" which they we put of.  We chose our flights, had a couple of other apps and the service just seemed to deteriorate from there.  All the TV's went down due to weather (satellite) and as a sports bar they should have contingency's I was extremely disappointed in the overall service.  Will not come back or recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WJV1acmo_diifKQZYYUCdA"
  },
  "6TjYKHatY-YYb_ZxtsSLHw": {
    "date": "2/7/2018",
    "text": "Had a better experience here than last time. Came here last minute with the hubs for a late dinner. We got sat right away at a booth. Our server was friendly and thoughtful. We started off with the hot buffalo wings. They were good and hot but a little skimpy on the sauce. We asked for extra sauce and dumped it on the wings and they were much better. I got the philly cheesesteak supreme sandwich and tater tots. I was pretty pleased with my meal. The tots were crispy and the sandwich was good and cheesy. My husband got a large pizza with half pepperoni and half canadian bacon. Overall, it was pretty good but my husband likes half and half toppings and he didn't like that they charged for each topping even though it was half and half. Besides that we had a good experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "QCAnA0WsyYqoKakcddLFBg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Philly supreme with tots",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QCAnA0WsyYqoKakcddLFBg/o.jpg"
      },
      {
        "img_id": "mbUPcE2Qvk_FZwdYJb3mig",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Half pep half Canadian bacon",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mbUPcE2Qvk_FZwdYJb3mig/o.jpg"
      },
      {
        "img_id": "bbZGHCT2WwQOcZKLTMx-lw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. hot wings-hardly any sauce",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bbZGHCT2WwQOcZKLTMx-lw/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "YeK4QF7DZh10VL3frgO_HQ": {
    "date": "2/22/2019",
    "text": "The food here is gross. I ordered a burger just to be safe and it was two very thin smushed patties. The onion rings were hot and soggy. Would not come back when there are plenty of other places around the area to get a burger.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6xgOCZsCtAVJXVbTkaExQ"
  },
  "XC4MwEHY6zhMmHMP_t2eXA": {
    "date": "7/13/2018",
    "text": "The beer selection here is huge but i still find myself looking for a beer i want to drink. They use ipads for beer menus, which dont always work. The food menu is also huge, which makes me wonder what they are really good at. Ive had a few meals here and none of them have been bad, but nothing really drives me back here to eat. The service is always hit and miss. Ive waited for 10 minutes at the door just to be greeted, had to ask multiple times for a check or another beer, etc. Other times, the service has been very attentive and all I could ask for. Consistency helps. Ill be back because they are close by, have NFL games, and I like bar food and beers, but my expectations will always be tempered.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "TAsRhelKZgzW7RdlFQ0hHA"
  },
  "j2DpP15jsRJxvam8qOCctg": {
    "date": "4/12/2019",
    "text": "I was disappointed after i posted a good review 2 weeks ago about how good and nice Crystal was.  Went to this restaurant 3 days ago, i was on the table for more than 15 minutes no one came and offer anything. Waitress kept passing through didn't even look at me like I didn't exist. Some customers came after me and they were being served with drinks and took their orders. So I decided to left the restaurant. The lady who helped me to get the table ask what happen and i told her I'm leaving. She was shocked that nobody help me at all.  I love this place because it's convenient for me since i work around the area but i am not going back here.   Gemma",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lf9nNJSgyX_GavPZV7vGRA"
  },
  "r8d0iK1IAwV5dqljooI9WQ": {
    "date": "3/19/2019",
    "text": "Took forever to get waited on. I got a drink with about 3 ice cubes. Ordered water with lemon and got water with 3 pieces of ice and no lemon. Amazing how servers walk by and don't even acknowledge you. Food is always good but service needs a lot of work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "bJE3Rnt297OkzQlqbuNwbg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Guess they are running low on ice? I asked for ice water with lemon. I get water with 3 pieces of ice and no lemon",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bJE3Rnt297OkzQlqbuNwbg/o.jpg"
      }
    ],
    "user_id": "87sMvpl3fBamDJo2wL-SuA"
  },
  "0ONeAqv8iZ4ORiUODuIFFA": {
    "date": "2/6/2016",
    "text": "Asked two different members of the wait staff to turn CC on one of the TV's and was told it cannot be done. So I asked what they would do in the event they had a deaf customer, and the response was \"well, you'd be shit out of luck\". I'd rate zero stars, but it's not an option.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dFw6bHUpZPMnOthD3xDnng"
  },
  "PE047ROk8naoHZsJNe6VhQ": {
    "date": "10/11/2014",
    "text": "Pretty standard Taphouse. I stopped in with my family for a quick bite. I got the chix philly, the rest of my party indulged in a slab of ribs, steak philly and wings. Again pretty standard food. Really not much more to add... The place won't \"wow\" you, but it's a solid American dining experience.   The 4th star is because they carry the hubs favorite beer Nitro.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NkEdqzhLe3YnoISudF4ROw"
  },
  "ISLdm4lVxmFushhlGW6jUA": {
    "date": "9/5/2017",
    "text": "If you want good food.. look elsewhere. I ordered a burger and i didn't even finish it. Pizza tasted like it was a frozen pizza. And strawberry dessert cake looked better on the menu. But!!! If you want to go have good beer then it's worth the Trip! lots of variety and good options for beer only.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "neRUCP2HpAfqSmF3cOQ1mg"
  },
  "VGB397FoOO9saKJjNo4YUg": {
    "date": "3/5/2016",
    "text": "I do enjoy Duckworth's in Ballantyne. It's much bigger than the Montford one, parking is easier, get's the same kind of crowds too. My only thing in general is I'm not always a fan of their selections of beer. I love the wings! Always made exactly how I like them. Service at the bar is great! Love that they are open until 2a.m. (especially when having those late nite cravings). The draft specials are great- Mon. & Wed. $3.50 so this is the time to go. Weather changing it up to try new beers or just keepin it to the same fave & have more than one.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "odWhNodAZpJLzPdqCXdgdg"
  },
  "3b7BR4KPHk7cSgh39BKN8Q": {
    "date": "8/10/2014",
    "text": "Our 4-year old son LOVES their pizza!!! (Loves it)! We like that it's truly family friendly and a dependable, decent place in the neighborhood. Don't forget it's a big gathering place for football days and if you bring the kiddos, expect them to hear some profanities - lots of screamers the last time we watched another table get all bent out of shape about it - football = screaming. Just know that and you're all good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GtMg9Ooc2ykPD0OV5P3pzw"
  },
  "UgussMgnWe3QHXLnE0ZiIQ": {
    "date": "6/11/2017",
    "text": "Always good and always quick and easy! The bartender Cam is the man and always makes sure everything is fresh and on time with no crazy waits! Good day or night!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qlwsjDkNewG6S9sRg1wYhQ"
  },
  "KlN3c_9zGPfg-mGcISXjXw": {
    "date": "8/26/2017",
    "text": "Great restaurant! The staff was very friendly and the service was excellent...Our waitress was attentive and took the time to interact with my grandson. The food was great!  I have no complaints and will return real soon!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MnlJM26Ts9x5MHdhQ32k2w"
  },
  "61DY0dXkoZRkfGyZC0QG0g": {
    "date": "8/20/2017",
    "text": "Lots of beer available, yes, but the selection appears to be all the crap beers, but thats just an opinion.  14oz pour at above what everyone else in the area charges for a 16oz is horrible, they have also selected a few that are 11.5 oz pours (and I'm not referring to the high gravity stuff, its just random) So the little 14oz glass comes out and its filled 1.5\" short, basically making it something in the 11/12 oz pour area.  Cant imagine them making it to long playing these games when you can go 2 minutes away and get a 20oz pour for at least $1 less.  Food- got the philly, it wasn't bad, the large is $14.00 for a 10\" roll a bit more meat than subway but damn, i could get 3 from Subway, not impressed.  Service- very slow, dont think it was all the waiters fault as it appeared he had 99 tables and the waitress had 1. The manager stopped by the table for a second and said \"I'm glad your getting exceptional service and walked away\" its obvious that his attitude towards service has rubbed off on his employees.   There are way to many GOOD restaurants out there to really play this game, I may go back, probably once hell freezes over.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hamMKxZnNJVRcQkIlyLcvQ"
  },
  "qvXflOAmu2BECRDeanrvIQ": {
    "date": "3/5/2014",
    "text": "We came here with several friends on a business trip.  The fried pickles were ok, the wings were nothing special,  and my friend hated her bbq pork sandwich and said it was terrible.  I had the Island Fiesta Tilapia which was eh, and my other friend had the Baja Fish tacos.  I'm not sure why I kept ordering fish in NC thinking it would be good.  The fruity girly drinks were terrible.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gF9BKX9fuTPQL-EFvSok2Q"
  },
  "qmsFshvfY_7vVNtouKWuQQ": {
    "date": "3/31/2017",
    "text": "Hard to beat their tap list. Nachos were off the chain. Service was truly outstanding. Server was at the table constantly checking in, the manager came by as well as another manager. A+ experience (and this was just for lunch). Will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ia4VB7HPOvnmUUR3MS11Zw"
  },
  "dfsaCch5be1j-TZ-2HsjwA": {
    "date": "6/1/2012",
    "text": "I went with a couple of co-workers to grab a bite at lunch today.  The food was ok but our service left a lot to be desired on this visit.  I tried the fish tacos today. They were not the best fish tacos I have have ever eaten, but they were ok. The tacos were served with a side of chips and a pineapple-mango salsa.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "4fejfOIRtNHIwapBz43vAg": {
    "date": "3/27/2014",
    "text": "Used to be much better. Their prices have gone up and the food has become pedestrian. (Trust the reviews that mention the food isn't very good.) They are trying to bank on being a nicer sports bar, but to do that, you have to have good food.  Still, it's not a bad sports bar as sports bars go, just nothing out of the ordinary. The saving grace of Duckworths is the selection on tap; it's excellent.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8vYreSavQ9UHiuDXInJZXw"
  },
  "YnEYLNIgTfCgG5L7Ubmu7g": {
    "date": "3/20/2016",
    "text": "One of our go to places, we eat here once a week, is now off the list. After waiting over 10 minutes for service, even with an empty restaurant, our family of 5 will never return to eat here. Completely unacceptable......",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mj-WmblK2rLMtAqccZ6LkQ"
  },
  "beZJeMnynm2Ohj9vToOswQ": {
    "date": "11/8/2011",
    "text": "Was hoping I'd get one more 1st review, but somebody barely beat me to it.  This place opened lat Tuesday and I've been 3 times already.  First all I just need to say what a great location, layout, and selection of beers.  This place found a niche in that area that needed to be filled, with Mellow Mushroom coming down the street I'm thinking Ballentyne will be a new beer hub for the Charlotte area.  So many great beers, its not really worth even naming them, a wall of taps worthy of being dubbed \"a flying saucer\".  They even have $3 daily pint specials.  The food, well I've only had it once, and it was pretty good.  Much better than what you think of when ordering bar food.  They have your basic sandwhiches, soups, and salads, but many entrees and lunch specials as well.  My chicken sandwich was good, but my sweet potato fries were cold.  All-in-all I think this will be my new spot when in the area, great beer at somewhat reasonable prices.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnFWoQ63F9-ohUQ-C0AeIw"
  },
  "H6wJ1GfDaIt_CrC2jMt65w": {
    "date": "3/5/2016",
    "text": "Very good experience tonight!!!! First off, we got there and was told that we would have a 45 minute wait and it actually ended up being only 10 minutes. Secondly, the food was absolutely delicious... I had the Philly Cheesesteak with garlic fries and for dessert the Cinnamon Sugar Donut Holes... Everything was to die for!!! Sever was nice and kept coming by to check on us... Just a fantastic experience overall!!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDpLQazO-5uaF2Hf2FG-fA"
  },
  "wBdxQntpAmlZ2mewNyMgJQ": {
    "date": "7/6/2016",
    "text": "This place is awesome! Great beer, great food, great service! Monday and Wednesday all drafts are 3.50 and on Wednesdays they have 9.99 pepperoni pizza. Pretty good specials",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wRkapCLdTpYDJ9g1CjsNFg"
  },
  "MgH66SGZPuhwHuV9qeraKg": {
    "date": "5/12/2015",
    "text": "This place is a beer drinker's delight. Especially on Monday and Wednesday, and be sure to joint their Beer Club, playing for each beer as you go in order to maximize rewards. The beer is kept in very good condition, and there is a large variety of beers. Each is serve as befitting its style; pils in a frozen glass, porters not.  Food service can be slow at time but the for a beer and sport bar the quality is A-OK and the variety on the menu never disappoints. The burgers, buffalo-blue cheese chips and garlic fries are awesome (see it is bar food).  The staff are friendly and eager to please and most are either knowledgeable about their beer and food, or are very willing to get you a member of staff  who is knowledgeable about the beer and food.  The sound system is great for watching a game and the place rocks when the Panthers on are and during college sports, but otherwise the music is played a tad too loud for goo conversations.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dIY4ApaKZ0Lfu9Z_420bYA"
  },
  "5HIV5lrlcdcSe5dAm2gcSg": {
    "date": "8/30/2014",
    "text": "Great bar food here. They are very accommodating and you are never rushed. Wifi is also available.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OPAtMg_7QppSX5YGwXgA2w",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Great seating so you can see anyplace.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OPAtMg_7QppSX5YGwXgA2w/o.jpg"
      },
      {
        "img_id": "-qhpUPhnkgthPs9WRIeGGQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. So many TV screens to watch:)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-qhpUPhnkgthPs9WRIeGGQ/o.jpg"
      }
    ],
    "user_id": "bTt0F_ZhihgSoZRAcOH6aA"
  },
  "E3PHtQY4gX3qXZZMZqjtbg": {
    "date": "6/27/2014",
    "text": "Nina was our server (good service btw). My wife and I had the Applewood Bacon cheese burger. She had the sweet potato fries w/ cinnamon and sugar added (she raved about it). I had the regular fries and added malt vinegar which was perfect for me. Kids had chic quesadillas, pizza, Philly chz... loved it. The best was  philly. Ma-in-law had the Philly which she thought was delisious. Great atmosphere and a booth fit all 7 of us with only a 10 minute wait on a Friday night. Love love loved it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ssQ2iKHERN4ljjHiqXj3kQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Duckworths in Charlotte NC",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ssQ2iKHERN4ljjHiqXj3kQ/o.jpg"
      }
    ],
    "user_id": "taQniOahqOfsJBVuK56baA"
  },
  "_eGEsrtHMtLVyd9JD9YvOQ": {
    "date": "11/7/2015",
    "text": "Not impressed!! The service was extremely slow for an order of nachos, 10 wings, and two kid meals. Our wings and kid order were messed up. We ordered two beers at a time and it took 10 minutes for the drinks to meet our table. First impressions go a mile- my family and I will definitely not be back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OsF9NsIzmcmF4hyklzzYQ"
  },
  "KhW8BugHBENC76-HADWGcQ": {
    "date": "6/11/2019",
    "text": "First impressions: great location, friendly staff as we walked in, inviting atmosphere. Sports bar tastefully done.  Our hostess seated us in a booth and we told her it was our first time there. She told us the specials and what Duckworth's is famous for (boneless chicken wings). She was very friendly and outgoing.  Our server comes by and takes our order a bit later. Nothing spectacular about the service he offered us. He did his job but seemed to lack some enthusiasm (the hostess spoiled us haha). Order was taken and it we received our appetizers and orders in a timely manner. No real complaints, as everything was served properly. However, he should have come by and asked if everything was okay since \"they\" knew it was our first time here.  Food was excellent, and there was a wide variety of beers to be had. When asked for suggestions for local breweries on the menu, I was greeted with a blank stare. Woops...  Overall not a bad experience, but this seems to be the kind of restaurant more used to catering to people who don't need much help finding their way around the menu. I would give it 3.5 stars instead of 4 just for those reasons, but certainly deserves better than a 3. We would return again, and try something else on the menu.  PS...try their cheese cake!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_TsKeGaVVmS2lS6bks5ZLw"
  },
  "p-FjvZh8qjZdSb2_MNvm_g": {
    "date": "8/26/2019",
    "text": "Decent beer selection but slow slow service!  Accidentally spilled my beer , they left the sloppy rag on the table and never picked it up. Left all the menus too and it was already a crowded table. Nothing food wise overnight impressive.. but I got some great beer and that's a plus",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WzK9ytflP6YHUNN-5Is3nQ"
  },
  "8D0ijY4XOM_IdkSHB7Lm7A": {
    "date": "6/28/2019",
    "text": "BALLANTYNE, CHARLOTTE, NC 06/19/19 DINNER  +The mega-sized nachos are a must order. +The wings are great. +This grill and taphouse spot is fairly lively and the wait staff seemed pretty attentive.  It's a nice sports bar with lots of junk food offerings.  I definitely need to return to try their award-winning Philly Cheesesteak.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "T9PO1Luniq-NeVQeLDIs1Q",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/T9PO1Luniq-NeVQeLDIs1Q/o.jpg"
      }
    ],
    "user_id": "Y1CXGrkK49Gyz5YlJanoeQ"
  },
  "BZiKAaSGvtHj21dwN6XMHg": {
    "date": "8/9/2019",
    "text": "I went with my team after work one day. The area has been having problems with the power going out, so they weren't able to serve food right when we got there, which was understandable. This location has an incredible beer selection, and an impressive number of sours, which is pretty rare for any bar & grill! I'm not a big beer drinker and I had trouble choosing because of all the options. We ordered some appetizers, the tater tots weren't very good but the chicken fajita nachos made up for it. Again, this could've been due to the power issues. I definitely would go here again if only for the amazing beer selection!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0NpOOfQBNdavWpthtxIXFA"
  },
  "DskPKr9HTXL-9NbUdK69oQ": {
    "date": "7/29/2019",
    "text": "Great environment waitstaff are friendly, great food roomy great temperature first time definitely will be back to drink and eat",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o0Al11FcnkmfWQjyHObAng"
  },
  "vOuSVgNUqTGOqoAfX4wJtQ": {
    "date": "8/12/2019",
    "text": "Absolutely my favorite meal I have had on this vacation. We have been traveling from Florida up to DC and Maryland and back down again.   To start we got the Pitiki Punches. They were pretty good, but I wish I would have just gotten a soda. It was probably more that it was only 1pm and I normally don't drink that early, but it looked good so I tried it. It's definitely got more spice in it than I anticipated.   For our meal we split both a BBQ Chicken & Jalapeno Bacon Flat Bread and a Philly Cheesesteak Supreme with white American. DELICIOUS!!!!! I also got a side of just the garlic bread because in the pictures online it looked good. I was not disappointed. It had a great crunch to the bread, but wasn't so hard that you cut your gums up.  If I lived around here I would definitely be a regular at this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Sqd6-nf0gOnMAkE5tPS-FA"
  },
  "fJL2NElLSTOTjv_FElPdCA": {
    "date": "3/17/2019",
    "text": "My wife and I came in for a Sunday evening dinner.  I came for the Manhattan, which is good/decent given the local, and my wife and I come excitedly for the fried banana pepper rings.  My Manhattan came out timely and good however the banana pepper rings never showed.  Our entrees, very common and could be found anywhere, showed but not banana pepper rings.  We were asked if we still wanted them and we said \"no\".  Our entrees were on the table and we were beyond apps at this point .  The disappointment was no apologies, no managers came to visit the table, nothing other than we weren't charged for the food we didn't receive.  #blessed...I guess",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "81to8rjAxlcpI65EWRtaVQ"
  },
  "eyQkxfxdkz_8H7Qu0Aghkw": {
    "date": "1/29/2019",
    "text": "The only thing bigger than the nachos here is the beer selection - they are both HUGE!!    I have been here multiple times, and visited the one uptown.  Duckworth's does not try and give you a gourmet meal - instead they provide some good bar food to go along with an extensive list of beer so you can enjoy sports and friends.    The Ballantyne location seems to be more consistent with service, but both places offer the same food.  Our last visit I had a Philly Cheesesteak and my wife ordered the special hot chicken sandwich (Nashville hot?) that had a chili rub on it.  My cheesesteak was fine - nothing I will order again, but the chicken sandwich was really good.  Lots of heat and flavor.  The fries and chips were good as well.  A good place to grab lunch, enjoy the game, or stop for happy hour!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "SPZcg_4iu35i-MeMY0e5Mw"
  },
  "FQI_h6Lam5e-wqgUq5XeyA": {
    "date": "1/21/2019",
    "text": "My aunt recommended this place and I'm glad she did. First we were impressed by the craft cocktails and diverse beer list. Drinks were much better than we anticipated....as good as I would expect in a hip, upscale restaurant. We only had apps but the wings, loaded fries and chips and queso were BOMB!!! The staff was attentive and the food came quick. The prices were great and so is the location. Will absolutely visit again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "os3UZrbJ1LuMeExMqA1V4w",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/os3UZrbJ1LuMeExMqA1V4w/o.jpg"
      }
    ],
    "user_id": "qVAtYFQSDbpqvO9L-uwRSA"
  },
  "-wxjBGNm8oPNknvBfrT7Sw": {
    "date": "1/13/2019",
    "text": "Great dinner selections had a chicken Caesar wrap it was very good. Service was great and will be returning",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QL-9A0wDxwVkE8BpN2iguA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Chicken Caesar wrap",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QL-9A0wDxwVkE8BpN2iguA/o.jpg"
      }
    ],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "hLy3pbKMyWZFxVj81TKy0A": {
    "date": "7/8/2019",
    "text": "This is a great place. The environment is nice, its open and spacious, the wait staff is very nice. There are a lot of TV's as well, good for watching sports. They also have good food. There wings are really good among other food. Its cool that you can request either all drums or all legs. I would suggest trying out this place. I'll definitely be going again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cmNNgHn4sIvlh1xgb0ht4A"
  },
  "xfBZPbK9tCxABXJKsoUQ9A": {
    "date": "5/3/2019",
    "text": "Muy buena la atencion  , Jami was a excellent waiters very nice and humble, she is a new on this job but she is doing great , the food was great and tasted",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "oI0sqe89THR01UQQNmwpAg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oI0sqe89THR01UQQNmwpAg/o.jpg"
      }
    ],
    "user_id": "BfqJqMZFi8Ri3EjGu17_gg"
  },
  "xuB5Tu6jHf9_q0gq9jqgVQ": {
    "date": "12/16/2018",
    "text": "We ate here with our friends who highly recommended this place for dinner. Our hostess and waiter were wonderful but somehow this night was different. Our orders were 3 side salads two orders of chicken flatbreads, one chicken sandwich with a baked potato, sweet. potato fries and a cobb salad, plus wine. We waited at least half an hour before 2 side salads came out, then another 10 minutes before the 3rd side salad came out. Finally  almost 10 minutes  later (  almost 45 minutes since we initially ordered ) our main orders came out- they were not hot, barely warm. Lukewarm fries, cold baked potato etc. Finally after talking to the manager a second time , our orders were quickly  replaced and came out  hot as they should be. We were only charged for the wine we ordered . My friends were embarrased as they knew I yelped and wanted to impress me. Perhaps this was an off night for the restaurant. The food we ate was tasty, plated nicely, good portions, priced reasonable,  but came late and came cold. The menu features a  wide variety of choices, from salads, appetizers, burgers, sandwiches, flatbreads , bbq,  a wide variety of sides , great list of Taps and some great sounding desserts. The menu  also features hand cut fries, and award winning wings. There is something for everybody here. We will return but hope for a better dining experience next time.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HTCY5XQT2Tco6W1wA4QtMQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. cobb salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HTCY5XQT2Tco6W1wA4QtMQ/o.jpg"
      },
      {
        "img_id": "HcVbG6t1qmtJ-GpwaWwV1g",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. chicken sandwich with side of baked potato",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/HcVbG6t1qmtJ-GpwaWwV1g/o.jpg"
      },
      {
        "img_id": "v47Ip9cC2_A-NOjWoeH8CA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. chicken flatbread",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/v47Ip9cC2_A-NOjWoeH8CA/o.jpg"
      }
    ],
    "user_id": "dzC95g6MT4ErmcKbiu6oTg"
  },
  "1eHE2DXE-VwXJenkMPYGZA": {
    "date": "7/27/2019",
    "text": "We are visiting the area and decided to have dinner here. Service was friendly and prompt. The beer list is quite extensive. I do love that the list is presented on an iPad and you can click on any beer and get a full description. The meals were all tasty. The side salad was really very good and the ranch dressing was amazing. The pulled pork was excellent. My son (18 yo) got the sweet potato fries prepared sweet and they were awesome. My only complaint is that the water tastes bad but other than that everything was great and I would recommend stopping in for a tasty meal with good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NRCHIjD2tuq4LQ20xf4wBg"
  },
  "5FLXdkfFwQS9-H5gC4b3wA": {
    "date": "7/27/2019",
    "text": "Duckworth's has a fun, laid back atmosphere! Tons of TVs on the walls. My boyfriend and I ordered the fried pickles and fried banana peppers for appetizers. They were both great - would order again. For my meal, I ordered the Cobb salad and my boyfriend ordered an all-meat pizza and buffalo wings. I've had better Cobb salads, so next time I go I'll try something else. My boyfriend would 100% order the pizza again. Overall, 4/5 stars! Will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yl13hQ-TZN95Ckd2-Hflcw"
  },
  "T8izuVJTIwVfabzQKa8T3g": {
    "date": "10/30/2018",
    "text": "3.5 stars, rounded up for excellent service! Went here to grab a late dinner, and was pleased with the large menu selection. I appreciated that they had fresh grilled salmon as an option for the salads. Salmon was cooked right and my meal was good. They also have a large selection of drinks which you can peruse on a fancy iPad bar menu.   Prices were very reasonable, especially for this out-of-Towner who is used to astronomical prices for seafood add-ons. I honestly spent several minutes being like, all these menu items are so reasonably priced! Every employee we interacted with was pleasant, from the hostess to the waitress. Good experience.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "7cjfOlHVy3EIIJ53rvM44Q"
  },
  "qy8nQ-G3JSL3RIuGKdghGw": {
    "date": "10/1/2018",
    "text": "Based on great follow-up service and generosity by Kevin Stevens, the District Manager, I must add back a few stars.  I will most definitely give Duckworth's another shot in the near future, and/or try their sister restaurant, New Concept.  Thanks again, Kevin!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "mCrhj_CG3_pOmDFcfKotRQ"
  },
  "POqusX76u3gMRl8-sDWX4A": {
    "date": "7/30/2019",
    "text": "I can't get enough of this place. Every time I go in I get something different and I still haven't hit the entire menu. And don't get me started on the awesome selection of craft beer. Food and drink here is easily 10/10.   The service is amazing as well. The servers here seem like they love their jobs, they are always smiling and happy to help. To top it off there is always Manager interaction. Last time we were there, Ken came by. Awesome guy, looked super professional and dapper, and was truly interested in our dining experience. I will always go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mS31N-8eLzor0tRqRqcrEA"
  },
  "w-GWgKTnDTde3l-IQjgmzw": {
    "date": "9/2/2018",
    "text": "Having been to the Park Rd location many times before, we decided to come here.  Very disappointing experience.  Ok food, horrible service! We asked the waitress if she could check the soda for our second round of drinks, because the soda in our mixed drink was flat, she responded, \"I cant help that - it comes out that way out of a gun.\" Ok then.  Appetizer came out after our burgers were brought to our table. When she brought our food to our table, I asked her about our appetizer and her response was that she was going to bring it out, the only reason she didn't bring it then was because she only had two hands. She missed the whole idea of an appetizer, I guess.    They weren't busy when we were there as there were plenty of empty table. Restaurant looked disheveled.    The ketchup bottle at our table was empty, so we asked our waitress for ketchup and she said she would bring some out.  We waited for about 15 minutes and she didn't come, so we borrowed a ketchup bottle from empty table next to us, it too was empty.  She finally brought some ketchup when we were almost done with our meal.    We ended up taking our appetizer home with us - untouched. We will not return to this location, we were highly disappointed with our visit there.  The Park Rd location will continue to get all of our business.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "8EVCarfyVLP14hlS4HVk1w"
  },
  "QBIBuzNp90PZ8VfkKzKO_Q": {
    "date": "12/26/2018",
    "text": "A great selection of craft beers.  The Nachos are the go to, but be warned...this is a meal.  Staff has great knowledge of beer selection.  We dont have small kids, but a child friendly atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "88d97Z8nD72GN64XohI2VQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/88d97Z8nD72GN64XohI2VQ/o.jpg"
      }
    ],
    "user_id": "4xJaizfimNJfLT8ud3PQZQ"
  },
  "MDumcxBNMu1UEsHZX12H7A": {
    "date": "12/31/2016",
    "text": "Service was very good.  Food was okay.  Middle of our nachos had chewy chicken () Not certain it was cooked all the way.  Things happen.  I will still go back.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PGBLPOyMjtNmZ-siQQADrg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/PGBLPOyMjtNmZ-siQQADrg/o.jpg"
      },
      {
        "img_id": "miTFSg-wuvA67pS67Tglzg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Chicken on our nachos was chewy.  Not sure it was cooked all the way.  But our service was good",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/miTFSg-wuvA67pS67Tglzg/o.jpg"
      }
    ],
    "user_id": "IXIwLfxpQF7MRO4CB-WNoQ"
  },
  "ct8sCfIdlLT7HeacI_sFcA": {
    "date": "7/23/2016",
    "text": "Not being my first time here, I was expecting great food as always. I was not disappointed. The server, Becky, was phenomenal. Attentive, funny, energetic; couldn't have asked for better. Now a place of great food and service. Will definitely be heading back for more beer and great food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l3oKiGlc_RicjXg76Kllqg"
  },
  "9AOTdtNAs3443YU92AJoWw": {
    "date": "7/8/2016",
    "text": "Is you are wanting a great ribeye steak, you need to try this place!!! We order the ribeye cooked on the flat iron grill with a skewer of shrimp.....best freaken meal ever!! We come most every Friday evening and love it!! The staff are so nice and you can't beat the half price bottle of wine!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "srO4t1_sFTpxfBlDxDRbLA"
  },
  "NXv9EQjJxL_7JVcON-Hbow": {
    "date": "3/9/2015",
    "text": "This restaurant is a great weekend \"where should we eat for dinner?\" go-to spot!  They are convenient to our home, they have a great beer selection... everyone working there seems happy to be there and very eager to please... and the food is delicious (my husband tends to gravitate towards wings wherever he goes, and they have great wings here!... I love their salads and fish and chicken dishes)... Last night we went (as we often do) with my in-laws for dinner... my father in law and husband split a pile of wings, my mother in law had the tilapia, and I had a spring salad with salmon.  We were all well cared for... drinks were kept full, extra napkins delivered, etc... the manager on duty stopped by to make sure we were happy... I would go on, but suffice it to say that the food is good, the service is great, and we love that this location is thriving!! PS - there is a great bar area with lots of TVs all over to keep up with sporting events, etc... we've been here for a few other events as well... one of which was a New Year's eve party several years ago... it was a blast!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sl2R5RFdX1QBQX66T_IGwg"
  },
  "fYl29CvHfzRPYJ08Qoa7eA": {
    "date": "9/24/2015",
    "text": "Had a very bad experience. Group of friends were having good time and we were told at 9 PM that they can't serve any drinks.  This spoilt our evening and wished we should not have gone there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iKKD6cFdAGVH2UaTlAmiiQ"
  },
  "hq0LHmtVjj-hrW0TjzCK2w": {
    "date": "11/20/2017",
    "text": "Duckworths' is never a let down when I come! Great environment with a lot of TVs to watch your favorite sports teams. We ordered the Buffalo Chicken Nachos and they exceeded expectations! We will forsure be back and love this spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2oSagBBT2fCm8zyItIOB-w"
  },
  "_udLbg5jRlCGlZL-YUm0ZA": {
    "date": "2/17/2015",
    "text": "I've been wanting to try this place for a while since it's close to my house. I'd heard about them going to Philly to learn how to make cheesesteaks. I've eaten cheesesteaks in Philly and they have the closest. I had the normal cheesesteak with onions and cheese whiz...aka wiz wit if you know Philly. I'm done eating cheesesteaks unless here.  Our waiter was very attentive and the food came out fast and accurate. The menu has a lot of items on so everyone will find something.   Tons of beer on tap so try something new!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b_xTWcnojNYmdbMO_WNlVA"
  },
  "ee57UQTfV5XENP3rdkpZRQ": {
    "date": "10/2/2014",
    "text": "I've been out to a few different Duckworth's locations now and they seem to do a good job at keeping their atmosphere and service above par without being \"cookie-cutter\" by any means.   I came out to this location after work one day and took advantage of the all drafts $3.50 special. Great place to come out for a few drinks with co-workers, but also looks like a fresh joint for low-key nightlife. I haven't had their food here yet, but assuming it is on the same quality level as the other locations, you won't be disappointed.  Again, the atmosphere and service shine here. TV's all over for good sports coverage on associated game days.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "vCYPAeCFE7W5tdn7fVtsBw"
  },
  "3RmIFD36f88hsqC0xXEBbA": {
    "date": "3/29/2015",
    "text": "Well I was disappointed once again. The food came out wrong as usual and the manager named Charles was not very nice nor accommodating. Being a long time customer of this location I am very sad that they have gone down hill so quickly",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Muu8wYuUOq1v1VtIFPt1Mw"
  },
  "4zu4rj3VnoAHHhXzj9pkqQ": {
    "date": "11/6/2015",
    "text": "Our waitress Ashley was great. Very knowledgable about the beers (which is really important here lol) & she's got a great personality. Food was outstanding for a great price too. We just moved to Charlotte TODAY! This was our first dinner here and we will be back!! Thank you Duckworths!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wm0ZnkOvjadD8bEyXtNVYQ"
  },
  "NfsRZ9I7Fj8WeVk4wXtqYg": {
    "date": "4/2/2016",
    "text": "Manager is a bit of a prude. We were getting drinks and then decided to tab is out and call it a night for us. Safe to say I will not be back!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hHVLys34RxyVh00PyMQuHw"
  },
  "vKKYdT9Xsq5oW_FA5sek9Q": {
    "date": "10/28/2016",
    "text": "My boyfriend and I come almost every week simply because the food is always consistent and good and we always have excellent service. And of course the best beer selection in town !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aSRSZkXdeIish-0h-1Vrkg"
  },
  "S1c5UwZ77p-TznWdozVnjw": {
    "date": "8/4/2014",
    "text": "Great beer selection. More tv's than you can shake a stick at, or anything else you want to shake at them. The service I must admit was pretty bad. Our waitress was slow, didn't really seem interested in serving us, but she was a real doll besides that....... Food was masticated with my chewing parts, so I will tell you what I thought. Bleh. Weak even for bar food. If I was more drunk than I was, it may have been decent. Didn't stop me from eating it, but just plain old bleh. The Philly cheese steak was dryer than Cloris Leachman watching an autopsy, and the boneless chicken wings were were about as tasty as my sock. Onion rings and tater tots were pretty good. Skip the food, pound the beer and you'll be ok.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ipDzjJyxrCQNNA2n434mqQ"
  },
  "RuhzJ7C1YEXErsJ81OAGNw": {
    "date": "1/30/2015",
    "text": "This place is just okay it is never knocked my socks off on anything I've ever gone there. I will be back because of the subpar selection in Ballantyne for good restaurants with the big selection of beer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bTGm7hMJVUmBYGFQ46ar_A"
  },
  "l3RaFmwgyxSYqnwclbQ3vw": {
    "date": "7/26/2017",
    "text": "We were a party of five on a Tuesday night so it was not crowded or noisy.  3 of us had the Tuesday special Cobb salad.  We all agreed it was among the best Cobb salad we had ever had.  The vegetables were fresh and the chicken was tender and juicy, not dried out.  Two others had the pizza and highly enjoyed it!  It was enough for two.  Service was great.  We plan on going again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jiQaWQvSYWygogLKaiYrlA"
  },
  "mQ6zx73tIQ4Y_8QQ0CblvQ": {
    "date": "12/10/2014",
    "text": "Been here multiple times and always have great food. The half rack of ribs was heavenly, albeit messy. The tater tots and to die for. Dip it in the bbq ranch sauce included and watch those tots disappear in minutes. Carolina burger is on the dry side unless you add a sauce provided. I also got a scoffed delivery of my fruity \"drink thing\".",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "rDd_4yL7nXZ-6z6bD9A31w",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Strawberry Shortcake Cheesecake",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/rDd_4yL7nXZ-6z6bD9A31w/o.jpg"
      },
      {
        "img_id": "uh3xy7O9dNZpTGH-zb5rEA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Half rack of ribs with sweet potato and garlic fries.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uh3xy7O9dNZpTGH-zb5rEA/o.jpg"
      },
      {
        "img_id": "kilcCg6_P1jsRHupnibynw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Coconut Cream Cake",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kilcCg6_P1jsRHupnibynw/o.jpg"
      }
    ],
    "user_id": "CcG5UKahjpeB3bZw-SJR9w"
  },
  "g7OibNl-9epahn1Q48jL1Q": {
    "date": "4/13/2016",
    "text": "I must offer a disclaimer as I share this review, I've been coming to Duckworth's for years. I'm a BIG fan of their beer selections and the Duck's version of a Philly Cheesesteak! BUT their inability to serve hot fries is an ever present issue. A question, on their in house written survey suggest they've heard the problem before. It would seem, Mg't is well aware of the problem but choose's to do nothing. Even McD's has found a way to keep fries hot! Ask for chips......",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YEZNR83u5qi3-boq-MkdaQ"
  },
  "Dwl4DDH8hdbyBhlCRRyCzA": {
    "date": "9/25/2016",
    "text": "We go to Duckworths frequently and all always have great food and service.  Dan is a great server and recommends tasty selections.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "D8YmJDSbgfH1IOb2FzQILg"
  },
  "h7kADkSwjEnebjVqOWQJ9A": {
    "date": "1/13/2017",
    "text": "4 stars for jewel the bartender service was very good food was very good 0 stars for management policy of asking everyone for proof of age even when the person serving you is as young as your grandchildren I've been to several restaurants and bars in the Charlotte and both North and South Carolina area in the nine years that I've lived here and this is the first time ever I was asked for proof of age I think management should change their policy it's ridiculous someone that looks as old as I do should not have to show proof of age it's a small reason not to go back it's just more of a nuisance then anything else",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dq95ut3ReIzR_30YJxyXug"
  },
  "gpT2xcRFMX9-EbZBC8qD1g": {
    "date": "11/12/2016",
    "text": "Stone cold food. First time I been here. Very noisy had margarita flat bread soggy and cold. Could have cooked better myself.   Will not be returning. Waitress never even asked if the food was okay.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cyC9doXZndrdKBr7CdUWhQ"
  },
  "y7ALnVFc3ozku-Pb9ueDng": {
    "date": "10/28/2012",
    "text": "The nachos are amazing!!  They are very large though if you are going to get them, you might not need to order meals depending on how many people are splitting them.  The hangover pizza wasn't that good.  I really like the Caprese Sandwich though.  They have a really good selection of beers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K1osyO04_hXoDKyGqe_V2Q"
  },
  "7gth-ZksE2KBZY9I9U_ZKw": {
    "date": "9/25/2016",
    "text": "a lot of beer however the beer was a bit warm. there was some issues with the food but the staff took care of the time delay and wrong orders. might try again when it's not that busy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "flUjZQkg93UWLxjzzQuC2A"
  },
  "Pn6v9d5wb2XtLWPMnqsN0g": {
    "date": "9/5/2013",
    "text": "My go to sports bar in all of Charlotte.  Great apps, awesome fried pickles with ranch.  Best pizza in the entire city, they have an amazing Philly with an option to include a fried egg in it...sounds bizarre but it works.  Fries are great plain, garlic or cheese.  Have tried so many things here and have never been disappointed.  Large menu, TV's at every angle, not a bad seat in the entire place.  Service is spot on, attentive, always have been well taken care of.   Duckworth's, you will not be disappointed",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eNqeoVDXWcZMyDijbTWxrQ"
  },
  "2MZsAtR-jhE6PuYAvDgiEQ": {
    "date": "4/16/2014",
    "text": "This place has the worst customer service that I have ever experienced. We came to have some beers and were greeted by a server after finding a table in the bar area. It wasn't really a greeting, but just a here's the beer list, I'll be back shortly. So we start looking it over and deciding what we want. Then another person comes up and says he is the manager. He goes on to say that people were worried we were too intoxicated to drink anymore and he was coming to check and see if that was True. I was completely shocked because he said it just like that instead of having a conversation with us to see if we seemed intoxicated. I have NEVER had someone at a bar ask this question of me and especially when I was not even drunk. I told him this and he went on to state that he has had it done numerous times to him. Seems worrisome that a manager of a bar has had numerous other bar managers think he was too intoxicated and he needed to be confronted about that.   He went on to tell us that we clearly were not drunk and that the waiter would be back to take our order. I told him that we would be leaving and going somewhere else to spend our money. He said, well if that is your prerogative, then so be it.   Again, this place is a crap-show of management and I would suggest staying FAR away! There are way too many other places in this area that will love for you to spend your money on a couple of beers.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "VAonxcB-NoEaUn5bcIb56g"
  },
  "Y5m7Z0vlUDjFbY7eupnNRQ": {
    "date": "6/16/2012",
    "text": "Great American fare. Lots of large screen TVs for watching sports. I always order the Mommoos wings. They are awesome. The sweet potato fries are great too. Get the salted version.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-brOhLyLDdkvo4UjMCAo6Q"
  },
  "LC3wg5NHyrzQ2EFaWJ58QA": {
    "date": "9/24/2012",
    "text": "Great beer selection, decent liquor prices (although could switch up the liquor specials once in awhile), and pretty good food. The salads are great, as are the main entrees, but I would stay away from the traditional pizzas (kind of blah, hence why they're are special quite a bit). Great place to watch a game and have some drinks, but the service in the bar area can be hit or miss. Some days you get a great, attentive server, other days you can't even remember what your server looks like because you haven't seen them in awhile. However, probably one of the better watering holes in the area.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6vGZAIRWCALVS2KSo3COdA"
  },
  "lWD-YClV_WxqUk0VZOq9eQ": {
    "date": "5/27/2013",
    "text": "Love love love this place . When it comes to places to eat I'm a very picky and hard person to please and this place was on point with everything .. The staff is great, food hot, orders were taken correctly and arrived to the table correctly .. And anytime I decided to write a review then you know that Duckworths is the place to visit ... I'm looking forward to the football season, cause I've just found a new place to watch the game !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k0k7YU0taQOKUEeNBbZCDA"
  },
  "K9d78h7K7KBySqQY_mnRwg": {
    "date": "11/11/2011",
    "text": "I stopped in the new Duck last night thinking it would be the cheaper draft night. Unfortunately, the three dollar draft night is on Mondays and Wednesdays at this location. It didn't matter anyway, as I am so happy that this quality draft haven is two miles away from home. The beer selection is perfect. I would give it five stars for the beer alone. The rest of the bar....not so much. I counted 48 televisions in the place, and zero atmosphere. It still has the bland, strip mall feel of the Park Rd. location. I suggest sitting in the bar area, the booth benches are too hard.   My friend and I had the chips and the sweet potato fries. The food was good, although there was a little black curly in my friend's ranch dipping sauce. He mentioned it to the waiter and the manager came by and comped our first round of drinks. The wait staff was nice, prompt, and knowledgeable.   So, five stars for a great, great beer selection. Four stars for the food (minus the pube). Two stars for the bland, television infested strip mall location.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-MAGX8U615yDp0jNTMcpoA"
  },
  "y8t81R2Z-Lk6OjKsn5tGEw": {
    "date": "11/8/2014",
    "text": "This has become my favorite spot to go after work. Being a beer nut I can always find a great selection of local brews. The service is always great! The wings and fried pickles are a staple to my visits. I was introduced to duckworth's by a neighbor and now it's become a regular spot with my coworkers. The atmosphere is so laid back and comforting. Will be coming here for as long as I live in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jUUh0iW5XiFe-tK3yskZQQ"
  },
  "6Rrx6TMZPXrYyPB9ckpJyw": {
    "date": "12/23/2011",
    "text": "I love this place for two things:  the cheese steaks and the Wednesday pizza. The thing that kills me is that although the beer selection is great, having to look at a spreadsheet type of menu only to find that the beers come in four different glass sizes is disappointing. Most bars give a 14 or 22 oz glass but Duckworths gives an 8.5 oz, 11.5 oz a 14, etc. why not just have one or two glass sizes and charge accordingly?  I'd rather pay a premium for a good beer that is in a beer sized glass than pay for what I'd call 1/2 a beer.   I'll only go there for bottled beer, cheese steaks and pizza....all that they do well.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "V4ylmK_X8wzpW8gQQvyHWQ"
  },
  "Qj4KmHMWqQvjPPnvLYu3Aw": {
    "date": "7/2/2014",
    "text": "This place was really good when it first opened. Food is same and that's a good thing. But, they are always out of beer. It's a running joke now that whenever we go in, someone in the group will order a beer on the menu that they \"just ran out of\". Very disappointing.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zynfOy36AZ0WsoGUYAjQaA"
  },
  "UsMKggkVcoYGvQTXnWfYhg": {
    "date": "12/22/2013",
    "text": "My husband and I have been into Duckworth's on multiple occasions and usually had a good experience.  Since it is near where we live, we decided to order takeout.  That turned out to be an awful idea.  What you are served to eat dine in is a lot different then dine out (take out).  After placing a take out order of mozzarella sticks, potato skins, chicken tenders, and the Carolina pulled pork sandwich, we were told our order would be ready in 15-minutes.  5 minutes before the order was ready for pick up, we received a phone call back to tell us they were out of mozzarella sticks.  I was told I could just order french fries with cheese on top if I wanted, I declined.  When I arrived to pick up my order, I had to wait several minutes for the manager to come take the mozzarella sticks off my order (something I would have thought would have been done before I arrived and my food started to cool in front of me).   Upon arriving home, we discovered burnt potato skins.  The pulled pork sandwich was dry with no BBQ sauce on it and the cole slaw side that went with the sandwich was missing.  The chicken tenders were supposed to come with a dipping sauce, which again was missing.  All and all a very disappointment take out dinner that cost me $27.00.    I called to pass on my disappointment and spoke with a gentlemen named Kevin, who could have cared less about my disappointment with my order.  When I explained what was wrong/missing about our order, Kevin said \"I'll let the manager know.\"   As I asked \"would you like my name/number to pass on to the manager,\" Kevin promptly hung up on me.  Not the best customer service.    I definitely won't be going back.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttELKezYlKm-Qcp1he75LA"
  },
  "04InnkMa4GVTAUp4T7xmkw": {
    "date": "8/24/2012",
    "text": "Good bar food, fantastic beer selection and a staff that was very knowledgeable on beer menu.  I was there with a large group of 14 people and service was very attentive and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yhiE8a2e8es74xo1a9atHA"
  },
  "v2ztQW-trxXZRbOy5EFBXg": {
    "date": "12/25/2012",
    "text": "Eastern North Carolina style pulled pork was great.  Nachos were massive and very good.  Servers were very attentive and polite.  Lots and lots of TVs.  All food portions were more than we could eat.  I visit the Charlotte area quite a bit and can't wait to go back and try other things.  Menu had a large selection.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aImpJkz2KH06fCU9xdaJbg"
  },
  "kBB9EgHhorUa893yzhzW-A": {
    "date": "11/28/2011",
    "text": "80 beers on tap...20-something TVs to watch sports on.  Fabulous cheesesteaks.  This place is fantastic.  I visited the original location many times, but it was too far away from my Ballantyne home to travel there too often.  This location opening up is fantastic!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1UR-fzasIATn6hoYZein4g"
  },
  "HG8X8mlyinkflmfxRtZnKA": {
    "date": "12/4/2014",
    "text": "The food is always good. Plus kids eat free every Thursday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VgdY0bF74w4CPSqH8yxk0Q"
  },
  "R8sCBZtsryW2TETvUqCnJg": {
    "date": "9/4/2013",
    "text": "fun place for oily fried foods and alcohol. very guy-ish place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "hXaRCEtK7175XyLPSDM-Kg"
  },
  "SM0ispD3cxcjqWks_vV7mA": {
    "date": "9/7/2014",
    "text": "Great place to watch the game. Nice atmosphere. Food was ok",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YKmrAMYYbYVLUVm83qWDnA"
  },
  "h6DDfJTchuFFvHI6L0X7iA": {
    "date": "7/16/2012",
    "text": "I liked it at first, but recently the service has been HORRIBLE!!  We waited in our booth for over 10 minutes and still didn't receive any water or menus at least. The staff were so busy vacuuming and cleaning around us. (this was on a friday night with hardly anybody there)  When we finally got up to leave, a waitress comes by and asks if we have been helped??? (ugh 2 people sitting down at a table with no water, no menus, no drinks, no food???? what do you think??) I told her we had been waiting at least 10 minutes and her only response was that no one told her!!!!  The food is good, but not worth it since you will be waiting a LONG time to get served. This was already the 3rd time since we had to wait to get a menu or anything. I recommend you go to MELLOW MUSHROOM across the street instead.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uTdUmahvGJYgK9INpqiGJw"
  },
  "nxKfaTlRqcwCDqgxxxMcGQ": {
    "date": "1/5/2013",
    "text": "We're new to the Charlotte area and can always count on Duckworths for a great meal, excellent service and a drink/beer selection like no other.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MED317_hvF06YsrVfl802A"
  },
  "s4lX08RuZgXFvB02o5xEbw": {
    "date": "7/5/2015",
    "text": "I like this place.  I went last night with my family, it was July 4th and we absolutely didn't feel like eating at home.  My picky 4 year old and 7 year old who eats anything was in tow.  With a picky 4 year old that really only eats certain pizza you have to be careful.  We are tired of the usual places so we tried Duckworths since it had pizza on the menu.  on first glance it looks fine on the inside.  Typical sports bar with a section for sit down meals.  I liked that they had a \"feature\" menu that had 2 things on it.  A Burger and Turtle Cheesecake :-)  We were greeted by our first server who reeked of cigarette smoke who must have just walked inside from a smoke break and didn't spray down.  She stunk.  I commented to Sweetie about how gross that is, then we magically got a new server.  Score.  We started with the chips with queso.  Chips came and they were so salty that they were inedible.  I sent them back and immediately a Manager came by and handled it perfectly.  I was happy to find out they do the chips in house so they weren't oversalted at the factory but in house so they made us new ones.  I had a Chicken Philly which was good, Sweetie had the Summer Salad with Salmon which she liked a lot, 7 year old had Nachos which were tasty, and best of all my picky 4 year old had a pizza that SHE ATE ALL OF!!!  It was a momentous occasion and for all of you people reading this thinking \"Is the pizza good here?\"  If my kid ate all of it, suffice it to say it was AWESOME.  So, here's the grand finale.  Please remain seated.  They had this flip menu thingys on the table with the desserts.  Now Sweetie is a wonderful baker and we don't eat much cake out of the ol homestead.  These pictures looked professional which led me to believe that the cakes were straight out of the US Foodservice box.  We got the coconut cream cake.  They brought it out and it was delicious.  Moist, soft and buttery sponge cake with a nice frosting and the coconut was just enough, not obnoxious.  I asked our server if they made these in house.  He said no, but that they were from Queen City Bakery.  Well played, Duckworths.  Well played.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "-rlIN1BFK65MyHWt_HhPJg"
  },
  "WgKr_bw7KRAdblaLrWw5Lg": {
    "date": "3/19/2015",
    "text": "Went there for lunch with my team. Had a salmon salad. The fish was tasty and moist but the spring mix was not that spring but u can't expect much from a sports bar.  The beer selection is fantastic and they have quite a few stouts and porters. The beer prices are fantastic!  The service was great! Overall good spot!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5p0zw9ZawJoGpLJKAk_MIw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Salmon salad, it was decent...",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/5p0zw9ZawJoGpLJKAk_MIw/o.jpg"
      }
    ],
    "user_id": "4ZMEzT44elna8-mXXoGYHw"
  },
  "zhtWbh09DhOt5lpR2a6YUA": {
    "date": "5/22/2016",
    "text": "Went to the Balantyne Duckworths location. Seated at a dirty table. It was so disgusting that I reseated myself 3 booths away. The new area smelled of vomit. Walked out.  So, if you're looking for a dirty, disgusting, smelly restaurant ... you can have my table.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "brrKsiwH_EEwEaLfKijZTw"
  },
  "02N6Ix3Qb-ScqAqsh9IuTg": {
    "date": "1/2/2015",
    "text": "Having been to the Park Road location multiple times I thought we should give this Duckworth's a shot.  Being New Year's Day, we decided to start off with Bloody Mary's, yippee! And, they were great, although I do wish they served them with celery. As for the food, we ordered the Chicken Quesadillas, with bacon (well done) and the BBQ and Wing Platter. The BBQ was good, however, a little dry in my mind.  My friend ordered the wings plain, not my choice, and they were fried.  Unfortunately they were the most disappointing thing I have had at any Duckworth's. The fry was very greasy and thick and it seems like the wings had very little meat.  Something I will pass on going forward.  Overall the food and drinks were great, but the service was a little slower then the other location.  Although, like I said it was New Year's Day..and I think our waitress may have been struggling from a late night herserl :-).",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "GwsaYVoHqcA-GdkdjRBhPw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GwsaYVoHqcA-GdkdjRBhPw/o.jpg"
      },
      {
        "img_id": "eefTI_Y17gwQMnVmJbGvyg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Chicken Philly",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/eefTI_Y17gwQMnVmJbGvyg/o.jpg"
      },
      {
        "img_id": "nRnFkwwgT9RGkTD_2jJDqg",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. BBQ Platter",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nRnFkwwgT9RGkTD_2jJDqg/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "hx-ePvDireci5GFkpfb9Lg": {
    "date": "10/17/2016",
    "text": "They have the best shooters ever! And so many to choose from. The BBQ was also really yummy. Getting day drunk was never so delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h94s_hqSmbqv4jzYI0Gifw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Need bomb shooter and chocolate cake shooter",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/h94s_hqSmbqv4jzYI0Gifw/o.jpg"
      }
    ],
    "user_id": "pjQAuPpsFOMBRwhQD5GcXA"
  },
  "rfV85ZqIgpL7A1H-ThDZ_A": {
    "date": "4/11/2018",
    "text": "Excellent lunch! Burger and Cheesesteak were exceptional! The double decker Strawberry Cheesecake was beyond good!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "COTBCIsnpu6sblqVbHxB1w"
  },
  "yZtZog1n4oHo8RG9KS7eZA": {
    "date": "7/31/2017",
    "text": "I guess you can't please everyone.  Beer selection here is top notch.  I can't see anyone complaining about that.  The wings and the burgers have been great.  Fajitas on Sunday...well, it isn't a Mexican joint, but they were alright.  All in all, I think this place is a good stop.  If you have been to the Montford location, this place looks like they took that space and just inflated it.  Everything is more spreadout, but it looks just the same.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iYmsjLb0zv5ux0ivc5fieQ"
  },
  "2wcsujUVM4-m9iN_uvUukw": {
    "date": "11/11/2017",
    "text": "This is hands down the best place to get chicken wings. My husband and I come here at least once a month, sometimes once a week when we keep craving wings. I love their honey BBQ and my husband loves experimenting with their sauces and hasn't been disappointed yet. Everyone here is also always very nice, I made a mistake by somehow ordering at the uptown duckworths and they still happily made my wings for me and they're always just super nice in general. I only like flats and my husband doesn't care, so we usually order a big batch of wings and I always ask for the BBQ to be flags and they never mess it up nor complain and some places give me a hard time for it. But Duckworth's is the best.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1j8yp6EhlsuZKShsjSpDgQ"
  },
  "MuA5ISzNFBQuwOPTYmN6nw": {
    "date": "11/24/2014",
    "text": "Duckworth's is the place to go for beer for sure! I have been to all of the locations but I frequent the Park Rd. location the most. They have a tremendous craft beer selection at all locations. They even have beer special nights where virtually all beers are $3.50 each! The beer special night depends on the location (either Tuesday, Thursday or Monday, Wednesday) The food is also very good and reasonably priced as well! They specialize in Philly cheese steaks and are probably the best in town! I also recommend any food specials (they are always good!), the Cobb salad, fajitas, wings (especially Mommoos'), and loaded nachos (they are huge!). If you want something different for an appetizer try the blue cheese chips!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FOs99ctz-qEZ5lt-XhcftQ",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Philly Cheese Steak &amp;#34;Jersey Style&amp;#34; - white American cheese, lettuce, tomato, oil &amp;amp; vinegar, dry oregano. Outstanding!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/FOs99ctz-qEZ5lt-XhcftQ/o.jpg"
      }
    ],
    "user_id": "_CQetImJGo97dAIM0fjsSA"
  },
  "m8GbVV2MdEIO04tDvOwMhg": {
    "date": "11/4/2017",
    "text": "We are new to the area and a peer at my work recommended the location at Conlan Cir. We've been here a half-dozen times already; and so far, this is our favorite place to go. Service is good, food is great, and the craft beer options are even better!  Hop Man Beer Club anyone? So happy it's close to home.  One downfall is that parking is horrible, with narrow spaces and not a lot available.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IVdo1EyFz-l-d2gygsQrqw"
  },
  "yI0uzRcBbfBQJOVgxRmiGA": {
    "date": "9/1/2017",
    "text": "Went for dinner with my three kids on a Saturday, kids each wanted something different to eat, pizza, burger, chicken, therefore Duckworths seemed to have this together on the menu.  We ordered fried pickles as appetizer, this was the best dish, from here on it went south. This is also the reason it still got 1 star. We ordered burger, pizza, salad, fries. Pizza was soggy, there was grease dripping off the plate when waitress (clueless) put the plate down. Fries were luke warm, which is good for the kids, however I think fries should be steaming hot. Asian salad had burned chicken on it, really bad, the lettuce was wilted, black spots everywhere. I think it looks better put together in a bag on the shelf at Whole foods than it was on my plate.  I asked waitress as well if Stone beer came in a pint, she said yes and gave me some flower vase with 8 oz of beer. When I asked her to take it back she said she was not allowed by NC law.....(kriek kriek...) At the end I called manager, he took $15 off the total bill, still ended up being $55 including the tip. Will not go back here for the food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJXDRSPqsKGcjZxuyMPYGw"
  },
  "5xP6am48vbbzXXzRB7RLuw": {
    "date": "6/13/2017",
    "text": "Went in today for a business lunch. The smell from the drink prep area was overwhelming and caused my dining experience to be less than desirable. Most of the hot food orders were incorrect and  incomplete. I was very disappointed with the overall experience.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FRbr5RTlijsj6EwZlMGNBA"
  },
  "Smbsq5BJM7O9WLc7OPZeEA": {
    "date": "1/23/2015",
    "text": "I had been here for drinks before and never had the food until recently.  I was not impressed.  I ordered the veggie burger (everybody has a veggie burger these days, but come one, you don't buy your hamburgers frozen in a box--don't buy your veggie burgers like that). It didn't taste like it was an actual veggie burger patty made in-house. It tasted extremely processed and overly salty.  I had the garlic fries as a side--drenched in oil and hardly crunchy at all.  The strawberry shortcake cheesecake was the only decent part of the meal.    Service--I had no issues with out server; she was pleasant enough, but the food is another story.    I was looking forward to a good, hearty veggie burger, too.  Shoot!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TvGjTpI8EVJSw5qEbeI2xw",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Grey Goose and Baby Guinness shots",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/TvGjTpI8EVJSw5qEbeI2xw/o.jpg"
      }
    ],
    "user_id": "YI5sEimxyYrdeFbmsv_ssQ"
  },
  "REn6I3_3kEBrqnjZ1aCRdQ": {
    "date": "8/10/2018",
    "text": "Bar staff (Preston, with whom I dealt) was very friendly and kept their promises about a gift card offered to make up for the absolutely horrible and disgusting IMPOSSIBLE BURGERS we had ordered.  What ever you do avoid these things at all costs, and believe me when you see the price you will know what I mean about cost!! That said, we ordered two meals (bacon, chicken wrap and SW veggie burger) and one appetizer (boneless wings).  Absolutely the worst we have ever had, the \"wings\" were way over deep fat-fried pieces of something that may once have been chicken but all you could really taste was the overdone batter.  The veggie burger was indescribable - still trying to figure out just what is was.  Both the burger and most of the \"wings\" went in the GARBAGE the only fitting home for them.  The wrap?  Well it was sort of okay at first but the lettuce was really wilted and no comparison for wraps from some of their competition.  That said, cannot understand the great reviews for the food here.  Won't go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bg986VgQhu3APF3GKDxlcQ"
  },
  "gKFF0JO_3hqHbTNz4pBVDA": {
    "date": "8/18/2016",
    "text": "We went back and we had a great time; sat in the bar area, the waiter was nice and our food was yummy. We will be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TDdKzYX2dVIayk1b40C3nA"
  },
  "O9pNjM5nASfkS32-9DEV2w": {
    "date": "5/14/2017",
    "text": "Great lunch today at Duckwotth's in Ballantyne. The BBQ chicken/jalapeno bacon Flatbread was delish. The service was excellent!  Thank you Naso for keeping the tea filled and for taking good care of us!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZCyH1tlio8_57sKHnzbv1A"
  },
  "uGWosArvQeXyTVaAJRKfpQ": {
    "date": "4/8/2015",
    "text": "The place was decent overall. The menu had great variety for vegetarians as well.... The southwest veg burger was ok... Some colleagues ordered salmon and the sides looked delicious..... The service was a little slow....",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZFhPlZZf76melzsN3A0fkA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Custom pizza",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZFhPlZZf76melzsN3A0fkA/o.jpg"
      },
      {
        "img_id": "vzJk2jsPIkxd_RqWsQAtKA",
        "caption": "Photo of Duckworth's Grill &amp; Taphouse - Charlotte, NC, United States. Nachos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vzJk2jsPIkxd_RqWsQAtKA/o.jpg"
      }
    ],
    "user_id": "TCnyyMqBc3FwRAK9z5y4MQ"
  },
  "o2ZG7hEkROsZ_JFVXj2MNw": {
    "date": "1/26/2017",
    "text": "Everything was perfect from the service to the food! Prices are average and you get a lot of food! Wings are delicious, crispy, and well coated. The nachos were huge...enough to feed a party :) No complaints on my end!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rHpbQ9SYv3W9ItsGgXhP0w"
  },
  "x5kcBx2zYhD5IRk4ugLpvg": {
    "date": "2/4/2018",
    "text": "Best selection of craft beers in town!  My favorite place.  Excellent service and knowledgeable bartenders to help with beer selections!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xlndhMRU6Srq61lYV_Bc7w"
  },
  "tpCKxqHt82DVKx23mO7aMw": {
    "date": "3/11/2018",
    "text": "Great food choices, great customer service and fast as well. The restaurant is also kid friendly Will definitely comeback.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SXTBcxvfgSsooxftQfL6rQ"
  },
  "FtCPB8SGOTBVjoCVFwwuVw": {
    "date": "3/6/2018",
    "text": "First time coming to the one in Ballantyne, it was the Duke and Carolina game so they were very busy but our food came out fairly fast which I was surprised. I ordered the  steakhouse salad which was amazing and my boyfriend ordered the bbq platter which he enjoyed. Our waiter Eric slacked a little but I believe it was because he had so many tables. Over all I will deff be back maybe not on such a busy night though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fBNXUwybMuhNI6mP4CWmBg"
  },
  "c6XayJjBeW_HPUArLyDP6g": {
    "date": "2/28/2018",
    "text": "Mediocre at best. Menu too big and quality too low. Not worth eating or drinking here. They cut you off after 2 drinks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wnId7voAR41yJIcT69RMpA"
  },
  "9fwW95pF4t67RCRVH6yohA": {
    "date": "2/25/2018",
    "text": "Wife and I shared nachos as our entree, couldn't finish it!  Enough for 3-4 people.  Great menu selection, huge beer selection, and a very very good Moscow Mule.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oNt0NnaCpPkwIBOaE4eFSQ"
  },
  "qNmFY194oYZsjnrFCwFdEg": {
    "date": "2/20/2018",
    "text": "Excellent food and service. We come here often and every thing on the menu is great. So many beers to choose from and great service. Highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QHTu3CE1qBWm1axzVgGxw"
  },
  "JiHlCwBoqsrzKBT2uBTNEg": {
    "date": "8/18/2018",
    "text": "The service was mediocre at best.  The most simple things seemed to be a problem...no lime in a gin and tonic..had to ask for plates after the appetizer was delivered and then not enough plates for everyone at the table.  Early on a Saturday and not especially busy.  Salmon was overdone and had zero flavor.  Bacon burger was good, and cooked to order but why is a restaurant serving Ore-Ida onion rings.  Really? Plain as day and that is not an exaggeration.  Positively. Not expecting a lot but certainly more than what was delivered. Big drop off from our last visit.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7S7d0_pJDPOdWDs38uZAjA"
  },
  "sfZDXT3Vix1UA7xixQc9vQ": {
    "date": "3/19/2018",
    "text": "Duckworths continues to be my favorite non-brewery establishment in South Charlotte to grab a drink and good food. Their 3.50 draft special on Monday's and Wednesday's and reasonably priced appetizers, food specials, and pizza of the month promotions are hard to beat. Service is always good, with servers offering great hospitality and knowledge of the drink menu. The Sweet Bold and Gold wings are amazing. Definitely a great place to hang out with friends or get some late night work done if you're looking for a place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ODDVmkwfrO71kWd8PoyRaQ"
  },
  "72NBvZl2RX-njLE1mvz4-w": {
    "date": "8/10/2018",
    "text": "Great food, great beer. Staff is smart about beer options and choices. Nice separation as resturant side is far enough from the bar area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bWQASMqg0yxzFBKUq5SqWw"
  },
  "7iI7JehKhiPLVg8Husk8Hg": {
    "date": "8/9/2018",
    "text": "After passing Duckworth's many times, I finally tried it. The service wa excellent and the BBQ Chicken was excellent. A great new find!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kaKb8cqpNzA5b9aZEphWuQ"
  },
  "5Xq7Q_Ipx42IFr6FfZo4aw": {
    "date": "8/6/2018",
    "text": "The food was very good. Great sports bar environment. Huge list of beers on tap. Will definitely be back. Strongly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wmobToY9ed2rig5MNGn8BQ"
  },
  "bbo4KLn2G7kz67q6T5qMQA": {
    "date": "9/1/2018",
    "text": "Today I went to Duckworth's in Ballantyne with my fiancee and her Son. He had fajitas which were excellent. My fiancee had the veggie burger which was also great. I had the Mommoo's wings which were also good and their ranch dressing tastes homemade. We all had beer as well which was great. The bill was around $87 including the tip. Our waitress was Elizabeth and she was excellent - very attentive! We'll be back (again).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jSlv0tV6TLkrikWZ1JnOqA"
  },
  "azGBQhUk_p1piADcMOSp0w": {
    "date": "2/1/2018",
    "text": "Great food and such a fun crew. They really care and take the time to get to know their regulars. The menu runs the gamut- two words: chicken. philly. Delicious wings (the Sweet and Bold Gold sauce is lit), great wraps and surprisingly, their pizzas are serious NOMS. Fun atmosphere and good food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ejaUYMqVlHGJ0O3x2Bab1Q"
  },
  "DozuyiVxheLajLe8pITV4Q": {
    "date": "7/28/2018",
    "text": "Great Spot. Great food, great service, great staff. Always nice when they have a tap takeover. SWEETWATER was amazing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s_2y9cbiDKTK9-jRmkB9kw"
  },
  "5CqC83PUfMQJcnUZIGh33A": {
    "date": "1/20/2018",
    "text": "Snow day and wife and I ventured here for a couple of beers and some Fajita Nachos.  The nacho portion was insanely huge, enough for 4 people.  Cameron was our bartender and helped us select different beers from their extensive dining aft selections.  Great place overall and we will be returning.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GgnwQgKLHuhS84qfmS8uRQ"
  },
  "dGOjTDbCJS2J8ekmjhdYHw": {
    "date": "9/5/2016",
    "text": "Was here for a short period of time but managed to have a small ladies nights lols. Didn't really had any food there. Just an apps which were delish! The drinks tho'! Killers! Strong and smooth!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "Yd3ieW8UucZJb_JdYdI7CQ"
  },
  "Iwy5eSnNBPFfxndez3vWGg": {
    "date": "11/7/2017",
    "text": "One of the best places in South Charlotte to watch sports while eating. The food is always good, but the service can sometimes be lacking a bit. The burgers, chicken sandwiches, and barbecue are all good options. For sides, try the tater tots or sweet potato fries.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XX2o5d8o3W3nKGpFWxmiOQ"
  },
  "LG-sdokVZTo71VUTT5tv2w": {
    "date": "6/30/2018",
    "text": "The service, food and beer were amazing. Elena, our server, helped us to choose just the right beer. We had a Wicked Coolcumber, Elliott Ness,  and Blvd. Tropical Ale. The Grouper Tacos were soooooo good!! Can we get that in the daily, regular menu?",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oAShJArG0ygiPgZkv2EPVQ"
  },
  "p4RowK40ZBQd6JLwc1bJaA": {
    "date": "10/24/2017",
    "text": "We heard about the wings so tried out the Momoo's  wings and this is now our wing spot! The wings were simply the best around...super meaty and cooked perfectly with the fry and chargrill finish. We also tried the Philly and a chicken bacon wrap. Both of the sandwiches were really good. The homemade potato chips and onion rings were also delicious. We will definitely be back to get those wings and try more of the menu! Such a great easy and comfortable place to grab a great meal! Oh and did I mention the amazing beer choices?!?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0lPjKNBwn9GjDqs6h15yfQ"
  },
  "dhuVCieMcmu8JDwynY_6hw": {
    "date": "7/15/2012",
    "text": "I've been here for both lunch and ... beer.  Both are very, VERY good.  I had the Baja Fish Tacos -- pretty darn scrumptous!!  And the extensive beer list will please any variety of preference.  And if you're overwhelmed with all the choices, try their beer sampler (always a must-do on your first visit).  Plenty of TV's to carry all sports programs - not one bad seat in the house.   New outdoor patio is concrete with an awning covering from the outdoor elements ... and seating (i.e., outdoor couch).  Typically the smokers' escape ...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tm6zapORuXpM1BxCjIirng"
  },
  "bRvsBauCL2f8pMLj3WQYWA": {
    "date": "7/3/2013",
    "text": "If you like watching sports on TV, this place is for you!  My husband counted 46 TV's! They also have lots of beer choices, and plenty of vegetarian options! I tried the Fried Banana Pepper rings, which were surprisingly awesome (considering I don't like banana peppers), and the sweet potato fries as appetizers. Really good! For my entree I got the Caprese sandwich. It was good enough (nothing special, but good), and I got one side item with that, and I chose the roasted corn kernels. Those were REALLY good! My husband tried the veggie burger and really liked it. My kid got a cheese pizza that he liked, and we tried the cheesecake for dessert (nothing special). I would go back again because of all the choices.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w0eFvridg4LMKQXtO-t-Kg"
  },
  "kaip5hTbe7nUtN1mBj4wQQ": {
    "date": "1/29/2014",
    "text": "We have even here two times already. We have visited the Ballantyne location and the South Park location and they were both great. I love all the selections they have for beer! We'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4H8GObX-SEIPeubB9w2xpQ"
  },
  "9sVa34y_V2meZEvtpLL9fA": {
    "date": "7/31/2014",
    "text": "I love the Duck!  Best wings in the area, always a lively crowd and enough TV's to keep you busy!!  Great service!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WLXHWgzoc1G1hAYdZ-zU_w"
  },
  "ME_Kj4ZyxqVXe7gEWDaKIg": {
    "date": "3/16/2013",
    "text": "I have been to Duckworth's numerous times since its opening in Ballantyne and have always enjoyed the food .This particular time I had a pizza while my family had the chicken phillies and quesadias which were good as always.  My husband and son always enjoy the variety of beers and on this trip had the sampler. Our waiter was very knowledgeable of the all the beer they had on tap.  All in all it was a very enjoyable evening.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "E7DZANkOxMnuy5lcMXlNvg"
  },
  "SFMMn1znwaGdDhQrNWK7FA": {
    "date": "10/16/2015",
    "text": "Ok just came from this place... I do not recommend this place at least for lunch we had to wait a long time for our food. And when it came it wasn't even hot... Not worth the money I spent. Our waitress seemed as though she was having a miserable day not friendly at all. Atmosphere with the televisions were nice but that's about it. The manager did make up for one of the dishes.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "REtbEreDeblLbuijY3Wa1g"
  },
  "sHcASV2jZ0cEzFAzScLabw": {
    "date": "10/1/2015",
    "text": "Went to Duckworth's Grill on a Sunday to watch the 1:00pm NFL games. The hostess asked which games we were interested in watching since each tv shows a different game. Since the Dolphins game wasn't until later the only game our group needed to see was the Jets game since one guy in our group was a Jets fan. They ended up seating us at a table that didn't have view of the Jets game at all. The patio area was closed due to the chance of rain, however, the manager opened it up for us and the Jets game on one of the tvs out there plus others so it worked out for the best! Our waiter was awesome and had all kinds of food/beer recommendations (I forget his name but he was a big Peyton Manning fan lol). The local micro brews and wings were great! **Get the Bold Gold sauce** Overall tons of beer and food so everyone will be happy and the service was outstanding. Would definitely go back if ever in the area again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PdkSQttXotTGmgR2OkKQIw"
  },
  "CyfzO0OyGn9qjETgFIw_Yg": {
    "date": "12/10/2015",
    "text": "Please dont waste your well earned money on Duckworths food. Small portions for a higher than normal price. Management is indifferent  to customer satisfaction. Too many other choices to get a good value. If youre going to drink there, be sure to eat elsewhere!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7yb4uHueUyhw9HuuBWddaw"
  },
  "slXfB-KosamJFY3XfF8Dvw": {
    "date": "6/18/2015",
    "text": "Craft beers were amazing and a great value for someone coming from Jersey.  They had beers for every taste from ginger beer to amber ales.  We came here for after dinner drinks and some team building.  They bring you an ipad that have the drinks and descriptions so that you're straining to read all the taps.  The place looks like a sports bar, although we didn't get a chance to try to food, the wings smelled fantastic.  They constantly change their taps, the ambiance is fun and casual, groups congregate and chat away for the night or watch any sport that's on television.  Service was good, our server came by often to make sure our glasses were filled.  Pricing was amazing, since we were there on a Wed, drafts were only $3.50!  Fun place to try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lLRQOX1qNkUAcpiA0AIF-w"
  },
  "ANQnn6PBT_whN0pAstfIIw": {
    "date": "6/6/2013",
    "text": "Having been caught in the Ballantyne area last Sunday with no other option, my wife suggested that we try Duckworth's again. This time, the service was greatly improved from our previous visit some 15 months prior, and it seems that the management had changed much for the better. The Teriyaki wings were terrific and the staff was friendly and helpful but not at all intrusive. I'm glad to see that Duckworth's is back to being a great place to visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EsnmAHXpWrcJUvGRPPSNlw"
  },
  "PKXY-SFOh5128GpQigwCpQ": {
    "date": "1/26/2014",
    "text": "If you are a fan of beer, this is the place. Sample, sample and more samples. Awesome selection of beers. looked like 100 different beers on tap. Bartender Dana was very knowledgable and and seemed to love her job.   we ate at the bar  and enjoyed our pizza as we watched games on a few of the 30 or so televisions all around the restaurant . The menu offered up lots of choices. We only decided on the pizza because the manager Tom recommended it. He was very outgoing and seemed to take pride in his restaurant. He also offered up a few of his favorite beers for us to try.  We had a great time and will definitely visit again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "woCPCK_89Iu2CAl569z-Jw"
  },
  "qKcEZO3oOBqIFC_eWL7l-Q": {
    "date": "3/26/2013",
    "text": "Awesome food. Lots of beers on tap and a great place to watch games.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pGCREpkIq26-oMj9t73OVQ"
  },
  "d7kLI2cwms7QSwqfIRBjww": {
    "date": "8/16/2015",
    "text": "they have ipads for beer that is amazing i love beer and they have so much beer thank god.  waiter was adorable and knew much about bears.  however i could have done with less sports.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bE4pjnA4kQBbxAPlds7ZPA"
  },
  "wuTYvvJdlKomazymg6R4bA": {
    "date": "4/22/2013",
    "text": "There's a great selection of beers, and some decent bar food. All in all a little pricey,  but it's still a great experience.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ajFdGUTHTClJGBOJdzn7JQ"
  },
  "vZwvfcHY9oaiiCo4phaSbQ": {
    "date": "10/25/2015",
    "text": "I'll try to keep this short but I'm not sure how I'm going to.  Probably the worst service we've had at a place like this. 15 to 20 minute drink times. Over selling us on the appetizers. Charging us for drinks we never got. Finally went to the bar for a round because the waitress was MIA and the bartender overcharged us by 8 dollars. We had 2 makers Manhattan's on the rocks which should be $18 total. He charged us $26. We wanted to make this a tradition since we went last year before scarowinds. The manager made it seem like he was doing us a favor by not charging us for drinks we never got. He told us that I'm sure it's better service than we get at home. Used the bathroom before we left, absolute mess. We will never be back and a shame because we wanted to make it a tradition. Only reason for one star is because I have to.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vy7NDq2d02a3demTpa1mcQ"
  },
  "3-NpalQH89_GKb-2jKCLMg": {
    "date": "6/19/2013",
    "text": "We love Duckworth's!  Every time we have been the service has been excellent.  They have a great selection of beers--they have everything from local NC brews to some of my favorites from when I studied abroad in Belgium in college.  Their wings, phillys, and flatbreads are all excellent.  My husband likes the \"sweeter\" version of the sweet potato fries.  We love to try new things every time we go and have never been disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NK1l4F46PW5UIWajGTJmbA"
  },
  "3XwTeiCn1xOVwoVEtCkg7w": {
    "date": "10/12/2015",
    "text": "It is sad that there is such a lack of care for customers.  We ordered take out today, one order had half  missing and one was burned (the bbq bacon cheese chicken). The only thing that turned out decent was the wings.  That is not taking into account presentation.  I regret feeding the chicken to my dogs before taking a picture.  Shameful.  Management should be kicked in the hind quarters or out the back door! Last time we order from here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8g_2Gx3jmjxcxiReTSWYw"
  },
  "GyS-1llmXX4mbLUtIfrajQ": {
    "date": "10/11/2015",
    "text": "Great place to eat! Been there several times and it's always soooooo good. Friendly staff, lots of beer on tap equal good times.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "evrdHBn3Ceef_BxThGHUGw"
  },
  "K4n2PNUKWzP23XWlJxjlRg": {
    "date": "6/20/2012",
    "text": "This is a great place for an inexpensive meal where you can veg out and watch way to much sports on tv or relax with friends. They have a great assortment of  beer and a full bar.  They do have beer tastings midweek so they take beer very seriously.  They also have housemade daily specials. My two favorite things are the Mamoos wings and the salted sweet potato fries with honey mustard. All the sauces and dressings are homemade and they will accommodate you.  Sometimes I just can't justify the fatty foods so I order boneless chicken breast with the Mamoos sauce and a big salad with their awesome honey mustard.  They have no problem helping me out with that even though its not on the menu.  Love it here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "j2Hd4aM8XYnYOyhS0ZCNww"
  },
  "eFhnG-Hb-bZhWuJm2N0fNw": {
    "date": "11/7/2013",
    "text": "The beer selection here is awesome!  Service is good and the food is good as well. I really didn't know what to expect when we went. But it's better than most bar food and the beer selection rivals any other restaurant or bar I've been to. They stay pretty busy but the prices could be lower on the food. I will continue to go back to this location and will recommend it to others.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "B0AFQWG5mqkKdEWeHkFUHQ"
  }
}