{
  "KzW9cT-zbMUwyfK-hm-x0w": {
    "date": "11/3/2016",
    "text": "Great restaurant and our dinner was delicious. LeAnn helped explain the menu and was helpful and attentive. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Qp9KS5_ZZvAz2YW67AeqXQ"
  },
  "oUUKO_GiBDo6spleceJUSA": {
    "date": "10/20/2014",
    "text": "We visited at lunch and had several wraps including a Gyro, Swawarma, Cheese steak and cuban.  They were all very good.  All come with fresh made chips, also very good.  We also had a couple of sides of fries, but they were nothing special.  We also had some of the Gelato and it too was good.  We would eat here again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DHZV5E3u37BpGo-2Yx_5RA"
  },
  "lOTsWpf0PO-aQxEcXEh6Iw": {
    "date": "3/11/2015",
    "text": "Enjoyed a fabulous lunch at Bella Fresco. Had the avocado chicken pita wrap with homemade chips. Everything was fabulous and the service was great. The best part was when our server surprised our group with gelato samples. I can see why it's award-winning gelato!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Yv8DVGqxuxkmLMhXHpF5rg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. A sampling of some of the amazing gelato flavors at Bella Fresco.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Yv8DVGqxuxkmLMhXHpF5rg/o.jpg"
      }
    ],
    "user_id": "88Mc7valg4U8UjWzEpNr_Q"
  },
  "iAmCLP9Dc1Q9DdEFAroyCA": {
    "date": "7/23/2016",
    "text": "Great food, great service, great atmosphere! My daughter loved her pasta and side of fresh fruit. I ordered the half panini and half pizza. So delicious! Fresh ingredients and full of flavor. Ask for Leanne as your server. She is awesome! Thank you Leanne!! I will be back next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MlGKTI2EAgXyj2XCFTiImQ"
  },
  "ITBiY3KZ0ms6vB4BcnKvIA": {
    "date": "4/29/2016",
    "text": "Tonight's dinner 4/29/16 with friends was unfortunately the last we'll spend at Bella Fresco. Service was extraordinarily slow, even for salads. Meals took a while to be delivered. 2 friends had comp tickets from the restaurant's owner for 2 free meals based on the previous time's bad food. Tonight's on-duty manager refused to honor them even though the comps were signed by the owner and shown to him. The restaurant business in Charlotte is highly competitive and every customer is valuable - especially repeat customers. Tonight was the last straw and no amounts of comps will get us back. Arrivaderci.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZMG6oPxOD9KHrztZAS2HZw"
  },
  "wtt69JhSwhzqti8qDxgm9Q": {
    "date": "5/8/2014",
    "text": "Don't miss this place! This was our second visit and it was as good as the first. Tonight I had the name your own cheeseburger. It was cooked just right and was very tasty. But even better were the fries. Not sure what they coat them with but oh boy how good they are. The waitress (Vicky) was very friendly and went out of her way to be nice to our two young grand sons. Oh yeah grandson #1 is a burger expert and rated his the best ever! On the way out we struck up a conversation with the owner who went out of his way to show us his new patio in back. Nice touch. The grand finale is the gelato. Don't miss it. Huge selection!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SHk9cw9nBCDFPV2tIkhlBQ"
  },
  "_wGSj1kisT6VGHoTqm4F8A": {
    "date": "3/18/2016",
    "text": "I had the gyro pita with sweet potato fries ($2 up charge) for lunch and it was exactly what I wanted in a gyro. It had the right amount of sauce and veggies with lots of lamb. The service was superb as my server, Leanne, was attentive and friendly. This is a nice, casual restaurant with excellent dessert options that I'll be sure to try on my return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dZ5kZgryiwS6h3LE2-TtqA"
  },
  "o6iWQ-yD5C_pYkMiDKd5xA": {
    "date": "2/17/2017",
    "text": "I tried calling for take out, was on hold for 4mins, decided to called back & try again, placed on hold for another 2 mins. Decided to go call for take out elsewhere. I have been there before but I don't remember the food that much, but was willing to try again today, but not happening. Seriously, how hard is it to take 30 seconds to take a phone order??",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2bIRGg-WWrHB4suzIJOsUw"
  },
  "a_OAALzAPgp8HovmvIJyGA": {
    "date": "9/7/2013",
    "text": "The food was pretty good. I had the Philly with the works minus the pizza sauce with sweet potato fries! Sooo tasty! :) I was definitely happy with my choice. The gelato was okay, I had tiramisu and some other coffee flavored gelato which was much better than the tiramisu flavor. The service was good and the management team was really nice. They just started using Groupon and Yelp! deals and had never seen a yelp deal before so the payment process was interesting. Also, they have \"specials\" , that night my husband had their gyro special for $5 and NO GROUPON or YELP deal can be applied towards that special. So, in order for your groupon/yelp deal to apply, all purchases must be at full price.   My last tip for future diners is to not go by the menu on the website because the menu at the restaurant is a little different. And...for Bella Fresco, keep up the tasty food, simplify your decor and make the restaurant a little more inviting, and the online ordering system needs some additional items.  I gave Bella Fresco 5 stars for great fast but not \"fast\" food and wonderful service. I will definitely be going back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 2
    },
    "photos": [],
    "user_id": "Iuq_xvQJTnRjYq8lkZqNsA"
  },
  "nQUul6Wx2QEubZBlngI-4w": {
    "date": "3/12/2014",
    "text": "I only stopped in to try the gelato and it was great! I got a berry flavor and tried a few others, all we're tasty with the right texture. Probably the closest you're going to get to Italy here in Charlotte. The guys working the counters were so nice and even told us about the cute patio by the pond out back. Great customer service and great product!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dcsM6clBz9U3EzXDKx3bMw"
  },
  "QhXqmkVf-JfNKfHL_8R3HA": {
    "date": "7/28/2013",
    "text": "The gelato is outstanding! I have tried many times and many flavors. They always encourage you to try different flavors before you place your order.  There is a young girl who works there is a all-star employee. The owners are very lucky to have her working there. We've tried the food occasions. I like the whole wheat pita that they make available. The staff and owners are visible and friendly. Keeps gettimg better",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "qS9s0bWdrx71uVROW06j_w"
  },
  "9LNHU8lnKITRGj9j8jnZ8w": {
    "date": "8/4/2013",
    "text": "Upon arriving I was seated and checked out the menu & decided to go with the shrimp pizza. My server was nice, but overall the servers seemed very disorganized & the Manager/Owner? was overlooking everything correcting them, telling them things to change, etc. It didn't seem like the right time or pace to be doing so, with customers around. Although the service was slow the pizza was good, even though it was cold. I asked that it be re-heated and that helped. Served on a thick pita crust with cheese, olives, shrimp(only about 4) and a pesto sauce, very good. I would like to go back and give the other menu options a chance, as well as the gelato.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "zMa1N-biR3009_7wqc6aow": {
    "date": "9/8/2013",
    "text": "Greek salad was very good! The gelato was OUTSTANDING!! The back deck is awesome. Make a bee line to sit back there- very nice! The owner was very friendly and seemed to care about his customers!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9fAXIUKpyd7K12_udKs1Qg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Deck out back is a very nice place to sit and enjoy your dinner!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/9fAXIUKpyd7K12_udKs1Qg/o.jpg"
      },
      {
        "img_id": "6S1TOP1RsPt-mwyyhk8XoQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Greek salad was very good!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6S1TOP1RsPt-mwyyhk8XoQ/o.jpg"
      }
    ],
    "user_id": "F-QV5_FbMJte5fDoPaxvdA"
  },
  "lW-692dCu8xnBWso7MA8jA": {
    "date": "9/16/2014",
    "text": "As usual, great food, reasonable prices.  They accommodated our large group of 14 with ease.... Oh,  I almost forgot...  And this was most irritating...  They automatically add gratuity to the checks of 20%.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V23Dtman8oXpyLFqVGmdTg"
  },
  "v7giicRtvQbC1R25l5tnaA": {
    "date": "4/10/2016",
    "text": "Had a hankering for Italian today and decided to pop into Bella Fresco...I was starving so I needed something quick and relatively inexpensive.  I was greeted by Tanner and realized it was not a quick serve restaurant.  I didn't want to sit around & have a long meal as its only me and I wasn't going to be spending much.  Tanner said \"it's all good...I'll seat you in my section\".   Then I wanted to know if the food would arrive quickly because I was starving!  He reassured me that the food would arrive quickly and it did! The eggplant parm was delicious!  All in all, a great experience due to the service that Tanner provided!  I was so impressed by his genuineness.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "taMQ1L2SQ_lYWVq-lJGPaw"
  },
  "EQyQBUmJGHXCABI9KZzIng": {
    "date": "7/27/2014",
    "text": "I had never heard of this place but bought a Living Social coupon after looking at the menu.   I was greeted when I walked in and the staff was SO friendly. I placed a to go order and the manager (or maybe owner) offered us complimentary drinks while we waited. Then they let me sample several flavors of gelato. YUM!!!   I had an omelette, tried the BBQ chicken pizza, and chicken/shrimp skewers. Very large portions and great quality of food. VERY pleased with the amazing service and great food. They have a nice, personal touch and make you feel like they really care. Definitely will return!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AATE8wO7T71i3Fb1FLV0SQ"
  },
  "5w2p1FDbryy4q07SYlQtJQ": {
    "date": "3/27/2016",
    "text": "They have a good atmosphere and the Gelato is amazing but the lasagna did not have any flavor and we were charged $2.99 for 4 pieces of Yuca that wasn't worth the price.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3UWZOT87eixjj4oWEeBF1w"
  },
  "Be1UL8kAwgFd69RG24cjgQ": {
    "date": "5/8/2013",
    "text": "Just opened a week ago. Very friendly staff and nice atmosphere with a cute patio out front and a deck in back. Little lounge area inside. I had a taco salad which was pretty standard. The gelato was some of the best I've had in the U.S. and I'm a huge gelato snob. I asked and they do rotate flavors so will be back hoping for cantaloupe and will give another menu item a try.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "bRHlti8afQPHHKalGAAgag",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bRHlti8afQPHHKalGAAgag/o.jpg"
      },
      {
        "img_id": "OF9aVgANr0gYnuA5p06pwg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/OF9aVgANr0gYnuA5p06pwg/o.jpg"
      },
      {
        "img_id": "PaXkdxdFi_hGPGcJE4grwg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PaXkdxdFi_hGPGcJE4grwg/o.jpg"
      }
    ],
    "user_id": "qWFc8k7e61RmCJL2xQmWRA"
  },
  "QmW8AUj6M4XoVmDNnoHbvg": {
    "date": "12/7/2015",
    "text": "Got take out pizza the other night.  Just Eh.  Honestly, for the price, dominos or Papa John's would have been better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pR3V7xhhn-SjksPInLseCQ"
  },
  "Sk5oQ4dViymT94KN9tlqjw": {
    "date": "5/7/2016",
    "text": "Service 100%!!! Handcrafted Cocktails 100%!!! Apps & Food 100%!!! Gelato 100%!!! It's a very convenient location in uptown and close to work so I'll be enjoying a few cocktails and appetizers at least twice a week!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KKdwyXyxb7TF0OXobs4Eog"
  },
  "i-_Q2pllaTys2_Y0yvEhdA": {
    "date": "9/13/2016",
    "text": "I've been here twice and neither was enjoyable. The last time I went it was incredibly crowded (which I thought was a sign that it must be better). Took forever to get my food, service wasn't very good. Food is overpriced and lacking in flavor. Not worth your money.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MUstjMtF_bzk5mreUsjE2A"
  },
  "20yr0Yg0g_7a24K5t4S78Q": {
    "date": "5/10/2013",
    "text": "This new addition to the Arboretum is certainly welcomed!  I am offering a solid 4 stars strictly based on the Gelato.  It was AWESOME!!!  They had so many different flavors and I love the generous samples they provided.  I ended up getting two flavors in my dish--Pistachio and Almond...heavenly...vibrant flavoring, creamy, etc.  Well Done.  When I first walked in to this place I was underwhelmed.  There were all different stations (gelato, pizza, salad/pitas, wine/beer)...it was reminiscent of a Chinese buffet...just a lot going on.  But it was easy to figure out and everything made sense after I walked around for a minute.  I ended up trying one of their pita wraps to start.  They have a little make-your-own station for sandwiches and salads.  It was okay.  Everything was pretty fresh.  They grill the chicken right in front of you.  The chicken before it was grilled looked a little more like a rubber ducky from my nephews bathtub but I tried not to dwell on that.  Once the wrap was stuffed with all of the goodies I selected, it was pretty decent.  I also opted for the cucumber salad on the side and that was pretty good as well.  I think this is a great new addition to the Arbo...they are right by Akropolis so they have their competition cut out for them but I think they will hold their own.    The service was friendly and you could visibly tell who the managers/owners were and they made sure everything was being handled properly.  I would advise coming here for lunch as the wraps weren't very filling OR to just get the Gelato because that was crazy good.",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 4
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "fXmyIczosRKSoeHUvxCzkQ": {
    "date": "5/19/2013",
    "text": "I am basing my 5 stars strictly on my experience in coming here just for dessert.  We had just grabbed a quick bite to eat at Akropolis and decided to wander down to check out what had taken the spaces vacated by CoffeeWorks and Ben & Jerry's.  I was excited to find out that it was a Gelateria.  And yes, they make their own here and tonight had at least 20 flavors on hand.   Of course, all of the flavors looked delicious and I must have tried at least 10 of them before I settled on the Mascarpone.  It was flavorful, rich and creamy - just as it should be!   After we ordered our gelato, the owner also encouraged us to try a sample of their ice cream.  It was good, but I was more excited about the gelato since there aren't any other gelaterias in the area.    While we were there, we checked out their menu and they have a pretty good selection of salads, pitas, sandwiches, etc. at reasonable prices.   The place is open, clean, and welcoming.  The owner and employees that we encountered were very friendly and helpful.  I look forward to going back to try more of their menu offerings.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 8,
      "cool": 2
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "XmmHVal-2-LPwK3ZwWinVg": {
    "date": "4/5/2017",
    "text": "Ordered humus for the appetizer and it was very good.  Asked for soft pita instead of the hard chips.  I ordered chicken parmigiana and it came with side of spaghetti.  The chicken was slightly warm and with no taste at all the spaghetti was hard and the sauce had the taste of a can.  I stopped eating and went back to the humus.  When the waitress came by she asked if I did not like the main course and I said no.  I told her I did not want it and asked for a box for my humus.  She brought my bill back and said that they had taken off 50% I paid it but told her to tell the manager I was not going to take my main course and I should not have had to pay for a meal I was not going to eat as I had taken only three bites just to make sure I was not missing the tasty area.  I will not return of course and I do not recommend this place at all.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y-mbqh1FcvGq1ltwhx6meg"
  },
  "TFvMTQe3F-fC-MCwwxEE5w": {
    "date": "12/2/2015",
    "text": "Came here for lunch one day on a saturday. We got sat right away but waited a while for someone to go up to us. Probably waited about 5 mins. I saw a couple of workers standing by the gelato area talking. I made eye contact with a few of them and they were still talking. Finally a server went up to us and asked what we wanted to drink. We gave her our order and ordered the trio dip. I got the bella pizza and my fiance got a traditional sandwich. Dip was good. Pizza was ok and crispy. My fiance wasn't crazy about his sandwich. Service was slow and they weren't even that busy. There wasn't really anything memorable about it.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "ff5jxnhCkAGHhtXIL6-v2A": {
    "date": "6/10/2013",
    "text": "This new spot in the Arboretum has been open for about a month. We decided to stop by for some gelato after dinner this weekend. The gelato is made in-house and they had a great (large) selection of flavors. I had mint chocolate chip and my husband had the Nutella. Yummm!  They also have wine & beer and a pretty good selection of food - salads, pitas, burgers and even fondue. I will have to get back there for lunch one day!  The inside was really clean and bright - maybe too bright for the evening, but hopefully they can fix that so you'd actually want to hang out for a while. They also have a small patio with tables and on Sat night they had live music.   A nice spot to check out after dinner or before your night cap!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "RS5JztShXARj8kDJoDs0-g"
  },
  "eRJwugh-zxKqxFdoXQ15Vw": {
    "date": "9/17/2017",
    "text": "I just had lunch here and the owner treated me so terrible I do not recommend anyone experiencing what just happened. I saw I had a 20% charge for gratuity on my bill. I never saw this ever and when I left I decided to ask the manager Elliot of why the 20% charge if the menus clearly says \"20% will be charged for parties over 6\" and I was just one person. He said that he did that because last time I did not tip! This was totally incorrect because I always tip everywhere I go and the last time I went was approx.. 2 months ago and he totally forgot he was the one who waited on me! I said that wasn't True and he then said \"well it must be your twin sister\".  Totally unacceptable, unethical, an insult to customers and totally discriminatory towards me.  I do not recommend going here because it clearly shows he is so concerned about his employees' tips which may be because he is taking a portion of it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XFMVBOq5uS6L_DtQfQpZYg"
  },
  "DmKum6PL7iWzGKpv-zChGg": {
    "date": "1/9/2015",
    "text": "I was disappointed by our most recent visit to Bella Fresco.  I've been a big fan of this restaurant for several months now.  Although the food was excellent last week I was completely dismayed by the response of the manager on duty about the pieces of what appeared to be small pieces off of a China plate that were mixed into my food.  I brought the problem to the attention of the waiter, whose reaction was also somewhat indifferent. Seeing his indifference I asked to see the manager. I was twice told that the manager said \"It will never happen again.\"  The waiter pointed to the manager who was seated in a booth nearby and said that if I wanted to speak with him I could walk over and do so. I said, \"No, given the circumstances the manager should be coming to speak with me.\"   The manager had the waiter comp my meal, but that is not what I was looking for.  I did not go there for free food; I went there because I liked the variety of the menu and I respected and appreciated what the owners of this locally owned restaurant were doing. I still like the menu but I'm very disappointed in that manager's apparent indifference about foreign material on the plates.  I understand that things happen in kitchens that are not intended. But in this case it is the response of the management, or lack thereof, that is most notable and worthy of comment.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 11,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "Fz8enKs5Q0AHfIbL7MI-FA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Pieces of China I found in my food.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Fz8enKs5Q0AHfIbL7MI-FA/o.jpg"
      }
    ],
    "user_id": "gZYyWghNKlpqUdwXVpeZQg"
  },
  "wFk6u25ku0qlKhQWF3lhKA": {
    "date": "2/24/2017",
    "text": "I have never been disappointed with the food. Always fresh and delicious. My one complaint is every so often I'll get a waiter or waitress who does not want to serve. Tonight, though, my waitress was wonderful and I wish I could have tipped her more. I forget her name but she has a crescent moon tattoo on her chest. You're wonderful and did an excellent job. Thank you for being so patient with us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s3f4HXE5rHkLZRHQ8bgy3g"
  },
  "4OGkI_Pg_AiOAqA27uPzAw": {
    "date": "11/21/2017",
    "text": "We came here for my Daughter's birthday so our kids could have gelato - which is very good.  Really.  Service was certainly adequate and the waitress with whom we interacted was very sweet and responsive.  However, the pizza was terrible; actually my son's words were \"really yucky and tastes like a pizza that was made with goo.\"  Alright, so he's 5, but he's not that far off in his description.  The crust was crisp, but not special at all.  We really didn't like the sauce or the cheese at all and the pizza had a strange odor that didn't exude that of a fresh pie, but rather old cheese.  While I consider myself a pizza enthusiast, I don't think I'm a snob, but there are much better pizza places in the South Charlotte area for sure - and my son (again age 5) said he wished we had just ordered Papa John's.  (Which would have been way cheaper too)",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cDUU1WrPYR4ccs6m7Qn33w"
  },
  "Y-pQJn_LnmW2xICcebtfEA": {
    "date": "12/3/2016",
    "text": "A great place for a date night get away.   Very casual atmosphere and friendly and attentive wait staff.   Will definitely be back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ik4xyl4AijXjdHaOj8sSNg"
  },
  "fVuTh7GeKLcJbEytVSYjOg": {
    "date": "6/10/2016",
    "text": "Wow!  First time at Bella Fresca.  The appetizer sampler for $9.99 was excellent.  My picky wife loved everything we ordered.  Spinach and Artichoke dip was great as was the falafel.  Highly recommend.  Amanda did a great job.  Ask for her by name.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A0R17nyHQ9SiqQjtnsP33g"
  },
  "iUQ5XDORxgvX6HFhDpEgig": {
    "date": "4/11/2015",
    "text": "First time at Bella's. Great experience with the family.  Well prepared food and great service. Definitely will be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z1dDusJCbiYfSEoQASdXtA"
  },
  "Hvok9fiwET0tQZa3fVgk8A": {
    "date": "4/24/2015",
    "text": "Very tasty food, had the shrimp pizza and greek salad (half & half) and cute restaurant.  Ordered for lunch pickup on yelp app and order was perfect and ready for me 15 minutes later.  Prices are good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ysh0b8EGyvGWz8bh1pNIgA"
  },
  "_bCOK2mWwX7djaeiLGDDNQ": {
    "date": "11/5/2016",
    "text": "Love this place! Food is so fresh & delish too. We particularly love the schwarma wrap! Service has always been great. Lee Ann, our server,  went out of her way to help my daughter and me today; she's fantastic! Def recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3DL2CNAX1odDM6bajp_UTQ"
  },
  "Zc8ZPHx7rgT_2DrPymdQQA": {
    "date": "12/17/2016",
    "text": "Had the works cheese steak and it was fantastic. Chris was very pleasant and accommodating. Good selection of beer and wine also. Will be back again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "myimAha7AXC1mOcMWcFmjg"
  },
  "a8ApOYXUFPuP3ZdDsVsbFw": {
    "date": "4/24/2015",
    "text": "I've had dinner here twice and both times enjoyed it immensely. The food is wonderful and the price point is just right!  The hummus is very good, served with crispy pita chips and a few olives. We also ordered the Margarita pizza as an appetizer to share. I prefer a thinner crust but it was decent. We didn't get it on our second visit. The beer and wine selection is not vast but I think there's something for everyone. I ordered the lamb fajita with their lemon rice.  Instead of the Greek salad that comes with it, I ordered the pomegranate salad. My friend ordered the exact same thing. Let's just say, that meal was so good that when we brought our husbands the next weekend, we both ordered the exact same meal again! The lamb is sooooo good! We both agreed that the leftovers we had for lunch the next day were even better than they'd been the night before!  The service both times was adequate but not exceptional. They were friendly but we did have to ask for silverware one time and another time we waited so long for the waiter to come back that my husband went to the bar to order a beer.   I like that the owner serves gelato, it's a nice chance to interact with him. The flavor are great, I especially liked the lemon basil.    We discovered toward the end of our second visit that they have a really nice patio out back. I'm not sure why they don't mention it when they're seating you; it's like a secret back there. We'll be asking to sit there next time.   We will be back, one of my new favorites!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "nobmY4une1GazGBAeDBsMA"
  },
  "Eu7HbFrceLiBkCX0Je6hRw": {
    "date": "6/22/2015",
    "text": "Last night, I enjoyed dinner here with my neighbors. I was so delighted to try their food and it was so yummy!  One person in my party had dined here numerous times before and advised that we would sit outside; the other person and I thought she was referring to the cute little tables out front, but really she wasn't.  There is a really cute deck off the back of the restaurant surrounded by tall trees and lookout onto the SapHa Water Spring!  It is so serene and pretty back there.  The only suggestion that we would provide would be to add large fans, citronella candles to deter the flies, and clean the tables better/remove any particles of food due to the ants.  We really wanted to sit at the furthest table (closest to spring), but there were some food bits on the table and it was swarming with ants.  Also, our table had some crusted on bird poop.  Our hostess tried to remove it without any luck and we ended up putting the napkin holder on top of it.  Not a huge deal, but it would have made a small difference.  We ordered a pitcher of the sangria, which was nice.  They make theirs with red wine, diced apples, lemon slices and ice.  Everyone also had water, and I squeezed some lemon in mine.  For a shared appetizer, we had the bruschetta, which was AWESOME!  I was such a fan of the bruschetta.  Often times the bread is hard, but not here!  The bread was lightly toasted.. the perfect combination of crispy and slightly chewy.  The tomato, basil and balsamic vinaigrette was fresh and oh so delectable!    I chose the Chicken Picata for my main dish, and although I don't eat meat, the chef and wait staff graciously substituted the chicken for angel hair pasta!  It had a nice side of crisply, cooked carrots and broccoli, a bed of angel hair pasta sauteed in white wine sauce with mushrooms, capers and artichokes, and some long grain moist lemon parsley rice white shredded carrots and kennels of corn.  I had snacked a bit before coming to dinner and ended up taking most of my meal to go.    For dessert, I ordered a medium sized portion cup of Biscotto, so flavorful and creamy!!  I also tried the Pina Colada, loved the coconut and fresh taste, the Pink grapefruit, which was tart just like the fruit, strawberry cheesecake, which wasn't much of a fan.. I think it was too airy like whipped cream and strawberry syrup flavored.  I ended up eating my entire portion of Biscotto when I got home.. I just couldn't stop, it was so delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "VEZ1xccnoUhIN0Sm91JV0Q",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. My entree",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VEZ1xccnoUhIN0Sm91JV0Q/o.jpg"
      }
    ],
    "user_id": "Gb9Y_f1xslY1mDvvHBXaLg"
  },
  "V9uAAYywmQ9uJpuSD_QVDg": {
    "date": "9/5/2016",
    "text": "Great quality; Service and food high marks; great family setting; has family restaurant/community feel. Plus gelato to top it all off-jwill be a regular spot for us!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1j5iNd0RBXHxTaxqOftxWA"
  },
  "UkpyrS8jBgk8yM_LrrD8ww": {
    "date": "7/5/2015",
    "text": "Excellent entrees,  service,  and gelato!  We were visiting daughter who lives in Matthews.   We like to support local businesses,  so after a mid-afternoon snack at a local brewery, we had dinner at this little gem.   The roasted red potatoes were unbelievably delicious.  Reasonable prices too!   Chris, our server, was great.   He was patient as we studied the extensive menu,  very attentive without being intrusive throughout the meal,  and then offered suggestions for gelato choices.   There are so many flavors!   I love caramel,  and they had at least 3 caramel varieties.   He said the popcorn caramel was very good,  so I took his advice.   It was perfect!  Husband had the lemon,  and daughter had the peanut butter.   If daughter doesn't move west,  we WILL be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wEUpePEtcH1o6ZDRc3eAOg"
  },
  "ZCFbhaTYZ447petNxqMujQ": {
    "date": "10/29/2015",
    "text": "Bella's is an ok place, the food is ok, and the atmosphere is similar to a cafe like place. It is a place you would go if it was across the street and you were too hungry to drive. This is not to say it is bad, but there are so many choices nearby that you are literally left wondering, why would I come back here. The gelato is the answer, this the third star.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9ZWLeEW9C1Z06TGbS8BuFQ"
  },
  "8DdefP2JSPD_W57bv9XkXw": {
    "date": "8/29/2015",
    "text": "Gelato, was great, almin the waiter was excellent, how ever the food was extremely dry and Might be old as well, the egg plant Parmesan was really dark, my father had chicken Parmesan was dry as well, The Gyro plate that I ordered was extremely dry and just a few pieces, and the portion was really small I asked for a side salad came with no dressing, fries was very ok, I don't believe in returning my food or ask for my money back, but I do believe in supporting small businesses, I hope they concentrate on the quality of food, the two star does not or is not for the gelato or the service but it's for the food quality",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "49ULSEKTGgi7nVhlTFzmQQ"
  },
  "lZ5ZR3Ar50rV8d6gqURsaQ": {
    "date": "7/19/2015",
    "text": "Excellent food, service, atmosphere and of course the best Gelato (on par with what we have had in Italy!) the owner Mosen, manager Juan, Mosen's son Elliott all absolutely wonderful!  The diverse menu makes it a place for all but don't pass on the gelato!  So many flavors and all out of this world, even sugar free gelato.  Be sure to taste them all!  Don't pass this place by! Live music is an added treat in the evenings on the weekend!  There is even outdoor seating in the back which is the best kept secret. Enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qeNwUP2auhofrrVH_u9hpw"
  },
  "dcoD0jYRaDf8njiQ-YZk_Q": {
    "date": "6/21/2014",
    "text": "Never actually had a chance to eat because we were seated and then ignored. After about 15 minutes we got up to leave without anyone even taking our drink order. As we were leaving 3 servers just stood there and stared at us. Keep in mind the place was only about half full... Will never go back. Very rude.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgDkxKp8zVE_o6BanytUUg"
  },
  "ic0dxkJCrVmRxWqWrUj1qw": {
    "date": "8/29/2014",
    "text": "Food was delish, dining absolutely delightful. We were on the waiting list for another restaurant nearby and got tired of waiting. Walked down and discovered this place. We dined on the back patio. So nice!! Food was great. We all loved it, even kids! Great wine and dessert list too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vph-tmjh9ib4DPGtGfZyVw"
  },
  "EPWlxDHbTyiWPULkCV3oDg": {
    "date": "7/22/2015",
    "text": "I am sure that their food is fantastic but their customer service is horrible. We wanted to try this place because it was right across the street from my house and it was my mother's birthday. I walked in and this gentleman was mopping the floor. Instead of coming to the front to greet me, he stood with mop in and his hand and looked at me for a couple of seconds. He gave me that \" you are bothering me\" look. I asked him if he had a table for two? He replied, you can sit there I guess but I am mopping this section. Wow, what a way to welcome your customers, especially for the first time. I turned and walked out because I will not spend money at a restaurant that does not want me service. There are a ton of restaurants in the Arboretum that would be happy to take my money. I was really hoping to have a nice dinner to celebrate my mothers birthday but we ended celebrating with a restaurant that wanted our service and whom was pleasant.",
    "rating": 1,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VVLHIxJPP6_yREVf444sg"
  },
  "w4IHl-RDkqqO7T4uk9_hfQ": {
    "date": "3/14/2014",
    "text": "You can find countless reviews on their gelato and so many are spot on about how wonderful it is!  However, there are few reviews on the food itself and the wonderful staff.  Every time I have been in, I've been greeted like part of the family and I love it!  The staff is more than just polite and friendly, but warm, welcoming, and full of personality. It only gets better from there.  The food is fantastic; from the spinach  artichoke dip, to the best mac and cheese pizza I have ever had.  If you are a soup person, who likes it thick and flavorful, Executive Chef Tas has you covered with his broccoli and cheese!  The desserts are, of course, fabulous.  Along with the marvelous marscapone gelato, the tiramisu is light and absolutely heavenly!   Now, I just can't wait to try the breakfast. I saw the picture of the Belgan waffle covered in gelato and strawberries and I have to go back for it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pto5lnTbPd4m9U0O_MYIjw"
  },
  "XDhrbyquXPHXmaQ1dwSrSA": {
    "date": "6/5/2014",
    "text": "Delicious!!! My husband and I went here for lunch. We ordered the gyro and the Mexican Wrap. Both were fabulous. Finished off the meal with their award winning gelato and I must say, it did not disappoint. Their patio was beautiful- definitely not something you would expect to see in the arboretum. Very quiet and private with a nice view of the pond. Safe to say we will be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vvGd4EjsAyy07hKIwin2lA"
  },
  "XaUuzGFKsb4ybuHzSc_9Jg": {
    "date": "2/24/2014",
    "text": "Ate here several times. Panini's and salads are so good. Always busy, food comes out fast. Great place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGhiu_rsCHw8O1OhLArgWg"
  },
  "S0PWBVxKi4QUHzSB66v-YA": {
    "date": "1/7/2015",
    "text": "just tried to place a delivery order and was told there is a $25 minimum - really?  interesting that such a bogus rule is stated nowhere either on this yelp page or on your website but was arbitrarily thrown at me AFTER i had already given my entire order to the person who answered the phone.  i ordered $15 of food and would have been happy to pay a delivery fee, not to mention generously tip the driver.  it is 20 degrees outside and i am home ill.  thanks for nothing - now rest assured that you will never get my business.  over what probably would have amounted to about a $6 deficit when all was said and done...unfortunate.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "NtOnBptt_e3AgRnWtB4THw"
  },
  "VnAPe17p1Ud9AKknXF9kmw": {
    "date": "12/8/2014",
    "text": "Oh boy!  We couldn't get in Cajun Yard Dog Saturday night so we tried this place. First clue should have been that there were plenty of empty tables. The service was painfully slow and the food was terrible. I got Greek   chicken with lemon potatoes.   The chicken was soooo dry. No flavor, no sauce, no pan drippings, it was horrible. The potatoes were diced so small that they too very over cooked and dried out. I had to fight to get them on my fork. The cucumber mint salad had no taste. I left 90% of my food. Husband got chicken piccata. We've never seen it look like that before. And again, no taste. The man that appeared to be the owner or manager was more interested in carrying on a  30 minute conversation in Greek with another associate and a female that he left with then checking to see why it took so long to get our food and why our drinks were empty. As soon as he left, the entire attitude of the staff changed. The associate he had been having the 30 minute conversation with sat on a table in the Gelato area. This is a table that is used to prep food on.   We should have just gone to Akropolis where the service is just as bad but at least the food is good.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IkD1o0hAN5SzmOZRM6yjIA"
  },
  "TIOFKxl6Q7ZDlAB1DwVrRA": {
    "date": "6/15/2017",
    "text": "Never had a waiter (Eliot) ask a customer to step outside and fight because of no tip. Will never go to this place again. Never had this kind of experience before.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "afgdPSQuXoUDOaDc3WApTA"
  },
  "3saCVJxe3bAEZ0NZhDFflQ": {
    "date": "6/19/2017",
    "text": "Just had the most ridiculous encounter here.  Not only was my salad very small for the price but the server Elliott was confrontational. Asked to speak with the manager and he told me to leave.  I'll never go back!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "wAxSpmDusSCbKusO-aBGpw"
  },
  "Kp70gtZJ-N7M-oFop5CyYA": {
    "date": "4/13/2015",
    "text": "This is the definition of a hidden gem. I LOVED Bella Fresco.  You feel like family when you walk in this place. Everything from the color-changing backlighting on the sign to the people yelling out orders in Italian...reminds me of Italy.   Anyways, we were seated promptly by the gelato area (to the lady's fortune and my wallet's misfotune) and given menus. I ended up ordering the Shawarma Wrap while the lady ordered the Vegetable Extravaganza panini. Both were very good! Great price for a weeknight dinner as well!   The night ended with the lady going up to the gelato counter, and the guy manning it asked \"What would you like to try?\" and without skipping a beat, the lady answered \"Everything!\", to which he responded \"Everything it is\" and proceeded to give us small samples of his personal favorites.  Guys. This stuff is good. Real good. Fresh, homemade gelato, every bit as good as you get overseas. And pretty reasonably priced too, for that matter.   Anyways, we had a great experience there and will definitely be returning. Bella Fresco has won us over as a great, convenient, and cheap meal.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "mpjJ8ccIgYXrw542lg878A": {
    "date": "8/25/2016",
    "text": "I have 3 tries here. 1st time they were just opening and so it was confused but my sandwich was ok. Second time was ok, but a little pricey for what it was. Third time, a to go order, was not packaged correctly and got Alfredo sauce all over everything except the pasta. Including the car. Really don't know how someone could pack a to go order so carelessly.  Bottom line the food is OK, but this restaurant just doesn't make it past anything more than ordinary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "EdtoporDVKUNAvG56LKwTQ"
  },
  "B97_mSDF1ARH4PC6CnNCog": {
    "date": "11/22/2017",
    "text": "The food was not very good, the pizza looked and tasted frozen, although the service was quite nice but definitely need more waitors/waitresses.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BijvJBvLAmaZDi4HOm6yPQ"
  },
  "-PryIXEtPUO5PfDztLPEJA": {
    "date": "4/27/2018",
    "text": "The gelato bar is great but the food is mediocre at best. Wines by the glass were very over priced for this type of restaurant. We have been here in the past but will not return after this visit. 7pm on a Friday and the place was not busy at all, that is very telling.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RldEUtBadrnz06W44DXZZg"
  },
  "kF2ALq7suHfYeVfWR_gJtg": {
    "date": "1/23/2018",
    "text": "Delicious and creative! Wonderful service!! We'll be back!!! Eggplant parm was loaded with flavor. Kids eat free Monday through Thursday! They have wine and gelato!!!! Perfect place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "rfXbqCcI324coLFm9Z1JwA"
  },
  "PcecJ_5OKLosU9dgkNh43g": {
    "date": "7/13/2016",
    "text": "Wow! I went in with not high expectations, but was extremely please with my visit; I had the falafel and the gyro, everything was delicious; Lee Ann, was a great server and made my lunch very enjoyable. No more showmars for this guy! Found my new favorite place for lunch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "IXDXUiKE1mAd5wRrNd07ew"
  },
  "ek0ljDWn02WKL4d7Ay7joA": {
    "date": "10/6/2014",
    "text": "The food is delicious, the portions are generous, and the prices are great! What more could you ask for?  This place is a gem.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "gerb5AR1m8HTKLaERujvoQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gerb5AR1m8HTKLaERujvoQ/o.jpg"
      },
      {
        "img_id": "uM1MD--Oz2iKYZhZTZRSkw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Cannoli. Delicious.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/uM1MD--Oz2iKYZhZTZRSkw/o.jpg"
      }
    ],
    "user_id": "fYdcncFR99K2cuwGi5TqAQ"
  },
  "DYw_VzNdFZlqW6E95mL6gA": {
    "date": "3/26/2016",
    "text": "Seated quickly with fairly attentive service. Probably more like 3 1/2 stars since pizza was a bit overdone. Food tastes ok overall.  Open kitchen concept. Clean with nice selection of gelatos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tOZRcZ7ERo2MS8odFBfQwg"
  },
  "wwKh5qciSR_GjQdQLpa1Og": {
    "date": "7/24/2015",
    "text": "My husband and I went here tonight for dinner for the first time. We loved the variety of items they have on the menu. Our food was delicious too! I got a Greek salad and pizza and he got a gyro. We highly recommend sitting on the back deck!   The restaurant as a whole was very clean and the staff were very friendly and attentive. We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "c-RYCXeQmNDhX5SiMAp55w",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Back deck",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/c-RYCXeQmNDhX5SiMAp55w/o.jpg"
      }
    ],
    "user_id": "tZ-46m2ckE_d7rVs0sXnXg"
  },
  "lAc7uLeb2POqhqC6NHK0bA": {
    "date": "5/22/2017",
    "text": "The gelato is homemade and has incredible flavors with things like basil, rosemary, and all the fresh fruits you could want. Their food is consistently good and have a large diverse menu to make a crowd happy. One of the best places in Arboretum.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r5lBLq4TC9lx2XpR-Ahkcg"
  },
  "PARzW7xd0pKYVJZn3a-xnA": {
    "date": "8/2/2014",
    "text": "Good food followed by great gelato!!!   We loved the Veggie Extravaganza Panini and the fries were perfect. We tried the pistachio gelato and snickers gelato - it was hard to choose a favorite.   The service was good too. Will be back for more yummy gelato!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ZsU0Wo6-0EtAqipWZ1Damw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Veggies Extravaganza Panini was good as always",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZsU0Wo6-0EtAqipWZ1Damw/o.jpg"
      },
      {
        "img_id": "Fo2AoXxDADucI6Yr68hRrA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Barbecue Pizza with caramalized onions",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Fo2AoXxDADucI6Yr68hRrA/o.jpg"
      },
      {
        "img_id": "7rTjn_WXDxNFVTtRGbN7hA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Tomato soup - portion size very small at $3.49",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7rTjn_WXDxNFVTtRGbN7hA/o.jpg"
      }
    ],
    "user_id": "QjMc16MFIeytPROXQRsZgA"
  },
  "WEtcr249jjhlZrUC9DE6Vw": {
    "date": "1/23/2014",
    "text": "I had not heard of Bella Fresco Cafe, even though I have been to several other restaurants in that same shopping center, until I saw a coupon for it on Living Social.  So we decided to check it out on a Friday night a week ago and it was not crowded, we were immediately seated.  After looking at the menu, I went with the Steak Panini and Kevin went with the Abuelo.  The Steak Panini with lamb was very tasty, loved the meat in that along with the onion and peppers.  My only complaint is the cheese, they had american cheese with it and it just tastes cheap with that kind of cheese.  Come on, you can get a nicer sliced cheese to put in that panini!!  Kevin's sandwich was much better than mine, it had a lot of flavor with the mozzarella sauce and pico de gallo.  I would get that one the next time.  My other complaint is the sides.  The sandwiches come with house made chips, but they are not good and over cooked.  You can choose another side, sure, but that is an additional charge.  Kevin did get the fries and they weren't anything worth the extra charge.  Maybe will try a different side next time, but so far the sides are not good.  Of course, afterwords we had some gelato and it was fabulous!  They had no problems giving us samples of each one until we found the one we loved, great customer service.  Will look forward to going back for that this summer.  My overall thought is this is a 3.5, yes we will be back, but it won't be our first thought or we probably will not have a frequent return visit.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "hXQHu4Isp1wZYO6A-I0zQg"
  },
  "rEboWXoLGrBiFIKGBe4UVw": {
    "date": "4/29/2016",
    "text": "We stopped in for lunch and were delighted! The service was very friendly and food was so good!  We started with a spinach artichoke dip which was good it had several large chunks of artichoke in it.  For our meal we had a chicken philly (pretty good) and the Mediterranean fajitas (great! Yum). The rice side with the fajitas was great and the Greek salad was good as well. The tiramisu was delicious as well! I would definitely recommend anyone in the area to try it!  **This was our first visit and I'm sure there will be more to come!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "n2FPGVPXJ2YLohR7sq93Zg"
  },
  "i1kuJyDUaYP7k6NzTZOFxg": {
    "date": "3/9/2014",
    "text": "***Gelato Review Only***  I'd bookmarked this place not to long after it opened but hadn't had a chance to make it in until today.   I was greeted  when I walked in, and asked if I was dining or just getting gelato...and I smiled and said \"gelato only please\"! He laughed pointed me in the direction of the gelato counter. A quick walk over to the counter and I was greeted again by a super friendly man who asked if I wanted a sample. I started with the sorbet, and then no kidding....he gave me a sample of everything in the case!!!! My goodness.  When I was thoroughly confused because each one tasted better than the last I finally settled on the Vanilla Turtle. It was ridiculously good!   I highly recommend a visit. I know I'm certainly looking forward to making this place a regular sweet treat for the Summer.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "YZUnT9XDzh2VvyQ0jm3vaA": {
    "date": "5/7/2014",
    "text": "I stopped by here to pick up something small for lunch. It was completely a random choice. And in so glad that I stumbled in here. The lamb pizza seemed pretty cool. I asked he waitress and she have it good reviews.  It was amazing!! The pizza was topped with tomatoes, feta, olives and lamb. It was a good portion size especially for the price (6 bucks!) they didn't skimp on any of the toppings either. I would eat 1000 of those! It's safe to say that I will be going back here. And very soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yAXJTfiAjxdIARUrrXeaYQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Lamb pizza. Order this!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yAXJTfiAjxdIARUrrXeaYQ/o.jpg"
      }
    ],
    "user_id": "etyGh4GyR-lzPuvjlHDkIw"
  },
  "xESuO1eTrhJFh0LBwn3txQ": {
    "date": "8/12/2017",
    "text": "Ate here on a Saturday afternoon. Party for two. Pitcher of Sangria, two Greek salads...one with chicken, one with lamb. My chicken was delicious and my friends lamb was even better. The gelato in the freezer looks amazing as well but we passed on it. They have a great patio outback but we did not choose to go there because it was so hot today. Will be back for sure. Yum!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mQpij6tTrAfQJOTjpb-1ow"
  },
  "VSoo5ff5hxnBrPz2ZQnxPA": {
    "date": "2/19/2017",
    "text": "I guess I should have known when the description said they serve three types of cuisine....Italian, Mediterranean and Hawaiian, hard enough to excel at one, they're trying all three.....anyway had a pizza, nothing special, run of the mill pizza.... Somebody had a burger, same thing, frozen patties, run of the mill..... Somebody had a chicken skewer plate with Potatoes that were super over seasoned, chicken was ok.... Then we got the gelato (seems like their claim to fame),  and even that was nothing special.... Anyway, somewhat edible, but definitely a one and out visit.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "USJSmxVWL8OBT78Wzg2v0Q"
  },
  "Xyw6dtuiBJaDsWsKWzdHGg": {
    "date": "3/30/2017",
    "text": "Loved the food, the service, the price, the gelato, the outdoor deck, and the availability of beer/wine. We plan to be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xshvBO5towaItOCGRG7sXA"
  },
  "HPpi6uInLHXpZUxGTTT5HQ": {
    "date": "1/26/2018",
    "text": "This was really bad, maybe the worst I've experienced in a really long time. I ordered some delivery through one of those 3rd party services because I decided after a difficult week I deserved some lasagna. My companion ordered the chicken piccata, and together we got the spinach artichoke dip. Honestly, all of this food would have been 10x better coming from a chain restaurant like Red Robin. In fact, I wish we'd have gone there instead. And that pains me, because if there's an option to support a small business, that's the way I'll always go.  - The dip was awful. It was cold and congealed and completely tasteless. It wasn't so much a dip as it was a solid mass of stuff. It was totally inedible. - The lasagna was disgusting. It was a heap of greasy ground meat with a pile of cheese. It was over-salted and reminded me of hospital food. Seriously, how can you get lasagna wrong? - The chicken piccata was also quite interesting. The rice was pretty tasty; it was the lemon rice, I think. The chicken was tough. I mean, seriously tough, like, break out your steak knife tough. The meat itself was tasteless in the center, which implies it was just defrosted and cooked with some sauce dumped over it. Again, cafeteria food. There were mushrooms in the sauce, but they had dark spots all over them, i.e. the mushrooms you'd throw out at home because they no longer look fresh.   The best part? Both of us have spent a good deal of time in Toilet Town since we ate the food.   There was neither anything bella or anything fresco about this place.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "2hii37dkKL4POcu6vh_6EA"
  },
  "i3MTX8GqJ_Sxv_s9NYoUZA": {
    "date": "4/14/2016",
    "text": "After seeing the pictures on Yelp, I thought I was going to a fancy place when my dinner group met here but it's not fancy at all. Actually it's quite casual. It had a cafe / diner feel to it with booth seating, a gellato bar and food prep stations surrounding the back half of the restaurant.  The menu prices are decent. They have a good wine list and a small selection of craft beer. The food menu consists of Greek and Italian dishes. You can get an entree for $10!   My friend and I shared the fallafel appetizer and a bottle of Chianti which were both delicious. We then couldn't decide on an entree so we shared the Lemon chicken and the Chicken Piccata. Both were good but the Lemon chicken was the star of this trip. Such wonderful flavor that danced in my mouth.   The entree portion sizes are just enough - not huge like many places which make you think just one more bite and then you finish your meal eating enough for 2. But here it's plenty of food for one person and doesn't stuff you. Because you have to leave room for gellato.   They have several flavors for gellato from raspberry to peanut butter. My friend went with the Reeses and I went with the tiramisu. Both were delicious and creamy.    The worst thing about here is the service. There were a few flaws that made me consider dropping this to a 3-star review. We wanted to share appetizers around the table but had to ask for plates to share. They should have come out with or before the appetizers arrived. 2nd, we asked 3 times for refills on the water glasses but it never happened until our server was standing around staring like he needed to do something and saw water glasses were empty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9TXdSgXz_llbi9VgIbIn_A",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Lemon chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9TXdSgXz_llbi9VgIbIn_A/o.jpg"
      },
      {
        "img_id": "0bK7PC6MUV-Ac0LrbuNoYA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Chicken Piccata",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0bK7PC6MUV-Ac0LrbuNoYA/o.jpg"
      }
    ],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "O2SFLxw3wFdDBfdy0VZIdQ": {
    "date": "8/25/2018",
    "text": "Very average if not below on the experience with this place. The food is not great nor bad, just fairly boring. The lemon chicken had some flavor, but the actual cut of chicken was fatty and very tough as others complained about.  The ambiance reminds me of a diner that has been attempted to be dressed up. They do have a lot of gelato choices and unfortunately a very loud compressor powering the gelato freezer, which is right next to the tables. The staff had the music turned up to cover it, but it just made for a loud experience. I would seek food elsewhere, especially Italian as theirs much better options a few places down.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JnRmWtDRd8CJSvDYz1YS1w"
  },
  "PFsgbEAa2uN2xm3UFEENZg": {
    "date": "1/14/2016",
    "text": "I ordered their veggies-extravaganza panini, and swapped out the side of kettle chips that came with it for the cucumber-mint salad for an extra $1.99. Both were very good and I will def order them again!  Likewise, they have plenty of other dishes to serve my diet needs, and even their unsweetened tea was good. Most restaurant unsweetened tea tastes like colored water, but their's actually had flavor to it, and I definitely do NOT add sugar or sweeteners to my unsweetened tea.   My waiter, Christopher, was very attentive so therefore, their service score is very high in my book.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "I6FBijVl0KOxDZkiGuq_uw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/I6FBijVl0KOxDZkiGuq_uw/o.jpg"
      }
    ],
    "user_id": "8okt1nl-g2RL3ylWoqj4tA"
  },
  "mu52I4nI0gwrghCasOAleA": {
    "date": "7/14/2018",
    "text": "Bella Fresco is another arboretum gem. Great wraps and paninis and of course gelato! Do yourself a favor and try the Saganaki Flaming cheese - it's amazing! They do pizza and Mediterranean cuisine if you aren't in a sandwich or wrap kind of mood. Another great spot if you are in the Arboretum area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "9tc6JLnI2QNFVGAKOEF_Hg": {
    "date": "12/23/2016",
    "text": "Great service. Best cannoli since my visit to NYC! Seriously!  Ample Greek Salad, really good mix of fresh veggies.   Cobb Salad delicious. Both salads had big portions.   Greeko Wrap with lamb was tasty & fresh.   Ambiance is casual, with music playing and some sports on tv screens. Can be a bit noisy due to music.   Great value for the price!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "PhfyM1XKCE8-13A6sc-mrQ"
  },
  "WA-CCn_zm14zZ_7P5aqOjg": {
    "date": "2/19/2019",
    "text": "I recently read a nice review on the restaurant and decided to try it.  The pictures of the panini's looked fanstastic.  We walked in around 11:45 and we were the only customers in the restaurant.  Not a good sign!  We both ordered paninis.  I tried the Cuban and my husband ordered the Cajun Chicken.  I really thought the panini's would have a nice crispy outside but it was served very soft with grill marks.  Both were just average.  Nothing special about this place at all.   The one and only waitress seemed very bored.  When we left there was one other party in the restaurant at peak lunch hour.  When I looked at other reviews when I got home I noticed that several years ago the reviews were excellent but in the last year or so the reviews have gone way down.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JNnI-QYMYfduHsI2iK6Umg"
  },
  "u5Gk5Xkmkl6YumUBdmNU3w": {
    "date": "8/4/2016",
    "text": "Just came for coffee and desserts to celebrate.   Banana split, mango gelato, but one wanted the falafel instead. No one was disappointed.   Even the coffee tasted fresh. The falafel was goodin flavor but the consistency seemed off; bit too soft.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0ruUTwLYRDyLmfkRNZ8zZQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. My loves",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/0ruUTwLYRDyLmfkRNZ8zZQ/o.jpg"
      },
      {
        "img_id": "VCeB5PHlU6dXiasCZOac0w",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Mango gelato",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VCeB5PHlU6dXiasCZOac0w/o.jpg"
      },
      {
        "img_id": "er09JwoGLKDyBnkwNNUkGQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Falafel with tzatziki",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/er09JwoGLKDyBnkwNNUkGQ/o.jpg"
      }
    ],
    "user_id": "P14bqC_Ynbp8O3tLePRKSw"
  },
  "abYtMhLUqop34bLZkBR6oA": {
    "date": "12/7/2015",
    "text": "We've been to Bella Fresco twice now (in about a month's time).  It's tucked back in the corner of the Arboretum shopping center.  The first time, we sat outside on their secret back patio (it's not actually \"secret,\" but we had no idea it was back there!).  It's situated on a deck patio with lights all around, and it's pretty quiet back there amongst the trees and water, unless there's a loud group nearby.  The menu is pretty extensive and has a variety of options (I love variety!) so there's surely something that will appeal to everyone in your party.    The first time, I ordered the Cobb salad with chicken shawarma.  Where else can you find that?  It was delicious, flavorful, and fresh.  The second time, we went back to try their calzones. They were very big and good, too.  We look forward to returning and trying one of their many other options: pita wraps, philly cheesesteaks, Italian entrees, burgers, etc.  There's so much to choose from.  I just noticed they serve breakfast, too, so that's something we'll have to try as well.  And I haven't even talked about the fresh Italian gelato that they serve.  We've always been too full to have any after our meals, so I think we'll just have to stop by sometime for take-out!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "tZualszi5oZXnkgVPa6wMg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Secret back patio",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/tZualszi5oZXnkgVPa6wMg/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "h0XDObi9Wg7LDh29ox5kSg": {
    "date": "7/7/2016",
    "text": "Delicious food and friendly service in the arboretum! From the lamb pizza to the pomegranate salad, I kept being amazed by the tastes of this hidden little restaurant.     Driving by I stopped for lunch & tried the half and half special--recommended by the wonderful server Leanne. You can choose half pizza/salad or half salad/panini combo and it was a generous portion, exactly what I wanted. The lamb pizza had tomatoes & feta with nice bite size lamb on a fresh thin dough. The pomegranate salad Leanne recommended & they substituted feta for the regular blue cheese. It had yummy strawberries & nuts & feta with a balsamic dressing.  They have gyros & paninis I will return to taste! Truly fantastic service & food! I always look for a quality meal in South Charlotte area & this is my new favorite!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "CKRfBUqQGaVCYTKN5kDrzw"
  },
  "AY5W5Yj9h94umse8FJ4VyQ": {
    "date": "5/23/2016",
    "text": "Great visit! Sat out on the back patio...gotta ask for it or you wouldn't know. Couple ants but your outside!!! Service was on point even though out there. Had bruschetta app...tons of tomatoes, not too crunchy bread yum. Mixed fajitas (shrimp, lamb, chicken) very tasty, cooked perfect. Warm soft pita bread. Salad was terrific and the dressing homemade. Gyro was so big and cooked so perfectly. Great fries.  Lamb rice tasted like risotto with tender lamb. Food was excellent!! Baklava was great and a huge piece. Gelato was smooth and so good. Will come back !!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KfEls88GPSGFdzfRWjj5Ug",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Gyro",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KfEls88GPSGFdzfRWjj5Ug/o.jpg"
      },
      {
        "img_id": "DaFmWOVeGFX9HrLqXpMR7g",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Cajun chicken panini",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/DaFmWOVeGFX9HrLqXpMR7g/o.jpg"
      },
      {
        "img_id": "UCmc0V1W71ju9SCkONvc4Q",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Gelato...banana pudding",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UCmc0V1W71ju9SCkONvc4Q/o.jpg"
      }
    ],
    "user_id": "oaCl7cv19ZXOSK21Hhh9GA"
  },
  "637O6DFjwTZ3I4MZs5WEGw": {
    "date": "9/3/2018",
    "text": "I like the food here but the service just progressively gets worse and worse. Went recently and had a terrible experience. It wasn't very busy, only 5 tables  including ours, and two servers working. Our server appeared to be the restaurant manager, but I'm not certain. He came to get our drink orders but then appeared to forget about us entirely. Over the course of about 15 minutes I watched him go by and check on another table 3 times. He eventually came back around to us without our drinks and said something to the effect of \"I'll be with you guys in just a moment\", he then went and rang up a customer's gelato and went back to that other table a fourth time. We got up and left.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KoYVtMKA274-FUqvnvfB2A"
  },
  "yxzGNHMzQfF2NIqy1MVMgQ": {
    "date": "7/7/2017",
    "text": "Stopped by for a quick business lunch--nothing too heavy on a hot day. We were greeted warmly and quickly and I immediately noticed how clean the place looked even though it was towards the end of lunch hour.   I had a delicious Greek salad with gyro meat --generous portions and they perfectly executed my request for no onions and dressing on the side.   My lunch partner had a wrap and fries. The fries are awesome!!  Clean, friendly and the food came out FAST!  A great find in a restaurant filled neighborhood.  Oh--and we weren't interested in the gelato but it's made in house and looked amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0wH-hPR6kaWzAIbQIT0SSA"
  },
  "B1SdZWfRvNr2QvjnCP0E_w": {
    "date": "10/19/2015",
    "text": "Deeeeeeeeeeeeeeeee-licious!  Bella Fresco has done a complete 180 in terms of service, ambiance and, most importantly, food in the two years since I last visited.  The dining room has been completely revamped since 2013.  On a Sunday night at 6:00, we were seated in a comfy booth.  Service was very attentive, friendly and helpful (including an inordinate amount of drink refills for 2 thirsty people).    Though TV's aren't the main focus of the room, for an October visit, we were able to watch the Panthers pull one out against the Seahawks (YAHOOOOOOO!).  5 TV's (one giant, 4 pretty big) are along one corner of one wall and were all tuned to football (YAY!).  The TV's are not loud or intrusive and they don't give the space a bar feel, it was just nice to be able to enjoy the games during dinner.  This would also be nice for those who enjoy dining alone.  Onto the food - holy smokes, the food.  Someone had previously posted a photo of the Cubano panini.  Changed my life.  I have never had a cubano and I am sure this isn't authentic because it is served on a pita, but holy crap was it mouthwateringly good.  Tender, well flavored shredded pork with NO FAT pockets in it.  The ham, pickles, cheese, dijon mustard and mayo were perfectly executed and balanced.  I chose a side of mac and cheese, which was a $2 upcharge, but was well worth it.  Cheesy, with a bit of a garlic taste to it.  YUM!  My girlfriend ordered the veggie panini, which she said was delicious, and a side of fries which were crunchy and delicious.  To finish off the meal, we both got gelato.  Knowing how rich and creamy their gelato is, I got a small cup of the biscotti - YUM.  Girlfriend, who had eyes bigger than her stomach capacity got a large with chocolate, pistachio and (I think marscapone?).  She kept putting down the spoon, saying she was too full for anymore, but she worked hard and believed in herself and ate it all.    Amazing meal (I cannot wait to go back and get another cubano, I may go tonight!), excellent service, nice space.  I will definitely be back to Bella Fresco ASAP!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zsZBYWYEmLLs81_f-HHM8w"
  },
  "xFpfRsT9F8MAC4MreId5RQ": {
    "date": "7/29/2018",
    "text": "Came here once for gelato and it was decent so we came back for lunch. Big mistake. First of all the marinara sauce tastes like Prego. The kids meals are all frozen food and low quality...and we found hair inside my daughters chicken nugget. Beyond disgusting. The chicken kebab was dry and over cooked and the Persian food tastes indistinguishable from Mediterranean food and was over cooked and dry and generally horrible. This place will not last if it doesn't improve its quality. The waitress was nice and very apologetic but she can't control how awful the food is.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0UoxoUEm9Jy7PcRPLulYQ"
  },
  "KvnC206pO-2RNC-NicLlYg": {
    "date": "1/23/2018",
    "text": "Amazing service and food  A True hidden gem the new manager is really making this place something special",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8NwrFMMSxVzIUFoPdZMoow"
  },
  "ipz3ouqBcLTpjPZNSijGow": {
    "date": "9/26/2015",
    "text": "We are here tonight for the first time and I was very impressed! They have a large dining area but the atmosphere was cozy and there was even live fault at music.   My boyfriend got the Alfredo and I did the pick 2 with Mac n cheese pizza and the chicken turkey and pesto panini. I loved both of my dishes and he said his easily topped any chain Italian restaurant.  We finished off with a 4oz scoop of peppermint patty gelato which was amazing! They had a big gelato selection to choose from.   The service was great and we will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "EX2YBIzfu-ShJz9XMgtvCA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Mac n cheese pizza",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/EX2YBIzfu-ShJz9XMgtvCA/o.jpg"
      },
      {
        "img_id": "K94RK5-g2e032H44RKPDwA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Peppermint batt gelato",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/K94RK5-g2e032H44RKPDwA/o.jpg"
      }
    ],
    "user_id": "inNnxnl6ZvkWHBiAzkmiBQ"
  },
  "4kldAFl6wAUlgVgNExUSrg": {
    "date": "6/15/2017",
    "text": "Waiter challenges customer to a fight in the parking lot!  Once a week my buddies and I get together for lunch. We are all retired \"old men\" and we choose a different place every week. Today we chose Bella Fresco,in the Arboretum in Charlotte, NC. The place was fairly empty and the only person on staff was a fellow named Elliott who was the Host and waiter. We all had sandwiches and a beverage and unfortunately those of us that had a \"wrap\" found the sandwich to be poorly made. The tortilla was very dry and broke apart as you held it in your hand. We let it go, didn't make an issue over it and ate our lunch. When it came time to settle up, the waiter refused to honor our lunch coupons, saying \" if we always accepted coupons we wouldn't be in business\". He then proceeded to charge us a 20% gratuity on each bill. One of our members shorted his bill by $0.25 and when confronted by the waiter expressed frustration with the poor quality of the food and a 20% gratuity. The waiter Elliott became enraged, calling our friend an obscenity and then challenged him to a Fight in the parking lot saying \" I will kick your a-- old man so come on\". Needless to say we packed up our things and left but not before we decided as a group to never return here again and to tell everyone we know about this. The waiter threatened bodily harm to our friend over a quarter ?  Unbelievable.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 14,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tt1ScohFF5h7w3WwAFwdOg"
  },
  "yxJxk_hGa_c2OhUtppjBhQ": {
    "date": "4/13/2015",
    "text": "Dear Bella Fresca - I think we have a problem - you have so many delicious flavors of gelato I thought my head was going to explode. It's a good thing the \"molto amichevole\" attendant allowed me to put three flavors in my cup. Your Hazelnut - reminiscent of Frangelico, plenty of body and flavor. Your Baklava - wow - honey and walnuts dancing on my tongue. The piece de resistance was your Mascarpone - amazing and simply delicious - creamy and subtle. I am writing this letter from my hospital room because the Mascarpone did in fact make my head explode. No hard feelings, it was worth it. Once I receive my cranial transplant, I'll be back to try Pistachio and Salted Caramel...",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 3,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "RVhCPghJywxYbcB-9VJYBQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RVhCPghJywxYbcB-9VJYBQ/o.jpg"
      },
      {
        "img_id": "OcD-uQlyO7NXKSUhyjvWag",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/OcD-uQlyO7NXKSUhyjvWag/o.jpg"
      }
    ],
    "user_id": "5jJjY5_R06Og56VfjIc66A"
  },
  "fwLvEf3K-wtLdkOhBm8VWw": {
    "date": "11/7/2016",
    "text": "Six of us decided to dine at Bella Fresco.  Our choice was a good one.  Our group had two pizzas, two paninis, one Greek chicken, and one angel hair pasta.  All of the selections were very good.  My pasta was excellent.  Service was very good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "drTMOo4p8nL0pnMNEyat2A"
  },
  "aWxZT5ot5Eznm0o5FEe5nw": {
    "date": "6/24/2019",
    "text": "The environment as soon as you walk in the door is very welcoming. The staff has been very friendly! Everything I have tried so far has been delicious, savory, fresh, and flavorful. Please try the lamb rice, you will not be disappointed. This restaurant seems to suit anyone with a party looking for a variety of items. They have anything from pizza, salad, paninis, and wraps to name a few. I suggest my favorite the philosophy wrap! Also, the back patio is a cute and unexpected surprise!   By far my favorite restaurant in Charlotte at the moment and I look forward to trying everything on the menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TOhUN3dxqLuebm8xagWexw"
  },
  "w0zE2kx8icOLu_dEcB2mSg": {
    "date": "3/10/2019",
    "text": "I think we've found 'Our Place.'  We ate lunch and came back for dinner on the same day.  That's saying a lot!  I had the gyro and fries for lunch. Out of this world.  My wife ordered the same and agreed   When we returned for dinner I tried the Cubano sandwich, again with fries. I did my best to save half for lunch the next deal, but wolfed it down the minute I got home.  My wife had the Eggplant Parmesan for dinner with a Greek side salad. She said it was a little heavy on the breading, but the Eggplant was sliced just right. We both liked the homemade sauce. Not a bit of acidity!  Can't wait to work our way through the menu. Outstanding!  HIGHLY recommended!!!!  Cleanliness: 5 stars. Service: 5 stars Management: 5 stars Prices: 5 stars (price/quality) Parking: 5 stars",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "SdYu8To3oUFo1Cc2KcMmIg"
  },
  "K7LTv1Xcrzgo880W-Qd-Fg": {
    "date": "8/11/2019",
    "text": "Our favorite hidden gem in South Charlotte! The back patio overlooking the pond is a perfect spot to have a glass of wine on. We love the spinach salad, wraps, skewers, pizza and the GELATO is to die for! You won't be disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Li0pAsVzqXiD0VHbFr3a9w",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Li0pAsVzqXiD0VHbFr3a9w/o.jpg"
      },
      {
        "img_id": "NdaWvds-BFTwZH4z3L9RCw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/NdaWvds-BFTwZH4z3L9RCw/o.jpg"
      }
    ],
    "user_id": "t96qsy_7V8UN0qlgUAn8UA"
  },
  "ctCv3FPyMa_SWn_5noxFug": {
    "date": "6/16/2019",
    "text": "This was our first time here even though it's bern here a while. We typically go to the same old places at the Arboretum. But we'll be back here! It was very good! Service was excellent, food was fresh. Lots to choose from on the menu but not too overwhelming. I had a chicken, cuke and avocado wrap with homemade potato chips that were excellent. Other person had an omelette with fresh fruit that tasted great. Cute back patio! The other things we saw served to other customers looked good too! I'm getting a burger next time!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PqiRsCM9YMC5SugulOaK5Q",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Sunday brunch",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PqiRsCM9YMC5SugulOaK5Q/o.jpg"
      }
    ],
    "user_id": "-SpxqMoZJjCQ80f2_T4UnA"
  },
  "N4AaJ7vDMPeOSoF5lMZ9IA": {
    "date": "9/4/2018",
    "text": "When we entered there was not a single patron there. A young teenager took our order and had to come back to confirm three times. Perhaps he should have written it down. We tried the sample player with three different skewers. The meat was dry and the chicken tasted metallic. It was rather disappointing. The yogurt was delicious though.   I have been eating Mediterranean all of my life, and this food was really nothing special. The service was sad more than anything.  The whole hour we were there, no one came in. I can't say I'm surprised after eating there.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_xv_0Pi5Dv0DAkKHrlb7Pg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_xv_0Pi5Dv0DAkKHrlb7Pg/o.jpg"
      }
    ],
    "user_id": "5Uf9jm22lhV57R2gn4BbSQ"
  },
  "loXJEJNjwEkb6bXB4HKa3g": {
    "date": "7/12/2019",
    "text": "I haven't been back since 2016 and I have heard horror stories of this place..... My long time friends are running it Tas and Vicky and MAN! Today I brought my kids and wife and they enjoyed it. I had the homemade French onion (on point) and the shrimp Alfredo (on point) and also my girls couldn't stopped eating it. My kids shared a pepperoni and bacon personal pizza and they love it. My wife ordered the smoked house burger and there is nothing left. Vicky brought a complementary tiramisu so we couldn't eat the delicious gelato. Food is made to order and there is an option for anyone, any time of the day and for any occasion. You can't go wrong with this place. 2 thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "wHUbktqzHZAfabHQnV0dMg"
  },
  "6TEwcWI7Mn1DMia6iNwIXQ": {
    "date": "4/15/2019",
    "text": "I thought the food was quite good. The negatives I have are is that the menu is a bit large and lacks identity. And the menu should be smaller so it's easier to manage.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 4
    },
    "photos": [],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "KI7Ty95CZAy2eQBgshqHRQ": {
    "date": "4/3/2018",
    "text": "I went to this place for an early lunch and was the first customer as I went as soon as they opened. Ordered fettuccine alfredo pasta and philly cheese steak. We asked if they can make the alfredo pasta a bit spicy and the chef was kind enough to try some variations. When it came out, it was really good, creamy and a bit spicy finish! Would give 4 stars for the pasta!!   The philly cheese steak was okay and the fries were good. Our server was nice but I am not sure about the other staffs. As we couldn't get her attention from our server for a check, we eye contacted with other staffs to ask to send us our server, but they didn't care. Other than that part, the food was good and service was good. Overall experience was 3 stars and a half.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "olmCUPS3Wz9SKlMWbLEq0w",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/olmCUPS3Wz9SKlMWbLEq0w/o.jpg"
      },
      {
        "img_id": "Qtg42B04voo2sv9rqQ-Hlg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Qtg42B04voo2sv9rqQ-Hlg/o.jpg"
      }
    ],
    "user_id": "sbbB6Y4yIZIInvt0LFYYew"
  },
  "mtRn2MrSQgIU2TxiI0Z3sA": {
    "date": "2/11/2018",
    "text": "My dining mate had lunch here and enjoyed everything. We were greeted by a very friendly waitress. The atmosphere, tables, booths, was  overall very comfortable. The menu features Mediterranean and Italian food. Pizza,  appetizers, wraps, salads, main entrees etc all reasonable prices with something for everyone. We ordered the soup, home made tomato basil which was very tasty. My dining mate ordered the chicken swarma  wrap with fries. I ordered a Cobb salad with shaved lamb. Everything was tasty , plated nicely with good portion size. The lamb on my salad was one of the best lamb I have  ever eaten. Alcoholic beverages also served. The gelato showcase in the restaurant was amazing, with a display of over a dozen varieties all made on the premises. We would certainly return again. I had read prior  negative reviews but we had a great experience with our visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "unnc48ucAXqgs0EmLW4vCw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. gelato bar",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/unnc48ucAXqgs0EmLW4vCw/o.jpg"
      },
      {
        "img_id": "PwwQy3FUQHX2cELOK3gl-w",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. Cobb salad topped with lamb",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PwwQy3FUQHX2cELOK3gl-w/o.jpg"
      },
      {
        "img_id": "1dCk1b5Qy_IblYgqMOdvoQ",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. chicken wrap with fries",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/1dCk1b5Qy_IblYgqMOdvoQ/o.jpg"
      }
    ],
    "user_id": "dzC95g6MT4ErmcKbiu6oTg"
  },
  "NQAmf3oyXjD2Z5Ij2mU_jA": {
    "date": "6/25/2019",
    "text": "In town from work and saw this place on yelp. Very diner like appearance with great food! Owner walks around and makes you feel right at home. Definitely plan on coming back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "_5pzvSQzctdfIPJ5098sLA"
  },
  "FaH0ofAJYTxK73GixaaiBQ": {
    "date": "9/27/2018",
    "text": "The chicken piccata was amazing. The atmosphere was simple and quiet and it was a large space. Not many people were there. It was not cozy, but it was comfortable.  There was just one problem, to be honest. It was the server. I hate to rag on any server. I have a lot of tolerance because I know they don't have easy jobs.  The young man that waited on us was difficult to understand. He didn't face our table when he waited on us.  In fact, he spoke to use only in passing the table.  Weird!  He didn't look at us when he spoke. I had to continually ask him to repeat himself.  When he brought the ipad device for us to sign and check out, he did not make it clear how to work the machine.  He didn't readily ask us if we wanted refills on our drinks. When he delivered my meal, he tilted it too much before it was on the table and half of the juice on the plate spilled on the floor.  It was just awkward.  His interpersonal skills were lacking.  While servers don't have to have the best interpersonal skills, they have to be understood. They have to face the table and speak clearly.   But, with all that said, I still tipped him well.  He managed a smile or two and that at least was nice. Overall,  I just think the restaurant needs to hire quality servers because our impression of a restaurant can be highly influenced by the person who represents the restaurant at our table.  It's unfortunate because I would have otherwise given five stars to this place.   Do yourself a favor:  if you go here, get some of the gelato. It was outstanding!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "_BNkCJQvxftgiursnM1R8g",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/_BNkCJQvxftgiursnM1R8g/o.jpg"
      },
      {
        "img_id": "el-JvobRUo56YAZwFQ5N7g",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/el-JvobRUo56YAZwFQ5N7g/o.jpg"
      },
      {
        "img_id": "28OapxnNiC-V7-sDHjK2fg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/28OapxnNiC-V7-sDHjK2fg/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "ikNjB-d-OWClf1U5djENnQ": {
    "date": "4/1/2019",
    "text": "We ordered delivery from here through grub hub.  We got a philly and Greek salad with shrimp.  It's ok.  Nothing great but definitely good.  Probably would have been better in the restaurant than delivery because the styrofoam to go boxes made the lettuce wilted and the fries rubbery.  So my advice is eat there and you may have a better experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vwju35E2KfIkuGPF-1eQ7A"
  },
  "L706mAVWIpcggRKfI6e2pw": {
    "date": "7/9/2018",
    "text": "Identify Crisis: Not sure if this place is counter service, sit down or take out. We had booth next to a loud gelato freezer. Wine cabinet, beer display, gelato, pick up counter, booths, tables and weird music. Mediterranean, Italian, Philly subs, pizza and burgers. So we didn't know what is there \"thing\" to order. My hubby got a veggie pita and I got a Philly. No salt on the chips or fries. Pita was good the Philly was good but next time I would ask for a better toast on the bread and no pizza sauce to make it mushy. We did order falafels that had good flavor but was dry and crumbly.  All in all, wouldn't go out of our way here unless we wanted gelato. Now that was pretty darn good!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmpGm0ewusFvEd3YhaVRgw"
  },
  "5gONm94i03RyHyr9LLeA_w": {
    "date": "4/6/2019",
    "text": "Amazing food and staff! They have outdoor seating with a water view as well. It was out first time and we'll definitely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BKlKVLHUs3ql-Y3CswoukQ"
  },
  "xtv2kOXpf8GmpG3Ym5Yyjw": {
    "date": "8/25/2018",
    "text": "Previously rated this place 5 stars. Seems like something changed. Food and service were both poor. Very disappointing. Makes me wonder if there is new management in place.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1qaIt-gFgL3yj4thDu3Ibg",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1qaIt-gFgL3yj4thDu3Ibg/o.jpg"
      }
    ],
    "user_id": "q4kyixO1z_MwSnLpZN3ARQ"
  },
  "kd02lZYwmzQbLYCBMjjYug": {
    "date": "2/3/2019",
    "text": "Living in South Charlotte we have a couple Greek style restaurant to choose from but this is the best one. The food is great but why I really like it is because of the ingredients they use. Not cheap at all! Every-time I have eaten with my mother the food is the freshest I have ever eaten. Plump shrimp that taste fresh with no brine.whole olives on the pizza. Fresh baked pita bread that is to die. This place is truly amazing! Servers are teens so expect that but I come for the fresh food. Like I can't get over the high quality stuff they use compared to Charlotte cafe.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kl7pdE2q9C5OD4Wn1JdNvg"
  },
  "dnuJIh94V1PzlbbUgYkjRQ": {
    "date": "8/22/2018",
    "text": "Food looks good but wasn't. Barely ate it. The chicken was raw and no flavor. The sauce was super tangy. Service was somewhat ok. The place was empty and the server and cook just sat down. Had to flag down the server for water and my check. The only thing I loved was the garlic bread",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_7Ap2D_wc8XCQ6Rw61t67A",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/_7Ap2D_wc8XCQ6Rw61t67A/o.jpg"
      }
    ],
    "user_id": "uO7XVsfncch_ZUoBXee1wQ"
  },
  "Z5CAwXJra-nUwuV17b_dkA": {
    "date": "10/24/2017",
    "text": "***update please everyone look at the pictures I just posted showing that I got harassed after posting my review by the owner. This guy is a piece of work. No one should have to worry about making a review on yelp and then have someone from the place contact them and harass them because of their review****  Went in to have some lunch and should have went somewhere else. Food was ok and service was ok. There was nothing about it that would make me go back to it so if you are looking for a place to have lunch with really good food this is not it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3CFzZ5G21dpbZXrkumsNAw",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3CFzZ5G21dpbZXrkumsNAw/o.jpg"
      },
      {
        "img_id": "qWZ3uB9tt2zd9BjMGKHF4g",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States. So because I made a review with my honest opinion I was harrased by the owner. I am sorry but I thought that was the point of yelp. A**hole!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/qWZ3uB9tt2zd9BjMGKHF4g/o.jpg"
      }
    ],
    "user_id": "Lb1vbEtDuDIx5VoUkV4m-A"
  },
  "hlQbAdpubHkwmUg9Uz-NQw": {
    "date": "4/27/2018",
    "text": "Very average food and overpriced appetizers. Service was very slow and MIA most of the time - we had to flag down other servers to get drinks refilled. To top it off, when we went to the counter to pay, their system was down so they were writing down people's credit card numbers to run after it came back up. (I'm not joking.) Needless to say, we paid in cash and have no plans to return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SNUlz7hN2fF5AUDFeliDuA",
        "caption": "Photo of Bella Fresco - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/SNUlz7hN2fF5AUDFeliDuA/o.jpg"
      }
    ],
    "user_id": "qRfMtCMCzdJ28wzc6wJCcQ"
  },
  "YE1oj6vRpdZP4PzTicN2vw": {
    "date": "12/21/2014",
    "text": "Ordered bruschetta - has a great balsamic glaze.  Gyro was fabulous with nice lamb chunks.  Tiramisu was to die for.  This is one of my new favorites.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IzAPa4s-084pRMzY_o8DWQ"
  },
  "rENaPiRFqKhlm3O54X0N9g": {
    "date": "7/8/2017",
    "text": "My wife and I went to Bella Frisco for lunch today. Our first experience was exactly one year ago. We were attending a conference nearby and ate there for lunch. The lunch was crowded with people. The food was delicious and the service was great. We loved it so much we came back again the same day for dinner. We thought it was wonderful. Now fast forward one year. Today we again go for lunch. Our experience was totally different. Very few people were in the restaurant. The food was terrible and the service was mediocre. We ordered hummus as an appetizer. Rather than getting pita bread we got some type of chip that was very greasy and stale. The hummus lacked flavor. My wife ordered a schwarma chicken salad. It had no flavor. I ordered a Mexican loco wrap. The wrap was tough and over cooked and the filling was tasteless. At the end of the meal the waitress asked how we liked it. Unless the food is really bad I don't ever mention it. However in this case I thought perhaps they changed ownership since last year. I asked the question and the waitress and she said they changed managers within the last year. I explained to her her my feedback about the food. She left the table and the manager soon arrived. He asked why we thought everything was bad. I proceeded to give him my honest feedback. He had no interest in hearing our feedback and argued with me and defended everything. I realized right away he was not someone that wanted to hear any complaints. He told me he's never had anyone complain about all of the food and he couldn't understand why we were so dissatisfied. I realized he was not going to hear us so we dropped it. I have since looked at yelp and Google reviews. I see that I'm not the only one that had a problem with the service and the food. I do not recommend this restaurant. Don't waste your money or your time.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z2b4zpbDU7ozQm7qd-RP3g"
  },
  "XDLPumD8M-aA6yjFKpUYZw": {
    "date": "8/5/2016",
    "text": "Without a doubt the RUDEST and most condescending staff I have ever met in the business. I will never step foot in this place again. The sight of the staff makes my skin crawl...if you go to the one uptown it may be different. The one in the arboretum is garbage. Food wasn't too bad.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BYsj-5wlYKMNOGilcV8Ahg"
  },
  "sOXw91cDv7vxSet5burpBQ": {
    "date": "7/29/2016",
    "text": "Awesome food and great price.  The Paninis and wraps were great!  Also you have to try the gelato before you go.  Will return regularly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hH6Z09HpkIPtHUp6bFDVXA"
  },
  "XXDDhtHwSzrTMS-RT4qiaw": {
    "date": "9/13/2013",
    "text": "The gelato here is good, BUT the server was touching all of the gelato spoons with his hands. Literally rubbing each spoon with his fingers. I watched him do this with every customer (in between touching coins, cash and wiping up the counters).  For any of you who have worked in food service, that is a big No No!!!  You do not touch your customers' eating utensils with clean hands and especially not  dirty ones!!!!  The service is also slow and disorganized... Not to mention the fact that my server also handed my drink while holding the top of my cup with her fingers.   The food was fine. It's the gelato that is worth stopping for, and I would be back if they followed better food service guidelines.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "QCa09txB7T62JLj_LXuxxw"
  },
  "jsFfvGISOCsQlrg7UQV_GA": {
    "date": "4/30/2014",
    "text": "I love the open space of this place because it doesn't feel too crowded. I ordered one of panini's and half salad. Panini is okay, nothing to rave about but I had my salad topped with gyro and it was delicious. My boyfriend and I decided to grab some gelato after our finishing off our lunch and the owner (I'm just assuming) was the absolute sweetest. We were standing in front of the gelato display deciding on what he wanted and the owner came up and offered us samples and he basically gave us a sample of all of the flavors and they were all so yummy. If you're a coffee ice cream lover, definitely go from the chocolate chip expresso gelato because they definitely did not skip out on the expresso. Overall I had a great first experience here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oKaM5MTlyYb_ptyz8U_ZPA"
  },
  "-4Y4M_ME4khFFLSGrzVnLQ": {
    "date": "7/14/2013",
    "text": "Bella Fresco is having an identity crisis. The name sounds Italian, their cuisine is predominately Greek, and it doubles as a gelato bar. They are currently transitioning over to more of a sit down restaurant feel from an order at the counter system. It took few minutes for us to receive any service and when we did, it was all from the owner. There was only one server on duty and she was quite aloof to the owners signals for help. The food was ok but nothing to rave about. I am not sure if I will return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JipC64hg2cNJ9EA-7G4asw"
  },
  "cN-u8_EUCcMmf8NW55nmIA": {
    "date": "5/14/2013",
    "text": "In one word - confusing.  Upon entering you are met with a welcome greeting but then you are on your own.  First area you see and pass is the gelateria which seems odd to be the first place your eyes and stomach go to.  We wandered past this area and then there is a wine display (sort of and more about that fiasco later) and we finally reached the salad/sandwich area with wait staff more than eager to help - after asking if it was our first time we were given the sandwich/salad/pizza instructions twice - but we did stop the second staff person mid sentence to say we were already informed.  I ordered a cobb salad - meh - hubby ordered club pannini  - it had some nondescript sauce on it that he didn't like or recognize.    Problem was when we went to check out, we ordered a bottle of Pinot Noir wine and 2 glasses - person behind the register rang it up but the total was no where near what it should have been with two meals and a bottle.  We mentioned this and the owner (?) stated he was charging for the little bottles - since we had no idea what that meant we paid and sat down.  The waiter then brought 2 glasses of Pinot Grigio which I informed him was not what we wanted and showed him the bottle that I had previously named.  After realizing the mix-up he brought the bottle of red wine and two glasses.  Five minutes later, he returned to our table to tell us they had undercharged for the wine (duh!) and that we now have a current charge up at the register.  Hubby indicated we would square up after our meal which was okay with the help although it was just awkward and the entire experience seemed like no one know what they were doing but there sure were alot of them around.  Owners (?) have taken up residence right in front of the register at town tables - tables were strewn with computers, paperwork, wine bottles, etc.  Again, felt like we were intruding on their running of the restaurant with wait staff going over to ask questions, etc.  Would make more sense to have this area in back of house.  Nice deck off the back - huge plus but not sure enough to bring me back.  Will wait a month or town and retry to see if the kinks are gone or I am!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "tz8eio3Lyf1l5uSHZAXyKA"
  },
  "_8GQE1xpHWukpTImXCNcsg": {
    "date": "4/7/2017",
    "text": "So I went to this restaurant April 7, 2017 and truly had a unpleasant experience; the food came out really quick, but it was extremely disappointing. I ordered the chicken and shrimp with yellow rice. The food was cold and taste like pine soul; after two bites, I was over the whole meal. The sad thing was after nine years in the Marines I never thought i would deny a dish of food, but this was worse then Parris Island. To top it off the waitress came up and I explained to her that I didn't like the food; shortly after a few minutes someone came from the back saying that I ate half of the food and would still have pay for the for the full dish. I never expressed a problem with paying for the food, but I was not going to eat the dish. After it was all said and done; the part that took me to a hundred was the person assuming I didn't want to pay, and the fact that I ate half the dish when I only took to bites. They need to hire better cooks and stop serving old food...I will  not return; not even for free.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yVHYjJstddUDrkOrem64ug"
  },
  "tIi5PD2RRQFiUJfgSHXsXA": {
    "date": "1/3/2015",
    "text": "My husband and I have been here twice for lunch and twice for dinner. I'm just not impressed. Food is okay. Service is okay. Gelato is really good. Casual place, okay prices. Sorry I can't say much else!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsOz-dWToun2VsFcFAfGww"
  },
  "9hihUSJBQFnozc_k5AHQfA": {
    "date": "6/10/2013",
    "text": "It was wet outside which made the floors like an ice rink. Don't take your weak hipped grandmother here on a rainy day. It was a little confusing inside, but to be fair, \"confusing\" is a relative term for a restaurant. An IQ of 85 will lead you to the right counter eventually.  The food seemed fresh but tasted no more than OK.  If you're hungry, stop at McDonalds to pre-game with some McDoubles before going to Chez Slickfloor.  The biggest turnoff was how smokey it was inside from the grill.  My two year old was going apes*** over the smell of smoke.  We dried off some tables out back and threw half his sandwich to the ducks. All in all, great location, and a nice  patio once you finish the maze behind the counter.  I think they'll really struggle next winter. Too much going on inside and aside from the gelato, there's no stand out reason to try them out.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Z518UB3syg_ZeAlKM5V7QA"
  },
  "RTCR9JZgXzGLitAhEjfgKg": {
    "date": "7/12/2014",
    "text": "This meal was absolutely incredible! One of my favorite restaurants in the area now!!! Can't say enough good things!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HcUtpDz_a8BE4c9uMBe0yQ"
  },
  "MKUc1IINd1Bmcr_ZBp_NGQ": {
    "date": "10/15/2014",
    "text": "This was my first visit to Bella Fresco.  My wife had been once before and convinced me to try something new.  I walked in with low expectations and was almost validated when I saw only two people dining on a Tuesday night.  Mind you it was pouring rain and not a night most people would venture out for dinner.   After browsing the menu (which caters to both Greek and Italian cuisine) I ordered a cup of chicken tortilla soup and a Greek salad with chicken.  My wife ordered a pita wrap with chicken and fries.   She has gotten this item before and again was very impressed with the quality.  The soup was outstanding.  No need for any seasoning added.  It had a nice spice to it and was full of flavor.    The Greek chicken salad was amazing.  I have gotten many over the years at various Greek restaurants but this one was up there with the best of them.  They serve theirs with banana peppers which is a nice touch.    They also have a decent selection of bottled craft beer.  I had a Bells Oberon.  The service was fantastic.  Our server was attentive but not over bearing.  He really seemed to be invested in the company.  Near the end of dinner, he asked if we wanted any Gelato.  Bella Fresco claims they are Charlotte's only wholesale Gelato dealer.  He brought my wife and I a full sample tray.  Fantastic Gelato.    My only criticism with Bella Fresco is the interior.  It doesn't have a great flow with seating and decor.  But when it comes to what matters, which is the food, Bella delivers!  There is another Greek restaurant next to Bella and suffice to say I will never return to it again.  I am sold on Bella Fresco and will spread the good word.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xxpzOQEGV42N4Qty2fBZ9A"
  },
  "fNZqLNSb37k8W-iVe3pmcQ": {
    "date": "2/16/2014",
    "text": "Had a great brunch here today. The owner came and personally introduced himself. You can tell that he is very passionate about cooking and creating a welcoming atmosphere. My family and I absolutely love the Gelato selection. Everything was very fresh and packed with flavor. Try this place and you won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b1A_fn-GpJbptaxvttg8IQ"
  },
  "ION3iiruUwCFsd-uO2vp1Q": {
    "date": "1/15/2014",
    "text": "We had time for an extended lunch today and decided to try Bella Fresco Cafe courtesy of a coworkers Groupon.   We started with a blooming onion, which was a big disappointment. Undercooked, with the center being a mess of raw onion and uncooked breading/sauce clumping together.   Things got slightly better from here. The food was on, but nothing special. The panini I had ordered still felt slightly undercooked (cold) for my taste. But it was ok.   The only reason I would go back is for dessert. Their gelato is made in house and is really good. That's also the reason why they get three stars instead of two from me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8x-lBENayDizUL8wXlTyOg"
  },
  "NPb7ixUhoeXzY90J4uambQ": {
    "date": "11/20/2015",
    "text": "Spinach Artichoke pizza is amazing! Great service, great food and great selection on the menu. I am looking forward to my next visit!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KCrM17qctqq2oXNoSVW2WA"
  },
  "wZ22a13txGr9W1ab6Q1l3Q": {
    "date": "12/22/2015",
    "text": "Menu is great.... Food was dialed in and half assed, some dishes were not even completed... Service was less than stellar and could be due to the incompetence of the kitchen. Pick your battles...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3AG9heziOOhnn4mTx4P8cQ"
  },
  "0JGdre8nYpCIz03PFShbCA": {
    "date": "10/13/2013",
    "text": "Service is amazing . The staff is super nice and friendly. The food is great and good quality. Their gelato is awesome . I really enjoyed their cappuccino and cannoli - definitely made a great combination !",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2sAEfSkBm9oK-lRcli1aQw"
  },
  "w9P-TLs2BJLTmXkP8cdhPg": {
    "date": "2/21/2014",
    "text": "The food was great. I had the Greek lemon chicken over roasted potatoes, and it was amazing. My girlfriend had the gyro. Both were amazing. We also had dessert. Tiramisu and marscapone gelato were great too. I know I'm giving this place an overly positive review, but I rarely am so pleasantly surprised with restaurants that I want others to know about it. So do yourself a favor, and go check it out. There is nothing to lose, because it doesn't break the bank.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PGqwEvAJpUyGGISdNXD_5A"
  },
  "dxiuroaYkbWnFDH3ebIIOQ": {
    "date": "5/30/2014",
    "text": "Clearly I am the odd ball who wasn't particularly impressed with this place. We read the reviews and thought we would give it a try. Sadly I did not know about the Groupon deal. Had I known about that,  it would have at least lessen the blow from the final amount of the check.. We were seated and our drink order was being taken before we all sat down. The menu was OK nothing that blew my socks off. I guess the name of the place led me to believe this was an Italian restaurant but there was mostly Greek dishes on the menu AND the Italian sandwich came with MAYO. NO NO NO NO NO!!!!!!!!! Never and I mean NEVER do Italians put mayo on an Italian sandwich. Seriously what is with these places and their obsession with putting mayo on EVERYTHING especially Italian hoagies.  I had the Lemon and Oregano chicken on a Mint Salad. My chicken was 1/2 a breast that was probably sliced in half, grilled with no taste of lemon or oregano. The Mint salad was large chunks of cucumber, tiny diced un ripened  tomatoes, a handful of olives and a few ribbons of mint. My side item, the mac and cheese was delish and the highlight of my plate. My children had the burgers .One ordered a Cheeseburger and the other ordered a Build Your Own.  the server asked how they would like the burgers cooked. Both requested Medium. When they arrived it was obvious  they were frozen pattys, super thin and charred. They didn't have a shot at  being prepared Medium. They were so thin, the moment they hit the grill they were overdone.  My daughters cheeseburger came with nothing on it but cheese. Really? No lettuce? No tomato? I guess she should have ordered the \"Build Your Own\" and my son's burger was missing two of the 5  items he requested. My Hubby had a chicken dish on a bed of rice with herb roasted potatoes. His was the best looking and tasting dish out of the four. After Dinner we indulged in the Gelato. It was very good but a little pricey. 3 mediums and 1 small came to $21. The pistachio, strawberry Greek, nutella and the cannoli cream were very good. The birthday cake, which shouldn't even be a flavor to begin with, was overly sweet.  When it was all said and done we paid about $80ish for the entire meal. A little to pricey for what you got.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "TxnCLljqXZlKCOpsCreqxQ"
  },
  "xp7pV4NMWpFHXwkN5mU2uw": {
    "date": "1/28/2016",
    "text": "There was a point where my family was going here every weekend.  The food is good.  They are very family friendly.  There is gelato.  The pack patio is shockingly nice considering it's in the arboretum.  I was shocked at how good the pizza is.  My only suggestion is a switch from pepsi to coke products :-)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1wk9_DqXX0fiW0pyhNdQBQ"
  },
  "EqbN1kPhluKtWOnxLOzruA": {
    "date": "9/7/2013",
    "text": "I'm a fan. For anyone who lives or works near the Arboretum, you know how hard it is to find a place that is both fast and healthy. I have found Bella Fresco to be both, and to add to that, it is a great dining experience that includes table service, wine  list, and gelato for dessert. I'm sold. I've been a few times now, and on my most recent visit, I was pleased to see they have added a hostess stand and table service (except for the steady stream of gelato-seeking folk who can bypass the hostess stand and start tasting yummies).   Food-wise, I love their salads. They are fresh, crispy and made with love. Exactly how I make my salads at home. They aren't overly-laden with cheese and other stuff. You pick your protein or leave it without. I also love their pita sandwiches. Yum. Freshly toasted pita with creative sandwich builds. My son has had the kids quesadilla and the kids cheese pizza, and was only \"ok\" with them because there was white and yellow cheese on them (he's super picky), but he did love the French fries and the gelato--of course!  I love to frequent locally-owned businesses, and will continue to visit Bella Fresca for healthy, unfussy food and the delicious gelato!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "swUxTfJ96XZJ0ufmljJiXQ"
  },
  "9Tz0RrpYOx01upIcz_h0aw": {
    "date": "2/29/2016",
    "text": "I had a mix of marscapone and chocolate crunch Jellato.  Both recommended by our server. Excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dbLNhGvV9Hi-X5xt5o5Jrw"
  },
  "7arpVGMEhn7Da5nkje71IA": {
    "date": "4/9/2016",
    "text": "The food is always good.  I really like the pizza here and the servers, especially Leanne are very friendly and helpful.  They also have good cappuccino!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PB6X9sZyh3kmzz4CzZPxXg"
  },
  "CnYQ82CfSAccUNjQQ3bOlA": {
    "date": "12/26/2015",
    "text": "The half and half deal with the panini and pizza is the way to go. The wait staff is always friendly and efficient. This restaurant is consistently a good value. I'll definitely be back again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XX2o5d8o3W3nKGpFWxmiOQ"
  },
  "_ldReWFSP18MNYCbpFxxnA": {
    "date": "2/21/2014",
    "text": "Such great food and such a great price!!! This little gem is well worth a try. Whether you are getting lunch, dinner, desert or drinks, this is a solid choice.   The gelato is phenomenal. The owner is here most nights to come out and talk passionately about his love for his food and how he learned about the ingredients and processes to make his food the best.  The beer selection is solid, for you drinkers: they have Bell's seasonal in bottle and on Fridays and Saturdays they're $3!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFL8Ytis3U5W4w-LWgTx0Q"
  },
  "0_MLaqWz9uDrrLEcr65TxA": {
    "date": "8/11/2016",
    "text": "This place has a serious problem with unwelcoming and rude servers. We have been back a few times because the food is pretty good but each time the servers are always rude and not friendly at all! And the service is slow because they hangout in the back behind counter and talk.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "RiIOfGbdkS5zJAnfDlVwnQ"
  },
  "qf7bBl2SDrPVbV-ObjO0pw": {
    "date": "10/8/2016",
    "text": "This was our first time going to this restaurant and we loved it! Eggplant parm was really good and my husband loved the Cajun chicken panini. Gelato was amazing!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p547bXX4L5y1yxcEhOOlmg"
  },
  "cOyFtdjwkrnzz3Hry4tywQ": {
    "date": "1/17/2017",
    "text": "In an area with countless dining choices to choose from, Bella Fresco delivered just what we were looking for- great food, friendly staff. My husband enjoyed his gyro, and my Hawaiian burger was really good as well. We finished the meal with a little limoncello gelato, one of numerous flavors to choose from.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "d18Eg3pSYDvUjX7HAXSIxg"
  },
  "cZg3X4h-Uv6JwPk1ganQ0g": {
    "date": "9/16/2015",
    "text": "My wife and I have eaten here 3-4 times now. There food is good, but the Gelato is the best I have had!  My wife had a salad last time and she said it was amazing. I ordered a hamburger which was just Ok. Seemed like a frozen Patty, but that's what I get for ordering that there. The Cajun wrap I got the time before was great. I do love there homemade chips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PP3Mzgg0eRV5oTeFmuedFw"
  },
  "cewDVdhOAT5D3Mao65-ogQ": {
    "date": "8/11/2015",
    "text": "Great patio overlooking the lake behind Arboretum shopping center.  Lots of ducks and geese to watch.  Went for lunch and ordered the chicken shawarma wrap.  It was delicious with the extra tzatziki sauce I ordered.  However, the cucumber salad was horrible.  It didn't seem fresh at all.  Had a weird herb flavoring too.  Service was prompt, but not super friendly.  I would go back and sit on the patio to give this place another try.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vKoECqqh4Q07gP_arEtMAw"
  },
  "SBooLU7OrS8HMG8JIoCpaw": {
    "date": "4/1/2015",
    "text": "I have had great food there and have no complaints there.   It would be 5 stars.   Their website has and order here.    It says it has delivery.    I placed an order, paying 3 for gas.   45 minutes later I call.   My order is waiting for pickup?    They don't deliver, I should call foodie?   They'll come and pick up my now cold food and get it here.   OK give me a refund, nope can't do that.   They don't know how they don't handle the order.  Told me to call my bank and cancel?   Eventually if I call back in 4 days, the owner can help me with that refund.   No food, and I am out money.   They do get any stars because their food is great and their instore service is excellent.   But website and menu specifically says \"we cater and deliver\" and the order now on the website even takes your money and charges you for gas...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t6ag7BQEYynA2xY3LbCYog"
  },
  "yZILXPqBPq1nWq9TfR5UTA": {
    "date": "6/17/2015",
    "text": "I was super surprised at how decent the food was for the price. Definitely take advantage of the hidden patio in the back. The gelato was decent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "BqZ3w-E1JF7LCSlEnB4uAg"
  },
  "W3Qz9zTLDCGwFAdAnekb6g": {
    "date": "5/12/2015",
    "text": "Cool place, good food and fun owner. What else can I say? The menu is a great mix for everyone and plenty of lamb dishes! Sam has been our waiter twice and as really taken care of us. The price is so right too! Go dressed up or go casual it doesnt matter. There is a sweet patio in the back... do it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "sbes1I51bmIaxxuE5tY1zQ"
  },
  "4wikdQQOK5kBZcRBz0Apbw": {
    "date": "8/30/2015",
    "text": "This was my first time here yesterday! My mom was with me and we had amazing food! I ordered the lemon garlic chicken with roasted potatoes and mom got the calamari. Both dishes were awesome! I got a cappuccino and a small marscapone gelato afterwards. Those were awesome as well! I will say that the restaurant wasn't too busy, and my mom kept getting frustrated when she needed her wine glass filled. That's not going to stop us from coming back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xHcvxzuh71vZpwi9jWe4A"
  },
  "tnAJhWZpLWMznCULSo7xsw": {
    "date": "4/5/2016",
    "text": "I got the shrimp scampi, a dish I enjoy at most other restaurants, and it was drier than cardboard or the Sahara Desert. The gelato and desserts are the only thing worth spending more than one cent on. The restaurant is huge for a place with no business, now it is no surprise why they have no business. You can find a better Italian place on any other street corner in Charlotte. I'd advise that you go to the Malaya Kitchen next door instead",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "knv0E55L55cbS1jNkotj7Q"
  },
  "07nt_lh5xg3kos1Ka0qMeA": {
    "date": "7/31/2015",
    "text": "Every time I go, there is something new, either on the menu or in the restaurant. The gelato is really excellent and fresh and different all the time. When it first opened, the menu was more limited. They got the pizza oven and the pizza was pretty good (worlds better, and cheaper than nearby portofinos). I went recently with the whole family just to get gelato. We were sitting on the back patio (which is serene and lovely except for the big black ants on the benches). The table next to us got pizza, and it smelled so good, we ordered one too (even though we were already eating dessert). It was way better than I had remembered it!  If you tried Bella Fresco in the past and you were just so-so on the food, I encourage you to go back and try it again. I don't know if they have hired more help in the kitchen or if they are just getting into the swing of things, but it was pretty good before and now it is solid, reliable, while still offering something new to try every time. The menu is bigger, more varied, and has some more authentic Mediterranean fare. The pizza has really improved. The atmosphere is much improved too with seating on the front and back patio and new booths inside. It's great for coffee and dessert too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ACGQaOPzXJ-nAMsM7aWn8w"
  },
  "woY2AdgldZmwvkywanoUAQ": {
    "date": "6/22/2015",
    "text": "We've always been happy with our meals here. The staff, including the owner, are super friendly. The food is fresh, delicious, and very reasonably priced. I also like that the portions are perfectly sized. We come here often and always bring friends or family with us.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kl4qWgFHMKuZIKIuWNE6SQ"
  },
  "1KFy6E0dX13AXnxGkc05aQ": {
    "date": "10/28/2014",
    "text": "This was my first time going since it opened. I have had friends and family to and all say they have had an incredible experience. I ordered the beef lasagna and it was delicious. The best thing I can say about it was that it tasted like a home cooked meal. The wait staff was super friendly and helpful choosing an entree. I highly recommend it! Like others have said previously, the pricing is very reasonable!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2x2gaas7D0raiWvHiJh_eg"
  },
  "saQDykann4kEZkX8LtfCsA": {
    "date": "5/5/2014",
    "text": "I've noticed this place for awhile now in the Aboretum.  For some reason I never ventured in until I read some yelp reviews.  If you are eating there, BE SURE  TO CHECK OUT THEIR NEW BACK DECK that overlooks the lake.  It's the best seat in the house by far.  The staff is super friendly.  They gave us A LOT of samples of the gelatos...OMG!  Don't try this stuff unless you want a new addiction.  We enjoyed Greek salads & paninis and look forward to going back to try more on the menu (pizzas, phillys, fajitas, gyros, burgers, etc) One last comment.  Can you really ever go wrong with a Greek owned restaurant?!  :)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "dk9GzM6Nni61oBdkETDFkA"
  }
}