{
  "exFzkD_q9tCEyx6JPmKz4g": {
    "date": "1/18/2013",
    "text": "Located in the Northlake mall area, this is a nice restaurant.  You can eat inside or outside on the patio.  Food is good, nothing extraordinary, what you would expect from a chain tex mex restaurant.  I've been to this location a few times and I would go again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dVy5EAV9YZIl9Xl-Xb1kHw"
  },
  "nETgWR1bq4MwbQDHuI85ew": {
    "date": "12/21/2013",
    "text": "Consistent and delicious! Fair prices and fresh. Great service. I order enchiladas every time and have yet to be disappointed. My boyfriend and I are regulars. If you are looking for a quick mexican bite you'll definitely enjoy it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a6FN81i7fs4sUGuGfxFbmw"
  },
  "wGIqVk8OzusEhaINE4h1YQ": {
    "date": "12/9/2011",
    "text": "I know, I know, it is a chain.....but for my tastes it is one of the best (remaining) Mexican chains.  There are so many \"traditional\" style Mexican restaurants in the Charlotte area - I find them bland and same tasting.  A good measure for me is the Salsa....in this case On the Borders uses a pureed FRESH salsa mix, with a strong fresh tomato taste.  The local Mexican places always use a cooked/canned/jarred old tasting salsa.  The Chips at The Border are also very light and not the heavy thick corn chips.   Now on to the food....the Chicken is a highlight and is seasoned very well - it is great in almost every dish. My favorite is the Chicken Burrito or Chimichanga with the sour cream sauce.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "H1074-IVH2MPOcK2svjioQ"
  },
  "Qy7Tk8W4ndaWEP86IJT8DA": {
    "date": "3/2/2014",
    "text": "We absolutely love this place. Food is always fantastic & service is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeZRlJuzq9RcPJJgHjtASw"
  },
  "NxbzHGLKa0r0tARMMSJ8YQ": {
    "date": "10/22/2013",
    "text": "Had the Ranchildo.  Real good.  Bottomless chips and salsa.  Our kids got free sundaes!  Service was great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OQX9R8D0uqYA37HMqUnHMQ"
  },
  "PdKZ_--ahbOtVr_yrEBrFg": {
    "date": "1/27/2013",
    "text": "Not very good.  I had the salmon and the BBQ wasn't very good.  The veggies were supposed to be grilled but didn't appear to be.  My father had the ultimate fajita which included pulled pork.  We've never been to a Mexican restaurant that had that in it.  He was also disappointed with his food.  On the plus side the staff is friendly.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A26Ccpt573hQgiUukw4oag"
  },
  "ll0X5KEmqAsCAiPAEh2IYA": {
    "date": "8/14/2010",
    "text": "the best house margaritas in town!!!! huge nacho chips and salsa. great happy hour place.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4PwB5cvxPFeoF7VCujF5PQ"
  },
  "iL6mJqF_qSleJFHAlXfiDQ": {
    "date": "7/15/2015",
    "text": "Wasn't crazy about the food or service. Not a great experience, guess I'll try again. The design on the inside was nice though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Cqn_766h_JpQoV6fwizJhg"
  },
  "8t3o5_UGoqmQ4fs24u4n4g": {
    "date": "5/24/2015",
    "text": "It was fine. Food was average, a little bland, but appetizing. Drinks were okay. Service was average. I would never choose to go back, but if all my friends were going I wouldn't put up a fuss.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Zt-Ro7GqV5bxsUgU50xYkw"
  },
  "FQ9FERWacBhV1Edd5jTdyg": {
    "date": "9/24/2014",
    "text": "I did not like their food at all. Had one dish, sent it back, the second plate was just as horrible. Not close to authentic Mexican food at all. The atmosphere is very nice though. The authentic music made the atmosphere even better! Haven't gone back since I went the first time. Go at your own risk!",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FSJDnMPHNOpZrqR1wHp53A"
  },
  "cvAWlgLW4StB6v3-0VEOlw": {
    "date": "5/3/2015",
    "text": "1st visit. Freshly made chips and flour tortillas. Good stuff Maynard. Guacamole made fresh every 4 hours. Good service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-JKyXbKeCo801yR16Brk9A"
  },
  "WjkO1ymDogvOh0-uLD7Sqw": {
    "date": "4/2/2015",
    "text": "It was my first time visiting last night and I must say the food, drinks  and service was very impressive!   I'll definitely be back for more of those fried avocados. ...",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibeb2OxOucjw8hYzTIQFIw"
  },
  "MFVS3oUuyu74litZxHRzPA": {
    "date": "9/16/2011",
    "text": "I've never been to an On the Boarder before- but I was in the mood for Mexican and I was at the mall shopping with a friend -so we didn't want to go too far.   We started with a serving of guacamole - which was meh - it was basically mashed avocado.   Next I had the tres enchiladas - one of each kind (chicken, cheese, and beef). The tortillas were very rubbery and the dish was way too salty.   Not particularly cheap either for a run-of-the-mill lunch, I paid about $18 for my entree, 1/2 Guac, ...and a water.   I wouldn't return here on my own accord.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "e1fJbjDBwLfg8Sa3V5vQaQ": {
    "date": "8/1/2014",
    "text": "Typical \"Mexican\" restaurant...the food was pretty good during my first visit. I will go back...I went more for the conversation than to actually experience the restaurant. The service was excellent though and it was a PACKED house when I went.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hUym1AyF2r2x5zCCko7_kQ"
  },
  "3YumV6OEyDfGh_o8ppQT0Q": {
    "date": "1/29/2013",
    "text": "Pretty good tex mex deal.  I had a conference at Northlake area and went here for lunch last week.  They have a good menu and the bartender was super helpful.  Would def go back if I'm in the area",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sQ4WKs0k58eSAe1N2iNMtA"
  },
  "6pdYckGnkgmb3nNhKvRO0w": {
    "date": "4/28/2014",
    "text": "I'm from Texas, so craving Tex-Mex in North Carolina... this was the closest thing I could find.  Good food, pretty quick service, and a pleasant atmosphere.  Prices are a bit higher than what I'm used to in Texas for Tex-Mex, so that's why it gets 3 instead of 4 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tCOV-_4F0sI9TzTh2qUA8A"
  },
  "YiYigmjz0894Xf67FIjz-A": {
    "date": "9/11/2014",
    "text": "The food is the same as as the rest of the franchise.  The service is horrible, go to the concord mills restaurant.  They don't seem to care.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dvCq_YotSGCwf32RhJaZfQ"
  },
  "DZbU6qj8akyoSaJPI6jCcA": {
    "date": "5/8/2014",
    "text": "Best part is ordering online, picking it up after work and eating good grub while relaxing at home. I like that while it's a busy location, we don't have long waits for a table when we do decide to dine in.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8BA9P27NAYJ-R7L09XUXJw"
  },
  "eQPM49xOs8MXUR0NieJRqw": {
    "date": "12/19/2010",
    "text": "This was my first time visiting an On the Border and I was pleasantly surprised.  I'm not a big fan of chain restaurants but a gift card brought us in for lunch.  Our waitress was sweet and she started us off with the customary chips and salsa which had just the right amount of spice.  I ordered the fish tacos and I thought they were pretty tasty.  This was my first time trying fish tacos so I'm not sure if they compare to other restaurants but I thought they were great.  The only thing I wasn't happy with was my side of grilled veggies.  They were covered in some kind of seasoning that just ruined the flavor for me.  This made me sad because the zucchini and red peppers looked amazing but after a couple bites I just couldn't eat any more.  The one thing that put a damper on the meal was when the waitress and manager couldn't figure out how to process our gift card.  The waitress was totally baffled and tried to tell us that we had a zero balance on the card when we'd only used half of the card value.  We had to ask for a manager and the manager was so confused she had to call another store to figure out what was going on.  The manager figured everything out eventually and we walked away with half the balance left on our card.  Even with the gift card mix up I would still come back just for the fish tacos.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "AwrTMmmK0xu-bFK4Bkd9Xw"
  },
  "n6pLIb0z4ky1EnkwrcoplA": {
    "date": "3/16/2014",
    "text": "After rafting at the USNWC, I was craving some OTB chips and salsa, so we had a late lunch on the way home.  We found out OTB has drink specials on the Brunch menu, but those end at 2pm so try to stick to \"normal\" lunch hours on the weekend to get the best bang for your buck.  That being said, the lunch menu is active until 4pm and it includes some discounts on the normal dinner entrees.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aTe7Vwje6OVE0lj0UaKeeA"
  },
  "GYdQW6eRZvL8Q3N0fsB-mA": {
    "date": "12/25/2013",
    "text": "This place is pretty awesome! I love the house margaritas!! Great price for the food! I celebrated my bday here yesterday and great service too!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R4l3ONHzGBakKKNo4TN9iQ"
  },
  "MINoHxEmk1y51p9h4HW33g": {
    "date": "7/29/2014",
    "text": "Love the food. The endless tacos was a great deal. Service was well below standard; our glasses were let empty without refills and the time frame for the next order of the endless tacos seemed extremely long.  Location seemed understaffed.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fwcosaTQiIGM1HfLgfim8g"
  },
  "GegC9E29i51pUHhhlcV9CQ": {
    "date": "1/2/2016",
    "text": "Food is good, service is good, ambience is good... but oh good lord they have dirty cutlery. If they can fix that it will be great dice they are close to the mall which is great. The meal portion is good. They have good margaritas.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_r2dYWQExaCDAOxxW7tdMQ"
  },
  "BCJwl-uSbFCzE_aPyq7Yww": {
    "date": "1/19/2016",
    "text": "The food here is so BAD. I will never go back here. The prices were too high to have such horrible food. The meat was flavorless and the tacos were so bad!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGNa52JNYMD2IUiCRhs5qw"
  },
  "qatnCesAJyLjfiE_eTkAGA": {
    "date": "11/3/2010",
    "text": "Before a trip to the mall on Saturday we decided to grab a quick lunch here.  I have only ever been to the Providence Rd location and its usually pretty good.  It was slow here but we still waited a bit for a server to come by and we were so thirsty, I hate that.  Once we finally get drinks I noticed my Diet Coke tastes grossly similar to root beer, bleh!!  Have to wait a while again to find out server so I can get a replacement.  For food you get the unlimited chips and salsa.  Chips were good, salsa was a little spicier than I like.  For lunch I had the little borderito w/steak off the lunch menu, it also came w/a salad.  It was okay I needed lettuce and tomato in it or something, it was just a lot of steak and rice.  The side salad was not good, straight from a bag and I kept picking out brown pieces.  Honestly I usually enjoy On the Border, perhaps I need to stick w/fajitas.  Oh they did advertise a blood orange margarita which looked delish, so that is something to go back for!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Szle_N5FSs4Q7odfyd4P7Q"
  },
  "9nf3ldMqTOdv07YjlV6HbA": {
    "date": "7/11/2013",
    "text": "Went here on  Sat night with my husband and daughter.  Great food and great service what more could you ask for. I would definatley go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NFr-4AO4SXrW0QsaKsRyhQ"
  },
  "a3rrchLx4t_7vFsGBzjIaQ": {
    "date": "3/18/2013",
    "text": "I had the grilled fish tacos, eh. Not too impressed. The fish was kinda dry and there was barely any sauce with tons and tons of cabbage. However the rice and beans were very good and the cheese dip was off the chain. I think that if I maybe had gotten flour tortillas instead of corn, or the fried fish tacos it would have been better. Not my best OTB experience.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oISoaFVKNvnDhjirix99Zw"
  },
  "uYML3cIjV_RX5G80BER8IQ": {
    "date": "8/22/2018",
    "text": "I've been coming to this location, just about every Tuesday (Taco Tues), since I've moved to Charlotte about a year and a half ago. I always sit at the bar and have seen many bartenders come and go, some better than others. But the young lady, who  has taken over for Dave, has been the worst yet. It always takes her at least 10 mins to serve me (it's typically never busy when I go), I have to ask for chips and salsa, and for the weekly special menu. Yesterday, I asked for the weekly special menu, and she responded, \"Do you want it for the drinks specials or food because the food specials end at 7.\" I did not understand why that mattered, because I was always given both the large menu and the weekly special menu simultaneously before, even though I know the three food items end at 7 and start back at 9. She fails to realize that it's much more on that menu that's relevant to the customers and isn't restricted to a time frame. More training needs to take place to help improve her customer service and interaction with the customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ycrGuotPlvMlcRaHb08paQ"
  },
  "1JDNt9gs4RzYF8onNEg8mQ": {
    "date": "3/3/2018",
    "text": "What a joke 6:00 on a Saturday night can't get a seat in the bar not because it was full but because they are poorly staffed, didn't have servers to serve us. GM should be fired here",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gPHB96qUHID5OCMzad-_MA"
  },
  "SDZ9MAzWIVMfgOuqize8_A": {
    "date": "5/16/2017",
    "text": "The food is normally quite good. However, we did learn today that Taco Tuesday is a rip off.  It would've been more cost efficient to order meals from the regular menu. Taco Tuesday is advertised as starting at $2. It should have actual prices for each taco",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "dIWdrArjlHZ2AdlF7gpnXA"
  },
  "bhr3xUEk6WftSJXlKfUA7w": {
    "date": "2/23/2018",
    "text": "I'm not sure what the issue is with the location, however, my last couple of visits have not been great.  About a month ago, my wife, son and I decided to go there for dinner on a later afternoon/early evening Saturday.  The place was fairly busy, but not slammed, and we were seated right away.  It took about 8-10 minutes before a waitress came to our table and we were told that several of the staff had suddenly quit and she advised she would have to serve a large number of tables and apologized.  Since were were already seated, we decided to stay and order.  As expected by her warning, service was very slow, though she was nice about it.  We weren't all that upset, though, and understood the staffing issue.  Well, last weekend at dinner time, we all decided to give it another try, figuring that surely the staffing issues would be corrected.  Evidently not, however.  We arrived to a very light crowd at the restaurant (maybe 8 or 10 tables were occupied) and were told to wait a minute while they found somewhere for us to sit.  We were told the delay was due to a waitress having just received 2 new parties in her area.  So, we sat down and waited about 5 minutes and, meanwhile, other parties are arriving, being told the same thing.  Then, the hostess asks to take our name down on the wait list.  Again, with a very light crowd at the restaurant.  I put our name on the list, but after waiting an additional 5 minutes, decided to leave and go somewhere else, since it was obvious they were still having staffing issues and I didn't want to end up being served by a waiter/waitress with 10 other tables.  So, not sure what the issue is, but they obviously are having trouble keeping staff and also have other management issues.  Bottom line is, I still like On The Border, but beware of this location's issues before deciding to go.  I definitely hope the situation improves, sooner rather than later.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DrOMT68QmQpOSNaqJmRKIg"
  },
  "1FCsG8K9CFgFTPd0Be9XtQ": {
    "date": "7/13/2016",
    "text": "The staff greeted us with a wonderful smile they were quick to refill chips and drinks they had a great special on Guacamole so of course we took advantage not to mention the offer a reward program to get free stuff  I had a combo meal so did my little one she substituted the rice for beans though. Hubby had a huge chimichanga so big taking all good home for lunch tomorrow",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xB8VDhIE5flDY3_yNevPJw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xB8VDhIE5flDY3_yNevPJw/o.jpg"
      }
    ],
    "user_id": "a8E57Q40rZg9LPDHUXxbwA"
  },
  "6Q4YK3K5xWHOp_c24iaTUg": {
    "date": "5/11/2016",
    "text": "The drinks are fine, my friends really enjoy the specials on margaritas.  I really like the people that work here, in that respect I give this place 4 stars.  This is not my go-to place for Tex-Mex, it is the opposite.  I prefer to drink and socialize here, not order the food.  I recommend you get your grub on somewhere else and then come on in to have a raucous good time drinking and socializing.  FULL DISCLOSURE: My review is biased heavily by my personal relationships.  I wrote a less positive review and my friend, S.W., gave me so much grief I had to change it.  Take that how you like, the people working here were able to ingratiate themselves with my friend and that has to say something about the service.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lktq5goeWtRJG13Jh1NOLw"
  },
  "5kKCtl75tpEt4g2lqPwVmw": {
    "date": "2/21/2014",
    "text": "You're not going to read a review of a chain restaurant, if you're not the type to pick a safe chain restaurant, so I'll spare you the, \"this is pretty darn good for a chain restaurant\" speech.  Wink wink.  OTB is put together nicely.  It's warm and inviting and is decorated simple and appropriate.  While I wasn't expecting anything past bland American/Mexican food, I took the advice of one of my cohorts and ordered the Dos Equis Fish Tacos.  Deezam!  These fish tacos are amazing!  I'm certain I'd be amazed at the calorie count as well...but they are fried and dressed perfectly.  The only thing they miss, is bringing you some limes to squeeze over them.  Seriously good folks.  The portion is pretty large, three tacos...yes you can share these.  The service was pretty decent as well.  I'll come back again...but not when I need to lose a couple of inches.  Try:  The Dos Equis Fish Tacos (So worth it!)  Avoid:  Being boring...order something you haven't had.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "cx4-WfPgm1Jxurtd83I83g"
  },
  "iml_-PqRDYeXegshl-qZCA": {
    "date": "2/1/2018",
    "text": "It was taco night last time we came to this location and they were packed, which led us to brush off our negative experience. We tried again tonight. When we arrived the place was empty, but we still waited at the host stand for at least ten minutes before anyone acknowledged our existence. We were sat at a table that clearly hadn't been cleaned, chip pieces on it and drink rings. Our waiter didn't address us for a while and took a bit to bring us water, chips, and salsa.  While waiting to order, we overheard the manager complaining rather loudly in the dining area about her job to other employees, as well as watched our waiter text (come on man at least go to the kitchen or bathroom). When our food arrived it was lukewarm at best. Our waiter never came back to check on us, but texted on his phone a few tables away...he just brought the check when he saw we were done eating, even though we would have preferred sour cream and the correct style of beans.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iSytm8F8jQp8TznoE3qTvw"
  },
  "NEfOtca9rSUstMTdAKkghg": {
    "date": "5/21/2018",
    "text": "I have lived in the area for over 10 years. Many times I had dinner at this particular OTB . My question is what happen??? The food has gone down hill at a fast pace. Very poor and it's a shame because it was once a decent place to eat. The  service has fallen short as well.  Our order was wrong and we were served half of the dinner. Our waitress blamed it on the kitchen staff and  it should be a known fact they know what's being ordered and on the menu. After waiting we were served something that resembled what we ordered. It tasted horrible under cooked and at that point we decided to pay the bill and leave . Since The manger was NOT to be found. We were asked if they came over and I replied yes just so I could get the bill to  pay and leave. Not only bad food and service all the way around. The table behind us made it game night at OTB playing their music LOUD which made for some interesting cross noise. Would love to know when OTB became a game stop for playing UNO and drinking! But have to hand it to them they weren't on their phones except for the annoying music. The administration offices really need to evaluate this once decent family restaurant. I will NOT be back that's for certain.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OdGdu857vQwPRQZYKnsyhQ"
  },
  "ynhJ5yrq2UP5DDJjqc2t_w": {
    "date": "2/27/2015",
    "text": "Love the atmosphere here. Chips, salsa, and guacamole (table side) were awesome and the server we had (Lasette) was wonderful. House margaritas were just ok (from the bar while we waited), and we had to ask for lime wedges. Had the spinach and mushroom quesadilla, and that was on point. It's .99 for extra sour cream, which seemed silly. My husband ordered the 3 Enchiladas and really loved it. The refried beans had a nice smokey flavor.  Overall, we'll definitely be back, and I'll probably order the quesadilla again!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tHDIUAz-XhQgF-WDsSGBMw"
  },
  "LizVvgzi_8Hw-K5xCB7tSg": {
    "date": "11/26/2016",
    "text": "The food was not good at all and the silverware was filthy, the service was very poor and we were left to go for self finding napkins etc. the food seemed like it was a TV dinner and put in the microwave and the waitress never introduced or washed her hands after playing in her hair before serving others! Extremely disappointed, there won't be a next time for me!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4PXayavxEqA0DoBvHdZecA"
  },
  "YXbV3e4UPAjrjyGKgfl6Hg": {
    "date": "11/14/2016",
    "text": "Low wait time. Hostess was blah but bartender waitress was amazing. Great attitude the whole meal. Food was delicious and came out hot. Waitress kept our drinks full the entire time as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "slgksUygcAVaRFNQnavv_w"
  },
  "nwROQMmMm2GMYWpunW6z1g": {
    "date": "5/17/2015",
    "text": "Been going to otb for years now. I used to go to one in virginia all the time as a kid. This place has always been a solid place for tex mex place for me. The food and service is always excellent and quick. I recommend the empanadas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "z6v7O3QGZmD17zA6o1Cipg"
  },
  "jLe9UPgymfpY7bnDwNRpjw": {
    "date": "5/30/2013",
    "text": "Took my daughter and her friend for dinner.   Our server (\"Liz Lemon\") was fantastic. She helped make our evening meal a good one.  The complimentary chips and salsa were tasty. The salsa had just enough spice and the chips were crisp and warm. (Though I remember the chips as being a bit too salty and I worried about my sodium intake for the day...)   We all ordered from the \"Create Your Own Combo\" section of the menu.   I ordered chicken tortilla soup (yummy) and two chicken tostadas (also yummy). The tostadas came with black beans and rice. My drink was peach-flavored tea.  Along with the chips and salsa and tea, I was pleasantly full enough to take home leftovers.   Reasonably priced for about $13 per person, including drinks and taxes.  I think I saw a Tuesday special on the small pop-up table advert...  We will definitely return to this location.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GLS6XktLGVjXLZzybf-Njw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. chicken tostadas (2) with rice and black beans",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/GLS6XktLGVjXLZzybf-Njw/o.jpg"
      },
      {
        "img_id": "nVCch_h9o986QMW43ehSrg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. chicken tortilla soup (I added the chips.)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nVCch_h9o986QMW43ehSrg/o.jpg"
      }
    ],
    "user_id": "Unk6o07QJ0cQkTIoTjQzWA"
  },
  "63HcpPRYCr2JtL59sr43ig": {
    "date": "4/10/2016",
    "text": "This will be our last visit to OTB. We've always enjoyed the food but the service has been on a consistent decline our last few visits.  We've interacted with four staff members and their indifference is extraordinary.  The staff will teach great lessons I. Humility as you have to beg for pretty much anything. At least you can refill your water in the sink if you don't mind tap.  Order came out incorrect but we were so hungry and running short on time so just gave up.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mk_wdMUimWbiJLIuHMKbmA"
  },
  "Kmmp3c-6ILKu6Q5SKVH7Dw": {
    "date": "10/18/2014",
    "text": "I didn't like On The Border the first few times I tried it a few years ago.  I tried it recently in Charlotte and it was delicious.  I think they changed something about their salsa, it's extra hot and so good now.  Their chicken enchiladas are great with the cilantro lime rice.  But the shrimp fajitas are where it's at!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vW1kHIcXk8ZWIlkXj9qKIg"
  },
  "xlp3eBebHrzLOW-XMBzI7A": {
    "date": "12/29/2017",
    "text": "I have always liked On The Border--good but not great food, drinks and service.  However, the service we had tonight was horrible.  When we were first seated, someone basically threw a bowl of chips on our table without even saying hello.  Then the waiter came and seemed quite pleasant but took FOREVER to bring our drinks.  When I order a $10 drink, I expect better service.  We waited on our queso dip for an eternity.  When our food FINALLY came out, our waiter asked if we still wanted the queso--no apology.  We said yes, but it wasn't the size or type of queso we ordered.   We went with it just to speed things up.  Asked for more chips and salsa--none were brought--is it too much to expect them to bring chips with the cheese dip?  My husband finally went to the bar to ask for chips.  We had to flag down the manager to get water refills--I was not going to wait for another overpriced drink.  The bill had an extra item we didn't even order.  Ugh!  I'm not sure we'll ever be back!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-wNP3qPuFzENQp3diHUILg"
  },
  "uYtEB8hWXoezbgSxZIbOOw": {
    "date": "2/3/2011",
    "text": "It's your typical chain restaurant. Nothing flashy, nothing bad. I went with my friend and we ordered a couple margaritas and some beers. Had the guacamole dip and the meat tacos and fish tacos. All were tasty, but I kept thinking about all the calories and fat I was consuming - oh well.   The main reason I went here is I had a $25 coupon I needed to burn through. Service was standard, nothing bad, came when called (sounds like my dog). I would go back if I was with a group and they had to go here or if I was traveling and did not have another option or if I was at the mall and needed a quick Mexican fix.   I prefer local joints like Cantina 1511!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "FWjdADLGzUsL5ZPsnBCaLw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. meat brisket tacos and beer",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/FWjdADLGzUsL5ZPsnBCaLw/o.jpg"
      },
      {
        "img_id": "sZ9_BqxWAWRQNVhBx7ZycA",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. fish tacos",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sZ9_BqxWAWRQNVhBx7ZycA/o.jpg"
      }
    ],
    "user_id": "1gEx8Si6rkStWBp_IXnGCw"
  },
  "0Qc-4um58ZMK2bs5yX8AdA": {
    "date": "9/12/2016",
    "text": "Great food! Last time we went we had a great server in the bar area. I believe his name is Andrew. Highly recommend!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "I082WTNp6YRoYMZV-phuLw"
  },
  "_1nBJJdJs03mLFoNJ407Yg": {
    "date": "12/10/2016",
    "text": "Great experience here! Highly recommended. Fajitas were excellent and margaritas were great too, even the house margaritas. Sat in bar area. Loud but fun. Would certainly go back again if we are in the area. Bartender was a great waiter too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "90ujl55GA7wvKftt3Bu5Dw"
  },
  "MfVdDp0wFpYh71-mrNpjYw": {
    "date": "12/30/2018",
    "text": "It's a shame the service always sucks cause I love the southwest chicken tacos. Every time we've went it just seems like they don't really care- no refills and never check back on you.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fFgY6CVUFWWFe2O6IXDc4A"
  },
  "CYlrVYpy7J4Mfg9MbUVmeA": {
    "date": "3/28/2018",
    "text": "My fiance and I went here for lunch today. Wasn't anything horrendous, nor was it anything spectacular. We sat at our table for seemingly longer than normal to be greeted; come to find out, per our server, management hadn't clearly defined sections and he wasn't aware he had our table. He was apologetic and professional about the situation, so it didn't really bother us too heavily.   Chips and salsa were great. I had beef enchiladas, they were decent. Refried beans were subpar. Her California burrito was about average as well.   As stated above; nothing spectacular, nothing horrendous. That being said, I don't feel it was worth the full price we paid.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZGzW9yPg-7BKoTHMPD0v1g"
  },
  "eLRE3wIujKIdWHaiCy5M_g": {
    "date": "3/30/2016",
    "text": "I always thought I didn't like On the Border but apparently they have converted me.   They have happy hour Monday - Thursday and have $4 margaritas. This won me over hands down. Forget everything else.   They have these jalapeno poppers that are stuffed with cheese and chicken and fried in a tempura batter. So good. These suckers are delicious.  And you can't go wrong with their chips and salsa. So fresh and tasty.  Our server was good for the most part. We sat around and had to wait on utensils a bit but she got busy. Our food came out hot and as ordered and we had no complaints about the food.  I would definitely return even if just for happy hour and appetizers.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "czIdUZ01B60wcjfu7kimyw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Stuffed and fried jalapeno poppers. Delish!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/czIdUZ01B60wcjfu7kimyw/o.jpg"
      },
      {
        "img_id": "QwdgBiLY4FHCPR4tQEZ2fg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. $4 happy hour margarita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QwdgBiLY4FHCPR4tQEZ2fg/o.jpg"
      }
    ],
    "user_id": "U0WU9d6gpMNkO_tPXK58Sg"
  },
  "Yq3m5y8jPox0rtKVlQNMXA": {
    "date": "12/22/2017",
    "text": "Arrived after 8, food is not good (shrimp tacos was soggy/ queso was watery) and the drink (cranberry juice and great goose) was weak and watered down. Server was good. Do better!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "rcvx1yj7GGxlvHh-ccHl-w"
  },
  "-h66KFnCDySDyE4CYMJeaA": {
    "date": "12/29/2017",
    "text": "We had lunch at this location and had Anthony as a waiter. Anthony was horrible. He brought us our chips late. We ordered Queso. When it did come out our chips were almost gone and he did not bring any through the whole meal after we asked him too. When we did ask him for chips he said he would be right back, but went straight to a table 5 ft from us and started cleaning it. My wife's tea was almost empty and he said he would refill that also. This did not happen  until after our food was at the table. I had a full Queso with no chips. I was not happy and will not be back to this location ever. He hardly ever checked on us to even see if we needed anything. I have actually had bad service before, but this takes the cake.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DH8OekrdwP9pi4fmd5IC4Q"
  },
  "_ThAed4Q1ZtXKwmpqG8iNg": {
    "date": "10/3/2017",
    "text": "Only taking one star of because the service is sometimes a hit or miss. However the food and drinks are always great! I come here regularly and never had a bad food experience. The late night bar menu is a great value! Sign up for their email list because on the boarder celebrates a crap load of holidays(national tequila day, margarita day, taco day, on the boarder birthday, cinco de mayo,etc..) with drink and food specials!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "SGTH6vBZibuM6FmzTFiqHw"
  },
  "KSTH1e_GcvPvEvu-Hdf3Vw": {
    "date": "10/18/2017",
    "text": "I come here pretty often especially on the national holidays like Tequila day, margarita day, taco day, etc and it's usually a hit or miss. When the special is involving just the drinks it's pretty fast & friendly service but when it's food like on National Taco day it's a hot mess all around from wait time to service to losing orders smh. This location gets a 2.5 and if I ever go back it would be solely for the drink specials.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "O3cItff0mKAfXtl5VmbW2w"
  },
  "AFe54KIUs3OfubiU3v7ebg": {
    "date": "12/26/2018",
    "text": "Asked for a table near the bar and an employee cleaned off one for us. We ordered a chicken and beef enchilada only a beef came out but our waitress was very sweet and brought us a chicken out for free. Emily was an amazing waitress, felt like the whole staff went above and beyond!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eWlByvUMOr9RWCxYl_6YpQ"
  },
  "AwjUmXcWLel174qCJcHrVA": {
    "date": "5/7/2016",
    "text": "I guess I'm in the minority, but I love On the Border. I think it's the best Mexican food in the area. I also think it receives a lot of unfair hatred simply because it's a chain.   The food is always on the money, and the service has never been bad during many visits. Perhaps we've been lucky. If I'm really fishing for a negative it's too many chips prior to the meal. But that's my own fault.   Overall, recommended. Then again, that's only for those who haven't been. If you have been,  then you know what to expect and a lot will depend on your personal tastes and service standards.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "3gRfkaVcEWri-Ju7OQX7uQ"
  },
  "vAx14Qpibs9M1nML5cI9_g": {
    "date": "12/30/2017",
    "text": "Wife and I decided to try this place for the first time. The ambiance was okay. Both of us ordered the bowls - I had the portobello mushroom bowl and she had one with shrimp. We were a little disappointed on the serving size for the price paid. The waiter goofed up my order as usual - maybe because the dude didn't write my order down. Would love to give a higher rating but was not impressed. Felt sorry for my wife because she was actually still hungry after consuming her dish. Ended up dropping by the Chick-fil-a for some chicken strips to make it better.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "j_UzE_LRN9WGghqgYX1JWw"
  },
  "csNvPS4uJZoqSghwlg9lFQ": {
    "date": "8/11/2014",
    "text": "Went here to #Ontheborder, directly after work recently...and I have to say that although the food is consistently great, the service is hit or miss at best, especially during the times between lunch and dinner.    I don't know why, but I have a penchant for visiting this particular O.T.B. in the early afternoons usually between 3-6pm.  I ALWAYS sit at or in the bar area.  The last few times I've been here, it was like the bar tenders and other employees were too busy fixing, cleaning and organizing  things; things like the margarita machine, changing the Dos Equis keg, cleaning the liquor bottles, etc to provide good, attentive service.    If the staff needs time to organize and prepare for the nightly dinner rush, I TOTALLY understand. Perhaps they should consider simply shutting down from like 3-6pm, plenty of establishments do it.  I rather that, then patronize this place and be forced to play second fiddle to a margarita machine...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_wlZO-jKFGEVJnSfWISqQ"
  },
  "wn3r5-knGsF6apMlx5ywow": {
    "date": "6/10/2017",
    "text": "Awesome!! Zack was very timely and good was hot and delicious! Loved the kick the salsa has and the fajitas are phenomenal!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "KqemzujbObYQis2k88heHQ",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KqemzujbObYQis2k88heHQ/o.jpg"
      }
    ],
    "user_id": "7YOgt6KvY1-x0NiHITXt_Q"
  },
  "AJAhKoFXCvtZG2josQdqeg": {
    "date": "6/10/2017",
    "text": "Saturday at 2 late lunch. Just ok I thought. Fish Mango something ok. Drinks where high price. Chips and salsa very good and they offer to get us more.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kQIjUe8Y5VhrVKAtqBXCrA",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Fish mango???",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kQIjUe8Y5VhrVKAtqBXCrA/o.jpg"
      }
    ],
    "user_id": "MInMDgPKmvw28p3EiyYI-A"
  },
  "k2D4lndMAsXf9Z8sJfkgBQ": {
    "date": "1/11/2018",
    "text": "The service is where this restaurant suffers. We had a group of 8 that all arrived at different times. It took 10 minutes for the first ones to get seated even though the place was dead. Once the last of our group arrived our waitress didn't come back for another 15 minutes and then took our order. It took almost 30 minutes to get a pitcher of margaritas and food was another 45 minutes while the restaurant was still pretty quite (only a few other people in the bar area). Food was average but those who ordered endless enchiladas were never offered more and waitress wasn't around to ask. Nothing really worth going back for here.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YDO4b8eCX90_p8J5Nl1z2A"
  },
  "WA9We86erCuEy6_jVrcH4w": {
    "date": "4/22/2017",
    "text": "Came over to grab a birthday lunch. Sat outdoors and enjoyed the weather. Combo dinner and fajitas for two.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Kvyxmf7xwg0N6FSmY9xzAQ",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Combination dinner",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Kvyxmf7xwg0N6FSmY9xzAQ/o.jpg"
      }
    ],
    "user_id": "59z_39OszYhrQpnIlWh9tQ"
  },
  "kKi0hbK-57LWSqFJFURrdg": {
    "date": "11/14/2016",
    "text": "I ordered out here on election night and got the nachos. Walking in the takeout section of the restaurant, there were 3 workers, Not working who casually dispersed once they realized we were there to pick up orders. So I guess the back room is the getaway from work spot. The nachos were HUGE for $11. It looked to be something for a catered event, in a large metal pan and everything. I\"m not complaining. They served them with all ingredients put on the nachos, which I thought was odd for takeout. They should put each topping in a separate container to avoid things getting mess, with the exception of cheese which has to melt. I forgot to tell them to hold the refried beans, which I don't like. So I ended up having only a few bites. Not their fault. What I did taste wasn't impressive. I liked my chips and salsa better than my nachos. I'd give them a second chance, but be sure to request toppings be put in containers.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fbNN2SkBje6ayZg67KqUuw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Takeout stacked nachos. Enough to feed a family. $11.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fbNN2SkBje6ayZg67KqUuw/o.jpg"
      }
    ],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "rvQL4lZDi2avumDb2_1_yw": {
    "date": "7/20/2017",
    "text": "Tonight the food and service was excellent... The new management is making a big difference... We will come back in the near future.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "aJcgNs1SaKepTGSxEidedw"
  },
  "escbr2V4mKS7H94TmQ5I-Q": {
    "date": "10/21/2016",
    "text": "The food was good as usual and the drinks were great. Service could have been better.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4H7IhaCeQ8YMlqW4NUxvfg"
  },
  "63LU2A2bYVZJpZzO-Sqmsw": {
    "date": "2/22/2018",
    "text": "The service at this place is HORRIBLE and management is even worse. However, the server Tia was so sweet and attentive. She really lightened the experience. Thanks Tia!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "kmjYLle0Lpqbfh7xukj2rA"
  },
  "9qiDLvdkOAa0IMcf1aOdNA": {
    "date": "6/1/2017",
    "text": "I have been to this On the Border about 6 times, most recently around 3 months ago.  This is typical tex-mex food that is done in the same style as Chili's, considering they are sister businesses.  I like everything I've had there.. mainly burritos with chips, queso, rice and beans.    I like the aesthetics of On the Border.  The decor is very colorful and appeasing.    I do recall that a few of the times I went to this location, a floor manager stopped by our table to inquire on the level of service and quality of food.  I have come to expect that level of attention at our upscale go-to joint Fleming's Steakhouse, but to receive it here at a mid-level fast/casual type of place is pretty cool.  Keep up the good work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "C40Z0b9b_1cxqriHehY6kA"
  },
  "IVFFbzw6k7yzxVTzQ4r8uA": {
    "date": "8/3/2019",
    "text": "After going half the day without eating my brother and I settled that we would eat at \"On The Border\" we were warmly greeted and quickly seated. Our server Christopher was awesome! He was very attentive and offered up great menu suggestions. He was even able to customize menu items for me to accommodate my vegetarian diet. When you are hanging around Northlake check this place out!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yLEX4av7WmQI4thMT5p1ug",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Appetizer Sampler Plate",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yLEX4av7WmQI4thMT5p1ug/o.jpg"
      },
      {
        "img_id": "SamyXp07dFW-vFA3r47RNA",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Chile Relleno &amp;amp; Cheese Enchilada",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SamyXp07dFW-vFA3r47RNA/o.jpg"
      },
      {
        "img_id": "vCRBPaKfKTPUeottu0Rmuw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Menu cover",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/vCRBPaKfKTPUeottu0Rmuw/o.jpg"
      }
    ],
    "user_id": "UbRTTaGMwOOvlRJ2KvU3ng"
  },
  "09YkRsF3JnnMJ52Sh3IANw": {
    "date": "6/12/2019",
    "text": "Things started great.  We were seated and the server promptly took drink orders and provided chips and salsa.  However, shortly after ordering food, the service became non-existent.  Our server focused all her attention to a larger party, who hadn't even fully arrived.  This seems to be a recurring problem, being abandoned by servers in favor for large parties, probably due to larger tips.  We weren't even finished eating when the server asked us if we wanted dessert or a box, a clear enough sign to me that we were no longer welcome.  The food was average.  The rice was bland but the retried beans were thick and flavorful.  The soup came out kind of messy and wasn't hot.  The other food wasn't very temperature-hot either, which was a disappointment.  The empanadas were supposed to be filled with chicken and cheese, but there was barely any chicken in them, maybe 3 bits like you'd get from a can of chicken.  I did see a manager who was helping out the staff and interacting with guests, but they didn't stop by our table.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lUYtkjtaJT9ATs2hTnXTEQ",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Chicken Tortilla Soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lUYtkjtaJT9ATs2hTnXTEQ/o.jpg"
      },
      {
        "img_id": "3uM53_I3-I3uMSUBYmYvIw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Empanadas, taco, enchilada w/ sour cream sauce",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/3uM53_I3-I3uMSUBYmYvIw/o.jpg"
      }
    ],
    "user_id": "S_khmVj6bZDWDNjztq3fjQ"
  },
  "1_jPfwbikBR3CTCPmE9p2A": {
    "date": "8/13/2019",
    "text": "I always like the food here. I mean its not expensive and the flavors are always pretty good. Can never go wrong with the fajitas! My biggest upset was the service. Very awful we waited a full 15 minutes for our waiter to even notice and we actually had to ask a hostess where our server was! He came to the table once to get our order by that time I just gave him the drink, app and food order all at once. I could totally understand if the place was super jammed but it was very slow and it was a Saturday night I have to wonder if that's why it was slow due to poor service. The manger actually was super helpful he came to our table with the food. Seemed to be helping out a lot I still wonder what ever happened to the first kid who came to the table and said he was our server?! Maybe he quit, will forever be a mystery....",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AfkCJxxD4a318uFM_TrURQ",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AfkCJxxD4a318uFM_TrURQ/o.jpg"
      }
    ],
    "user_id": "WU1jQOBAy5C19xoXV75XKw"
  },
  "zJqMq8qf7EfOeppTfthCxQ": {
    "date": "9/13/2019",
    "text": "Stoped by here for lunch recently. Not a horrible experience. The food was ok. Not a ton of flavor. The service was also ok, but should've been better considering that there was almost no-one in the restaurant. My main gripe would be the cleanliness. The staff could do a much better job at cleaning the floors, tables and the inside of the booths(including the walls and windowsills). I didn't feel unsafe eating here, but I would probably go somewhere cheaper, with much better food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k68iR33jTw-IvzERMAwV7w"
  },
  "LGfAFp_-0k-HcB1YDcELzg": {
    "date": "12/20/2018",
    "text": "I actually like OTB maybe a bit too much per my family. But, I'm a sucker TexMex and I'm nowhere near home so this and whatever else I find must do.    Decided to have my last hoorah here since I'm leaving and man I did myself a disservice. My server continually has wet hands, never uses a server's tray, doesn't try and keep things neat so I decided to take the latest 3 attached pictures and write with the hopes management will see this and consider retraining folks.  It's not the end of the night late but we came about 838pm EST.  Seated and took 6 minutes before being served.  Another 4 to get water and chips. Then, 4 more to get the 1 bar drink ordered at the same time with the food. Yall it's a frozen marg... that comes from a machine.   At any rate, I know they struggle to keep folks here and turnover is fierce but I asked if we should sit in the bar for the drinker but was told we'd be fine in the dining room plus HH pricing.    P.S. I post the timing because the place was Dead. 1 other table with 5 teens and they were wrapping up. 2 tables in the bar and they'd been there. Other servers had been cut.    Look y'all the dirtiest has to be addressed regardless if it's flu and cold season season....too many things are passed by hand, germs and it just looks unappealing.  P.P.S. This is in present tense because I started writing while in the restaurant. And, yes I said something about the salsa appearance and her wiping of her hands on her clothes after dropping things off.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 6,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "MbzJKL1UX8GL80VzTCQBiw",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Upon arrival. The long view so yall can see the burrito wrapper was in the beans. And rice.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/MbzJKL1UX8GL80VzTCQBiw/o.jpg"
      },
      {
        "img_id": "bHXPL0aK-sR2nIgJn2PzBg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Minus the chips, the server brought out this salsa cup that runneth on the side or spilled...idk. while her thumb was in it",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bHXPL0aK-sR2nIgJn2PzBg/o.jpg"
      },
      {
        "img_id": "4a-b7SMHl3vacYPT-AF0_A",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. This is the burrito paper I saved from the beans",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/4a-b7SMHl3vacYPT-AF0_A/o.jpg"
      }
    ],
    "user_id": "r-zUIQPaHzvIyL93wQaoiQ"
  },
  "W4_tRIsz17gz_CGUDB-Msg": {
    "date": "7/10/2019",
    "text": "Came in for lunch. Waiting over an hour for our food to arrive, which it still hasn't. Waitress asked us if we were doing okay with empty glasses and salsa bowls on the table, and when asked if our food was ready she said \"I hope so\".",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5Vo_mcusSmVTSzWNNY2Geg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States. Cheese that&amp;#39;s been sitting out for a while because our waitress failed to check on our food.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5Vo_mcusSmVTSzWNNY2Geg/o.jpg"
      }
    ],
    "user_id": "4yE-pFg1kmLCtcsyI85FuQ"
  },
  "6rp7YedySVXuWsA0RCREOA": {
    "date": "3/27/2018",
    "text": "Gotta love the laid back atmosphere. I normally go after work which seems to be the after work hang out per the crowd around the bar. Who can blame them with the endless chips and salsa and great happy hour drink specials. I had a frozen strawberry margarita and my friend had a strawberry mango swirl margarita both frozen. The drinks are reasonably priced and aren't watered down. They also have a variety of happy hour food items that are available during the happy hour time.  This is a great spot to grab a quick drink after a long days work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D07bBQ8GQnk59jwDeN5WIg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/D07bBQ8GQnk59jwDeN5WIg/o.jpg"
      }
    ],
    "user_id": "pPH3sWKrc8ajeXz-eg_XAg"
  },
  "lFbymcrSQTdIpZs7AnHhCg": {
    "date": "1/16/2019",
    "text": "I am in Huntersville 2-3 days a week for work. There are a dozen or so restaurants that are near my hotel and On the Border is a part of my regular rotation. The food is above average, staff is friendly, and although they have regulars they are just as friendly and engaging to the other customers as they are with the regulars. Thomas has been the bartender on each of my visits and he does a great job",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "J0Ts1q0BljVQ1bPqQdSENg",
        "caption": "Photo of On The Border Mexican Grill &amp; Cantina - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/J0Ts1q0BljVQ1bPqQdSENg/o.jpg"
      }
    ],
    "user_id": "mBZReGogv93Hxw0gJXhK_A"
  },
  "TACH6XeC0q_jBV0rJVEYOg": {
    "date": "5/27/2019",
    "text": "This was my first time at one the border and I was very impressed. Our server Helen was very attentive to our needs and very helpful. Our food came out fast, hot, and correct. I was a little under the weather and even had some specials requests and Helen made sure to provide what I needed without hesitation or begrudgingly. I ordered the chicken chimichanga and my son ordered the kids enchilada plate. Everything was delicious. The manager (didn't get his name, tall bald headed AA male) was also very helpful. I don't know how he did it but every time I had a question I'd turn around and he was there. Thank you for being so helpful customer service andwhole experience was 10/10.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tf7Mer2GGRaatw-ctTkluQ"
  },
  "NWWO4ZLTQWU_kogyCbcV2g": {
    "date": "9/27/2018",
    "text": "Iwent with some co workers the other day around 3pm. The place was totally empty and I would say that the food was okay. Not great. I typically don't eat Mexican food from a chain and I totally understand why I've keep to my guns. The service was fine and the place was clean. I had the taco lunch special. The beef taco good but really really greasy. The brisket taco was a bit dry. Fyi the jalepeno bbq sauce is not spicy at all which was perfect for me.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R5bfKfUHUVC5xEMS6s8lcQ"
  },
  "esZhDPu-9RXoY1-D4H494g": {
    "date": "5/5/2019",
    "text": "These guys just catered a Cinco de Mayo party for me this evening.  I cannot say enough wonderful things about the food, service and value.  The recipes were fresh and elevated!  The delivery and set up was first class.  I could not be any happier with the quality and service.  The party was fun and the food portions were generous - even feeding teenagers!  Thank you OTBMG&C!  I will no doubt use you again soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vi0lg2JVV_yNDF-vmweuow"
  },
  "2XfixHV29xj-vx_0BFm1bw": {
    "date": "9/3/2019",
    "text": "It has been some time since I have gone to this establishment and now I remember why.  The service was not good and it seem we were a bother to our waitress.  I like my margaritas like everyone else but when I see a picture of a big glass and receive one in glass smaller than my husband's glass of soda something is wrong.  If I had to specify a size would you think the waitress would ask.  I guess it was a bother.  My queso was cold probably because I had finished my bland chips before it was served.  I finished my drink before my meal \"snack\" was served.  When I order fajitas I usually get more than 5 slices of chicken, 2 slivers of red peppers, and 1 sliver of a green pepper.  What on earth was that!  I guess the tons of onions to cover the plate made up for it.  I had to ask another waitress for the check.  The restaurant was sooo dirty that the wall of the \"Fajita Grill\" had dirt caked on it like it had not been wiped down in months.  Thanks for the snack and the experience.  Please visit Mi Pueblo or Cantina 1511 instead.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aay36Ktoxsrq8MOFO5mFlw"
  },
  "wQDsiA4nnKA8UDJaicvDYQ": {
    "date": "7/23/2018",
    "text": "I'm not sure what it is about this location but they can't ever seem to get my order right. I came here in May and I ordered the fiesta chicken with queso blanco and avocado on the side. They brought me chicken fajitas. Not the same thing. So the manager came out and they made me another one and it wasn't correct either, had yellow queso on it instead of the blanco. The third time was the charm but by the time I got it, I was full off of chips. I came here on Wednesday hoping for better service and correct order. I ordered the same dish and it came out as ordered unfortunately as I was cutting into the chicken, the chicken wasn't fully cooked. It was sent back, obviously because I can't eat undercooked chicken and then a new plate came back and was great. The manager the first go round was great and he comped my meal. The manager this time apologized and that was pretty much it. The fiesta chicken is my fave dish because you get chicken with queso on top, the seasoned grilled veggies and the fiesta rice tha I like to mix in the queso. It's pretty much all of my favorite things rolled into one dish.  Sadly, I think I need to give this location a rest for a while. I really do love their chips and salsa and margaritas. I also love their brownie sundae but this time the edges of the brownie were overcooked because they were crispy and the icecream had ice chunks in it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "yiKkxcuQdB04PVUW7OgtNw"
  },
  "CM7CqS-cqcE5665MzVuycw": {
    "date": "7/9/2019",
    "text": "This is the worse service I have ever had at any restaurant.The food is bad the chips where stale and the meat was un seasoned the cheese was hard. They got most of my party's order wrong and the service was slow",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciplW041eulZH_VNCOGeaw"
  },
  "V5jBKhSSVxU4lB6JgO0naQ": {
    "date": "6/25/2019",
    "text": "We used to be regulars for the fish tacos; but they have changed the menu. They use a different sauce on the fish tacos now. Not good!! Bring back the old sauce. We have since found another favorite Mexican spot!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dbRiCCNL6HbgExDJZtQ9og"
  },
  "aFvaKfUB3jWlHEp-pUbmaQ": {
    "date": "6/10/2018",
    "text": "Got here at 9:30 pm on a Sunday expecting service considering their hours of operation stated they were open until 10:00 PM  We walked in party of 6 getting ready to consume in their restaurant but we were quickly informed we couldn't order anything on the grill... it's literallly in your name guys c'mon. ON THE GRILLL??? NOT!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TzFdmTmU6PPaDYR7KCLivw"
  },
  "GsWI5vJbK1I_JTq7QBluHw": {
    "date": "5/6/2018",
    "text": "Note to self... NEVER come to a Mexican restaurant the day after Cinco de Mayo. The service was snail pace, once they got to us. The orders were made all wrong, the food was burnt and the redo was under-cooked. The kitchen staff is in some serious need of help, and sleep evidently.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "fZLamEDc5uFR0X7eiSgWAg"
  },
  "UotwTEBGkbhzjgMm-Okg7A": {
    "date": "6/6/2019",
    "text": "THE FOOD IS TRASH. Not seasoned and bland. The drinks were decent but everything besides that was not good at aOn the border should go out of business to be honest. Go to a legit Mexican restaurant and don't waste your money here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uIYMAx-i-qDQMPFsDGR9Xw"
  },
  "zw06gX_iCbrXEW2DUcrndw": {
    "date": "12/30/2018",
    "text": "Friendly staff, nice decor and music but the food was bland it tasted a lot more like texmex. I had an enchilada and a stuffed pepper, the enchilada was just a folded taco with cheese on top almost no sauce, the pepper had little to no breading, the beans were dry and the rice was oily. Chips and salsa were good.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1WC7GsYNhYXX1HdlxUYHxQ"
  },
  "j5Ixs1XonFzFNURug5RU8A": {
    "date": "3/24/2018",
    "text": "Never again,  I'll never return to this location and probably won't go to any On The Border again. I can over look the dirty floors, gross tables and mediocre food. But what I won't overlook is the attitude expressed from one of the wait staff when my child (who anyone could identify as having severe autism) was preparing to leave. He was hurriedly moving towards the door and she's looked at him in disgust and exclaimed \"Jesus Christ\". I made her aware that I knew what she did. She used an excuse that she was discussing UNCC. Maybe Jesus just enrolled at UNCC and this was a complete miss understanding.   But I doubt it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "bBG3iCm-panQ0DzO6GfoOA"
  }
}