{
  "CIktTtpdrF90ZIq6q7dImA": {
    "date": "3/13/2018",
    "text": "The service was horrible! The waitress charged me extra for the margarita I ordered without upgrading the tequila. There was an up charge to have one of each taco and then when they were brought to me they were not served as the menu stated. The person who claimed to be the manager argued with me and the bathroom was dirty!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Mx-hLiOpuepkYqVmsdbPzg"
  },
  "8ldkEf1S7U3JTqUWIQzTJg": {
    "date": "8/16/2018",
    "text": "Had a very good first experience. (Ate before I thought to take pics, my apologies). Chips were thin, hot and tasty. Salsa very good. We also started with a small order of guacamole (half the size & half the price of the version made table-side) Plenty for 3 to share and get our fill without eating too much! Lol.  I had the Texas Rice at the suggestion of our waitress, very good. Basically a plate of Spanish rice topped with grilled steak, chicken, shrimp and grilled onions and bell peppers topped with a white cheese sauce. Generous portions of beef/chicken/shrimp and very tasty. Wife had the fish tacos (3), very nice presentation and each taco had an entire grilled fish fillet,  she thoroughly enjoyed them.  Daughter had the shrimp quesadillas, she also enjoyed hers. Service was great, very prompt, refilled chips and water regularly and very friendly, well-dressed staff. Overall great experience!  Not \"gourmet\" quality, but priced right and outstanding nonetheless. We will definitely be back soon!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hV802LXFrtUJOXwSNrkwXQ"
  },
  "q8_ItKGwuNiNHZWkml911A": {
    "date": "4/27/2018",
    "text": "Good Food and Happy Atmosphere !! Great place for a little fun and Gorgeous Decor  Would of given it five stars if the service was a bit more attentive ...  I do think you should try this place and enjoy a happy, energetic meal with friends and family.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1RLXTYJBX1V1NEu0-aXGNg"
  },
  "D3zbef9jvDCmhnCW3UctcQ": {
    "date": "8/18/2018",
    "text": "Traditional run of the mill Tex-Mex fare. The only thing that stands out is the guacamole made table side by a very sweet waiter. The restaurant is located in a high traffic area that's easy to access from the highway. The entrees are affordable enough to \"forget\" the leftovers you brought with you to the office. The staff is friendly and courteous.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "O4BROgwxEgX4pzqsvRXBYg"
  },
  "c41xhUaNUuwsSy0VUee2iA": {
    "date": "8/24/2018",
    "text": "I was so excited about going to this restaurant. And I had coupons!!! Sad to say I was very disappointed in the food! The restaurant is beautifully decorated. But the tamales were, what appeared to be ground chicken. I will never recommend or go there again!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fLrmcPAcG_-uONsoKTA40A"
  },
  "b8LY4fg9QHhpfuyrezlNfw": {
    "date": "5/3/2018",
    "text": "My husband and I have eaten here several times since they opened. It is a very nicely appointed restaurant, and we like their food. With that being said, tonight was the second time we've waited to be acknowledged by wait staff for at least 10 minutes. Tonight was a Pre Cinco de Mayo party and it was crowded. But we had to flag someone down for service. My husband recently went for lunch and ended up leaving because he wasn't acknowledged and he had a meeting to attend. Food is good, but service needs work.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8hOoPjIVb9DeBviUF_cXfg"
  },
  "xS596XlNbmnxHWE4jiDgdg": {
    "date": "7/13/2018",
    "text": "The food here is delicious, the service is great and the margaritas are amazing!  We had their premium margarita and is fabulous!  Be patient because they are very busy but worth the wait!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zGHtCWY635Ze4-XOCRZtlw"
  },
  "pTsDgHAp2gO3ZEEmAY4bSA": {
    "date": "8/7/2018",
    "text": "Yesterday five minutes of waiting just to get someone to take out drink order.  There were a dozen people walking around talking on their headsets but not a dang person actually helping us.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Pdd2FY9ciP9Ugoiy0x8NBw"
  },
  "gDt5VIq9OJ1ZFsNxxZjI0A": {
    "date": "4/24/2018",
    "text": "I have no idea how this place has such a high rating lol. The margs sucked and the food was v v v v average at best. If you are going here to eat a basket of chips and then leave, five stars. Everything past the chips is a let down.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bRg-O0Cf9JqpowlocJj0Sw"
  },
  "e6pcP17aG9rKQHjQvUvyoQ": {
    "date": "7/31/2018",
    "text": "This has to be one of the worst Mexican restaurants we've ever been to.    Have tried several times with poor service and small portions for the cost. Definitely would not recommend.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J1pAeSJoQEU094ufr5m0lw"
  },
  "q6qvCXERwG22Q1tlS3WQ2g": {
    "date": "5/13/2018",
    "text": "Very good. Beans were quite thin though.  Rice was a hit with my family. Service was fast.   Nice decor and atmosphere.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7AcnFFwJdgXbu3MhyIgP4Q"
  },
  "6VoXWsCq_cYGTYQUr-hACQ": {
    "date": "7/22/2018",
    "text": "Very very tasty, great service!  Pitcher of margaritas - mole sauce was very good, chicken verdes enchiladas also very good!   We would come back for sure if we come back to Charlotte!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "owBJrRz8A7byrCHjFE76Ug"
  },
  "JtLSWfghIISsRFgGnLC_7w": {
    "date": "7/17/2018",
    "text": "This restaurant has gone down hill in a hurry.  Service is terrible.  Had three different servers tonight and no one took accountability.  The server that delivered our food was immediately notified that part of our food was missing.  They forgot all the fixings for fajitas.  After the check arrived, I had to ask for an adjustment and the manager just saw fit to adjust the $50.00 bill by a whopping $2.00 which is considerably less than the missing sides and accompaniments that go with it at the menu price.  Needless to say, I will not be back and I WAS a regular customer eating there at least twice a week.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BQSQZdf7TEohh3SqXtuIcg"
  },
  "zqepHlFMGCIrXJ08L1NGUw": {
    "date": "3/30/2018",
    "text": "Tried this for the first time today. Went at lunch - order the Fajita Texana.  As for the food - great chips! But that's about the end.  The steak had gristle and fat and truly wasn't edible. Chicken was cooked so long that it was hard. Peppers and onions were overdone and stewed.  Staff is friendly and nice interior. But the food just wasn't good at all.",
    "rating": 2,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XbGTSNHj8NxAEX3ARFV-yg"
  },
  "QiHLeGCG4eJUwWHpjQ-9Aw": {
    "date": "7/7/2018",
    "text": "The best service and taste ! Great option after a day at carrowinds  . Will come back",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gxCjKP7N_37M3ODFBQ1p4w"
  },
  "SPX3xJrp6wu5iJy1sn5RaA": {
    "date": "6/3/2018",
    "text": "Wow...  what a shock.  This has always been a stark mom and pop place.  The new decor is fantastic!  The menu covers all the Mexican favorites as well as a few that are difficult to find.  Service was prompt and friendly.  Food was good, salsa and chips were good.  They have done a wonderful job of putting all aspects together, while no part was mind blowing, it is a complete dining experience.  I hope they continue at this level.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "urThcqroWgGhtyArBz0Yzg"
  },
  "cG64l6klzGi6hMvMPd-UyQ": {
    "date": "6/17/2018",
    "text": "Awesome new restaurant in our area. The food is fabulous and the service very top of the chart. We go there often and recommend frequently.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cUXiBrKIZXUrPSP7eBY-ZA"
  },
  "IwJ8iK2XM-YEpC1QAJrcwQ": {
    "date": "3/14/2018",
    "text": "The Food it's awesome great service and the best margaritas we will be back  very clean",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DzrDvl0ig0HG-CNHLeiMTg"
  },
  "tQLOOUo9NdYADCxUAouZkw": {
    "date": "7/29/2018",
    "text": "This place is very close to where we live so we were excited about having a more convenient restaurant.  The first few times we were there, I could not have been more pleased.  During the short time it's been open though, it continues to go downhill with the service and cleanliness!  The last visit was the last straw for me.  I had gotten a refill for my tea which was delivered in a new glass.  I took one sip through the straw and noticed something in my mouth which I thought was a piece of straw paper - WRONG!  It was the remnants of what appeared to be refried beans.  This was definitely not from my plate since my husband and I (only ones at the table) had ordered the black beans.  I looked in the glass and saw lots of bean debris settled on the bottom.  The server came over (only after waving at him) and I showed him the glass.  I felt like he thought I had intentionally put it there but I reminded him that no one at the table had refried beans.  He didn't act shocked and took the glass to the back, and brought me another glass.  No \"sorry about that\" or anything, including not even taking the charge of the tea off the bill!  I'm wondering if the glass had even been washed in the first place.  The three times prior to this visit, the server couldn't get my order right and I didn't order anything out of the ordinary which led to not have food while others at the table ate theirs.  Once, I even told the server that he may want to consider writing orders down so he could hand them to the cooks.  I don't even think the suggestion computed in his head!  While the food is good, I can not bring myself to going back after giving them numerous chances to give them the benefit of the doubt.  We'll drive a few minutes longer to Charanda's or Don Pedros in the future.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "milixvI3Oy4lMhOO4TkZCw"
  },
  "RGmnxtIz4xbvu9Yuxh6Sxg": {
    "date": "4/1/2018",
    "text": "very good food.service was great too.love the new decor much better than the place that was in there before.we will be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gsikUCh3m-Gtr3_AxFNE3Q"
  },
  "M5PWXkEKxetpn8CZPPw7hQ": {
    "date": "1/5/2019",
    "text": "Normally I don't review places or take my time to review anything but I just wanted to congratulate the owners of this Mexican Restaurant \"Margaritas\", I just moved here by Regent Park about a month ago and it's the third time I come here and I am absolutely amazed. The decorations are beautiful, lots of items on the menu, outstanding service. This will be my new favorite place. Had service by Sebastion the first time and a lady name Vilma today, there two amazing servers, for y'all first time visitors ask for them they are amazing and friendly. I was disappointed I didn't get my guacamole made at my table the first time but other than that it's outstanding.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mn-CJ-92Qry6BllKUAzRfw"
  },
  "adAtbeVdF6k__ji5LLAJgg": {
    "date": "9/6/2018",
    "text": "Says they're open until 11. Chairs were up at 9:30 and entrance was blocked off. They need to update their postings.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gk6A1h5JlBNjU9A6rb55fg"
  },
  "Wqp72Foiuv-K86WWmLKOTA": {
    "date": "7/28/2018",
    "text": "My new local favorite.. best I've had in Rock Hill, Fort Mill and Tega Cay.... service and food are both excellent! Chips are served fresh/warm, salsa is always delicious! My favorites are the Texans fajitas and chicken chimichanga's, their rice is also moist and delicious, not oily like some other places.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "92vW5zFtlrcC6mqFSpJYFA"
  },
  "EYtc9rA-ktk7hqdc6fglKw": {
    "date": "6/1/2018",
    "text": "Just no. Do yourself a favor and hit Taco Bell. It's not Mexican or Tex Mex or Mexican American. It's just not good. Chips and salsa were OK, so I had thought that might be an OK sign, but the meal went downhill fast. Husband had a combo with a taco, chalupa and tostada. Besides the taco, not sure which was supposed to be which. Flour tortilla with meat and cheese sauce on one. Tostada shell on the other with beans and lettuce. I ordered carnitas, which I love, but these were gray and had an off taste. Waiter offered a to-go box, but I didn't want to take it home.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "DVS5ceHCDMDt8o5zvv6chg"
  },
  "ewagGoEctvmG70sUcZ_xgA": {
    "date": "9/3/2018",
    "text": "Gave this place another shot and another overpriced, under staffed average Mexican  Wish it were better - I miss the Regent Cafe",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ct84kloEPCkXVvlQn470bQ"
  },
  "ko-xr21uOmOF4TGaeN84iA": {
    "date": "7/14/2018",
    "text": "Was not the great Mexican food I was expecting. I got enchiladas but the sauce was so bland! How can enchilada sauce be bland?!? We also didn't get everything we ordered (but we weren't charged so we didn't bother with it). There are other Mexican restaurants in the area that are much tastier and I would definitely search them out!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nenbhiy5qMBYDRCNIwMOTg"
  },
  "DUcWyfFZb1gPsng5bsSlQg": {
    "date": "8/3/2018",
    "text": "Maybe the 4th best Mexican place on the road.  Behind the 2 food trucks and Panchito's in the Clarion Hotel.  Went last week and the service was less than speedy, the food was average at best.  I lived in South Texas for 12 years so I have experienced great Mexican food and this is not it.  I see a lot of reviews for great Margaritas and since I didnt have one, I cant vouch.  Maybe I need to have one or two to give more stars!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eyKjW3UxcDSDnrgB3oUW-g"
  },
  "K6QkGIJvBarEV1Uerhvm9Q": {
    "date": "7/13/2018",
    "text": "This place is legit. Definitely our favorite Mexican that we've had in Fort Mill. The 3 times we've been, the service has been spotty, but they were busy and mostly friendly. Bonus that they use coupons too! Looking forward to going back again!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Btx9cKEznfJutVCcAIZgJA"
  },
  "v6nNCs6q0Whmt52yURsEIw": {
    "date": "4/20/2018",
    "text": "My husband and I came here to celebrate my birthday. He is not a fan of Mexican food but really liked this place. It was Friday night and fairly busy but they fit us in pretty quick. I loved the guacamole made table side! My husband had the Texas rice which was also great. Hope this place sticks around because it's our new go to for Mexican food!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "GO8OLJcfHy_xxv-_oRNGxQ"
  },
  "AOOdeW0MGJWhBXv8geTP4g": {
    "date": "4/16/2018",
    "text": "Ole! I love this place. I usually judge a new restaurant after two visits, and this place earned a solid 5-star review on all aspects. If the establishment is named after a beverage, have that beverage, and so I did. The house margarita was the same delicious concoction on both occasions. Table chips and salsa are amazing as well. First trip, I had arroz con pollo, and it was outstandingly flavorful, fresh, with delicious morsels of chicken (my husband had the same dish and he raves about it as well). Second trip, I chose the tamales and my husband had one of their burritos. We were once again thrilled with our meals. Service is wonderful, personable, and fast. While you're there, check out the fixtures and decor. Really top notch.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "sNjj-uGmFVHz9rhIxUuvYw"
  },
  "hO7dr5KfOpSb-TqaroUaiA": {
    "date": "3/29/2018",
    "text": "So good! Chips were fresh and warm. Guac was incredible. Had the Yolanda's and they were very good. I will be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "gymcJkCoL1KQ1y2sMmoDcA"
  },
  "6TNlIT6eeJ1ub3YJaixJSA": {
    "date": "8/7/2018",
    "text": "Cute little place hidden on the side of the road. The service was amazing. Our waitress was amazing! Short, very nice & bubbly young lady. I believe her name was Maria. She kept us laughing the whole time. Brought everything really fast. It was a busy night but she was still very attentive. 100% would recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PYSof7SGsmyyWK65l6zGBQ"
  },
  "_vRgXCAmmFXHU4voDK_M_Q": {
    "date": "5/27/2018",
    "text": "Very authentic food and the jumbo margarita amazing! I really enjoyed my first visit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iD0jh6VEfCUhMhg7QrvdjA"
  },
  "3y0W_eh2ytU2NnWzl9xnyg": {
    "date": "5/16/2018",
    "text": "Wish I could give this no stars! I made it to go order and the man was so rude for no reason  I just couldn't believe it! When I ordered things verbatim off the menu he told me that they don't serve that . It says \" large crunchy flour tortilla \" he acted like there was something wrong with me and just got worse from there . I'll never go back here and I will tell everyone I know not to as well. I haven't even tried the food yet but I know nothing could go with this bad taste in my mouth that was left by the horrid customer service and they didn't give me one of the items that they were supposed to in my combo platter . They charged me for three items and only gave me two.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E-4KtxwigRNOsrY_tLDxnQ"
  },
  "cfg2sDmLVqLAsWkXQMSnQg": {
    "date": "7/10/2018",
    "text": "Micheladas are on point! If you don't know what they are, try it! Fabulous! I get mine with Tecate. We have been twice in the last few months, and both times were excellent. Tried different things both times, but the Texas Rice is my favorite so far!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJrnGZEliOHlqyLvb-sSmg"
  },
  "dPy_UBARik5rh0fS8brkyg": {
    "date": "6/22/2018",
    "text": "My family and I came here for the first time today for lunch after hearing many good things about it. The service was amazing, the decor and atmosphere is great, and the food is SO fresh and absolutely AMAZING!!!! It was so good that even though I was full I still didn't leave anything on my plate. The prices are also very very good for the amount of food you get and the quality. I will definitely be coming here a lot. Really hoping the Indian Land location will be just as good as this one!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ErFvQoII4W_jjq0joBufuQ"
  },
  "2bjXggPZQYYKsQp2erjdcw": {
    "date": "5/19/2018",
    "text": "Went there for lunch.  I love the decor.  The food was good.  Not exactly traditional Mexican but very good.  Great lunch prices.  I'd really like to try dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_JHsoFyNbYcorujk3i_hbg"
  },
  "vTLByFwE9xbzOXdxZtIZsg": {
    "date": "5/6/2018",
    "text": "Let me preface this with, \"We are from Phoenix, so finding good Mexican food is rough in North Carolina\". Having said that, we've hit quite a few Mexican food establishments in the months that we've been here. None have come close to our standards in Southwestern Mexican food. That was until today. Margaritas was great, best Pastor Tacos in NC. The California Burrito was pretty good too. The description of nacho cheese topping put me off a bit, so I ordered it on the side. Turns out, it was really good. Should be renamed Queso Blanco instead, more inviting. Hubby had the Mexican Gin & Tonic, it was very refreshing! We look forward to coming back & trying more dishes.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JKxlPl2c1DTm4BPKPsqj7A"
  },
  "cLscrxu38h0C3Vt_4zs3cA": {
    "date": "2/25/2018",
    "text": "Have been waiting for this restaurant to open. We went Sunday after church, going in the atmosphere was not that great but was greeted and seated. The waitress was ok but not very well versed on menu and not that helpful. When we got the food it was cold seemed to have set longer in window than it should have, finally got someone to take the food back, couldnot find our waitress. When the food came back the plate was hot but not the food, I would rather have hot food instead of the plate. Hope the restaurant gets better, maybe this happened because it had opened on Friday. I will give it another try in a couple weeks.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NEKcU9j8Q_I-rbEJrMPRXQ"
  },
  "2lSL6aLKEXCO4rg8i7SV6w": {
    "date": "4/26/2018",
    "text": "I have been twice to get food to-go and it was great! I had Texas Rice and it was by far the best meal I have had in a while. Such a good place. They are new so I wouldn't expect teenagers to know every bit of the menu. Also would expect hiccups with a younger staff but food was by far the best Mexican food in Fort Mill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GeIi1-3Y2YRFEPI8PGrNdQ"
  },
  "MFPlEMI52fPZjOURzDBfNQ": {
    "date": "3/28/2019",
    "text": "We had a group of 10 in for dinner. We were seated in a timely manner. Once saeted, the warm chips and salsa were a good start. Some in our group ordered drinks from the bar: margarita, mojitos, beer etc. All were good. There was a wide selection of menu options to choose from. The orders ranged from a taco salad, fish tacos, shrimp cream dish, to a chicken and shrimp dish. All were good. No complaints. I ordered the Camarones con crema. It had shrimp in a white cream sauce served with rice and beans. It was good. My wife ordered the shrimp and chicken. She loved the chicken but gave me all her shrimp. She is not a fan of Mexican shrimp. Not sure why she ordered it then but I liked it. Loved the atmosphere. There were several birthdays celebrated while we were there. Fun to watch. We would go back again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lU1h3uJLBcRLfg4Mpxod1g"
  },
  "r7p43qh6L2UldmLeAbvVsQ": {
    "date": "4/17/2019",
    "text": "I've been in the mood for Mexican food lately especially the quesadillas. This place had everything I wanted the chimichanga was delicious. My family and I will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RozT_LAzJAHZxF5qfTih5A"
  },
  "zQsva7qT2uKnw2dX7BEdVg": {
    "date": "2/27/2019",
    "text": "I love this place and come here on a regular basis. The food is amazing and the staff are all nice. I had to deduct 2 stars bc the meals dont come with both rice and beans as it should, and because the music is so loud its like walking into a club instead of a restaurant. No bueno!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "36V5ou8KWqGEHn2vIHOY0g"
  },
  "ZpNux_qgKUHqeaSLZGgbOw": {
    "date": "7/12/2018",
    "text": "I was intrigued to try Margarita's when I first saw the sign near my house. I have mixed emotions about the place because there was some things I liked while some things I didn't. The prices are great, the food is either good or ok, but the service is not the best. My favorite part was definitely the chips and salsa because the chips were perfectly fried and crispy without being too oily. The salsa had good flavor and was perfect to be picked up by a chip. I also tried some of the guacamole which was very good and chunky (how I like it). I shared the chicken flautas with my mom and they were good. Not great, but good. The portions were kinda small but I guess you get what you pay for.... The waiters and waitresses were VERY new because they had no idea where the restroom was. Or what the price of the guacamole was. They WERE nice however and were always ready to serve you. In conclusion, I wouldn't necessarily choose to come to Margarita's but I wouldn't refuse either.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "J6D89t0k1ZusSaFNCClXGA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J6D89t0k1ZusSaFNCClXGA/o.jpg"
      },
      {
        "img_id": "zwWiJYJcrobDXFPmLXSjSA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/zwWiJYJcrobDXFPmLXSjSA/o.jpg"
      },
      {
        "img_id": "KJ8qh6TQ3pLl_kyiqFqV8A",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/KJ8qh6TQ3pLl_kyiqFqV8A/o.jpg"
      }
    ],
    "user_id": "uoFMF4culI4Z7_3Cwws3JQ"
  },
  "S96A6Nxnix7GOzAcOTYQgQ": {
    "date": "5/21/2019",
    "text": "We had a group of five and everyone loved their food and drinks. The wait staff were friendly and efficient and made sure you stayed hydrated. Loved the organic margarita!  Beautifully decorated, yet gave a friendly vibe.  Try it, you'll like it",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PivYMWWzPs70AdUf6bypQA"
  },
  "RY_MIBd6v8SQPZWhL4hbhQ": {
    "date": "4/29/2018",
    "text": "Came in on a Sunday afternoon. Not too busy but not slow either. I was greeted immediately and taken to a table. My drink and chips came out within minutes of placing the order.  I had the Nachos del Mar. They rocked!!!! The shrimp was cooked perfectly and the entire things was over the top amazing.  The server seemed a little confused as twice he started to ask a question but changed his mind and left. It didn't matter. Great food. Great service.   First visit and I can say I love this place and will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "niARP0oRQHUrpkhmv6q6og",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. A good start",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/niARP0oRQHUrpkhmv6q6og/o.jpg"
      }
    ],
    "user_id": "-MSNjGYgsGmRQHHG-1wbjw"
  },
  "Erpfbg4hxts81By2bq_ChQ": {
    "date": "5/24/2018",
    "text": "Great food and the staff was great too! I love the Mexican music l as it completes the atmosphere. Can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "dvq6mnplZkKh0q2TYQJsGQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/dvq6mnplZkKh0q2TYQJsGQ/o.jpg"
      },
      {
        "img_id": "Ry8R_iV2Ihj4VwjcP7xoIg",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Ry8R_iV2Ihj4VwjcP7xoIg/o.jpg"
      },
      {
        "img_id": "oDTlZ7wbF5AbncdRESPGEQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/oDTlZ7wbF5AbncdRESPGEQ/o.jpg"
      }
    ],
    "user_id": "5YonXvqdOyzYTmePmE60qA"
  },
  "xCO7ZLof4_BPfhvuXvKHSQ": {
    "date": "6/9/2019",
    "text": "This food was amazing and my friend Caleb Loftis has a great birthday there. And I wrote this review because I want Ele to have a promotion he. My dude has been  working hard. So when your there tell Ele he needs to a promotion. #ele",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mzTgt44UIVDkw2Z_6fLJ2g"
  },
  "TKCRcr0EKdXwwF5raImZow": {
    "date": "6/3/2018",
    "text": "Four is maybe generous, but we have been twice now and been pretty pleased both times.   First off, I really like how professionally dressed the waitstaff is. No leggings, short shorts or bed head in site. The waiters are neat, clean and well groomed. The interior is clean and well done.   Out of our two visits, we've only had one big disappointment and that was the chile relleno. That is my go to at every Mexican restaurant I've ever been to and I've never had know quite like Margarita's. It was a boiled pepper with zero batter and then stuffed with plain, unseasoned ground beef. It was not good at all - taste or texture wise. Enchiladas, fajitas and other choices have all been standard for this type of place.   Honestly, there aren't great choices for Mexican in Fort Mill so you probably can't go wrong here.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "iWoCUArqFmXvTBM2jsMs5g"
  },
  "PDU1P1tGC8dh0rJNsXfdAA": {
    "date": "4/13/2019",
    "text": "I'm positive the seventh layer of DOWNTOWN HELL has better food than the shit-storm I was served tonight. First, the waitress' hair was falling into the food prep area for the table side guacamole. Second, she somehow turned avocados and other ingredients into LimeAid! Yep, she put so much lime on the guacamole that it has possibly removed the enamel off my boyfriend teeth. Third, how do you screw up a salad? Well, they did it. A simple fajita taco salad and it was a complete inedible mix up of lukewarm ingredients and undercooked shrimp. And I don't know how they forgot the cheese!!!! But I'm  sure Larry, Moe, and Curly in the kitchen don't know whether to scratch their watch or wind their asses let alone be bothered with putting cheese on a salad. No tea refills. No hot sauce refills. We told the waitress the food was horrible, she smiled from embarrassment or in agreement and walked away. The health violations alone warrant a health inspector visit. I believe even Taco Bell provides its employees with food handling safety information. Margaritas in Fort Mill obviously does NOT. Unless you want a case of explosive vomiting or diarrhea DO NOT EAT HERE.",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Lxqb4dYnrAPNizKbhEFaMA"
  },
  "tiXJ86Z1QhgNPYCxKer6Lw": {
    "date": "1/27/2019",
    "text": "I was sad to see Regent Park Cafe go. Then I saw this place there and I was super skeptical. \"Another one?\" I thought. We went today and I was actually glad we tried it! Chips are thick and WARM. Salsa is super mild which was good for my mother in law. I of course prefer truly hot salsa but it's not a deal breaker for me. The Margarita was great. And I do judge a place on their quesadilla. I ordered the shrimp quesadilla and the rest is history now. I HATE red sauce in a shrimp quesadilla, and this one had NONE. Shrimp were a perfect size. Perfect portion, not small and not too much. Waitress was very attentive. I wouldn't mind coming back for sure. One of the better Mexican restaurants I've been to!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qAbT2H3R2G4-D9QisezZAw"
  },
  "-KhuUGjSJxsh78MparnfxQ": {
    "date": "5/15/2019",
    "text": "My go to Mexican restaurant, love the food and drinks. You can always get something new every time you come with their extensive menu items that are always sure to please. Great atmosphere and decor.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cuvVLJ7ynKLS8ZycQ5WXqg"
  },
  "A6CMj0LZR4n3KqARwQ1D8Q": {
    "date": "10/12/2018",
    "text": "This was one of the best Mexican restaurants I've been too. The food was on point and coming from South Florida where I've ate at quite a few this was magnificent and our service was great too. I will be going back the next time I'm in Ft Mill.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Vb8vIckox-4UWop3aJ2RFw"
  },
  "LkIVmE9f6q44Dml50oyZNw": {
    "date": "2/10/2019",
    "text": "Have been wanting to try Margaritas since it opened and I did today. We had out of town company so we were hoping for a good experience but it was great! We had table side guacamole to start off and it was so good we ordered a 2nd one. The food and drinks were delicious and the service was great! I really enjoy the ambiance as well. A lot of work was put into the decor and it does not disappoint! We will be going back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J3E9g1Fug1HXt-eCE1z0Tg",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Wall mural",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/J3E9g1Fug1HXt-eCE1z0Tg/o.jpg"
      }
    ],
    "user_id": "g9j_x7qwEBkDx8gtVIO-Zw"
  },
  "UIX8WcGz95XpYcEIiMtUFg": {
    "date": "10/16/2018",
    "text": "We first visited on a very busy Friday night. Our first thought was it must be a good sign if it is busy. My husband and I chose to sit at the bar to avoid the wait. The bartender talked my husband into a different chicken dish than he wanted it and it was just \"ok\" in his opinion. I ordered two steak tacos with beans and was served two chicken tacos and no beans. I decided to just eat the chicken anyway because I didn't feel like waiting any longer for my food.The chicken was lukewarm at best. We were so hopeful we had found a great Mexican restaurant, but nothing truly was great about it.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "3qD8Q4Ua0oTqHlxxmcogkA"
  },
  "fLKa7B_kIfDB9JB65LEPLg": {
    "date": "10/9/2018",
    "text": "Chips and salsa were great, but food was average at best. Paid extra to get guac made table side and had to keep mixing it ourselves as the preparer was our server and acted like they had never made it before.  Location is great as there are not many quality eating options around it, but food was not good enough to make us want to go back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "9QXTEffSpdhzSc7HQCkmmg"
  },
  "vKnLsmF1R9ZN2ZPrcHgr-g": {
    "date": "9/24/2018",
    "text": "Fun atmosphere, good food & drinks & mostly great service. Wonderful neighborhood gem. It's a favorite local spot. Some of our favorite meals are the tamales, tacos, burritos & chicken soup. The guacamole that's made at your table is great. Margaritas are pretty good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "6ZBByv5PBzmX-I_6kivjHA"
  },
  "sn19m3vNrlAVMmJ6bwBfzA": {
    "date": "4/17/2019",
    "text": "This place went down hill fast. Their service has never been good. But recently it has worsened. Tonight is by far the worst experience I have ever had dining. We ordered cheese dip 30 minutes ago and we are still waiting. Our server has said cheese dip coming. Asked for soft tortillas told they don't have them. Lie. Drink refills slow, server very bad. Hope the food is still good",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rIx2KbRcaj4_-4oQXgiNdw"
  },
  "CpqZ5YzUz6cGVZHdjXMuTA": {
    "date": "4/24/2018",
    "text": "This place is bomb af. The flavors burst in your mouth. Food is seasoned so well. I was pleasantly surprised. Not a mediocre Mexican place by any means. Although if you suffer from anxiety like I do then the humongous menu size may stress you out. There are literally 8 million options to choose from.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "y7LCq7uBNu_4fQHGzUE5rw",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Chipotle chicken. Bomb af.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/y7LCq7uBNu_4fQHGzUE5rw/o.jpg"
      },
      {
        "img_id": "1mUaPGYCedeI3-JGnEEOww",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Texas cheese dip. Bomb af.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1mUaPGYCedeI3-JGnEEOww/o.jpg"
      }
    ],
    "user_id": "vjilRqIawD-Y6R0l1NQsbQ"
  },
  "jGN0L9UWayi7XCl3EDmlVQ": {
    "date": "12/13/2018",
    "text": "Reasonably priced, good food, nice atmosphere and friendly staff. We live near here and like visiting often.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AX5HW8ghrBUNE705W2xf9A"
  },
  "-mjlUvWqFynS2TFzE-gsZg": {
    "date": "6/25/2019",
    "text": "Update: fajita taco salad and steak tacos are da bomb yo'!!!!  Ate here 3 times now and everyone was wildly pleased with their meals.  Pork Carnitas which I can NEVER get right at home - amazing melt-in-your-mouth carnitas. Cazuelon - I might be spelling it wrong but it's steak, chicken and chorizo with a cheese sauce drizzled on that's so fantastic I wanted to cartwheel but I'm too fat and old and that's how you break a hip.  Chimichangas- yum and different than any I've ever had!  All the other dishes we've had were great - burritos, enchiladas, poblano pepper - fantastic.   Was there with 2 seniors, 4 adults and a child these 3 times and everyone was pleased. The 2 seniors didn't think anything was too spicy, the adults adored the margaritas and the child was happy. Bonus.  Service has been excellent each time. Very knowledgeable and great recommendations from the waitstaff.  Only con is I wish they had a hotter salsa option with the chips. Some of us do like a little heat. Not the kind that burns your butt the next day. But a little would b  The worsts:",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Rp8gHwTBWf8KD4ig5Xp7-w",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Pork carnitas (back) and Cazuelon in the front. Both amazingly awesome!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Rp8gHwTBWf8KD4ig5Xp7-w/o.jpg"
      },
      {
        "img_id": "WemjlTt8hKObFVlUJ8yAFg",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Amazing Margaritas!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/WemjlTt8hKObFVlUJ8yAFg/o.jpg"
      }
    ],
    "user_id": "KmSrtnyJqj9QLe5FTwuNgQ"
  },
  "CPGw9q13sSp1xFvLxRV6uA": {
    "date": "7/19/2019",
    "text": "Ultimately the experience I had at Margaritas with coworkers was okay. The margaritas were pretty good (as one would hope!) but the food was pretty bland. The salsa to begin with was soupy tomato sauce with no kick. I get that not everyone loves spice but it felt like there wasn't any seasoning whatsoever in it.   I was initially excited about my entree - a sampling of one of each enchilada. They were all OK. The service was a little inconsistent with attention at the front end of the meal and difficulty getting another drink or water refill toward the end. Ultimately I felt like the bill was a bit much for the experience.  Nothing was terrible I just feel there are much better options close by.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wbvjiDpw0FoZDeqbzAIcDQ"
  },
  "wdTZjjV3J2ghDg1o5vNuSw": {
    "date": "3/27/2019",
    "text": "First time here and I got the Texas rice and an order of guacamole to go. I called the order in and it was ready by the time I arrived.   The Texas rice is the ultimate indulgence! Steak, chicken and shrimp with peppers and onions over a bed of rice smothered in queso! I mean doesn't queso make everything that much better?! Yes!  I'll def be back as my brother had Arroz con pollo and that was promising as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wWbw9THF-LLuL6JfiyCbbA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Texas Rice",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wWbw9THF-LLuL6JfiyCbbA/o.jpg"
      }
    ],
    "user_id": "ma1F-ZhIkbtfZUAstcGsqQ"
  },
  "7LEV_b0GzsRlH-tDE3--Hw": {
    "date": "7/13/2019",
    "text": "I couldn't wait to try this mexican eatery , this building has been so many places to eat but nothing sticks. I believe this eatery is going to last, I was not disappointed.  I love the decor inside very unique. Meet some friends for dinner an I ordered the shrimp taco salad. I was very impressed my shrimp was cooked perfect an loved my taco salad an shell. The chips   An salsa you are served loved the salsa I dont like spicy it was just mild great flavor. My friend had the soup an guacamole she said they were both delish. We will be back if your near carowinds or fort mill area stop by for a great mexican t",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wXgIubj0tZbW1Jc3C9qlxQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Chicken flautist I like their taco salad better",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/wXgIubj0tZbW1Jc3C9qlxQ/o.jpg"
      },
      {
        "img_id": "_CW127Z32g_drFrGHf627g",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Chips an salsa",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_CW127Z32g_drFrGHf627g/o.jpg"
      },
      {
        "img_id": "pBIipZoNQXsDF6PLcHWvgg",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Soup",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pBIipZoNQXsDF6PLcHWvgg/o.jpg"
      }
    ],
    "user_id": "6owWBv_F8Tqti4zmnn2ymA"
  },
  "pbcxiuH5MQbhnylJqiu9FA": {
    "date": "8/8/2019",
    "text": "Our last visit will really be OUR LAST VISIT!  I don't know what happened to this place.  We had the worst service and the worst food we've ever had.  Our server was, to put it lightly, inattentive.  There were no refills at all, two of us got food TWENTY MINUTES before the other three, and we three of us were sick the entire night after eating here.  I don't know what happened.  This used to be our go-to place for Mexican food.  We'll be switching to one of the other restaurants in the area instead.  I think it was an off night, but we're not willing to risk trying it again to hope for a good day.  I'm honestly very upset about it.  We loved this place.  I have to think ours was an isolated incident, but we're not going to chance it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DBtRdCYGuNQLsYAX0XMOWw"
  },
  "Rz9dp9wA5XNP9KZTCAF32w": {
    "date": "11/23/2018",
    "text": "This Is going to be my new place! I met a few friends and they recommended this place. Ramona was our server. She was very nice. I like how they wear earpieces like retail so if they need to ask a question or find something out, it can be done pronto.   They use a fun looking hot dog cart to make guac tableside. Boy it was good! I seriously regret getting the largest size they sell!  Their house salsa is good  They do charge for salsa verde.  Drinks are good. Only had 1 I did not like.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "CzjwW1-47lFCNpp01pH4yQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Seafood combo with shrimp",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/CzjwW1-47lFCNpp01pH4yQ/o.jpg"
      },
      {
        "img_id": "QFToX2qtG2kbshAllWk4xw",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Great flavor",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QFToX2qtG2kbshAllWk4xw/o.jpg"
      },
      {
        "img_id": "PW3QVSEBxQvxi9UCnnreaA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Tableside guac was excellent!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PW3QVSEBxQvxi9UCnnreaA/o.jpg"
      }
    ],
    "user_id": "YZZaaZGdZ08L1h3XWPrwJw"
  },
  "kGMZWxu-C0xeb4MEJ0h-VA": {
    "date": "5/21/2019",
    "text": "Wow, I'm impressed! There are quite a few Mexican restaurants that have opened recently around this area; La Autentica, Jalapenos to name a few (not to mention the food truck which is amazing) and all are good to very good, so I was a surprised to get another one in Redstone. Well, I believe this place will do just fine. Food is a bit pricier than the others in the area and the portions are smaller or have less sides included, but the taste for the same dish is by far better! Texas Rice is amazing the cheese sauce they use is to die for. Fajitas a tender and full of flavor and the seafood dishes seem very fresh. We'll be back for sure...oh did I mention 6$ Margaritas all day every day (flavored included)...Big and great!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vH0RHYdDnzIXSUWmZbBo7A"
  },
  "dxxYdHZMsyPDiinVcSLrDA": {
    "date": "6/29/2019",
    "text": "My new fav \"Cantina\". Loved the decor, service, food and margaritas!!!!  My hubs loved all the TVs to watch sports and it was a fun place!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6FDqt0NsDnvmlnQ7q_ZEMg"
  },
  "cNq-D1Euc-xsBW0d9_Ql7g": {
    "date": "6/5/2019",
    "text": "Ahhhh overall wasn't happy with the service.  Had to ask 4x for my drink. Let's not even discuss refills ugh",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5NnHKtrDFZQm48NP7o3Jhg"
  },
  "aeLfjSyMGrPhX5qeRc3kdA": {
    "date": "7/3/2019",
    "text": "Very clean, good service and food was good, presentation excellent, big portions, nice ambiance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vc_jr-wSZvljiuFjeDFRhw"
  },
  "X0QXB1H8n5l8j1SHHOQqXw": {
    "date": "5/31/2019",
    "text": "Everything is good here but when you ask for guacamole, make sure you specify FRESH guacamole. Other than that you can't really go wrong here",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DGaiqKzuZxc9HY2WOcyLoQ"
  },
  "40iRzNKUCmJMFMo8uHybdw": {
    "date": "4/3/2019",
    "text": "I went to lunch with my son.  It took a long time for the food to arrive, which was ok because we had chips.   Then my food arrived & my son's cheese quesadilla arrived about 5 minutes later (cold).  Not ideal to have the kids meals arrive last.   When it was time to pay, when we finally flagged down the waitress she brought our bill & took my card.  It was at over 10 minutes of waiting for her to return.   What are they doing with my card???  That is way too long.   The food was good but the service was very slow.  They were busy, but it was excessive.  We would try it again, but only if we were not in a rush.  Also, I was never offered a refill on my water.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "r8qRv3Ujg_3TqpZIuBoZ4Q",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Lunch - chicken enchiladas.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r8qRv3Ujg_3TqpZIuBoZ4Q/o.jpg"
      }
    ],
    "user_id": "PtbIDOfyMPa0k_xre5QObA"
  },
  "-7fZzdXtYYrnMW-xMFbnGQ": {
    "date": "6/3/2019",
    "text": "Great local Mexican spot.  Service is fast and efficient.  Food is standard Mexican fair, but very tasty.  Our favorites are the Texas Rice and Carnitas.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lDrt4a7ZwRnudX8lC0LH3A",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Carnitas!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lDrt4a7ZwRnudX8lC0LH3A/o.jpg"
      }
    ],
    "user_id": "VwtVcZH7w0FInJTVmsamSw"
  },
  "26ausLdVeFLeVGsRZEnwkg": {
    "date": "5/25/2018",
    "text": "Drinks are great, they even have a gigantic margarita that truly is gigantic!  Friendly greeting, super attentiveness by staff.  Chips are hot thin and perfectly salted, we ordered hot cheese dip, the table salsa is a little spicy.   Ordered beef tips and got shredded meat,  like a tender pot roast in my quesadilla.  Was supposed to get beans, rice was tasty.  Next visit will be the 29.99 gigantic drink, just because.  99",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4YsgLIBOfyCZnYn27g2fyQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Good margarita!!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4YsgLIBOfyCZnYn27g2fyQ/o.jpg"
      }
    ],
    "user_id": "XE36pmSiByd4YtSiPkn9_A"
  },
  "3QejX1Og125p7T8yrb8oNA": {
    "date": "5/13/2018",
    "text": "We came for dinner to try out the new place in the neighborhood. Service was great but the food is not like we get at other more authentic Mexican restaurants in town. The portions are small and every combo does not come with rice and beans. Chips are on the thicker side and the salsa is thin.  Not sure this will be our new fav place",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "mF79PD-nl2NfwA2U6fwWRA": {
    "date": "7/3/2018",
    "text": "Service is great!  My husband liked his food very much, The Texas Rice.He liked his Margarita too  I didn't care for the Flautas I ordered, they were deep fried and greasy, very little meat The decoration is nice and the place is large and clean. I would give it another try and order something different next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "maYBIzKwUDMUUjtG7IA5Iw",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Flautas and Texas rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/maYBIzKwUDMUUjtG7IA5Iw/o.jpg"
      },
      {
        "img_id": "MaNENpjEANDEc6pYBHBjlQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/MaNENpjEANDEc6pYBHBjlQ/o.jpg"
      }
    ],
    "user_id": "v838Is3l73qF7-WerxxaMA"
  },
  "tzjFu8rBpEoZ8KPXG2VAcA": {
    "date": "5/11/2019",
    "text": "Great food. Fresh ingredients and great taste.  Enjoyed music and crew were friendly and professional.  Will definitely return.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eG2g__1MsePhdQ6pQKn1Nw"
  },
  "yzxI57A__QhjGQenajge1g": {
    "date": "10/28/2018",
    "text": "They had good drink specials. Very clean bathrooms. Our waitress was Maria, she was very attentive, we enjoyed our service. Huge menu!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "IqrexeeuClkr689S8Ome3Q",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/IqrexeeuClkr689S8Ome3Q/o.jpg"
      },
      {
        "img_id": "-5rQfoS_vTBxiH2vBRyX6Q",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-5rQfoS_vTBxiH2vBRyX6Q/o.jpg"
      },
      {
        "img_id": "uADhO2R8jqk8R2YFmY5VFA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/uADhO2R8jqk8R2YFmY5VFA/o.jpg"
      }
    ],
    "user_id": "vypxFkqjgyQ7fE2BVfVsyg"
  },
  "A86fA2fX_Fj138E79angwQ": {
    "date": "3/19/2018",
    "text": "Wow!!! This place is legit! I've been here twice in 10 days and both visits have been fantastic!   Service.... superb! Friendly and helpful and not at all pushy or dismissive.  They know the menu, they offer recommendations and they haven't been wrong yet.  The drinks, strong.  Great margaritas and cocktails.  The food... OMG soooooo good! I had the Pina Burrito on my first visit and almost cried out of happiness into my plate.  Second visit I had the Chipotle Enchiladas, also amazing.  The fajita burritos are also the bomb!!!!   I love the decor! The light fixtures are so cool and you'd almost never believe this used to be a counter diner.  Great sculptures and so so clean!  Please give this place a try!!! It's a must!!! Ask for Ely, he's the best!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "1VsSpK80LHxRDq6Z26gjLQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/1VsSpK80LHxRDq6Z26gjLQ/o.jpg"
      },
      {
        "img_id": "YJRGZRC6WaszhArwYhuzAQ",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States. Pina Burrito, must try!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/YJRGZRC6WaszhArwYhuzAQ/o.jpg"
      },
      {
        "img_id": "xbvhxqJixPYsFpGdXPfUBA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xbvhxqJixPYsFpGdXPfUBA/o.jpg"
      }
    ],
    "user_id": "IkTOcYE1S8NYX94cPK15NA"
  },
  "aIuMjh8AYNimdLT3ihBvww": {
    "date": "2/27/2018",
    "text": "We took the family here on Sunday for dinner. We had a really nice experience. We were greeted and sat right away. Our waiter so super nice and knowledgeable, he checked on us sufficiently as well. He made sure my kids were happy, that makes me happy :)  The restaurant itself is beautiful inside, I can't even believe what it used to look like when it was Regent Park Cafe. I mean... a major step up. The decor is perfect.  The food was really good as well. I got the Chimichanga, like always. It holds up really well, I wish it came with rice but that's my own issue. My kids both got the kids taco with rice and beans... they LOVED it. I'll post a picture to prove it! The my mom and husband had no complaints either, everything was yummy. Fresh Guacamole... what!! Made table side, my kids thought it was so cool. Bonus, it was delish.  The margaritas were my favorite, not weak at all and delicious. Just how I like them. I will absolutely be back here. I can't wait for happy hour, I'm going to tackle that next.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 9,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "J5SlYzQaqJkVKA5zn6OzIA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J5SlYzQaqJkVKA5zn6OzIA/o.jpg"
      },
      {
        "img_id": "bl5c5quKH7s16TOz09leZA",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/bl5c5quKH7s16TOz09leZA/o.jpg"
      },
      {
        "img_id": "Cfbzus5u0UBYUrAmixyhVw",
        "caption": "Photo of Margaritas Mexican Restaurant - Fort Mill, SC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Cfbzus5u0UBYUrAmixyhVw/o.jpg"
      }
    ],
    "user_id": "QFtcFkrpsPVhx91b8veWtw"
  }
}