{
  "rcvlQsi-Lb7j2K4BWzshqg": {
    "date": "10/4/2010",
    "text": "This is a good lunch spot for somehthing healthy and quick. The food is fresh and I really enjoy their slaw - no mayo here YEAH - I'm not a huge fan of the mayo.   I don't adventure out much here for me its always the protein plate - chicken, slaw, and onions.  You can definitly tell its a chain but they keep the place clean and the service is great...if I'm in the area I'll stop by - but I won't drive outta my way to come.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xJafm7vGSkUI5ocgYkCWkA"
  },
  "AepXzYEMuDjXxg1ndoEHCg": {
    "date": "4/28/2014",
    "text": "Ok MAYBE I came in on an \"off\" day but I had the most irritating experience. I work in the service/restaurant industry so maybe I notice more than most. I walked in and I would say a good..10 tables needed bussed inside, I decided to sit outside and literally every table had old plates and cups on them, I had to bus my own-that should never happen, especially considering they weren't busy? At all. I got our food I got the Greek chicken pita- it was so greasy it fell apart during the first bite and wasn't even salvageable lol I just got a fork and ate it that way.... It was enough for me to opt out of Zoe's in the future.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sCnXsDTJcxKEwiSfew2JGg"
  },
  "n-FNRd6DFQeFCjInKtC7Fw": {
    "date": "9/10/2010",
    "text": "I like Zoe's Kitchen. It is a little corporate-y, and it is clearly a chain that is trying a little too hard not to look like a chain, but the food is awfully good. I like it that it seems like almost every item of food has feta cheese in it. I'm a fan of the feta.  I also like all their vegetarian options, and it's not a bad place to meet a friend for lunch. There are some surprisingly cozy little nooks where you can tuck away and talk, which is nice. It doesn't hurt that it's right around the corner from Trader Joe's, too. I am always looking for an excuse to go there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lhWPrEBzorygXA4TpimQ3g"
  },
  "G3fyUjARGxlZREwfhV180g": {
    "date": "9/19/2010",
    "text": "So after a quick trip to Best Buy, we finally made it to Zoes for lunch today.  It was a-ok.  Didn't exactly knock my proverbial socks off, but it was good nevertheless.  It was nice to have a speedy healthy (or at the least, healthy-ER) option amongst the many fast food places in the area.    The atmosphere was nice & bubbly with bright colors everywhere and even childrens artwork on the walls along the booths.  I like the way the tables & booths are arranged in Zoes; provides a feeling of intimacy while still being open and airy.  That's rare (and welcomed) in an establishment like this.  Service was friendly and quick.  The guy at the register somehow ran my order & gave me a receipt but didn't actually run my card - then had to track me down at our table & re-do it.  Things like that make me uncomfortable (so I'll be watching my bank acct online), but overall not a huge deal.    I went with the Lean Turkey Pita and grilled veggies as my side.  Gotta say it was yummy.  The pita had slaw in it, but it wasn't your typical \"mayo\" based slaw - was more \"light & airy\" and also had either feta or blue cheese crumbles in it.  The grilled veggies were good, too, but a tad heavy on the mushrooms (broccoli, red onion, carrots, and mushrooms).  Portion size of the veggies was kind of small, but for a reasonable lunch it wasn't bad.  Might be too small for dinner, though - but then again if you're doing the whole portion control thing, it's ok.  Partner had the Club Pita w/grilled veg.  That was tasty & came with a bit more \"stuff\" than my samich did (grilled chick, ham, cheese, lett, tomato).  I had a bite of his and thought the chicken was well seasoned. He also tried out their Hibiscus tea; thought that was quite nice (but note, it isn't sweetened, so you may need whip out the Splenda!).   We paid about $20 for those two plates, the tea and a chocolate milk (for me).  While there are better values to be had, it's about average for Midtown and the type of food since there aren't that many \"good food fast\" style eateries around.  We would certainly go back when in the area, but not necessarily make a beeline.   Although I do wanna go back so I can try their shrimp kabobs - those just sound too yummy!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "hI-HUA-vrbZjso7N3W42vg"
  },
  "Og9ZhXyzJ_0HbNqAJ_vxiw": {
    "date": "5/20/2013",
    "text": "Not sure why we keep coming back. The kabob platter is good and consistent, but overall flavors are just-OK. I've had this catered for lunch, which is very good. Not really mediterranean food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o-IP9-MSTsJpI48JnkNqIA"
  },
  "z3qEDKzhEiLOgGs7x0DMYw": {
    "date": "10/8/2015",
    "text": "Was in there last week during my normal visit.. I couldn't help but noticed new staff since the regulars have always exceeded above and beyond the expectations of what customer service should be.. I didn't think twice before going in an ordering my food.. That was mistake! Was so used to going and seeing the same familiar and friendly faces, they alreminiady knew what I always went in for.. Now when I asked for my food in a particular way I noticed this seemed to bother them..this new staff no longer wanted to go out of their way to satify customers... It really upset me how the new manager didn't take a second to acknowledge me or take into account the fact that I wanted my food done in a particular manner.. I'm really disappointed in my visit and it hurts to say I will visit a different location from now on..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YXMo-PMQP_ja6raj7wSUzw"
  },
  "HwJ5HGU7oh8Pv4noz98-Kw": {
    "date": "5/27/2013",
    "text": "For a fast food place this is great! I ordered the tossed salad and my husband ordered the Greek salad with grilled chicken. The daily made dressing was yummy and would def come back here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gNLj0wvKZks53xcgrnmzEg"
  },
  "w3AATjPBm-Wap46k36bezg": {
    "date": "12/5/2012",
    "text": "I LOVE this place. I have heard of it before I moved to Charlotte but none were close to me. There menu has soo many choices! I love the spinach chicken wraps with the sauteed veggies. I tend to leave the chicken out and just get the spinach with cheese and peppers so yummy! They have nice outdoor seating and bring you food to you when it's ready. Prices are a bit high for a fast food type of place but I think they somewhat worth it. I tend to park in the parking deck , or either try to grab one of the 30 minute spots right outside of the restaurant. Overall a really nice restaurant with healthy lunch and dinner options!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CfVdlk7VmhGA6YaJKmFEqg"
  },
  "i9jjirXC6gbmngQWw5OgfQ": {
    "date": "6/11/2013",
    "text": "This is a great lunch / dinner spot if you're looking for a fast healthy meal.  The chicken kabobs an chicken roll ups are phenominal",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "t7P5Y_PSURSEqZDN-OYtqg"
  },
  "Frjd5oswACEEaswF3WouuQ": {
    "date": "8/24/2010",
    "text": "Fresh food, nice alternative to fast food. Need to work on cleanliness. Great convenient location in midtown n",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "dad-mPjll4i4py1Q2byI-A",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dad-mPjll4i4py1Q2byI-A/o.jpg"
      }
    ],
    "user_id": "Wz6nekYXj4wZ39UKgaVHJA"
  },
  "n0-lU2tBVRfFffP7lkTW5g": {
    "date": "6/27/2015",
    "text": "The service is excellent, however my salad not so much. I'd give them a 5 for service and a 1 for the food. I'm a huge fan of Greek Salads and I don't think I've ever had a bad one until today. It was basically a few pieces of cucumber, 2 cherry tomatoes cut in half, some onion, 2 peppers, a Tablespoon of feta cheese (at the most) and a shitload of bagged spring lettuce. There is no dressing on it at all. They have bottles of dressing with all oil and 1/8 vinegar. The girl was kind enough to bring me a lemon dressing on the side. A very very boring salad that I ate because I was hungry but truthfully I could have walked up the block and purchased a better Greek at Trader Joes for half the price. Won't be returning.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6MM9JMogt_f1TLuVTWVMjQ"
  },
  "_VQS6OhbdDJ5Eln8lPOMjQ": {
    "date": "5/7/2013",
    "text": "Absolutely great.  I went in with friends a couple weeks ago and wanted the pita pizza without onions (too many nauseate me) which they could not do.  However, they walked me through the menu to a low cal high veggie option which was delicious.  Later, the manager brought me over one of the pizzas to take home to try in case the onions were mild enough then I could order it next time. I did and I will!  Great customer service and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qq_d5s6XVGBbPg5gKIrzjQ"
  },
  "cIv0WDtqe1Gea9RuE_JvNA": {
    "date": "8/3/2012",
    "text": "Love Zoe's Kitchen... everything is always fresh and so tasty. I am addicted to their chicken salad as well as hummus. I will say they are pricey.. I sometimes have to debate what to order because of the cost. I like the interior and its a good spot to sit, relax and chat a bit. Its also a great location with Target, Marshalls and Trader Joes in walking distance.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bAxtOfFyhgvyHwK3gkBUrg"
  },
  "QBVJ3G3OJMD4xmiN__-Uyw": {
    "date": "3/28/2015",
    "text": "I've loved coming here and still love the food, but an unpleasant confrontation with Shannon has unfortunately made me decide to no longer come to this location.  I bought a cookie for my kids that was undercooked and brought it to Shannon's attention.  Long story short, she was very rude about me bringing it to her attention, even though I did it very nicely.  She all but jerked the cookie from my hand (after complaining that she baked the cookie herself so it was fine) and walked away, and even mocked me, not to mention never apologized for the undercooked cookie.  She just stood there with a fake grin saying, \"Yeah.  Ok.  Great.\"  I have never, ever written a complaint on someone but she was SO rude that I figured it was time I did.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rEnAL1l-dTkh2_5j98jDgA"
  },
  "6lBtnQoxt2YBRPv3usO93g": {
    "date": "7/26/2011",
    "text": "How did I live without you for so long Zoe my love?  I can't decide what my favorite dish is here and that is a good sign!  Right near some of my favorite shopping too!  The chicken salad is good (ask for feta on it tho trust me) and the shrimp salad and turkey reuben is TO DIE FOR!!!  I am still daydreaming about the pimento cheese....yum.....  They run fun promos from time to time like free Zoes cups (bring them back in and the drinks are just 99 cents!)  The decor is a little IKEA meets McDonalds but you can stomach it for lunch trust me!  :-D",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "WHej3IUyAq1fe9E-URvj1g": {
    "date": "7/2/2012",
    "text": "I have driven by this place many times but since I am trying to eat more healthfully and my daughter wanted to take me to lunch for a late Father's day present I picked Zoe's Kitchen. Tastefully decorated and rather hip, it suits the Metropolitan area nicely. The staff was very nice and extremely perky. They answered every question with a smile and explained that all the food was made fresh \"in-house\" daily. I had the hummus platter with pita bread and a Greek salad. It was great. the hummus was as good as mine and the pita was perfect. I appreciated that the salad was made of very fresh mixed greens and not just some chopped iceberg lettuce. My daughter got a turkey sandwich and said it was great. We will both be back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kGhgiNW1OVTRTz390q9GvA"
  },
  "aH6b7ymu803jcCDlheVxsw": {
    "date": "5/11/2011",
    "text": "First off this is a fast food type place not a sit down restaurant. Kinda Boston Market type place. That said it's pretty good, pretty healthy and pretty quick. I had the chicken kabobs which come with a Greek salad, rice and pita bread. If you go in thinking fast food you'll be satisfied if you're expecting a nice sit down meal keep walking.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "4Dqi3c1Hybkjbw1xNtDHzg"
  },
  "HVOVjaYAdDohQsALT-dA_Q": {
    "date": "8/12/2013",
    "text": "I called in a to go order. The guy that answered was very short and acted like he had somewhere better to be. He was extremely rude. When I picked up the order I asked for it to be repeated because he seemed distracted when I got my order. He was acting smart and repeating 5 different meals back to me. I found out his name is Jeremy. A manager needs to teach this person some manners.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CznKsaROynWWAw0ObTGZMg"
  },
  "rXK6rcGgigXtp4utkVyHGg": {
    "date": "2/1/2011",
    "text": "This is a really easy place to stop in for lunch.  However, I have never been completely satisfied with any of the dishes that I've had.  They are pretty run of the mill and sometimes a little bland.  I guess it's healthy, so that's a plus.  The place is clean and bright and the staff is very cheery.  The prices are pretty good.  Parking in the Best Buy/Trade Joe's parking lot can be tricky so if you're not fortunate enough to grab a spot directly outside of Zoe's, be prepared to drive up to the 2nd floor of the deck and take the elevator down.  It's much easier and less stressful than trying to park on the first floor.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "cI1HosrJtdXoLX8HhuTz9w"
  },
  "0Rip9YbA26wpX0TstR8yUA": {
    "date": "12/30/2011",
    "text": "Service was slow. Food was not good, seemed old and reheated. We love the one in Birkdale but this one was a disappointment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b7uIClEg9hpryhIu012Y5A"
  },
  "ld7yn-f3A-WceuaYScwBRQ": {
    "date": "9/20/2010",
    "text": "We visited Zoes the other night for dinner for the first time.  I love the bright colors they use on the walls.  It's very modern and very welcoming.  It's not fancy, though, by any means, so don't bring your date here.  (You know who you are.)    You order at the counter and then are given a number for your table.  Someone then brings the food out for you.    They have a pretty good size menu, so to read and digest it all standing at the counter was a little difficult (and full of pressure!).  Unfortunately, nothing really jumped out at me as exciting.  I went with the Chicken Roll-Ups, which were tortillas filled with chicken and veggies that are heated up.  It was good, but nothing exceptional.  There were no particular flavors that stood out that would draw me back to that item.   For a side, I went with their pasta salad.  Now that stood out.  It was pasta with like sundried tomatoes, feta cheese, and fresh basil.  It wasn't greasy at all and had a great combination of flavors.    Would we return to Zoes?  Sure, probably if we're in the area and want a quick bite to eat.  I'd probably try their kabobs (the menu says it's their \"favorite\"), a salad, or their pimento cheese sandwich (they sell huge take-home tubs of it, so it must be good!).",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "apJEK_Gg41lzJ4mzb6mLyw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Seat yourself in Zoe&amp;#39;s big interior.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/apJEK_Gg41lzJ4mzb6mLyw/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "3OfhwtG08WpBahFLcnTvFw": {
    "date": "2/25/2015",
    "text": "Zoe's has been growing on me with each visit. I have tried much of the menu and have found my favorite to be the chicken and steak roll ups. They come with your choice of a side and salsa for dipping.   Another great thing about Zoe's is the family dinner pack up. It feeds 4 or 8 and is reasonably priced. Quick, easy, and healthy meal for you and the gang.   During the evening hours it clears out and has a welcoming calm vibe. Great for winding down and enjoying dinner.   Park on the street if you're lucky enough to get a spot; if not, park in the Target garage and walk over.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tqIAiKisujzZWEjbdbMxyg"
  },
  "iXuHZ628A3y3fHHmZh1B3A": {
    "date": "6/19/2011",
    "text": "Right around the corner from some great shops & a Trader Joes.  I stopped in here after browsing West Elm that was just across the street.    I grabbed the salad plate and added chicken.  Delish.  Pita/hummus appeared fresh & tasty.  I wish I could have one of these in my neighborhood.  It was like Mediterranean Panera.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Eds-P88vUhPpSM2UF166Aw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Light lunch!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Eds-P88vUhPpSM2UF166Aw/o.jpg"
      }
    ],
    "user_id": "JGHpOef9aP6rhgttrn9U9w"
  },
  "15rKwH3QMiEdirWvFaSSPg": {
    "date": "11/26/2012",
    "text": "While it's not quite the meal we were expecting, it ain't half-bad, either. The prices are, perhaps, a bit  higher than I might anticipate for the atmosphere (the fast-casual was a surprise, as from the patio seats we'd often seen outside, I somehow was expecting some basic table service), but given the variety and types of ingredients they use, I can understand ponying up a couple more dollars than you might otherwise throw down for a 'typical' fast food experience.  The food was good, fresh, fast. Husband was surprised to see a side salad delivered before his pita pizza (both of which he enjoyed). My greek salad with grilled chicken was plentiful and fresh, with lots of crunchy vegetables, briny feta and olives, and still-warm chicken on top. The potato salad (vinegar-style, not mayonnaise-based) at the bottom of the dish was a somewhat odd addition - not wholly unwelcome, but not something I'm used to in my salad. I found the lemony vinaigrette to be a better salad dressing choice than the bottles of Greek Oil/Vinegar mix that sit on all of the tables, though Husband used the bottled stuff for his salad, and also liked dipping his leftover pita into it.  We liked our meal well enough, and if we were caught on a major shopping expedition in the area might stop by again for a quick meal - but general we prefer something a little more sit-downy, with an ambiance that entices us to linger a little longer.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "kge4_1NwRbjjrFM0bq1bHA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Greek salad + grilled chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kge4_1NwRbjjrFM0bq1bHA/o.jpg"
      },
      {
        "img_id": "cXjnYn8x-h_L1jU674-2Gw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Pita pizza",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/cXjnYn8x-h_L1jU674-2Gw/o.jpg"
      }
    ],
    "user_id": "T6953RKf_xLbtmndOWIGdQ"
  },
  "tSSdkP42wRvZpdfIHcTFPQ": {
    "date": "2/9/2015",
    "text": "If you're looking for something quick and reasonably healthy, this is the place. This is my go-to if I need a fast lunch. The protein power plate is great when forgoing carbs and the hummus and pita bread is fantastic when you're not. The chicken salad is slap-your-mom good. Yeah, for reals. You can get a pint to take home.   The parking is reasonable in the garage next door but this particular location can be crowded and slam packed if you go during peak hours.   If you're a regular, then downloading the app is worth the freebies!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "HZ1yFGxv7H_XOrTwVtcsCQ"
  },
  "onEYy_5_53DyI9VBQcBU3w": {
    "date": "12/29/2015",
    "text": "I love this place. You pretty much get rewarded for everything you buy as soon as you upload the receipt. The food is great, its quick, the vibe is awesome- upbeat, colorful.   It can get pretty busy but the wait is never too bad.   I am obsessed with their toasted pimento sandwich, and their hummus.  This is one of the few places I can go to with any of my friends for a quick bite- they make it really easy to be healthy, but they have enough options that everyone can find something.   Its really inexpensive, too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fQleZFWpExw9cE0MtTEAXA"
  },
  "A7wscJ7Gr2Dord05_hg0Og": {
    "date": "7/16/2013",
    "text": "I'm a big fan of Zoe's kitchen. In fact, I was here earlier today. My first Zoe's kitchen experience was in Virginia. I ordered a sandwich, soup and a drink. To be honest, I wasn't blow away by it. This was a few years back.  Anyways, moving to Charlotte I decided to give it another go since I was aiming to eat healthier. I ordered the chicken kabobs and they were outstanding. Then I went back and ordered the steak kabobs and they too were outstanding. Good size portions with salad, rice, and flatbread. Delicious.   The service is fast and super friendly. There isn't a long wait for your food to come out and it's always solid. I can't remember going to Zoe's and thinking that it was ever different.   Prices are reasonable and the dining area seems pretty spacious. They even have outdoor seating. There are a lot of intriguing menu items that I have yet to try, but don't worry I'll be back. And if I don't end up getting some variety of the kabobs I'll try something else. A+",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RsmcsC_A1shrZPt3l0DzGQ"
  },
  "djsM9Ig4RwWn7LmQRvUVOw": {
    "date": "7/24/2016",
    "text": "I have had Zoe's Kitchen catering during meetings several times now, and I have to say this is the best buffet-style catering and one of the best casual Mediterranean dining experiences I have ever had. The kebabs (particularly the shrimp) are well-cooked, and deliciously seasoned. Their spreads, particularly the hummus, are quite good...several levels above hummus you'd find at the store. Even the rice pilaf, which does not look like much, is surprisingly delicious.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p4WztGxrJBrVWmt-xmY5Fg"
  },
  "xQ7MvYVn2TzmxSid6N9G9A": {
    "date": "10/25/2014",
    "text": "My husband kept telling me about this great place with healthy food where he would eat when I am not around to cook for him.  Today, he took me there.   We parked in the notorious Met parking deck, and, after shopping at Marshall's and Best Buy, we strolled over to Zoe's.  The first thing that I noticed was a lovely outdoor dining patio.  The inside features cheery colors and three large pieces of art with words pertaining to Charlotte attractions. We both ordered the vegetable kabobs.  My husband requested a side of humus instead of Greek salad.  My meal came with the Greek salad plus these incredibly yummy braised white beans.  I wonder what they put in those.  I hate to admit it , but they are a little tastier than the ones I make.  The kabobs needed a little salt, but were delicious as well.  A generous portion with too much food for this little lady to eat in one sitting. We took our food back home to enjoy on our own sunny patio.  Had we dined in, we may have had a wine or beer.  Nice that they offer those drink options. I put Zoe's number in my phone.  Good to have just in case that I am too busy to cook us a healthy meal.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wus7S9rFi7xYxmNgFm0UOQ"
  },
  "4dV5CNumc8RIIX3URc9Paw": {
    "date": "10/7/2017",
    "text": "Staff inattentive & has no sense of customer service. The food is good though. It would be nice if they tried to earn a customers business with good service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qsmzCgPzMFkG-vaQ_5b9vA"
  },
  "ozExg30AQ19b1DQwLtOBFw": {
    "date": "2/25/2013",
    "text": "I stopped in the other day and grabbed a half a pint of their chicken salad to go figuring I could make a couple sandwiches at home. I honestly was not that impressed. I am not one for a ton of mayo but theirs was kind of dry.  Service was great and it wasn't very busy. I have ordered here for catering and love their Kabobs. I think I'll stay away from the chicken salad in the future.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oHdCkOf9gHSMhvJd4JbVrA"
  },
  "vyxGg3VfFuBvESl1zs6PJQ": {
    "date": "5/4/2014",
    "text": "Awesome service. Great location. Very laid back atmosphere packed with value and healthy food. This time I tried the lean turkey pita and it was fair (still way better than Which Which. I'd stick with the Greek Pita next time. However,  the hummus and lemonade was very good. Good luck finding a better fast foos style restaurant with better quality, healthy choices and this value.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fYB2LGcIsCocRPF_yGg5nA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Lean turkey pita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fYB2LGcIsCocRPF_yGg5nA/o.jpg"
      },
      {
        "img_id": "sPjYkl_xMHKRCJ1C9bgkyA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Small side of pita",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/sPjYkl_xMHKRCJ1C9bgkyA/o.jpg"
      }
    ],
    "user_id": "SAfNyiLVgPZzp_aGpXnfwg"
  },
  "jHmVQVESVatbnaekS-79Gg": {
    "date": "4/13/2014",
    "text": "After craving a Greek Salad, I decided to hit up Zoe's Kitchen, since I hadn't been in over a year. I arrived around 12 on Sunday and although the line was long it moved smoothly. As most of my reviews/check ins reflect, I love pizza, so I decided today to try the chicken pita pizza with a side Greek salad. The pizza was ok, but unfortunately the sauce reminded me of jarred pizza sauce. And, something I don't think they did years ago, they delivered the salad undressed. I questioned the server and there are bottles on the table of the dresser. Ugh, not chilled, not fresh, just blah. I wish it was served with your order, allowing you to know it us fresh and not touched/drizzled all over. Overall, decent, but not sure it would be somewhere I would return on a regular basis.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  },
  "S1vR7QVi12sVYVizQQb6zg": {
    "date": "3/7/2010",
    "text": "My husband and I haven't been back to Zoes since the opening until today. Today was a sunny day and it sounded right to sit outside and eat at Zoes. We ordered a chicken salad sandwich with fresh fruit and a chicken kabob plate. Oh, and a limeade...which was very sweet and delicious.  This time around the food seemed average. The chicken salad didn't have pizazz and the chicken kabobs were dry. They should include a drop of hummus or yogurt dip on the kabob plate; however, the vinegar sauce on the table added a bit.  Some of the staff were friendly and some not like what I remembered the first time around. Fast service and ideal for those of you in a hurry.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "BwpRu9IYikxiZX3rdLJvug",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BwpRu9IYikxiZX3rdLJvug/o.jpg"
      }
    ],
    "user_id": "Reuq65EOFI938Yg8xgff9g"
  },
  "RcVlMLJYIIBtytgFjj4udQ": {
    "date": "6/9/2015",
    "text": "I love Zoe's, the steak rollups and Greek Chicken Pita are my go to items",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "qYTrkSVZEHj7gXI3V-_Yhg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qYTrkSVZEHj7gXI3V-_Yhg/o.jpg"
      }
    ],
    "user_id": "lnz0URfxQwkeYztWhq9qng"
  },
  "B8LaMKRLfDzmKdHtwnaU5Q": {
    "date": "8/18/2016",
    "text": "Food is fine...service has been bad both times I've been here recently. Food took forever once (which defeats the purpose of fast casual) and they forgot one of our meals the most recent time until I went and reminded them. They didn't seem to care much.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ne8pJ3SlhQxLouq9IhVAg"
  },
  "4nrJVuOXcG0OwEjNOJItgQ": {
    "date": "7/21/2015",
    "text": "Cheap and delicious, you just can't beat that.  If you're tempted to grab some fast food, but you want something much tastier and a little healthier, go to Zoe's. We had the steak roll-ups with white beans and the steak kabobs with pasta salad. Everything was awesome, it was filling, the place was clean.  It's like upscale, mediterranean fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "29HRxLhCQPAVZ0y7cH5c8w"
  },
  "vyMSGpoldmDq8I8bw8H8lQ": {
    "date": "7/10/2016",
    "text": "Customer service here was the best! The staff recognized my Levine NIC pass and went out of their way to wish us well.  Awesomeness and Thanks and great food!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iFYtaudCF5qB7CurEwAZ3A"
  },
  "aeL3rXOdClD-DS_0VTLBLg": {
    "date": "5/10/2014",
    "text": "Fresh food....This was my first time at Zoe's Kitchen. I had no idea the food would be so good. I ordered a chicken pita and salad, everything looked so good. I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "a4zpNVrX7I0m1ld78JRHmw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Greek salad.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/a4zpNVrX7I0m1ld78JRHmw/o.jpg"
      }
    ],
    "user_id": "JNQhYJMb0gCo9_qJtBFsog"
  },
  "iTlNGkEmFtcI1gOy0msjlg": {
    "date": "5/23/2014",
    "text": "Wow! Awesome Food Alert! Steak quesadillas and outdoor seating equals the perfect combo. Great, healthy, quick service. Hip location around a handful of other fun places to go to. Great cookies and salads too. I will definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "D6N5AoOMfeRef50R4D6szA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Steak Quesadilla with a good pasta salad side. Hummus and pita is a nice appetizer too.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/D6N5AoOMfeRef50R4D6szA/o.jpg"
      }
    ],
    "user_id": "Kj18YxS49uSuW5m1OOQZ1w"
  },
  "5jvQKxCgLTugOfHDEkA1zg": {
    "date": "1/13/2016",
    "text": "I went to Zoe's again late last night for dinner after the gym.  We probably walked in there a little after 8:30pm, knowing they closed at 9.  Any normal person would probably give us a dirty look for coming in so late - but as always the staff was exceedingly friendly.  They manager greeted us with a smile, made sure we had everything that we wanted and didn't make us feel the slightest bit guilty for coming in close to closing time.  There was another young man who delivered our food (his name might have been Creet), who was so friendly it was actually surprising!  Overall I can't say enough about the staff at this Zoe's.  They go above and beyond to make your experience a good one.  Whatever they are doing, kudos.  It is literally a pleasure to eat here.  The food, as always, is fresh and delicious!  One of our absolute favorite and consistent restaurants.  The chicken kabob platter is my go-to, sub the salad for grilled veggies and add hummus.  BAM.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QbFTdA-NXmK3PJxgK-DVdg"
  },
  "iRzyWrvLYnZqZU9xffkm5g": {
    "date": "9/11/2017",
    "text": "I love Zoes but this one is terrible. Several times I have come and that have my order wrong, given me wilted lettuce or tried to give me a piece of cake that was the equivalent of crumbs. Today I gave them yet another chance... The smell when you walk in is/was GAWD awful.. the sanitation grad dropped 1.5 from the last visit and they said it was due to the AC... now it's muggy and smelly. This is the closest Zoes to me and unfortunately I think I have given them all the chances I can!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6gV5px_3GyfTCpLdhF5SA"
  },
  "OKsWr-flEHiOm1I1TkjhUQ": {
    "date": "5/11/2016",
    "text": "Love Zoes Kitchen! I've been to locations elsewhere and always enjoyed it. Then again I am just partial to greek food in general. The salads are huge! I can usually make two meals out of mine. Start with the hummus, so creamy. Although this place is quick, it gets packed for lunch during the week so come prepared for a little wait!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mEgyYQwqx-VKT37bszYcyQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Greek salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/mEgyYQwqx-VKT37bszYcyQ/o.jpg"
      }
    ],
    "user_id": "QkhRTrURcY3DW0BLLFPsIw"
  },
  "J5F6IfMyh180FQpHWg1OpQ": {
    "date": "2/15/2015",
    "text": "If you are looking to avoid standard fast food, this is the place for you!   The food is light and airy without heavy condiments and priced around $7. The \"Greek/Mediterranean\" style leans towards vinegar/oil type seasoning and clean simple flavors.   I had a warm chicken sandwich and ordered a Taboule salad to go but here's a tip - it's not a Taboule it's Tabouli Rice .. something unusual and new to me but not the couscous I was craving.   It's kind of a \"layman\" version of Mediterranean food - something to please everyone except maybe folks that crave the more serious stuff. Good place to stop in and avoid fast food, I'll grant it that but it's a day place in my book - light airy colors and seating for a friendly rendezvous.  #NoteToSelf read menu more carefully! This place has a great location for lounging when out windowshopping in uptown Charlotte so I say A+  There is an App for Zoe's Kitchen and from what I can see you can get free goodies each time you visit. I also see there is a way to scan your latest receipt to get credit which is just up my geeky alley! Look for \"SUBMIT A ZOE'S RECEIPT\" and tell them Nancy sent you:)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "gMjG7Tp5nqs7lZK8FSPA6Q",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Hot Chicken Sandwich and Potato Salad - Spicy mustard like a summer meal and vinegar style potatoes. Light portions no fluff;)",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gMjG7Tp5nqs7lZK8FSPA6Q/o.jpg"
      },
      {
        "img_id": "Llizh_hcuPcPgtNhaAUQlw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. You place your order and they bring it to you. It&amp;#39;s a bit like a Panera Bread but with a more natural kind of food composition.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Llizh_hcuPcPgtNhaAUQlw/o.jpg"
      },
      {
        "img_id": "KoppZ2fbKH_gVtyk3yewjg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/KoppZ2fbKH_gVtyk3yewjg/o.jpg"
      }
    ],
    "user_id": "2R2y1Q6vn2lUibmIZDO8Zg"
  },
  "zqauX4qJx07fdZEAk6s46A": {
    "date": "7/22/2017",
    "text": "For this location to be where it is, you'd think they'd have it together a little more. The food takes way longer than it should and the restaurant sometimes doesn't seem the cleanest. The food presentation is much better at other locations as well. The dining room might have had 10 total guests in there and for some reason I kept seeing orders get sent back because they were wrong - how does this happen?! Step it up Metro location!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fCa8Q5bW3lXv32KeIKGCnw"
  },
  "MeuAJWa18X6kNzqgW--gXA": {
    "date": "11/14/2015",
    "text": "I used to love Zoes. When I worked in southpark I ate at that location at least 3x a week. My usual order is the spinach roll ups with marinara instead of salsa and the pasta salad with lemon yogurt dressing.   I was shopping at target across the street feeling hungry so I called an order in here. The guy on the phone told me it would be 1.00 for marinara and .40 for the yogurt dressing... Seriously for condiments that you serve for free. He couldn't even provide me an explanation and did try to consult a manager. It just is what it is. I've never heard of this and I've been to every Zoes in Charlotte multiple times.   I ended up cancelling my order. I've even went to this same Zoes after that order and just got the pasta salad and there was no charge for the yogurt dressing. Seems fishy. Either way that experience just turned me off from eating here unless it's a last resort. I'm sitting in here now with my husband while he eats not eating anything. Guess I'm protesting. I'm only giving three stars because I do love their food, but not the shadiness. To their credit though I was so disappointed that day I placed the order that I tweeted about it and Zoes tweeted me back. I never followed up, but we'll see.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4xbo_A0YkZE7a7y18_9ATw"
  },
  "UZMpTa6h9md5ILyQlSOXAQ": {
    "date": "1/3/2016",
    "text": "The quinoa salad is wonderful here; it was my first time ever here and I wanted something light.  They have a nice selection to choose from and atmosphere was casual but pleasant.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-DppvF7H7NXPvs9yCn78PA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Quinoa salad.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-DppvF7H7NXPvs9yCn78PA/o.jpg"
      }
    ],
    "user_id": "YI5sEimxyYrdeFbmsv_ssQ"
  },
  "PxU-IZKCE6dcRZy1mDY0mA": {
    "date": "2/22/2017",
    "text": "Love Zoe's! The limeade is great and I love the grilled shrimp entree. Although it can't be categorized as \"authentic\" Greek cuisine, each time I've come to Zoe's, my food has been seasoned well and the shrimp is always beautifully cooked (I HATE over cooked shrimp). Great job guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XFtzKCUFhU52u1-EzWXC4A"
  },
  "EvR8c_deElmAHGEgp39meg": {
    "date": "3/16/2017",
    "text": "Zoes was a good experience. Red pepper hummus, turkey stack sandwich and an iced tea. Friendly, knowledgeable staff. I grabbed my drink an they brought out the hummus and sandwich as they were prepared - all within a couple of minutes of sitting down. Easy music, relaxed casual setting. I'll be back in the future. Very tasty.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g_y1d6YDjJUXTTGNKAKzvQ"
  },
  "z30WL1UQm4NdejPabn8_Yw": {
    "date": "1/8/2015",
    "text": "Mmmm. Place really reminds me of a Noodles and Company. Not a big fan but I can understand why some  enjoy this food. Overall, just left the place feeling a bit bland, unoriginal, and blah.  The hummus had a liquid consistency and pita was dry. Just not my thing.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LEGZIKu3f-pzExUT2tKNpw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LEGZIKu3f-pzExUT2tKNpw/o.jpg"
      },
      {
        "img_id": "0YPWhokm9TT5OwlOzaLrmQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/0YPWhokm9TT5OwlOzaLrmQ/o.jpg"
      },
      {
        "img_id": "sKy2m_E_9E0zTPKlPrhIeg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sKy2m_E_9E0zTPKlPrhIeg/o.jpg"
      }
    ],
    "user_id": "OjqHh67IFsCWjMaW8h83Rw"
  },
  "gY3L7dFotak_q3SdPZrDRQ": {
    "date": "4/28/2016",
    "text": "Salmon Kabobs with brown rice are the absolute best!!!!!!!!!! However, the tuna salad sandwich was not great.  Pretty pricey for a quick option but totally worth it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0ymXz8_KyqgsT2lnhd-gag"
  },
  "FgYWhOJmR_beyZ0sTVL7Hg": {
    "date": "11/22/2017",
    "text": "I  really don't know what's going with zoe's kitchen, but you can't serve pita bread cold with an hummus salad , not good at all.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9GVQ1PFrz3KUWGcqda9g3A"
  },
  "FfpPqziiESpvRR8mc8hJKA": {
    "date": "2/15/2017",
    "text": "We've had Postmates bring us food from this Zoe's on a few occasions and the food is... ok.  None of it is terrible, but each order I've gotten made me think of another local restaurant that does the same dish better... think basic Greek Salad.  One would think that Zoe's would knock this basic salad out of the park, but that's just not the case and hasn't been on multiple occasions.  The Greek dressing is mostly oil, not NEARLY enough spices and the \"cucumber raita\"... well, it's just terrible... I mean, how can it even be so bad, bland, watery and tasteless?  Each time I've have this salad it has made me wish that we'd chosen another (far less expensive) local Greek chain instead... and I think for the price, that's a real shame.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "eB_TCZAvGcRs7Kvj9UmRDg": {
    "date": "11/11/2016",
    "text": "Not my favorite place ever as someone who prefers locally-based establishment but quick and convenient for a relatively healthy meal option. Prices are reasonable and you order at the counter and have food brought out to your table where you wait with a number. I think I've only ever ordered the Greek salad and hummus combo with the basil pesto hummus. The salad is nothing special but good and their Greek dressing is a vinaigrette that sits on all tables. The hummus is good and the portion of hummus and pita is huge. I would prefer if the pita was warmed up a bit or even toasted, I don't like just cold basic pita, but it does the trick as vehicle for the hummus. I wouldn't go out of my way to eat here but if you need to eat quick and don't want to do fast-food before or after running errands at the Metropolitan this is a reasonable option.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GyJf71ss616pHZrFZpL42g"
  },
  "BmFTLTAKgj5mj0GCvvbmJA": {
    "date": "3/2/2017",
    "text": "We love Zoe's! We go once a week and love the quality and the service. Also Felipe is amazing, he keeps us coming back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "THrsRWR1s46A6eHmdogB_w"
  },
  "w0OCzsRayEAY8kM0ClWHvQ": {
    "date": "3/6/2017",
    "text": "Zoe's Kitchen is great and healthy. I always go for the salmon kabobs. It's a bit pricey, but filling.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hVkDs8FRgXPPHPXktA6QCQ"
  },
  "Fp2gzJHrTCP69nS0AbqVDg": {
    "date": "5/10/2016",
    "text": "Long line, bustling 'fast food' joint that takes a loooong time to get. B- salad. Bigger serving than I like. I was disappointed and will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "q58gafmW6yQvWRD6sQ7Aww"
  },
  "cQsD3wc3dE4UmmESMRCZ7g": {
    "date": "1/17/2017",
    "text": "Zoes is the top fast casual restaurant in the south east. If you're looking for a fun environment, with great food, and the friendliest staff: Zoes is the place for you!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FolrVSoF0LG3fFHlmUwm_A"
  },
  "A2v77CYojrwS_xyyFafsbQ": {
    "date": "7/11/2017",
    "text": "Went  here for dinner this evening. Waited about 15 min for my entree which came out with different sides than I ordered.  The staff member said she would be right back with the correct sides and never returned. I also ordered an appetizer hummus trio which I never got. Finally I went and asked for a refund after about 20 min of waiting. No apologies ... here is your refund...... it may or may not show up on your card.  Definitely would recommend not going to this restaurant. Very unprofessional staff who were busy talking to each other rather than helping customers. There are plenty other options with great service close by.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZwpOYMf0nrR7D1HK7ZTIcA"
  },
  "CeTlOy4EtDWZ7ALmt1ndsA": {
    "date": "2/23/2013",
    "text": "Today was my first visit to Zoes and I enjoyed it! They definitely get 4 stars for the category they fall under (quick bites, cafes, affordable eats, etc).  They have a good variety and everything seemed to be relatively fresh!  I tried the chicken roll-up and I really really liked it.  The chicken was tender, had good flavor and it was the perfect lunch portion.  The hummus was also very good and fresh.  The pita bread was not anything special but I can let that slide.  The service was friendly and fast, the price was right.  I'll be back!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TB9ibgXVrq1B7-fajbsu8g"
  },
  "MSRsqJqXi6e-2l2_nzVh0A": {
    "date": "8/9/2011",
    "text": "It's a shame the Metropolitan location is so far away from where I'm located, I'd be here a lot more often. It's easily my favorite one in Charlotte. The decor is modern and clean. I think the theme here is healthy fresh fast food, and it's quite delicious too!  There are plenty of options for everyone. My favorites go to are the kabobs and wraps. I'm not much of a fan of hummus usually but theirs is not spiced too much and manages to get me to like it!  The service is really pleasant, fast, and informative. Did you know for example that they make their chocolate cake fresh each day and gets tasted to make sure it's delicious? Neither did I until I asked one of the employees about their cake! This is a great spot for a quick lunch, if you're near the area try it out!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "zZYHZwmBl9Af4pI-aLXBFA"
  },
  "ovAM9rH5SJASf9uiOalErw": {
    "date": "7/13/2011",
    "text": "So I was out running some errands yesterday and happened to be at the Best Buy next door... Zoe's sign caught my eye and in I went.   The establishment itself is very... hmmm nice hues... empty... I guess it felt sterile to me -- but in a good way. I arrived around 2:43  and there were about seven or eight people chomping down.   For being so empty, I was surprised how uninterested the staff seemed to be. Nothing more do I hate when the cashier/order taker speaks to a co-worker about other crap when you're trying to place  you're order... o'well I guess they were just bored.   I ordered the half and half combo - Chicken salad sandwich and a greek salad with a glass of chardonnay.   The sandwich was absolutely YUMMY. I love that the chicken salad was dry -- I can't stand mayonnaise--so when it's used sparingly I smile. I prefer Greek yogurt over mayo... that's how I roll when I make tuna or chicken salad sammy's... The bread was fresh and the tomato delish.   The Greek salad was perfect as well -- crisp fresh romaine lettuce, sweet cherry tomato's, English cucumbers, tasty feta but HOLY GREEK GODDESS -- what's up with the chopped red onions? The guy at the counter should have asked me:  \"Mam, would you like sum salad with y'er CHOPPED red onions?!\"  Jeez... I breathed onion breath for at least 3-4 hours... I didn't feel so bad though, the woman at the DMV was rude and she deserved my onion breath! HA take that - karma can be a bitch!   I would have loved the salad 100% if they shaved the onions or at least soaked the onions to kill some of that onion stank we love. Oh and their salad dressing which is conveniently placed in the center of each table was really nice and light as well. I also loved that they had salt and pepper grinder's at each table- nice touch.   So should you find yourself at Zoe's, dig the chick sammy and try the salads, but ask for y'er onions on the side please! And bring a mint.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "oWxy_YR6n2w8e9L00hxhPw"
  },
  "EA2ZuWr_HGmDyAbC-_1PfA": {
    "date": "7/20/2012",
    "text": "For this being a fast-foodsy place, it is one of the best options despite it being a bit on the pricey side. However, they have a buy two for $6 deal with great options.   It's my to-go place for those nights when you don't want to cook but you want to make a health-conscious decision. In fact, it's featured on <a href=\"/redir?url=http%3A%2F%2Fhealthydiningfinder.com&s=e1a14bd1f872531b3a2d54a533acf9bd7cef6058f75a3185212b14b066baaa32\" target=\"_blank\" rel=\"nofollow\">healthydiningfinder.com</a> where you can find a list of their healthiest meals. Also, they have some tasty options if you are feeling like splurging or simply are not that concerned about calories. My boyfriend always gets the steak roll-ups - they are delicious!  A couple of tips about this place: You can get a free mug if you sign up for their emails.  Also, free wifi (after 2pm)! Not sure how it's monitored because it's a recent discovery of mine. Wish it were an all-day thing, but I am excited to have found another place where to get some work done.   On the downside: parking. It's located at the metropolitan shopping center and it gets crowded around dinner rush.   Overall, a nice place for a quick, healthy bite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "VOl8R4ReOZ2fq9nGA6Au0A"
  },
  "X9vvkFzsPmMwSsniMq9qpg": {
    "date": "7/30/2012",
    "text": "I was recently provided with a coupon to sample the menu at Zoes Kitchen. This fast casual concept delivers with fresh, tasty food in an upbeat pleasant setting. The patio at the Metropolitan location was particularly lovely last week when we had a bit of cool weather. You go inside and order and pay at the counter, then a runner brings your meal to the table.  The menu focuses on Greek cuisine, with lots of fresh salads, sandwiches and signature \"roll-ups\". I tried the tossed Greek salad, which was delicious with the right combination of chicken, olives, red onion, cucumber, feta and caramelized onions. I appreciated that the salad was not drenched in dressing - you can add more of the Greek dressing if you like since it sits on every table. Zoes also offers online ordering and you can pick up a grab and go meal for 4. With offerings like kabobs, Greek chicken and the roll-ups, this sounds like a great idea for those times you just don't feel like cooking or going out. Zoes makes its own limeade, which I sampled and enjoyed as well as desserts which I will have to try next time. I look forward to returning here again to try more of the menu!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gyuln9LLHKYYsqK6zf4kiA"
  },
  "fksJYuqw9WN8jAmwqVscEA": {
    "date": "5/21/2016",
    "text": "First timer here. Quick service.  The meal was fresh. Would definitely recommend! The staff members were personable. I will be going back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_k-fEhO-ldidJk_bYaB04Q"
  },
  "bUJPmpRnhCa-_0iV5ow0EA": {
    "date": "6/22/2011",
    "text": "I've eaten at both the Blakeney location and this one and I've come to realize that Zoe, whomever he or she may be, likes one thing to be predominant in their kitchen.  Fresh ingredients!  I love the fact that you can get very health conscious meals here.  That's important to me and to many others I would imagine.  Whether a lunch time meal or dinner you can always get a good hearty meal without overdoing it with calories or fat content here.    Also something I love here that I wish other places would be forced to do is that their menu includes nutritional information so that you can make a educated decision on what to eat based on your specific dietary requirements.  So many times I want to try a new place (or old) and go to look up their menu online, only to find it void of any nutritional information.  That stinks.  Zoes Kitchen's interior is light and colorful which is also very pleasant and appealing to me.    Give this place a try, you won't be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vKUlUXLVylwdttu7h1_Y5Q"
  },
  "BYXZ5QQtN3H4i30NP4DA1A": {
    "date": "5/15/2016",
    "text": "The service here was very slow (both for ordering and for the food to be brought out). On top of that we were double charged. Cashier swiped our card once, said it didn't go thru, and then swiped again. I was able to clear it up with the cc company but this made us unhappy. Parking is also very hard.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uBHRgjD2xy77JCVm7CwmOA"
  },
  "9eOUAgdOMgt5UiSTXPEeHQ": {
    "date": "1/21/2012",
    "text": "This is a good choice for uptowners to grab lunch, but I suggest going online to place your order (even if you're eating it there) as that is much quicker than standing in line.  Staff is quick & friendly.  The food seems fresh & freshly-made and is good without being too pricey.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "j6Q9jTj6wPq8RcdvEpayoQ": {
    "date": "6/3/2013",
    "text": "I split the salad and a pimento cheese sandwich with the mrs and they were both fantastic. The outside seating was plentiful and the food came out quickly, once ordered. I will go back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "1gEx8Si6rkStWBp_IXnGCw"
  },
  "GQxdIq-tuhlDwidsBLsHrw": {
    "date": "10/13/2013",
    "text": "We always receive great service here and really good food.  It's healthy if you leave off the chocolate chip cookie -- but who wants to do that?  The chicken and shrimp kabobs are my favorite.  The soups are refreshingly healthy.  Be sure to download the Zoe's app and get free food every time you go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nmJnSePnTopYz1IvKdbKwA"
  },
  "ndd2DK5_jeq-Cc5kGFZ3nQ": {
    "date": "10/5/2015",
    "text": "I wish this App would have negative stars so I could rate it like it should be, was working/ training uptown Charlotte about 5 months ago I used to eat here for lunch most of the time loved it , didn't had no complains but after my training was done had to go back to rock hill didn't really come by after. Until 2 weeks ago when I was around town and wanted to grab a bite my experience wasn't good as it used to, service was terrible and some lady at front was very rude, so I let it go maybe she just having a bad hair day,but last Friday I decided to go again, but experience was the same this woman has an attitude problem with coworkers and just in general bad customer service skills, just to find out she is the manager , why is she the manager is beyond my understanding.  It's sad because I used to love this location customer service was great before.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sXDn4Ne7WrTVm0bdb5lOCQ"
  },
  "rLnwM-k4wicNPaIcuyFmVQ": {
    "date": "12/15/2011",
    "text": "I first gave this place a try since it is so close to where I work.  It seemed like a nice little place to try out, especially for lunch.  The atmosphere is nice with a colorful interior.  It also has outside seating, which is great during warm weather.  Although I'm very pleased with the style of the place, I am not a big fan of the food.  I have tried this place a few times and the different things I have gotten are not something I would try again.  I have heard from a few friends that this place is really good.  I believe everyone should still try it out though in case there was a certain pa-zazz that I'm missing from this place.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hhQUVO2AqBdSeQcPo19Bsw"
  },
  "cPIcx8iQpYuy7jsN7PzQnQ": {
    "date": "2/12/2016",
    "text": "Went to Zoes Kitchen tonight for supper. It was fresh and tasty. The restaurant had modern decor, giving a young and colorful vibe. I had the Mediterranean chicken, my daughter had the chicken rollups, and my wife had the chicken kebabs, it was delicious and healthy! I left Zoes feeling light, not bloated, and ready to come back! Would definitely recommend it.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tgJpwG1L8B7TupQ3V3PYmw"
  },
  "mqNf-r9wxDyFkVI_tyYVPg": {
    "date": "4/12/2011",
    "text": "In one word if I had to describe Zoe's kitchen it would be \"Fresh\".   Atmosphere is relaxing and calming.   Food is ok, but bland needs a little bit of additional flavor. The vegetables roasted or otherwise taste fresh. This is definitely a healthier version of Panera with a Greek twist.   The only complaint would be the space where you get your drinks. Not only do you have to get your drinks, but also your utensils, napkins and a lid and it makes it a difficult in a 10ft space while you are trying to hold a table number. God forbid there is someone behind you also trying to get their drink or a refill.    Should have had two drink stations put in like Starbucks or Caribou does with their condiment bars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "jVuyNd_1xknblSSBQYNAEw"
  },
  "OW9AtetNrpY7kJIpgsWWbw": {
    "date": "6/4/2012",
    "text": "I'm a regular customer -- Love love love this place..   the food is a perfect blend of fast food, that is great for health minded folks.   It is made fresh to order..",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-2a9y16bMpn-LfX7GC8Mxw"
  },
  "J8EYc-euQ3Imo1wujmNq4g": {
    "date": "1/9/2016",
    "text": "I've been here about ten times or so. The food is good quality like you'd expect from a Zoe's. Staff is very friendly. However, the wait time PER PERSON is definitely an outlier in a bad way. With Zoe's bring as big and corporate as they are, they must measure this statistic. Not sure why they can't fix it at this particular location though.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WRd_nsT-Idb2c4iv9nMH3Q"
  },
  "g477Ssr6mtQldfgJGwWM6g": {
    "date": "7/28/2011",
    "text": "Why oh why did I always pass you by???   Of course, now that I have tried your delicious fresh food - I want to stop everytime I am in the neighborhood!!  I even make excuses to BE in the neighborhood.  The chicken salad is one of my favorites - full of flavor and not so much mayo.  The hummus & pita are a great filler on those days I don't know what I want for lunch.  And the greek salad is simply the best - definitely ask for those onions on the side though if you are going back to work.  It's nice to have such fresh food and so close to uptown.  We often order from the office and pick up for our lunch.  Never had a bad experience or wrong order.  Keep up the good work!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "M5UNhp6oSzgsfdI-CXYJEw"
  },
  "izmSMx48yE-ev1FuZS2aNA": {
    "date": "7/15/2013",
    "text": "If you're looking for a healthy and refreshing meal during a hot summer day, look no further than Zoes Kitchen.  While so many of their menu items sounded delicious, I opted for the Greek Salad with the citrus balsamic vinaigrette.  The veggies were fresh and crispy, the feta tangy, and a small scoop of potato salad on the bottom for a twist on the traditional salad.  I scoped out the plates on other tables and based on appearances alone would highly recommend the kabob platters and hummus salad.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "DbTzqWvQhha5PASOpoQs0w"
  },
  "F3VQQOv77Hpa0Oqx-g-kqw": {
    "date": "10/7/2010",
    "text": "I was forewarned by a friend that this seemingly cute panera-esque (appearance wise) restaurant was the lemon equivalent of a car. You are hyped up to drive this beauty and then suddenly you hear a noise- it should be a warning but you decide to push along anyway and then damn it gives out- and you are stuck on the side of the road.... that sums up my experience perfectly:  Midway shopping at Trader Joes I put down the Guacamole Kit I was holding and decided I didnt want to cook- I wanted something that was already prepared...over to Zoes Kitchen I went.   Appearance-wise this place is bright- kid friendly, casual and clean.  The service was quick and friendly.  The prices seemed fairly reasonable $7-10   Upon looking at their offerings I asked myself \"what type of food is Zoes Kitchen?\" They seemed to be struggling on whether to be a Greek, Italian or Mexican restaurant- I say do one but do it well.   The lady at the counter recommended the chicken roll up's- served with -salsa??? I decided to give it a go- and also ordered the Pasta Salad side.  The Pasta Salad was pretty good. I didnt get a vinaigrette flavor as Krishan mentioned  but I could taste the Basil and Feta. Overall I was pleased.   The roll ups were just plain gross! They had a very mushy inside. It almost tasted like they put lettuce in there and it was all hot and soggy. I pulled out the chicken to at least try to salvage my dinner but it was hard and very dry.  I normally will just kind of finish a meal even if it's not my favorite- but this was not the case - it was inedible. Id like my $8 back ....  I don't think I would give it another shot...",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "HzEtbh5KYzfeW_MTVnGCEA"
  },
  "Df1T9T0kSCHMjWFYjNu1tw": {
    "date": "11/8/2010",
    "text": "So if Panera Bread woke up one morning and went all Mediterranean on you, you'd have the exact concept of Zoe's Kitchen: fast food with a distinctly healthy bent that tries to pick it up a notch, and has the price tag to match it.  It is a small chain based out of Alabama with about 50 locations throughout the South.  There are a number of salads and sandwiches on the menu, along with a number of entrees for those who want more.  Secret tip #1, however, is in my experience you get just as much food with a sandwich as you do the full meal, so save a buck or 2 there.  Yes, most sandwiches are wrapped in a pita and there is a hummus appetizer with pita chips you can also order (though I find it pricey for what you actually get).  Lots of skewed meats (shrimp, chicken, and even a beef) in a handful of different formats finish out the main dishes.    What shines here are the sides.  No french fries here!  I am partial to the marinated slaw- it has just the littlest kick with same tangy feta bits mixed in- original and yummy.  Roasted veggies are good too, so long as they don't come out too cold.  My dining companions also like the pasta salad.  Portions are small, even for a \"side dish.\"  I will also champion the grilled shrimp salad.  The greek dressing goes well with the skewers of shrimp that are grilled just right.  Nice and healthy with a distinctive Greek twist, Opa!  Sadly, that's where the compliments end.  The roll up entrees are quite unappetizing looking and tend to not be flavorful.  They are typically not served piping hot either.  Also, this place is mainly self-seve though you do get you food brought out to the table.  Get your own refills- the at least tends to fit with the heart-healthy attitude here.  Finally, no main dish here is under $7.  That's just over the edge for a lunch that is otherwise served fast-food style.  Perhaps that's the price you pay for healthier options?  I'll go there sometimes, but I'm not ready to sing its praises from the top of the Acropolis.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "AwyM03qzhwgyskBruurWQw"
  },
  "qpEWQXt1TsON2P9CfH5d8A": {
    "date": "3/21/2018",
    "text": "I usually love going to Zoe's but had a sub par experience yesterday. I placed a call-in order and still waited 20 minutes for my food at Zoe's. I paid for my order using a gift card that was sent to me via email, and the cashier said they didn't accept gift cards via email.  My husband used the gift card previously at this location, so I know it worked when the barcode in the email was scanned. I asked her to try again, and she reluctantly did, and the gift card worked. Finally, when I got home, I found that my braided white bean order contained mostly broth and a few beans lingering in the bottom of the container. I was disappointed by my experience, but the food tasted delicious, hence the 3 stars.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "UFGfhFMuhOqk4QLvlyTCgQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/UFGfhFMuhOqk4QLvlyTCgQ/o.jpg"
      },
      {
        "img_id": "NR1F3CRnHcaHbyt0ANrosQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NR1F3CRnHcaHbyt0ANrosQ/o.jpg"
      }
    ],
    "user_id": "lSxJvpyDPEYOR5x3OwJOWA"
  },
  "Jz7GhYDyBgqOEHl1YDzGlA": {
    "date": "4/4/2018",
    "text": "Good service, great staff, but the food was bad since we found a stray hair and two mosquitoes in it. If it weren't for those details, it would have been fine.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rQztP7OF0vAQqivMzM-ZPQ"
  },
  "ew8UAD4fqHOjPKUBwDnIKA": {
    "date": "12/10/2017",
    "text": "I'll start by saying that my review is not based on Zoe's food. I LOVE the food here which is essentially the only reason I come back (try the orzo tabouli salad or the chicken salad). That being said, Zoe's has MAJOR issues with their to-go orders. I would say about 75% of the time, my order is wrong. The staff is always polite and they always offer credits but there comes a time when it becomes too often to just write it off. Zoe's, it only takes a simple repeat of the order to get it right, please work on this because I'd love to leave a higher rating for the food!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7ekmFrXS0bsnlS0RzuQGew"
  },
  "MpeQQY5GO17m1QEPu_z_wQ": {
    "date": "4/2/2017",
    "text": "As stated in previous reviews, it's best to call ahead at this location to decrease wait time.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8XJ7DpZhQrzxNIJDRShf5A"
  },
  "PFzPXA9B5BgEw5KQ2gWsjQ": {
    "date": "2/23/2018",
    "text": "a while back i went to a zoes kitchen as i did every Saturday eve after i work out at the planet fitness next door to it to have my greek salad  which i love but this one time i found a lady bug walking around in my salad and when i brought it to their attention they though it was hilarious and said i would not be charged for the extra meat! well if that is what zoe's thinks about their customers so be it! i have not been back since not even an apology from them! i think the cook deliberately put the bug in my salad because he thought i was a spic! thanks bauba you saved me $500 a year to zoes kitchen!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sB7A-sgt3i-KjYQgrKgs5w"
  },
  "0SrACjy04nOJKjoJi-1m3A": {
    "date": "11/18/2015",
    "text": "I'm a HUGE fan of Zoe's. But for me this location is just okay. It's definitely a hit or miss with customer service and cleanliness. But what remains good is the food. Like Nikki says I don't know why there's potato salad in the bottom of the Greek salad but I really...really like it. One of my new favorite things is the turkey stack simply because of the feta spread! Man, it's good. And that limeade is just the right amount of sweet and tart....I can't get enough.   I think if they get a few things worked out I could be a fan of this location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "w5GKVhMUYcB4C-lh8H81gw": {
    "date": "12/10/2016",
    "text": "I probably passed this place 100 times when I used to frequent charlotte, but didn't try it until today. I'm used to crowded LA restaurants so it was nice to come somewhere that I didn't have to wait a long time for. A great variety of food on the menu and everything looked really fresh. The people working here were so nice! Oh and I love the bottles of their home made Greek dressing on the tables. Really feels like you are at your friend's house and it's her kitchen :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7OCbIm0KCDKnzDIk9f8-bA"
  },
  "L7MEc6uculxPfmoWlmh5Ow": {
    "date": "1/11/2018",
    "text": "Love Zoe's, great food. The one star is for their catering service, for which they charge $25.  I placed an order, 2 days in advance for a lunch meeting.  My usual experience with catering orders from other restaurants is they show up early, and have plenty of time for set up etc.  I waited an additional 20 minutes past my delivery time to call only to hear that the delivery driver was running behind and that she \"meant\" to call but became too busy. The order showed up minute later - but I think a 20 minute late lunch catering order with no call is unacceptable. That will be the last time I place a catering order for over $100 of food for poor service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SqxT0m98S_SSmA9zGNWyFA"
  },
  "I7q08QZqwVMHhzSW41GvgA": {
    "date": "5/20/2017",
    "text": "The Rosemary Ham and Mozzarella Panidina was delicious. The potato salad had a little too much prettier in it, but still quite good. Staff was extremely nice and helpful.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "grv2VPX1MC3ksbXp3rIhFQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Rosemary Ham and Mozzarella Panidina with Potato Salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/grv2VPX1MC3ksbXp3rIhFQ/o.jpg"
      }
    ],
    "user_id": "MOn_-1kAYxxlkIRN7Jhz5A"
  },
  "QHKgcC1wXMWXZUELuTfeqQ": {
    "date": "2/26/2017",
    "text": "So to start...I love all things Zoe's! Their lentil soup is my absolute favorite. Today I ordered a quart of it to have later. I usually check my food before I leave but I've never had a problem with their soup so I just left. Well I just took it out the bag and something seemed different. My lentil soup was extremely watered down. I'm used to it having a thickness to it and I really felt like they just gave me tomato broth with lentils and carrots in it. Not what I was expecting or what I was excited to have. Very disappointed today.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lAo7meQNX5aFwCCD4n48KA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lAo7meQNX5aFwCCD4n48KA/o.jpg"
      }
    ],
    "user_id": "CgskYfvMFA9LNEYL0JZopg"
  },
  "UH0waJBB0l1osd-zJX9S0w": {
    "date": "11/17/2017",
    "text": "Other than our chicken roll ups being correct the rest of our experience was terrible.  We ordered online and still had to wait 15 minutes for our order to not only discover when we got home that our salad didnt include dressing and all our sides were wrong.  Say your time and money by going elsewhere",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RcTZsvhqoYdSY9YbAwv9cQ"
  },
  "noGjUZu__1_Xt6n2HaPwuw": {
    "date": "11/13/2015",
    "text": "I ordered the quinoa salad that was okay but nothing special and a bit pricy for my taste based on the portion size. This is a great place though if your looking for a healthier eating out options. People that work here are Friendly and helpful..",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "7hwKCQ3Fi8g1mrMnS7QKBQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Quinoa salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/7hwKCQ3Fi8g1mrMnS7QKBQ/o.jpg"
      }
    ],
    "user_id": "UbRTTaGMwOOvlRJ2KvU3ng"
  },
  "6ls482UofT-SnBFlA5uTBQ": {
    "date": "7/6/2016",
    "text": "After a long run, my friend and I wanted something healthy and fresh for lunch! It was the 4th of July and all of our healthy spots were closed. Luckily Zoes was open! People kept telling me how good it was and I'm disappointed it took me this long to try it out. The menu was so big, inexpensive and perfect for all types of diets. I ordered the chicken salad and fruit plate. It was amazing. I want to order this again! It had cucumber, pineapple, romaine, grapes, strawberries, cantaloupe, green apple, pita slices and chicken salad. It was refreshing, filling, and the perfect summer treat! The staff (young man) working the register was SO NICE. He could tell I just finished a workout and brought me over a giant cup of iced water. I didn't even ask for it! I will be back to Zoes for sure! There was indoor and outdoor seating, it was clean inside and a fun bright environment.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "mEYU_tBCIbiQgkCqzk_ynA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mEYU_tBCIbiQgkCqzk_ynA/o.jpg"
      },
      {
        "img_id": "ZH5A10M_BNfPYXe8cFCOaQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/ZH5A10M_BNfPYXe8cFCOaQ/o.jpg"
      },
      {
        "img_id": "chgtreJQvVp24mvnEmqsHg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/chgtreJQvVp24mvnEmqsHg/o.jpg"
      }
    ],
    "user_id": "fckbgE3ugmIWYVZpTrXSfQ"
  },
  "fpgQZ0YzjCuhCDawoXZoQQ": {
    "date": "10/17/2016",
    "text": "From the outside it was hard to tell if this was a sit down restaurant or order at the counter. It was the order at the counter type which is what I was hoping for. They have many Mediterranean options and sides, apps, desserts to choose from. I got a chicken pita and side of roasted veggies. The chicken pita was delicious at first but then fell apart as the sauteed onions were too much for the pita to hold. It turned very messy very fast. But it was still delicious! As we're the roasted veggies on the side. I got the limeade they had at the counter not expecting it to be as sweet and sugary as lemonade, but it was just that. Should've stuck with water as I was trying to be more healthy. Anyways all in all it was very good food, just pretty messy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "WlMmWyALiCtIcT3Tjz2Q7g",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/WlMmWyALiCtIcT3Tjz2Q7g/o.jpg"
      }
    ],
    "user_id": "KHbnJXr3gx4-JfI5U00YCg"
  },
  "Hq2mrpJ8BBRBQYRx4N4A9g": {
    "date": "7/7/2017",
    "text": "Waited well over 30 minutes for one turkey sandwich take out.  Every time i inquired about my meal I was told we are trying Ma'am.  We are just running behind.  The issue was people that had placed to go order were given their orders before.    The food was horrible too, kind of like it was rushed to be put together.  Second time for bad service and sub par food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8MPTwwGLc48Azfsa-hjHAw"
  },
  "63T9DralK5thWa7foTWB7Q": {
    "date": "7/11/2016",
    "text": "Wow talk about great customer service! So after posting my original review the management of this location reached out to ask me to give them another try. The very first thing I noticed was a note on the side door letting everyone know it was heavy. I left a comment about this in my original review and the note made me feel like they were really listening! My order was not only completely correct, but came out super fast! I hope this new experience keeps up on my next visit, but I know they care about their customers after this trip.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8pmxwY_nmXYBzKPa-klk3Q"
  },
  "DZSwcGw0vPMY-xx7cWb_CQ": {
    "date": "5/4/2016",
    "text": "Came to this location for the first time last night, I usually go to the one on mallard creek church. I met some friends for dinner and ordered my food, we sat down and friend #1's salad came out, they apologized for my wait and said my sandwich would be out soon. no worries, it's been less than 5 minutes since i ordered! friend #2's food comes out a couple minutes later and they brought me a cookie to apologize for my wait. and my food came out a minute later. all in all, I was waiting less than 10 minutes and hadn't even begun to wonder where my food was, at the Zoe's I usually go to I'm used to waiting AT LEAST 20 minutes for anything to be brought out.   And i thought my food was better at this location. All that to say, I was blown away by the customer service at this location and friendliness of the staff.  I never even thought I was waiting a long time, but the employees did, and aimed to make things right and went above and beyond when nothing was even wrong in my mind.  Absolutely wonderful location!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QvZWD9OijX9ve-LA2JOR8w"
  },
  "9FgI7F2loAVKytCsqVwU8Q": {
    "date": "3/5/2016",
    "text": "Very, very healthy menu.  High-end, quality ingredients.  Clean restaurant and conveniently located in the downtown Charlotte area. Parking is a bit away but worth it.  There is no drive thru.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "xAn9rQHLv_-i3NEhpg0meA"
  },
  "DEfOJ2Za6lqFq25GUpmWzw": {
    "date": "3/4/2016",
    "text": "I love Zoe's in general and it's one of my \"go-to\" places for a quick healthy lunch when I'm out and about, but this particular location is just poorly run.  I've given it numerous opportunities and it continues to fail.    The Zoe's ordering app is normally a great option if you're needing to get in and out quickly, but this location for whatever reason is unable to meet the expectations set when placing an order through it.  We're talking up to half an hour late when the app promises it at a specific time.  That disconnect just shouldn't happen.   To go orders are wrong more often than not whether they are called in or ordered online, even with simple orders.  I've ordered Greek chicken salads on multiple occasions where the chicken was mistakenly left out.  I don't know how it's possible to miss the most important part of the salad.   You may fare better if you dine in rather than getting food to go because you can make sure they actually give you chicken.  Whether you choose to dine in or take out, good luck.  I, for one, will choose neither and go elsewhere.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "UYp9lazOwsIIaLwVrDrAQw"
  },
  "hSscYeRSHE7kxG582m5Kpg": {
    "date": "5/12/2017",
    "text": "I am a 5+ year Zoe's lover (Phoenix and Charlotte locations) and I am very disappointed in my last 3 visits to this location! Dressing missing from one order, missing pepperoncini's and olives from my salad on another order, and today they were completely out of pepperoncini's, the pita tastes old, and the lettuce was quite sad looking. Hope this isn't a trend!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x_knPAHai1jJM9sYE79fBQ"
  },
  "ursFYxUG1aSO4sqZu7hjyw": {
    "date": "1/9/2017",
    "text": "Okay ...Zoe's is constantly good!! There best thing to me is their salad! Taste so fresh every single time!   I also love the pimento cheese of course coming from the guy who got kicked out of the Vermont cheese store for eating too many free samples!   So I'll keep coming and the new flatbreads are good as well!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "8cTAetTTa9OvZ8ZQ6hQPhA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. New items on their menu now!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8cTAetTTa9OvZ8ZQ6hQPhA/o.jpg"
      }
    ],
    "user_id": "wcubg4QbsWBhc5bjlkCdDw"
  },
  "LJePvccFCTcdXxJiKUoxKw": {
    "date": "9/27/2017",
    "text": "First time here...slightly disappointed. Ordered the #livemed. Waited about 7 minutes. Girl brings out order with my name then asks did I order the side live med or full live med??  At that point it didn't matter my lunch is only 30 minutes so I guess it's the side live med that was prepared!!! Didn't know there was an option of side or full. Silly me. Guess I should be happy my lunch was only $5.80 including the drink(that should've tipped me off)",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pMmXieGp4dowFE2xC3G3yA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Top",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pMmXieGp4dowFE2xC3G3yA/o.jpg"
      },
      {
        "img_id": "c8mfBjG0s-sQuLf4C1rpIw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Bottom",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/c8mfBjG0s-sQuLf4C1rpIw/o.jpg"
      }
    ],
    "user_id": "vBxT4_bjFrbZEarWz6vsCQ"
  },
  "G1G6wp2eps9rSZ3D6yhElQ": {
    "date": "4/18/2016",
    "text": "Eh, to have tried more authentic Mediterranean food, I am floating around 2.5-3. I was shocked by the prices, might as well go dine at a restaurant with a waitress , get the full experience,  vs this quick option .   I felt the selection was OK, I can't say anything popped out to me. I ended up ordering the tuna pita, it was OK. Everything was just ok, not really much of a distinct flavor to get excited over.  I will say the options for healthier food , and vegan/Vegetarian options was great . Other than that , I may have to go to Zoes again it give a more extensive review....",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 6,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "o6Nba0yZdBTrOOq0PDycqw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Tuna Pita with pasta salad",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/o6Nba0yZdBTrOOq0PDycqw/o.jpg"
      }
    ],
    "user_id": "lUXifKGBbbRUNxaPnuekXw"
  },
  "lTpy25bIXWZ9U9RLNwPqRQ": {
    "date": "11/1/2018",
    "text": "Always great food and super friendly staff. Some idiots couldn't figure out how to get out of their parallel parking spot, blamed me for parking too close to them and shoved an electric scooter underneath my car after I had gotten out. A Zoe's Kitchen employee witnessed the whole thing and took the scooter out. WHAT AN AWESOME GUY! I can't thank him enough, he totally saved my car because I never would have seen the scooter. Zoe's food is as good as its people are. You should eat here!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFdPbR-gbrXAjo6N1oEjrA"
  },
  "lQ07ddrWxnPCqCpOsZrW3A": {
    "date": "5/12/2017",
    "text": "The Greek salad here isn't your typical salad. It's served on top of a bed of potato salad (red potatoes). I was caught off guard the first time I ordered it, but now I've come to like it- even though I eat it separate from the salad. Overall, the Greek salad is decent size, plus the Zoe's dressing is light (vinegar/olive oil).   My work has also ordered catering from here (30 ppl) before and it was awesome! We got a variety of items:  -Greek Salad -Chicken/Beef Kabobs -Veggie/Chicken Roll Ups (my favorite!) -Cucumber orzo salad  -Rice -Hummus Trio  Everyone thoroughly enjoyed it and everything was super fresh. In addition, it was something different than your typical Panera/sandwich catered lunch. I would highly recommend ordering it again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "EtFYEN0sbxkZOOt3DE7vWg"
  },
  "oROWIpTR8qFMLnSSqtiu6g": {
    "date": "8/5/2017",
    "text": "My fiance and I were running errands around the metropolitan (Office Max and Marshals) when we were getting hungry - almost hangry! I have never been to Zoe's before and he always raves about it, so it was the perfect opportunity. We walked in and got in line. When we stepped up to order, the cashier (I believe Jessica) was welcoming and nice. I ended up order the chicken & steak kabobs with rice pilaf and potato salad while Zach ordered the steak stack with potato salad and an order of cole slaw. They had a little selection of beer and he ordered the Sierra Nevada Sidecar and they actually did not have any, bummer. He ended up getting the Sierra Nevada Pale Ale. We got our table outside and it was a beautiful day! Once the food arrived, it felt like we barely talked. A combination of us both being so hungry and the food being so yummy! The steak (they didn't ask how I wanted it cook) was a little chewing but still delicious and had a sauce on it. AMAZING SAUCE! The chicken I think was just salt and peppered (but still very well cooked not over done) but I got to choose a sauce to dip it in. The rice was perfectly cooked! I honestly did not know if the kabobs without a good carb side would be enough, which is why I ended up getting the pilaf - which was a wise decision! The potato salad was good, but they have a Greek dressing on all the tables and I put a little dabble on top and it completely made it better! I finished almost all of my meal except a few bites (which Zach was more than happy to finish for me!)  All of the employees were nice and friendly.  I would have given four stars, but because they did not have a beer they displayed I am giving them 4 stars. I wish I could give 4.5!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Bfa28wFFRPaEyETzvXLWUQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Bfa28wFFRPaEyETzvXLWUQ/o.jpg"
      }
    ],
    "user_id": "l6wqZwWnXt1l-NInReBufA"
  },
  "a7bkvFp-GnTlTUqaAaBWRg": {
    "date": "7/24/2016",
    "text": "Good, clean food. The menu is pretty large so even if this isn't your style, anyone can find something good here. I forgot the technical, menu name but I ordered a ham and cheese sandwich with a fruit cup for the side. The food was pretty good and filling but it's something that can be made at home. The fruit is very fresh.   Check it out, see what the hype is about. Go on a pay day if you're on a budget- they are kinda pricey for the portions.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "J82o-hYRfeodwNcSsW7Cfw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/J82o-hYRfeodwNcSsW7Cfw/o.jpg"
      }
    ],
    "user_id": "NgBYSAf3BQUX0Mwj0Y_vjQ"
  },
  "a43MkZwyjNwvuSkvfuG43A": {
    "date": "8/21/2018",
    "text": "Let me first off say that the place was very clean and the staff super friendly. Now onto the food we ordered the chicken pita, cup of fruit, chicken with rice, two sauces and potato salad. We sat around maybe 15 minutes and our food came. The chicken pita was so big that you couldn't close it they left a maybe half an inch thick tomato on it and the chicken wasn't shredded it was so big that the only way you could eat this is with a fork. The pita was kind of Dough-ie If that makes sense. They had a white sauce on there that was really good, I just wish I could have picked it up and ate it like a pita. As far as the chicken and rice, the rice has no flavor kind of tasted like that stuff you cook in the microwave in a pouch. The chicken was good a little bit chewy. The potato salad was OK. They have this green sauce (I wish I knew the names of the sauces I'm sorry) but that was really good mixed in with the chicken and the rice it made the meal better. I know this place is more like fast food but I was just thinking the flavors and the freshness was going to be better. If you're looking for something quick and filling this is it. If you're looking for a mediterranean flavor maybe try somewhere else.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Yf714i73hNK4oUp0f7YmSg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Grilled Greek chicken pita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Yf714i73hNK4oUp0f7YmSg/o.jpg"
      },
      {
        "img_id": "ZdIMjYIfa_6SFIJulJq1Ig",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Grilled Greek chicken pita",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZdIMjYIfa_6SFIJulJq1Ig/o.jpg"
      },
      {
        "img_id": "E4Vx76aDcmHoJflFM10f6Q",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Chicken and rice",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E4Vx76aDcmHoJflFM10f6Q/o.jpg"
      }
    ],
    "user_id": "YDNYkxlo8ZWIZxgCAxO5Hw"
  },
  "Yw83gwDMN-GXJZoKpPDCXA": {
    "date": "2/7/2017",
    "text": "I was hesitant to try Zoe's knowing it was a chain. Mediterranean food that would no doubt be watered down for the masses (as chains tend to do). But when my mom wanted to meet here for lunch I decided why not give it a stab?!    I decided the best plan of attack was not to look at this place as a Mediterranean spot but as a salad/sandwich place in order to prevent disappointments based on authentic flavor comparison. I wasn't going to get a kabob anyways when I knew it wouldn't hold a candle in flavor to La Shish.    So we ordered a baked feta appetizer and a ham and mozzarella panini-style flatbread sandwich to share. The sandwich came with a side and we opted for the Greek salad. Maybe there were a good deal of takeout orders but there was no one else in the actual line ordering food and yet it still took over 30 minutes to get the feta. I thought this was fast casual..most sit down restaurants don't even take that long for apps. The feta arrived rather awkwardly having about 5 little pita chips on one side of the plate. It was as if the other half had fallen off on the way to the table and they just figured no one would notice. However it happened, there weren't even close to enough chips to cheese and my mom will pile some stuff on a chip. We had to use the pita that came out with the sandwich (which wasn't too far behind) to eat the rest of the cheese. But I will say the feta was really good. The sandwich while not Mediterranean in flavor (but I wasn't expecting it to be) was also really flavorful. Ham, mozzarella, herbs with some sort of aioli (red pepper perhaps?) was a really nice flavor combination. The Greek salad was alright thought it really disappoints me when any restaurant uses powdery feta, especially one that claims to be Mediterranean, ESPECIALLY when I know they have a good feta that they use for the baked feta app. Come on guys! The Greek dressing on the table was also just alright. Kinda lacking flavor. To wrap the meal up my mom got a lemon cookie which she loved.     Overall the food was pretty good, although I will probably get something other than the Greek salad as a side next time. The service was forgettable, but that's not a big deal for fast casual other than the fact that the food took forever to come out. Probably wouldn't crave this place or go out of my way to come here but next time my mom suggests it I will be glad I meet her here.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "I-FDBYB8Q8yQk0bGvnDsEg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Close up of the rosemary, ham, mozzarella sandwich thing. The sauce on it was good too",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/I-FDBYB8Q8yQk0bGvnDsEg/o.jpg"
      },
      {
        "img_id": "q9qsnZLVr0P6yorYerWg0A",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Rosemary, ham, mozzarella sandwich thing was yum but the Greek salad hit a nerve with me as I hate when places use powdery feta",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q9qsnZLVr0P6yorYerWg0A/o.jpg"
      },
      {
        "img_id": "PqFIztFMxn1yNcBgE5MSUQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Bakes feta was great but no, hadn&amp;#39;t started eating the chips pre-photo, they really only gave us 5 1/2 thin chips",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PqFIztFMxn1yNcBgE5MSUQ/o.jpg"
      }
    ],
    "user_id": "Gs2sRbzk3mX-hgkDwlbK-g"
  },
  "S16X_6Mwd2iJjYsuCPOmGA": {
    "date": "9/8/2018",
    "text": "Real food, not just typical fast food without any nutrition.  It's quick, it's healthy, it's tastes good.  You can get a drink, there is adequate space to sit, and it's affordable but not super-cheap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "w5_sIx5qCfkIr5VoEOkF6g"
  },
  "dwX4B-t8VQyzwkCTf63DpA": {
    "date": "10/22/2016",
    "text": "I do like Zoe's Kitchen but, it can be a hit or miss with basic seasoning. On the usual, the food is great, I love getting the salmon kebabs entree and then braised white beans are my absolute fav side here. I think the salmon kebabs are way more heartier than the chicken kebabs. We actually order a pint of the beans to take home and eat as a soup, very creamy and flavored with rosemary. Salads are always fresh. The chocolate cake is usually very dense, almost brownie like. They are very understanding when it comes out to replacing the listed side with a side of your choice.   Parking is pretty crazy around here around lunch time, I'd suggest calling in and ordering so you can pick up and just get out. I docked a star because I think its overpriced for what you get. I'd rather go to Jasmine's Grill for prices and authenticity. But, Zoe's is very convenient and right next to TJ's so I'll keep coming back.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "C5QsUsQg5I3dMdLM02SXGA"
  },
  "7WksegwnHGhNk524bpsCdw": {
    "date": "2/11/2019",
    "text": "I do believe, that a group of 95-100 year old individuals could make food faster. Yeah here are 3 other individuals in this restaurant and I have been waiting for 15 minutes..",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MvAOd0JjwKoofkovpSsj4A"
  },
  "tXROkvVNPUfbgwr6l0zLUQ": {
    "date": "8/29/2015",
    "text": "Had dinner here last night. It was crazy in Uptown, everyone out at the Panthers Pre-Season Game. We went the opposite way and decided to finally have a relaxing sit down dinner at Zoes.  Place was nice and quiet for it was like close to 7:30 PM. People coming in to grab meals to go and several patrons placing orders.  The Steak Kabobs were delicious. Cooked to your liking.  The hummus was creamy. Rice Pilaf good but a tad salty. Have to watch my salt intake and sugar levels for I have gained a huge muffin top. They have wine here too.",
    "rating": 4,
    "rated": {
      "funny": 5,
      "useful": 6,
      "cool": 7
    },
    "photos": [],
    "user_id": "Aciq1ddPC6jeQHLB0vZKVA"
  },
  "dGfs8uykaWINMGlfvtJYUg": {
    "date": "9/21/2017",
    "text": "I had the pleasure of enjoying the Power Grain Bowl with Chicken.  The presentation was incredibly fresh appealing. Cucumbers, large cuts of seasoned chicken breast, grains, and two sauces satisfied my quest for a healthy and quick meal.   The staff was very friendly and I could taste the love. Wow!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "a_tQLc_wmuX1nRMm5WTxFw"
  },
  "aCoG16jDJ-UGNAF4fTfS0w": {
    "date": "1/11/2019",
    "text": "I love Zoe's.  I always end up ordering the Greek salad (it's the only salad I actually crave and they sell the delicious dressing by the bottle) and often the hummus trio.  The lamb kofta balls are delicious and my daughter loves the tomato soup.  I have only knocked off one star because the product can be a little uneven, particularly when they are super busy with the lunch rush.  I've taken to requesting extra olives because on one occasion my salad came with only two.  Another time the pita was skimpy and I had to ask for more.  Overall though, very yummy food!!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sRzmzXAFvLn3BJ_S-P0MfA"
  },
  "LFQjRMiX5epSkzO5yD30rg": {
    "date": "8/26/2017",
    "text": "Located in a really nice area of Charlotte with your choice of inside or patios seating! The staff here is very friendly and the food here always tastes fresh. Being a full time athlete when I think of healthy eating, this is the first place I think of. Lots of great selections for anyone to try! The best item on the menu in my opinion would be the steak rolls with pasta salad. I always leave satisfied and recommend everyone to try! This franchise is fresh, healthy and a nice first change to your healthy living!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QORaOyMwY_NPvUa_fiYiuA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Steak/chicken rolls with pasta salad and garden salad.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QORaOyMwY_NPvUa_fiYiuA/o.jpg"
      }
    ],
    "user_id": "w_PgFsdtno9O8l2T_H3GHw"
  },
  "AwwNGZmK_DdVUxd5kpja7A": {
    "date": "8/16/2017",
    "text": "This was my first visit to Zoe's after hearing from a friend that it was really good place to grab a quick, more healthy bite to eat. Their menu has enough options, but not too many to be overwhelming. Their side dishes are unique and yummy, and a nice change to chips or fries. I ordered the lamb gyro with the pasta salad. The lamb was ground, which was different for me, but still good. The pasta salad was made with basil, feta, and tomatoes which was a nice twist and flavorful. My mom ordered the chicken kabob which came with veggies and she loved it. You get a decent amount of chicken on the kabobs and we were both satisfied when we were finished.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M1iMJ-j8utBDWNgpTfqBzA"
  },
  "bSX67r7QIWRr5nHE3Ibdeg": {
    "date": "9/3/2014",
    "text": "I don't really get why there is potato salad in the bottom of the Greek Salad, but I like it.  Zoes Kitchen is a relatively quick, healthy meal option in the Metropolitan/Midtown area. It will probably take you longer to find a place to park than it does to get your food. Again, my rule of thumb for this parking deck is bypass the first floor and drive up to higher level. Not worth the hassle or frustration. This deck and 485 = #alloftheroadrage in Charlotte. Also, keep an eye on the front for street spots. (I can never park there... I don't parallel park)  My good friend Paul is apparently the \"Norm\" of this location. He comes here so often that all the workers know him by name. It's like having lunch with a celebrity.  I can't seem to stray away from the Greek Salad. I always add chicken and drown it in the dressing. It's healthier than ranch or blue cheese... I can be excessive, right? I can usually split the salad in half and make two meals out of it. I love that they have a hibiscus green tea drink option. Although, they also have Mr. Pibb and I love the laid back, less ambitious sibling of Dr. Pepper.  Zoes is probably more like a 3.5. I still feel like it's a little pricey for what it is, but the workers and service at this location are great. They also have a nice outside dining area. So, I'll round up to a 4.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h0BaDuqUiWoV15uU35cM8w",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Greek salad with chicken",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h0BaDuqUiWoV15uU35cM8w/o.jpg"
      }
    ],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "YGcnbSixpiBNNQAO3o1MTw": {
    "date": "1/24/2017",
    "text": "I love me some Zoe's Kitchen. This one was as good as any other. I ordered takeout and my food was fine. My only issue here was the bathroom. I made the mistake of walking into the men's restroom. They're single stall facilities. It was the condition of the bathroom is what made me realize I walked into the wrong one. There was urine on the floor, paper towels on the floor, etc. Just an all around nasty bathroom. So bad, I realized I was in the wrong place. Did I commit a crime? #HB2 Anyhow, the women's restroom was much better and far more clean, but they should make it a point to check the bathroom once per hour, especially during high traffic time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 1
    },
    "photos": [],
    "user_id": "sdLns7062kz3Ur_b8wgeYw"
  },
  "UfaQr-vT7WvHn2Hg0p586A": {
    "date": "8/17/2014",
    "text": "We visited on a Sunday afternoon. The atmosphere was great and the weather was perfect so we ate outside! I had the Chicken & Slaw Pita with white beans as a side.  The beans were nice and hot.  They were firm but soft and had good flavors. The pita was stuffed to overflow! The chicken was cool, seasoned to perfection and it had great big hearty pieces inside. The slaw was crisp and crunchy and had a good bite.  To wash it down I had Hibiscus Green Tea on ice! Oh yeah!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xlsfw1R7uZk4Gt3KF0XiEw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Chicken and Slaw Pita with white beans...yummmmm!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xlsfw1R7uZk4Gt3KF0XiEw/o.jpg"
      }
    ],
    "user_id": "s9FZn2pjY-fvOrApr1aTLA"
  },
  "0RR01cSnAEHCpRZhCkXPcQ": {
    "date": "5/16/2019",
    "text": "I really like Zoe's Kitchen and all that they have to offer.  I wish they had one directly uptown, but this is the closest in the midtown area.  I decided one morning I still wanted Zoe's for lunch and decided to place an online order for lunch later that day.  It was an easy process and paid on the spot.  I made the trek to Zoe's from my building - about a 20 minute walk, and arrived a few minutes early from my pick up time.  They had my order quickly made and was prompt with my pick up time.  So, excellent service and experience with service of an online order.  As far as food goes, I like a lot of their items from the salads, to the roll-ups, sandwiches, etc.  My favorite is the turkey stack with roasted vegetables which I am able to split into two lunches!  Food was great as usual!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lBNSWAHgg8GLS_JcHcdV2w",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Half of the turkey stack and veggies, love these!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/lBNSWAHgg8GLS_JcHcdV2w/o.jpg"
      }
    ],
    "user_id": "hXQHu4Isp1wZYO6A-I0zQg"
  },
  "aQazthMC5E0YpAvLDvZQDQ": {
    "date": "7/30/2019",
    "text": "The menu is a little confusing.  We stood there with several other people, none who knew each other, trying to figure it out.    Chicken kabobs are great.  The white beans side has a lot of rosemary flavor.  Turmeric rice is a little harsh on the stomach.  Will just have a different side and pita bread next time.  Plenty of items to try.  Would definitely come back.  Nice, spacious seating, strong AC on a hot day and bathrooms were clean.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "2XaSQSfROdmq44TWLldnJg": {
    "date": "7/17/2018",
    "text": "Stopped here after going to look At West Elm Furniture and I'm so glad I did .. wow , this greek bowl was one of the best bowl I've ever had . You could taste the freshness of the veggies and chicken with every bite . The bowl was very big and I got full fast . However ,because it tasted so good I could not stop eating it even though I was so full ..  the place inside was bright and airy with friendly staff ...  highly recommend Greek Bowl , I'll have to go back and try the others",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "dV-NUyUeDnrhfQPcEuX7Nw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Greek chicken salad , amazing",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/dV-NUyUeDnrhfQPcEuX7Nw/o.jpg"
      }
    ],
    "user_id": "7PVY7A7Top7ButcfLkTJTA"
  },
  "CEfCkerC2oD2iqqoi4EvjQ": {
    "date": "9/26/2018",
    "text": "Big big fan of Zoe's Kitchen! Although the parking at this location can be a little tricky, it is worth it! The food is always fresh and the prices are very fair for the portions and quality.   I am a big fan of: -Cauliflower Rice Bowl with Salmon...ask for extra tzatziki on the side!  -Live Med Salad -All Kabobs- Chicken, Salmon and Steak -Greek Salad...their house dressing is amazing  -Steak Roll Ups...so bad for you but SO good -Sides: Braided White Beans, Potato Salad, Marinated Slaw -Chocolate Chip Cookie  I'm pretty sure everything on the menu is good so you can't go wrong but those are just a few of my favs!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "giFKNmoRH4rpf8ip2Xvq8w",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Lamb Pita with side Greek Salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/giFKNmoRH4rpf8ip2Xvq8w/o.jpg"
      },
      {
        "img_id": "AeeAw2dCI4-VQHs5hVEfNA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Side Slaw",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AeeAw2dCI4-VQHs5hVEfNA/o.jpg"
      },
      {
        "img_id": "DT_48XDmouo6Qx9RrYnH7w",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Cauliflower Bowl with Salmon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DT_48XDmouo6Qx9RrYnH7w/o.jpg"
      }
    ],
    "user_id": "4UHBndk1j0GsN6NOStpAdw"
  },
  "PNO2Odxxo6ip95qIi-Frwg": {
    "date": "6/21/2019",
    "text": "On 06/21/19 at approximately 1:30 pm, I was having lunch at the Zoe's Kitchen, 1055 Metropolitan #1100, Charlotte, NC. 28204, when I observed two female wait staff petting a dog on the outside terrace. I find their actions , to be unsanitary and disgusting. I believe the wait staff needs trained in being sanitary, and not petting dogs while at work.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0PLXe_gj5FwMTuiYqJnsXw"
  },
  "tPkdkbqovjeH4urSihDCdA": {
    "date": "10/25/2018",
    "text": "One of my favorite places to grab a meal on the go. Staff is friendly and the food is stellar. My go to is the quinoa salad and will sometimes order the classic hummus for sharing. Highly recommend for anyone looking for an inexpensive healthy take out option.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aropAdFQgVzv_qjn9vmvEw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Quinoa Salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aropAdFQgVzv_qjn9vmvEw/o.jpg"
      }
    ],
    "user_id": "dPxR3kJmlX6mAYGyAWheOg"
  },
  "8-7LbEjSUGyu82bKnCKNEw": {
    "date": "3/13/2018",
    "text": "I wasn't blown away by Zoe's, but enjoyed the food. I had never been to one. For lunch, it wasn't that busy, but the rainy weather probably contributed to it. This is a fast casual place specializing in Greek/Mediterranean food.   After contemplating the menu, I landed on a power bowl with baked falafel. The bowl options also included a choice of cauliflower or rice. The power was a variety of grains. You can also include your choice of protein.   The bowl had nice flavors. I didn't really read everything included. There was a tomato onion salad, fresh cucumbers, tzatziki, a red flavorful sauce and of course the falafel.  The flavors were nice and the tzatziki was on point. The major downfall was the falafel.  It was dry and there wasn't enough sauce to save it. I was still hungry after, too.   I like the bright colors inside. But the booth we sat at had a huge tear on the seat. It just didn't make the best first impression aesthetically. Staff was friendly,  but it was a meh experience.    I'd try it again, but would get something other than the falafel bowl.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "wmmJYxTQ2cmG7r0uQRHiEg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Falafel Power Bowl",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/wmmJYxTQ2cmG7r0uQRHiEg/o.jpg"
      }
    ],
    "user_id": "0cG35-H4SbjjTTSlNoK3fw"
  },
  "UJOHtCRADHNoPJd1Xg1uHA": {
    "date": "11/20/2017",
    "text": "Zoe's is the place to go for chicken salad.  Every time I've ordered the chicken salad it has been delicious.  Our family gets the chicken salad for birthday parties and it's always a big hit.  Tonight we ordered takeout online.  One plus is that the food was ready on time and ready.  I order a cauliflower bowl with chicken and my husband got the chicken roll ups and pasta salad.    The cauliflower bowl was pretty good but the chicken was over cooked.  It was hard for me to eat the meat.  The chicken was dry in the chicken rolls ups as well.  The pasta salad was good.   We probably will only go back for the chicken salad because over $20 was too much to pay for Dry and over cooked chicken.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "cnbhD37Bbe98XU28cnr-dA": {
    "date": "5/22/2018",
    "text": "Ordered and received wrong food. Called and manager owned up to mistake and apologized. Will update after I return to get order fixed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "3l-67D_Z-aAbAX-FTFv7BA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Will try in the future!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/3l-67D_Z-aAbAX-FTFv7BA/o.jpg"
      },
      {
        "img_id": "tSUDTUrZgQ6qhITTRuIftw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. New rewards system",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/tSUDTUrZgQ6qhITTRuIftw/o.jpg"
      }
    ],
    "user_id": "YZZaaZGdZ08L1h3XWPrwJw"
  },
  "-YEKrMS0SamWGvbM7YNBzg": {
    "date": "4/23/2018",
    "text": "My favorite spot to go to when I want healthy food fast! I ordered the chicken kabobs with the rice pilaf and roasted veggies ! It was so flavorful and light!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "kDppjkN7xIgxunSLfhYjpg"
  },
  "WVeDb_yr9_2TDcm_7ZQb6Q": {
    "date": "4/20/2018",
    "text": "My only complaint is that it was pricey, however, I really enjoyed my meal. I got the turkey stack with a side of fruit, fountain drink & 2 bottles of water for $20. The staff was pleasant & the dining area was clean. No long wait times & food came out fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u5XpYsnGeU9pfgUNcMrg9Q"
  },
  "MKI7i3wTmL_feOPgc-ynQA": {
    "date": "4/4/2019",
    "text": "Food came out cold. There was only 3 tables, not sure why our food wasnt cooked fresh. I had cold kabobs and fresh fruit. There are better pleas to eat out there, guys",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q73xqEnk42FIUX5Ay3uudA"
  },
  "Xjr__z4Akfb53CBr80ig5A": {
    "date": "9/15/2018",
    "text": "The cauliflower rice bowl was pretty good. Served cold, which wasn't what I would've done. Added grilled chicken. The vinaigrette you can add is good. Overall my meal was decently refreshing and flavorful, but nothing special. Cheap enough.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qTL_Yu1LYndKGRGwVY9TMA"
  },
  "mb6mEv5Xe8np3_52GbJgSA": {
    "date": "6/13/2019",
    "text": "First experience with Zoe's catering for an office meeting. Food was great. Half of our $400 order was forgotten. The rest was delivered 45 minutes later. I was expecting a call from a manager or someone to apologize, but that didn't happen which was disappointing. Like I said, the food was good, but next time I'll order elsewhere. Overpriced for very little food and they lack respect for the customers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "r_cbRu4NlCCsnzmxtB0a-Q"
  },
  "dzWYSMislfsXGqgbP4UlFQ": {
    "date": "8/21/2018",
    "text": "If you're looking for good quality Mediterranean food, this is not your place. I'd say it's more like cafeteria quality.  Thick, doughy pita bread, chicken kebabs that seem like they've been microwaved. Bland rice.  I won't come back unless I'm extremely hungry and desperate",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NVVvBp1JeBHysSUp58KRVA"
  },
  "FbNkcYeW0jCXNfPwebh_Zw": {
    "date": "7/17/2018",
    "text": "Really liked the cauliflower rice with salmon bowl.  Store felt kind of sticky but staff was efficient and service was quick.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wklmU8CM7czQQBuhOC4k9A"
  },
  "004qRwTr2qOmyPv0md0DpQ": {
    "date": "8/12/2018",
    "text": "Really love this place. A good healthy-ish option for lunch and/or dinner.  One thing of note: The management on my last visit was really Short and borderline aggressive with the staff. Customers could tell he was a little agitated. I understand \"motivating your team to move quickly\" but his tone seemed a bit much.   Outside of that, this place is normally a 5-star for me.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UL1cN7493ro-VmsJC9jkqw"
  },
  "h5CtA16hL18JCUcXwXrIdg": {
    "date": "1/20/2018",
    "text": "Not sure why this place got iffy reviews honestly. The line moved quickly even at busy lunch hour!   Friend and I stopped in for something decently healthy. The lady at the counter was very helpful and directed us to items we might enjoy. Neither of us were disappointed. Food came out in a timely manner, the lighting was great for lunch time dining and the atmosphere was relaxing. I had the harissa salmon pita and will be coming back for it. Friend had the trio salad and the serving size was so big she took some home for later. :) we will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YbrPohAwxkUSBEgu9AyZyQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YbrPohAwxkUSBEgu9AyZyQ/o.jpg"
      },
      {
        "img_id": "EKhNGg3f-oVkWOKKawyWUA",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/EKhNGg3f-oVkWOKKawyWUA/o.jpg"
      },
      {
        "img_id": "X0_rus96c30ciPNEsohMMQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/X0_rus96c30ciPNEsohMMQ/o.jpg"
      }
    ],
    "user_id": "zqXfVR6WbLUFgnb_jBs4cg"
  },
  "7af8QIlR4FD-Wc_8VscRbA": {
    "date": "3/1/2019",
    "text": "Amazing service from front of the house to rear! Food was extremely fresh and delicious! AWESOME! #table #31 #Guy From Lake Norman.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GaFn3FOM1UPv7We1BcOC2A"
  },
  "dDDLNV0XldbdAlrhaebYGA": {
    "date": "7/5/2018",
    "text": "I tried to order salmon kabobs again and they have been consistently burned. They are not even supposed to be charred yet burned. Come on Zoes!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LQgKMi23O4o169XyaqXGDw",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/LQgKMi23O4o169XyaqXGDw/o.jpg"
      }
    ],
    "user_id": "NJO3C6fF0FfvvdDpXzMoaw"
  },
  "cywNq5BrZ0kLB2fH89kGyA": {
    "date": "1/9/2012",
    "text": "This is a good place for lunch with your Mom friends and kids in tow. They have a good variety of sandwiches and salads as well as other items like hummus and pizza. I had the chicken salad sandwhich and my toddler had a cheese quesadilla.  It's very affordable too. I'll go back here again someday!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AwkZyBmf5eQW7BAMLgukng"
  },
  "rmM466lneO0NH6D04_zGaw": {
    "date": "4/11/2012",
    "text": "Tasty, quick, clean and the white beans are so good I buy them by the quart load. Great place for a quicky before Trader Joes ( so I don't buy the whole store) ... get the Chicken Kebobs ... and there is often parking right outside so you don't have to do the round and round by TJ's",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fKSLkwPWLjZjOOJuVGPttw"
  },
  "xpy9-v2xMipBBtdKSTgdPw": {
    "date": "4/21/2011",
    "text": "I was looking for a quick place to grab lunch with my husband the other day and he suggested we try Zoe's Kitchen and I am really glad he did. It was awesome! It really hit the spot. I had the hummus plate, which came with pita bread and a Greek salad. It was perfect. I cannot wait to go back because everything on the menu looked great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "TI7yaNQ8EIrrk6goArE1-w"
  },
  "c5xgD5GrWNvvSwefclGdBw": {
    "date": "4/10/2012",
    "text": "Seems to be consistent with all the Zoes locations but the Metro is the worst... YOU MUST be rude and a professional eye roller and have ZERO customer service skills. All I asked for was a substitution and they acted like I had asked for a huge favor. Pretty sure all you have to do is push a button. Then I was charged $2.50 extra. Love the food but have no plans in returning after several encounters of rude behavior. I was a regular (3 x's a week and had been ordering the same thing with out being charged but ALWAYS got the attitude). No longer will I be going there!!!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU5LI1YpbShZoM52tBMBgA"
  },
  "x7nMjdkCGDodYoOk-r5cWw": {
    "date": "10/31/2010",
    "text": "I travel lots and try to keep expenses low, so I often frequent the Paneras, McCallister's and Jason's of the world.  Zoe's blows them all away.  Love at first bite!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "zgfCLLjGOGUOpcjKDPE5ZA"
  },
  "8afhISw2WIZ3VG0V_4BgLA": {
    "date": "8/16/2011",
    "text": "Went to this spot this past Sunday, nothing to get excited about it.  It's totally overpriced \"greek\" food.  There isn't much of a selection on the menu, just a few sandwiches and some kebob platters.  The chicken kebobs are just ok, the rice pilaf tastes like crap out of a box.  I paid $12 for chicken kebob entree and a vitamin water, I could've gone to  Greek Isles nearby and had better food for less. If this is supposed to be fast food, it should cost a lot less than $12 for a meal with a drink.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qGjId7zLZM64Px3zi1clyg"
  },
  "xpV83AGdgGJou2QkUaHWrQ": {
    "date": "9/10/2011",
    "text": "Zoe's Kitchen is great!  I frequented the Midtown location 2-3 times a week when I worked in the area.  Anne, the manager, runs this location well.  The food is always fresh.  You can eat something different every time you visit.  My fav is the Grueben.  Quite yummy!  This is a great place for a healthy and fast alternative to fast food.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nUjZZgkdvJ-_heVWtse7qw"
  },
  "XCzVXV5HIGrXmEo6JNbc0A": {
    "date": "4/28/2011",
    "text": "I like the analogy that Zoes Kitchen is a greek version of Panera and great standby for those days we don't want to cook but want something quick and healthy. The service is always friendly and they have a very busy bustling lunch but they cycle people through pretty efficiently. Dinners tend to be less busy.   Our favorite dishes are the grilled chicken dinner (because their braised white beans and roasted veggie sides are awesome), veggie pita pizza, and steak stack. However our #1 favorite dish was the salmon kebabs that we were devastated (as in the kind of devastated when I found out Alias was cancelled) to find out were discontinued. I voiced my dismay to the staff and they encouraged me to tell corporate, which I did. I told them I'd miss the succulent salmon kebabs with the great grilled zucchini, etc. I was impressed with their customer service because they replied right away that they were very sorry, that they recently switched distributors and the quality of the salmon wasn't reliably good so they'd rather not have it on the menu than be disppointing. They were seeking out alternative vendors, but they appreciated my input.  I was glad they seemed to take my concern to heart. The lack of salmon kebabs has admittedly decreased the frequency of my visits, but I'm not mad at them. I've heard their rollups are a favorite. Their limeade is also fun and very good. Skip the chocolate cake though.  I think the artwork in there is fun and colorful.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oInNoiunuDYWakwmvDiVVg"
  },
  "qpVDMZhZsGBvh1CSYCGu1Q": {
    "date": "9/4/2010",
    "text": "Stopped in over my lunch hour with my husband while trying to squeeze in both lunch and errands at the Target across the street.  First tip, park in the bottom level of the Target and walk over.  You'll have a better chance at finding a good spot there.  Nice, modern decor and outdoor seating seems promising upon first arrival.  However, after some probing about the tuna pita the staff admits that it is canned tuna.  I've never eaten can tuna but I do give it to my cat.  Against my better judgment I decided to order it any way.  It was edible but confirms my previous decision about canned tuna.  My husband ordered the turkey on ciabatta.  Again, nothing special here.  My side of vegetables looked charred and soaked in oil.  One bite and I was done.  The side of beans my husband ordered were probably also canned.  If you are looking for a healthier alternative to greasy fast food then it might do in a pinch but if you have the time to spare keep driving to find a better healthy alternative.  Not to mention, two meals and one lemonade came to $17.00+.  For that price you can find fresh food around Charlotte that isn't prepackaged.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "xUGzn7Z1IS5sFD2f9RhCoQ"
  },
  "S5kSGaQhaTFy1_RENZPtpA": {
    "date": "10/14/2011",
    "text": "kind of a weird cafeteria system. But the good is good and healthy.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1JZbzlvPevm7iEfhI5GqZg"
  },
  "Pa-NBLIk267YN7ygAgcnlQ": {
    "date": "7/2/2013",
    "text": "I love taking clients to Zoe's Kitchen for lunch. The food is amazing, the menu has many options, and the area is very modernized.  My biggest compliment is how clean the restaurant is. I usually go there around 1-2pm and the restaurant is not slammed, but there are a lot of opened tables with left over food, plates, trash, and drink spills on most of the tables and floor. My clients and I stood there for a moment by the dirty drink machines to figure out where to sit. They do have a patio, but the humidity was to high to sit outside. We told the lady at the front and she just shook her head in a yes movement. She  just kept doing what she was doing behind the counter. We finally sat at a dirty table and placed napkins down. The lady never came around to clean any of the tables, but a gentlemen came and started sweeping the floor. I gave 4 stars becuase the food is healthy and i never feel full once i leave. A little worried about how clean the back of the house is if the front doesn't even have a good matience team. My suggestion- clean the front of the house and acknowledge your customers.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hy_lBc5ZdoxUXRp4b42q3A"
  },
  "lR45nrxgtzXS2fh-ypra2w": {
    "date": "8/20/2013",
    "text": "I love Zoe's Kitchen! I have had dinner here several times and ordered catering as well. I have always had a great experience. The food is always delicious and hot! I love the grilled chicken dinner with the veggies. I also like the chicken kabobs and the pita bread is awesome. The service is always pretty good. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lXfdCFYiybs0jFkyIEoATg"
  },
  "pXmOcc2sjdnN5XQt0xEVaw": {
    "date": "10/25/2010",
    "text": "Grabbed Zoes on my way home last night, I was in and out with my order in 10 minutes!  I wanted to try the chicken orzo soup but I knew I needed more than that, so I got the steak stacker as well.  The soup was actually spicyish and not very heavy on chicken or orzo, when I got to the bottom I saw it was loaded w/black pepper.  The sandwich was good, but messy.  I have also had the vegetable wrap and the greek salad in the past and all was good.  Only thing I was never crazy about was the steak roll-up.  Overall a solid choice for healthier fast food.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Szle_N5FSs4Q7odfyd4P7Q"
  },
  "D4zSBx3D05yR2WC0DLVmJA": {
    "date": "1/20/2011",
    "text": "A pseudo-Greek cafeteria. Good variety on menu, but a tad pricey to my mind for lunch. Staff friendly, but sometimes a bit obsequious. If I was in the neighborhood, I'd go back...but not worth driving there on its own.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "gnnbCcXZUVdu1FZWTcuhRg"
  },
  "leTSh42LVd0-7YSYZzeehg": {
    "date": "12/2/2009",
    "text": "Really liked this new spot for lunch. The staff was friendly and courteous and the food was tasty and a little different than regular lunchfare. There is a nice, healthy selection of sides when ordering a sandwich. We tried the limeade that was recommended by a friend. It was delish!  I gave it 4 starts b/c thought it was a little pricy for lunch. However, the location almost makes up for it. Can't wait to go back with my kids for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "h-Xrx75mwUlP7-tQYlxnFA"
  },
  "LbBADkwsBHxzwhBkZi9p4g": {
    "date": "10/19/2011",
    "text": "Zoe's is probably one of my favorite places to eat in the Midtown area of Charlotte.  The service is wonderful, the staff are the kindest and the food is the freshest! I could eat my Hummus Plate usual everyday!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "yv3NT2gubqA_5DhrpT4z4g"
  },
  "UfsXkPXr5q5iHeMiNa8rZw": {
    "date": "2/10/2011",
    "text": "Had the Greek Chicken Parmesan last week....meh.  It's a grilled chicken breast with hearty marinara, serve on a bed of orzo (???).  Would have been delicious if not for the overcooked orzo.  But, the greek side salad is really one of the best I've eaten. The lettuce (romaine and a little iceberg) was fresh, topped with",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "7IZQ06zkYSCLQM4JU9kFvg"
  },
  "fb7ociwvq1ufBH_HjqWEng": {
    "date": "1/19/2012",
    "text": "So, I accidentally walked into Zoe's today 7 minutes before they opened. Before I could even say hello, an employee named Crystal shouted across the restaurant, \"We don't open until 11!\" at the top of her lungs. Okey-dokey. I was just picking up some items from the case so I stood there like an idiot for 7 minutes while Crystal barked out orders to the kitchen in a tone I wouldn't even use on a dog. I have had tried to support this business since it opened (the company has an appealing backstory), ordering food from catering on several occasions. I agree with other reviews that the food is ok, bordering on bland, it's pricey for what it is -- and the service at this location is horrible. That would have been ok but after the way I was greeted this morning, I'll never eat there again. Even though Zoe's is a chain, some locations are franchised, while others are \"corporate-owned.\" This location is corporate owned, and the service reflects it.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9cbv35PWZ5UwvSxAmaJKHg"
  },
  "6sn-0MBsTEO4N9vgGVViGA": {
    "date": "6/25/2013",
    "text": "Lousy service  So I ordered for a group lunch and they do not deliver unless you have 24 hours notice - however someone else in same office had it delivered and placed order less than 1 hour prior. The only reason I ordered from them was because the coworker had done so and had it delivered. Other places deliver. But they already had my credit card.   Was told by manager that they use an outside service and they have to give them 25 hours notice.  Well I am sitting across from someone that did not need that. Whatever.   I go to pick up the items and drive across town to do so. I get there and pick up and go back to office. I get there only to find that they have failed to provide the soup for one of the orders.   I called to have price corrected.  Then as I sit there - one other order was a salad with chicken on it and special instruction to remove pasta - no-chicken left the pasta on.  I didn't even bother to call at this point.  I go to our Charlotte office pretty regularly we are a large company in the area. But we will not be ordering from here.   As far as food is concerned is wasn't bad food. The chicken pita fell apart but was tasty - the salads were good   The service was lousy",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "33_ba3krpFtQBJpC2C9KOQ"
  },
  "gLCLeP-c97QLD4bT7JQxAg": {
    "date": "11/10/2016",
    "text": "Don't know where Zoe's thinks Mediterranea is but they ain't been there. Their menu features an orzo \"tabouli\" salad...I am not inserting quotes for effect here, that's literally what the menu says. Meaning: they don't have tabouli. I ordered the steak kabob, which here's a pro-tip Zoe's, I don't think it's very Mediterranean to slather it in a sugary glaze. That's more of a fatass American thing. The hummus was your basic grocery-store mass-produced stuff.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "iT1ml9bCZpRQcy4FxjkHNg"
  },
  "HI0ux2K7Ct1-rHYzaArmvg": {
    "date": "8/18/2015",
    "text": "Excellent healthy Mediterranean food!  I'm a fan!  My favorite is chicken kabobs with red pepper hummus instead of rice",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZLN5ty_Vp6vQycBAJyN-3A"
  },
  "JuoseGhpW7LUmKwW118_ug": {
    "date": "6/18/2015",
    "text": "Always fresh and the service is great! I love the Zoe's app... I'm eating a pita sandwich half off. Yum",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fjJuHayj9ec0Biykh7tqSg"
  },
  "uLyfYC9P8KHZ7-Tvb8DMLA": {
    "date": "5/14/2015",
    "text": "Consistently good!!  I've never had a bad meal here.  The service is fast and friendly.  The meals are 'Instagram-worthy' and taste just as good as they look.  Their rewards program is fun and actually worth participating in.  Highly recommend for anyone looking for a delicious, but guilt-free lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MfeqcXPQHxhqWTs8zbO3EA"
  },
  "upG3on3viHZb9pc1cxC9kA": {
    "date": "5/29/2012",
    "text": "UPDATE: my sister received a call from the GM and he was very very nice and apologetic. He wants to do everything he can to make the situation better and we certainly appreciate that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "CHf8EbvYLUUCpQxP9_lP7A"
  },
  "HgoD5r3phls6gjdcZWiIsQ": {
    "date": "8/18/2016",
    "text": "Great customer service!    Our food was delayed coming out.  Other customers that came in after us received their food before us; we've all been in this situation before.  To make up for it, Zoes refunded our entire bill AND gave us a $20 gift card.   Great food and service.  Thank you.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pvXES25SGwaYU8OSmCRsag"
  },
  "m1ivy4gwgp5fDte5wOY9UQ": {
    "date": "10/4/2015",
    "text": "Wow this was my first time at Zoes and I was not impressed...first of all I could not order my meal because the lady that was in charge kept barking orders to the kitchen. Second of all my food came out really late.. I asked who was the person in charge and the guy attending me told me it was Maria(the lady that kept yelling to the workers in the kitchen). When I asked to speak to her she showed no concern what so ever about my complain. Bad management skills all I have to say is that I will not be back to Zoes kitchen.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FKVGe3qi-kvqGUeMD4Kl-Q"
  },
  "qmTuP9EmY_dMN8lnbcVbjA": {
    "date": "12/21/2011",
    "text": "Zoe's is definitely a place I visit regularly. The location is very central, but the parking can be a pain sometimes. Parking in the parking deck is always complicated what with people flying in and out of Trader Joe's and Best Buy. I usually parallel park on the side of the restaurant.  Every time I go I get the Grilled Shrimp Salad with marinara sauce instead of the dressing. The shrimp are marinated in a sauce that is rather oily and are left with their tails on, but the delicious chargrilled zucchini and white beans make up for it. Their pita bread is rather good too, but perhaps a little too much flour.  The drinks are self-serve and they offer green tea which I founded refreshing.  This place can get rather crowded during peak times so I try to come at odd hours. The service is a little slow, but I suppose that's because they make everything fresh. It's kind of expensive for being a casual sandwich, salad and soup place, but the freshness is worth it.  I love sitting outside during the warmer months and people-watching. The staff is very polite and helpful as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8hwFfkT6efqYY1RdwWbStg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Grilled shrimp salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/8hwFfkT6efqYY1RdwWbStg/o.jpg"
      },
      {
        "img_id": "N9_67ggiwcEoZDHFX2WgUg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Chicken Kabobs",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/N9_67ggiwcEoZDHFX2WgUg/o.jpg"
      }
    ],
    "user_id": "fueoc-QtdyLFQ1PsgiwM_A"
  },
  "lW_mFNjPhYAkZ0JFM-_Fww": {
    "date": "7/10/2015",
    "text": "I love Zoe's Kitchen! This location at Metropolitan is great! The staff are super friendly and food is superb!  You cannot go wrong with Zoe's!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9IjYt2DlLwwKwkiINCMk0A"
  },
  "-SM7H5Hw94GFH8G5jt09Vg": {
    "date": "6/26/2015",
    "text": "This place is a staple for me. When I need some vegetables and didn't prepare a healthy meal for work I may just be here.  It is a take a number and sit down joint but it's clean and the staff are very friendly.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FE80__e0DYi0uZdpQvGNZA"
  },
  "_m_SwidZ_KscyLGZgBRo1A": {
    "date": "6/23/2015",
    "text": "This hurts because I was initially a huge fan when this location first opened.  Service is great, but the food quality and portion sizing is going steadily downhill. Plus the chicken kabobs are always cold as if they've been sitting out for too long.  I will return as a customer when they get their act together.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "V3yO3PQBxLlHOFVaMc4hhQ"
  },
  "L9joCzZqx_RYYW-bsw4anA": {
    "date": "4/25/2015",
    "text": "My favorite right now. Food is great as well as customer service and management. It is little pricey but worth coming.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRyda7ZT_vooNCl8XDp7rA"
  },
  "CIijdwBXUp9_6zui3lT9PQ": {
    "date": "3/3/2014",
    "text": "Zoe's was okay! Definitely a fast food atmosphere. The food was pretty good but not the Greek I was expecting.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "iZTlv8zMqk26B0l4ZbIoPg"
  },
  "FjOdehnjYQ6smTIzegIJWQ": {
    "date": "6/8/2014",
    "text": "I had a chicken pita with a potato salad here and it was delicious! One of the best pitas I've had. I did feel it was a little pricy for a pita which is why I only gave it 4 stars. It was also very healthy... Wasn't smothered in ranch or taziki sauce like many other places.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FQS5OdzaDhPq1q3ZcBTNmg"
  },
  "0mFE4PadfdAxLRN2Zi2W9Q": {
    "date": "1/17/2015",
    "text": "Upscale fast food. Think if Panera did Mediterranean. I appreciate it for the type of restaurant it is while remembering it's still fast food. A reminder is that a Wendy's is across the street. Would you rather eat there? Better food for the busy masses.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Q-ygNyz2wDS5-rybizAmXw"
  },
  "NPUbTuWd3zoULuVuDkAIsw": {
    "date": "12/9/2011",
    "text": "So when visiting stores in Metropolitan complex Zoes Kitchen is a good place for lunch and a nice alternative to 95% of the places in town.  They serve good food that is good for you.  The Kebobs looks great but for this visit it was a turkey sandwich which was very good.  Salads are also tasty.  For dine in patrons they bring your food to you.   During warmer months outdoor seating is nice, though a ton of traffic goes by which isn't so nice.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "DXh8yxwZCg5Ckj5kmDvKXw"
  },
  "XhttLqtu5PCjDSJq948KiA": {
    "date": "1/28/2015",
    "text": "I ordered the spinach roll ups which come with a side,  I chose roasted vegetables and a fountain drink.  That consisted of broccoli, carrots, mushrooms,  and onions.  They bring your food out to you because it's cook to order. When I got my plated I realized it had chicken in the roll ups, which is optional, but I didn't want that.  I was wondering why my total came up to $10.50. I didn't make a big fuss about it because it was only a $1.09 difference. Next time they ask if I want a copy of the receipt,  I will say yes! Overall, my meal was delicious and I would probably come again if I'm in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3Kef6zPaDhI-8iVRoSBcjw"
  },
  "ddwVoIKtCrkyGtoX5F-bQg": {
    "date": "4/6/2014",
    "text": "My very first yelp review and it goes to Zoes Kitchen. It was also my first time eating at this restaurant and the food was excellent. I had the steak stack sandwich with roasted veggies on the side and my boyfriend had the steak roll ups with rice pilaf on the side. Everything was seasoned perfectly! The atmosphere was nice and clean. The only reason I didn't sit at one of the outdoor tables is because it was cloudy and windy. We'll definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mOICWPG9dlWaDvFWXDRQow"
  },
  "j54gVdn4bjlIG8qE413Gvw": {
    "date": "2/29/2012",
    "text": "I recently stopped into Zoes after passing it for well over a year during my trips to Trader Joes!  Zoes atmosphere is laid back, crisp, and bright.  It is a corner shop with big windows that beam in sunshine. The menu is full of different healthy options that include numerous vegetarian friendly choices.  Similar to Panera, you can also do a \"pick two\" option where you can sample smaller sizes of various sandwiches, soups and salad.  As other Yelpers have alluded to, the Greek salads are amazing.  In fact, I am so hooked that I purchased a bottle of their homemade dressing (just $3.99).    The staff are very friendly and are happy to answer any questions you have.  After placing your order, they will hand you a stand with a number on it.  Just take a seat and your food will be delivered shortly!  The beverages are self-serve and my favorite part - unlimited!    Some of my favorite choices are: Shrimp Kebabs - seasoned perfectly with just enough kick.  The rice pilaf served with this entree is cooked to perfection and to top it off the platter is completed with a small Greek salad. Hummus and Pita - the hummus is made from scratch and the pitas are warm.  Need I say more? Chocolate Chip Cookie - I can honestly say that this is *the best* chocolate chip cookie I have ever tried.  It is crispy on the outside but chewy and gooey on the inside and packed with large chocolate chunks/chips (yes, both).   Greek Salad - served with red onion, olives, cucumber, tomatoes and delicious feta!  The Greek dressing is already on the table so load it up!    Zoes also sells its famous chicken salad.  As a new pescatarian, I have not tried it, but as a former carnivore, I can say it looks damn good!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "WPNPOHwyyzDH2QBI9ketcg"
  },
  "gb4a11Lp_8zTUf87RoXu9A": {
    "date": "7/18/2017",
    "text": "Not impressed with kabobs, delivered cold to touch and tough.  The portions,  were very, very small. Left hungry. Also, soup tasted like it was out if a can of Campbell's. Gross.  Won't go back.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BIrECacqHZrfnY3KIDZCzQ"
  },
  "Lk_EJrhjhpQO5s30HaSbHQ": {
    "date": "12/30/2014",
    "text": "Stopped in here looking for something different for lunch.  The atmosphere is good but I'm quite disappointed with the sandwich.  I ordered 1/2 tomato basil soup and 1/2 tuna sandwich.   The soup is a generous portion and the sandwich looked good.  When I tried to find the tuna I was shocked.   Barely any tuna on my sandwich.   I tried to spread it around so I could eat something besides lettuce and bread but there just want enough to spread across 1/2 a piece of bread. After spreading it as much as I could, I tried a bite.   As you could imagine, with that little of tuna, my sandwich tasted like bread and lettuce.   Not what I wanted to spend $10 on for lunch  Quite disappointed. Go to Which Wich instead.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cv3hfMYPTmSU9KRhDqpVvA"
  },
  "DG4MvldHUMP5m8QIxZI1TQ": {
    "date": "5/11/2016",
    "text": "I love this place. I always get the chicken kabobs with the Greek salad. There dressing is amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cd2PJSqbaGwntb75mNg30g"
  },
  "YBRou_eQUOOsJYorvqHHXQ": {
    "date": "2/10/2014",
    "text": "A great healthy choice for people on the go. This location is ideal and parking garage makes it easy access. It is pretty crowded around lunch but food goes out pretty quickly.  Food is pretty good, but I can only speak for the few things I have had.  Chicken salad is a must have.  They sell by the pint, so you can take some home as well!  The steak roll ups is my go to anytime I'm in the area.  They have carmalized onions and mushrooms as well as some cheese thrown up in it!    Overall a really good, quick food stop.  They also sell wine and beer, so you can go sit on the patio on a nice day and enjoy the views!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "C3wJYcNbb1aA1upSAOdBeA"
  },
  "bS27dRX0-FlCRSETlveY3w": {
    "date": "2/26/2014",
    "text": "This gonna be my next favorite spot beside Panera Bread.  So much different variety of food and it's healthy stuff.  It's a Mediterranean food. They have different type of pita, wraps, and salad. For the meat eater there are different type of Kabob. Great place for lunch in the uptown area and always crowded.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6L_GFzTrT4Rk5L4yuJLtqg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. My food.  Haha... #quinoasalad and chicken pita",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6L_GFzTrT4Rk5L4yuJLtqg/o.jpg"
      },
      {
        "img_id": "QeO4fSgUm6Kh4lBKgtDVuQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Lol...his choice after work out",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/QeO4fSgUm6Kh4lBKgtDVuQ/o.jpg"
      },
      {
        "img_id": "oco7EDnZP01HSzfEabSCaQ",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Hummus",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/oco7EDnZP01HSzfEabSCaQ/o.jpg"
      }
    ],
    "user_id": "OzzatIL4sOzcX0iF7Ud09Q"
  },
  "3I1f8ocMV1VNX1Lb1XKWlw": {
    "date": "11/10/2013",
    "text": "I haven't been to Zoe's Kitchen a lot, but out of the times I have been, the food, service, and atmosphere has been great!  I am a BIG creature of habit and when I find one item I'm a fan of, I will order it over and over again. With that being said, The Tossed Greek Salad is my favorite item to order there. From the grilled chicken, to the carmelized onions, the feta cheese, the pasta, olives, cucumbers, the pita bread and you can't forget the infamous Zoe's dressing, it makes for a great salad! I have also had Zoe's steak and chicken roll-ups, steak and chicken kabobs, fruit and the hummus and they all were amazing!  I highly recommend this Zoe's (all Zoe's for that matter) to any and everyone who wants some yummy food served with a side of great service.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Wyu18L1GE8tOGrQxCaOF3w"
  },
  "R3G9ooGxhpdaBkh8xZeK-Q": {
    "date": "2/18/2016",
    "text": "The food is good, never had anything I just hated. The chicken plates are yummy. My fav thing here is the salad dressing. I normally go here just to buy that dressing. Greek Dressing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hqmK61cMu_QdMFOpsEOxMw"
  },
  "jjWCd08y1cTMoH0unFWEJg": {
    "date": "6/22/2013",
    "text": "This location serves us rather well. Never anything too complex or difficult to work with on a any front. The service is friendly and fast, the food is always consistent, and they have great outdoor seating.   My favorite things to get here are the steak rollups, braised white beans, and the hummus/pita plate. I don't normally order anything with steak in the name, but the addition of mushrooms in these bad boys make it a nice entree. Paired with the rosemary braised white beans make for a nice meal. Also, the hummus and pita plate is a great app or even a meal.   Biggest gripe about this location, and the age-old tale of The Met, is the parking situation. Forget about the adjacent garage for their side of the shopping center. Either look for an open space on the street or just park across the street in the Target garage. Much easier.   Zoe's is A-OK in my book. Even with their crazy \"o\" in their name that my computer can't seem to locate. Cheers!",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "AvC5XQAElcGAAn_Wr5auEg"
  },
  "_jUfCpDdDVhS7vt0HCqCqQ": {
    "date": "11/3/2015",
    "text": "I love this place....healthy, and delicious!!! They have a wide variety, and choices for everyone!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "aeuL9UfoLs7CTOgOA0F0LA"
  },
  "DPaJDl4YS6VnG6P4QXnyxw": {
    "date": "4/30/2011",
    "text": "Fresh food fast is how I would describe Zoes Kitchen.    I've been hooked on greek salads lately and this is one of the best.  The dressing is simple (and sits on your table) and flavorful.  The salad itself contains romaine, a few tomatoes, chicken (optional) onions, kalamata olives and feta.  A very good combination in a big bowl all for $8.75 plus tax.    There are other options on the menu from sandwiches to pitas to kabobs, all with a greek flair.     To drink they have a wonderful hibiscus tea as well as the typical soda fountain sugary stuff and a nice beer and wine selection.  The place is decorated very colorful and they display art from local schools.    This is a good place to eat before/after you are at Target across the street or nearby Best Buy and Trader Joes.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 2
    },
    "photos": [],
    "user_id": "SlgpAnj2gQd44EM_Uq6DkQ"
  },
  "JRioOxPJZHxmmItQtpd95A": {
    "date": "6/16/2011",
    "text": "I had my reservations about a chain but I have to take that all back!  My sister suggested this place and at first I was bummed by some of the negative reviews on Yelp. Once inside it looked clean and the planters outside with fresh rosemary bushes were a mood lifter!   I've been eating vegetarian for the last month or so and I was excited to have some options here. I ordered the hummus platter and a side of roasted veggies. The hummus was smooth and topped generously with olive oil and kalamata olives. The salad was fresh and the dressing on each table was similar to one I make at home. Baby girl ordered chicken noodle soup and it had chunks of real chicken and carrots. Not a condensed soup concoction; that was nice. We also got a side of fruit and it had fresh ripe fruit! Amazing right! There was sweet pineapple, cantaloupe, grapes and strawberries and it didn't have that weird funky taste that most fruit cups have to keep it from turning brown.   The employees were friendly and helpful while ordering and I'm looking forward to going back!   They have a check in offer on Yelp for % off your total.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yOCFbDzerWLRwV7CVq4bMg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Side of roasted veggies - broccoli, carrots and onions.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/yOCFbDzerWLRwV7CVq4bMg/o.jpg"
      },
      {
        "img_id": "zlmqT5_-L_xuqIwmbsFr9A",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Hummus plate! Super yummy!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/zlmqT5_-L_xuqIwmbsFr9A/o.jpg"
      }
    ],
    "user_id": "FSIJydQyRRWrA8qgLTMJXA"
  },
  "CUh60rK-8ybBtoVZR0YBZw": {
    "date": "8/10/2011",
    "text": "Zoe's reminds me of Noodles and Company, amped up, grown up, and more consistent. Ultra fresh (you'll never find slimy, wilted salad leaves here, or dried up looking lemons) and friendly, this is one of my favorite quick eateries. After my first time here, I obsessed over it so much I had to go the next day. No joke.   My favorite dish here is the shrimp or chicken kabob plate. Not only is the protein super tender and seasoned well, it goes well with the rice, the accompanying salad has big hunks of salty tangy feta.   Their big honkin brownies/chocolate cake pieces finish out my meal. Some people would accuse this confection of being too dry, or lacking more frosting. Sometimes a big super moist decadent cake isn't what you need.   The take home tubs of pasta salad or hummus are delicious too, and a nice alternative to packaged grocery store hummus.   The only thing that could earn my fifth star is how the restaurant handles busy weekends. Tables sometimes aren't cleared and it's not very appealing to see half-eaten wraps and crumpled napkins strewn about.   PS. Another plus for me...the large plastic water and drink glasses and lemons. I can't stand tiny little glasses that require frequent filling up.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7M-rWYRGPfCDnb7tjl7QGQ"
  },
  "Jfc6XTUiSQqGrWkpE09F6Q": {
    "date": "5/4/2011",
    "text": "After dropping by Zoe's a few more times, I think it's completely fair to award them additional star. Why? Let me 'splain...  1) Super fast, super fresh and delicious. This goes especially for their Turkey Stack - a grilled sandwich filled with turkey breast, mozzarella, feta spread, lettuce, tomato, sourdough and rosemary oil. Get yourself a Turkey Stack.  2) The employees are really, really sweet. Forgot your fork? No worries, they'll snag one for you while you start on your sammich.   3) Nice outdoor seating. People watching can be enjoyable at the Met - trust me.   4) Their desserts magnanimous. I haven't indulged in one yet but the cookies and brownies look ah-mazing.   Definitely on my short list for a tasty lunch when I'm zooming around the Met.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "BmOl6cQiciyQrq_vvcjgzg",
        "caption": "Photo of Zoes Kitchen - Charlotte, NC, United States. Turkey stack",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/BmOl6cQiciyQrq_vvcjgzg/o.jpg"
      }
    ],
    "user_id": "qlC607Cyp0Mj91vDFvkp3Q"
  },
  "thUVL_GXYfzSfCHVdMJEuA": {
    "date": "11/21/2015",
    "text": "Chicken kabobs were cold and whoever packed my plate forgot the Greek dressing & hummus. The service was meh. Limeade was yummy (only reason for 2 stars)  but how hard can that be to mess up? Guess I'll be heading to one of the other Charlotte locations for my Zoe's fix from now on. There should be a better experience offered for their price point on food.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "NuurE7Tan3jf_4zXrzj8Bw"
  },
  "l4qpIA2Yb278oD6WfGa2TQ": {
    "date": "4/3/2013",
    "text": "Mediterranean? Are you for real? What is Mediterranean about this place? After shopping at Target one day I was hungry and did not want Target food, so I came here. I was excited to try it out because I've seen this place here for a while. It even has a nice outdoor seating area which I was excited about! I ordered a sandwich and a soup my friend ordered a sandwich and a salad. None of our food was up to par. So sad, I think I would have had much better food had I walked across to street to eat at the Wendy's. Their food has no flavor, it is a fast food restaurant aimed to look like a restaurant. This place reminds me of ordering something from Noodle and Company...Don't expect anything authentic or at all a Mediterranean experience. I don't think I'd come back even if I was really hungry, I'd rather go somewhere else since there are plenty of options nearby.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8zpZLEWweD0Tp6wLTzlZsQ"
  },
  "lQYD6RV4x2T5a1Ut0l46Hg": {
    "date": "4/30/2013",
    "text": "Love Zoes!  Real food, cooked to order and always delivered with a smile!    Two of my favorite dishes include the Greek Chicken Pita (grilled chicken breast, lettuce and feta) and Orzo Tabouli Salad with Shrimp kabobs (baby spinach, tomatoes, orzo).  Both are light yet filling and always satisfying! Make sure to download their phone app as well!  It's oriented towards a holistic, healthy lifestyle with inspirational quotes and goals.  There is also a great rewards program!  Snap and submit a pic of your receipt and watch the Goodies roll in!  I redeemed a free entree today :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QLfhl3XblO811-tsbkSlvQ"
  },
  "Yg9WBdkL5Y-HFjO7CRJ0PQ": {
    "date": "4/11/2015",
    "text": "Excellent. Super friendly staff, healthy food with plenty of options and really affordable. We go here often and everything in their menu is great. Their app for reward is also really nice, we get free \"goodies\" often.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XnMvOKtsv5QH_EwCpnlV-A"
  },
  "St_f0AH7OcIuDf5jvZ7G2w": {
    "date": "9/28/2012",
    "text": "Zoe's, I so like you. I mean, I do. But I don't think this is going to be a forever kind of thing. And it's not that's I'm not a forever kind of girl, or that you're not good, because you are... it's just....  Yep, that's basically how I feel about Zoe's. I want to love it and do like some of it, but it falls short of love on every level.  The Greek dressing on the tables here saves EVERYTHING you may not like/love on your plate (braised white beans, I'm talking to you! You're gross! Pull it together, man!) and enhances the things that really shine at Zoe's like their Greek salad.  The ordering is easy, food turnaround time is quick and the indoor/outdoor seating is ample and pretty comfortable but the food and lack of variety is what Zoe's leaving me 3 staring them instead of 4. I understand you're Mediterranean place but give me something more than 2 pizza on the menu - can I get some pastas? Maybe some more veggie options (and none of that Spinach roll up junk - it was the size of a taquito and for $8 I was a little bitter)?  All I'm saying is that I like you but I don't love you and in this city full of amazing culinary fishes, I don't think I'll be B-lining to return anytime soon.",
    "rating": 3,
    "rated": {
      "funny": 5,
      "useful": 0,
      "cool": 2
    },
    "photos": [],
    "user_id": "AWLMwFVdUCPtmo1IbQL3eA"
  },
  "r8dB47bGW3BlU_UXWrko5A": {
    "date": "4/22/2015",
    "text": "Not to happy with dinner. Came out cold.  Was to hungry to send back & get recooked again.. The weird thing is it took to long to come out cold.  Don't think I will return to this location again.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Bm3GfFyVftXSOLUtFrk4jw"
  },
  "lL6l3PTd7YlrZjtfUx90Mg": {
    "date": "11/5/2015",
    "text": "I work next door to this place, and it's the best! I eat lunch here almost every day. If you're looking for a cheap great FRESH meal, Zoe's the place. I've never had any bad food. Also the staff at this location is amazing! They've been super nice to me! This is one of my favorite places to eat! It's a must try!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "J3HqXXzoPjgJSir8nu70Ww"
  }
}