{
  "c0Nbf6NDzWe9qQHBnok9aw": {
    "date": "7/18/2015",
    "text": "They give you a lot of food and it tastes good. The curry goat is very tender and so tasty. It's pretty weird they ask customers if they want to listen to a certain type or watch any movie. Other than that, nothing weird or wrong with my experience. This is now my spot for Jamaican food",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "x0J9NuTF4VkT0C0c8ITE0g"
  },
  "86pYW3HVJL8Lrf7L55YIHA": {
    "date": "3/19/2015",
    "text": "I don't know why i haven't written this post awhile ago..but this isn't my favorite Jerk chicken plate only because I do not like sweet sauces..I know a ton of people who love sweet jerk chicken and to me that's not how it's supposed to taste. It's meant to be spicy and flavorful.The cabbage sweet,jerk sauce sweet and I unknowingly mixed my cabbage and rice before trying it so my rice was then sweet. If your looking for spicy jerk chicken this isn't the place.but portion wise is a good amount for your buck.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "d4btthLZC3B4vg1xlDtmeA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Jerk chicken w/sweet jerk sauce over rice..not for me",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/d4btthLZC3B4vg1xlDtmeA/o.jpg"
      }
    ],
    "user_id": "SgsMDlF-hjSbZlOj8XTZ8w"
  },
  "3_SUww6M4RIjqiyn6DQbWA": {
    "date": "9/12/2010",
    "text": "Dodging drunks coming in and out of Stool Pigeons, I decided to stop in on this small place. I did not see one person. The sign on the outside promised Caribbean (Jamaican) food. From the time I opened the door, I could smell nothing but the flavors from the island, the jerks, curries, and many other island favorites.        Looking at the menu, I see the prices are extremely low, and still , not one person (I realized why, they just opened). So I ordered the Jerk Chicken of course, that had a rich dark sauce. My wife had the Ox Tail, the sauce also was so good, you would want to drink it from a straw.        Do not let this little place in a strip mall fool you. They have very good and authentic foods, that will tantalize every taste bud that you have or wish you had. CAUTION! , if you have no idea what Jamaican food is or want a piece of square fish or chicken McNugget's do not go here. This is the real deal. Do not take my word for it. Try it for yourself. And... Do not drool on the keyboard while you are looking at the pictures.",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 17,
      "cool": 7
    },
    "photos": [
      {
        "img_id": "BMEITsqiW4bcDjhxm3pgcg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/BMEITsqiW4bcDjhxm3pgcg/o.jpg"
      },
      {
        "img_id": "OnPHaRVXfSkHhRRfQ9t-ng",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Bob Marley",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/OnPHaRVXfSkHhRRfQ9t-ng/o.jpg"
      },
      {
        "img_id": "9fszpdmFwQLWNBr1fHzzUg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Bob Marley",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9fszpdmFwQLWNBr1fHzzUg/o.jpg"
      }
    ],
    "user_id": "jGbj8fl575EIQJcfaA1FKQ"
  },
  "BOPjAsSvaMPWPT_xvJCunQ": {
    "date": "9/19/2016",
    "text": "I'm from BK NY so I know Carribean food. This place is ok. Could be better. I will try something else next time because I want to give them the benefit of the doubt. They are open late during the week",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x4QiMRLJtEMU_0P2LT4hqA"
  },
  "IwEuKvykwyKEwPNoFfflaw": {
    "date": "11/3/2016",
    "text": "As good as it gets.  Things are slow there but you kind of expect it.  I feel transported when I am in there.  The food is phenomenal! Very Authentic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Wea6MHKlTuw-f8hP6-96hA"
  },
  "bQKpHs0Z9dNNPzwocv5Hng": {
    "date": "7/17/2013",
    "text": "The good: - Jamaican food for Jamaican people - If you are not Jamaican, you will be alone - food is authentic - very cheap - yamman!  The bad: - can you order in Patois? - not a pretentious place",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOH1c-tLs2V3Ws4vCY9DMA"
  },
  "Vf0SbTiJRmeawqyBLdDVLQ": {
    "date": "9/20/2012",
    "text": "Omg!!!!!! This place is one of the best in the Charlotte area!!!!!       First off... When you step in, you are greeted by a waitress who is ready to seat you at your table, as well as eager to get you fed and squared away!       Second....I have been to almost \"EVERY\" Caribbean restaraunt in Charlotte, but this one is my favorite. And I will be honest, it's sheerly because of the authentic taste THAT IS CONSISTENT 24/7!!!!!!!!!        I have been to a number of other carribean restaurants in the Charlotte area whose taste change periodically, which is my pet peeve.        The verdict is that this place is not big on flash and glam. But it's big on taste AS WELL AS CONSISTENCY. Oh...and didn't I mention the large portions that they give you???? TRUST ME YOU WON'T ME DISAPPOINTED!!!!!!! GO THERE TODAY!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "fbzru6z_A2luhK_kzKs1xQ"
  },
  "TVnNNbi1gM5l2BTRuMVUcw": {
    "date": "11/30/2016",
    "text": "Service was horrible. Some of the options on the menu they were out of. When I selected my vegetable( collard greens) they gave me cabbage which I did not ask for. Then the waitress said 'oh they must be out'. Rice was cold and meat was mostly bone. They did only charge us for one plate because we were not satisfied.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uGx9AqijrctRFqke2NmvYg"
  },
  "DU6qcbobbFHEkCYVoWxM_g": {
    "date": "9/3/2014",
    "text": "Friendly staff and authentic Caribbean cuisine. Although I usually get my food to go,  I never wait too long and its the Only place I go to get Curry Goat...... it's the best in the City!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "zSopEEA4alb2z-MYaAqGIg"
  },
  "-8YRI5cSlaeqq0zmHbCSgA": {
    "date": "3/13/2013",
    "text": "BEST Caribbean restaurant in CHARLOTTE!!!  Love their curry tofu and vegetarian roti! It's good to know they have vegetarian options! Most Caribbean places only offer rice and peas and cabbage and call that a veggie plate! Haaaaaaa..... But Caribbean Hut has options....yayy!!!  Would love if they always had rum cake in stock :)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "mB3Z7gAC5lefxf4UZLzQVQ"
  },
  "kEp9GJooy3Ok8P1D6AoQ_A": {
    "date": "10/22/2014",
    "text": "If have ever lived in or visited Jamaica...you probably dream about the food. Well apparently dreams come True! As soon as you walk in the smell of spices hits you. Bob Marley is lightly signing don't worry be happy in the background. The staff are extremely friendly and the food is literally mouth watering! My only complaint is that I wish I got more meat with my oxtail! Although the meal (with rice, beans, and cabbage) was a healthy portion....I wanted to savor more of that delicious ox tail! My boyfriend got the curry goat, which was also amazing. We will definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "tP0iVmLn8fMUmS7abvVdvg"
  },
  "Iv8LDBzor6PRk42CGqPuMA": {
    "date": "11/10/2015",
    "text": "The food here is good jamaican cooking! The collards they serve are a nice alternative to cabbage. Could use a little more meat with the dishes but all in all good food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N8ZLTQj3VkTlHrB8L4KRGw"
  },
  "oYfAu0dtqv9ayhz2A1eGAg": {
    "date": "7/31/2015",
    "text": "I love this place I've eaten there several times and it is consistent. My favorite is the Curry Goat.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3JXXPq7W5xlz5NtAxTmrMw"
  },
  "cLm8wI12NjsXoOwg114_ug": {
    "date": "3/20/2015",
    "text": "The Caribbean hut will take you to a trip to Jamaica without having to leave Charlotte NC lol. Their beef and chicken patties are great, but you have to get them at the right time  because otherwise they will be a little dried up and obviously not fresh. I wish I could say what the right time is,  but I'm not sure. I guess it would be when they just put them out at lunch time. Also their curry chicken it's great.  Fall off the bone good lol",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "pTz4RTiI06ySru20pfD_mg"
  },
  "CjFfin1tS9-PhbpLvzOmmA": {
    "date": "6/30/2015",
    "text": "Really good, authentic, and spicy Jamaican food. The portions are fairly small compared to normal restaurants, and considering how much it costs for a meal, I'd say it's over priced. If the food was half the cost I might decide to go back again and again. Don't expect great customer service or super friendly staff, but when the food is this good, none of that really matters anyway.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FhwQWjf3AFH0IrEYEyq3lw"
  },
  "0N1LdlB4WvT7Q6rjnZoG3Q": {
    "date": "1/20/2014",
    "text": "I've been here a couple times and this is authentic Jamaican cuisine.  Been from Jamaica, I think I know something about my country's food and culture.  If you aren't satisfied with the portions, just ask for more and they'll deliver.  By the way, if you are not familiar with our cuisines, save your say for somewhere else.  I love curried chicken and the way it's always chopped up. Bone and all. If you want curried breast, just ask. Just remember that curried chicken is chopped up and may not have a lot of meat.  That's our culture. I had the Curried Goat and I must say that this is as good as it gets.  Definitely hits the spot and satisfies my craving for some good Jamaican food.  Mmmmm...I'm going there now to get some more.  Meet me there.  Let's eat!",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "UodpdYrVagSGQyJY_9mGng"
  },
  "TZHIj6jefYOVAVDdTRl8DQ": {
    "date": "5/19/2015",
    "text": "Jamican patties got my and my friend both sick after eatting. Thought it just might be me but girlfriend didn't feel well after eatting leftovers . To be fair the staff was very friendly and it's clean and not grimy",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TqoxE8B0r4CUWpGYAHXoOg"
  },
  "D-42dUdkoyKC0KyJiQP34Q": {
    "date": "8/21/2015",
    "text": "I really love the food but I can honestly say I have experienced fraud on my debit card twice after ordering and once from a credit card from a purchase I just made the other day. I have nothing bad to say about the food it's very good but I express its best to use cash with this restuarant.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mSy2T63qIfc7G7Oj7RRfWw"
  },
  "bvRO-RCtlF0NPnN8iYvVjw": {
    "date": "5/23/2016",
    "text": "The smell from all the food is what made us walk in.  and so clean.  The rice and peas was so good and the jerk chicken and sauce was amazing!  The oxtail left me a little disappointed though. It was a bit tough.  Could have cooked longer.  The server was a bit rude I felt like I was being  rushed, like I was wasting his time with my questions About His.food... nice location and plenty of parking. I would do it again  but hopefully he lady that was serving the patrons that were dining in would be up front serving. She was so nice",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I5cx7YhATuoQLdfZ7N2WhQ"
  },
  "WG2oTQMGGAnzq5W6L27acQ": {
    "date": "1/10/2012",
    "text": "Probably better than 4 yelp stars!  First of all I had never heard of this place and my plan was to eat somewhere else in the neighborhood (the other place was not opened for lunch so I walk in for directions and the Chef asks me if I know about Caribbean Food and really I do not if he said Jamaican or Haitian Food (only had a little of each) I couldn't have said very much more.  So the Chef says: \"I want you to taste this\"  (Fortune Favors the BOLD) so if you know me and especially if you no me, you'll know this is impressing me!  He brings over a small plate with three samples and does not tell me what they are, until I'm almost finished.  Curry Chicken (I guessed that one) and give it 4 yelp stars!  Another Chicken Dish with Brown sauce? Maybe? and OX Tail with a similar Brown Sauce.  Both of these with the Brown Sauce were Better than the Curry Chicken.  The Ox Tail (first time I have ever eaten OX Tail and it was one vertebrae section, bone still in) was very nice, a very fine flavor!  I WILL BE EATING Ox Tail Again!!!!   Impressed so I stayed!  Ordered a Lunch Special Jerk Chicken which came with Rice and a Cabbage Salad!  He told me the \"Jerk Sauce is spicy, Do You like spicy?\". So he gave me a bite and it tasted perfect!  This Jerk Chicken was very good, he put enough Sauce on it to go with the Rice.  The Sauce gets 4.5 stars.  The Cabbage Salad and rice were alright and I'm glad I got to taste them!  Next time I would probably get Plantains and Ox Tail and maybe more Jerk Chicken if I'm not by myself!  Impressive Service!  Most of the Patrons were regulars they would walk in say hello to the Chef and he would bring them a drink before they asked, then they would speak to me and tell me I would get used to the spice were quickly.  They were all speaking Jamaican to each other with a slightly different accent speaking to me!  Everyone was served speedy faster than a speeding ticket!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AXW8rYEXhl7jxdTGfjPokQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AXW8rYEXhl7jxdTGfjPokQ/o.jpg"
      },
      {
        "img_id": "oKgmW0BU-R7a1f0JMh_KZA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Yes that is STEAM!  Spicy Jerk Chicken, Rice and Special Cabbage",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/oKgmW0BU-R7a1f0JMh_KZA/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "k5NJB2xnCL6VLnY3dKcwYw": {
    "date": "3/8/2016",
    "text": "Stopped in for lunch take-out on coworker's recommendation. Reasonably priced food with good portions. I got the small jerk chicken with red beans and rice, cabbage, and two fried plantains. The food tasted great. Would've given five stars, but customer service is non-existent (no hello, smile, thank you, have a nice day) however, I was in and out fairly quickly.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W1CZ9u_xdba6JHTUGOXm5A"
  },
  "IeOTPg9s703eUT7LSlnVPw": {
    "date": "3/19/2016",
    "text": "Delicious Caribbean food to go or tables to eat there. Highly recommend the jerk or curry chicken. My partner loved the curry goat and oxtail. Combo plates give you 2 meats, rice, beans, and plantains. The large is a decent amount of food might go with the small next time. Staff was extremely friendly too! Great food in a nice casual atmosphere.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ED9Op6pAMaAZV0eUoAf-Fg"
  },
  "ew_h0Dt3TLZRFz90JbdO3w": {
    "date": "5/30/2017",
    "text": "I ordered delivery from them using post mates. They tried to add jerk chicken to the order of just a large fish soup and a patty. Luckily Postmates took care of it. But the patty taste sweet and the soup was far too salty. Too many fish packets added to the soup. There's a better place in Harrisburg.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "T76mITujBJNdO4Hzw0jBTg"
  },
  "XxabK39KVBWAZTdEUvt67A": {
    "date": "6/21/2015",
    "text": "There is just too much to say!! I am new in the area and wanted something different for lunch today. I \"accidentally\" turned into the wrong shopping center; so thankful I did!  I ordered the large curry chicken meal and a bottled lemonade. I paired the curry with yellow rice. It came with plantains and some cabbage salad mixture--to die for.  I also ordered a beef pattie. For starters, the curry meat LITERALLY fell OFF the bone. It was SUCCULENTTTTT. The rice was delicious alone or with the sauce mixed in it. Mmmmmmm mmmmm good. And the pattie was FRESH and HOTTTT.  If I had to write one thing negative it would be that the bottled lemonade was WAYYY too sweet (and I like sweet)...but the food was ON POINT.  This will be my favorite joint when I want some Caribbean spice!!! Hallelujah!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WHiuXG5ORGxZCIEVqrKxJQ"
  },
  "GMaGuwl7YHNnDgrp_t4IWA": {
    "date": "4/26/2017",
    "text": "I love the butter shrimp and the plantains. The restaurant as a whole seems very authentic, but I wouldn't really know... very tasty though, and the service is great.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AzKu6BwdmIao4Y26HSCczg"
  },
  "1xzkKAKNrqsPI2ndKHtDog": {
    "date": "1/3/2012",
    "text": "Great Caribbean food done right!  The hut is always, always, always consistent with their food, quick in and out service with a smile.  I've never had a bad meal here and the curry chicken is some of the best around.  Most meals come with rice and peas, plantains and mixed veggies or greens.  They're in a strip mall off of North Tryon before the Mallard Creek intersection.......give them a try.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fIw7lH-_ca1A3IZnSddjGA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Curry chicken, rice n peas, mixed veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/fIw7lH-_ca1A3IZnSddjGA/o.jpg"
      }
    ],
    "user_id": "9IRuYmy5YmhtNQ6ei1p-uQ"
  },
  "H91L3fVo7VrqO2c35YmSHQ": {
    "date": "12/6/2013",
    "text": "Just yum. Need more chicken and less bone!!!! Bought 2 chicken roti and was floored by flavor in Charlotte! To think I was ready to hop a plane to head to Brooklyn NY's Nio on Church/Rogers for a roti but can find a comparable roti in Charlotte, NC? Very appreciated. The skins were tasty although I like a lot more Dahl in my roti skin. The chicken was tender and juicy enough for me to overeat and be mad at myself later on. The potatoes were also nicely curried. Love that carrots weren't substituted for potatoes. Staff was cool. Loved the young teen behind the counter who is clearly learning working ethics. She was cute enough to listen to how roti skins were made with yellow split peas not chick/garbanzo. If you are from Trinidad or used to eating in Trinidadian restaurants, you know chana. You know chana is given as an option to be put over your curry filling. Chana is actually garbanzo/chick peas. Here it is Jamaican cooking and no chana option. I don't like chana anyway so that was lovely. My only issues with this place so far? There isn't a venue south of Charlotte airport and too much bone-more chicken needed. Also got my order at 1:25pm on a Thursday and received my 2 chicken rotis in 15min or less. All Caribbean restaurants will take time so this was quick. I took 3 pictures of my chicken roti including inside the skin...so please view. But next time I visit, I will scrutinize that ladle to make sure no bones added!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "QslWuAIToYPS_YgiFC4g7g",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Dhal : inside your roti (skin). Grounded up Yellow split peas with seasoning. This roti mixture also known as dahlpuri skins.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QslWuAIToYPS_YgiFC4g7g/o.jpg"
      },
      {
        "img_id": "mYm-9JJaouTrmxOovrIMiQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Inside a delicious chicken roti (no chana).",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/mYm-9JJaouTrmxOovrIMiQ/o.jpg"
      },
      {
        "img_id": "eOk8MQ5xQIsDkv1jDEz5_g",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Chicken Roti",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/eOk8MQ5xQIsDkv1jDEz5_g/o.jpg"
      }
    ],
    "user_id": "hMRG63Jhpue23U62ihcVjA"
  },
  "KWhHAgTMDbqXGpAsvisvSg": {
    "date": "4/10/2016",
    "text": "Based on the other reviews I have read, I must have come on a bad day. This was was the worst Caribbean food we have ever had.  I had the curry chicken and my sister had the ox tails.  The curry chicken didn't taste like curry. It appeared to have been cooked in some kind of yellowish sauce. Again, it had no flavor.  The ox tails as well had no flavor.  Sorry to leave such a poor review, but this was not good food.  The service, however, was wonderful.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZrdNLaF3Wmpfy71Upwuwcw"
  },
  "TWCD2pO-NCSzMe_9XEetyw": {
    "date": "3/3/2016",
    "text": "Oxtail dinner, rice, & plantains were really good. My husband ordered the jerk chicken dinner and it was just OKAY. We 're use to authentic freshly grilled jerk chicken with tons of spice and flavor that is not covered in sauce like it is at this restaurant (instead the chicken is marinated with jerk seasoning then grill to perfection with a nice crispy coat). We also ordered a chicken patty (which looks dry), but have yet to try it. The service was decent. Decent for a chain restaurant. I would return again solely for the oxtail dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "5otpA8xOSUNR6Uuw8L8XlQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Oxtail dinner",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5otpA8xOSUNR6Uuw8L8XlQ/o.jpg"
      },
      {
        "img_id": "BZdxy-m1lzMGQaLPvjL8Lw",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Jerk chicken dinner",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/BZdxy-m1lzMGQaLPvjL8Lw/o.jpg"
      }
    ],
    "user_id": "Zk4l0en7h8ChooGnQFZhXg"
  },
  "ubQ0Litw8nSNGJD7kCbkcw": {
    "date": "6/5/2013",
    "text": "I've only been here once. But as far as I can see, their only disadvantage is that they're right next door to the fantastic Casablanca Cafe. It's just so hard to turn down Moroccan lamb couscous just feet away. Hence why I've only been here once. But enough about Casablanca. This is about cheap and cheerful Caribbean food, a cuisine that's sadly underrepresented in Charlotte. And why is that? We seem to love soul food. And Caribbean is like soul food, only with more fish, less of a dependence on deep-frying and a more diverse palette of fruits, herbs and spices, owing to its tropical origin and influences from China and India. There's nothing wrong with pork fat and hot sauce. But is there anything that's not improved with scotch bonnet peppers, mango or ginger? I humbly submit to you, dear reader, that there is not.   As I've only been once, I can't make too many recommendations. I had the jerk chicken with yellow rice, plantains and cabbage. It was cheap, delicious and the portions were very generous. I did however get a sly peek at some of the foods other diners had ordered and it all looked fantastic, almost to the point of making me regret what I'd ordered. I suspect you couldn't go wrong by throwing caution to the wind, closing your eyes and pointing to a random spot on the menu. Unless, of course you're freaked out by the idea of eating goat or oxtail.  One thing you should not leave to fate is your choice of drink. They sell Ting, the impossibly refreshing D&G produced Jamaican soda made with real Jamaican grapefruit, real cane sugar and tears of sheer rapturous joy. If you come here and don't order a Ting, so help me, I will find you, corner you and mercilessly mock your lack of taste and good judgement. You have been warned.",
    "rating": 4,
    "rated": {
      "funny": 12,
      "useful": 4,
      "cool": 4
    },
    "photos": [],
    "user_id": "clXKco_bCYG3ajR6R-L1KQ"
  },
  "OxQWaYpo6PhRbsAgsqvOpw": {
    "date": "5/22/2017",
    "text": "Great hot food, didn't have any more beef patties but that was ok, the goat, cabbage, stew chicken and everything was great and so was the service",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LsRtQWX9pzzLn_BbYdI0Ww"
  },
  "LZ0HlDiy_leDrugQuJi3vQ": {
    "date": "2/21/2016",
    "text": "Excellent food! Stopped here on the way through town. Beef Paddy and Fried Plantains FTW.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "09AaSoc9uUncWg9porVrjg"
  },
  "vssSjikGA29Ce2wNtqwt1g": {
    "date": "6/28/2013",
    "text": "Wow! This place in Fantastic! This was a pleasant surprise since I had never heard of the place and was just passing by. We were given a friendly welcome from the time we walked in. The service and food brought back fond memories of a recent trip to Jamaica. The server suggested that I sample the Jerk Chicken and the Curry Goat before ordering because I said I didn't want anything crazy hot. Both were delicious but I had the Jerk Chicken and my guest had the Butter Shrimp. I can honestly say that the Collards were some of the best I have ever had.   Friendly service, great food, large portions and reasonably priced!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 0
    },
    "photos": [],
    "user_id": "g1aU50WH_hy1UUEDNQHf7g"
  },
  "HL5HjNav51TCiSAVKD8buA": {
    "date": "8/21/2015",
    "text": "was excited to try this place out but unfortunetly we didn't even get to try it.   we walked in on a friday around 1:15pm the place was pretty crowded and it was a long line for to go orders too. we were standing around for awhile because we werent sure if we were supposed to seat ourselves. we found a waitress so we asked her if we should sit and she just said yes sit. so..we found us a seat and sat down. 5 min later no menu, no drinks, no greeting..10min later my husband went to grab us some menu. the waitress said she will be right with us when he saw him grab the menu. 20 minutes later still no waitress to be seen. We were sitting there for 20min with out anyone even greeting us or taking our drink order. we left. very disapointing. If you know you get busy on certain days or time, you need to hire staffs accordingly.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "N-Fk2xynnzYxOK1EhJ4-Sg"
  },
  "WbzCjlFvSKCuekM8xL4OOQ": {
    "date": "4/21/2017",
    "text": "Good food, we really enjoyed this place with no complaints other then the plantains being cooked to hard.  Oxtails were good, curry chicken, goat and jerk chicken as well.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yJV2NaEUNPMffsQFNFAi3A"
  },
  "6kh3gCbF5sVZk1z82lWy3Q": {
    "date": "9/20/2017",
    "text": "Although the food is great the customer service is disappointing. I come here often to get a plate Togo,  I love their jerk it's nice and spicy  and I'm a huge fan of their cabbage, YUM! I work at a restaurant myself so I know how annoying it could be for guest to walk in so close to closing time which is why I make an effort NOT to go into a restaurant no less than a hour til close, tonight was no different. They close at 10:30 and I arrived at 9:30, which I thought was more than reasonable especially for a take out order, and if you've been here before you know they just scoop the food out of their hot pans into the take out boxes, easy peasy right? Before I could even grab the handle of the door to walk in  I noticed a gentleman inside, he notices me too, he gets to rolling his eyes and shaking his head and as I walk in I hear him mumbling under his breath. I walk out immediately before the door even closes behind me. As a customer that's something that I shouldn't see no matter how frustrated or annoyed you are. I'm there to enjoy your food and give you my money. A customer shouldn't ever feel like they are unwanted in an establishment. After reading the other reviews I see customer service needs some work. Customers keep a business up and running, no the customer isn't always right but you should do everything in your power to make them feel welcomed and happy, I felt neither of those during my experience. DO BETTER CARIBBEAN HUT! Your food is way too good to have such poor customer service!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YHviiIdnBfGw9bFqIP6zog"
  },
  "sA1XaT0WW9DZ8986hQlmmg": {
    "date": "3/18/2013",
    "text": "This review is dedicated to the Roasted Whole Red Snapper. I just want to say...I LOVE YOU! The 45 minutes it took for you to roast was wellllllll worth the wait. I'll never want to eat any other fish again in my life. You were perfect mon! I don't think I will ever be able to understand how they get so much flavor into the fish, and I don't want to. Just keep serving it the way you do. I would have eaten the foil that the fish was wrapped in if I could. Whole roasted Snapper for $17, can't beat that with a stick! Also, you all should hire another waitress. Love the one you have but she needs some help!!!",
    "rating": 5,
    "rated": {
      "funny": 6,
      "useful": 5,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "_YwSBxLCxOWZb96KDfrbnA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Mon the BEST Roast Snapper mon!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_YwSBxLCxOWZb96KDfrbnA/o.jpg"
      }
    ],
    "user_id": "onsvManL82rHzpcCB3Uyfg"
  },
  "UTqHyp1rC1mWB35ISBAzQg": {
    "date": "5/20/2017",
    "text": "I eat here once a month or so. The jerk chicken and brown stew chicken are reasonably good, but not as good as at Reggae Shack in Gainesville, FL, which is my reference point for Caribbean food. However, I really like the roti, which is not only tasty but also fun to eat -- I prefer the method of using pieces of roti skin to scoop up the filling.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o6M6hdzHKfeCv1-rTqgzfQ"
  },
  "T_CQ_y2v7754KYBhmM4HJw": {
    "date": "10/2/2015",
    "text": "Great local spot, kinda tucked away in plaza but worth finding. Tried the oxtail and goat combo with rice and peas. Both the goat and oxtail were tender and well seasoned, the rice and peas was cooked perfectly.  Awesome finding a taste of home in N.C.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "tLdHPW7RUotkhmktipC9mg"
  },
  "5HwFw4y12xTr_FGr_VVmhw": {
    "date": "2/6/2016",
    "text": "Whoa, this place is amazing!!!!! Fast, perfectly seasoned, delicious food, omg I've finally found a Jamaican spot in Charlotte!!!!!! Fucking thrilled!!!!! So good, had the curry chicken, small, with a to go plate!!!! Yes!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xpUFCDrf1J2vZ2jgsljHSA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. They did this!!!!!! Y&amp;#39;all are not ready mon!!!!!!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xpUFCDrf1J2vZ2jgsljHSA/o.jpg"
      }
    ],
    "user_id": "bxD_vVi54rxevHtmJ_CedQ"
  },
  "FSixUfdSe3qUaRXPzfYUpA": {
    "date": "6/4/2017",
    "text": "Very clean place and the ppl are very nice. The food was on point and would recommend",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vtRtU6R-9flWTIRd4hYrZg"
  },
  "oeFwIHOWKYZXwK-qXxM0mg": {
    "date": "2/19/2016",
    "text": "I have a great experience everytime I come here. This was my the first time coming on a Friday evening and I enjoyed the love music.  The servers are always pleasant and helpful. I can't forget the food is always great I am never disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Jd9k43jpbMOVbFoIKjb8og",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/Jd9k43jpbMOVbFoIKjb8og/o.jpg"
      },
      {
        "img_id": "_4aAfANVco8nLzeqdgwmqQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. She approves",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_4aAfANVco8nLzeqdgwmqQ/o.jpg"
      },
      {
        "img_id": "pRzDle_xhwQbHGFd71DAsw",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Beverages of choice",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/pRzDle_xhwQbHGFd71DAsw/o.jpg"
      }
    ],
    "user_id": "9EuCgY09kt_y1lqjscQzrw"
  },
  "9rQzoqXL2g9UdiabSjAn0w": {
    "date": "9/5/2013",
    "text": "The food is very good, especially the jerk chicken. It's very authentic food. Also $5.95 lunch chicken special, can't beat that!!!   However, the serve sucks!!!!!! No smile at all, water left empty til I asked for more. I asked for more rice, but takes him forever to get it. So I cancelled it because there's no point for the rice when my meat is all gone. But the server make this stupid face and shook his head.   I will go back for take out, but not dine in.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "yYX--hmEmuB9G92DBrMvLw",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Curry chicken",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/yYX--hmEmuB9G92DBrMvLw/o.jpg"
      },
      {
        "img_id": "g4my3f3KnmgXuBlQPzuY-Q",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Jerk chicken",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g4my3f3KnmgXuBlQPzuY-Q/o.jpg"
      }
    ],
    "user_id": "sUh8f9Ez1h6tSINztKG0lA"
  },
  "5PfomtpC6BbFHLRb1yNhfw": {
    "date": "7/22/2013",
    "text": "I happened to be in the University area recently around lunch time, so I quickly checked my Yelp App to see what dining options were nearby.  I found this place and decided to check it out.  When I pulled up in the parking lot, I had a bit of a dilemma as there was a Middle Eastern place right next door... but I decided to check out the Caribbean Hut since I have great Middle Eastern food in my neighborhood but no Caribbean/Jamaican places.    So, I walked in and found that this place is one of those spots where you go up and place your order at the counter.  I quickly scanned the menu board and decided to go with jerk chicken. I asked and the girl behind the counter & she said it was served with beans & rice.  Ok - sounds good so far.  I wasn't sure about portion sizes, but I decided to go with the smaller portion size.    When my food came out, I was disappointed to see three little tiny pieces of chicken (which were mostly bone), rice  with only a couple of sparse beans mixed into the rice, and about half the plate was made up of some sort of slaw (WTH- she didn't tell me slaw came on the plate! I hate slaw, yuck!)  It did have 2 slices of plantains, which were tasty.   When I dug into it, things didn't really get any better.  The jerk chicken was not very delicious - I was quite disappointed in both the subdued flavor and the terrible cut of \"meat\"...it was like 3 little chicken wings that hardly had any meat whatsoever on it.  Definitely not what I was expecting.    I was expecting to dig  into a plate of wonderful calypso rice with  beans & a flavorful jerk chicken with plenty of spicy flavor. But this was just sad.  Based on the other reviews, maybe I just caught them on a bad day, but the experience was so disappointing that I probably won't be back.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "aDYNz8cujkDdmbiOh95ANA"
  },
  "dnaXDsvhwnWEhdHUuHKRZg": {
    "date": "11/17/2017",
    "text": "We ordered LARGE Oxtail, peas & rice, beef patty Irish moss.  This is the 2nd time our order is NOT what we requested when we arrived home. We opened our foam white container to find a small, small portion of oxtails with macaroni & cheese. I AM ALLERGIC to dairy so we would not have ordered macaroni and cheese. Smh  Again we ordered LARGE oxtail, peas & rice WITH cabbage, plantains. INSTEAD we received a small portion of oxtail with peas and rice with macaroni & cheese. We drive about 35/40 minutes to come to this place but never again!! We even asked the lady, was the order correct? She said yes.  I guess it's our fault we should have reopened the bag they tie & checked before leaving the restaurant!!  Also; two other customers wanted extra oxtails and they said they don't offer sides for that. Suggestion: if customers are willing to pay the price for an extra side of oxtail, then offer it!! Supply and demand will keep your customers coming back for more!!!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KHRB4TxXvahnjycP3_J4gg"
  },
  "UShvRetY0ZNWrCxSnIB7sg": {
    "date": "8/7/2016",
    "text": "I used to go to this place earlier it used to be good and I used to like this place but last couple of times I had a Bad experience. 1. The person who was serving is not at all good with customers. He is lazy and has really bad attitude. don't know how to talk to customers. 2. It took 40 Minutes for our order and it was cold (Who wants to eat cold food In Caribbean Hut) he didn't even care when I told it was cold. 3. We ordered Chicken Patty and Beef Patty was served instead. When we asked them they are like OK alright and changed it not even sorry about it. 4. I wanted to talk to store Manager but looks like he is not in today and I was given a rude answer that HE IS NOT IN... Over all Bad Customer service, Food is not good . Its kinda spoiled my Sunday Lunch hour. I think I will never go to this place again...",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7VAYpGXYNb8dJEQ4vmSg-w"
  },
  "21bD_PXrnjyMerPxL1eJpQ": {
    "date": "7/24/2015",
    "text": "Stopped in today for lunch to go. $15 for a large oxtail lunch, but well worth it. The sauce is always so fresh and full of flavor. Service was fast. Next time I will try the beef or chicken patties.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TYc9OaR_tjtUPW5PSXBQuQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Oxtail with plaintains",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TYc9OaR_tjtUPW5PSXBQuQ/o.jpg"
      }
    ],
    "user_id": "2ne7r8bYdmMfzEop04tuEw"
  },
  "U6wvibotNUhw3DHeGf_eUQ": {
    "date": "2/18/2017",
    "text": "I was unhappy with my oxtails and was given a hard time about switching it out for something else. The oxtails were full of fat and meatless, all I wanted was to switch my meat out not the whole meal. They should work on treating their customers better and have better customer service.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S3iYgvPJ3DmTjSqMcBi4iw"
  },
  "t7S2qUm9eNErdfSfqpgR0A": {
    "date": "6/28/2015",
    "text": "The wait for the steamed Snapper was well worth it.   Everything was fresh and cooked to order.  Fantastic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "Tcr75tGMdGObtZ7-IMeKoA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Snapper (steamed) with greens",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Tcr75tGMdGObtZ7-IMeKoA/o.jpg"
      }
    ],
    "user_id": "_QoCDsbCqTPtLkt4xRUt7w"
  },
  "ElYDUiZJW_NEshiEjg4XGA": {
    "date": "7/8/2015",
    "text": "Food was delicious and served surprisingly quickly. Service was fine, never had to ask for anything. Some of the bones in the curry goat were chopped a little smaller than I like; had a few close calls with some small, sharp pieces. Meat was super tender and tasty, though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "zZudYk5LyieB6yUKXjLDNQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Small curry goat.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/zZudYk5LyieB6yUKXjLDNQ/o.jpg"
      }
    ],
    "user_id": "SPImKKfTYykgqoWyUz8PxQ"
  },
  "K9q7TkbRedevCJ9BdpUSOw": {
    "date": "12/7/2016",
    "text": "I visited this restaurant today at 5 pm, and was told that they ran out of mac n cheese and plantains. Mind you, they close at 10 pm. I was very disappointed. What made things worse is this a recurring issue, and they're very unapologetic about it. I ended up walking out and taking my business elsewhere. It may be best to call and confirm if they have the food you want before making a trip up there.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uLUksjnqlvARpb5MWV9zUw"
  },
  "0si9-a4DsmKwKoGsJYjSUg": {
    "date": "7/3/2016",
    "text": "All the meats are slow cooked and fall off the bone delicious.  Several rice choices and plenty of collards complete the meal. Staff is friendly and laid back.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UpykUjDLrqksVHc9PDICDw"
  },
  "UGtgi8lPBZXelEGUQ9-l5A": {
    "date": "4/25/2016",
    "text": "Never been disappointed, as many times as I have gone. Always a fun atmosphere and good food. THEM OX TAILS THOUGH!!! So tender. They also have a great lunch special for only $6.25 and the portions are big. Definitely recommend. Only issue is they are rude AF. Particularly the women. The women never speak or smile just ask what you want and move like molasses but the food makes up for the women staff's lack of customer service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "IqX2gf3opcwAzlqq1cV--A"
  },
  "dpk7lItS-PuxMIHDgHbBlg": {
    "date": "4/26/2017",
    "text": "If you have valuable time to waste, come here. If you want to be kept WAITING WHILE being overlooked and ignored by staff, come here. My daughter and I stopped in for lunch, we stood near the entrance WAITING to be greeted and seated...a waitress literally walked past us 3 times and never said a word nor offered seating. The woman behind the counter making food never acknowledged us. One of the owners or managers I assume was standing outside as we entered and he finally, after we'd been waiting 6 mins, walked in pass us and went to the back. My frustration starting to show...the woman behind the counter then says hello how are you and proceeds to take call in orders from telephone calls. Finally, unable to tolerate the LACK OF CUSTOMER SERVICE , we walked out...STILL, no one said anything. I've been to this location before, but this is my first review as I just can't take it anymore. These people are RUDE, they LACK respect for customers and if you are not of West Indian/Caribbean decent there is a total, blatant disregard for your business or your dining satisfaction. The waitstaff is Slow and lacks enthusiasm, management does anything But actually manage the establishment. They've INCREASED their prices but digress in quality service. The food is Decent on a good day but better than it's competitor; however, I'd rather not get my fix of Oxtails than to suffer thru the nasty attitudes and terrible service while spending my hard earned money where it's not appreciated! DINE AT YOUR OWN RISK",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "icdtjJjMiYRwrhiGvXyEnA"
  },
  "W-FPMgu6SYUznzjW1x0y7A": {
    "date": "9/12/2014",
    "text": "Found this small restaurant (as well as their Morrocan neighbor) on Yelp*.  Wonderful Jamaican food with much of what you'd expect from that region.  Ordered both the Curry Goat and Curry Chicken Roti.  Portion sizes were spot on, and the flavors were deep without too much heat--both delicious!.  I will return and sit at the counter, order some different food and observe the day-to-day confluence of patrons.  I like this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "_0gbUcg2vqN1Hh7bhhNEVg": {
    "date": "12/27/2014",
    "text": "Really, the only reason why this place isn't getting 5 stars is because I've never really had Caribbean food before (save a Caribbean vegan joint, but it was vegan, so not so comparable). So just based on first impressions, lovelovelove this place!  + Friendly, attentive, and accommodating service that doesn't overdo it. + HUGE portions. + Lunch specials are always a plus! + Just the right amount of spice! Not crazy hot. + A jerk chicken with a nicely soupy sauce with deep flavors. + Goat soup that is simple, but so flavorful and really hits the spot if you're craving goat. + Flavorful tofu/vegetarian dishes. + Discovered SORREL. OMG. Love this red gingery drink. ~ My mom was disappointed by the callaloo but I thought it was tasty! The roti was large but we could have used another in proportion to the amount of callaloo we got. (Again--large portions!) - Some of the dishes were a tad on the salty side--in a way that was delicious (because I like salt) but could limit other peoples' appetites  Atmosphere is cozy and unassuming, kind of hole in the wall-y feel--lots of reggae and large posters of Caribbean greats. Because of this it seemed like it was more of a fast-food kind of place, but it's actually sit-down (or take-out)! It's the kind of place that you'd stop by with friends to catch up and have a comforting meal in good company.  Would definitely come back to this place. Caribbean cuisine, you've gained a fan in me!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R_ziWBRNb7SjuMBzZIcIsw"
  },
  "kH2mX7lJVafRMrHRbJWSlQ": {
    "date": "3/10/2016",
    "text": "Terrible customer service. I've never written a review but the guy spoke to me so badly on the phone I just thought I'd let it be know. They'd never get my business. The phone isn't even authentic Caribbean and its prepared poorly",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "DeFFlwsD9xA3LsG2p2Sf_g"
  },
  "R3othd3kB-Z2K7OKcQpFyQ": {
    "date": "4/19/2014",
    "text": "We were passing through and decided to try this joint based on the reviews here. Not impressed! We decided to dine in but quickly changed our minds because of the attitude of our server.  Very unpleasant disposition! I don't know about anyone else but if I'm going to patronize an establishment, regardless of the hour I expect to be welcomed and treated well.  Ordered to go instead. .. Had the curried goat and Jerk Chicken. ... Not impressed! The curried goat was fiery! Okay,,don't even start with the \"what else did you expect\" argument because pepper can be used to just add flavour not to make one cry!  You don't have to use so much pepper when cooking.  It had no other flavor. The Jerk Chicken was more like a tasty Brown stewed chicken.  It helped stop our hunger somewhat but don't think we'll return. ..  and btw, I'm yardie!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "MPnoJ7ljErIrmT1zF9In3A"
  },
  "vh3iNRLwtOzmXCzJMG18Ew": {
    "date": "10/22/2014",
    "text": "Love the jerk chicken. Reasonable price. Always satisfies. I've come here for lunch and dinner. People are always friendly and the environment is relaxed. Highly recommended.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "1c1wtAXqKAXb5Xwe26Jojg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/1c1wtAXqKAXb5Xwe26Jojg/o.jpg"
      }
    ],
    "user_id": "Vs8TOV7Vsoo3k5S5pNqleQ"
  },
  "qKT7gSu-IEUz-DKNben5OQ": {
    "date": "3/3/2015",
    "text": "Food is nice! I do think that it can have a little more Seasoning. Customer service was OK. I had oxtail, rice and peas, and steam cabbage. I paid $16.00 for the large plate even though there were only about 5 small pieces of oxtail. I'll try the curry chicken next time.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4HRF92Bx7j292r2uokXO3g",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Oxtail, rice and peas, and steamed cabbage.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4HRF92Bx7j292r2uokXO3g/o.jpg"
      }
    ],
    "user_id": "yztzd0dUc5OKZTrzlrmLvQ"
  },
  "iEzQx9Q7_hwIDlT5fsO3_A": {
    "date": "8/3/2018",
    "text": "Pro: affordable lunch plates. Con: Every thing else.   Maybe I had a bad experience but this place was downright disgusting. I was looking for an Authentic Caribbean restaurant and I thought I found one. I guess Not.  I order  the Jerk Chicken with a side order of Cabbage, rice and beans. The lunch plate was lacking the meat portion in the plate. The Jerk sauce smothered everything in the box which eventually spilled into the bag I had the Togo plate in.   Food was not tasty. I've had better authentic Caribbean food and this place is not it. I would not recommend this place. GO SOME WHERE ELSE IF YOU WANT TO EAT authentic Caribbean food.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "S_8i_oZTXDyaQgwZ8gCdaQ"
  },
  "YMjuRgWeqYti6Ofprm-zfg": {
    "date": "6/27/2018",
    "text": "I wanted to love it but I just didn't. The team members were relatively nice on the phone when I called in my order. Food was ready quickly and they bagged me up. The jerk sauce smothered everything in the box, rice and cabbage included. It was just way too much sauce. Meat seemed cheap but the flavor was good. I'll give them another try at a later date.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oidxkygM87Wg7STVTb6faw"
  },
  "YIef5nKnstGVBWniWcfZCw": {
    "date": "8/7/2018",
    "text": "So far the best West Indian restaurant I found in Charlotte and I think the curry goat is excellent.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfOWt_Oqj1NCC_aWUM4rPw"
  },
  "hMUoWBNTfGoHKyuOIHhgow": {
    "date": "7/22/2015",
    "text": "I went to Yelp one day for lunch ideas, typed in Thai and up popped Caribbean Hut, so I thought it must be a sign telling me this is where I needed to go. So go I went.   I walked in and the service was fair. Nothing great but they serviced me, gave me my food and took my money with nothing to complain about.  The food itself was decent. My goat curry was on the gamey side and while flavorful it was overpowered with the taste of curry. I believe there should be a balance of flavors and I just didn't get that here. The meat itself was very tender and cooked perfectly.The goat curry has lots of bones - but anyone who eats goat should know this.   My beef patty was decent as well, just a bit cold in the middle. And to be honest, they tasted like something I could buy from the freezer section in a grocery store.  The jerk chicken was decent eats. It was very flavorful, a bit sweet but juicy and good.   The sides that come with the plates were good as well, I really enjoyed the greens and the rice and peas.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "BP93LVv6cFu4oF9cdkxUlQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Closeup of oxtail plate",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/BP93LVv6cFu4oF9cdkxUlQ/o.jpg"
      },
      {
        "img_id": "VrNXZTGhukuO1b5p1FlWLg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Oxtail and beef patty",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VrNXZTGhukuO1b5p1FlWLg/o.jpg"
      }
    ],
    "user_id": "U0WU9d6gpMNkO_tPXK58Sg"
  },
  "ZnmWifT5PCPv3SMu5Zk5dw": {
    "date": "6/18/2015",
    "text": "When I came here on November 2014, the curried goat was $8.00, and it was delicious! When I came here on June 17, 2015, a small order or curried goat was $13.00, and a large order was $15.00. That is a HUGE jump in pricing in a space of only a few months. It almost makes the item price prohibitive, or maybe it HAS because......  I was informed by the waiter, who finally came by my table after I had waited for fifteen minutes, that there was no curried goat available. He offered curried chicken instead, but since I am allergic to poultry that wasn't an option for me.   I hurriedly looked over the menu board for another choice, but seeing nothing that interested me, and being slightly irked for having already waited fifteen minutes for service, I thanked the waiter and left.   The restaurant was very busy at 12:30 p.m. for lunch. Previously I had received good, prompt service, but on this visit I was unsure that I would even be waited on since I was the only Caucasian in the restaurant. I don't know if I will come back here due to the slow service and the steep prices. That's a shame because the food is really good.",
    "rating": 3,
    "rated": {
      "funny": 4,
      "useful": 9,
      "cool": 5
    },
    "photos": [],
    "user_id": "4FE8md9fMr_jZFNbcOmHsQ"
  },
  "M8wKRUrFGXuACM5x2TuMmw": {
    "date": "1/15/2019",
    "text": "I usually order the jerk chicken or oxtails. The food is always good and with the jerk chicken I usually have enough for three meals. I have yet to find another Caribbean restaurant in Charlotte that I like better.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "eG6L0pBccs4LTvFrNRrENg"
  },
  "-GnlkjO9aWNGL1JAOx_2qA": {
    "date": "3/22/2017",
    "text": "I ordered the oxtail with rice and cabbage.  I think for the price I got a lot of food and it was good . In addition the service was good my only issue I had was not being able to order the sides I wanted with my meal . The menu showed macaroni and cheese but I was not allowed to get that my waiter said I can only have rice and cabbage. Which I could be confused by the rules of the entrees.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "VoNcoZ0pXvTiNkhBeiuxqw",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Oxtail anyone",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/VoNcoZ0pXvTiNkhBeiuxqw/o.jpg"
      }
    ],
    "user_id": "ltIBBgaW_cUC03T8YexWPg"
  },
  "MraEt8ES__kiI-gmBL_X1A": {
    "date": "1/30/2017",
    "text": "This was my first time at this restaurant and it will probably be my last. The restaurant was clean and everyone was nice and personable. We ordered over $40 worth of food to go. I get home and my order is wrong. So I had to get back in my car to return the wrong item.   I love Jamaican food and this food was just ok. We ordered curry chicken, curry goat, oxtails and a shrimp stir fry that is made to order. The curry goat and the oxtails were tough. They need to let them simmer longer to not only add flavor but also to make the meat tender. The shrimp stir fry was 75% cooked onions and the shrimp was over cooked. The only thing that we did enjoy about the meal were the rice and peas and the cabbage. I am disappointed because this place is close to my house. I will not be going back.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "7B-XWI5yvU_-r9T26wk4wA"
  },
  "1zRgdSa8EdrHro0EO3tKPA": {
    "date": "3/21/2018",
    "text": "I went to 3 different jamaican places and they were all closed but I was determined to get some ox tails.  Then when I sat down here to order they were out, the worker saw how sad I was and found some scraps for me.  Lol! yum! It was bangin!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UrQGQX_UIG8YaWm3yemj_g"
  },
  "D-OMP0O9KV5AUbaovCz_EQ": {
    "date": "1/7/2018",
    "text": "Always good, hot and fresh not to mention authentic Jamaican food. Staff polite and always glad to see you. I got the brown stew snapper and it's cooked to order but well worth the wait. They have 2 locations and I frequent both and have never been",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ccHbAI5LKJt4rVQURzRycA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ccHbAI5LKJt4rVQURzRycA/o.jpg"
      }
    ],
    "user_id": "KvDAhB0NHbw6iRxVPu2oOw"
  },
  "IN--8EI9tj8iCCl_svdROg": {
    "date": "12/30/2016",
    "text": "As I review this. The jerk chicken was probably three stars. The pricing to stars. Atmosphere was two or three stars any fun if you like it or not... The jerk chicken I got was average. And the plantings were like wax paper. When I answer manager at the front door with it. The service is probably substandard. They come back again. Only if I desperately wanted to give him another chance, and to try a different menu item.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ftwOqBJCfIyqbHXK4fx8Ag"
  },
  "LbmlVvjXemHiwll5FeMcbQ": {
    "date": "7/11/2017",
    "text": "Had the jerk chicken with plantains yellow rice and cabbage. The absolute worst customer service experience, the Jamaican guy didn't pay attention to who was next to order, nothing seemed cooked to order but was more buffet style. The decor was unpleasant. The Jamaican guy seemed outta place inattentive and all around made you feel like you were an inconvenience to come into their establishment. The food was good, but could've been better. I probably would never go back here or recommend this place to anyone.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lmylxw7huyiVU4gNHR8cIQ"
  },
  "motqst5D562h2f2RQIQ-BA": {
    "date": "5/28/2017",
    "text": "Combo plate, oxtails & curry chicken with rice & peas and cabbage. While the food was delicious....2 pieces of chicken and 4 small pieces of oxtail for almost $20 is unacceptable. I really want to love this place (both locations) but I've had several bad experiences . 2 stars is for the taste of the food. It's been a struggle trying to find a legit Caribbean spot that gets it. We ordered 4 plates via phone to go, 3 oxtail plates and my combo plate...literally lacking the meat portion for all four plates and well over a $60 check.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6PMimM_kSQhPe-8EGARz3w"
  },
  "G2A0UZliYiooT8aWyLY9QA": {
    "date": "6/13/2016",
    "text": "I go here all the time. Aside from them always being out of Mac n cheese, I have no complaints. Foods really good and they give you more than enough",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "mZEUjesoasgD5bE7pp-2HA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Small jerk chicken lunch special $6.25, 11a-2p.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/mZEUjesoasgD5bE7pp-2HA/o.jpg"
      },
      {
        "img_id": "xrQq58A8QcVnZTJytgtgdg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Curry and jerk chicken combo",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/xrQq58A8QcVnZTJytgtgdg/o.jpg"
      }
    ],
    "user_id": "ic9zIsm7zoxUm3Axyegx8g"
  },
  "1NAw62mS_SylcoMvlBbkSA": {
    "date": "4/13/2016",
    "text": "There food quality is always consistently good. I eat here at least 4xs a week. I pass by all the fast food joints out there and make the final stop here, a better alternative for eating when I'm alway from home. I support these guys. I'm actually outside of there place now waiting on them to open at 11am. #respect(jam. accent)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "M_sCb5GAwrDMi1TEkCXl_g"
  },
  "q6o0pMzaMUIb_pGcUku6Hw": {
    "date": "1/16/2015",
    "text": "Twas delicious. If you are not in a hurry and dining in, go ahead and take a seat. The \"place order here\" on the right is for takeout. Got the small curry goat ($11). It came with rice (choice of yellow rice or the rice with beans, red kidney) two pieces of yummy firm plantains, and veg of the day. Today was collards that was delish. Friends got the weekday lunch special, any of the small chicken dishes for $6 and change, they got the jerk chicken and everyone cleared their plates and all that was left was the chicken bones.  They only have one server servicing about eight tables, it took us a while to place the order, food came out in about five minutes (awesome), and then it took us a while again to get our checks after we had finished. Knocked off a star because it made our visit way longer than it needed to be and we were itching to get back to work.  Definitely will be back, might opt for take out next time tho.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "grfBlj8gAdxEMVMv9ZP8ZA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Small curry goat, collards, rice and beans, plantains. No substitute. $11. Spicy and delish",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/grfBlj8gAdxEMVMv9ZP8ZA/o.jpg"
      }
    ],
    "user_id": "CQk5IbmV2TOtbUvtvWeuEA"
  },
  "NkH9OABpPXBGm9XlBuWoIA": {
    "date": "2/26/2017",
    "text": "The staff was not very friendly,  we were not greeted by anyone and we were expected to know how it worked in the restaurant. We wanted to have a food here but we ordered it the register...supposedly we were supposed to just sit down...we have never been here before so we didn't know that. Staff was kind of rude in letting us know...The food was actually pretty good... Everything but the cabbage...it was under cooked...",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "0-XOK1kG117gY7st-tvoNA"
  },
  "O9BON3X8RInrUGwUqQdFVQ": {
    "date": "2/27/2018",
    "text": "I ate here couple of times the food is pretty good but it's over priced. I usually get Oxtails, however they only give you a few piece which is covered in fat it's barely any meat on it. The cashier always have an attitude there's no hospitality in this place. If you're from New York this might be the closest your going to get to some authentic Jamaican food but it's not all that.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BRRIk9Qx8Dsp10N-eWGA9Q"
  },
  "MMiWDnzwhvP1s9xCGzSf1g": {
    "date": "1/23/2016",
    "text": "My favorite Caribbean spot in the area. The food was served quickly. My children and I had a veggie platter with rice and beans, cabbage, and plantains. My husband had the jerk and curry chicken with cabbage, rice and beans, and plantains.   The plantains were a little off tonight but the waitress did warn me.  They always offer to put a movie on for my kiddos which is a nice touch.  This is our go-to spot for good Caribbean food!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ocOhn23rC6PhO_Xm_F65YQ"
  },
  "uxr2FYbSNOHkZriZK_CqIw": {
    "date": "7/29/2017",
    "text": "My husband orders to go here all the time. Today I finally joined him for lunch at the restaurant.  The food is DELICIOUS! The service was great and they were fast.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ao68ZZmvptrFArYPiYQKKQ"
  },
  "iotyBaG_asQ4tkxuwu-t8g": {
    "date": "8/25/2019",
    "text": "Good Jamaican food, oxtail is as authentic as you could find in the Charlotte area. Fun place to eat at a good price!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0IhEDelgCBqTEMpikLSGQ"
  },
  "6N1A7ex-CAVIjutdfv0v1w": {
    "date": "7/20/2019",
    "text": "Service was horrible! I feel like I'm paying for the service as well as the food. The man acted as though he didn't want to make my food, asking for extra gravely was like pulling teeth. He sat my food down to be rang up and the girl wanted to discuss how she don't like to have sex on the first night with someone and walked away. Then I say excuse me can you ring me up the guy acted like it was a problem, then going to throw my receipt at me. I have never received such serious and the food not even hitting like that so I wouldn't even waste my time! Quidley's right around the corner, check them out",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "RybqqXiD7hYSnhd8kUIxGQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RybqqXiD7hYSnhd8kUIxGQ/o.jpg"
      }
    ],
    "user_id": "QwcykUoUxYBAgdsJstKTpQ"
  },
  "FP7TdlN1an2r0UHBSK9RFQ": {
    "date": "1/30/2018",
    "text": "For the past two years, I have come here once in a great while when I actually drive into work. I like the price of their lunch specials, around $9 for the small plate. Decent amount of rice, meat, and veggies. I usually order Jerk chicken. Sometimes I go with Curry chicken. Both are good to me. I am no expert on Jamaican food, but I like the sweet and spicy of what I eat here. I always pair it with a Jamaican Cream soda since it taste just like a Kola Champagne. I leave satisfied and stuffed.  The servers have always been polite and attentive. Never had a problem.  Lunch rushes can be crazy so be prepared to wait in a line for carry-out orders.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "eBoyunRiJb-QzwQbv1-1bw"
  },
  "mvjIan40dKVnMmf-0ncvkw": {
    "date": "6/30/2019",
    "text": "Love it!! Great flavors and the closest to home cooked food I've tasted.  If they add Escovitch they will have all my money!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SQkVqloYdC7-0a0iEbC_WA"
  },
  "fdAQJJs7FoI76ldCElQK6Q": {
    "date": "5/15/2019",
    "text": "I have been looking for authentic Jamaican food since 2003. I've been to many places and nobody gets it right. Except this place. The jerk is that good dark brown color and it lit my mouth up! It was DELICIOUS!! The portions are liberal, the atmosphere is cozy, the prices are reasonable and the service was ok. But what it lacked in service, it made up for in taste. I'll definitely be going back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "7WH0IB1KAlv6rwR4pYIybA"
  },
  "5muSPq5DlvjEStj2NdPVRg": {
    "date": "1/12/2019",
    "text": "Love eating here when I get the chance quick quality service and the food is always fresh",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "YoF1MCAWKxNcY71eTTZDgQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Ox Tail",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/YoF1MCAWKxNcY71eTTZDgQ/o.jpg"
      }
    ],
    "user_id": "ympZibOFlDiQuCCLPsG0dA"
  },
  "Ha6vurJaFe1obQ-U8YAN_w": {
    "date": "9/21/2017",
    "text": "I came here for lunch with coworkers and was seated right away.  The staff was really friendly and took our order, got our drinks and got us taken care of in a very timely manner.  The restaurant was clean and nice.    I ordered the jerk shrimp and was told that it was made to order, and there would be a wait.  Honestly it came out quicker than I expected.  It had a great flavor.  The jerk wasn't as spicy as I had hope for, but it did have a small kick to it.  The plantains were delicious.  I also really loved the cabbage and vegetables that come with the meals.  The yellow rice was a little dry, I preferred the cabbage way more.    I would recommend trying this place for lunch or dinner. They had some other options that I would like to try as well, so I will return sometime soon.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "N8VBqg-930c9h_aAa2b-hg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States. Jerk Shrimp",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/N8VBqg-930c9h_aAa2b-hg/o.jpg"
      }
    ],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "fA0x54n1uQrMi3vCJxWgdg": {
    "date": "4/20/2019",
    "text": "Good food ,just a little bit of a wait before the workers take up the food on a to go order ,ox tails were good alitte sweet but good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PNN7ga7q5tlF5aR-dZ-f4A"
  },
  "GT3Dainbw_eALZ1NbFxzGw": {
    "date": "7/13/2018",
    "text": "Food was good, I was a little confused when I entered the place all I saw was the order here sign.  My 1st time here so you know. We were not greeted to know that I can dine in. So we placed our order and received it in to go plate.... So my husband and I sat at a larger table. Because it was the coolest area because the restaurant was hot as hell! So the guy bluntly tell us we cannot seat here its for a table for 5. But I'm like yeah and your air is not working. So we took our To go plates and sat at another table.  Oh now I notice that they had waitress it's cool. Which is fine I didn't wanna be required to pay tip anyway. So we served ourselves. Will I return maybe but I will just eat it at home.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "q0OuFt0Eb1V4HZdb1FrpNQ",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/q0OuFt0Eb1V4HZdb1FrpNQ/o.jpg"
      }
    ],
    "user_id": "C6p0kvnu2rvqyM1WN-EbrQ"
  },
  "AetZm7hjX7FuHxDGABqR1Q": {
    "date": "8/18/2018",
    "text": "Whenever I have a taste for Jamaican food I come here because its close to my house...I can't say that I've ever been thrilled with the food and today was no exception. Let me just say that although I am not Jamaican - I am from Miami and I know good Jamaican food when I taste it.  This is average at best.  Its not horrible by any means, but I've had (and always expect) better flavors ... especially the brown stew and the peas and rice.  I prefer my rice cooked with coconut milk and I have not ever tasted it in their rice.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ORndr5NN_F_yeiWXp_oVFw"
  },
  "Remv_QtZgDulEf3lw4NDwQ": {
    "date": "5/16/2018",
    "text": "This is sooooo authentic. I know this because my boyfriend is from the Caribbean and he validated it. He had the jerk chicken and I had the curry. Both dishes were sooooo flavorful. The veggie of the day was cabbage and it was incredible. The rice was incredible too. I tried the sorrel and it is sooo sweet and delicious. I can't wait to go back. Support local.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "avkCj6jnszCk1pe1XlTDHQ"
  },
  "qvYKXbqn3KrQj7qvsZHLPw": {
    "date": "12/26/2018",
    "text": "First time trying it and it was good! They didn't have plantains which made me sad but the curry was good",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4x6LvZSCnM_C5olYj7TLCw"
  },
  "MhV5Q2ZL4CN6cwhxPIMYqA": {
    "date": "5/14/2019",
    "text": "I took my sister for a birthday lunch on Tuesday 5/14/19. The service was bland. The red snapper that cost $20 per plate was so stiff and hard it was not eatable. The fish was fried at some point in the past and then a sugary seasonless sauce was poured over it. The peas and rice had 2 pieces of kidney beans and the only thing evident in the taste of the entire meal was sugar, sugar and more sugar. We had to share 1 bottle of hot sauce with the tables around us. I was so embarrassed as a Caribbean import. Please STOP ! Go back to preparing and serving properly prepared Caribbean food. This is not the way it is done in the Caribbean Islands.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oeaFeIWeWe7QaXTXcIX0FA"
  },
  "84xk4rjL66CVv2UQ2y3R4Q": {
    "date": "11/16/2018",
    "text": "Don't fucking come here service sucks. And the waitress is too busy being on her phone to check up on us. Plus she didn't even check to see if they had any of the food on the item. She said they didn't have the item. When clearly they did. Well you definitely lost my service. Thanks but no thanks.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u3fnxscdtgLwDto2qb-1wQ"
  },
  "Lvm1yJ52tX_iy6fGDbplcg": {
    "date": "5/24/2018",
    "text": "Allot of big good portions. Nice area and friendly people. The oxtail was the best! So tender and great flavor.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OFU4DZ5jkZuqTrnjbdylOA",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OFU4DZ5jkZuqTrnjbdylOA/o.jpg"
      }
    ],
    "user_id": "iuVR5Zxj0tQkU0fWTDeIHQ"
  },
  "oUllsTJSqI-OwLple3vG-w": {
    "date": "2/25/2018",
    "text": "Food is good and the fish is made to order. Ordering is a little out of wack but I can say if you order the fish, it's cooked to order so be prepared to wait.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "lN400ckm9JAMqq5_nsmBEA"
  },
  "1ovr-N4SlsKyvFfFXfUB5A": {
    "date": "11/16/2018",
    "text": "Best Caribbean I have had in a long time, new favorite Caribbean joint when I'm in Charlotte North Carolina",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "05hBDOC8GCsiZzwWc2suwQ"
  },
  "nBKyg9SoaQIxarwD6CRf1A": {
    "date": "10/1/2018",
    "text": "I always order the oxtail. I had it in Jamaica before and when I tried it again here it definitely hit the spot. I wish they had spinners (dumplings) but I've notice a lot of restaurants don't so I won't fault them for that. I have not complaint, absolutely love their food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WGALvTD9-zOJgnApU3blnw"
  },
  "ovgzcAMtK54FN7ct2bz2mA": {
    "date": "3/30/2019",
    "text": "I love the food that's why I keep coming back but they are always out of something. The last 2/3 times I've come mid day not even close to closing time they are out of some item. Y'all know what's popular so you should stock accordingly. Also the heavy set lady with the short hair always has an attitude. She's messed up my order twice and if you try to correct her she will ignore you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rzOGpE1_ahRJ-rHDlIOWLQ"
  },
  "PfZtLPb1Bt6r1lBochbcOg": {
    "date": "3/14/2018",
    "text": "My first time eating at Caribbean Hut and I didn't know what to expect; however, I must say food was absolutely delicious! Service was also outstanding as well! Oxtail was extremely flavorful and tender. I will recommend to family and friends!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DIRYW8BVU5jcJhL6hRS5yg",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DIRYW8BVU5jcJhL6hRS5yg/o.jpg"
      }
    ],
    "user_id": "QBpJQu8zGTOc_WD5CEoJGw"
  },
  "kp6APuMvjK6NxS9vRmcCwg": {
    "date": "1/16/2012",
    "text": "One of my favorite resturants...Im a regular they know my face and order by heart.  The food is very authentic Caribbean food(this coming from someone who goes to the islands on the regular).  Well seasoned meats and sauces and very good portions.  Food is always hot and fresh.  The only place were they lack is on plantains. This is a Caribbean staple and sometimes these are not the best.  Dry and rubbery at times instead of sweet, soft, and with just the right amount of crispness.  I would give them 5 stars of their plantains were consistently up to par.  Still doesn't stop me from going just about every other week.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XuJxZu_tRiPCDZFaQF-Rdw"
  },
  "_55RRAItPRcGeLtxXnoZbw": {
    "date": "7/24/2007",
    "text": "A great little restaurant. I'm vegetarian, and while most of their food is meat and thus I can't review it, their vegetarian curry was delicious. Two options for the rice (yellow or white with peas, I opted for the second). Fried plantains were a nice extra touch. We got there at 10:00 on a slow Monday night, and the server was on her way out. The woman behind the counter said she could serve us at the counter, which was a bit tall, even with the tall stools (it's the way they make them these days, but I don't have to like them). Overall, I'd say it was a great experience. Yumm, yumm.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "nBkUgsXJhHI219Q1_Q8gjQ"
  },
  "js8g64P4EBnrEpvKJmAyTQ": {
    "date": "10/3/2011",
    "text": "Delicious! One time I came here and we had a waiter that seemed somewhat high. I ordered a fish soup, and he forgot that I ordered it. I reminded him, he apologized, and then he gave me a twelve dollar sampler for free. I ended up taking the fish soup that I ordered home without eating it there, and enjoyed it later. I guess that would have made some people upset, but seriously I ordered $3.00 worth of food and received $15.00 worth of food instead. Plus it was all delicious. How I miss you, Caribbean hut!",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yfb3I7lAqy7YtXd4htzJRw"
  },
  "J-QkuIlQwUI75_LXWmJq8w": {
    "date": "2/10/2011",
    "text": "For my money, this is a great place for a taste of the islands. They make good jerk chicken and they will steam or brown stew many different kinds of fish to your liking. They aren't super fast, but this isn't fast food. I've grown up on Caribbean food and this is pretty good. And, you can eat pretty healthy with their yellow rice and peas and cabbage as a side.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "A3ZdbNlHv6gxRvBWlg7fGA"
  },
  "ui49Eftm4vts-8UF80AKLg": {
    "date": "6/10/2012",
    "text": "curry goat is pretty good, patties are fresh, vibe is pretty friendly (even if i was the only white guy in the place last night). service could have been better but the first time i went it was fine. my biggest draw back was they dont have ting or banana drink, which are my staples.  but $12 for a huge plate of goat, rice and peas and veg i cant complain (nor could i finish it!)",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "ImBb4MxG9wfTkZfOcfZhJQ"
  },
  "6vw84cSXjh_C-dORDwNing": {
    "date": "5/1/2009",
    "text": "I love this place, if you eat caribbean, most of it has bone attached, the atmosphere is great and the food is even better, so far this is the best caribbean place I have been in Charlotte. I have eaten a lot of crap from these so called caribbean retaurants and on top of that you dont get a lot of food for the money that your paying. I will not go to another caribbean resturant except here.The staff is friendly and make you feel welcome.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "JknaDp7TDcVPyDF2yCAV5Q"
  },
  "4z7Yd9DK00Fyk98g25AdBg": {
    "date": "7/27/2016",
    "text": "Went here for the first time and I thought the food was very good.  I had the curry chicken, which came with plantains, rice and cabbage, which I think was their veggie of the day.  This small plate was only $8.  They don't have the soft drinks we are used to, they sell bottled 'jamaican sodas' and there are no refills. So that may be different from what you are used to.  The place is very small, but that doesn't really matter.  The location is in decent area (university) surrounded by other stores and businesses.  Plenty of spaces to park.  The bathroom was clean. The only reason I don't give a 5 star is because I didn't find myself feeling eager to sing praises about the food or plan my next order.    However it was very good and I will come back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "50cBId7lmSOfKJhDX9knfQ"
  },
  "7dyTWyh0NADKrDl0Bq5bOQ": {
    "date": "12/5/2008",
    "text": "We decided to branch out for lunch and try something new.  Caribbean food was at the top of the list and I liked the look of the Caribbean Hut, so we decided to give them a chance.  We walked in and stepped up to the counter where it says \"order here.\"  We were told that we could sit anywhere and we'd be helped.  I wasn't expecting a full-service restaurant, but okay.    We each started with Jamaican sodas -- a ginger beer and a cream.  The cream was good; it was sweet.  And I loved my ginger beer.  It wasn't like ginger ale; it was more like sweetened carbonated water with a lot of ginger spice, giving it a small kick!    For entrees, they offer small and large versions.  The small was plenty of food.  Thankfully, that's what we ordered.  We both tried the jerk chicken entree.  It came with either yellow or white rice or rice and beans, as well as a veggie.  I assumed the yellow was the traditional Caribbean rice, so that's what we went with.  The rice was excellent; it was full of flavor.  The collard greens were pretty tasty, too.  A jerk marinade covered the chunks of chicken, and had a kick to it as well.  The only downside with the meal was that the chicken was still on the bone with fat and skin.  I'm not really a bone, fat, and skin kind of guy.  I like the meat.  Just meat.  Otherwise, it becomes work and I'm biting into things that I'm not supposed to be biting into.  It makes the meal less enjoyable.  We didn't feel like we got our money's worth meat-wise.   Loved the rice and veggie, but it would have been much, much better to have boneless chicken breast cut up and marinated in the jerk seasonings.  The restaurant itself didn't have a lot of atmosphere, but it did have a lot of windows, which made it nice during the daytime to catch the sunlight.  Jamaican/Caribbean music played on the speakers and our server was very sweet and friendly.   Then there's the pricing.  $8-$10 an entree for dinner is great.  For a quick lunch, not so much so.  Our lunch for two with tax and tip came to $26.  That's a little excessive for a strip mall restaurant during a work lunch break.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "_f87poKKGuzL--PfnPM32Q",
        "caption": "Photo of Caribbean Hut - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_f87poKKGuzL--PfnPM32Q/o.jpg"
      }
    ],
    "user_id": "_uqIpl5tzucKuIlZZPBZRw"
  },
  "tln5i_9QxdvzPxuppMtUBQ": {
    "date": "3/29/2016",
    "text": "I had the oxtails with rice and peas and cabbage. I didn't particularly care for the cabbage, but everything else was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ByLLqpluDmLspbgUpGLL2w"
  },
  "dOcqEvOg4GMcBeYbholUFg": {
    "date": "6/24/2016",
    "text": "The oxtail is awesome!  Everything I've had here looks good and tastes fresh.  Service is fast and they accept credit cards. Prices can be a tad bit high, but it's probably one of the best Jamaican restaurants in the city, so it's worth it.  I've been to a few other Jamaican places in the area and either the service isn't good or the food isn't flavorful.  This place is a rare gem.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ibNqREah2IJyX05Nqk0i9g"
  },
  "0KBTANBCp_MGHrj9-__hww": {
    "date": "3/4/2012",
    "text": "This is the only Caribbean restaurant I have tried in Charlotte, but I grew up in South Florida where Caribbean food is all over, so I have had a lot of it.  I almost always have the brown stew chicken here, because it is SO good.  I've also tried the curry chicken and jerk chicken, which were also excellent.    They have a great lunch special during the week that is a great value for the amount and quality of food you get.  The lunch special is under $6 and comes with rice an a side of either cabbage or collard greens.  Which you get seems to just depend on what they make that day.  I don't think you have a choice, but both are good.  The collard greens are the best I've had anywhere, although I have not had them many places as I always thought I wouldn't like them.  You have a choice on the rice, either rice and beans or yellow rice.  Authentic Caribbean places call it rice and peas, but I think they wisely call it rice and beans to not confuse American customers.  One of the telltale signs of a good ethnic restaurant is when you see people of that ethnicity in there a lot and that is the case with this place.  If you go in around lunch time there are always a few people sitting at the bar (I don't think they serve alcohol, but they have a few stools at a bar in the front) and you'll almost certainly hear an island accent from them.  If people who know the real deal authentic food eat there, it's a good sign to me.  If you like their food you will find that they treat their regulars very well.  The first couple of times I got takeout there I felt the service was pretty slow, but since I have become a regular (I get takeout probably 1-3 times a week) I don't even have to order anymore.    Overall I love this place and the only reason I haven't tried everything on their menu is because I like my regular brown stew chicken so darn much.  The next thing I am going to try there is their meat patties.  I hear they're hot, so if you order them keep that in mind.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "N0LlnCSGjUhjraekC7VObQ"
  },
  "bsvz5LeGU_lnFiEkMGsYrA": {
    "date": "3/28/2014",
    "text": "Not so much.... I've had better it's a nice fix but it reminds me of when I want a coke but some buys me a diet cook .... It's good but not exactly what I wanted",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "FGo2kzgfEHAa-JKIRRvo4g"
  },
  "hnnp0FKorNs9r84Z5SJKjA": {
    "date": "2/20/2016",
    "text": "Great tasty food. Curry goat, oxtail and curry fish are all great. Place gets busy so service was a little slow but the food was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sYlik4Tm34otrLwLuLWvww"
  },
  "E8NJcMYrgOGTfkAFxJO8wg": {
    "date": "8/8/2014",
    "text": "Went there with friends and everyone liked everything that they ordered.. All in all a place worth trying.. Do try the Jerk Chicken",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ECz9qXshZ3Zoo8uU181N7Q"
  },
  "FjwM2RwRzTZqGKNp8OX23w": {
    "date": "12/4/2013",
    "text": "Loved the Jerk Chicken. Was definitely spicy, how I like it. Looking forward to future visits. They also have an assortment of Jamaican beverages, alcoholic and non-alcoholic.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JvSpmocul-VIpZ8zctpOFA"
  },
  "aHSkcyB552eCz_LzWM1qjQ": {
    "date": "10/16/2013",
    "text": "This is my go to spot in Charlotte for Jamaican Cuisine. The food is always fresh and the service is A-1. I only wish that they would hire more cooks or create a faster prep time so the wait isn't soo extensive.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wZn8rB553-JTRxtABueleA"
  },
  "Jxp_IUrJCzU1SWOXn_9nWQ": {
    "date": "3/23/2011",
    "text": "Came here for the first time today at lunch.  Ordered the jerk chicken.  The sauce was pretty good, as it had a little kick to it (spicy).  I do think that it was missing some tamarind flavor though.   Unfortunately, they do not have jerk pork.  I am a huge fan of pork, so it was disappointing that this meat was not on the menu.  My large order of jerk chicken also came with white rice, and a side dish of cabbage.  The cabbage didn't have much of a strong taste, but I really liked it a lot.  It also came with a side of plantains -- 2 pieces, actually.  Very disappointing, as usually plantain portions are more than 2 lousy pieces.  I'm not sure if I would order the same thing again.  While the jerk chicken came with about 5 pieces, they were pretty much bone pieces.  A couple of small drumsticks (like hotwing variety), and other chicken bones.  This was quite disappointing.  If I do make a return trip, I'll order something else.  Please add jerk pork to your menu, and add tamarind to the jerk sauce.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m2MjtGB_p0dxaxsRwgoXtg"
  },
  "THA-K6-ZL3uikPJ5-ejdqw": {
    "date": "1/9/2016",
    "text": "Service sucks, but food is ok. DO NOT order any item with Roti i.e flat bread. It used to be excellent until couple of years ago, but something changed. Some parts of the roti are literally uncooked. Without exaggeration, i can say it is just dough",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vmz_wm_w8zeJ4-7PDTUnKA"
  },
  "_Ddi75Y7kAzBY0_OZ2gjDA": {
    "date": "4/28/2014",
    "text": "Thier food is good if your use to caribbean style food, but great if your not. All of their workers are friendly. I recommend this.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QevLeOTnjRAxfoOE1uilAA"
  },
  "AUyN_m8wxzwb2l33ekk8cg": {
    "date": "6/25/2012",
    "text": "Very friendly environment, but it's about the food. Damn that was good, and A LOT of food for 8 bucks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "AKeIjpYuyvXEVFczhVPDrQ"
  },
  "_SebHy7AyWybvt8Ps0QV-g": {
    "date": "6/13/2010",
    "text": "I am giving this place 4 stars because #1 I'm not a experienced Jamaican food taster. I've been to Jamaica but that was well over 5 years ago, so I can't remember exactly how everything tasted.  I tried Carribbean Hut at the Taste of Charlotte. I LOVED their Jerk Chicken with Rice and Peas! Delicious! I loved the spice. It was my kind of spicy esp. I'm from Louisiana. I can say it was spicy because my husband said it was. (He is from South Carolina)   I hope to go back for more, and maybe also try more of their food. The jerk chicken is a winner though!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "y-UnEZ6JpZMqNcebP8SzZQ"
  },
  "joVJ3YM_wMBv1B__h6mRvA": {
    "date": "10/22/2015",
    "text": "The food is not good at all. My brother n law is Jamaican and it's not even close to authentic Jamaican food, but if u never had real Jamaican food it would probably taste great.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "A4wWNaOUco0j9jOP99xOyQ"
  },
  "47uUu6eAk--FX528K0ZxYg": {
    "date": "5/14/2015",
    "text": "Not very impressed; food was ok if you like it saucy, they were out of beef patties and the service was out right bad",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "aNbvb0PCZRYRkQ84S413Lg"
  },
  "v65f5eduWcuPK53u97Fp5A": {
    "date": "8/7/2015",
    "text": "Food is wonderful.  Service can be slow and sometimes the TV is too loud.  But, I've never been disappointed with the food.  It's delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OB5I_oHz_EOaMBeP05tETw"
  },
  "lb2NCZNnbos07sk_wcbiWQ": {
    "date": "2/24/2015",
    "text": "Got the food to take out and I eat Jamaican food all the time the food was not good there were new to make and seasonings the cabbage was half done the oxtails were not tender in the rice is getting a price example parboil not good I was disappointed I don't think I will ever go there again not enough meat to go with all the right ahead and the price jerk chicken was not hot spicy or good won't try it again",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5ZHAwuTKuv6h2hAIwqt-zg"
  },
  "EJuN9Umog9SGgAc6koKhig": {
    "date": "8/21/2013",
    "text": "The food is excellent.  The service is very good.  Prices are very reasonable.  If you like Caribbean food you should go there, it is really enjoyable.  GET THE CURRY GOAT.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "iN5kL0PrH0lb_69fZ6difQ"
  }
}