{
  "jMglR9nxfl0rQniEmO8iZw": {
    "date": "5/6/2016",
    "text": "Gas station mother F'in tacos!!!!!!  This please is legit.  We started coming here the first day it opened and went on a taco binge for 3 months straight. Authentic Mexican at a low price right next a business park.  Unfortunately they have blown up and I have to call 2 hours early now to get my tacos.    Their steak tacos and the al pastor are out of control good.  Also, the shrimp quesadilla is filled to the brim with those crustaceans.  The only disappointing thing is you get lees chips than you used to.  I still love you Domingo, tacos are fire!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "ulLNJBYJz_2Pu4uG_BeqoQ"
  },
  "1dn361uK_G0FtyMDLKWk9g": {
    "date": "9/20/2017",
    "text": "This is become one of my fave places to get Mexican food. I got the Lazy burrito and it's delicious! It's definitely big enough to share so keep that in mind if you don't have a large appetite. The Tortilla soup is excellent as well. The cup they serve it in was so big I had enough for 2 meals. Everythinh we got that day was flavorful and filling. I will definitely be going back to this restaurant and recommend you go too!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jk02p1-Xpw38ODRYxNRDyA"
  },
  "CTT6TGZQxiVh-iAAEx55Wg": {
    "date": "8/3/2017",
    "text": "Anita's is always tasty and one of favorite places for lunch. I've tried the quesadillas, tacos, and burritos. They always give chips and salsa with every order. Service is always on point!  Two thumbs up!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "M-4btdSsSNB5xaReeQB7yg"
  },
  "n7Ak9ewdksD7KWKPu7C07Q": {
    "date": "10/18/2018",
    "text": "This was my first time going to Anita's. My co-worker said it's a \"gas station\" place; with good eats. I am a Mexican food lover. I must say Anita's passed my expectations. I had the fish tacos on soft corn tortilla's, with a side of refried beans and rice. The young lady taking orders was extremely professional and very knowledgeable. I don't consume \"pork\" or any products that contain this protein. I inquired about the refried beans, which I love, but gave up because it is typically cooked with lard. She assured me that the beans were made with vegetable oil. She also told me that since the fish was \"cooked\" to order; it would take around 15 to 20 minutes. I must add the line behind me was forming quickly! Well 10 minutes later my order was ready. OMG, the fish tacos were well worth the wait. Everything was hot and delicious! This place is a hidden gem! I will be back. Go early as the lines during lunch are out the door.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tzRLBC6djYg5IaXYwT3o9g"
  },
  "woIhCG5_Z6GvKHztKi66rA": {
    "date": "12/3/2016",
    "text": "Anitas is my favorite restaurant in Charlotte. I go there every week and it is always so good. The people that work there are really friendly and the food is amazing.  Some of my favorite options:  Arroz con pollo (the acp) Crazy burrito (this burrito is huge so you better be hungry) Fajita Nachos Chicken Fajitas  Don't let the location worry you if you are a first timer this place is incredible.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "giVHJVY6_vbUDE5YCgACXg"
  },
  "D_xeP2JDYfjbF-_cxbOS6Q": {
    "date": "8/5/2017",
    "text": "Top notch delicious authentic Mexican food! The best in Charlotte! It's small inside and part of a strip mall, but you will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "o7EDqdOskz7b0SUcvxlL_A"
  },
  "0xxKEkSX3HTZGG0Z7sVC-g": {
    "date": "6/29/2016",
    "text": "A lot of food for the money!  The meat for the tacos are great the only downfall is the corn tortilla it taste store bought.  Every order comes with chips and salsa, very nice.  It's super packed during lunch, lines are out the door because the place is small.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "NIOB4BrIR0WNPxM8IyttPQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Al pastor with cilantro and onions",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/NIOB4BrIR0WNPxM8IyttPQ/o.jpg"
      },
      {
        "img_id": "T7eBhcPprUjwXVG05cRIog",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Steak taco and chorizo taco with lettuce and cheese",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/T7eBhcPprUjwXVG05cRIog/o.jpg"
      },
      {
        "img_id": "ewyV_BP79mta0q6VUk-OBg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Special nachos",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ewyV_BP79mta0q6VUk-OBg/o.jpg"
      }
    ],
    "user_id": "fcD5KiJ_ACTsU6zLJR6CuQ"
  },
  "7OQOed01J-TX4w5dNrYo4Q": {
    "date": "3/14/2016",
    "text": "Pretty good, y'all! The food is tasty, the team seems efficient and helpful, and the service is fast.   A caveat: the menu is confusing - there's no other way of putting that - but it's all variations on a theme so a little intuition goes a long way.   My mind wasn't blown, but it was better than average, very cheap, friendly and accessible in an area that has a real dearth of lunch options for those on their lunch break. I'll be back for sure.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "SOHnmpVIXVPqgSXlEo8wDw"
  },
  "HqlSRHabnuaax2HR5LTaKQ": {
    "date": "6/22/2017",
    "text": "This is the best Mexican! Try the traditional Carnitas taco on soft Corn Tortilla's. The best chicken soup I have ever had too. Ok... Also the parijedas Fajitas too.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zFywv_U__nrtar1oEnJtpQ"
  },
  "_HrkAu-VZt9m3uNVLnDlJQ": {
    "date": "3/3/2017",
    "text": "Probably the best Mexican food in town. You know it's good when even the Mexicans are lined up out the door everyday at noon. Lazy Burrito = awesome deal. 10\" smothered burrito half chicken half beef with side of chips and salsa for less than $8!!!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "X9NuOzjlYhGY86SYIAaCCw"
  },
  "EYQ6iXMS_JFMJTbVWvVcAg": {
    "date": "2/28/2018",
    "text": "Outstanding food. It's very tasty, cheap, and fast. The only knock is that it's served in a styrofoam box with plastic picnicware. But that's not enough to lose a star. Very pleased with this place.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "x3_Iap_M8UJQH_my1Ev70g"
  },
  "8M9iCcXuLt5GeI-ioqodKw": {
    "date": "5/31/2017",
    "text": "Man this was a good find. Stopped in after work and was surprised how packed it was.  You can tell it's a local favorite. Saw someone walking with an enchilada which looked awesome so that's  what I got. Beef, cheese and chicken enchiladas cost me only 7 bucks and they were epic. They have a very generous, appreciative staff.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "f7bTsG18mebPWIE23xi8_g"
  },
  "0hV1tTwDvM9anNFYcqESog": {
    "date": "2/22/2017",
    "text": "Great spot to run an get lunch, limited table tops, get there before noon, alot of bang for your money, but nothing really outstanding.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "L8HeMK2wTYZNoxsTX34lBA"
  },
  "fzadYWFpRD0UYKVyZ9FUuA": {
    "date": "11/20/2016",
    "text": "Don't let the location fool you (next to the subway in the BP shopping center), this place is awesome.  From the quick #4 (burrito taco and rice) to the al pasour tacos on corn tortillas with cilantro and onion, it's all amazing.  The only down side is the place is small and it's no secret.  If you get there at 12, the line will be out the door and it will take even longer if you want something from the grill.  In the mood for something different? Try the tortilla soup.  Trust me",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "t87yug-szpGIltQpZh02sA"
  },
  "CblX1kfxRM97yEpQo2P47A": {
    "date": "5/31/2017",
    "text": "The most delicious food ever ! The carne asada fries are everything !!!!! And The girl at the front is very nice ! Will definitely be going back !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "baAPQ1wElF3wjKboJYC0dQ"
  },
  "q--tIMotCidzci3PXVKymA": {
    "date": "8/9/2016",
    "text": "Sweet, sweetness.  Do yourself a favor and grab some tacos while your filling up your gas tank.  You won't be sorry.  Awesome shrimp quesadilla, tacos al pastor, lazy burrito whateva!  They are all mouth watering goodness and cheap!  Best, most authentic Mexican anywhere near here.  I will be back many, many times!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "6qgfTjrayp4vvXf4Aalo8Q"
  },
  "rncwdmH5Mv0BHZzNRU3zyA": {
    "date": "3/6/2017",
    "text": "Wow.  Ate there for lunch.  Great food at a really good price.  All the ingredients are fresh and authentic Mexican.  Better get there early because the line builds up fast.  I highly recommend.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZWS9laGC1zPPawNMUa1gWg"
  },
  "XsQX0z3isLn_aVGYqwt1ww": {
    "date": "10/10/2016",
    "text": "We're from So California and know good Mexican food....this is great Mexican food!  I highly recommend.  Our family ordered tacos, quesadilla & Carne burrito.  Everyone was happy.  The tacos are a generous portion.  Go enjoy!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AnF9Epdyvu7EoTDwW9GijA"
  },
  "qTOQwSJBzK4K9aQlYacHAg": {
    "date": "8/27/2015",
    "text": "It wasn't quite cheat day but I decided I needed a splurge! To test the waters I had a \"Speedy Gonzales\" with Carne Asada tacos (I ordered an extra taco) , chicken enchilada, rice and beans. LOVED the enchilada! Not a fan of the tacos. I prefer street style/ taqueria tacos with less frills and more flavor. So while not terrible, WHEN I go back (because I WILL be back) I will request only onions and cilantro on my tacos. The line was to the door as mentioned by other reviewers so prepare but I'll take that as a good sign!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lGs3VHkhDkoR1Jh0dv443w"
  },
  "nehFz2HcQfnTtn6IRP70kA": {
    "date": "8/30/2017",
    "text": "Best Mexican food in the area! I love going here during my lunch break. It is a very popular spot that tends to have a long line, but the food is worth the wait. Very reasonable prices too. Wish their hours were longer during the week and on weekends. They should consider opening up more locations around town. Anita's is a hidden gem in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CX8MSzGFwvqOrf-i_OYSJw"
  },
  "JRjwmW89NBEQ_u8hqdFyqg": {
    "date": "8/17/2016",
    "text": "In my search for the best food to recommend to fellow yelpers, I set my sights on Anitas Mexican Grill. The staff was pleasant and the traffic was very steady while i was there. I figured this is a good start. I ordered tacos al pastor, arroz con pollo (chicken and rice) and chicken soup. I figure this is a nice variety to judge the place by. Let me begin:   Portion size: large to very large for what they charge. I was actually shocked to see the size of a burrito that someone walked by me with.  Taste: the food was fine. The tacos were good, not great. The arroz con pollo tasted like they just added a soup mix to the rice. Not very authentic to me. The soup was lovely. Plenty of chicken, rice  and veggies. Not too flavorful, but lovely.  CELIACS BEWARE... Now to the important part. If you for some reason read more than one of my reviews, I first would like to say thank you. You may know already that my wife is celiac and we look for gluten free options around Charlotte. Now we've had Mexican many times around the Queen City. We figure, CORN tortillas, pork, and onions with cilantro... Where could you go wrong? But did it go wrong. After eating her tacos, my wife got GLUTENED to an extreme. One of the worst times since we've been in Charlotte. Such a shame because she loves tacos. Where they used wheat?? Who knows. What a shame, because we love to support local small businesses. Well, on to the next foodventure!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "imKh92YZeH0vj67TtGECzA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Tacos a pastor, arroz con pollo, chicken soup",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/imKh92YZeH0vj67TtGECzA/o.jpg"
      }
    ],
    "user_id": "SlDD_u9gt9-RTviBWHAy4A"
  },
  "w8lZHD5eYUsWmGzjTYgnTA": {
    "date": "5/7/2018",
    "text": "We were in town & looking for good Mexican & definitely found it! Delicious food, friendly staff & very reasonable prices. I accidentally ordered something other than what I meant to & it was still amazing! definitely try this spot if you're in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "QSJ5bl1M1TM8ypY6PS0mlw"
  },
  "w84HAJdo96TlWTTsAToP7w": {
    "date": "4/18/2018",
    "text": "I've heard people rave about Anita's. We have a business nearby, so naturally the location of this is quite convenient. The food was just so-so. Lots of stuff up front that has already been cooked. Not sure how fresh that was when we went. If you're limited to just the few restaurants in the Yorkmont area, this will do, but if you can travel further, I'd suggest trying somewhere else.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "IfhacZEGE1p3qTHxmU3SCQ"
  },
  "ypEAfQT05QWveffOS2_-1A": {
    "date": "7/10/2017",
    "text": "This place is great! Our office eats here at least once a week.  I get the #8 or #10 usually.   The soups are like \"Mi ama y abuela\" made them. (I'm half spanish)  Bonus, the owner looks like the little brother head coach Ron Rivera of the Panthers",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SezYjYaBa2HTJLvBwgysgg"
  },
  "ug9rQ9CSyIUY69Zp40um4Q": {
    "date": "2/25/2018",
    "text": "OMG the best Mexican food I've ever had! The prices are fantastic, the service is always so nice and everything is delicious! The steak tacos are hands down amazing. They're loaded with steak and 2 is plenty for me!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JAqpBJ1sOeF-eXcFKn5UDQ"
  },
  "8y7kS_Hb5XTjeNpbeUUmkw": {
    "date": "1/7/2017",
    "text": "Updating review from over two years ago to say I am still a regular at this place for lunch. I have settled into getting a #8 every time and it's gotten to the point where when I walk up to the counter  they ask \"the usual?\" I still have not found better tasting Mexican food in charlotte, and certainly not a better value.   A charlotte hidden gem for sure.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Zl10YNHyKy3EQyTQG0sEw"
  },
  "5oZOXTs8JioKsm6D_sS1uQ": {
    "date": "7/12/2017",
    "text": "Great lunch place - food is cheap, good, and quick.  Line out the door sometimes, but the turn-around time is great",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "9U2qJEMKPgLYkEg50L1ieA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Part of the menu",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9U2qJEMKPgLYkEg50L1ieA/o.jpg"
      }
    ],
    "user_id": "40LKuIwRg-Osd3EJeS7W9w"
  },
  "DMU20Fzlb6iKmTjF-H4uVA": {
    "date": "5/5/2017",
    "text": "Had lunch there today for the first time. Food was excellent! Ordered the Sombrero and it easily made two meals - and I'm a big eater!   Can't wait to go back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xWGzcfkKg8q3qe1JzXWd_g"
  },
  "MB7kfBzW1sh9UVAT3gwKSg": {
    "date": "8/20/2015",
    "text": "Amazing food. The arroz con pollo is a must try. Also tried their burritos which are great as well.   The line is long but it moves quickly and the staff is very friendly. Wait for food is about 5-10 minutes and definitely worth the wait.   Will be back soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "emVJrwAvT2K1rs5dlBR5qg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Arroz con pollo",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/emVJrwAvT2K1rs5dlBR5qg/o.jpg"
      }
    ],
    "user_id": "Ib3SgdxxY5sggxqbMMtzWQ"
  },
  "f3WBBKXs-q_VZavmuEtzZw": {
    "date": "10/11/2015",
    "text": "Very good food! Their salsa is extremely fresh! Anita's is one of our favorite places to eat. They had moved since we last visited Charlotte into a smaller place. I would now consider it a hybrid mix of \"fast food\" &\"traditional\". You order at a counter and take it on a tray to a seat (but infinitely better than places such as Taco Bell), but they fix it to order and you will have to wait a few minutes while they prepare it. The staff is super friendly and helpful if you have no clue what to order. And you cannot beat their prices!  I will admit, I liked it even better when it was a traditional Mexican restaurant where the salsa keeps coming as long as you keep emptying the bowl, but we will definitely be returning here to eat every time we are in the area!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "_qMTsQRhhOix9lhY0DIhqA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/_qMTsQRhhOix9lhY0DIhqA/o.jpg"
      }
    ],
    "user_id": "58hIJ0PNMIAXe-0EdVNoww"
  },
  "uYh5wEDF_fpXeU9LFby6LA": {
    "date": "9/20/2017",
    "text": "I love Anita's. The first word that comes to mind is fresh! I don't eat meat and they are always so savvy in coming up with different variations of food items so I can still enjoy them. I love the guacamole salad and it's only 2 bucks. I also love the quesadilla and their veggie fajitas. I could go on!!!! The staff is amazing. Very warm and always serve with a smile. I often wonder do these folks ever have s bad day because they are always nothing but kind and consistent on every visit. 2 words. Go here!!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "MH9e91DOUkK6DkZEBpr-xw"
  },
  "E2dHC1I-FWmSYC7R22-udw": {
    "date": "6/26/2018",
    "text": "Great Food, very busy around 11-1. I would suggest waiting later if your trying it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PXcCtbuqccN-5BdyOeCEjg"
  },
  "KahAaI1wYoSHHQKJ1EkZQA": {
    "date": "6/27/2018",
    "text": "My favorite Mexican in Charlotte! The choripollo and tacos al pastor are to die for. I was skeptical when a friend told me it was a bit hard to find from the road since it was in the side of a gas station, but the line out the door was an indication that I was about to have a great lunch. I was not disappointed!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GiDL4HKOa0BldinKHoux2g"
  },
  "6GJpQdwUUWtwhwTfPg70eA": {
    "date": "11/16/2017",
    "text": "I have eaten Mexican food all over the country and this place is really good not great. I kind of pigged out since I know I'll only be able t go once since I don't live in Charlotte. I got two tacos a tamale and a tostada (I ordered a chalupa but they gave me a tostada) If I only had tamales this place would have 5 stars.  It was special. The tacos were just okay and I didn't get my chalupa :( Overall I would definitely eat here again and order the tamales and maybe an actual chalupa.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "bJjNxLBgzA6NwkXYDxIVwg"
  },
  "JOA3kDlINkdrX7ld9-v2iQ": {
    "date": "9/2/2016",
    "text": "Food is generally VERY good and prices are fair. Last 3 times I've been during lunch though, waited an average of 28 minutes. Yes it's busy but I see scowls of frustration from everyone as they leave lately.  Hope there is something they can do soon. I'll be at Azteca unless I eat lunch at 3pm.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "XgibxnRZ7a0E2YHAV3e1tA"
  },
  "8UM6jcGMBJXTYTOQch38ww": {
    "date": "4/21/2018",
    "text": "This restaurant is in the same building as a gas station. It's a tiny place with a few tables and a bar.  The door is constantly opening so it can be chilly or hot. The food was good / pretty average. Friendly staff, relatively inexpensive, decent food,  but not what I was hoping for.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "u6kSuLrfs5TC2hoa1b3vsQ"
  },
  "xRPlEcJnZoQysv4cVwnCkA": {
    "date": "11/9/2016",
    "text": "Carne Asada fries. 2 al pastor tacos and a chicken taco! All of this was about $17, plus it came with chips and salsa. This fed 3 people. Very good and not expensive! I'll be back. #TacoTuesday",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "u2-tuKDCvpz__uBQKs2zNQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Carne Asada fries. 2 al pastor tacos and a chicken taco!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/u2-tuKDCvpz__uBQKs2zNQ/o.jpg"
      }
    ],
    "user_id": "eV_7h4rSXanvZ592eT_YBQ"
  },
  "HKxbV47xk89rTaaeEGvK5Q": {
    "date": "8/5/2017",
    "text": "This is a small place that has the freshest Mexican food around. Don't let the fact that it's in a gas station fool you. There is a reason it has so many stars.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "Tv0i4vZAl2ZbUwL9voJ4OQ"
  },
  "l9xBjkKlWUX-jmN1UR5b3Q": {
    "date": "9/25/2017",
    "text": "A favorite stop of mine. Simple place, small but fast! call ahead, especially during their busy hours!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WvcUKsNMERSP_dPkgsq9ZA"
  },
  "oIMad7piuYdpBcQRDbI2pA": {
    "date": "7/19/2017",
    "text": "Don't think about it, just go here! Yes it looks like it's not good because it's attached to a gas station and a cleaners, but forget all your skepticism. Authentic Mexican food that is just notches above the rest in the area and for a REALLY good price.  They're only open from 11-4 because that's all they need to do. I haven't gone here once and not been near or outside of the door because of the line. If you want garbage Mexican food keep moving, but if you want authentic, just stop here. The Al Pastor tacos are to die for, but everything on the menu I've tried is good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnwB4Sa5yr2OYiqmfpSskw"
  },
  "TxaAH44jSy7loyKUhk6i3g": {
    "date": "2/17/2018",
    "text": "Please do believe the hype! So i have been looking for another spot for Mexican food that was affordable i had this place bookmarked for quite sometime now. So the other day i decided during lunch hours hmm let me go check this place out, reading the yelp reviews i read where some were saying whatever you do do not go during lunch hours because the line was out the door and what did i do , thinking like ok yea it wont happen to me kind of like a person on drugs that thinks if they take a hit one time they wont become an addict. As i parked my car i didn't see any lines as the yelp  reviewers stated  it was a line out the door, so as i confidently walked up to the door what do i see?! A long line of people lined up inside of here, holy taco meat! Welp that 's  what i get for thinking it would be any different for myself. The line moved rather fast i was in line for about 10 minutes give or take, then once i ordered it was about a 15 minute wait. I wanted to keep it simple this time around i ordered the loaded nachoe's  . The flavoring on the meat was awesome i did half and half, half ground beef,half grilled chicken. It was so much food i could barely it all, well i didn't eat it all,",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "xUUf9DTvr74BkMb1MmWbxw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/xUUf9DTvr74BkMb1MmWbxw/o.jpg"
      },
      {
        "img_id": "II1P2HWamW5LlvUfjiY2WA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/II1P2HWamW5LlvUfjiY2WA/o.jpg"
      }
    ],
    "user_id": "NVVknS1I51z8wY5NNrJ6vQ"
  },
  "4TO9mxPl_qTLPhHnXXu55w": {
    "date": "2/8/2016",
    "text": "I wish I would have taken pictures of my meals before I devoured them from Anita's ! This coming from a foodie that doesn't crave Mexican cuisine often . Anita's is definitely authentic Mexican cuisine in your quick stop order to go , or have a seat and grab a quick bite. Warning there will be a line and nowhere to sit after 12...so come early or late if you don't like to wait .  I have visited two times, and each visit has been quick with large portions of food. I absolutely love the guacamole here and the flavors are robust.    Chorizo con quevos , check Marinated chicken taco salad, check   I'll be back , my next yummy choice will be the grilled shrimp tacos .",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "9nwn2LgPgPbLvMLolbvnrg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Chorizo con huevos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9nwn2LgPgPbLvMLolbvnrg/o.jpg"
      }
    ],
    "user_id": "lUXifKGBbbRUNxaPnuekXw"
  },
  "DIO_2nt7dK9hlIQ_GO07Pg": {
    "date": "12/2/2017",
    "text": "Stopped by for a quick lunch today around 2 and the place was packed! I got these three delicious carne asada tacos and they came with chips and salsa. The meat wasn't as thinly cut as I usually like but the flavor was amazing. For being far from my Southern California home this is as close to authentic Mexican food as you can find in the area. It's a little out of the way for most but totally worth the drive and SUPER affordable. The staff was polite and helpful. 5/5 totally recommend.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "XlDaLC7aOzlBDDyBkYVPrw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/XlDaLC7aOzlBDDyBkYVPrw/o.jpg"
      }
    ],
    "user_id": "w_2eCXmEJgDw65Xoa1dYiA"
  },
  "KlYvBPERwVl7Fpdh-c2_lw": {
    "date": "5/6/2017",
    "text": "Stopped based on the help reviews. Who would have expected an amazing Mexican restaurant in a small gas station strip mall.  Ordered a couple soft tacos, tons of food.  So delicious.  The chicken had great flavor and veggies mixed in.  The staff was super friendly and did their best to stay ahead of the crowd.  Be prepared to wait as you may get beyond someone from the a corporate office coming in and ordering 15 different things.  The only negative was the long wait to actually ordering.  Can't wait to go back and try something else on the menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "8ISR5kFn8B-rIVRJP79utQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. 1 chicken and 1 beef soft taco.  So much food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/8ISR5kFn8B-rIVRJP79utQ/o.jpg"
      }
    ],
    "user_id": "bqhfMozc8Wp1ty_zDOis_w"
  },
  "_4JENDN7OdtV_X0YoX2MtQ": {
    "date": "11/8/2015",
    "text": "Came to Anita's to pick up tacos for lunch.  I ordered the Carnitas and Fish Tacos.  I personally enjoyed the Fish Taco more than the Carnitas Taco.  Tip:  See if you can call in your order early.  A coworker and I each ordered 2 tacos, and it took about 20 minutes!",
    "rating": 3,
    "rated": {
      "funny": 3,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "RyWXajDxSRzYnYUNJdgNNg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/RyWXajDxSRzYnYUNJdgNNg/o.jpg"
      }
    ],
    "user_id": "NvUeb5G_mSSxgKhEE_Hueg"
  },
  "YCU8S6plJQRLP_UuAQCi-w": {
    "date": "3/12/2017",
    "text": "This is a great place for lunch. The people there are friendly but it can get really busy if you go there after 12:15.   The food is more authentic Mexican than fast food. There are not a lot of tables insides so a lot of times I will grab my lunch and go.   They also give you chips and salsa with all combos. A nice touch!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UOAq6-YRLoIgWtJNkChzbA"
  },
  "rHsIkCwmJJhl_OoEkgHFhg": {
    "date": "9/14/2016",
    "text": "I have an addiction. It's street tacos. Gimme dat meat and onion and cilantro and leave me be. This place had a line at 11am on a Tuesday, but it went quick. I ordered 2 al pastor and 1 carne asada taco to go. 7.50 later I had three HUGE tacos, and a side of chips and salsa (green and red salsas). I didn't even know chips came with it!! Holy cow. The al pastor is the star here and I'm glad I waited for it. Juicy. Massive. Flavorful. You can add cheese to your tacos but I like mine simple. This is in a strip mall in a gas station parking lot but don't let that deter you. I am moving to Charlotte soon and I will make the drive from wherever I live to this restaurant often. Also...the tacos came on flour tortillas which was unexpected. I'm sure they have corn tortillas though, and I will make sure to ask for those next time!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "LYVgG_WMllJ8aXS_d9saug",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. 2 al pastor and 1 carne asada...plus pico and one of the two salsas (that was a surprise, just comes with it)!",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/LYVgG_WMllJ8aXS_d9saug/o.jpg"
      }
    ],
    "user_id": "oDv9HzZUPw1b_uQW0vVCOA"
  },
  "sweoxYnL52c_IDRdHyMEIw": {
    "date": "11/10/2017",
    "text": "I've gone to this place twice based on the Yelp reviews, and both times I was very disappointed.  I do not understand what is authentic about \"taco bell-looking\" ground beef with zero flavor, flour shells, lettuce, and flavorless \"salsa\". If you pay attention, they have two MICROWAVES next to the food display; I literally watched the guy fill the shells with ground beef and throw them in the freaking MICROWAVE...what in the world?!?!?!  I want to assume that most people writing these \"excellent\" reviews are not used to AUTHENTIC, corn tortilla, onions, cilantro, DELICIOUS Mexican tacos!  I will not waste my time or money here again...and I have yet to figure out why there's a line out the door for this crap!  I'm pretty sure it's because of the limited dining options in this area, and it's the only Mexican restaurant...but I'd much rather eat tacos from the back of of one of the Mexican stores on South Blvd!",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b9_OBFjLp4KuUgrJkXlsfA"
  },
  "cqAulrXUK-7mu1gh9ffA3w": {
    "date": "4/5/2018",
    "text": "This review is based on the tacos only! But they were amazing. I got the cheese asada tacos and my husband got the regular street tacos. So tasty. Meat is juicy, full of flavor, and good quality! Good Mexican is hard to come by here in Charlotte, so I highly recommend this place.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "S0QiX0D6dH8XwbB4HwROmQ"
  },
  "UIyAaBE8YB-9mHZcW6SEsA": {
    "date": "7/26/2018",
    "text": "This is hands down, THE BEST mexican food in Charlotte. I come here 1-2 times a week and am NEVER disappointed! This is AUTHENTIC Mexican at a price you cant beat! When I go, I normally get either the #6 Chimichanga, the Speedy Gonzalez, the #10, or the Nachos! This restaurant stats packed, but its WELL worth it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b7ztRm1FH6lL6Bih9UHRtg"
  },
  "svNk_w6-Hp5FAzlvAaygVg": {
    "date": "10/10/2016",
    "text": "I was passing through Charlotte on the way to Virginia and was starvingggg. Tacos was the only thing my friend and I could agree on so I looked to Yelp to help me find a close by Mexican place that could fulfill both our cravings.   Enter Anita's. I was a little skeptical at first because you turn into what looks like the airport entrance and then turn into a gas station, but right next to the gas station is this little nondescript place. There was a pretty long line to order, but I took that as a good sign. The restaurant itself is very plain and to the point. It's not fancy, you're served on disposable plates and trays, but you're not there for the atmosphere, you're there for the food.   I ordered two tacos, one al pastor and one carnitas, in addition to that I requested rice and beans AND chips and queso. What can I say? I was hungry! The first thing I tasted was the queso. It was smooth, silky, flavored perfectly with a hint of spice. It was delicious and if I could bathe in it I probably would. My friend got the guac which she thought could use some salt, but I was pretty content with. The salsa that comes with the chips was delicious as well.   Finally my tacos came out! They tasted heavenly. The al pastor was perfectly seasoned, just the right amount of sauce. It was like some grandma was back there making it right after I ordered it. The carnitas taco was also really delicious. It wasn't dry at all. Everything was on point. The tacos were so big too that I could barely finish both. Everything I ordered came out to under $10. So for the value this place is on point.   Anita's Mexican Grill is truly a hidden gem. It's fantastic and I only wish I had gone to visit again on my way back to Miami. Who knew there was great Mexican food in Charlotte? Do yourself the favor and check this little place out. You won't be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "6PWUTlb2hRu0SlzcE3IX0A"
  },
  "eW2CDxFVuVNMxHZ15kymdA": {
    "date": "9/19/2018",
    "text": "I think this spots pretty good flavor or wise. They went up on prices AGAIN. so that will have me just calling in my order at my favorite mexican spot more often now. The enchiladas are a 6 compared to others but the fajitas are good and they give you a lot of food. DO NOT GO DURING LUBCH UNLESS YOU HAVE AT LEAST AN HOUR FOR  WAIT TIME.  THE LINE CAN BE OUT THE DOOR 12-2. I'd suggest they get some type of iPad to help deliver the order faster to the cooks so that the one cashier can only take orders and not walk back and forth every single order *rolls eyes that bothers me every time. They'd make more money in that investment.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "R0fPEYYTZbRolLAWLw-KbA"
  },
  "0L2cX-vheYXSZKZ7rNBa5w": {
    "date": "5/6/2018",
    "text": "Once you get to this place. You might seem concern about the location, because it is in a gas station shopping center. Went for lunch and it was packed, but worth the wait. I got a shrimp chimichanga. It was so good. Even though the wait and the seating are my only complaints. I would go again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "qxsZVBR1AEuMStHxr3UQjQ"
  },
  "i7NsN9xVhsio-U60xeBkTg": {
    "date": "12/10/2017",
    "text": "I just stumbled on this place while getting gas next door and it was amazing..i ordered Nachos Locos and a Big Burrito and you know I thought it was going to be small like Taco Bell or something. I saw the guy making an order and I thought wow he is putting alot in the take out box so I asked the nice lady at the register what was he making and she said he was making my order, I tell you my mouth dropped wide open when she said that. The Nachos Locks has both beef and chicken and it was so fresh and when I saw him make the Big Burrito it filled the whole take out box from corner to corner and it was huge. The place is clean and nothing but smiling faces and you can see in the back while they are cooking too. Food is fresh all day and you get a bag of chips and salsa with your order. I am definitely coming back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "iyyKX0hXKh74vq-JGWA6GQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Wow so much on one plate",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iyyKX0hXKh74vq-JGWA6GQ/o.jpg"
      },
      {
        "img_id": "2clmBywaLX6fAhalnjWhaw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. This is awesome",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/2clmBywaLX6fAhalnjWhaw/o.jpg"
      }
    ],
    "user_id": "VbmKgukVl-bjBdZP8xJ03g"
  },
  "RXT0EIkadxgkYNbB-_NLrw": {
    "date": "4/2/2018",
    "text": "Don't judge a book by its cover. I wasn't expecting much from this restaurant upon first walking in after seeing all food served in to-go containers but they changed my mind as soon as I got my food. My boyfriend's enchiladas were okay but their authentic tacos are INCREDIBLE! I got 3 and woulda probably been okay with one because they were LOADED with meat. I'm extremely happy with my visit",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "E3mCk96074hxerCtoknGRg"
  },
  "gWd_ugcyeDRk8hdYLzqEzg": {
    "date": "5/12/2017",
    "text": "Average food for a budget price. Some folks love it, i think its very ordinary.  Also, they microwave food in styrofoam containers which we know releases cancer causing chemicals into the food. I pointed this out and their response was...tell \"them\" not to make it if that is the case. Very callous attitude to a serious health issue.  Not trying to hurt a small business, just trying to get them to be more sensitive to heath issues and customer sentiment.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 0
    },
    "photos": [],
    "user_id": "F2so2eTA3e7OWFTSfZCcSg"
  },
  "iK5IiVTc0SQ7YyDCB_qRRw": {
    "date": "11/12/2018",
    "text": "HIDEAWAY GEM! It's so good and hidden by a gas station.. ppl are nice and good is so good.. taste authentic. If only they sold margaritas",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "X5_gsaiwjtBLrC8Vh9RRwQ"
  },
  "gp3SPoxr1bWIze7bacC8ag": {
    "date": "9/13/2017",
    "text": "I liked this place. It was a nice spot for a quick lunch. It wasn't costly. It was fast and filling. You get a lot of food for your money.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KUZ8w538GlVDrfrmex2zhw"
  },
  "fcASEh6fVLhKNtNBNxFzRA": {
    "date": "11/27/2017",
    "text": "Talk about authentic! I've been desperately searching for great Mexican food at a reasonable price.  Thanks to my best friend Yelp, I think I found a spot. I had the burrito and quesadilla with rice/beans. I thoroughly enjoyed every bit of it. Not to add the young lady who takes the orders is very knowledgeable about each menu item and does wonderful serving each customer. They tend to get really busy around lunch time, but  you won't wait too long for your food. I must add the portion size and prices are a win!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "OJslVwyF75-er8hqgGdtGQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/OJslVwyF75-er8hqgGdtGQ/o.jpg"
      }
    ],
    "user_id": "vArMAyRNQyzDL-pnWJRvjQ"
  },
  "s9yJ69E7e5c-MOYOt2A0ww": {
    "date": "10/18/2018",
    "text": "Great food with vegetarian options!! The mole sauce is top notch- always ask for extra on your enchilada to dip chips in! Wish the salsa had a bit more flavor but can't complain too much about free chips and salsa. Recommend arriving right when they open as there is usually a line out the door- totally worth it though!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "0aSForENpZ2r52bMR5nP_w"
  },
  "OIuR74ykZe7KahTo44EVkg": {
    "date": "4/29/2019",
    "text": "Nope didn't earn my business. $10 for a rice bean lettuce guacamole burrito is literally the highest price ever. I should not be charged the same when I can't eat half of the ingredients. Also the burrito is not even rolled up to eat by hand. Literally one of the worst. I'm from Socal and appreciate a good burrito. I won't come back based on customer service alone that I was charged so much for so little items. Insane!",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BsagvgCEnQ41Sn5Kds5h4w"
  },
  "th-iHTXSsxFS1Naf8_6qmA": {
    "date": "3/25/2018",
    "text": "No way in heck I find this place without Yelp. A customer bailed on lunch because something came up. Checked out Yelp since I was by the old Hive. This place came up roses on reviews.   In a gas station strip mall next to a Subway. It looked closed from outside but opened the door and the line was to the shaded door. Someone in front of got the arroz con pollo and I will get that next time. I went with the carne asada tacos. They said it would be 10 minutes but it came out in 5 maybe. Cheesy and super flavorful steak with great seasoning. A perfect little bag of chips and a couple of salsas. Have to find a reason to come back soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "hVidDZUvOiy3xl0v3WKJlg"
  },
  "26gBO7mhRLYXoL745CPJaQ": {
    "date": "10/8/2018",
    "text": "Tacos were good. We had the Al Pastor and Carne Asada. Also got the grilled chicken salad (#7) because girl at register told us all the veggies were grilled (fajita-style). However every single vegetable in that salad was raw; raw mushrooms, raw bell pepper slices, raw onion slices. The grilled chicken was good (except for quite a few joints/gristle bits that I had to keep eating around) but it was one of the most disappointing salads I've ever had besides that. Everyone else enjoyed their food though, but if it hadn't been for that, I'd probably have given fewer stars. Bonus star for offering the little bags of chips with the salsa free with all meals though.  Bottom line, if you're nearby, it's a solid option with good tacos and burritos. But not something I'd go out of my way for. If I every make it back over there, I might make a point to ask for grilled veggies like it supposedly had and try the salad again.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "qRfMtCMCzdJ28wzc6wJCcQ"
  },
  "iluMVb7_5LRYYGxDZSQsLA": {
    "date": "4/10/2019",
    "text": "This is a hole in the wall, but they have the best tacos in Charlotte. Everything on the menu tastes good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rFF67Ipb9FtdpivLSd8aDw"
  },
  "NgCG2l7AQga2a1ExpP_ifg": {
    "date": "10/16/2018",
    "text": "Got carnitas tacos. All delicious. Refried beans were topped with queso. Rice was well seasoned. Traditional corn taco soft shell were great with lime onion and cilantro.  Staff is very friendly. Quick service.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dRquhUg82y9sSvt3AGUDEg"
  },
  "gse5DyF7PLB5b-zqdSrdkQ": {
    "date": "3/20/2017",
    "text": "An unexpected gem in this small strip mall that is fronted by a gas station. I had low expectations until I read the reviews and then decided to have lunch here. Good choice.  Inside, the place was full with locals as there are a number of office parks nearby and the firefighter training facility. Busy.  I chose the number 10, which is a burrito and an enchilada, served with rice and chips. It didn't take long until my order was called out and I was able to dig in. A very good portion and very tasty. The chicken was moist and flavorful, the sauce over the top was great. And the last few bits of rice scooped up what I couldn't get with my fork.  Soda fountain as well as a cooler with Mexican soft drinks.",
    "rating": 5,
    "rated": {
      "funny": 3,
      "useful": 10,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "xgUSAOa1mtdMYOZj0SkPrw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Number 10 at Anita&amp;#39;s Mexican Grill in Charlotte",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/xgUSAOa1mtdMYOZj0SkPrw/o.jpg"
      },
      {
        "img_id": "2Bn89feSGfa--76Vn6AETw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Anita&amp;#39;s Mexican Grill in Charlotte",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/2Bn89feSGfa--76Vn6AETw/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "XLx-1t2Gpl_gehx4M_ID5w": {
    "date": "1/23/2018",
    "text": "So, here's the thing: I'm not exactly sure who Anita is, but people are out here clamoring for her food.   For the past few years, my heart has belonged to Miguel's for all my Mexican food needs. When I had to work in a different city for a year, this place popped up on the scene and a bunch of my former coworkers began to sing her praises. When I came back down to the city, they basically forced me to go see Anita.  It really is a good place to eat, y'all. I see why it's so popular. They have a chicken soup that is absolutely amazing, if you're sickly or just want one. It's kind of like a fajita soup almost because there are a ton of veggies in there. The red enchilada sauce is delicious and I really, really love their hot sauce. It's got great heat and lots of flavor as well. The taco salad is another one of my faves. The shell is always crisp and tasty. If you like chorizo, give the choripollo a shot. It's a dish with seasoned chorizo and chicken over rice.  I am not a huge fan of their refried beans or rice, their chips aren't usually salted and I didn't love the quesadilla, but they've got SO many other things to choose from. I really don't mind going with other things. Not to mention, their portions are huge. Plenty of leftovers, if you want to split a meal up.  The service is always fantastic. Even if you have a large lunch order, it's filled relatively quickly and I've never heard of an order being incorrect with our crew. They have a lot of drink selections as well. Their sanitation score stays high, the line is often out the door and parking can be atrocious if you go anywhere from 12 noon until around 1:30 in the afternoon. There's not a lot of wiggle room inside because they made room for seating, but it's worth it.   Make sure to keep the door closed behind you if you're the last one in the line and once you order, if you're getting food to go, slide over next to the drink machine and wait it out over there. They'll call you one way or another. Sometimes they pop out of the door on the side, other times they'll lean over the counter. Keep your ears alert.  In short, my fave place is still my fave, but Anita's is solidly behind them. No question.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ttZSRwCZiFMXwUO2Vr9pBg"
  },
  "SxLNpv9gzmbOwH6TIN9ZBQ": {
    "date": "3/13/2019",
    "text": "Borderline Average Good not great. 3/5 stars is about right. Still struggling to find good Mexican food in CLT. Nice people. Not hating just keeping it 100%",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JOacTztc8INoMyquiyp6xA"
  },
  "5RQajFmbOztAvhMff0_DPg": {
    "date": "12/13/2017",
    "text": "The food is fresh, plentiful and filling. I ordered three tacos which were delicious. I couldn't resist guac and queso, too. I agree with the poster who said the food was ordinary. With that being said, I would eat here over many other Mexican places in Charlotte. I would come back again since I work nearby. The seating is limited so I would recommend planning to take food to go. You can't be fancy all the time!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "vCEqpO9dSWYiIJtt7Ftnrg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Guac, salsas, sour cream and queso",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vCEqpO9dSWYiIJtt7Ftnrg/o.jpg"
      },
      {
        "img_id": "vBRm5YcmFamgGejsB-AbeA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Three tacos, covered in lettuce and cheese. I recommend skipping the lettuce.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/vBRm5YcmFamgGejsB-AbeA/o.jpg"
      }
    ],
    "user_id": "mcJ-A0OGmiWZGBbdWPMfrw"
  },
  "379GoKY_LkO-vGa7OolAvg": {
    "date": "5/9/2017",
    "text": "I went here for lunch and couldn't have asked for more. Service was fast despite the lunch time rush. The food was authentic and there were a wide variety of choices (all at a low price point). I decided to go all in and order the crazy burrito. The crazy burrito was $7.95 and was honestly the largest burrito I've ever seen. Staff let me try it with beef and chicken. It also had avocado and grilled vegetables in it. It was so large that I could barely eat it all.  This restaurant is the real deal. Go and check it out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "TOu23W_GxUO6g5ZuCUidWQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/TOu23W_GxUO6g5ZuCUidWQ/o.jpg"
      },
      {
        "img_id": "i4hByaBKIVBqPWjGXAkJ9A",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. 21. Crazy burrito",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/i4hByaBKIVBqPWjGXAkJ9A/o.jpg"
      }
    ],
    "user_id": "fcJ9JoxCnZ09QB6RqVx-dw"
  },
  "LE_s3rFrjBpKDmP8sexcvA": {
    "date": "1/18/2018",
    "text": "I'm very hard to please when it comes to Mexican food and street tacos. I honestly like this tacos but they can be a bit too salty sometimes. I had it twice already for lunch and the pork was flavorful but salty. The rice the 1st time was also salty and for me to say it it must be, I like salt. The green sauce helps even the saltiness because it's doesn't have salt so it works out. The pico doesn't have salt either so you can mix it in and even it out if it happens to be too salty. I had the Al pastor and stake tacos with the corn tortillas. They are huge and they aren't shy on stuffing it with meat. I could do a whole taco out of what was left on my plate. The corn tortillas are pretty good. The cheese dip is pretty good too, not very spicy so if you have kids they could eat it too. Chips tasted a bit burnt or cook in old oil. Bit over all it's pretty good stop to grab some tacos.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "pmfK40_O6VXy1UPNBwmsOg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/pmfK40_O6VXy1UPNBwmsOg/o.jpg"
      }
    ],
    "user_id": "KZV8cpBu4Ax1bZMucV3_Ww"
  },
  "XJAg8QZG7FQGorfOohgRZw": {
    "date": "3/15/2019",
    "text": "It is almost impossible to find anywhere decent to eat on the west side. Save yourself a lot of trouble (and indigestion) by making a beeline to Anita's! This is not only the best Mexican restaurant on the west side - they are the best, period! Line out the door? Happens all the time! The staff is always so kind and patient.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XL0YUldUC3rFGwlckU_rpQ"
  },
  "9MeiU3P-bxoBaqjYuxybiw": {
    "date": "11/3/2017",
    "text": "Oh man! What a treat. Luckily this awesome little lunch spot is right by work. I listened to the Yelpers and took a late lunch this day. I went at about 2pm... lines were still long but went quickly.   It's not the nicest place around and that's for sure. BUT these taco meats are loaded with mouth watering flavors. There is a burst of goodness in each bite.   The lady at the counter was quick and new what she was talking about. I tried to order one thing and she told me it takes like 15 minutes. I immediately changed my order because I had to go back to work. It was much appreciated.   This place could be my every Friday lunch, we will absolutely be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "QFtcFkrpsPVhx91b8veWtw"
  },
  "YpL9lwxyZy9lVAHZENKODA": {
    "date": "12/27/2018",
    "text": "Popped in here with my crew during a couple hour layover at the airport.  Such tasty authentic Mexican food.  Restaurant doesn't look like much from the outside but it's worth it. Definitely going back next time I'm in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wiN-qC1GjT2lArSw3K5t0Q"
  },
  "4yw8zLv236IldpeRzkyYEw": {
    "date": "1/1/2019",
    "text": "Being Mexican-American I can tell you that sometimes it's hard to find a Mexican place where their food tastes like your mama's cooking... this place is definitely legit. Their food is authentic and served quickly. Highly recommend!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OIZjVia9PskckV7mO2JRBQ"
  },
  "89TpWJd-nLURZJ2i5YqmUg": {
    "date": "5/21/2018",
    "text": "Pretty good, but the Chimichanga was mushy not crisp like a chimi should be. Almost seemed baked at best......  rice and beans are good! Chips not very tasty at all and same for salsa",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mRvP6_HWwRiisM3NiNOG5g"
  },
  "kXrYue-ZfHbLuLSglzbkpg": {
    "date": "12/27/2018",
    "text": "So over Christmas break I decided to try out a suggestion from friends on authentic Mexican food. I was told that Anita's Mexican Grill was a good place. Now when I got there, it was attached to a gas station. The only other place I love that's attached to a gas station is the S Blvd chicken spot inside the Shell. Anywho (in my Cam Newton voice) I went inside and noticed how crowded it was. Surely something had to be right. Hoping it was the food that had the people almost out the door, I quickly realized that it's the food and the flavors. I enjoyed a chimichanga with rice and a guacamole salad. Super cheap and when I say everything was flavorful and fresh. My Gosh! The line moves quick but there is limited seating. They are only open for lunch and you have to get there early or they fill up quick. Every meal is served with chips and salsa. If you want to venture near the airport, I'd suggest you head over. You will be really amazed at how these small mom and pops are winning over people vs the main stream places that people suggest for delicious Mexican cuisines.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aoQWylrc1PEvj9PdtQXcsQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/aoQWylrc1PEvj9PdtQXcsQ/o.jpg"
      }
    ],
    "user_id": "Vpx330zfhfNMRSY3KIOp8w"
  },
  "vM-6q47pSzMtmODSLQJeew": {
    "date": "12/27/2018",
    "text": "I have not had anything that was not good here. There food is really good. Recently I have been eating the chicken soup with no chicken and veggie quesadilla. Not 5 because you can not call in food, have to order there.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SVTbyckAlbQGDjICm5alhQ"
  },
  "0bqiZgEmQfpxqi9AADcNLQ": {
    "date": "2/1/2018",
    "text": "My friend told me about the \"super fajita nacho\" and been wondering when I would get to try. Swung by on way home and ran into my friend.  Took my dish home with intention of sharing with husband,  he's barely getting 1/3 of it. Even the sauce is delicious in the bottom of the foam container. Will visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "sVLv9w_6bGQDwuGt5HcHEA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/sVLv9w_6bGQDwuGt5HcHEA/o.jpg"
      },
      {
        "img_id": "gTEf_D2bd8hG4Atj8lX5QA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gTEf_D2bd8hG4Atj8lX5QA/o.jpg"
      }
    ],
    "user_id": "UWi1rri1YdE-dGNWAvR_jA"
  },
  "DolwcYmuG8QTFb3EuBnHkQ": {
    "date": "10/21/2018",
    "text": "Best kept secret in Charlotte! They are amazing here so fast and amazing food! Me and my husband eat here every chance we get!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7bltkfpfOUyFZulOxHDHqQ"
  },
  "-R1TYgGMkzmZcNsIkpzsfA": {
    "date": "3/21/2019",
    "text": "Damn delicious if I can come up from a Taco coma!  Overstuffed everything and food comas a plenty.   Be prepared to wait in line. No Joke--this joint is gold.   We waited but it's worth it!!  Only open for lunch 11-330 M-f and 11 to 230 on saturdays.   Thanks!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "d3MsqOFloZz0ciPIsiWLkA"
  },
  "20q9GBLMJ0K2NqdAl2l83A": {
    "date": "12/1/2018",
    "text": "Yes, they are only open for lunch, tucked away in a stop mall by a gas station out near the airport, there is only seating for less than 20 people...but this place is a must visit for locals wanting filling tacos at a bargain price.   No reason to get all poetic, just get in your car and order takeout. Maybe you take it your food to watch the airplanes land or you stop by before or after a flight. Regardless, make sure you have an appetite and tell your friends. My buddy who moved from Brooklyn said he was dreaming about his food a week afterwards and went back a few days after our weekend visit. This place reminds me of tacos spots in Houston that are a dime a dozen, but in Charlotte this little place certainly stands out.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "69RmCqx0_ZUYykoafgfURQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Tacos!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/69RmCqx0_ZUYykoafgfURQ/o.jpg"
      }
    ],
    "user_id": "pZioOLzVNpxyEVchL6LLsQ"
  },
  "hHkPqUzLURUtinAeOzo2Yg": {
    "date": "8/28/2019",
    "text": "Great food great portions. Very pleased the first time and we have been back multiple times. Always good",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jeE5mCNT-Wq_HQa71_RXDg"
  },
  "1txxGSYj2LstePo1w2rMYQ": {
    "date": "10/7/2018",
    "text": "I found this little place and it is located in the BP gas station off of Yorkmont Rd so you could easily miss it. I went around 11:30 and already knew there was going to be a line out of the door based off of reviews. I didn't have to long of a wait to get to the counter to get my order taken though I would say 10 minutes. Then I got my food in about 10 mins. They move very speedy for the capacity of people they are handling. I had the Speedy Gonzalez which was an enchilada, taco, and rice, salsa and chips for only $6.50. The food was great, pretty authentic tasting to me, and a great price.   It did start to die down closer to 1PM. Definitely check them out if you want some good mexican food for a great price .",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "fA_II1MBOoSgWuCB27n4Jw",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/fA_II1MBOoSgWuCB27n4Jw/o.jpg"
      }
    ],
    "user_id": "jt3v30nfw7ZGfQQd-XZhzA"
  },
  "LRP0JjJtcOYh97GCIOXdGA": {
    "date": "8/5/2019",
    "text": "I know, I know, I know yall been waiting for Dave's hot food reviews. Look here. I ain't got much to say but if you ain't vist this place yet you really really missing out! Food is hot and tasty Asf. Haven't been here in years but I tell you they still treat you like family. Has gotten a little packed recently but shoot that just goes to tell you it's good food and great customer service! Love going here when I'm on this side of town. Sucks they close at around 3 so gotta fight time to get there lol. Ps. If you love spicy sauce ask for the homemade spicy sauce it's bomb (bomb emoji) (fire emoji)",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "vu06KYBZNNks4gsfDqnHNQ"
  },
  "LR47cpm6-HohnlKQaVG6Sw": {
    "date": "3/12/2019",
    "text": "I saw all the popular reviews and figured I had to try this place and wow I was amazed. You get a lot of food for the price I ordered a steak taco, al pastor and a side of rice. It gets busy during lunch hour",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "lHheLat7p70CrIAnTPhh-A",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Tacos",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/lHheLat7p70CrIAnTPhh-A/o.jpg"
      }
    ],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "jgxkHoLh8XmPCaM76uTU7g": {
    "date": "8/14/2019",
    "text": "I got the chicken enchiladas, steak burrito and rice.  The enchiladas were incredible and will definitely earn numerous return trips.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvzWMkr1YsULy779_9txAg"
  },
  "ssgRGJ08TvmI9NRbfNguLg": {
    "date": "6/25/2018",
    "text": "Incoming terrible pun alert: I'm craving Mexican food and 'Anita' fix!  (hey, I did warn you by saying it would be terrible) This place consistently has lines going out the door for good reason.  Yes, it's located in a small strip that contains a BP gas station and laundromat but don't hold that against it. It's small on space but more than makes up for it by producing hefty portions of delicious Mexican food rapidly. Please note that Anita's is open only during the hours of 11 am - 4pm Monday through Saturday. So get in, where you fit in folks.  The menu is located right above the cashier and some items will be scratched out for the day, depending on availability. I've heard that some menu items can take longer than others, for instance, shrimp fajitas.  I've had the tacos - grilled chicken and carnitas and they were HUGE. None of those boutique-sized portions found at the tex-mex restaurants around town. You can get them traditional (with onions and cilantro) or American (with lettuce and cheese). The tacos can be ordered in 1, 2, or 3 portions. With each taco order, you also get a complimentary bag of chips and TWO kinds of salsa. The chips are not seasoned but they get the job done in scooping up salsa.  My last visit, I sprung for the chicken fajitas (I was told my order would take a little longer, but the wait wasn't that bad) which comes with tortillas, rice, beans, and the aforementioned chips and salsa. FOOD OVERLOAD and it only cost $8 plus change. Incredible deal. I literally got three separate meal portions out of the chicken alone.  As for drinks, they offer various flavors of Jarritos and your typical soft drink and sweet tea offerings. The menu is straightforward, nothing fancy. Just good food, served quickly and cheap. Whatever you order, you must pour a few drops of Valentina (the Mexican hot sauce) that's found on their counters. It's a must.  If you're in this area, I urge you to give this place a try. I know there's a Chipotle about five minutes down the road but consider passing up the frills of a fast-casual chain to support a small business producing consistent and delicious food.",
    "rating": 5,
    "rated": {
      "funny": 15,
      "useful": 13,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "WRskn5JvdZ6hr8pXS2gFXQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Chicken fajitas with rice and beans (they also come with tortillas, chips, and salsa)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/WRskn5JvdZ6hr8pXS2gFXQ/o.jpg"
      },
      {
        "img_id": "AqyI7G4sqNV3fW2AcdOPNQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Close up of the carnitas (American style) taco",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AqyI7G4sqNV3fW2AcdOPNQ/o.jpg"
      },
      {
        "img_id": "kKmU_DrK0Tu3K0us695MGQ",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. I promise there are two tacos (one grilled chicken and the other carnitas) underneath allllll of that cheese",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/kKmU_DrK0Tu3K0us695MGQ/o.jpg"
      }
    ],
    "user_id": "SBi0TYUSIrct8WSTyK6DFg"
  },
  "6Pslg5HK392quPegoCDElw": {
    "date": "8/6/2019",
    "text": "Nice little spot with Great food. Service was very friendly and fast. This spot is quickly becoming a favorite when it comes to Mexican food. The burritos are awesome!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-T-pfZDqm0pfknvWNPfCxw"
  },
  "_dhZBWgWaI8a8n4lLshuig": {
    "date": "4/30/2019",
    "text": "This place is a little gem food is soooo good! Only thing is you gotta catch them when they are open because they have some odd hours. Totally worth it t",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2UBm3O-sa8rUGwiwmpqTg"
  },
  "oZS8isDSvQ5y03U-DG-fwQ": {
    "date": "9/28/2018",
    "text": "I hate waiting in ridiculously long lines for food but 11:45 might be the sweet spot for service here. The line was at the door but I was in and out in 20 mins.",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 7,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "6xqhQJP8y_vWoRhCZWVULg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. #19 Choripollo...Chicken and chorizo. Tasty, a slight heat from the chorizo. Comes with rice/beans, corn/flour tortillas, chips and salsa",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/6xqhQJP8y_vWoRhCZWVULg/o.jpg"
      }
    ],
    "user_id": "QTa8pZizjqByJrNr9AVszQ"
  },
  "SDnvBKF816HmjrmnoMnHmw": {
    "date": "4/13/2018",
    "text": "I had heard great things about this place from fellow Yelpers and coworkers, so I had to check it out. It's only a minute away from where I work, so it's very convenient for lunch.   It's a an interesting location -- in the building that's almost part of the gas station. There aren't many tables, so it's probably easier to get your food to go.   We got the Pollo con Crema and the Choripollo. The serving sizes are huge, so expect to have leftovers. Both of our dishes were delicious. They were even better if you mixed them together. I probably liked the chorizo dish more, but both were very good.   This is a no frills, hole in the wall Mexican place serving up delicious food. Everyone I was with really enjoyed what they got. We all left stuffed. You get your food pretty fast -- within 5-10 minutes.   This place is definitely worth going out of your way to check out! You will not be disappointed.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "71he8MtVQ40CvpNsLcZGvA",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Pollo con crema without rice and beans",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/71he8MtVQ40CvpNsLcZGvA/o.jpg"
      }
    ],
    "user_id": "QGOtNZfasBwWCuawKjypYA"
  },
  "rSyKuGEl9iQqokWLGytmJw": {
    "date": "6/26/2019",
    "text": "Amazing food, a few small chairs and tables. We got a little bit of everything and all the good was great. Great nachos, tacos and quesadillas. Queso is amazing",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "AfoMST4w8NYNwimi0U7xPA"
  },
  "tnDCQj61zQ-_00CSyQUE6Q": {
    "date": "9/3/2018",
    "text": "I saw the reviews and had to try this place. Yes, it's in a gas station parking lot but it's really nice and clean!! The only thing that was strange was that I saw online that they were open at 11. I got there right at 11 and there were about 10 people already waiting outside for them to open. I decided to wait in line because I figured they would open soon. But, they didn't open til about 11:15. Luckily, the service was really fast and the food was definitely worth it.   The tacos are loaded!!! The enchiladas are delicious. Burrito is good and filling. Rice is fluffy and flavorful. The sauce is amazing. The salsa is good but could be spicier. Next time I'm gonna try something else. You can't beat their prices either.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "MeMtVkpaQKhOETZGc7ZWzQ": {
    "date": "7/27/2018",
    "text": "Anita's deserves an update.  I've been back several times and have enjoyed every single menu item. They are not just okay...this place rocks.   I've tried a little bit of everything and haven't had anything I didn't like. Plus you can't beat the prices and portion sizes here.   My favorites are the tacos...you're good with any selections. I also love the taco salad, enchiladas, rice and bean and of course the queso. Tip! Always add queso!   The staff is always pleasant and the place is always packed! If you see a line, just know it's worth the wait. I also love that they are open on Saturdays.  You'll want to try this place!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "dgBpH9HI8qK9Q6RrnIRyUA": {
    "date": "6/22/2019",
    "text": "After nearly two years I finally got to try this place and it is fantastic!  What may seem like pricy tacos, they are big and you get plenty for your money!  Lunch lines can be long but food is ready quick. Great little taco spot!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCRL4inyEgxXGLPiCJk1iw"
  },
  "wMc8mfvA-6_6UHIPfvx3jw": {
    "date": "2/12/2019",
    "text": "Authentic Mexican restaurant with fast service. Great lunch spot. Would recommend getting it to go during work lunch hours. Personally recommend the chorizo and chicken or the chicken with cream. Pro tip: get both and mix them.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "pBeNjksmGLPlBTaujOqiLQ"
  },
  "v9eWG2VgOSy4P1JV24omtQ": {
    "date": "5/9/2019",
    "text": "Tried for the first time, the reviews are True. A line outside the door, burritos and tacos stuffed with authentic fresh ingredients and once you place your order, it is prepared quickly. I had three tacos in soft corn tortillas. Carne asada, grilled chicken and chorizo served traditional style with cilantro, onions and lime wedges. My other choice of carnitas was not available as the gentleman told me it was slow cooked and not ready yet. All three had distinctive flavor and were very filling. A small bag of tortilla chips and salsa came with my meal with a drink totaled $10.00! The small dining and counter area with stools is very simple as is the rest of the decor. You're not going here for ambiance or margaritas just awesome food.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "gqs90N_P6CPkaGI0IjsePA"
  },
  "ZG02VI0-K_MIQTeA8Qti_w": {
    "date": "10/6/2017",
    "text": "Scott: How on earth do you even know about this place?  Me: Yelp. Duh (it's like he doesn't even know me sometimes)   This Charlotte gem is in a little strip mall right next to a gas station. Seriously, there are gas pumps right in front of the door.   The food- cheap and absolutely delicious. Don't believe me? Don't believe Yelp? Well, go drive by this place during lunch. There is always a line out the door. Don't worry, it moves fairly quickly.   It's not fancy. Your food comes out in a styrofoam to-go container with the lid cut off. It comes with a little bag of chips and salsa. Make sure to also ask for the green salsa. So good. I always have to get queso as well. I love the ground beef here. I will usually get something that involves a beef burrito (like the #4 which also includes a taco and rice). My last trip I decided on tacos- one chicken, one carne asada, one carnita. All three were really good and the portion size is big. The only problem I had was that I couldn't eat all three!   The place is small, so you might have to take your food to go. There are a few tables and a wrap around counter/bar type. If you want to beat the rush, I recommend getting here at 11:30.",
    "rating": 5,
    "rated": {
      "funny": 5,
      "useful": 13,
      "cool": 4
    },
    "photos": [],
    "user_id": "E43QxgV87Ij6KxMCHcijKw"
  },
  "o5bKMVChy1705LhF9TOJTQ": {
    "date": "10/4/2018",
    "text": "Senaia is right - they went up on their prices - A LOT, not just by a nickel or dime. Speedy Gonzalez was $5.25 but now is $6.00. Definitely need one more person taking orders.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "s4cki7AiOrOjb5r-ZpbJUw"
  },
  "jk3SPkku8vL8J3PFnDPhxA": {
    "date": "7/8/2015",
    "text": "Great food!  Friendly service.  It's not fast food so expect to wait 5-10 min for them to cook your order.  Close to the airport and definitely worth the drive.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "-ZUo50L0-CPx6g8KS9iTmg",
        "caption": "Photo of Anita's Mexican Grill - Charlotte, NC, United States. Carne Asada tacos with a side of Guac.  Everything else came with it",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/-ZUo50L0-CPx6g8KS9iTmg/o.jpg"
      }
    ],
    "user_id": "OLQi5qe8rg46nlXtr1S8qw"
  },
  "_Qg6cSPuSCiCQTUwVSqTOw": {
    "date": "9/2/2016",
    "text": "Great little lunch place.. Usually a little crowded around the 12:00 hour but I still pick this place as my #1 lunch take-out.  All Mexican food, good varied menu, friendly staff.. Also in a good location next to the gas station. I will always revisit this place...",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "olJsxWHifyJrhrn5o_8T-Q"
  },
  "BZJHyWfeZkg-rY2IQq_jTQ": {
    "date": "3/23/2014",
    "text": "When Mar Y Tierra closed, a small piece of my heart broke.  Lucky for me, Mar Y Tierra has been reincarnated in Anita's Mexican Grill.    Anita's serves almost the same food that Mar Y Tierra had - but adds some chicken and burgers as well - covering the grill part.  This is mainly a takeout place, with only a few tables inside.  To order, you walk up to the counter and they'll call out your name or bring out your order when its done.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [],
    "user_id": "8ziF9bL2WU9boE6du0yAIA"
  },
  "1hlr_R7xWMr7OyNZE9-1VA": {
    "date": "6/17/2016",
    "text": "Good food and they give you so much of it. Arroz con Pollo is my favorite.  Bed of rice, with grilled chicken mixed onions and some queso. Comes with flour tortilla, chips, and salsa on side.  It's a small place and gets quite busy during lunch hour but they're very efficient and move the line quickly. The lady at the register is very friendly and helpful if you have questions.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OY4AZyKI6Q1zjBD_KXxW9A"
  },
  "EEY8bhEIG5F8zsvppn_R_w": {
    "date": "1/9/2014",
    "text": "I don't hand out 5 star ratings all too often - this place is really close though! The price point for this quality of food is extremely competitive. Why spend 5-7 bucks on Taco Bell when you can get authentic Mexican food at Anita's?!  Honestly, their daily special includes a burrito, a quesadilla, AND rice for only $5.90! The fresh queso used for both items was delectable. I could eat that queso all day. Furthermore, this place uses fresh jalapenos, as opposed to those pickled salty ones you get at the chain restaurants.   I am amazed at their value, and think that this place is definitely going to stay around for a while. Good luck!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "DiKHjE69RiGneNqmgEtDzA"
  },
  "wiLCZRDAIKltP-OAbTamAg": {
    "date": "7/12/2016",
    "text": "Love this place. Lazy burrito is outstanding. Bare bones, no menus or photos but just delicious food. Really busy if you get there after 12 so go early.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p-CBLVlgMzuBN4We7L1qWQ"
  },
  "yVL2fe1xx8n0Z82XpH2TQQ": {
    "date": "3/30/2016",
    "text": "Read the reviews so decided to give it a shot and boy was I glad I did ! The food was absolutely amazing and  fresh  the service was great as well the cashier was super nice and   explained the menu to Me giving Me  me lots of options and letting Me substitute sides. Only downside is there isn't enough seating and I wasn't a fan of eating on the Styrofoam containers  but the quality of the food will make you look past that. Wish they had a full restaurant with bar  if so I could see myself eating here a few times a week.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oaCl7cv19ZXOSK21Hhh9GA"
  },
  "mwd_On8__RoP8OfuE-fq5g": {
    "date": "8/3/2015",
    "text": "Best Mexican east of Texas. The Lazy and Crazy Burritos are to die for and we came in at the end of the day. Service was great and friendly. Don't let the fact that they share the same parking lot as a BP keep you away. Hurry because they close at 5.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "O7Z6IMLQBnIEyfn6z6EhDg"
  },
  "h8wasiOhFb_nlBEvHfcXDw": {
    "date": "6/23/2015",
    "text": "This place is a hidden gem near my office. I usually get the grilled chicken salad and share it with someone at work bc it's so big. Long line during lunch hours but they serve you quickly.  Awesome and at a low price.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "gvBqdGVI9InvFXbNnN0lEQ"
  },
  "rOzGC41cfAMgS0OU8ftMyw": {
    "date": "4/2/2015",
    "text": "The food is authentic Mexican and very good. The prices are very good. The place was packed but it was worth the wait. They have basically any type of Mexican food you can think of.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "T_c-mzlOPVCVpxceLw5ZJQ"
  },
  "hJ7dbkQMr3tIdjK8RPIBww": {
    "date": "1/27/2016",
    "text": "If you're in the area it's a must to eat here. It's a very small establishment with limited seating but worth every penny. They give you generous portions for a decent price. I recommend the ACP #20!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OgLdkb8pCu5x9O_3OJHS0w"
  },
  "iA3YG5UNjQZWUT5JyfjurQ": {
    "date": "6/9/2015",
    "text": "What stood out the most was the delicious food and the low-cost. But after frequenting this restaurant on my lunch break for the last three months, the consistency and customer service has been superior. Never had to wait longer than four minutes for my food. The cashier knows me personally and I recommend the enchilada w rice and beans.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lnz0URfxQwkeYztWhq9qng"
  },
  "Ha3Jvh29L5PWXl7sr1FzrA": {
    "date": "9/23/2015",
    "text": "Awesome food for great price.  Signed up for Yelp just to review.  I've had the Crazy Burrito, Pollo con Crema, and the Arroz con Polo.  All were very good, but I think the Arroz con Pollo is my favorite.  Bed of rice, with grilled chicken mixed with mushrooms, onions and some queso.  Comes with flour tortilla, chips, and salsa on side.  a LOT of food.  Don't let the location scare you.  It's a small place, and gets quite busy during lunch hour.  Usually have to wait 15-20 minutes so call ahead for takeout.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "-ttL4R2MV7gegTAZ-yMqDg"
  },
  "hBu7W9Z7eYWs5XBkw0hsOQ": {
    "date": "7/1/2015",
    "text": "This place is AMAZING!! Very small, so do not come with a large group. Tacos are amazing- get them with lettuce and cheese. I love the shredded chicken and carne asada. All dishes come with chips and salsa! I literally could eat this every day.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lxo21BGi-e3Ho8fz_DtViA"
  },
  "csASDbZlov0GuXt8AaBCaQ": {
    "date": "7/30/2014",
    "text": "I love Anita's and eat here often. The sombrero is great and the chicken soup is perfect everytime I order it. Each order comes with chips & delicious salsa. Very fast and the customer service is great too. I would highly recommend it for takeout. There aren't many places to eat near my office, so Anita's is a welcome addition! I'll post the menu here soon.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uPBdIJW1GrqBZ851BE_OZA"
  },
  "CK8cA54buwH5NVbRASnMEA": {
    "date": "9/25/2015",
    "text": "This place is one of my favorites when it comes to Mexican food!  It's not fancy or expensive, but the food is better than any place I've ever been!  The food is fresh, authentic and delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "spYhcEvnsAi3Tz43ZRpbvg"
  },
  "EW8YrCWhElofZswmAmimPw": {
    "date": "9/26/2015",
    "text": "Awesome street tacos. Meat is very well seasoned. Most importantly food is very well priced.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "6F3_mBc4chJwOjV7DHER9w"
  },
  "DsVkCf7N5NVqCwqL2y0_QQ": {
    "date": "3/21/2014",
    "text": "It's okay Mexican food at a cheap $.  The place is targeted at carry customers for the surrounding workforce.  At lunch time they have a good number of specials are $6.00.  You will still leave filled up though.  It good edible place, but not a real destination eatery.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "c-1biwACMAHTD4AtOlWnpQ"
  },
  "a-RYvE7sMyuyrLCMMeZBzw": {
    "date": "9/27/2014",
    "text": "Great food, people, and prices! I work nearby and love going there. The only reason why it doesn't get 5 stars is, because it doesn't have Mexican drinks (horchata, Tamarindo... etc.) !!!! It would make it perfect!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uuadRvnYVWm2UoeZDz0zqA"
  },
  "eHNQk5CMt2hUnYWxgZvO4w": {
    "date": "3/30/2015",
    "text": "The food is great and the price is fair. Great for lunch. When you pass by doesn't look like much, when you go inside, doesn't look like much but when you eat their food, its freaking awesome. Inside its small and clean. I like #10-#6 but everything is great!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "8gjzc2Dy9ZM9JjAmUSlk4g"
  }
}