{
  "wAruSMFdOEQWbAaaGFRjOw": {
    "date": "1/30/2011",
    "text": "We asked our rental car shuttle driver for a nearby good reataraunt, this was his suggestion.  We found that there were NO fresh vegetable options, nearly everything was fried and loaded with grease.   I would compare this with any cheap roadside diner in California except with a southern menu......  The server was pleasant, but she could offer no help as to what to order as she was vegetarian and had not eaten much from the menu.  Not so good for dinner, maybe better for hangover breakfasts",
    "rating": 1,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 1
    },
    "photos": [],
    "user_id": "I-3BkQ25jPCbDRkXzr_TDg"
  },
  "tQNkybp6k3VJ5VMxoHdFPg": {
    "date": "3/13/2013",
    "text": "Come here for breakfast!!! It is nothing fancy but if you're looking for a great meal for a nice price Tryon House is the place to go. Get there early because this place get busy on the weekends for breakfast.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmAqQyaFli8H9LVGhGhR9w"
  },
  "ma4MnJUBk4yP8sGoSWjrfQ": {
    "date": "1/15/2016",
    "text": "I eat here often.  Located close to my office in Charlotte.  Food is always good and service is excellent.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "5e4zXIAKYllYt4dPd5fDIw"
  },
  "kOpLfRUfK6AoCBDCAW5SNg": {
    "date": "3/3/2013",
    "text": "Good food, good service.... Ordered the 10oz. Ribeye steak with fried okra and a side of Mac & cheese... Greeted with prompt service and warm chicken and rice soup... Moments later we received our drinks and after some cornbread, warm and well made cornbread. Approximately 10 minutes later we received our food. Prices are low and portions are fit for two.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2WyqC5wyyuxGr9iupncLCQ"
  },
  "gnj6YTldmMG2zj5-lj9HBA": {
    "date": "4/5/2014",
    "text": "Love this place! Good prices! The food is really good and the portions are huge. Average diner comfort food done well. The owners are Greek so they know what's up! I've had breakfast (best pecan waffles in CLT) lunch (steak salad comes with fries on it) and dinner (meatball sub is authentic as it gets). Their only downfall is they don't handle volume well and the staff gets stressed. You can wait awhile for drink refills and the check if they are busy. The food is worth it!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "CJV8aTHn4mz4Wp20SFhrxw"
  },
  "d99IdC8RfzVMobYPOkIOWw": {
    "date": "8/2/2010",
    "text": "I am completely a fan of this hidden gem!!  I was here Sunday for some hangover breakfast/lunch and it was full of church-goers - older crowd and families but what a great place.  I dont think I have been to a place in Charlotte where I think I am getting a great deal on great food - this is definitely that place!!  The meal comes with a complimentary soup to start which was a little cup of chicken and rice - very tasty.  I was dared into trying the hamburger steak which came with two sides (I got mac and cheese and fried okra) all for $7.95.  Everything was fantastic and so much food I couldnt finish it.  My friend got the special - baked spaghetti for $7.95 and it was also AWESOME!!!  This is a place I would definitely take my parents while in town - maybe it isnt a place for a romantic date...you get the idea.  Service was great - definitely a repeat place for me!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "htiVdsiY_rBmJc65aZ3YAA"
  },
  "5TDAzpGqWql1RlR_DR-S5Q": {
    "date": "4/14/2010",
    "text": "Any restaurant with a daily meat-and-two is my kind of place! Sweet tea and cornbread- what's not to love?  Only the locals seem to know about Tryon House. It's location a block off Woodlawn probably doesn't help, but they don't seem to be hurting.  This is another of CLT's many Greek-owned establishments. A lot of the menu is similar to a dozen others in town. That said, as a group these guys seem to have completely figured out the comfort food biz. After a rough day/week/month, this is the first place we head.  Meals come with complementary soup. More than once I've found myself wishing I hadn't ordered a meal at all and just gotten a bucket of that stuff.  Personally, I'm a fan of the chicken parmesan. Enough food to feed a linebacker and right tasty. My wife's favorite is the pasta with garlic and grilled chicken. She always manages to get a lunch out of the leftovers, too.  They'll ask if you want bread or cornbread. Get the cornbread. It's some of the best you'll get in this kind of place.  This is our place for family gatherings. They've got a big room and the staff seems to take groups with squirming kids in stride. It can get noisy if you're near the room, but not to the point of distraction.  The staff is old-school diner friendly. Good chance you'll get called \"sweetie\" at least once.  About the only problem I have with this place is the cost. More than once I've had an OMG! moment at checkout. That's mostly our fault (the chicken parm I love is about the most expensive thing on the menu), but the 7.95's and 8.95's on the specials menu do seem to add up awfully fast when there are three or four of you.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 5,
      "cool": 2
    },
    "photos": [],
    "user_id": "mBQGhdCWRiY8-RxXtKmiNA"
  },
  "Zcy_4PdPY7Lo33hPKrGRvA": {
    "date": "7/26/2015",
    "text": "My fiance and I recently visited charlotte, NC and found The tryon house Restaurant very close to our hotel. first, I have to say that the staff were superb. We are from New York City and have to say that the food was excellent. even vegetable soup which i am usually not a fan of was absolutely delicious. The entire staff treated us like family and will definitely return. The prices also are considerably cheaper than here in New York City. I highly recommend the Tryon House Restaurant to everybody.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6jrAAawFfvYRyWMOuWzEQ"
  },
  "WWkcPGUvAtjLnKbRQN8jyQ": {
    "date": "7/22/2012",
    "text": "Breakfast was good.  Hubby had the breakfast.  I had grill chicken salad. it had a very generous piece of grilled chicken that I could not even finish it.  It was good.   Must try the Belgium waffee next time. It looked huged.  The service was good.  The Interior is very nice.  Will be back again !",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZW-XoteNlRuuK-19q1spmw"
  },
  "iJBBVlhguK2Yg93nZhY6Ug": {
    "date": "2/7/2013",
    "text": "Friendly,fast good breakfast - right price. Music overhead 3 Dog Night- \"momma told me not to come\"  Coming next time thru town!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vc9sHH_7LzHEKm-sAW6JHg"
  },
  "ReOeecbTDGzXjT25zgmOCA": {
    "date": "2/4/2014",
    "text": "We ordered our food through a third-party delivery system. Our food arrived an hour earlier than we asked for it, and it was missing one of the Chocolate Spoon Cakes we had ordered. I called to speak to the Manager, to find out why, and he told me several times that it was not his fault. Moreover, when I challenged his inability to even be polite (I work in Customer Service, I know how to be nice) he told me, and I quote, \"It was not my fault, why would I apologize?\" Because, you messed up my order, that's why, and then, when I asked about it, you talked over me and and called me, \"honey\" in a condescending manner, and kept saying, \"let me explain\" before repeating the same thing over again. How can the copy I received be perfectly clear, but somehow changed through a simple faxing? Perhaps the Manager should learn how to read.  If I could leave 0 stars, I would. Nobody with such horrible customer service should be in the food industry.",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "d8sBZmDLY3aIRpnFdN1-sA"
  },
  "wunRzmBM4bMEVzr5sHGzgg": {
    "date": "12/19/2014",
    "text": "Food came out fast, friendly staff. Breakfast was good but I think it was precooked. Came out too fast to be cooked by order. Otherwise was good.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6Xncgc6sprBVVy3JkbpQg"
  },
  "Qzo8qepoE4tbgfDZq-wipg": {
    "date": "9/15/2012",
    "text": "I try to make it here at least once every other week on Wednesday for the turkey &  dressing special.  The portion size is enough for 2 meals.   Service here is always good and the food arrives quickly.  The only thing I don't like here is the brown gravy they put on mashed potatoes. To me it has a strange taste. Otherwise all the other things I've had are delicious.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XRqmGwmeCdJINepB6wJfVg"
  },
  "EflHxgIQa_n13qXUzuY56Q": {
    "date": "12/7/2014",
    "text": "Great local place for breakfast!   Traditional breakfast specials at a great price and my favorite eatery ANYWHERE for livermush and grits!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RuBNk3pjetn3deQXSWlhNg"
  },
  "8e8Uysb7iHu9U8TyTd5gjQ": {
    "date": "11/16/2014",
    "text": "Excellent food, excellent service, reasonable prices. This locally owned family restaurant is a can't miss. The service is friendly and prompt and the owners are typically in the restaurant ensuring their guests are happy and full. We have tried several dishes and been happy each time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "plueeNNyF1qKLcPfWKZ1Cw"
  },
  "xOVchDDtTpcHhX8nfS2ncQ": {
    "date": "11/20/2014",
    "text": "Try the breakfast, it is cheap and good, that is a simple as I can break it down.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4Cbv6clHYzAZKq-vwik9qg"
  },
  "gElNtneKdpYyLNgdr6obAA": {
    "date": "11/18/2011",
    "text": "Excellent prices. Decent food. Nice staff. Clean and friendly.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "715N9CM6qrRp_lLzgp79rw"
  },
  "S7lta3WY7CAGoPJzBHX8Yw": {
    "date": "2/15/2015",
    "text": "Good diner food at a good price. All tastes good. Just wish I could get breakfast for dinner sometimes. Wait staff go out of their way to remember how you like your drinks and what you drink, after a few trips there for dinner, the staff new what my family liked to drink, our drinks hit the table before we even asked what we wanted to drink. They remember I don't like lemon in my drink. And they have even gone so far to remember what items my family doesn't like on our sandwiches or salads. Deserts are good. The wait staff is great!!!!!! Love them!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "LSDFWfjJaHVyOk-zRBFEjg"
  },
  "1PcDqVnXBzkg9RTD_MA9lg": {
    "date": "3/27/2016",
    "text": "Very clean.  A pleasant and comfortable decor. I had eggs over easy with bacon.  Scrum delicious! Also had the buscuits & Gravy VERY tasty.  Daughter had the French toast.  Also yummy!  Fast friendly service.  Great place for a quick delicious breakfast!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "awpeuzVyYQuAtc6nXO6EPw"
  },
  "86sRuyZmyxX4rFkWxt-Sog": {
    "date": "5/28/2013",
    "text": "Literally the Closest tie for best Pecan waffle ever, as a matter of fact I wish I hadn't inhaled it so fast and had photos because it was amazing!!   I had the huge breakfast plate here which came with a choice of Waffle or Pancakes, Three eggs, and Choice of Sausage or Bacon.....I have to say ive have 'huger' deals but the quality was still good and tasty.  The only thing I did not like was the fake scrabble egg stuff that they use, I COULD be wrong but I have eatin alot of eggs and something wasn't right about them they also had no seasoning.  Overall its a fun local place that could use a little sprucing to their menu but overall I can complain.  xoxo",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MVuYdoNfgwLUNqm4QJgFZg"
  },
  "-1s2lXsSLxyjm3hlzn1HGw": {
    "date": "5/22/2013",
    "text": "Actually a really good place for breakfast! Not been there for anything other than breakfast, so my review is limited to that only.  Good size portions, decent quality, fast, friendly service at reasonable prices. What more could you want?  Recommended!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "QYobbHEmhLGuS6QDqVRTLw"
  },
  "I2vkX6FdbWNHKuVgercD6Q": {
    "date": "10/12/2011",
    "text": "Another Favorite of a friend, so we had dinner here last night.  This was my first time even seeing this place.  Many times my friend told me before we arrived that we would be the youngest patrons there, which I guess means I won't be falling in Love tonight.    First we had \"Soup\"! Chicken and Dumplings just like my grandmother used to make was the complimentary Soup last night.  The soup gets 5 stars for that kind of soup!  My friend (the other One) had the Greek Burger...it looked good, Onion, Tomato, Feta, wrapped in a Pita, wrapped in foil.  The Fried Squash was good, thin batter, though slightly over cooked or over warmed 3.2 stars.  My Spaghetti was well drained though as usual for these diner type places over soaked, so the pasta gets 3.2 stars.  The meat Sauce had great flavor (better than MOST Italian restaurants for half the price) and great consistency (not watery thin) though there could have been more of it and it was very low on meat, still gets 3.8 stars.  The Greens had very good flavor and had bites of  Onions cooked in with, nice touch!  The service was GREAT!  All of the Staff were friendly and seemed GLAD to be there!  How do you get on TWO of my play lists with one song?  Play Blondie! !  !  That's How!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nrMtuBOjOv_R3ICwl7EeTg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nrMtuBOjOv_R3ICwl7EeTg/o.jpg"
      },
      {
        "img_id": "Lucd58x00WjGTOrX3uOFXw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/Lucd58x00WjGTOrX3uOFXw/o.jpg"
      },
      {
        "img_id": "a3F5nXHV0m0mjQe-fMAQXQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/a3F5nXHV0m0mjQe-fMAQXQ/o.jpg"
      }
    ],
    "user_id": "Ug0ujy9-jd0Oc2nk3KIotA"
  },
  "H8IoulHS4jJOlUYLG5_3JA": {
    "date": "7/28/2011",
    "text": "Tryon House is a typical southern style diner. The food is well prepared and inexpensive. I am a big fan of fried southern foods, and we all know frying isn't exactly about the freshest foods. Tryon House does a nice job by frying their foods in hot oil and allowing the food to crisp perfectly.  The atmosphere is a normal southern church-type crowd. My biggest disappointment with Tryon House was the frozen veggies. I can make frozen vegetables and put some butter and salt on them at home.   If you're in the mood for run-of-the-mill southern diner food, Tryon house is affordable and well put together. You won't be surprised with bad food. You also won't be blown away.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "cx4-WfPgm1Jxurtd83I83g"
  },
  "qlIDcA8kV2hUbeoj-lqHSQ": {
    "date": "11/11/2015",
    "text": "Wow! Super impressed. The closest breakfast spot to my hotel was a large chain brand breakfast spot. I was about to go inside but I'm really trying to support local business. I found the Tryon house on the Yelp map and decided to walk the extra few minutes.  First impression walking in: clean, homey, family driven...  The restaurant was pretty busy at 10 am on a Wednesday. I ordered a coffee and the breakfast special. Coffee was PIPING HOT and here's the kicker. Received my breakfast in 3 MINUTES and it was HOT and FRESH!!!! I was so impressed! I'm in the airline industry and eat out daily. I'm used to mediocre, not hot food and mediocre service... This place shines! Mersija was my server and she was great! I highly recommend this place!! Please support local business!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "C8ZCuEHjzZb3f5rp4g-Wlg"
  },
  "rVRkAHSuUIEoZmWoyGF5Hw": {
    "date": "8/6/2015",
    "text": "The dinner was delivered on time, but i think the food just tasted OK.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "p3PuarMM4LVhxN04gtmy2A"
  },
  "Vg-onf6WESX_DPM5DPVvpg": {
    "date": "6/21/2016",
    "text": "Not bad for the value. Waitress mixed a special drink for the little one. They have pies in a case in the front that look good.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RlexCDCwWLdC9cDNPwGWsw"
  },
  "I8hhUO30FCe-3FbnJn_Xiw": {
    "date": "4/26/2015",
    "text": "Great food great service and NO WAIT on a Sunday at 11:00! The food is very inexpensive, huge quantities, and good 'ole diner quality just like I wanted. There was still no wait at noon when we left.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "hwEMANb6VdI_KTRCxR_38w"
  },
  "LlmmVpBMQP-8VvO2Dn_Chg": {
    "date": "9/20/2015",
    "text": "Great food. Try the meat ball sub. It was very delicious and large portions. Definitely a go again spot.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "yWYz8mDAkrqAqQCKEEvTdg"
  },
  "d7bO-jAWAzxONXcXzGpd9A": {
    "date": "6/27/2014",
    "text": "Needed breakfast in a pinch and this place hits the spot. Pancakes fluffy, hash browns crisp and grits creamy. Coffee is good too. Would definitely come here again.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "UHM0Y-aGdjJvtOBuwUmGWw"
  },
  "TbJ1PgVXcuVl8d7fonm0Wg": {
    "date": "8/28/2015",
    "text": "The waitstaff was great but the food had no flavor. My coworkers all seemed to love it so I'm not sure if their food was better than mine or if they are used to bland food. I will not return.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BaNkpjscB9iM4FCHjI0oAA"
  },
  "RMhV8DvL2cRCyWC2ENT50w": {
    "date": "9/30/2014",
    "text": "There should be more of these types of restaurants. For those of us who eat out a lot, dining becomes more of a practical experience, and this place could be my \"go to\" place everyday if I lived closer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l_FfgJlBJDr11N-xfepuRw"
  },
  "zdQjeeeNIJwuPKrD2K9s5w": {
    "date": "5/18/2016",
    "text": "Got here at 12.05pm to be told that they stop serving breakfast at 12pm No exceptions. Had lunch instead not great quality food and service wasn't very friendly,",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EmW4LOMTD3tAJ_tfhaHPGw"
  },
  "WfBYwAmTbcCUUdqFaKqacA": {
    "date": "6/29/2012",
    "text": "Great lunch spot, been there three times now and it is consistently good. A meat and two vegetables at a reasonable price and excellent service with a smile. They also provide a cup of the \"soup of the day\" to sample before you order. The pintos are always tasty. You will not be disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m3zaf-3roq01pL65snVfMA"
  },
  "sOGlHFKj1v-XN7zw9--AKw": {
    "date": "2/28/2012",
    "text": "We have had breakfast here a ton, and its cheap and good.   But last night we decided to have dinner and I think we madea  good choice. I got the Philly Cheesesteak and it was good! The bun was fresh and stood up to the steak without getting soggy or falling apart! Wife got the grilled cheese with bacon....great tasting plamento cheese only thing could have been hotter. But overall great taste. Fries or also good but don't get the onion rings they are  not good at least this day.   Server was great and made sure we had drinks and even gave us a to go cup!!  Check it out for a cheap dinner",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fc6JvJcRW_2QDwEWViRHfw"
  },
  "q4v2dF30RhSfgmp1QVa70w": {
    "date": "9/9/2008",
    "text": "Ok, tucked away in a little known shopping center, this restaurant doesn't seem like it would be worth the hassle, but take the chance. I was skeptical at 1st that a restaurant in a strip mall would have good food, but I judged too quickly.  They have southern fare, italian, american, etc, & everything I've had is pretty darn good. They have a different menu for each day of the workweek, & that means new specials each day. The meatloaf is well worth it & so is the turkey/dressing special.  The crowd is either the work crowd or an older crowd, but they know good food & the place is usually quite full. I've never had to wait long for a table so it makes this a quick lunch outing for those on the clock.  So don't judge too quickly on the Tryon House, because pretty much any type of food you enjoy, they'll have it.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DIyzt9Msz-lD4IlToHUFVw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DIyzt9Msz-lD4IlToHUFVw/o.jpg"
      }
    ],
    "user_id": "kjYbPkrbgPMVUAjungJ4Aw"
  },
  "_LS_L0wRtogcgmL4rPblYQ": {
    "date": "9/24/2014",
    "text": "Excellent lunches..ruebens delish...great service...friendly...Bobby the best waiter...good prices too....",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_Ub61b_V5WJ30kDrZdwiyA"
  },
  "kyBRcDnEkGNukzRUMzYFgw": {
    "date": "6/5/2014",
    "text": "For breakfast the service was excellent. Although we did not order a big meal the food was good reasonably priced arrived very quickly. Cannot rate more as we did not order a huge biscuit and gravy breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K3-9a-clw2z8RqUaW0RCXg"
  },
  "SQmLYOXPhGGpbVq2ssHwQA": {
    "date": "11/1/2015",
    "text": "This place is slow as shit. Waited 35 minutes for food. Wasn't even busy and wait was forever. Still waiting. Long wait for food.",
    "rating": 2,
    "rated": {
      "funny": 3,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6m0krRKe_GaQF0P01na6IA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Spoon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/6m0krRKe_GaQF0P01na6IA/o.jpg"
      },
      {
        "img_id": "5E6VZfs6ZPoBDh0En1jqKA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Waiting",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5E6VZfs6ZPoBDh0En1jqKA/o.jpg"
      }
    ],
    "user_id": "8WXmWre_6dh5_DqLFH6i-Q"
  },
  "zTfMgaiIVXDgkAImlryt_w": {
    "date": "4/20/2014",
    "text": "Perfect breakfast spot! Delicious food and quick excellent service. Super friendly :) as soon as you walk it's a homey feeling from the get go.   We got the western omelette, waffles, pancakes, and meat lovers omelette. Everything was fantastic. Even the orange juice was great. I made the mistake of getting a small. Here's your advice! GET THE LARGE! So good.   Totally worth the visit.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "fYpo8CXeokY6b_q75JrO5A",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Western Omelette with Bacon. Side of Hash",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/fYpo8CXeokY6b_q75JrO5A/o.jpg"
      }
    ],
    "user_id": "T-FqjWYEUWPGPQpiOR3y_Q"
  },
  "sgyX3jHrrxOXfozMrtNfhA": {
    "date": "4/16/2017",
    "text": "I come here pretty often for breakfast. Hostesses could be nicer but the waitstaff is great. Breakfast is very good and fast. Have had lunch here as well - only because I got there to late for breakfast which they stop serving at 11. Lunch was a good although a little pricey.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UsV2KNit4no4u5ag3T-bTg"
  },
  "X3k_3D5DwQTH__rnn-w4sg": {
    "date": "5/16/2017",
    "text": "This is the 2nd time I visit this place since it's on my way to the airport . I must say, they are super welcoming, warm, friend people working there . I've ordered the same dish twice and it's been consistan (grilled chicken a salad with grilled shrimp on the side ) the portions are huge and price is very reasonable for what you get . It's definitely become one of my favorite lunch places if I'm in the area .",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "igtm2tdFbTOAx7bpExb7gA"
  },
  "oOUZbNXHqndzKfPgO1yA8w": {
    "date": "4/16/2015",
    "text": "I'm visiting NC from MD and I told my husband for breakfast today I wanted diner food. We yelped away and found this gem. The service was excellent and the food was awesome! We had a bit of everything. Veggie omelette, bacon and ham omlette, grits, and a waffle. It was all awesome! I highly recommend this place. The price is juuuuust right too! Its definitely nicer than your usual diner. We may actually be back for dinner.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AWdk_VpifZ5PdVXSzhOE-g",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/AWdk_VpifZ5PdVXSzhOE-g/o.jpg"
      },
      {
        "img_id": "3c8X7n7vpIyptoyII2EqVQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Veggie omlette with grits",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3c8X7n7vpIyptoyII2EqVQ/o.jpg"
      },
      {
        "img_id": "5IREaclmrvaU0ZqW6h76VA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. We had a bit of everything. Veggie omelette, bacon and ham omlette, grits, and a waffle. It was all awesome!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/5IREaclmrvaU0ZqW6h76VA/o.jpg"
      }
    ],
    "user_id": "_mVg8S8XwpcP3oB3keL1Fg"
  },
  "mg-TV5N99rUBP1d8H5pklg": {
    "date": "2/4/2017",
    "text": "They treat you like royalty the food is excellent but the main thing is they make you feel like they want you there the owner Jimmy very very nice man make sure you say hello to him when you go there",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y63fUggbnO3gdWvY4fgkNg"
  },
  "KTOvrrGVRrIl61v8RjAdlA": {
    "date": "6/25/2015",
    "text": "Tryon house is a great diner off of woodlawn near several of the airport hotels. As I stay in this area for work often, I definitely recommend trying this diner over the hotel restaurants though I can only comment on breakfast as that is all I have had here.  Service is friendly and efficient.  My favorite dish is their pecan and blueberry pancakes. Their pancakes are delicious and the perfect size with just the right amount of fruit and nuts added. My only complaint is that they advertise  having Canadian bacon on the menu but in reality it is just ham. But it was tasty ham so I'll give them that.  If you have time, skip the fast food restaurants nearby and come here for breakfast. You will only spend a couple dollars more but the food is so much better!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "L_INmA5kOE1CLtFCAN8ZBQ"
  },
  "Fjj9hUmK4I17d6ZQuWuQMw": {
    "date": "9/19/2013",
    "text": "Enjoyed finding this location on Yelp. And thanks to my fellow Yelpers for the rating and recommendation.    Stopped by this morning for breakfast and it was a great experience.   Made a few request to make some changes to my order with no problems.   The service was awesome and I was checked on many times throughout the meal.   Make sure you give them a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "rBxP2oM6-KF23iTgdOmYug"
  },
  "FRbl1kc3cjmf7DMNqm2FuQ": {
    "date": "6/5/2016",
    "text": "I'm giving three stars because our server was awesome. Very friendly, attentive and quick. The food was just ok. I'm pretty sure the sausage was Jimmy Dean, hah! French toast was not much more than white bread browned on the griddle. My husband's omelette was pretty good. Would probably look for another spot next time I'm in town.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "MR5HwOyJ-WdTXbQ8wUCrgw"
  },
  "umqIHOnOzfC4wpMZNGTK1g": {
    "date": "6/5/2015",
    "text": "Omg!!! The pecan pancakes are heaven!!! They use pecan halves instead of bits and they are every bit of awesome. The breakfast and service are wonderful and doesn't disappoint each time I visit. Definitely one of the hidden gems for breakfast in Charlotte.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ehUIsmNgA8WfiN5X2bVbGQ"
  },
  "ANrcq5fu8PPw1UQpuyz_Pw": {
    "date": "11/3/2017",
    "text": "My husband and I had to drop our daughter off for a couple hours in the area.  He had eaten lunch here over 10 years ago. I am on a diet so I wanted somewhere to get veggies and protein. We decided to give it a try! Wow! I had marinated grilled chicken strips with mushrooms, house salad and green beans!! It was Amazing! My husband had country style steak with mashed potatoes, fried okra, and macaroni and cheese! His food was excellent as well! The portions were large, the food was amazing and our server was Excellent! Wish it was not so far away! We will be back because it is worth the trip!  If you are in the area you will not be sorry for stopping here!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WE_ZfDSk4cbMpsJv5d3agA"
  },
  "FdO122YexEYEPte6YlUfOg": {
    "date": "5/23/2016",
    "text": "Great service...free vegetable soup to start off your meal is delicious. No late breakfast is only downside. Had Texas toast grilled cheese and it was worth the trip :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "KeBOB_nbTCGPbM4kkl1_EQ"
  },
  "48EUoTpduY9pyqd1apMAuQ": {
    "date": "7/27/2015",
    "text": "Stopped by with family on our way down to Charleston SC.  The local hotel staff said it was the best place around for breakfast.  THEY WEREN'T KIDDING!!!  The food was great and the portions were huge.  The staff was very kind to my kids and was happy to answer a few tourist questions.    Thanks for bring so nice.....great place!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b2P5HuozBRf7RFlvGU_NNg"
  },
  "OMWJ3zZkSLTV3VYTzJdgGw": {
    "date": "6/29/2016",
    "text": "Cheap home style cooking, served southern kitchen style. Great to stop on for breakfast or lunch.  The portions are overloaded and the staff is sweet. My family and I have tried many things on the menu and the only disappointment has been the lasagna.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g2prozZ3UHPGZ18MYFF1Fg"
  },
  "5LcVePiyG65McL5jLT3zgA": {
    "date": "2/7/2016",
    "text": "If you like k&w unseasoned shitty food you'll dig this place. Worst tzakiki ever..sour cream and garlic powder..seriously..that's all it was ..paper thin gyro meat ...nothing has any seasoning..rice was undercooked and crunchy...the hamburger steak wasn't seasoned very greasy and burnt ...the server was great...very nice lady. Other than that, most disgusting meals ever. Will never EVER be back",
    "rating": 1,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "8eV_d5qzqdBcwrItV3KI9g"
  },
  "lfrNaJz_HPK1Ozbf62GYOQ": {
    "date": "2/25/2016",
    "text": "This place surprised the hell out of me. When you walk in you're greeted really warmly like you have been coming there your whole life, in my case it was my first time. They give you a free cup of soup and it was delicious that day it was potato. The portion sizes are huge I had a whole meal left over afterwards and believe me I can eat. I had the fried fish and my boyfriend had the daily special I think it was the dumplings. Everything was good the dressings were house made which is always a win for me. The service was great too everything came out quickly and our server made us feel like family. I was surprised at how cheap it was for how much food you get as well. We will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "_EBGLn2zi2n4G5Fd9kAsPg"
  },
  "-PNFd-_SSEXzr3bdpTvBFA": {
    "date": "7/20/2017",
    "text": "Our Parents of Allergic Kids members were discussing where to have breakfast. The Tryon House Restaurant's name came up as being inclusive for the food allergic community. Thank you for your support! It is appreciated.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RnMUVhvu9nwnGtxo3Brnsg"
  },
  "TtQjAkas7xQHskSJpBfXQw": {
    "date": "11/18/2014",
    "text": "If Cheers was a diner, it might look like this.  It's the kind of place where there are lots of regular customers and they know you by name.  I walked by three of their staff on the way to be seated and each gave me a warm welcome.  Great diner food and the service is excellent.  Waitstaff was friendly and attentive.  I ordered the eggs and sausage with cottage cheese. The food came out quickly but there was no rush to get me out of there.    I'll definitely be back again.  No doubt they will soon be greeting me by name.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GA7_sWeosqZyEXKT9ZF23w"
  },
  "3d5WUQOVwjomXHzg0QwNjA": {
    "date": "2/27/2016",
    "text": "Great customer service and the food is yummy too. Everyone here is super friendly and they are kind to their guests.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "SPva9pyK-RxmY02Au4PwPg"
  },
  "FrNseOPcK2ZWsIPd63tbdg": {
    "date": "7/9/2015",
    "text": "We were looking for a dinner that was NOT fast food while we were traveling. We stumbled upon the Tryon House and we will definitely go back! There is a very diverse menu. My husband had the homemade meatloaf and said multiple times that it was delicious. My daughter declared the Baby Club to be the best sandwich!  Bobby was our server and he was delightful--happy, attentive, and conscientious. And while this was not a fast food restaurant the food was on our table quickly! You will not be disappointed with the Tryon House!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "8xEwCi6nfigeZGvgPX1izQ"
  },
  "5WhtbGH7P7BRWHECmlEyfg": {
    "date": "7/22/2018",
    "text": "Stopped in for breakfast on Sunday morning  after riding by and seeing reviews for awhile. Downhome feel with low prices and the food is good! If you are looking for a good place without worrying about all the hype from other places just stop in. Quick nice breakfast for not alot of money will be added into breakfast spot rotation!!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "enjRIAr9terX5-ocQlpWhA"
  },
  "4Wn0Iw4e6TcbL2FqH8xVFA": {
    "date": "9/30/2016",
    "text": "The food here almost reminds me of a dinner style food.  I have only been for breakfast and they have some really good options and prices.    The restaurant is in a plaza with other stores, but the parking is usually open.  It is spacious  inside and seats quite a few patrons.  The staff is friendly and gets your party seated quickly, even if they are busy.  There is not ever a wait on your food either.    I would like to check out lunch somtime!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "xDl9ZF3SckkZde_48W6WeA"
  },
  "y4hS5gShQKta1MZG4_D64g": {
    "date": "11/17/2017",
    "text": "Solid homecoming with great service.  The food is good and huge portions for very reasonable prices.  I usually order the gyro platter and love it; comes with fried, Greek salad, and pita.  The gyro meat is ok but no different than any other Greek restaurant.  I love their fried squash.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "RMhh-vs9CBglg4kfxWdZHQ"
  },
  "B6ZhV2K7U7JJwTbp8V0U7g": {
    "date": "2/2/2018",
    "text": "I've been back multiple times for lunch since my \"rediscovery\" of Tryon House and BOOM BAM!  it's now my favorite lunch spot!  Note:  be sure to read the daily specials written on the board above the cashiers, that's where the best dishes can be found!!  Try the stuffed chicken - omg, delicious!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "_yZs0MKm8YV0TmB5dkl3xQ": {
    "date": "9/27/2015",
    "text": "Tryon House Restaurant is a family restaurant focused on Southern Diner food.  My manager and I went for breakfast.  I ordered the \"Breakfast Special\".  I requested for Sunny Side Up Eggs, Sausage, Grits, and Biscuit.  YUM!  Looking around at the crowd, it looks like a lot of \"seniors\" that are regular customers.  That means the food must be pretty darn good!",
    "rating": 4,
    "rated": {
      "funny": 3,
      "useful": 6,
      "cool": 5
    },
    "photos": [],
    "user_id": "NvUeb5G_mSSxgKhEE_Hueg"
  },
  "cuLu79nSthyjWaLFsIukwA": {
    "date": "6/28/2018",
    "text": "Friendly place, Great FOOD, & Great Prices! What more could you ask for?  We flew in from Pismo Beach, CA we were tired n hungry, WoW this place was a fantastic WELCOME to Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UBCBGmf9Ybqe2fursqNDyQ"
  },
  "07-9h18WmsWAjjrOVps6yg": {
    "date": "3/25/2017",
    "text": "Friendly staff and very quick service. Meals are hearty, big portions and seasoned well. Definitely beat going to Dennys or IHOP.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "h0Nnfi_M-yESSMlWuPYghA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Yummy omelet",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h0Nnfi_M-yESSMlWuPYghA/o.jpg"
      },
      {
        "img_id": "9TqNA_j2XhAcOY9igC8mnA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Home fries were great",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/9TqNA_j2XhAcOY9igC8mnA/o.jpg"
      },
      {
        "img_id": "vzudmlGRGGUz4Cwo0eK7gw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Pork chop was delicious and seasoned well",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/vzudmlGRGGUz4Cwo0eK7gw/o.jpg"
      }
    ],
    "user_id": "AWyHeFBFw7o19Ko3O_yjrQ"
  },
  "hFSHgnUn5a2bAusQzVjz1Q": {
    "date": "9/24/2013",
    "text": "Sunday morning breakfast, I brought my daughter and we dug in. It's not high end food, this is short order and they still do a great job of it.  My daughter ordered the Western omelet with hash browns. A lot of eggs, a lot of potatoes, this is a full size meal. I got the pecan waffle with a side of eggs. The waffle had a ton of pecans in it and was light and fluffy and crunchy and doughy in all the right places.  Good food. We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 3,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "aCiyR4t_XUs4TVlX3DCz3w",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aCiyR4t_XUs4TVlX3DCz3w/o.jpg"
      },
      {
        "img_id": "Ly24USy_QmTHJFOMUnxt6Q",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Ly24USy_QmTHJFOMUnxt6Q/o.jpg"
      },
      {
        "img_id": "C28buKxpOyXhoZ-9UcRCVg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/C28buKxpOyXhoZ-9UcRCVg/o.jpg"
      }
    ],
    "user_id": "hWDybu_KvYLSdEFzGrniTw"
  },
  "xEf_5Gpk9vNZYQh6x5xOeA": {
    "date": "4/12/2017",
    "text": "Friendly and personal service.  Food very good, fresh and nicely prepared.  Ever hear of complimentary soup?  We never did either, and man it was good, homemade, hot, and delicious. Highly recommend lunch, we wish we'd had breakfast.  Place very busy, with good reason.  Lovely and clean. Get there if you are ever in south Charlotte!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xMdDY67N15bjJcg6QZqfyw"
  },
  "hfuGjNRPsQQWcgrkqsdPIQ": {
    "date": "11/13/2013",
    "text": "This was my first visit here and I must say for it to have been during the lunch rush with a party of over 20 the staff did an excellent job!!!   There's tons of variety here so I'm sure that no matter what you're craving you can find something you'd like. The meals all start with soup. Today's was baked potato and it was pretty tasty. Very creamy with nice chucks of potatoes and good flavors....I could have had a second cup!   For lunch I ordered the fish sandwich, it comes with slaw but I substituted that for fries.   The sandwich was just okay. Don't get me wrong they piled on the fish, but I was missing the seasoning. It was just a little to bland for my taste buds. I found myself using more ketchup, hot sauce and tarter sauce than I'd of liked. The fries were pretty average...I ate them but they just didn't \"wow\" me.  For now, I'm just OK with Tryon House. But I was able to see lots of their other items (sandwiches, salads and burgers) so I know this place has potential.   Yep. I'm definitely coming back to try more menu items especially the breakfast options...so stay tuned for an update!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "bJXpQX_RH3PLejVETjc-DQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Fish Sandwich",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/bJXpQX_RH3PLejVETjc-DQ/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "Xtbrch88lckpIQLfgsJxNA": {
    "date": "7/10/2016",
    "text": "Found this great gem of a diner in Charlotte. Being from Long Island, diners are scarce in these parts. During a trip to the farmers market a friend and I looked on Yelp and it directed us here. Thank God!! Eggs were fresh, waffles were crunchy, home fries had just the right seasoning. We will definitely be back...next time for dinner.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "1e6wKjP0qPx9I0NnoyliSA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Pecan waffles",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/1e6wKjP0qPx9I0NnoyliSA/o.jpg"
      },
      {
        "img_id": "TGuDmZZoUysRTppJlHekOA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Country breakfast",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/TGuDmZZoUysRTppJlHekOA/o.jpg"
      },
      {
        "img_id": "VqYii9unbO2NqPv9FKGJLQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/VqYii9unbO2NqPv9FKGJLQ/o.jpg"
      }
    ],
    "user_id": "Bi81HhElhT-fsSQsY65SYg"
  },
  "mZ6MzFCzCnxYjc0heXkpmA": {
    "date": "9/22/2017",
    "text": "I had a good old fashioned club sandwich and fries. The food was good and the services was good. This small little diner is off the beaten path and is a certainly worth a try. Nothing particularly stood out to me at this eatery, but then again I only ordered a club. The menu is robust and is sure to have something for everyone.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MU8NYqHeB0hmGRNcWSGGmA"
  },
  "Xpoq-Ie98Un8es9cyXFO1A": {
    "date": "5/11/2016",
    "text": "I just love this place!!! This place sets the bar for Family Style dining.  Fast, inexpensive, and top notch service every time I go in.  While this isn't five star French cuisine, they are not trying to be.  They are down home cooking done right.  So they get 5 starts from me.  My favorite meal here is breakfast, the French toast is the best around.  I love corn beef hash, and they serve it, and serve it well.  I have had countless lunch dishes here, and all were up to par.  A family owned restaurant and the family is in the restaurant every day!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "lvRaC_4zSR2w8FVzHuc7Og"
  },
  "ZidckVpWFQop15jP-8RbtA": {
    "date": "11/14/2017",
    "text": "Love it there! Good service , delicious food! It feels like home there. I hated grits! But since I tried their grits, I am in love!!!!.  I will not have anyone else's, I promise !! Pancakes are better than IHOP's ! I haven't had the chance to try their lunch/dinner menu yet but I will be back to try it !",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "GS3sX4lrjdgV17WgGv9oJA"
  },
  "IkiDhhwnqFt4E0zmHrGmQg": {
    "date": "7/8/2017",
    "text": "Just a straightforward, no frills breakfast place with good food, good prices, and a friendly staff. It's always packed here for a reason. They get a lot of repeat and loyal customers because they keep things simple and deliver consistently. When I bought my place last year, one thing that made me happy was that I was only two miles from Tryon House. I would definitely recommend them to somebody looking for a good breakfast at a good price.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "SEW_Ej5nXB2MxXMWQSaljg"
  },
  "zOiY_VawbjeREUByy2pJqQ": {
    "date": "6/10/2012",
    "text": "I came here due to jet lag coming from Hong Kong. Walking in, it seemed very homey. And from rumors, their biscuits were delicious so from up top I was thinking of ordering biscuits.  I ordered their Tryon House Breakfast Special which came with 2 eggs, Sausage links, bacon, liver mush, or sausage patties and a choice of toast or buttermilk biscuits and  hash browns. I got the sausage links (3) and a nice over easy style eggs with toast. This all was 4.75 which is pretty cheap considering all that you were getting. I must say their buttermilk biscuits were pretty scrumptious, with the butter even still inside the biscuit soaking in to make that fluffy creamy taste of the biscuit. (I ordered their gravy biscuits on the side which was 2.75 and it was pretty good.)  The service was definitely good, especially since it's a southern type of restaurant, they definitely show you the southern hospitality that you usually get in these restaurants. I think this place is a great place for breakfast/lunch if you're in the area, but for me it's a little too far out there. At least if I'm in the area I'll know where a good breakfast spot is!  Overall, as I said: Cheap, Good food, Great service. What else could you ask for?",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "0Sco-LmMGKryAHfBHQoVkw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Tryon House breakfast special",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0Sco-LmMGKryAHfBHQoVkw/o.jpg"
      },
      {
        "img_id": "H1vCXyjwpCit9bkQD42uDg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Country Gravy Buttermilk Biscuit",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/H1vCXyjwpCit9bkQD42uDg/o.jpg"
      }
    ],
    "user_id": "j9Z1dcoZrwn8Ul9JTnjjug"
  },
  "FBKb9OmZpHRaQoiKm_asRg": {
    "date": "12/4/2016",
    "text": "Went for breakfast. Seated quickly...nice waitress. I had the meat lovers omelette which was good. Creamy grits....good. my friend had the waffle and said it was good.... it was about $9 each for an average breakfast. And if you are used to Starbucks for coffee, this is disappointing. Coffee lacks perk. Yuck cup. I will probably try one more time.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "w3ReHv4j5f-gnzHIz4Krbg"
  },
  "LLKao_srOWc45WfsDXKfKQ": {
    "date": "7/31/2017",
    "text": "In a world of chain chain chain restaurants, Tryon House is a welcome relief.  The waitresses might call you honey, your coffee cup will never be empty, and if you like hash browns and biscuits, and a glass case that showcases pie or cake, you'll feel right at home.  The prices are fair and the plates are full.  Nothing fancy...just a place that emanates warmth and a good bang for your buck.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "_cWsAUmRiYykYbRPgsTF2A"
  },
  "GCxPO8UCcVhb7UtuV_pZmA": {
    "date": "9/15/2016",
    "text": "Good food. There's nothing not to like here. Roy ate meatloaf and I had baked chicken. After our server took the order she offered us cups of cream of broccoli soup.  It was delicious!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "Obc_xDhWmAUdH4juOmvzxw"
  },
  "EJ5Ls9uLw4IMk2Dl_ZrWZw": {
    "date": "11/13/2016",
    "text": "I had fried chicken, green beans, cornbread, and sweet tea. Southern staples, right?  All were really good. As basic southern fare, I was impressed.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "FdHB0H9OV3QQS6DLOzCU8w"
  },
  "fgWBNF8ObMnKYtPhj_3TKA": {
    "date": "6/27/2019",
    "text": "I grab breakfast to go just about every Saturday. They have great choices and it's served fresh and hot.  It's a great quick place to grab a delicious meal at.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "exwWGBCGMYHvOqi9BYhOmA"
  },
  "1an_e2GyU8z2wZkJi5seug": {
    "date": "9/30/2018",
    "text": "Tryon House is a classic diner in the Charlotte area. They serve breakfast, lunch and dinner. And are located close to the light rail in South End.   Tryon House is my Dad's go to for breakfast. We've been coming for years. They have some great breakfast specials. They do the American classic breakfast right. My favorite part of the breakfast is the triangle toast piece covered in melted butter.   I normally don't visit any other time besides breakfast but the great thing is you can order off the breakfast and lunch menu. So I am able to get a side of fried squash!!!   Service is very consistent and the servers are friendly. The parking lot can be hectic. They have a a lot of regulars so you know they have a good product. They also sell this local honey that my family loves.   Tryon House  215 E Exmore St Charlotte, NC 28217 Saturday September 29, 2018 11am",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 5
    },
    "photos": [
      {
        "img_id": "r1tuhSwhNu-ugaBuGCpIAA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/r1tuhSwhNu-ugaBuGCpIAA/o.jpg"
      },
      {
        "img_id": "gPetzViQZTRSkcRpM4r-NA",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Giant breakfast",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gPetzViQZTRSkcRpM4r-NA/o.jpg"
      },
      {
        "img_id": "_MCxGJzWr_-AgLjXhgc4Cw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Fried eggs well sausage patties and grits",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/_MCxGJzWr_-AgLjXhgc4Cw/o.jpg"
      }
    ],
    "user_id": "12iozmUYN_gvAng9kMLs_w"
  },
  "r4OxnDXbWYDij9TsiErzkw": {
    "date": "8/24/2019",
    "text": "My wife and I Just had breakfast at Tryon House as we have many times before. I ordered two pork chops and eggs as I usually do and she had eggs and bacon. I took one bite of a chop and discovered it was very spoiled. I sent them back and told the waitress to give me a steak instead. When I went to check out they charged me $28.00. I told the girl that I only had the steak because I had to send back my order and they were charging me for the most expensive steak on the menu. She went to her manager who argued with me that there was nothing wrong with the chops, i just didn't like the marinade. What? I know what rancid mead tastes and smells like and it had nothing to do with marinade. Those chops actually stunk and instead of charging me the correct price she insulted my intelligence by arguing the point in front of customers. It was more important that she collected that extra few dollars (less than Five) than to supply a good customer experience. Shortsightedness on her part because if she had handled it correctly i would be on here singing her praises. The management couldn't care less. Sad because I am a regular there, but I will never darken their door again. Plenty of other places to have breakfast without being insulted.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7DdgrsKSSxM1lg4ba8wiDw"
  },
  "WsLI_4EP9tCea8ezGB6ArA": {
    "date": "5/8/2018",
    "text": "Charlotte is full of unique restaurants catering to every appetite, but this place is a solid fastball down the middle - a diner that serves up big plates at a good price.   While I can't say I would order the fish and eggs again, the two large filets did provide a rarely seen alternative to steak. The hashbrowns had a nicely browned crunchy exterior and other diners in my group were filled up by their omelettes. Comfortable booths, friendly service, and plenty of natural light. The picture was complete with a businessman reading a newspaper while drinking coffee.   I liked the biscuits and was happy to be quickly seated on a Sunday morning when brunch places around town would be packed full. Nice work.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "njpzMUL3gZah9CKSsnl3wQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/njpzMUL3gZah9CKSsnl3wQ/o.jpg"
      },
      {
        "img_id": "44zk0Xpu9M5PECdIX2zepw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/44zk0Xpu9M5PECdIX2zepw/o.jpg"
      },
      {
        "img_id": "aEir4dAhC2RBOejEwfg7Sw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/aEir4dAhC2RBOejEwfg7Sw/o.jpg"
      }
    ],
    "user_id": "pZioOLzVNpxyEVchL6LLsQ"
  },
  "E3jxPD4lBnunWz_ttjVSSw": {
    "date": "12/13/2017",
    "text": "This place is a no frills southern diner. The food is heavy and portions are large. Prices are very affordable for the value they provide. Service is friendly, quaint, and efficient.  I came here for breakfast and had the western omelette with extra crispy hash browns and a side of biscuits. The omelette was huge and cooked perfectly. My hash browns were super crispy and delicious. The biscuits were soft and moist. Definitely prepared the southern way. I also ordered a side of grits. The grits were nice and creamy but I had to add some salt to it for extra flavor.   Definitely will come back for breakfast.",
    "rating": 5,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 3
    },
    "photos": [
      {
        "img_id": "uSFWO1fdxZ2mq0dYOH_2Pg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Western omelet with biscuits and a small side of grits",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/uSFWO1fdxZ2mq0dYOH_2Pg/o.jpg"
      },
      {
        "img_id": "qRHbwRq2U6waUiqbgzTicg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Diner style coffee and water",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/qRHbwRq2U6waUiqbgzTicg/o.jpg"
      },
      {
        "img_id": "9Gtu5iRveFYmxU1uAN4M_Q",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Menu",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/9Gtu5iRveFYmxU1uAN4M_Q/o.jpg"
      }
    ],
    "user_id": "wxqxIOP9SoqKY3ZxvKchqg"
  },
  "hnJtte2HjkJbvwtanAdbrA": {
    "date": "2/13/2019",
    "text": "Spinach omelette was OK, cheese used was sliced cheese (this was a little disappointing).  Orange juice was made with concentrate and seemed extra concentrated. Everything else was great, crispy bacin was extra crisp and hot cakes were yummy. Good value but I've had better breakfast.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "mr5Sox9UxzT2TpGENFgSBg"
  },
  "vUXuHCRdLP6jBll59c1GgQ": {
    "date": "7/25/2019",
    "text": "Waitress was very friendly and attentive but food was mediocre. Went for dinner and it tasted like it was warmed up frozen food so not my stereotype of a local diner.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "55-3OgwK-bnamDhfEHpvNw"
  },
  "XTEEJ14zx12RYI9p7wP7uA": {
    "date": "6/2/2019",
    "text": "Absolutely love this place!!! The staff is amazing and the food is always hot and fresh! Not to mention my order is always right! One of my favorite places to go on my lunch break at work.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Kb8pb2jREG_irhPZayFbLw"
  },
  "vpG4kbOHEK55r7g8xkNDow": {
    "date": "2/1/2019",
    "text": "Wonderfully service and food at a very affordable price. You can't beat this place, really love their breakfast",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kr1NCdFn5c9y3miJK5R_Vw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/kr1NCdFn5c9y3miJK5R_Vw/o.jpg"
      }
    ],
    "user_id": "IavINxoXohfzizd8gRA5tg"
  },
  "RUr1e8Idu6hno3s0XJvy4g": {
    "date": "8/24/2017",
    "text": "Excellent casual breakfast spot!  First time there, was in town on road trip and staying nearby. Service was excellent, quick and everything correct.  My friend ordered sunny side up eggs, creamy grits, bacon, liver mush, and biscuits. I got the sunny side eggs, creamy grits, turkey sausage, and biscuit.  The creamy grits were the best breakfast grits we had all week, served hot and rich tasting. The biscuits looked dark on the outside but were perfect and flakey. The sunny side up eggs were perfectly cooked - no white part undercooked, the yolk dippable but slightly set, best we had all week.    We had not had liver mush before, local specialty, tasted good and was different - worth a try to try a local variety a bit like spam or scrapple.  The prices were very reasonable, excellent food, excellent service! Recommended!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "hxKbhIzOZrJQyu7brE8q-Q",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Yummy creamy grits! Perfectly cooked sunny side up eggs!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/hxKbhIzOZrJQyu7brE8q-Q/o.jpg"
      }
    ],
    "user_id": "17o3koLKWqLNzxZCZXRr8A"
  },
  "496CUtP4ItDka8A6VNxCtg": {
    "date": "3/9/2019",
    "text": "The chicken fired steak was great on the last two visits but today it had what appeared to be sausage gravy on it the pieces of meat looked liked rocks they could not be eaten they were so gross it was terrible called the owner he does not care what a shame for the owner said he would have to see it he does not believe what a customer says and he does not care about a negative review do not eat there",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xGxHoeO2Vps9SL8NT6eD5w"
  },
  "Mo0nPbSp9fFJqeJIvg_a7w": {
    "date": "12/28/2018",
    "text": "Very nice,old style breakfast. Good service and good food. The omelettes were perfect and the potatoes were very good. Coffee was also good so that plus an efficient and friendly waitress led to a good review.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "l6jrqB95P4alQkRHq9OWnw"
  },
  "pmLCX3A0UnhmjVVqpCMx0A": {
    "date": "1/4/2018",
    "text": "I really like this place! I've never eaten inside b/c I call-in my order for pick up. I get the exact same thing every time...country style steak w/ rice & gravy, mac & cheese, collard greens, and cornbread. The price for that is $10.77, w/ no drink. It is always good, and the quality is always there. The only reason I gave 4 stars instead of 5 is because I think the price is steep for not having a drink come w/ the meal, and also because sometimes the mac & cheese and collard greens don't have enough salt/seasoning, but that's not a big deal. I can always add salt, and it is perfect! I would definitely recommend this place to family and friends.   Recently, I've started to just get the country style steak w/ rice and gravy, no sides. That seems to work better for me when I feel like making the sides myself.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g4pieotQ54iLLEA-1cKVlg"
  },
  "JSXzhM_j9wzMgiqBR1yy-g": {
    "date": "11/11/2017",
    "text": "Staying at a nearby hotel we happened upon Tryon House. Nothing fancy from the outside, but great staff and good food inside. A True family restaurant with a large menu of items. Plenty of close parking. You're likely to have a conversation with the owner and you will leave completely full. Next time you need to stay near CLT, stop at the Wingate by Windham and take the 10 minute ride to Tryon House..",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "g95jpJlqfYgz31-oxPv9RQ",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Comfort food",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/g95jpJlqfYgz31-oxPv9RQ/o.jpg"
      }
    ],
    "user_id": "_q6jP62txfVmfE-yTpz6kw"
  },
  "iS62L0nJmSAOP4bYJh9n1w": {
    "date": "5/6/2018",
    "text": "Perfect breakfast experience. fast, friendly service  The food was good too I loved the home fries.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dJCoXXFEhizYzzjOLnRSgA"
  },
  "kpky9INMX9evW2uoyVV8CA": {
    "date": "6/4/2016",
    "text": "Mercy, Mercy Me and Gypsies, Tramps and thieves....  If the mellow sounds of the seventies such as Cher and Marvin Gaye while dining is your kinda thing, then the Tryon House should be your next stop. A down home kinda setting, with first class stomach pleasing foods await your there.   I recently was there for breakfast, having a desire for some great grits, and I was not disappointed. The breakfast special, with two eggs, cheese and piping hot smooth grits was wonderful. I went off diet for a moment and ordered a real old school favorite, liver mush, fried crispy and it was a taste treat.  Thinking abut my next stop in for preakfast, but the next time, ribeye and eggs",
    "rating": 5,
    "rated": {
      "funny": 11,
      "useful": 14,
      "cool": 6
    },
    "photos": [
      {
        "img_id": "YB6kCayPy-ng7YFGZw7oRg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/YB6kCayPy-ng7YFGZw7oRg/o.jpg"
      },
      {
        "img_id": "l-sFTnE1RnkKDL2fbUTMGw",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/l-sFTnE1RnkKDL2fbUTMGw/o.jpg"
      }
    ],
    "user_id": "yCaDISH0R8e5U376zDWTpQ"
  },
  "NDPyPrvr71L1gqb7VlU0cQ": {
    "date": "11/14/2018",
    "text": "This is a hidden little gem in that it is not on a major road. Like anything that is good, people find out about it. Their menu has a wide variety of selections. Family friendly. Fast. Especially at lunch. I like the complimentary soup before your meal, nice touch...especially on a cold day. Service is usually pretty good. Bathrooms are clean.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "lCzAnHHDMLZmeNPHAdiF4w"
  },
  "HhScULdCZ72WTOn1rdT6Ow": {
    "date": "3/31/2019",
    "text": "Breakfast was good and the no complaints on the food. I was not happy that they kept Fox News on in the restaurant and would prefer either no TV or something not so political while I try to enjoy my breakfast",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "2svMRDkGROznck9SS5_FlA"
  },
  "EOinFRS8esOIKO1CS51_cQ": {
    "date": "2/17/2017",
    "text": "THR is a straight up, no frills Greek-owned diner majoring on the basics.  Expect nice decor, friendly staff, great food, quick in-n-out all at fair prices.  Over the years it's always the same which tells me the owner is at the helm with a deft hand on the wheel.  I like this place a lot, especially when not wanting to dress up to go out.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 3
    },
    "photos": [],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "a_pPLrqC7lXxDF47f3heug": {
    "date": "11/28/2016",
    "text": "Recently I was headed toward another breakfast spot and I spotted the Tryon House. For some reason I recognized the name so I immediately turned around pulled in the parking lot and pulled it up on Yelp. From the reviews and menu I could not pass it up.  I arrived around 10:30am on a Sunday morning and the place had plenty of tables open, definitely larger inside than I thought. I was seated in a comfy booth and ordered coffee and a water while I looked over the menu.  WHOA, they have everything. Craving breakfast I decided to go with one of the specials, 3 Eggs any Style, Sausage or Bacon, French Toast, Pancakes or Toast. I chose 3 Egg scrambled, sausage and French Toast and added a side a Hashbrowns, because I am a sucker for them! Within 10 minutes my meal was delivered. Everything looked great! The eggs and hashbrowns were perfect and the sausage some of the best I have ever had.  The French Toast was the most disappointing part of the meal. Still good, but didn't seem like it was soaked long enough in the egg to create that egg like crust.  But, again, still good. During my breakfast the service was on point. Friendly smiles from all the servers who kept everyone's coffees/drinks full. I am so glad I stopped in and will for sure be back!!!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 4,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "vWz9QTmc9K6rUKszy061kg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Tuna Salad, Potato Salad and Coke Slaw with Tomatoes and Egg !",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/vWz9QTmc9K6rUKszy061kg/o.jpg"
      },
      {
        "img_id": "bkBqKU26NPy_YdFIWM0LHg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Baby Club with Fries",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/bkBqKU26NPy_YdFIWM0LHg/o.jpg"
      },
      {
        "img_id": "ZN3c-ibhoneT5vkRzCdbyg",
        "caption": "Photo of Tryon House Restaurant - Charlotte, NC, United States. Broccoli &amp;amp; Cheese Complimentary Soup on Thursday&amp;#39;s",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZN3c-ibhoneT5vkRzCdbyg/o.jpg"
      }
    ],
    "user_id": "qUL3CdRRF1vedNvaq06rIA"
  }
}