{
  "Bbzk5I5gr3_cBRmKvoMSpQ": {
    "date": "7/15/2017",
    "text": "I'll tell you what... It's rare to find service this good. A lot of people are talking about how good the food is, so I don't really need to add to that. It's delicious. Especially the urban cowboy and the Buffalo chicken wrap. That dessert with the warm cookie and the ice cream is crazy crazy good too. If you're having a good week you deserve it.  Back to the service! My hats off to the management team for hiring such a great lineup of the servers hosts and cashiers. I have managed teams before and it's not easy to get a team this well orchestrated right off the bat. Really really really well done guys. They were helpful, they were excited that we were here, they were excited that we have now returned for the third time in as many weeks as they've been open. They encouraged us to try new things, even let us taste a few things, and I am glad they did because it was all so good.  I'm glad this place is so good because I will continue to get to eat here for the foreseeable future! This place won't have any trouble at all staying in business and doing well! It's a great addition to the Park Road Shopping Center and our neighborhood. Keep it up guys!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "BhxYKTjjL33d174e8wsK8Q"
  },
  "wqv7bql92O_znOUUWmbHFw": {
    "date": "8/16/2018",
    "text": "One of the best lunch and sandwich places in Charlotte. The White BBQ Chicken sandwich is awesome. I highly recommend if you are in the area.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tQzTxU_BawHM0UfLM70m5A"
  },
  "29OibPa4FvZZt6QGtQcKsg": {
    "date": "11/7/2017",
    "text": "Had 2 soups, wrap and Broc salad with a side of beers. Modern decor, order at the counter and sit, nice bar and patio space. Great service and good was great for lunch",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PQYshw3N4iP6mUNrZvjuIw"
  },
  "jrB5HfeB-Ff5K-OA6KE-Kg": {
    "date": "6/23/2018",
    "text": "We've been here multiple times and have enjoyed our experience each time. We tell our friends about it and they enjoy it as well. There is a common theme though across all the times we've been here and the feedback we've received from friends. The portion sizes, they're just too small. I really do enjoy the food quality, service and atmosphere but for the price it's hard to justify for the size of the servings.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "a8RxapAI_3sLq5VAOC672w"
  },
  "yMqELdKBohEzRkMvRwEmOg": {
    "date": "4/26/2018",
    "text": "Place is just flat out good. Cooking in green eggs. Wraps are good, sandwiches good, sides are great. And they serve beer",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nm9o2CicY8P9sVDr2aMuTg"
  },
  "W61-6Gb4vKWDDUw2YEx-ig": {
    "date": "12/14/2017",
    "text": "Good food/service. Nice spot to have nearby. Also enjoyed the fact that all the sides weren't fries but actually prepared sides, shows some creativity. Will definitely go back.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "oTDHMlATyfAOpW3caDNl6A"
  },
  "1nBaMlSoG0bLfNhhyFtRfA": {
    "date": "6/10/2018",
    "text": "Fabulous fresh flavor!   Don't miss the opportunity to visit this great new restaurant.  We recently stopped by this Park Road restaurant for a meal with our grandkids and found great menu choices for reasonable prices.  The Lime-Marinated Steak and Rice was tasty and tender.  The Turkey Crunch sandwich was outstanding.  Their secret is hickory smoked cooking. And serving is as good as the food.  Menu choices for kids will satisfy the most finicky of young diners but the grilled peanut butter fluff was a big hit. It's also the cleanest restaurant we've visited in quite some time.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "uQU9WMdF3T0dCORsLiZFNw"
  },
  "PbegCmh-wAA08icgBMWzeg": {
    "date": "7/10/2018",
    "text": "Urban Cookhouse food is excellent. The service is very good as well. When you do not want fast food but you want high quality food fast, please try this place. It is our \"go to\" regular place to dine in or carryout. The wraps are very good as are the side items. The buffalo chicken wrap with mac and cheese as the side item is a must try. They also have local beers on tap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ey3GFhFHzkjaF2exBrNPig"
  },
  "fcFD3NblASw9zhuuH9YOLg": {
    "date": "6/2/2018",
    "text": "This is a good restaurant to try. The service is prompt and the food is great. They have a lot of healthy options for children and adults. I always order the shrimp and squash kabobs with rice pilaf and salad. The salad dressing is good and the orange rolls are amazing.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Vrdp05Wn6IfzkpLmgnOYoQ"
  },
  "QL7w39b4Ja1BUTnKUQwyTg": {
    "date": "5/23/2018",
    "text": "Stopped by today after reading a review in Charlotte Agenda. What a nice find. Really good food and great flavors. Orange rolls are really good. There was a big line for new Shake Shack and we had no line, fresh food and sat on the patio. Workers weren't very friendly but food was great. Well went back this past Sunday as it opened and what a difference. The man taking our order could not have been nicer and welcoming. Glad we gave it a second shot. Food was great, can't believe this place isn't packed all the time.  Food fresh, good for you and many flavors.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "AOBfqfNw9wwYwHZJ5Ov8Yw"
  },
  "az4aA4ErStj1wxlkKp3gVQ": {
    "date": "12/22/2017",
    "text": "Went here with some staff from work on 12/21 for lunch. It was everyone's first time here. I was very impressed with service(all staff persons were great and Daniel has a great jovial attitude ) and I think everyone enjoyed their food. I had the buffalo chicken wrap, roasted vegetables, and strawberry lemonade. All were good! Definitely will be coming back to try other menu items.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WfI6uGUeHpNEK7S_Y4TvVQ"
  },
  "TxckcwJejoeksHiW4iOWYw": {
    "date": "12/18/2017",
    "text": "Great food, great staff, great atmosphere! Good selection of local brews and a well balanced menu with phenomenal desert.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "XhkyPgS581GnbeFTyFIWfA"
  },
  "Qa-iXHVPhkwRjkMzVhCAIw": {
    "date": "6/25/2017",
    "text": "After waiting a year in anticipation for this Big Green Egg concept I must admit disappointment. It's not a good sign when you order the Lime Steak with rice and salad & the RICE is the star on your plate. The steak was dry and had a nice gristle line thru each piece. Atmosphere was excellent and I do think they will get their act together. I agree with the other guy...BGE = Burger. Would also suggest char those peppers and onions. I am pulling for you as a local charcoal head but you have landed in a highly competitive culinary zone and it's show time!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 3,
      "cool": 0
    },
    "photos": [],
    "user_id": "t2vuKevi1pZVgIHW19Qcxg"
  },
  "B4i92PS8O0HP6NIWhipPfA": {
    "date": "10/8/2017",
    "text": "Food quality and service are both great. They have creative menu items that are well executed on Big Green Egg grills. Good local craft beer selection makes for a great place to enjoy Charlottes local breweries. I've enjoyed everything that I've had here but recommend the buffalo chicken wrap and the broccoli salad side. Outdoor seating is really nice too, especially with a high patio ceiling that allows for eating outside when it's raining.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "K0tRCUGPr1vCoTdmFZJ_fQ"
  },
  "wy6xcbJDJ5sIkcgYa4TN7A": {
    "date": "6/1/2018",
    "text": "Dad and I both ordered the grilled chicken special.  We were both very satisfied!  The chicken was well seasoned and moist, the vegetable side was cooked perfectly (not mushy and slightly firm), and the rice was fluffy and soft. Each entree comes with an orange roll - imagine a cross between a croissant the iced orange cinnamon roll.  I also had the fresh made strawberry lemonade, which was perfectly sweet and tangy.  I highly recommend this restaurant to someone interested in a well balanced & quick meal.  Prices are comparable to Panera Bread or Jason's Deli.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I48nzPdCQP9KDbdDty32gw"
  },
  "viRFNubxonAKOufGtQdsRQ": {
    "date": "6/25/2017",
    "text": "While service was quick and polite, the food was quite bland and my simple BLT was very soggy. Know they just opened, but not super impressed.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "wvMzZo4FlFwx9ot3OvDkfw"
  },
  "g7LXw_4eqLSZfrGVlRehXw": {
    "date": "7/14/2017",
    "text": "This place has good amount of open seating. The customer service is really great from the moment you walk in the door. Only giving 3 stars because the food was so mediocre!! I got the pepper patch wrap and a side of broccoli salad. The wrap was tiny! To put it in perspective, it's as if you cut a normal size wrap in half, and then cut it in half again. I left hungry. I would try it again and maybe try something that they actually grilled. But, expensive for what you get.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6xgOCZsCtAVJXVbTkaExQ"
  },
  "38Z427N90Ce4uL0T34SjNA": {
    "date": "7/11/2017",
    "text": "Absolutely amazing food and service! If you like buffalo chicken don't miss their great wrap! Their servers were extremely friendly and attentive. We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "W2U0W1jXIFU6w11or8r8UA"
  },
  "0knQuWFdbK0yxYHz4iFKIQ": {
    "date": "10/8/2017",
    "text": "Really good food! Had the chicken salad with fruit plate. Fruit was very fresh and chicken salad had great flavor. When we first walked in I asked what was in the chicken salad (pimentos, pickles, celery, salt and pepper) and they offered me a sample. They make the food fresh to order so it doesn't come out immediately but you know it's fresh. Will add to my casual dining circuit!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sd3g5D2u_Nebjs6PK-gywg"
  },
  "yCARv0dVJGBQOeCEZ7RTGQ": {
    "date": "9/11/2017",
    "text": "Well, I was looking forward to trying this for the first time. Loaded some hungry kids up in the car to arrive to a dark restaurant on Monday 5:30pm.  Called from the parking lot & was told the workers couldn't make it in on the bus (?) because of the storm. There were 3 or 4 employees inside that I could see. I'm all about safety first, not sure where they were being bused in from but my kids had just come home from 2 different schools on buses and were just fine.  Hope to try again when they have employees! Bummer.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "OHla4Awf8k1W5HQZ5Gn1uA"
  },
  "nrEF5tOCl4h2eGfs_QYqpw": {
    "date": "1/11/2018",
    "text": "Our first visit left a good impression. I had the Urban Cowboy, which was made with a tender cut of beef, marinated and grilled. My wife had the Grilled Pineapple Ham which she said was smoky and delicious. They had a few nice beers on tap (Legion's Juicy Jay, always a favorite). The restaurant was clean and comfortable. Service was great, with several people checking in with us on our meal. We'll be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1DrC2YybloxcXpGw1KrwqQ"
  },
  "pqpok7WG4sz8i2Dn-1yuHw": {
    "date": "6/23/2017",
    "text": "What a great night to try our new neighborhood gem!!! Complimentary adult drinks and fluff-r-nutter on the kids menu...shut the front door!! The food was excellent and the service fantastic, 5 stars all the way.  I had the shrimp kebobs and my husband had the lime marinated steak, both were excellent and good portion sides for very reasonable prices.  My son had the grilled peanut butter and fluff sandwich, just as I remember as a kid...yum!!  It's a walk-in order style place to eat, which I like for the shopping center; it adds diversity to our restaurant choices.  We will definitely be back and to try that half baked cookie sundae!",
    "rating": 5,
    "rated": {
      "funny": 7,
      "useful": 12,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "8eDSYTJ1vgQbAWQk92bkrg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Fluff-r-nutter!!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/8eDSYTJ1vgQbAWQk92bkrg/o.jpg"
      },
      {
        "img_id": "3f6ERlRemF30UBP4eQiENw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Lime marinated steak",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/3f6ERlRemF30UBP4eQiENw/o.jpg"
      },
      {
        "img_id": "ZoMz9idk8e1A0O4EZWVxWA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Grilled shrimp kabobs",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/ZoMz9idk8e1A0O4EZWVxWA/o.jpg"
      }
    ],
    "user_id": "RMhh-vs9CBglg4kfxWdZHQ"
  },
  "B5PXKmVnhD5kDpOCRtzm3Q": {
    "date": "7/13/2017",
    "text": "I don't have a reason not to give this place 5 stars. The service was excellent! The ambience was great (though it does get noisy), and there is covered outdoor seating. The prices were very reasonable, and the food was really good! We didn't have to wait long either. My toddler also ate for less than $5, and I love when that happens.   With two little ones, we are always wanting more casual order at the counter spots that serve good food. This joins the ranks of our favorites along with Mayobird, Roasting Company, Sabor, Earl's, Blaze, and Carrburritos of Davidson.   We can't wait to try more menu items. We'll be back soon.",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "tAcEr-XLzA_TuaKh3SpcGA"
  },
  "ml7qKAIGwqDpTiWpYB5wAA": {
    "date": "6/22/2017",
    "text": "Today is their grand opening and I am pretty sure this will be a super popular spot. They have inside and outside seating. The staff are super friendly. The food is really GOOD!! I had the \"Chicken Special\" and was not disappointed. It was yummy! The orange roll that came with it was like dessert, it melted in my mouth. We sampled the milkshake and if I was not so full I would need a whole one. All in all this is a great new restaurant.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "Enk3xxayafCn8qztGiA2iA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/Enk3xxayafCn8qztGiA2iA/o.jpg"
      },
      {
        "img_id": "gmoUZsEImuu-fqO5sJEJCQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/gmoUZsEImuu-fqO5sJEJCQ/o.jpg"
      },
      {
        "img_id": "nieny_15PVsNsEybS0b3ug",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/nieny_15PVsNsEybS0b3ug/o.jpg"
      }
    ],
    "user_id": "YF-hIz4YiF0mQ1ouJ-fBjA"
  },
  "OmvBoCDT1YWMS_tEAM4hzw": {
    "date": "7/13/2017",
    "text": "This was my first time dining here.  I really liked the open feeling of the place and the decor.  It was very clean inside too and the staff were all helpful and friendly.  This gave me expectations that the food would be pretty good, but it was disappointing.  I had the BALT (bacon, avocado, lettuce, tomato) sandwich. The bread had been grilled like a grilled cheese, but whatever oil they used to grill it wasn't butter, because it only added grease to the bread and no flavor.  The bacon was not crispy and the lettuce was sparse.  I think the tomato was probably pretty good but the overall texture and flavor of the sandwich was disappointing. I had the broccoli salad as my side and I think the broccoli and grapes in it were fresh, but the salad had sugar or some sweetener in it that made it too sweet.  I did have a chocolate shake and that was very good.  I'll give this place another try with another dish because I liked the space and the people, but my first experience was definitely a \"meh\".   Oh one other negative:  This brand new restaurant only had the option to swipe your credit cards, which puts customers credit card numbers at more risk of being stolen than a chip reader or an NFC reader for Apple Pay or other contactless payment methods.  It really makes no sense that a brand new store would put its customers credit card numbers at risk by using old magnetic swipe technology at its registers.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "E_EdG79t8XvaZ0Td5WA5aQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. BALT sandwich was greasy and the bacon wasn&amp;#39;t crispy.  It was not a very satisfying sandwich.",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/E_EdG79t8XvaZ0Td5WA5aQ/o.jpg"
      }
    ],
    "user_id": "BjVihbvliQl8Yf5L4J_CfQ"
  },
  "Y8S-dYsSw4Y9LP3FYjmxpA": {
    "date": "3/19/2018",
    "text": "Let me start by saying I found Urban Cookhouse on instagram through a food blogger I follow. I knew I had to try it when I saw they had orange rolls and delicious smoked meats! My mom and I stopped in for a late lunch and we were greeted with such warmness from the staff. We got the berry salad and the white chicken bbq sandwich with homemade strawberry lemonade. My mom and I were blown away by the flavor both our dishes packed! My moms salad had the best chicken and freshest berries. My sandwich was juicy and the flavor was on point! Crystal came out and checked on us several times, refilling our drinks and checking in on how it all tasted. To top it off she even sent over a complimentary skillet cookie! Major brownie points in our book lol! My mom is a major food critic and couldn't stop raving about how she had the best salad she's ever had at Urban Cookhouse! We will be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xjB41W8gOz3mHZ_7FsszIw"
  },
  "UXpQeQulRYtdGZ0Qfln3SQ": {
    "date": "7/24/2017",
    "text": "Great new restaurant addition to Park Road Shopping Center.  Covered patio and spacious inside seating.  It was a little loud, but the place was very busy.  The staff was VERY friendly and helpful.  Walk up and order style...food came out quickly even though the place was packed.  I had the BLT and pasta - it was delicious.  My husband had the Cookhouse wrap which he loved.  And his roasted veggies were AMAZING!  I will be ordering a huge bowl of these next time I visit.  You can see right into the kitchen while the chefs are cooking on Big Green Egg grills.  Fun for kids to watch - and they had a good looking kids menu.  Will be back for sure!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4ktXFpDSE92Yoq9Sa9VxAQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. BLT with cheddar pasta / The Cookhouse wrap with veggies",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/4ktXFpDSE92Yoq9Sa9VxAQ/o.jpg"
      },
      {
        "img_id": "gopcaYJr4NIFOJ5xJf9nHw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/gopcaYJr4NIFOJ5xJf9nHw/o.jpg"
      },
      {
        "img_id": "Rldo5qmh872FadF5YIkYOQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Kids meals",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/Rldo5qmh872FadF5YIkYOQ/o.jpg"
      }
    ],
    "user_id": "vKoECqqh4Q07gP_arEtMAw"
  },
  "ZyuS0JbWwkc_hQNI0DlycA": {
    "date": "9/25/2018",
    "text": "The food here was pretty good. We order the chicken salad and fruit and the veggie plate with sweet ham. I was not disappointed.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JhXu0gRA4R8ZWwGFoBDqvw"
  },
  "pPJyvDqQXm1fToXOW0pYyA": {
    "date": "4/28/2018",
    "text": "This is hands down one of the best restaurants in Charlotte. Their service is incredible, the food comes out quickly and it is made with REAL QUALITY Ingredients. It's like something I would love to cook for myself at home, but could never make it taste THAT good. They cook everything on big green eggs, which makes the flavor even better. They cater to your needs even though you order at the counter and always check on you and take care of you. Veggie quesadilla is my fav, but everything is excellent and I've tried almost all of it!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "DZtPTY2QyHF1QmOQUnnROA"
  },
  "F6Ktfu72yhDlFX9bQbooMQ": {
    "date": "8/5/2017",
    "text": "I really enjoyed my experience here. Very nice staff and the White BBQ was very good too. The half baked cookie was awesome! Only reason I gave it a 4 is because my boyfriend said his shrimp kabob was a little overcooked and the seasoning overpowered the shrimp as well. I'll definitely return!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nHO4jdj_DcNg4IMKEqHYaw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. White BBQ sans bacon",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/nHO4jdj_DcNg4IMKEqHYaw/o.jpg"
      }
    ],
    "user_id": "v0Ybi5jbUsZT0agKbP7H1A"
  },
  "UGmkMt4CqI8a5ddvuMyE3A": {
    "date": "4/21/2018",
    "text": "Environment and staff were great. Food was good (pretty sure I'm going to try the tacos next time I go, they looked great). The owner (I'm guessing) was there and gave our party the half baked cookie. It was great.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "fURKaR9Ommn6FrCGKPSkNg"
  },
  "S8KlRcJs_TIWrI4EUDGaOw": {
    "date": "3/16/2018",
    "text": "Great food and service. Great place to bring a family. Plus: best pint glasses in town",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "W4dPWczZVbRf2WH5qGXrmA"
  },
  "fuQFSr8-3PEc8cctU4XWYg": {
    "date": "4/17/2018",
    "text": "This is my go-to place for a tasty, convenient meal that won't break my wallet. I have been a fan since day 1.  My favorite is the Lime Steak with rice pilaf. Where else can you get a grilled steak (with grilled onions and bell peppers), rice pilaf, garden salad AND an delicious orange roll for desert for under $11.00?   This is by far a great addition to the Charlotte restaurant-scape.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MDxuwK9VW3Xc94etWjXihg"
  },
  "DIt6a9Vj3gYWSZHjND44eQ": {
    "date": "1/11/2018",
    "text": "Love love the steak here! I get it paired with the veggies and a side salad with their tasty house dressing. The Orange rolls are a great little sweet treat with the meal and I'm always tempted to order more! The chicken is pretty good too- but chicken is chicken. Steak is my recommendation!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "R6mMn68dS7GlLcA75sFN8g"
  },
  "FfwMjnKEtSaBOz0d0K697A": {
    "date": "8/8/2017",
    "text": "I found the whole ordering thing confusing...The gal told us she'd bring us our beer order, but we were to place our food order at the counter. Well, my beer never came, so I ordered it (again) when I ordered my food, but asked for it before I left the counter so I could enjoy it before dinner arrived. They seemed a bit annoyed by my request and filled my beer quickly in a glass which overflowed. I was left to find a napkin for clean up on my own. And she didn't give me the bottle which had beer remaining in it.  Later, my mom inquired about the potato sticks another table was eating...The lady said she'd bring us a bowl. Never came.  The orange rolls and brownie were good, but the rest of our food wasn't extraordinary.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "g28ksr4K8Cony16vDMpNOg"
  },
  "-T1B4IFl_uc_-a2JI_KMEg": {
    "date": "3/4/2018",
    "text": "Found this place randomly, checked out the menu and was what my Fiance and I were looking for. Very casual place but, food is fresh and made to order. There was a slight mix up with my order but, it was taken care of seamlessly (someone just ran the wrong order to the table). Everyone was on top of it and that is what I call customer service. We were about to head out and a gentleman (thinking the Manager) said we have a dessert coming for you both! I was beyond words and the dessert was amazing (half baked cookie with vanilla ice cream).",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "zQQ5uJW7YoLwARJvjegymA"
  },
  "y0RFeJvmwG92Op9oG4RrYw": {
    "date": "2/3/2018",
    "text": "Awesome lunch spot. Had the Cuban sandwich and it was really good with nice Smokey flavor. Lots of meat on it, not some wimpy sandwich. The wife had the BALT and added chicken. She loved it. Definitely will be back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "YmSMOB9MW73yi3MhO_vy1Q"
  },
  "IQIJp1OQw-r8G0PQjcpjrA": {
    "date": "2/17/2018",
    "text": "Overall fantastic place in Park Road Shopping center! We ordered the White BBQ sandwich and the chipotle braised pork sandwiches. Both were great! Perfect and flavorful. The side cheddar pasta was delicious. Great swing on Mac and Cheese. Will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "I_kvW_ZZ3MUBQA0ZUuTa6Q"
  },
  "8gHvr3kkbpFDIA7KajPWIA": {
    "date": "3/21/2018",
    "text": "We have tried several of the sandwiches and sides and WE LOVE IT!  Love they cook everything on the Green Egg smoker.   Lots of tasty choices and great service.  I just had the White BBQ sandwich with chicken, pepper jack and bacon on a French roll.  I keep going back for the roasted veggies though. They are super tasty.  And be sure to order desert - cast iron skillet cookie with ice cream.  They also have several local brews on tap.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "KA3e3NN0AxQjzpakHhvTWw"
  },
  "LR8f4lEHe6uREgJGIVawyA": {
    "date": "2/8/2018",
    "text": "Tonight was my first time dining here. My husband's second time. It wasn't what I expected, it was much better! The Pork Tacos Special was excellent. My husband got the Lime-Marinated Steak & Rice, again! For a counter service style restaurant it was a great customer service experience. The food is delivered to your table by a very attentive staff. The atmosphere is open, airy, well lit and clean. The prices are very reasonable. And the quality of the food is very good. We'll definitely come back.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "b6mwfWmzeIRB-sEcgV3Zgw"
  },
  "GUk3EgUfJOXxSyOKnoplwA": {
    "date": "8/1/2018",
    "text": "Colorful salads! Chicken salad was good. Watermelon in season in August made this a very colorful salad. It was good. The other salad was a  Cobb type salad & it was good also with the honey mustard dressing.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PLewAG4Xvr4WUrsSE5D9pA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Cobb salad &amp;amp; orange roll. The roll was delicious! Salad was good too.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/PLewAG4Xvr4WUrsSE5D9pA/o.jpg"
      },
      {
        "img_id": "nHveZ5F5vQC_P44Zm_tLbg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Chicken salad with fruit- beautiful &amp;amp; delicious!",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/nHveZ5F5vQC_P44Zm_tLbg/o.jpg"
      }
    ],
    "user_id": "_eRqOCDXEhlRTNUyV2WdhA"
  },
  "8I2k-00kkFUqFAnDCx2Zdg": {
    "date": "2/2/2019",
    "text": "Understaffed - only server/cashier and one cook for a busy Saturday afternoon. Tables were uncleaned and the place needed a good pick up. Food took over 1/2 hour to get to us and was stone cold when served.  Food was not worth the wait or the dirty atmosphere. Will not be returning here.",
    "rating": 1,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "xO0zKBsSLOiOx0GfI0FWtQ"
  },
  "XPUrP5a_-IVFGtVoBTmp6A": {
    "date": "5/6/2018",
    "text": "The food and service were great here! You can't go wrong with the chicken salad sandwich. The bread was toasted perfectly and complimented the chicken salad really well. The turkey crunch sandwich was also delicious. The slaw really makes the sandwich unique. You also get a side with the sandwiches. The roasted veggies were my go-to, and it didn't fail. Um and let's just take a second to talk about the sweet orange roll...It might sound weird and not look like much, but it is BOMB. Whatever that filling is in the center, it is worth coming to Urban Cookhouse just for a taste.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "JYUVcr1_mriyo9DQMo0DhQ"
  },
  "BALVzNOshGE7p9opSCcqvw": {
    "date": "8/3/2017",
    "text": "Tried this place about a week ago  It was memorable.  The service is what stood out to me albeit the small sweet roll that has a hint of orange was good too.  I believe its a fairly new place, so the interior was modern, fresh and very open.  Its walk up service and number card system,  but don't let that give you pause,  because some full service restaurants could learn a thing or two about \"customer service\"  from this restaurant.   They were just very attentive but not overly so.  The food was  ery good too,  can't recall the names but you'll get the gist from the pics.  Its located in a cool part of Charlotte and competition is fierce,  but if they keep up the service with the very good food, they'll be champs.",
    "rating": 5,
    "rated": {
      "funny": 4,
      "useful": 7,
      "cool": 8
    },
    "photos": [
      {
        "img_id": "TRY0YGzXy9Qw7e8EJuIDmA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Steak salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/TRY0YGzXy9Qw7e8EJuIDmA/o.jpg"
      },
      {
        "img_id": "O6Ee1u6kIflrOKlcwUnRIw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Sweet roll with hint of orange.  Yum-OOO.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/O6Ee1u6kIflrOKlcwUnRIw/o.jpg"
      },
      {
        "img_id": "h7gbcMP7Yk29CRbYcSgfnw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Chicken and bean wrap",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/h7gbcMP7Yk29CRbYcSgfnw/o.jpg"
      }
    ],
    "user_id": "P14bqC_Ynbp8O3tLePRKSw"
  },
  "qr3eWOiN0ZK7R93LH6RCZg": {
    "date": "4/21/2019",
    "text": "This place is excellent. The server was so friendly and nice, let me sit outside and work for a couple of hours. I had their braised beef grilled cheese and jalapeno beer, and it was superb. Highly recommend",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "4HRsXzkDsXt-wlk5ban2bQ"
  },
  "lCcZHOR7C9wabPdgn9UOkQ": {
    "date": "10/19/2018",
    "text": "It was ok, but don't get the Chicken Salad sandwich. Probably would not refer my friends . :/",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "m6ftF0hlrj-Q-2dXwcY7Dg"
  },
  "2gE6X-iijvPtoF1YnqSvRQ": {
    "date": "5/14/2018",
    "text": "Great place if you cave kids with you.  They have coloring books etc to keep them occupied.  They also have a solid menu, not your typical chain food BS.  I like everything I've eaten here!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "s5dDf398fbR1IB858ajhGg"
  },
  "_Z1tvKN9hEgcHtJBQUnC7A": {
    "date": "8/19/2017",
    "text": "You order at the counter and they give you a cute little number for your table. The lady behind the counter seemed a bit annoyed with us for taking our time looking at the menu, even if we were the only ones in line.   I ordered the berry salad with chicken and it was fantastic. And huge. Feta, blueberries, strawberries, blackberries, pecans, and a sweet & tangy orange dressing. Great for summer! I didn't try the orange roll, but my fiance didn't seem to mind taking that off my plate :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "GSQ5qWgS8FM1dugZmkD55w",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Berry Good salad with grilled chicken - yum!",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/GSQ5qWgS8FM1dugZmkD55w/o.jpg"
      }
    ],
    "user_id": "uFP9IeEYwBeqqlUQ-dw7PQ"
  },
  "bEmIfbI2dqPpKe0CPAThKQ": {
    "date": "8/13/2017",
    "text": "Pricier than expected.  $25-30 for 2 for lunch is high to me for what the experience offered.  Salads are $9 and there's not much on them other than wet romaine.  Why is the salad so wet like they didn't even shake it after running it through water.  That's off putting.  The B(A)LT Sandwich is not very good.  I'm a professional complainer but it has serious problems.  The bacon is shiny because it's cooked in oil.  Bacon doesn't need to be cooked in oil.  When you cook bacon in oil and take a bite the first flavor that hits your mouth is cooking oil which defeats the purpose of using bacon.  On a BLT you should taste bacon!  Bacon is already the fat.  They are only adding oil because it cooks faster instead of taking the proper time to utilize a great product and cook it right.    Also \"on toast\" here means griddled in A LOT of butter.  So if you're non-dairy like me you want to order the toast \"dry\".  I ordered it dry at the register but still had to have it remade because they forgot.  As a sandwich if you don't get ham or turkey, which is extra, there's not much to the B(A)LT.  (A) is for avocado but it's just a teaspoon of light spread.    Rice pilaf side has butter so I can't eat it since I'm non-dairy.  Roasted veggie side is mostly mushrooms that have cooked down and released water so everything tastes boiled.  There's no roasted flavor on them and they don't look like they spent any time in an oven.  If it was just called sauteed vegetables I wouldn't have been bothered.  But when you say \"roasted\" it creates an expectation.  Not waiter service but you order and they give you a number and run the food out to your table.  They also bus the tables for you.  But possibly because of that all the tables were pretty dirty both times we visited.  Not just un-bussed tables but most tables had a lot of shrapnel from previous guests.  They could add self-service stations for customers to discard your own dishes to take a load off the food runners.  But without servers shouldn't it be cheaper than it is?  The first silverware I unwrapped was dirty.  After two visits I don't think I would go again.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "c3_AdjAlMy4EJYQhuXADgA"
  },
  "yy4rvAv8C8Kq0CEqDO0YuQ": {
    "date": "9/12/2017",
    "text": "This place was dead while the rest of park road shopping center was slammed on this Tuesday night. We got there at 7:45 and were told it closed at 8. Really? That is way too early.   I ordered the chicken salad sandwich with rice pilaf. My friend ordered shrimp kebabs. The food was really good, but the service was not. The cashier was rude and seemed like she hated her life. We ate on the patio and at least 3 people came by and were shocked the restaurant was closed before 9. Not a good look for a new place!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "07NsmiFyWe-EVKI7vhv1Vw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Chicken salad sandwich with rice pilaf",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/07NsmiFyWe-EVKI7vhv1Vw/o.jpg"
      }
    ],
    "user_id": "xxbqhvmt8bShSkeqy1cFFg"
  },
  "CwuLrthebn9OocFHLs0vZg": {
    "date": "3/1/2018",
    "text": "New favorite! My fiance and I stopped by for lunch and were greeted with a friendly attendant, a modern feel, and the smell of wood grilled meats I got the Turkey Crunch and mac and cheese, which my fiance was more than happy to finish for me when I was done..we both LOVED IT. The white sauce is great so make sure to dip your sandwich in it! He got the braise pork plate which he enjoyed as well.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4AMb_beObu7pYcGGB01JOQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Turkey crunch with mac and cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4AMb_beObu7pYcGGB01JOQ/o.jpg"
      }
    ],
    "user_id": "0TGf4locbS-G2voMDNmfcw"
  },
  "Qd751Dn8pCgxFgIjtiZFCQ": {
    "date": "1/4/2018",
    "text": "I walked past this place a few times <a href=\"/redir?url=http%3A%2F%2Fas.it&s=a23f1d86572ff0b83b3b180f14e48328f71c2b31b958e3617332967a5caf3320\" target=\"_blank\" rel=\"nofollow\">as.it</a> was being built and the name Urban Cookhouse, intrigued me. So I couldn't wait to see.what exactly n this eatery would offer. I thought it was going to be some fancy place that offered fresh and local eats. Much to my surprise it's very fast casual dining and the food is good. The menu isn't expansive, which is great for someone like me who can be indecisive when it comes to choosing a great meal. After perusing the menu, I landed on the lime marinated steak. I substituted the rice for the hot cheese pasta aka mac and cheese and the salad for the sauteed veggies. Everything was delicious. I'm pretty skeptical about mac and cheese are restaurants but their mac and cheese was really cheese (like the baked kind, not the velveeta cheesy kind) and had good flavor. The steak was already sliced when it came on the plate and it was flavorful and tender. The roasted veggies had carrots, broccoli, mushrooms, onions and zucchini and were well seasoned. The dish came with a warm orange roll which was delicious. The warm orange roll is as if a croissant and yeast roll had a baby. Overall it was a great dining experience and I will be back to try other items on their menu.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "DjEE3dKP2SIHRew7j04X4A",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. The lime marinated steak with the hot cheese pasta and roasted veggies with a warm orange roll.",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/DjEE3dKP2SIHRew7j04X4A/o.jpg"
      },
      {
        "img_id": "I5iII39nziiyEmegTCUQlg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/I5iII39nziiyEmegTCUQlg/o.jpg"
      },
      {
        "img_id": "IwnPjG-cPiaPsVnwc-iOcg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/IwnPjG-cPiaPsVnwc-iOcg/o.jpg"
      }
    ],
    "user_id": "yiKkxcuQdB04PVUW7OgtNw"
  },
  "7vMLs3eXnkCTDqv9gGvTgA": {
    "date": "4/28/2018",
    "text": "This place is amazing....   everything is cooked on a Big Green Egg, they've got a great selection of healthy eats as well!  Local beer  Big patio  $10 plates, you've got to try it.  My favorite is the Lime Marinated Steak and Rice (I ask for some of their White BBQ on the side) and the White BBQ Sandwich.   If you're up for dessert, try the skillet cookie with ice cream.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "jXa84PRtBZ50XD0a77YovA"
  },
  "_uMwZWFi04Nx0IdZTDv6HA": {
    "date": "6/13/2018",
    "text": "We decided to try something new today and have it postmate'd to us.  Their online menu looked good and the pictures from google reviews also looked good so we thought this would be a winner... we were wrong :-(  They got our order wrong so one (of our three) lunchers got no lunch because it was not what she ordered.  My order was correct, but it still left a lot to be desired.  i ordered a very safe selection of the grilled chicken meal with salad, rice and the little orange roll.  I figured how hard could that be?  The grilled chicken arrived chopped up, wrapped in tin foil, and  sitting inside my salad.  The salad was basic, nothing at all special.  Unfortunately, the chicken was also basic, dry, and without much flavor at all.  My goal was not to put it in my salad, my goal was to cut it up and eat it like adults do.  The rice I got was just plain, simple rice that lacked flavor... just bleh.  The little orange roll thing that they rave about was also just kinda bleh.  It was tougher than I'd anticipated, heavy and sugary with a faint hint of orange.  All of this was average at best, but the real shocker was their choice in carry out containers.  The weight of the food inside is literally too much for the container so the moment I touched it to lift it from the bag it was delivered in, it started ripping and denting and losing it's structural integrity... so much that I had to immediately set it back down or it would have bent and my food would've fallen on the floor.  Upon further inspection (because I simply couldn't believe how flimsy it was) it really appeared that the container used to be white and had been spray painted black?!?  I say this because the black paint was bubbly across the top, not smooth nor was it consistent all over the same container...  just weird and off putting.  If you can afford the rent in Park Road Shopping Center, then please up your carry out container game as the choice you made in no way accomplishes the goal it was produced to accomplish.  Nope - one time of this was enough for me, I won't be repeating this little debacle.",
    "rating": 2,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "AimaC_g4NsFihrqlUdRC7A",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Grilled chicken meal with salad, rice &amp;amp; orange roll.  Oh yeah- in the worlds flimsiest carry out container!  Fail.",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AimaC_g4NsFihrqlUdRC7A/o.jpg"
      }
    ],
    "user_id": "2l8rUzap_-dy3lVgYshOSA"
  },
  "2AiSikevwg2B1wNMsirQhg": {
    "date": "10/9/2017",
    "text": "Mixed feelings about this place it has potential but kinda falls short right now. I agree with the one review that wondered why the Green Eggs weren't more visible, I too was expecting to see them cooking but they aren't really visible, not a big deal but it would be cool if you could see them.   On to the food. I ordered the Urban Cowboy. The flavor was very good. However, everyone at the table agreed it is a very small sandwich. Taking the bun off revealed they are extremely skimpy on the meat. The last one and a half inches of the already small bun didn't have any meat at all, just bare bread. Although this sandwich tastes good, for $10 bucks I probably wouldn't get it again, there's just not much there.   I was able to try the ribs, they were really good, tender with a good smoke flavor. One of our party ordered the BALT. they said it was ok but commented on how there was supposed to be avocado on it and there wasn't. Another ordered The Cookhouse wrap and said it was a little bland.   Overall we left not overly impressed.  It's not bad but it's not great either. Small portions for the price. That being said, it's a place I would try again in a few months after they work out the kinks and hopefully they will pay attention to what people are saying.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "0G40sfRx04rxUMWURAJY4A"
  },
  "0Q9HQh3_QgIeO1e4jSpsAA": {
    "date": "12/3/2017",
    "text": "Our family are a big fan of UC, the food is healthy and tastes delicious! It's a great addition to our neighborhood.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "QzaOntUUM8dTFEts2kWAeA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/QzaOntUUM8dTFEts2kWAeA/o.jpg"
      }
    ],
    "user_id": "epO_24eYU48Y7U2YXY5g-Q"
  },
  "rhBd4yedf36viLBHj0R1YA": {
    "date": "10/18/2017",
    "text": "Stopped by today while working for a late lunch and was pleasantly surprised- this place is amazing! I had a chicken sandwich which had bacon and melted cheese. The sandwich; from bacon to bun was perfection! Chicken perfectly prepared and the best bacon I have ever had. I was instantly addicted to this sandwich and will most certainly be back.  Service and atmosphere was top notch as well. My server was by the name of Megan and she rocked also!  Go to UC!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 1
    },
    "photos": [],
    "user_id": "RJ5_y3AK6TU3XYFunn8pWg"
  },
  "ggNQTI7vzwwn81VXx8Zqyw": {
    "date": "5/28/2018",
    "text": "Had the B.L.A.T. Perfectly toasted & a great amount of avocado. Broccoli salad and strawberry lemonade completed it all! Delicious!! Can't wait to go back and try more things.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FZqmwHERFHM9hH1gp-um_w"
  },
  "tQWa_AF1H6hxnperW_uWsQ": {
    "date": "5/26/2018",
    "text": "This place was awesome and I'd definitely recommend it. Stopped here for lunch and I had the Cuban sandwich on Texas toast with side of broccoli salad. My husband had the white BBQ chicken sandwich with the broccoli salad. The broccoli salad was to die for, it had broccoli, half grapes, sunflower seeds, onion and sauce. You can even buy tubs of the broccoli salad to take home, if we weren't on vacation we would have. Both the sandwiches were delicious. You order at the counter and then they bring the food to you and we also sat outside.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "6LECIukW6Ndaw4BAYjZ3CA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Cuban sandwich with side of broccoli salad",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/6LECIukW6Ndaw4BAYjZ3CA/o.jpg"
      }
    ],
    "user_id": "mbdJQIQN28MnRoSwPQZ22Q"
  },
  "47RUZ3Ps5laDXpWjTWdD7w": {
    "date": "4/16/2018",
    "text": "Nice patio, so we were  surprised at how dead it was for lunch. Food and service were not terrible or outstanding-pretty good. Decent prices and will  come back to try some more options. Suggestion for BALT, garlic Texas Toast would amp the flavor for this sandwich.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "6tlC85J2zsHpnrtHp3qX6Q"
  },
  "S0IED3L_z3H33yH2bWeuSA": {
    "date": "10/13/2017",
    "text": "Stopped by Urban Cookhouse for a quick lunch with my mom on a rainy Thursday. There we a few customers ahead of us in line, but the line moved very expediently. The menu is simple with selections like sandwiches, larger plates, and salads. I opted for the Buffalo Chicken Wrap (my lunchtime favorite) and my mom got the BALT.   The service is super friendly, and I love the fact that the walls are lined with local items like hot sauce and honey for purchase. The fact that this places focuses on supporting local purveyors puts it very high on my \"return\" list. The interior is a bit cold both design wise and in temperature, but we found the outdoor patio to be very comfortable.   The food was absolutely delicious, and we both opted for the mac and cheese side. Cooking the meat on the Big Green Egg makes it incredibly tender, and really stole the show in what would be otherwise a fairly simple lunch selection.   I look forward to returning and trying even more on the menu (or maybe one of those take-home meals!)",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "SMyxd9W_KP_8sj_UbCO3VA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/SMyxd9W_KP_8sj_UbCO3VA/o.jpg"
      }
    ],
    "user_id": "_pOEDJODvaBQwr_KMdG0LQ"
  },
  "2bcracTv_MTTVnoT6QVs-g": {
    "date": "7/17/2019",
    "text": "Disappointed! After reading all the good reviews, I had high expectations for a new favorite. I had the \"Down Home\" plate. The smoked turkey was too dry to eat. The ham was also overcooked but edible. The grilled pineapple was delicious and the broccoli salad awesome! The warm orange roll was delicious and different. The cheddar pasta (mac 'n cheese) was nothing noteworthy. First visit so I don't know if UC typically only has one employee to take orders, run the food, and bus the tables, refill drinks - basically do everything but cook. Chef salad had generous toppings and came with the delish warm orange roll. I will probably try them again but will stay away from the turkey for sure!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "HqA3I3lg2DIEenzwqy47QA"
  },
  "jqZemqfsyBQ3R-TOU1_j3A": {
    "date": "5/13/2019",
    "text": "This restaurant is great. The service is wonderful, they are always so nice. I feel like I can always get a fairly healthy meal. They have a few kids activities such as games, some inside, some outside. The \"orange rolls\" are very good. They are similar to a cinnamon bun, but orange flavored. Because the chicken is cooked on the \"Green Egg\" it doesn't dry out. They have a variety of options from salads to sandwiches.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "MvTsDVspP-O1chbd91eEZw"
  },
  "lcII_oDMQLMQ484lEB_V9w": {
    "date": "9/5/2017",
    "text": "They cook with the Big Green Egg.  Cool.  But, unless you visit the restroom you'll never see 'em.  They're behind the glass window down the hall and in the kitchen.  What?!$?  If this is your hook, why hide it?  Instead, I was expecting something akin to a Japanese steakhouse all ablaze and smoky with my nose making decisions about what to eat.  But nope . . . is this just another joint cranking out OK food at premium prices?  Both our entrees (shrimp kabob and Buffalo chicken wrap) were overcooked and dry.  The seasonings amped up the flavor, but without it . . . boring.  The broccoli salad was moist and crunchy albeit the dressing was pretty sweet.  For two adults each having either a beer ($5) or wine ($6)  . . . reasonable prices on beverages, and a child portion of fluffer-nutter sandwich (awesome), our ticket was just over $38.00.  I think it was steep for what we received.   Their website states a commitment to \"Buy Local, Eat Urban\" ingredients.  Did they really buy the chicken at the farm down the road?  Which local farmer's market do they sponsor and purchase ingredients?  Tell me . . . I want to know.  I appreciate commitment to our local farms and will happily \"pay up\" for the consideration.  Urban Cookhouse has so much competition within walking distance, I say roll those damn cookers out and start grilling your asses off; especially, in the newly crowned high-rent district of Park Road Shopping Center.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 4,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "AGnjUgZLw3gcPt4g90TyRA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Buffalo chicken wrap with broccoli salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/AGnjUgZLw3gcPt4g90TyRA/o.jpg"
      }
    ],
    "user_id": "CjHWRUKXhhley9N9NLS07Q"
  },
  "NaOQ-UebfSGY1Ph6IJjLlA": {
    "date": "9/21/2017",
    "text": "First of all-- they gave me free wine (or beer)!   Now that I have your attention, let me back up... Walked in and it was an open and airy, loved the decor and focus on eating local and eating urban. The wood details, including a table shaped like NC gave this place a cool vibe. I was greeted by several staff members and was offered a sample of their strawberry milkshake. Yum.   While I waited for my friend to join me, I looked over the menu and decided to sit at a table and wait. A staff member offered me a complimentary adult beverage (wine or beer). When my friend arrived we went up to the counter to order, I ordered a local mix  and the half baked cookie and strawberry lemonade.   When my friends food arrived, I realized they were bringing me a wrap instead of salad, so I let them know I wanted the salad and they fixed my order. It did take a while for my salad to come out, but the manager and staff apologized and even gave me a coupon for my next meal to be free.   The salad was delicious. I added grilled chicken and it wasn't bland chicken like usual, it was seasoned and yummy.   The strawberry lemonade was delicious as was the half baked cookie. It did seem a bit pricey for both of those, but still yummy.   The staff took good care of us and refilled our drinks several times during our meal.   UPDATE: came for a second visit to use my coupon and found the staff very hospitable. Food special included pork tacos that were quite good.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "nO0auL7V9Uihc9N08rx8-A",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Pork tacos on special",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/nO0auL7V9Uihc9N08rx8-A/o.jpg"
      }
    ],
    "user_id": "fPxE0VgahKU0Xh6YQt2-Kw"
  },
  "HX38DvPw3xZt-jSRLlCZ1g": {
    "date": "4/11/2018",
    "text": "So glad we got to try this place out for dinner last night. We had salads.. I tried the summer berry salad with chicken salad which was AMAZING! My fiance had the steak salad, in which he said the steak was a little too smoky for him.. but we both loved the orange rolls that are served with the salads. We had ordered nachos to share and there was a mix up so we didn't get them until after we finished our salads, but an employee made up for it by making us a \"half baked cookie\" skillet... TOO DELICIOUS. can't wait to go back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "aB5qOkmN3tYmxj01TMjhrA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/aB5qOkmN3tYmxj01TMjhrA/o.jpg"
      },
      {
        "img_id": "iOmMcXjMdEySd6Uy45HZ8w",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/iOmMcXjMdEySd6Uy45HZ8w/o.jpg"
      }
    ],
    "user_id": "PaJxBAuTkeoWIs4sFkcsrw"
  },
  "tir5QxAHKqjcYOfe-8m94A": {
    "date": "4/5/2018",
    "text": "I had dinner here on a Tuesday night, and the restaurant was dead.... I've heard it's more of a lunch spot anyway. The employees were friendly and helpful as I tried to decide what to order my first time there. I decided on the nachos (a friend had recommend them) and they were fine. It was a huge portion, and I could not eat them all!  I'm awarding 3 stars because the place was just all around average, except for the super helpful staff. The food was fine, but not great. The decor was bland. This place is fine, but not somewhere I'm dying to make it back too.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TKwzreBMGFbu9zN6taeVLA"
  },
  "5uVZICC0kirgieR6_2hzgg": {
    "date": "3/7/2018",
    "text": "Was in the area for work and decided to try this place out based on its proximity to where I was and the yelp reviews.   The food was really good! I got the shrimp & squash kabob plate which was served with a side salad and rice pilaf. The rice pilaf was made with cilantro and a lime on the side, which totally complimented the seasoning on the shrimp and squash. The dressing was a little sweet, but complimented the sharp cheddar on the salad. The only thing I wasn't crazy about was the orange roll that's served with the plate. It was pretty good, and would probably be great on its own, but I didn't love it with this particular dish. I would've preferred a plain or buttered roll.   My only other complaint (and it's a tiny one), the seating is the most comfortable. The \"booths\" are made of these little benches attached to the wall...they're so close to the wall that you have to sit sit straight up, but they're not long enough to scoot away from the wall.   I'd definitely come back if in the area again.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "ksygzto-Wzl4KqM3GZUlaA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ksygzto-Wzl4KqM3GZUlaA/o.jpg"
      }
    ],
    "user_id": "4F_1oO_r5dBQFw8K6H1BNQ"
  },
  "d08DSjnMeBLIXOS6uwJ9PQ": {
    "date": "7/3/2017",
    "text": "I stopped in for lunch after seeing so many positive reviews.   I made it right before the lunch rush and chose the Local Mix wrap and rice as my side.   Everyone was super friendly and helpful and the ordering process is easy enough. You choose your entree they give you a number and bring it to the table.   My food arrived in no time. The wrap was a little messy and I was surprised that it didn't come with a side sauce or dressing. I asked the waitress for some of the honey mustard vinaigrette dressing and that was delicious.   The wrap for me was just okay. I love all the ingredients that come in it chicken, bacon, cheese and corn just to name a few. But the flavors for me were just all pretty average. The rice was seasoned well, but a little salty. I'd opt for a different side next time.   Overall, just okay in my book. I do want to come back and try a salad. Since I loved the dressing so much. Stay tuned for an update.",
    "rating": 3,
    "rated": {
      "funny": 2,
      "useful": 7,
      "cool": 4
    },
    "photos": [
      {
        "img_id": "VFMhplzJ1hTsheqC0ut4sA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Local Mix Wrap and Rice",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/VFMhplzJ1hTsheqC0ut4sA/o.jpg"
      }
    ],
    "user_id": "oIxsWOWytMmV4bf_ffo01w"
  },
  "LKumLT1HmKdNh1eP0LcK3g": {
    "date": "2/5/2018",
    "text": "Tried the Urban Cowboy steak sandwich, Hot Cheddar Pasta and Roasted Vegetables. The steak sandwich fulfilled the craving I was having that brought me here in the first place. Great flavor but the proportion of meat to bread seemed way off and I was left with a lot of soggy bread with no filling. The cheddar pasta was good but not particularly worth the calories. The roasted vegetables were on point. That is now my side when I come back. Piping hot and great flavor. Customer service was very good and the place seemed spacious and clean. Now that I finally tried this place out after forgetting all about it, I will be back to try some of the other stuff. So far, so good though.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ntq_6n5SpkZGmNHXnEmlNQ"
  },
  "tHMczFD2l-CrmUZ4UBewDA": {
    "date": "7/10/2018",
    "text": "This is the corner restaurant next to Burton's Grill.  Every time I go to Burton's, I make a mental note to check out the Urban Cookhouse. Well, today, my friend Toni and I, checked it out for four and a half hours. We ordered at the counter and the most hysterical guy rang the register and took our order.  He was very friendly and accommodating and amusing!   We went outside on the patio and had a fabulous meal. The lunch conversation was suitable for NPR.  The weather was picture perfect and with the exception of an annoying fly or two, it was spectacular sitting outside. I had the plated chicken dish with a side of mixed vegetables and a salad.  The bowl of mixed vegetables was just not your average bowl of mixed vegetables. It was a WOW dish!   As everyone knows about this place, the plate came with an orange muffin kind of treat which caused guilty pleasure. All of the food was very scrumptious and I will be eager to return to bite down on more.  My only constructive advice is that the porch service could have been a little better. We were there for over four hours and saw a server outside only once or twice. (Perhaps she thought we had overextended our time??)  I am assuming that the servers were paying more attention to inside customers, although until I sit inside, I can't really comment.   I WILL say that people were friendly, the food was amazing, the menu offered a great selection, and the vibe was something that I could dig.   Maybe when Arlene is back in town, I will take her to this restaurant to see if she likes it as much as I did.",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 5,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "5iagTrS7rUiF1a_n7LCWTQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/5iagTrS7rUiF1a_n7LCWTQ/o.jpg"
      },
      {
        "img_id": "pdn0JLIDkwlHXABV2TkezQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/pdn0JLIDkwlHXABV2TkezQ/o.jpg"
      },
      {
        "img_id": "W78AT8sd5KV_WDLCjJpD1w",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/W78AT8sd5KV_WDLCjJpD1w/o.jpg"
      }
    ],
    "user_id": "qvPTw-ArHYI1n1n0cw3S7A"
  },
  "zlWm3n00ZiOJhBugwNcBqg": {
    "date": "1/22/2018",
    "text": "As a mostly-vegetarian going to a meat-centric restaurant, I was a little worried that I wouldn't find anything to eat, but I was very wrong. I had a few good options and wound up ordering the veggie quesadilla. Most places where you order a veggie quesadilla, it comes with some cheese and maybe some beans and peppers... not this place! It comes LOADED with veggies: everything from broccoli to mushrooms! It was a large portion too and I left feeling almost too full. It came with all the fixins included: guac, sour cream, and salsa.   I was very impressed with the presentation of the food, the cleanliness of the restaurant, and attentive staff who checked on our waters even though this is an order and sit kinda place. Maybe it was because it was a weekend, but this place wasn't busy at all at lunchtime. I would definitely stop back here again. They also have beer and wine for a later meal :)",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "azpZPrb02xWYI_S0MYfIGA"
  },
  "F9o-WbvoFnoK8Uqqnv0vwA": {
    "date": "9/5/2018",
    "text": "This is a regular lunch location with my colleagues.  We first stumbled upon this place since other restaurants was too crowded then it becomes our goto lunch spot.  I always got the lemon marinated steak plate.  You get grilled steak, rice, salad and a sweet roll for $10.  That is not a bad price for lunch around this area.  The steak always cook medium therefore it's very tender n juicy.  Great service, one of my colleagues's steak was over cooked and the manager exchanged for a new plate.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wyHYRf5m_qxz0eTgD1XR0g"
  },
  "D_umy6McUAyRXPbbblm8Iw": {
    "date": "8/5/2017",
    "text": "I almost want to give it 4 stars based on the service of LouAnn & Tyler!  They were both very nice and super accommodating.  It's my first time here, but I know I'll be back based on this first visit, so maybe another star soon!  I had the local (can't remember the brewery) watermelon lager.  I didn't really get the watermelon.  So I wouldn't get that again.  They do have a small selection of local beers and for a good sandwich shop that's enough.  They have a great selection of wine and I found a new \"current crush\"... The Floriography Rose.  So good.  I had already ordered the beer, but I appreciated the taste LouAnn offered me.  I ordered the El Cubano to go, with a side of cheddar pasta.  the pasta was ok.  Shell pasta, decent - a bit overdone, but it's pasta and cheddar cheese...What's not to love?  I added a little salt, not much.  The cuban sandwich had a southern spin with the white toast, but since I'm from the South and I love white bread  I'm ok with it.  In Miami I remember the long, thin crispy, soft bread hot-pressed with the ham, pork, swiss cheese, mustard and pickles for a thin, rich bite...such a good memory and I'm always looking for that, but...  I'll take Urban Cookhouse's version as a close second!  First, the charcoal-grilled meat is in the top 5 for grilled meat in the city.  Second, the flavors are there.  The yellow mustard, the crispy dill pickle and a lot of juicy, flavorful ham & pork.  So good and I will be back for that, but I'm excited to try other things as well.  I'm not a fan of seeing into the kitchen and it seems as if there is difficulty in communication between the kitchen staff and servers/managers so I hope that doesn't translate into errors on orders.  They have free-wifi which is great.  The music is background; pandora or something like that...it changes, but it's mostly older styles like 80's or MoTown.  I like the layout, plenty of inside space and a great outside patio.  I'm really happy for this addition to Park Road Shopping Center options and I look forward to visiting again!",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "LGiLN7cZquD1TWkWnZpgSw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Bottom of the bin smoked pork makes for a very messy toast sandwich.  The first two I had weren&amp;#39;t this mushy.",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/LGiLN7cZquD1TWkWnZpgSw/o.jpg"
      },
      {
        "img_id": "QuF7Tb_JIdt61XFzkAGD5Q",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/QuF7Tb_JIdt61XFzkAGD5Q/o.jpg"
      },
      {
        "img_id": "H4Vd4D31cOsG28J1YH_wEQ",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/H4Vd4D31cOsG28J1YH_wEQ/o.jpg"
      }
    ],
    "user_id": "ciXjBfJrAEteIKpzZg4I9g"
  },
  "P8xmwgmUuAq4DCS6Bnk9LA": {
    "date": "7/14/2017",
    "text": "\"Park Road Shopping center needs more restaurants\"...said no one ever.  Yet they managed to cram one more in!  Urban Cookhouse is a casual eatery next to the fancier Burton's.  It's one of those places where you order at the counter, they give you a number card and bring you your food.  I like it...it's simple.  I met a friend here for dinner.  The menu looked pretty good, with wraps, salads, etc.  I went for a wrap that had finely chopped turkey and sliced ham.  It was pretty good.  I also got this with a side of the broccoli salad (looked better than it tasted...was a little bland).  My friend got a salad and really enjoyed it.  Prices were pretty decent.  There were two big winners at Urban Cookhouse.  First, the Strawberry Lemonade rivals the one at Wendy's (which is awesome, by the way...like I didn't think i would find anything as good until my visit to UC).  Second, the service was really good.  While we were sitting, the staff came around a couple of times clearing empty dishes and asking if we wanted any refills.  I think this is a great place to go for lunch on the weekend.  Seems good for groups or families.",
    "rating": 3,
    "rated": {
      "funny": 1,
      "useful": 0,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "RCmLgj6FvzOAUF4hdcCrkA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Chicken salad",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/RCmLgj6FvzOAUF4hdcCrkA/o.jpg"
      },
      {
        "img_id": "AvPgQiI7UA68VGeultNLiA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Turkey cookhouse wrap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/AvPgQiI7UA68VGeultNLiA/o.jpg"
      }
    ],
    "user_id": "g4CEweu8TJo9NRvbtd4zEQ"
  },
  "yDgRH5w4CTDGsdewHc9LmQ": {
    "date": "4/1/2019",
    "text": "I like how they greet you as you come in and help you if you can't decide. I love getting my orders to go. They are friendly and fast and I can bring it to work and eat before I clock in. I love the urban cowboy sandwich . It is my favorite.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "EU-os_yAcGIQGDsgC4Ecnw"
  },
  "Cv0QKcJA8zwtwd7uoXu99A": {
    "date": "7/16/2017",
    "text": "Urban Cookhouse is a new addition to my favorite shopping center off park road.  We went for Sunday lunch with my parents and sister and her fiance.    The service is 5 stars.  There were constantly members of the staff checking on us and refilling our drinks.  They even brought out sample milkshakes for us to try.  The staff was very friendly as well!  I'm torn on the number of stars to give for the reasons below.  My husbands food came out way before mine and my parents and sisters food came out when my husband and I had completed our meals.  This was awkward because we finished eating 10 minutes before everyone else.   We weren't told that the chicken entrees take a lot longer until after we received our food.    I got the berry good wrap.  My husband got the Cuban.  We both felt the exact same way about our food... it was good but nothing spectacular.  We got the roasted veggies as our side.  They were really good but a small portion.  My sister got the turkey crunch and felt the same way about her meal.    My parents both had the chicken entrees with rice and salad and really enjoyed then and said their meals were flavorful and good.    Maybe if we decide to come back we will go the entree route.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PNSuNdslwdKW2tGt9qWmOA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Berry wrap",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/PNSuNdslwdKW2tGt9qWmOA/o.jpg"
      },
      {
        "img_id": "S9gIbKWb-cj68EYaSuK3qA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Cuban",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/S9gIbKWb-cj68EYaSuK3qA/o.jpg"
      },
      {
        "img_id": "ZYXrJHNOHrs-0zSsnFKZKg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Roasted veggies",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/ZYXrJHNOHrs-0zSsnFKZKg/o.jpg"
      }
    ],
    "user_id": "mKN1OZzycnB7E1MS0Dby6g"
  },
  "srt9Oz9CPFHFwCi5iZsIkA": {
    "date": "1/28/2019",
    "text": "Rarely do I leave a restaurant, and immediately feel I need to write a review. Especially a fast casual joint! We popped in here for dinner after doing some shopping on Park Road. I had the lime steak with rice, and salad. It was cooked soo well, nice and tender and full of flavor. Oh, and it's $10! The two of us ate for $25, with drinks. Mine also came with this divine orange roll that's like a better version of a cinnamon roll. Every person who came into contact with us was friendly and warm. The gentleman who was working the dining room had a big personality and seemed to connect with every single table. We watched him work his magic with the many children dining tonight, even bringing an entire bowl of grapes to a child who wanted nothing to do with his fruit bowl. Clearly they care about the customers experience, which is nice to see in any restaurant. Thanks for turning around a dreary Monday with your positivity, we can't wait to come back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "PDwBN2Yjh2P4qgbgM6Jqtg"
  },
  "psCeYR3AgZxAUQjFywxmRQ": {
    "date": "3/5/2019",
    "text": "This place is fantastic.  I've visited twice in less than 5 days and the food is delicious, the service is stellar, and the place has a casual, fresh vibe.  The menu covers a variety of food types and special food preferences (vegetarian, gluten free) and the food is delish.  I would highly recommend giving this place a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZzsSmY0AcTD5NR0JuH-eSA"
  },
  "z5bKf7WsF1zJ7OmzTQeimw": {
    "date": "3/16/2019",
    "text": "These individuals are astounding, regardless of whether we have them provide food our occasions at Myers and Chapman ahead of time or call them at the most recent hour, they truly do everything to get it going. The sustenance is superb, the administration speedy, so you can get in and out before long and it's in every case new! Love, Love the staff there, you can rely upon them! Love Crystal, and the Crew at Urban Cookhouse on Park Road! Amazing Place!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "RQopw32K3Aq1gJL-BWlkNg"
  },
  "2wQ0-FpxkUIz7D66Yew2lA": {
    "date": "8/5/2019",
    "text": "This food is affordable and GOOD! I love the atmosphere of this place and the menu is simple and good. It's across town but i do love this place. My favorite is the steak with a salad and rice.  The pasta is good but it is not Macaroni & Cheese (big difference). The last time i was there i did want a dessert and they said it was unavailable, i was a little disappointed that there wasn't any complimentary or \"come back and see us\" but it ended up being okay! This place is great for families.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "beTC60aV9LYCdnvjLos-bw"
  },
  "HGq6Q5Giy_9u7vCj0LlqoA": {
    "date": "2/20/2019",
    "text": "I finally made it to Urban Cookhouse tonight and I can say they have some really good options. If you are watching what you eat, this place is perfect as they have a ton of tasty healthy options on the menu along with some \"regular\" items for those not so health conscious. Either way, you'll be able to find something here. It's located in park rd shopping center in which parking can get kinda crazy but most times it's ok.   I tried the shrimp kabobs and a cookhouse wrap tonight. The shrimp kabobs are grilled in a green egg so you know they are awesome and the seasonings used were full of flavor. The Cookhouse wrap is another great option as well for those wanting something light. Also, make sure to grab one of the strawberry drinks!! I'll be back soon.",
    "rating": 4,
    "rated": {
      "funny": 2,
      "useful": 2,
      "cool": 2
    },
    "photos": [],
    "user_id": "zox0bzk1LvmLb77fmcRjUQ"
  },
  "3KZ3kNFyN0ffD2r1YT3LPQ": {
    "date": "8/8/2019",
    "text": "So sorry my (ignorant first time) choices did not show off Urban to its very best advantage.  The food was very pretty as plated.  If only every menu item could be a \"rave.\"  The server was friendly and attentive and the restaurant was clean and attractive.  My companion said the mac and cheese was very good.  If inspired to return, will try a different selection.  Overall impression was positive and cheerful.  All the best to this nice restaurant in such a good location.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "7lv7Eokzl2Ih-HiZ-id3Kg"
  },
  "uSysf0eme-Wl0Bvv0b8mCw": {
    "date": "9/14/2018",
    "text": "Don't be fooled by the emptiness of this place! Urban Cookhouse is surprisingly good! Came here for a quick bite for dinner with a friend because we wanted to try something new and I am glad we ventured out!  Urban cookhouse is one of those casual, order at the counter type of restaurants, similar to a Panara bread or a Zoe's kitchen, except this place has some local beers on tap. The restaurant was very clean and had a cool decor. The service was also very friendly and helpful. Our food came pretty quickly, but we were also the only people in the restaurant.  We got the white bbq sandwich and the Cuban with the broccoli salad and cheddar pasta. The food was all around quite good! The quality of the food and the price makes this a place I would definitely return to and explore more of their menu. I hope more people will give this place a chance so it can stay in business! Very good indeed!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 3,
      "cool": 1
    },
    "photos": [
      {
        "img_id": "O7Cy16MqJnEajCfr0O-lDA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Half of a white bbq sandwich (front) and half of a Cuban (back)",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/O7Cy16MqJnEajCfr0O-lDA/o.jpg"
      }
    ],
    "user_id": "PI0nRf7P3-oVkkV1bs8pTg"
  },
  "L1CZw7Ye9rhNf1R_OdamfA": {
    "date": "2/6/2019",
    "text": "Just had lunch at urban cookhouse as a first time guest loved the patio it's sort of similar  set up to Zoey's Kitchen  or Panera where you go to the counter said me one brings your food. I ordered the cookhouse wrap with hot cheddar pasta it was delicious. Service was friendly without being pushy. I suggest you try it it won't disappoint.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "kgkCM4Z4QzPpP6k2snKiFw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/kgkCM4Z4QzPpP6k2snKiFw/o.jpg"
      }
    ],
    "user_id": "5Z5Pq5tMKzbXjATgXsKFFQ"
  },
  "RbX5yaMK9Ust1CjKpHkAGw": {
    "date": "7/16/2018",
    "text": "Checked out this place for lunch and it's like the Panera Bread of BBQ/smoked food. It's relatively uncomplicated to order, and the restaurant itself was very clean and inviting.   I had the chophouse wrap with roasted veggies, and I did wish that there was more meat in it, although it was still very filling. The bacon was cooked perfectly and the avocado was present throughout the wrap. It was nice to have that rather than some spots where the avocado is an afterthought. My husband had the Cuban with their Mac and cheese, and he loved his sandwich overall. They also have local craft beer and domestic beer, as well as coke products and their own lemonade concoctions, and their pint glasses are really fun!   Overall, it was good, and I would come back to try some of their other menu items!",
    "rating": 4,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [
      {
        "img_id": "ti8vGBpduZt-lmkQ_BMiAg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Table set up, loved the numbers on a pig!",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/ti8vGBpduZt-lmkQ_BMiAg/o.jpg"
      },
      {
        "img_id": "YJw6uzzWpMdh5oEOgXsU-g",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Golden Boy IPA",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/YJw6uzzWpMdh5oEOgXsU-g/o.jpg"
      },
      {
        "img_id": "LG3BmBInGRqaOqrM5th-og",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Chophouse wrap with veggies",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/LG3BmBInGRqaOqrM5th-og/o.jpg"
      }
    ],
    "user_id": "RBNPf_GF8dWlWPxWvkyJXw"
  },
  "atcS65tfTxGAhuQAGK49GA": {
    "date": "5/12/2018",
    "text": "Wow. I am so impressed. I have NEVER heard of this restaurant until I had a gf wanted to come here for lunch. The staff is super friendly and the restaurant is beautiful.   They have a great selection on the menu and it was hard to decide. I got the buffalo chicken wrap with cheese pasta and a sweet tea. We sat outside. The tea is soooo good. The wrap is delicious especially with the ranch and the macaroni is sooo cheesy and good. Someone came outside and offered us more refills on our drinks and and to see if we wanted to go boxes.   I can't wait to come back!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "HXg8jT6hyeUv-rxt1ssxjg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Shrimp salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/HXg8jT6hyeUv-rxt1ssxjg/o.jpg"
      },
      {
        "img_id": "CucjfhPfFPGGFMtdYZcE6A",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Buffalo chicken wrap and macaroni and cheese",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/CucjfhPfFPGGFMtdYZcE6A/o.jpg"
      }
    ],
    "user_id": "5CgjjDAic2-FAvCtiHpytA"
  },
  "ka_1_E2ZUKMQqHO6FbOBTA": {
    "date": "11/3/2018",
    "text": "All said this would be categorized as fast casual and not fast food.  I loved this place because you can get a great tasting and healthy meal for ten bucks and that is really hard to find these days.  But it's not just the value that Urban Cookhouse offers that keeps me going back, it is the fact that so few places in Charlotte this type of service where I can go order at a counter and have grilled chicken, rice, and vegetables on my plate in like 6 minutes and it tastes great.  I love this location but really wish they had one uptown so I could go more often but this type of  place is exactly what I'm looking for post workout or if I just want to feel good about what I eat while also looking forward to eating it.  The crew inside is also great and extremely helpful and the inside is beautiful so don't take it to go!  We want this place to stick around a while so give them your business!  Food:  9.5/10 Value: 10/10 Service:  10/10 ambiance:  10/10  fast casual",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "5IMFlMJa8y5IVuXX-53nGw"
  },
  "pKkAl_lpxRF0fZY9HnlFAQ": {
    "date": "5/18/2018",
    "text": "Walk up order your food , then they bring it to you. Inside & outside seating with a very small bar inside.   Was excited to try this place as a healthy option. It was good, but pricy for the size of the portions. I left still feeling hungry or not satisfied.   The freshness can be tasted. I got the veggie quesadilla, filled with veggies it did not come with a side, and it was a little over $9. I did craved a few more bites of something.  Hubby had the cookhouse wrap with a side of cheddar pasta (Mac & cheese) it was good but he was looking for a more filling meal.   2 beers & 2 small dinner was $32. We left to go find a small snack or dessert .",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "4lqjPzOepqWBLawTBCAuOw",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/4lqjPzOepqWBLawTBCAuOw/o.jpg"
      }
    ],
    "user_id": "FhqgZHUjzV6x9uYNs05Q5A"
  },
  "r7L8Yky0KcDbTAB6UauOfQ": {
    "date": "9/17/2018",
    "text": "The broccoli is AMAZING!! I had the chipotle braised pork. It was good. Very flavorful. Priced very reasonable. They are short staffed so the wait for food was a little while. I didn't mind but others did.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "VlcasgkqiTuPi-nVT7rEtw"
  },
  "U0MQ-7V6NlITfwiweu9UIA": {
    "date": "3/19/2019",
    "text": "So good.  I had the cookhouse wrap and veggies.  The veggies are amazing, nicely roasted... quick service, nice people.  You can get in and out for lunch.  Great healthy option!  Give them a try! I'll be back!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "yVM4jpsYLA75k-J1jE9vsA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. So good!  These vegetables are amazing",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/yVM4jpsYLA75k-J1jE9vsA/o.jpg"
      }
    ],
    "user_id": "rOhyDyMWN7ckYDNA4C-JDA"
  },
  "zRlbv7HfFLsN_ErlTzbNAQ": {
    "date": "6/4/2019",
    "text": "I need to start going here more often. I've been a few times but now I need to try everything on the menu. All the ingredients are SO fresh and the staff is incredible. I had the chicken quesadilla and it was on point. I'll be back soon!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "dUfvqOTwhCF9iEcQGA8XoA"
  },
  "mUD-osi5dnNPAjWcKqm25w": {
    "date": "8/2/2018",
    "text": "I'm not sure why it's taken me so long to try this place, but I am so happy I finally went here! My two friends and I went for lunch based on you fellow Yelpers. We went on a Monday and there were only a few customers there. Parking isn't an issue and it's very easy to find.   The staff was super friendly and helpful making recommendations. I ordered the white BBQ chicken sandwich with the cheddar pasta (mac n cheese) and it was one of the best mac n cheese I've ever had. My friend got the chicken salad and fruit plate and it was loaded with fresh seasonal fruit. My other friend ordered a salad and it was loaded with toppings and came in a huge bowl. It's definitely worth the money.   They also have draft and bottled beer and wine and really good looking desserts, but I didn't have enough room to try them. I will definitely be back!",
    "rating": 5,
    "rated": {
      "funny": 1,
      "useful": 1,
      "cool": 2
    },
    "photos": [],
    "user_id": "M1iMJ-j8utBDWNgpTfqBzA"
  },
  "C0tfoet3CCgBBR6YppwIbQ": {
    "date": "1/22/2018",
    "text": "Pleasantly surprised by Urban Cookhouse! The Lady and I were here for a late lunch on a weekend and it was surprisingly empty - which made me raise an eyebrow for the quality of the food, especially for it being in Park Road Shopping Center. The space is beautiful and open with huge floor-to-ceiling windows and dark hardwood tables - their biggest table is in the shape of the state of NC. Gotta love all the nods to local stuff.   Food was brought out quickly (it's counter service), I ordered the Turkey Crunch sandwich with a side of the broccoli salad .The Turkey Crunch was wonderful - all flavors were perfect. The broccoli salad was sweet, but absolutely drenched (I feel like there was about 1/4 cup of the sweet-cream dressing left over when I picked out the pieces of broccoli). Too much for me, and it's a shame because the flavors were great. Just way too much of a good thing, you know?   Prices were decent for what we ordered, and we really enjoyed our experience. Devoured it all, which is always a good sign haha. Anyways, check out Urban Cookhouse for a quick lunch or any other meal! We'll definitely be back!",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "PKsoImcPcGfd84M5EhBZKA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Turkey crunch with broccoli salad. Absolutely delicious! And good light ;)",
        "img_link": "https://s3-media4.fl.yelpcdn.com/bphoto/PKsoImcPcGfd84M5EhBZKA/o.jpg"
      }
    ],
    "user_id": "rSQITvDnm1smzJl-3LJz4Q"
  },
  "NjyFpytAlCg393v_hx9kAw": {
    "date": "5/26/2019",
    "text": "I really like their salads.  I also love their kids meals and so do my kids. I like all the fun stuff they have for kids why we wait for our food to come up.  Definitely my favorite place to come when I don't want to cook dinner and my husband's out of town kids in tow.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Ssp9Q3TycrB1YwasllqZEQ"
  },
  "caURE-AF_XZbsIgKDd6oyg": {
    "date": "6/18/2018",
    "text": "Definitely means what it says. It holds True to its name. This is a modern place with a relaxed vibe. I came on a Saturday night there was one family dinning outside. The place was empty but clean. Similar dinning as Panera bread, but eclectic. There is a shared parking lot with the shopping center so you park wherever you can. The prices are decent and customer service is okay. They have share games you can play while you wait for your food, while you dine, or to play afterwards. I got a salad with the steak add on. It was a nice portion of Steak. It was tasty and very filling. I think it's a great place for the community. Enjoy!",
    "rating": 4,
    "rated": {
      "funny": 4,
      "useful": 10,
      "cool": 10
    },
    "photos": [
      {
        "img_id": "0ruVwz6PCZJoVgE17uIOpA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/0ruVwz6PCZJoVgE17uIOpA/o.jpg"
      },
      {
        "img_id": "4ijy7vfXD2sfF7YvKZuMHA",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/4ijy7vfXD2sfF7YvKZuMHA/o.jpg"
      },
      {
        "img_id": "021wYxupIesCC1zoWgmf_g",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media3.fl.yelpcdn.com/bphoto/021wYxupIesCC1zoWgmf_g/o.jpg"
      }
    ],
    "user_id": "Wt-dSc-L33pKiQ4mdZv3nQ"
  },
  "Ms2dVSyQXZKOpHW_blcluQ": {
    "date": "5/21/2019",
    "text": "Friendly and attentive staff and great casual fast food. Highly recommend if you're looking for something quick and delicious in the area.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "Xi47-lbJnpHgChG6QELE4Q"
  },
  "hLQgj-4ws5D3QLhb2gUzbg": {
    "date": "12/12/2018",
    "text": "Delicious! Went for lunch time and the guy who took our order was very helpful and efficient. I ordered the buffalo chicken wrap and my date ordered the BALT then we each ate half. The iced tea was delicious and each of our sandwiches was SO good! The buffalo chicken wrap was not what I was anticipating but it was soooo delicious. The \"cheesy pasta\" (aka mac and cheese) was tasty too! Would definitely come back. Perfect for a quick lunch.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 1
    },
    "photos": [],
    "user_id": "rmhbB1LIfcZjxhUZ1E0BYQ"
  },
  "Do8eVeyuZxW4w2IxcER0Nw": {
    "date": "5/9/2019",
    "text": "Second visit on 5/8 and the shrimp and grits-oh my goodness!!! Delicious!!! We will definitely visit again! I think everyone that hasn't tried the restaurant-you're missing out!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "y9nwAJiIaLOzFodnulzGCA"
  },
  "morI9-NeHqRGld9yp9OmJQ": {
    "date": "11/18/2018",
    "text": "As you can see there is not much in the salad ! Not as pictured on line the 2nd photo .The lettuce pieces are too big and it just wasn't a good experience with this salad ! The chicken in the salad had no flavor and was very dry . The customer service was excellent!! I'd go back to try something else but salads aren't their strong suits! 2 stars for awesome customer service!",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [
      {
        "img_id": "O3_6YMhmzLxYye68F8GMPg",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States",
        "img_link": "https://s3-media1.fl.yelpcdn.com/bphoto/O3_6YMhmzLxYye68F8GMPg/o.jpg"
      },
      {
        "img_id": "61S0yo_1cEx4gRxeA5a_6g",
        "caption": "Photo of Urban Cookhouse - Charlotte, NC, United States. Mixed chicken salad",
        "img_link": "https://s3-media2.fl.yelpcdn.com/bphoto/61S0yo_1cEx4gRxeA5a_6g/o.jpg"
      }
    ],
    "user_id": "B69akrRM3xq4sExiC2oZ9g"
  },
  "mbjGzuYkhll-pjkqRyg8Jg": {
    "date": "6/26/2017",
    "text": "Both my wife and I loved the experience at Urban Cookhouse! Walking in your nose is hit with a glorious smell of meat smoking on the BGE, all the while you are greeted by a friendly employee. The ordering process was fairly simple as we ordered the Urban Cowboy and the Cuban Sandwich with broccoli salad, as well as cheddar pasta to complement our sandwiches. The price for the both of us to eat with drinks was relatively cheap considering the quality of the food. Everything we ate was absolutely delicious, and we plan on making this one of our go-to spots. Don't pay attention to the negative reviews! Highly recommend!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1sXxE85f7nfI3dACaNxmYw"
  },
  "-7nlJ5ae8TPRwv7P7CvT-w": {
    "date": "9/5/2017",
    "text": "I was so very pleased with the service that I was provided with here! A young lady named Jianna was very friendly and super helpful! She told me about the white BBQ and I get it almost every time I go!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "WCvSJwaUnBLsInr9bqGJqw"
  },
  "bqOW-zCjIe1jFfhLKu7IZQ": {
    "date": "2/4/2018",
    "text": "One of the better quality fast casual spots. The urban cowboy sandwich is my fav... perfectly cooked with a great mix of flavors. The side broccoli is slightly sweet, very tasty. The pasta mac n cheese is just okay. The grilled pineapple and ham sandwiches tasted pretty good but portion size was on the smaller side.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "k6dwrom-jxcSThlq3aizyg"
  },
  "YnzY7-Ha7YKI8ljouqCULQ": {
    "date": "6/23/2017",
    "text": "This is the second urban cookhouse I've been to.  I agree that the food and service is good but I thought portions were small for the price paid and that there were not enough options on the menu. I was looking for a burger cooked on the BGE and sweet potato fries.  I did enjoy the outside seating and music being played over their sound system.  I'll keep my eyes open and check back every now and then.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "UhXEVEvdjw2FRrGUugSuwQ"
  },
  "FfGsTdzKUs7RDHW8-zbTRw": {
    "date": "8/24/2017",
    "text": "Meh. The broccoli salad was good. The Cuban sandwich was a disgrace - served on toasted Merita sandwich bread. Really!? Cool atmosphere so I'd give it another try.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "nsyxhtD8tALWpS8vDh4F_g"
  },
  "7y61oBdTVMd2maJ523S1yQ": {
    "date": "9/23/2017",
    "text": "Make URBAN COOKHOUSE a good option to all the franchise flavorless food. A nice simple farm to table eatery who supports local business (a real cool hand made NC state table) with a open air dining option.  The food is original, the taste was good, and they have gluten free options (Thank you). The Pesto Manifesto Turkey Sandwich  was well balanced  and Broccoli salad was awesome. The delightful Orange roll  was almost as sweet as  smiling staff member Jianna (hope that's spelled right). The will let u sample take advantage of it.  It's a nice gem, it's all local from the food to the milkshake  to the wine and beer.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "wDfadmERYnC5menDE8dkUA"
  },
  "0Hl161Ui8wkfkK5sDZB9tA": {
    "date": "7/1/2017",
    "text": "I had the shrimp skewers and thought they were amazing! However, my friend got the chicken salad and thought it was bland, it looked rather bland in appearance too. The orange roll lived up to its expectation. It was a little pricey for an order at the counter, food brought to the table kind of place.  Lastly, it took a little long for food to be delivered for a restaurant that was only 75% full.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "1tvi_MPuo3goz7-pRDUPJA"
  },
  "AmH3tUjwfv18VdPiww8mbw": {
    "date": "2/4/2018",
    "text": "Today was the time my fiance and I came here! Got the grilled chicken with rice and salad (no picture because it was so delicious I ate it so fast) and my fiance got the white barbecue sandwich. We had the best experience and lunch! I recommend checking this place out! They also have local beer on draft and wine! This place gets 5 stars!!!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "tu-yamjLzlFX2mhERm4cFQ"
  },
  "zHOryTPWx_2FesU2ZMxl5Q": {
    "date": "2/25/2018",
    "text": "Great atmosphere, owner stopped by and talked to us and had a sample of their cookie skillet brought by for us to taste! Food was great I had a steak sandwich with peppers and onions I think it was the cowboy, steak was tender and flavorful! Cheddar pasta (Mac n' cheese) was really good too! Person area for this place in park rd shopping center. Great prices as well!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "91MxqHMpV8vZFe8G__sNCw"
  },
  "i-q352jJ6rDL8gmF9mjoSQ": {
    "date": "7/20/2017",
    "text": "Urban cookhouse is a casual little restaurant in the booming park rd shopping center. You order at the counter and food is brought to your table when ready. They have a patio, which would be perfect on a nice day. The staff is very friendly. The food is good and fresh... BUT the portions are small, really small for the price.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "vEgiG5hOWp5Eir96Z1StVw"
  },
  "CBBDVLrt4maW64AtjikT-g": {
    "date": "6/28/2017",
    "text": "I was ecstatic to finally eat at this long awaited restaurant. Me and a friend went there last Saturday for lunch a few days after they officially opened. I ordered the steak sandwich with sauteed vegetables and my friend ordered the chicken sandwich with the broccoli salad. When the sandwiches arrived my first thought was \"I didn't know these were sliders\". Well, they're not. They are just teeny tiny hogie buns. There was enough steak on there to satisfy me somewhat. The bowl of sauteed veggies was delicious but also a very small amount. My friend said his chicken was a little dry but he loved the broccoli salad. To summarize, the food wasn't bad but didn't do the Big Green Egg concept any favors. And we both left still hungry. At least the price somewhat reflects the tiny servings. I'm sure I will eat there again, trying something different.",
    "rating": 4,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "3QtgI2sJITkbKaXEGsyThw"
  },
  "ayfJiV4o-KalITRrL5EGTQ": {
    "date": "6/24/2017",
    "text": "The food was good but the portions were pretty small for the price being paid so I'm going to have to deduct down my rating. If based on food alone, I would give a 4.5, but based on the price/value ratio - it's more like a 3.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 2,
      "cool": 0
    },
    "photos": [],
    "user_id": "jsD4zlnS-3MOfJolOosdGg"
  },
  "mvP6QmEZeqEdwggY_W3uyg": {
    "date": "11/15/2017",
    "text": "If you haven't been to Urban Cookhouse yet, try it out! The manager and the staff were AWESOME in helping out with suggestions since it was my first visit with them.  I ended up with the shrimp skewers, rice pilaf, a side salad and an orange roll! Curious as to what an orange roll is? Well, it's like a roll from Texas Roadhouse met a Cinnamon Bun at Cinnabon...YUMMMM! I also was able to try the freshly baked chocolate chip cookie in a cast iron skillet with ice cream...and it did NOT disappoint! I'll definitely visit again!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FcwST33wzqZ4s1h7YOSmsg"
  },
  "ekHF8yTyc1J4AklzXibCEg": {
    "date": "9/14/2017",
    "text": "Well the honeymoon phase is over... I have loved this place since they opened. I've admired the great service, kind waitstaff as everyone was so eager to please and the food was always delicious! Tonight... not so much. It started with the person at register. She wasn't listening well to us and so I was concerned from the start. So drinks were missed (mistakes happen). We sit down and the food comes (partial). She didn't feel the need to bring the orange rolls out before even with the meal. She didn't get mine right -no apology on that or the orange rolls (mistakes happen but at least be nice). She comes out with rolls in a to-go box and my proper side. I then told her she may want to inform the chef that I found a nice bone in my chicken wrap. She looked at me funny and said ok and walked away. That's it! Again no apology. Usually someone walks around checking on drinks, see how everything turned out.. crickets. I'm so disappointed but overall not surprised as this happens often after a new place gets comfy. So In short, food is good but not great by any stretch like it was (maybe it was a bad night) but I'm hoping they step it up soon bc there is a lot of competition in park rd area and they need to stand out. We will definitely hesitate before returning.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "msnDNdHmYTkorIg5LthZSw"
  },
  "9DsBEkR6cKUESV6rr1jFQQ": {
    "date": "7/9/2017",
    "text": "Very friendly staff, easy to order at the counter and quick to get our food.  We both had chicken salad sandwich, I had roasted veggies and my husband had broccoli salad.  Every bite was delicious!  We'll be back soon to explore more of the menu",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "ZRCbX9IdQhTjzVrkQeX8zw"
  },
  "LlMMMOjUIEAdtWYH69GZtA": {
    "date": "6/30/2017",
    "text": "Awesome service, Awesome food, Awesome prices!  So delicious and easy and doesn't break the bank near southpark.  Don't forget to try the lemonade!",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "9fiYdaN_PerXL4a-YXf59g"
  },
  "IaDN21x7VHjL-9gbuIZAdA": {
    "date": "7/3/2017",
    "text": "Visited on their second day in business. Service was incredibly friendly and they were handing out samples galore so we could taste certain menu items. (We tasted a strawberry milkshake, the cookie dessert and the mac and cheese all on the house.) When we weren't sure what to order and were stuck between two items, they offered to let us taste a bit of one of them. The food was great (we had the chicken sandwich, broccoli salad, and lime-marinated steak) and loved them all. Definitely one of my new favorite spots in town.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "sM8MxHw7jglyKESN4qhyPQ"
  },
  "Y5dB4PL2rv6IrXWdb6DFMw": {
    "date": "7/13/2017",
    "text": "Decided to pick up a quick bite for me and the hubs. The staff is very friendly and will offer samples of sides to help that final decision. Hubs got the grilled ham sandwich (which were 3 sliders) and we both loved those...the mustard has a little bite, but cooled down with the sweetness of the pineapple. He got the hot cheddar pasta (which is basically Mac and cheese)...it's was ok-I think I can make better at home.  I had the cookhouse wrap & it was a little disappointing...I took a couple bites, but it was a lot of lettuce and I had to look for the meat...I think they forgot to put the bacon, ham, and turkey in it?!?! I ended up fining a few chopped up pieces, but it's very few.  The broccoli salad was a hit-very fresh tasting. I wish there was a way to give 3 1/2 stars b/c 2 out of the 4 items we had were delicious, the others were meh.  I would go again, just wouldn't be making any special trips.",
    "rating": 3,
    "rated": {
      "funny": 0,
      "useful": 1,
      "cool": 0
    },
    "photos": [],
    "user_id": "2bIRGg-WWrHB4suzIJOsUw"
  },
  "jE_Yn0JbB0X6YY0MDyEPog": {
    "date": "11/18/2017",
    "text": "Awesome! Stopped in for a work lunch & the Urban Cowboy sandwich did not disappoint. The emphasis on fresh ingredients & how the food was prepared was what brought us there. The tenderness & flavor of the meat cooked on the Big Green Egg was incredible & everyone at our table was very pleased with their selections. Service was great & loved the feel of the restaurant along with the outside dining which is where we enjoyed our meal. Been back for lunch & dinner several times and whether the Greens (you've got to try the Pepper Patch w/lime marinated steak), the Wood Fired Shrimp Kabobs, or the Pork Tacos (I think that was a daily special) they did not disappoint! Was so pleased with everything I had to try the Half Baked Cookie, oh yea, it's as good as it sounds and loved how it was served in its own mini cast iron skillet. Going to try the Take It To the House option next for a gathering we are having at home. Definitely would recommend giving this one a try.",
    "rating": 5,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "FsyKJi9ixLOercwHIcHyrA"
  },
  "nHjfNgVkA87BR4OpIMxI9w": {
    "date": "9/2/2017",
    "text": "Tried this place yesterday. Always up for trying something new. Was not impressed and I'm pretty easy to please. The food is just ok. With so many choices surrounding this restaurant, they need to bring their A game. The menu online seemed fun and well thought out. I ordered the marinated steak sandwich. Tasted good, but very sloppy presentation, steak was about 3/4\" thick and there were barely any ingredients on the sandwich. This is a small but crucial detail...slice the steak very thinly and stack it so a human can bite into it. The roll was mushy and damp (use a heartier roll!). Had to eat with fork and knife. The fruit salad I ordered as the side was not appetizing looking at all. Mostly just apples and some pieces of shredded orange. Where is the attention to quality? Lastly, we went up to get more water and heard the clerk say to all placing an order that there was a 30 minute wait for food. For a counter service place, that's unacceptable. Our food took about 25 minutes for one quesadilla and the steak sandwich. The lady taking orders was not a good front of house person. Either she was frazzled or just not suited to the position. Don't assume people don't want their receipt and briskly move onto the next in line. Ask. And say \"thank you\", not \"you're all set\". The servers however were fabulous and knew folks were getting impatient.",
    "rating": 2,
    "rated": {
      "funny": 0,
      "useful": 0,
      "cool": 0
    },
    "photos": [],
    "user_id": "TdO-WueeXNYMhlTqphsuHg"
  }
}